{
  "id": "17lb8fc",
  "subreddit": "ARFID",
  "author": "brrratmobile",
  "created_utc": 1698842541.0,
  "title": "does anyone else hate thanksgiving?",
  "selftext": "thanksgiving has always been my least favorite holiday because it revolves around so much food that i can’t eat. it’s just such an uncomfortable feeling sitting at the table with like pieces of bread and everyone trying to get you to eat foods you can’t eat. is there anything any of you do to make thanksgiving a little easier or more comfortable?",
  "url": "https://www.reddit.com/r/ARFID/comments/17lb8fc/does_anyone_else_hate_thanksgiving/",
  "score": 149,
  "num_comments": 76,
  "comments": [
    {
      "id": "k7d7750",
      "author": "None",
      "body": "I.fucking.hate.thanksgiving. Always have. First of all, why are we celebrating murder and genocide? Second WHY does it have to be all about food? Ughggg so many smells, and options, people bringing foods they made in their mysterious kitchens with their suspicious ingredients? Why are we all eating a turkey? What did they do to deserve this? Can I have some goldfish and can it be tomorrow now please. I hate it.",
      "created_utc": 1698847561.0,
      "score": 49,
      "context": []
    },
    {
      "id": "k7d5okq",
      "author": "zDEFEKT",
      "body": "It’s the worst holiday imaginable.  All about food.  None of which I want to eat.  Lots of family members to ask you why you aren’t eating the food.  Sucks.",
      "created_utc": 1698846916.0,
      "score": 32,
      "context": []
    },
    {
      "id": "k7d7hi6",
      "author": "Fr3nchT0astCrunch",
      "body": "I remember taking a cooking class in high school and we had a Thanksgiving unit where we made...well, a Thanksgiving dinner. \n\nThe teacher made a point of using it to get me to eat things I found uncomfortable, and refused to let me bring safe foods. Said I'd get a detention if I did. \n\nFortunately, I got extremely sick the day before. Obviously she didn't believe it, but doctor's notes don't lie.\n\nShe was quietly fired during my senior year after her ableism caught up to her. She made one comment too many and caused an outrage among an entire class of hers, who all reported her to the principal.",
      "created_utc": 1698847681.0,
      "score": 24,
      "context": []
    },
    {
      "id": "k7daqjn",
      "author": "jennybean2442",
      "body": "Yes! It's so anxiety inducing. Luckily, I work Thanksgiving. \n\nMy husband got a turkey bowl from Wawa yesterday to take to his friend. We were in my car. I told him that it smells like Thanksgiving. Not a good thing.",
      "created_utc": 1698849010.0,
      "score": 12,
      "context": []
    },
    {
      "id": "k7dgho9",
      "author": "No-Green-5339",
      "body": "Hate thanksgiving, just because it’s full of judgement. Ppl asking why I only have two or three things on my plate. Ppl making comments about my weight assuming it has a correlation with what I eat on that one particular day. The cooks constantly asking if you didn’t eat it because you thought it was nasty. Being judged because I couldn’t even finish the three things on my plate. Family questioning why I’m not taking a to go plate or even better forcing me to take a to go plate filled with food that I’ll immediately throw out upon arrival at my house.",
      "created_utc": 1698851275.0,
      "score": 13,
      "context": []
    },
    {
      "id": "k7cwtjv",
      "author": "mlo9109",
      "body": "Me! It wasn't something my family really did growing up. Canadian Thanksgiving falls during mom's birthday, so we celebrated that. Living in the states, it's like a 2nd Christmas. I don't get it. Also, as a vegetarian, it's not like I can really partake in the festivities anyway. Though, I do get Chinese takeout and put my Christmas tree up.",
      "created_utc": 1698842949.0,
      "score": 13,
      "context": []
    },
    {
      "id": "k7dafor",
      "author": "SirLlama123",
      "body": "hate it with a burning passion",
      "created_utc": 1698848887.0,
      "score": 11,
      "context": []
    },
    {
      "id": "k7dtcml",
      "author": "Bobbibeee",
      "body": "I used to HATE thanksgiving so so so much and all food for that matter when I was growing up (it’s hard for me to eat food that other people make) BUT now it’s my favorite holiday because I’m cooking the whole meal! I get to make things how I want. I even add in some things to the meal that aren’t typical that I know I’ll eat a lot like my favorite Mac and cheese and some peas haha  I’m not a turkey fan but my boyfriend loves it so I make it for him (: just remember that you can make whatever food you want for YOUR thanksgiving, no one has to know ;)",
      "created_utc": 1698856119.0,
      "score": 9,
      "context": []
    },
    {
      "id": "k7e0zi0",
      "author": "Littlerainbow02",
      "body": "How about making a safe food for yourself as part of the dinner and just eating that? That way you get to enjoy some delicious food too. If you are not hosting, you can bring a dish for others as a contribution too.",
      "created_utc": 1698858919.0,
      "score": 7,
      "context": []
    },
    {
      "id": "k7detu9",
      "author": "KenMixtape",
      "body": "The worst.",
      "created_utc": 1698850632.0,
      "score": 7,
      "context": []
    },
    {
      "id": "k7dj3kr",
      "author": "SnowFoxes8888",
      "body": "SO much. Between my food issues, my severe anxiety in general, agoraphobia and my parents being divorced Thanksgiving is the worst holiday. We didn't even really celebrate most of my life, my mom just made food and we all ate in our rooms lmao",
      "created_utc": 1698852280.0,
      "score": 7,
      "context": []
    },
    {
      "id": "k7es459",
      "author": "Happy_Flow826",
      "body": "So it's my child that has suspected arfid. And while we do encourage trying food and exposing him to food in non-eating ways (think sensory bins, or helping with the shopping, or helping make foods if he enjoys it), holidays aren't meant for that they're meant for enjoying time with family. So my mom for the past two years has made chicken nuggets and cheese sticks as part of the meal course for everyone to have. Like she full on gets the jumbo bags of them, cooks the nuggets the way he likes and everyone is welcome to them, and she unwraps the cheesesticks and puts them on a platter just like any other side. My moms husband, he's literally the best I swear, will make his freezer corn weeks ahead of time just to make sure it's available and always sets some aside for my son just to make sure he has it and it doesn't get eaten all up on Thanksgiving.",
      "created_utc": 1698868771.0,
      "score": 6,
      "context": []
    },
    {
      "id": "k7dmw9c",
      "author": "nomoreadminspls",
      "body": "I get the hate",
      "created_utc": 1698853732.0,
      "score": 4,
      "context": []
    },
    {
      "id": "k7e8yzu",
      "author": "ITriedSoHard419-68",
      "body": "I actually love thanksgiving. I’m lucky enough that I have several safe-foods that are traditionally served on thanksgiving (turkey, mashed potatoes, thanksgiving rolls) so it’s basically the closest thing I’ll ever experience to an all-you-can-eat buffet.",
      "created_utc": 1698861793.0,
      "score": 3,
      "context": []
    },
    {
      "id": "k7eef05",
      "author": "PsychologicalCase10",
      "body": "Thanksgiving is by far my least favorite holiday. Even when my birthday falls on Thanksgiving it’s an absolute nightmare, as I don’t like most of the food. Not only is there food I don’t like, but my family constantly bugs me about what I’m eating.",
      "created_utc": 1698863784.0,
      "score": 3,
      "context": []
    },
    {
      "id": "k7efamf",
      "author": "littleghool",
      "body": "Yes. But luckily I have a really supportive parent and SO. It's just us 3, and we all have things we like even if my plate is just dinner rolls and pie 😆",
      "created_utc": 1698864102.0,
      "score": 4,
      "context": []
    },
    {
      "id": "k7et24e",
      "author": "Ok-Asparagus3749",
      "body": "Worst holiday ever. Not a single thing I will eat and on top of that every year my family does nothing but fight and it’s always just an anxious uncomfortable mess for me",
      "created_utc": 1698869111.0,
      "score": 4,
      "context": []
    },
    {
      "id": "k7drxiv",
      "author": "the_YellowRanger",
      "body": "YES!!!! And my birthday falls on it. It's awful.",
      "created_utc": 1698855603.0,
      "score": 3,
      "context": []
    },
    {
      "id": "k7dolr2",
      "author": "ThRoWaWaY5163859",
      "body": "Yep, since moving away from my family almost a decade ago it has been the best thing because I now just do my own thing for Thanksgiving. I’ve had coworkers over the years try and invite me to their celebrations but I’m so much happier doing my own thing and most of the time I work that day to avoid people feeling sorry for me that I’m not doing anything. Celebrating on my own I tend to buy my favorite safe foods (usually frozen pizza and desserts) since everyone else seems to think it’s fun to eat foods until feeling extremely full. When I was younger I always hated how people would comment on my plate, I hate when foods touch so I would just have a very small portion of each of the few things I’ll eat so they won’t touch. Thank you for this post because I always feel so isolated in my not liking thanksgiving.",
      "created_utc": 1698854360.0,
      "score": 2,
      "context": []
    },
    {
      "id": "k7e4lif",
      "author": "Letshavemorefun",
      "body": "It’s a favorite holiday. I always eat the things I like and don’t eat the things I don’t like. But at TG - there are more things I like then usual! It’s all comfort food.",
      "created_utc": 1698860224.0,
      "score": 2,
      "context": []
    },
    {
      "id": "k7eslbd",
      "author": "h0mosuperior",
      "body": "luckily enough I'm from the UK so thanksgiving isn't an issue for me. Christmas dinner can be tricky sometimes but generally these days (grown up days) I can control what I'm served at Christmas so it's a lot easier.",
      "created_utc": 1698868943.0,
      "score": 2,
      "context": []
    },
    {
      "id": "k7et2vy",
      "author": "crochetsweetie",
      "body": "actually no! turkey is one of my safe foods and i can only get it for the holidays\n\nbut if they’re having something else my family just makes me pasta or a small pizza, they’re really understanding of it",
      "created_utc": 1698869118.0,
      "score": 2,
      "context": []
    },
    {
      "id": "k7evnbe",
      "author": "MeepOfDeath2113",
      "body": "I agree that it’s my least favorite holiday as well. Honestly, anything that revolves around food is not my favorite thing. I have a plate with divided sections that I use every year and my family embraces. I can always depend on mashed potatoes and canned cranberry sauce to be there, since I make or prepare those. And I don’t pressure myself to eat more or less than I can handle. My family doesn’t pressure me either. It’s a hard day for sure!",
      "created_utc": 1698870045.0,
      "score": 2,
      "context": []
    },
    {
      "id": "k7ez30p",
      "author": "oddistrange",
      "body": "I pretty much hate all family gatherings because without fail someone will make some comment about how little I eat. It's a combination of having an audience judging what I eat and how little and the food just doesn't interest me. I usually stuff my face when I get home and I'm alone.",
      "created_utc": 1698871277.0,
      "score": 2,
      "context": []
    },
    {
      "id": "k7f6jzv",
      "author": "fairyinthedark",
      "body": "I hate thanksgiving, and luckily my family hates it too. My Dad loves cooking and baking and usually makes foods I Hate each year. Luckily this year my family plans on just eating whatever we want and going to the movies, I also have severe anxiety which I've used as an an excuse in the past to get out of going to Thanksgiving events.",
      "created_utc": 1698873974.0,
      "score": 2,
      "context": []
    },
    {
      "id": "k7dilhs",
      "author": "SB_Wife",
      "body": "Yeah, I hate it more compared to Easter or Christmas because, and not to sound completely selfish, but I get more out of those.\n\nI'm Canadian, so we already had Thanksgiving, but like. The whole point is just food. We drive three hours to see extended family just to eat a meal, and then drive home the next day. At least at Easter I get chocolate and Christmas I get gifts lol. \n\nThe only thing that makes it tolerable for me is the cannabis, but that's not legal everyway and it doesn't work for everyone. To be fair I don't even like seeing my extended family that much anyway so the pot is two-fold for me.\n\nI don't hate turkey in individual foods in general. I like turkey (white meat only) with cranberry, and I like potatoes and corn. But it's the whole expectation if that makes sense. I just don't want to be there, which then feeds into everything, so I have to override parts of my brain with drugs.\n\nI love it so much...",
      "created_utc": 1698852085.0,
      "score": 3,
      "context": []
    },
    {
      "id": "k7e0fdl",
      "author": "lucksh0t",
      "body": "I flat out refuse to go to Thanksgiving dinner anymore its not worth the stress and anxiety if anyone gets that upset they aren't worth calling family anyway",
      "created_utc": 1698858715.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lpjdnhy",
      "author": "Cottagecorecult",
      "body": "This is genuinely so true, like I do not want to be expected to eat with my judgmental family members",
      "created_utc": 1727637850.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ly8yf0y",
      "author": "Edd_ska",
      "body": "Yes. It’s always been boring for me plus there’s no restaurants open:(",
      "created_utc": 1732195814.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k7ff2vf",
      "author": "Riksor",
      "body": "Yup. I don't have a great family, but family + foods I find repulsive + the unavoidable scents of those foods + the heat from warm bodies and the oven + the bloody origins and racist undertones of a good bulk of decor.... Terrible holiday. I'm excited for Christmas.",
      "created_utc": 1698877198.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k7fg5kk",
      "author": "pasghetti_n_meatbals",
      "body": "Yes!!! My kiddo, age 7,  hates Thanksgiving. He loooooves the \"Turkey Trot\" that our family runs on Thanksgiving morning. So the first third of the day is spent there (outside, southern USA). Thanksgiving dinner was an unexpected meltdown (versus his normal just eat a few crackers and bolt from the table)  last year, and after having a few heart to heart discussions he let me in to all the big feelings!! You see folks, it wasn't just that sit down dinner, with the big smells and the gross food, it was everything that had been leading up to it over the course of the previous few days. It was the writing about Thanksgiving at school, the reading about Thanksgiving books at school, everybody talking about food, all the TV commercials (sooo many), etc!! This kiddo was bombarded with food that he didn't want to eat and he certainly didn't want to be pressured about. \n\nBut the startling and the most brutal for this mama's heart was hearing him talk about the feelings that it gave him. My kid experienced shame and failure for not being able to eat the food. He felt left out for not being able to participate. For all the world that he wants to be able he just simply can't. \n\nSo this year we are completely revamping thanksgiving, will totally attend the Turkey Trot because that's a favorite for everyone involved.  And we are going to serve what he chooses for everyone (so there will be Dino nuggets, Cheeto Mac and cheese, and Cool ranch Doritos on the main platters.) I'm getting his input on everything that he's willing to talk to me about!  \nAnyone out there has any suggestions on how to make the holiday easier for him or to help shift the focus from food to giving thanks, I certainly would appreciate it!\n\nEdited for TL;DR\nYes my kid hates thanksgiving, he likes running a Turkey Trot race. This year we're going to do things differently and I'll take anybody's suggestions for making it better.",
      "created_utc": 1698877638.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k7fjwz4",
      "author": "crackalac",
      "body": "Lol it's my favorite meal of the year. I just load my plate with turkey, and mashed potatoes, smother it all in gravy and sop it all up with about 6 dinner rolls",
      "created_utc": 1698879213.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k7fqg1d",
      "author": "Nova-Prospekt",
      "body": "Thanksgiving is actually one of the only times I can eat actual vegetables. I just put a bunch of gravy on the green beans and it makes them ok to eat. I also enjoy turkey, mash potato and corn, so I actually get some good diversity on that day.\n\nIm lucky that my mom is the host/cook of the family dinner, so all of the food is familiar. I would not enjoy trying a thanksgiving meal prepared by somebody else",
      "created_utc": 1698881876.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k7fv9uv",
      "author": "deandratb",
      "body": "It's literally traumatic for me. My birthday is in late November and until I was 17 and my family stopped gathering to celebrate, my cake and presents were held hostage every year until I choked down the dry turkey and lumpy potatoes. It's been 20 years and the smells alone still make me gag. Tbh the only thing I do to make it better is appreciate the fact that I don't celebrate it anymore--my chosen family know about my food issues and don't care that I ignore the whole thing.",
      "created_utc": 1698883832.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k7g57gu",
      "author": "None",
      "body": "I love it but that's because I've finally convinced my family to let me enjoy my mash potatoes in peace. \n\nI could really go for my uncle's mash potatoes right now.",
      "created_utc": 1698887823.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k7ghcun",
      "author": "APleasantMartini",
      "body": "I hate it.\n\nI just want to go to a movie and then that's considered giving thanks for being alive.",
      "created_utc": 1698892970.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k7grryj",
      "author": "Korocola",
      "body": "Me, I have thanksgiving. I used to only be able to eat mac n cheese, corn and mashed potatoes and bread but now I can’t eat any of that so idk what I’m going to do for thanksgiving",
      "created_utc": 1698898091.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k7gx87v",
      "author": "ScheduleEvery7059",
      "body": "I don’t even know much about it maybe it’s because I am from Australia  and we don’t celebrate it except for Black Friday sales in some stores",
      "created_utc": 1698901371.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k7gxitr",
      "author": "RoundNectarine2507",
      "body": "I used to like thanksgiving when I was a kid because it was a holiday I got to spend with my grandma. Before she passed, she never made me feel bad about my eating habits. As I’ve gotten older it’s always an extremely nerve wracking holiday. I want to like it again but it’s so hard. Last year I went to my roommate’s family’s home and I had a panic attack in the bathroom. There was too much food yet not enough that I could eat, everyone kept asking me about my food and I felt like I was being interrogated, etc. i miss chilling at my grandma’s house watching the Charlie Brown thanksgiving special and the macys day parade while eating my plate of 3 foods lol",
      "created_utc": 1698901562.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k7ha6yn",
      "author": "usernametaken615",
      "body": "It’s my absolute least favorite holiday. The best part about being an adult is being able to avoid it.",
      "created_utc": 1698911550.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k7ih75z",
      "author": "taytartot",
      "body": "Barely anything on my plate and the second helpers are staring me down like I hate food or something 🫣 its a terrible holiday.",
      "created_utc": 1698936298.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k7jcets",
      "author": "throwawaypatien",
      "body": "Thanksgiving isn't a thing in NZ thankfully. \n\nI find the concept stupid, you can say what you're thankful for every day. Parades can be saved for Christmas. It just seems like an unnecessary placeholder between Halloween and Christmas.",
      "created_utc": 1698947663.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k7k3bcl",
      "author": "xandersmama410",
      "body": "Is there a way you can host Thanksgiving and only make foods you like? Your Thanksgiving can consist of whatever foods you want it doesn’t *have* to be the traditional holiday meal. One year I made a large lasagna with garlic bread and everyone loved it. My family doesn’t care what we eat as long as we all get together.",
      "created_utc": 1698957371.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k7k3jce",
      "author": "xandersmama410",
      "body": "Is there a way you can host Thanksgiving and only make foods you like? *Your*Thanksgiving can consist of whatever foods you want, it doesn’t *have* to be the traditional holiday meal. One year I made a large lasagna with garlic bread and everyone loved it. My family doesn’t care what we eat as long as we’re all together while eating it.",
      "created_utc": 1698957450.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k7ku02u",
      "author": "purplechunkymonkey",
      "body": "My daughter likes turkey, dinner rolls, my stuffing, and cranberry sauce. She is told she needs at least two things on her plate. We also buy her a chocolate pie for dessert.",
      "created_utc": 1698967566.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k7mawb0",
      "author": "MxGirl22",
      "body": "Only when I have to spend it with judgy extended family members!",
      "created_utc": 1698993515.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k7uen99",
      "author": "OneEyedTreeHugger",
      "body": "I absolutely hate Thanksgiving and Christmas and the weeks between them. So much of what happens centers around food. And people. Between the anxiety around food and the anxiety around people, it’s just awful. I haven’t gone the last few years, and even though my family definitely makes me feel bad about not being there, it’s ultimately been worth it to me to just stay home. But yeah, Thanksgiving is definitely the worst.",
      "created_utc": 1699133981.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k8yryt9",
      "author": "Trexgym",
      "body": "Hate it and my family sucks , “ apparently they think I’ll ruin everything “",
      "created_utc": 1699817162.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k9zntm9",
      "author": "Puzzled_Art",
      "body": "I recently went to an early Thanksgiving event and gave myself time to eat beforehand so I wouldn't have to when I got there. Thanksgiving is a 0/10.",
      "created_utc": 1700463477.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lsuu6fs",
      "author": "0000425671",
      "body": "If you could choose what to have for thanksgiving dinner what would you serve?",
      "created_utc": 1729439151.0,
      "score": 1,
      "context": [
        {
          "id": "k7d7750",
          "author": "None",
          "body": "I.fucking.hate.thanksgiving. Always have. First of all, why are we celebrating murder and genocide? Second WHY does it have to be all about food? Ughggg so many smells, and options, people bringing foods they made in their mysterious kitchens with their suspicious ingredients? Why are we all eating a turkey? What did they do to deserve this? Can I have some goldfish and can it be tomorrow now please. I hate it.",
          "created_utc": 1698847561.0
        }
      ]
    },
    {
      "id": "k7irdjq",
      "author": "WellDoneEngineer",
      "body": "This is my problem exactly. I try to avoid the family dinner and make some excuse to be late or not attend at all. \nI seriously hate this holiday for that exact reason",
      "created_utc": 1698940079.0,
      "score": 3,
      "context": [
        {
          "id": "k7d5okq",
          "author": "zDEFEKT",
          "body": "It’s the worst holiday imaginable.  All about food.  None of which I want to eat.  Lots of family members to ask you why you aren’t eating the food.  Sucks.",
          "created_utc": 1698846916.0
        }
      ]
    },
    {
      "id": "k7gz9c8",
      "author": "Autismsaurus",
      "body": "I hate the assumption that I didn’t eat something because someone made it poorly.  No, it doesn’t matter if that thing was prepared by the world’s most talented chef, I still wouldn’t eat it.  It’s not you, it’s the food!",
      "created_utc": 1698902725.0,
      "score": 5,
      "context": [
        {
          "id": "k7dgho9",
          "author": "No-Green-5339",
          "body": "Hate thanksgiving, just because it’s full of judgement. Ppl asking why I only have two or three things on my plate. Ppl making comments about my weight assuming it has a correlation with what I eat on that one particular day. The cooks constantly asking if you didn’t eat it because you thought it was nasty. Being judged because I couldn’t even finish the three things on my plate. Family questioning why I’m not taking a to go plate or even better forcing me to take a to go plate filled with food that I’ll immediately throw out upon arrival at my house.",
          "created_utc": 1698851275.0
        }
      ]
    },
    {
      "id": "lsuulb3",
      "author": "0000425671",
      "body": "What is your favorite thanksgiving vegetable?",
      "created_utc": 1729439286.0,
      "score": 1,
      "context": [
        {
          "id": "k7dgho9",
          "author": "No-Green-5339",
          "body": "Hate thanksgiving, just because it’s full of judgement. Ppl asking why I only have two or three things on my plate. Ppl making comments about my weight assuming it has a correlation with what I eat on that one particular day. The cooks constantly asking if you didn’t eat it because you thought it was nasty. Being judged because I couldn’t even finish the three things on my plate. Family questioning why I’m not taking a to go plate or even better forcing me to take a to go plate filled with food that I’ll immediately throw out upon arrival at my house.",
          "created_utc": 1698851275.0
        }
      ]
    },
    {
      "id": "k7e3z3i",
      "author": "No_Calligrapher_7130",
      "body": "Damn, my sister is vegetarian and we always made sure she had something to eat",
      "created_utc": 1698859998.0,
      "score": 5,
      "context": [
        {
          "id": "k7cwtjv",
          "author": "mlo9109",
          "body": "Me! It wasn't something my family really did growing up. Canadian Thanksgiving falls during mom's birthday, so we celebrated that. Living in the states, it's like a 2nd Christmas. I don't get it. Also, as a vegetarian, it's not like I can really partake in the festivities anyway. Though, I do get Chinese takeout and put my Christmas tree up.",
          "created_utc": 1698842949.0
        }
      ]
    },
    {
      "id": "k9e6yq5",
      "author": "Stronghold257",
      "body": "I’m doing a friendsgiving for the first time this year and I’m excited to have food I’ll actually eat :)",
      "created_utc": 1700074572.0,
      "score": 1,
      "context": [
        {
          "id": "k7dtcml",
          "author": "Bobbibeee",
          "body": "I used to HATE thanksgiving so so so much and all food for that matter when I was growing up (it’s hard for me to eat food that other people make) BUT now it’s my favorite holiday because I’m cooking the whole meal! I get to make things how I want. I even add in some things to the meal that aren’t typical that I know I’ll eat a lot like my favorite Mac and cheese and some peas haha  I’m not a turkey fan but my boyfriend loves it so I make it for him (: just remember that you can make whatever food you want for YOUR thanksgiving, no one has to know ;)",
          "created_utc": 1698856119.0
        }
      ]
    },
    {
      "id": "k7ej7o7",
      "author": "cloton27",
      "body": "Not a bad idea, but then you’ll still have to worry about people making comments about you not eating anything else. Especially if the safe food is not a typical Thanksgiving food.",
      "created_utc": 1698865524.0,
      "score": 10,
      "context": [
        {
          "id": "k7e0zi0",
          "author": "Littlerainbow02",
          "body": "How about making a safe food for yourself as part of the dinner and just eating that? That way you get to enjoy some delicious food too. If you are not hosting, you can bring a dish for others as a contribution too.",
          "created_utc": 1698858919.0
        }
      ]
    },
    {
      "id": "k7fselv",
      "author": "Sneezing_protractor",
      "body": "That's so sweet! I wish I had something like that when I was small; maybe Thanksgiving wouldn't be quite so awful now. Thank you for doing that for your child.",
      "created_utc": 1698882669.0,
      "score": 1,
      "context": [
        {
          "id": "k7es459",
          "author": "Happy_Flow826",
          "body": "So it's my child that has suspected arfid. And while we do encourage trying food and exposing him to food in non-eating ways (think sensory bins, or helping with the shopping, or helping make foods if he enjoys it), holidays aren't meant for that they're meant for enjoying time with family. So my mom for the past two years has made chicken nuggets and cheese sticks as part of the meal course for everyone to have. Like she full on gets the jumbo bags of them, cooks the nuggets the way he likes and everyone is welcome to them, and she unwraps the cheesesticks and puts them on a platter just like any other side. My moms husband, he's literally the best I swear, will make his freezer corn weeks ahead of time just to make sure it's available and always sets some aside for my son just to make sure he has it and it doesn't get eaten all up on Thanksgiving.",
          "created_utc": 1698868771.0
        }
      ]
    },
    {
      "id": "k7ufcj5",
      "author": "OneEyedTreeHugger",
      "body": "I love this so much. I have awful memories of Thanksgiving growing up. I wish I would have had such understanding adults in my lifetime fe when I was a kid!",
      "created_utc": 1699134260.0,
      "score": 1,
      "context": [
        {
          "id": "k7es459",
          "author": "Happy_Flow826",
          "body": "So it's my child that has suspected arfid. And while we do encourage trying food and exposing him to food in non-eating ways (think sensory bins, or helping with the shopping, or helping make foods if he enjoys it), holidays aren't meant for that they're meant for enjoying time with family. So my mom for the past two years has made chicken nuggets and cheese sticks as part of the meal course for everyone to have. Like she full on gets the jumbo bags of them, cooks the nuggets the way he likes and everyone is welcome to them, and she unwraps the cheesesticks and puts them on a platter just like any other side. My moms husband, he's literally the best I swear, will make his freezer corn weeks ahead of time just to make sure it's available and always sets some aside for my son just to make sure he has it and it doesn't get eaten all up on Thanksgiving.",
          "created_utc": 1698868771.0
        }
      ]
    },
    {
      "id": "k7gu44k",
      "author": "marzzyy__",
      "body": "Same here, Thanksgiving dinner is basically my ultimate safe meal. I would eat it all the time if I could.",
      "created_utc": 1698899425.0,
      "score": 2,
      "context": [
        {
          "id": "k7e8yzu",
          "author": "ITriedSoHard419-68",
          "body": "I actually love thanksgiving. I’m lucky enough that I have several safe-foods that are traditionally served on thanksgiving (turkey, mashed potatoes, thanksgiving rolls) so it’s basically the closest thing I’ll ever experience to an all-you-can-eat buffet.",
          "created_utc": 1698861793.0
        }
      ]
    },
    {
      "id": "lsuv80w",
      "author": "0000425671",
      "body": "What is your favorite thanksgiving vegetable?",
      "created_utc": 1729439492.0,
      "score": 1,
      "context": [
        {
          "id": "k7efamf",
          "author": "littleghool",
          "body": "Yes. But luckily I have a really supportive parent and SO. It's just us 3, and we all have things we like even if my plate is just dinner rolls and pie 😆",
          "created_utc": 1698864102.0
        }
      ]
    },
    {
      "id": "k7fjt3o",
      "author": "pasghetti_n_meatbals",
      "body": "I'm sorry your birthday is on the same day. That seems extra hard.",
      "created_utc": 1698879169.0,
      "score": 3,
      "context": [
        {
          "id": "k7drxiv",
          "author": "the_YellowRanger",
          "body": "YES!!!! And my birthday falls on it. It's awful.",
          "created_utc": 1698855603.0
        }
      ]
    },
    {
      "id": "lsuvglj",
      "author": "0000425671",
      "body": "What is your favorite thanksgiving vegetable?",
      "created_utc": 1729439567.0,
      "score": 1,
      "context": [
        {
          "id": "k7dolr2",
          "author": "ThRoWaWaY5163859",
          "body": "Yep, since moving away from my family almost a decade ago it has been the best thing because I now just do my own thing for Thanksgiving. I’ve had coworkers over the years try and invite me to their celebrations but I’m so much happier doing my own thing and most of the time I work that day to avoid people feeling sorry for me that I’m not doing anything. Celebrating on my own I tend to buy my favorite safe foods (usually frozen pizza and desserts) since everyone else seems to think it’s fun to eat foods until feeling extremely full. When I was younger I always hated how people would comment on my plate, I hate when foods touch so I would just have a very small portion of each of the few things I’ll eat so they won’t touch. Thank you for this post because I always feel so isolated in my not liking thanksgiving.",
          "created_utc": 1698854360.0
        }
      ]
    },
    {
      "id": "k7e0vw5",
      "author": "brrratmobile",
      "body": "every year i think about not going but my family would definitely make it all about them and take it way too personally lol",
      "created_utc": 1698858883.0,
      "score": 2,
      "context": [
        {
          "id": "k7e0fdl",
          "author": "lucksh0t",
          "body": "I flat out refuse to go to Thanksgiving dinner anymore its not worth the stress and anxiety if anyone gets that upset they aren't worth calling family anyway",
          "created_utc": 1698858715.0
        }
      ]
    },
    {
      "id": "lsuwt2c",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1729440001.0,
      "score": 1,
      "context": [
        {
          "id": "k7fg5kk",
          "author": "pasghetti_n_meatbals",
          "body": "Yes!!! My kiddo, age 7,  hates Thanksgiving. He loooooves the \"Turkey Trot\" that our family runs on Thanksgiving morning. So the first third of the day is spent there (outside, southern USA). Thanksgiving dinner was an unexpected meltdown (versus his normal just eat a few crackers and bolt from the table)  last year, and after having a few heart to heart discussions he let me in to all the big feelings!! You see folks, it wasn't just that sit down dinner, with the big smells and the gross food, it was everything that had been leading up to it over the course of the previous few days. It was the writing about Thanksgiving at school, the reading about Thanksgiving books at school, everybody talking about food, all the TV commercials (sooo many), etc!! This kiddo was bombarded with food that he didn't want to eat and he certainly didn't want to be pressured about. \n\nBut the startling and the most brutal for this mama's heart was hearing him talk about the feelings that it gave him. My kid experienced shame and failure for not being able to eat the food. He felt left out for not being able to participate. For all the world that he wants to be able he just simply can't. \n\nSo this year we are completely revamping thanksgiving, will totally attend the Turkey Trot because that's a favorite for everyone involved.  And we are going to serve what he chooses for everyone (so there will be Dino nuggets, Cheeto Mac and cheese, and Cool ranch Doritos on the main platters.) I'm getting his input on everything that he's willing to talk to me about!  \nAnyone out there has any suggestions on how to make the holiday easier for him or to help shift the focus from food to giving thanks, I certainly would appreciate it!\n\nEdited for TL;DR\nYes my kid hates thanksgiving, he likes running a Turkey Trot race. This year we're going to do things differently and I'll take anybody's suggestions for making it better.",
          "created_utc": 1698877638.0
        }
      ]
    },
    {
      "id": "lsuxjgo",
      "author": "0000425671",
      "body": "What is your favorite thanksgiving vegetable?",
      "created_utc": 1729440233.0,
      "score": 1,
      "context": [
        {
          "id": "k9zntm9",
          "author": "Puzzled_Art",
          "body": "I recently went to an early Thanksgiving event and gave myself time to eat beforehand so I wouldn't have to when I got there. Thanksgiving is a 0/10.",
          "created_utc": 1700463477.0
        }
      ]
    },
    {
      "id": "lsva6v0",
      "author": "None",
      "body": "Well I grew up eating English food for thanksgiving. My dad growing up in England is the only good thing about him, he came from meat and potatoes, thank god. So we would have a big roast with Yorkshire puddings and roasted potatoes it’s delicious, and it would easily be my death row meal. I’ve been to some other thanksgivings in my adult life and am always so disappointed to see stuffing and turkey and shit….its not that good lol. Why do people only eat it on thanksgiving? Probably because it’s not actually that good and they’re doing it for the sake of tradition….on a really fucked up holiday lol. \n\nI have a lot of qualms with a shitty holiday celebrating genocide where I have to gather in a room with family I don’t talk to except on holidays and eat together at a table…it’s my personal nightmare. I love being an adult though cause I can just leave functions early now or just not go. \n\nRoast, Yorkshire puddings, gravy and roasted potatoes would be my ideal meal though",
      "created_utc": 1729444251.0,
      "score": 1,
      "context": [
        {
          "id": "k7d7750",
          "author": "None",
          "body": "I.fucking.hate.thanksgiving. Always have. First of all, why are we celebrating murder and genocide? Second WHY does it have to be all about food? Ughggg so many smells, and options, people bringing foods they made in their mysterious kitchens with their suspicious ingredients? Why are we all eating a turkey? What did they do to deserve this? Can I have some goldfish and can it be tomorrow now please. I hate it.",
          "created_utc": 1698847561.0
        },
        {
          "id": "lsuu6fs",
          "author": "0000425671",
          "body": "If you could choose what to have for thanksgiving dinner what would you serve?",
          "created_utc": 1729439151.0
        }
      ]
    },
    {
      "id": "ltd0u2r",
      "author": "No-Green-5339",
      "body": "Green beans lol and I wouldn’t say favorite but the only vegetables I can tolerate",
      "created_utc": 1729699670.0,
      "score": 1,
      "context": [
        {
          "id": "k7dgho9",
          "author": "No-Green-5339",
          "body": "Hate thanksgiving, just because it’s full of judgement. Ppl asking why I only have two or three things on my plate. Ppl making comments about my weight assuming it has a correlation with what I eat on that one particular day. The cooks constantly asking if you didn’t eat it because you thought it was nasty. Being judged because I couldn’t even finish the three things on my plate. Family questioning why I’m not taking a to go plate or even better forcing me to take a to go plate filled with food that I’ll immediately throw out upon arrival at my house.",
          "created_utc": 1698851275.0
        },
        {
          "id": "lsuulb3",
          "author": "0000425671",
          "body": "What is your favorite thanksgiving vegetable?",
          "created_utc": 1729439286.0
        }
      ]
    },
    {
      "id": "k7f31c4",
      "author": "Littlerainbow02",
      "body": "I mean. If you can´t avoid getting annoyed by people for what you are eating, may as well eat something good that you like",
      "created_utc": 1698872687.0,
      "score": 2,
      "context": [
        {
          "id": "k7e0zi0",
          "author": "Littlerainbow02",
          "body": "How about making a safe food for yourself as part of the dinner and just eating that? That way you get to enjoy some delicious food too. If you are not hosting, you can bring a dish for others as a contribution too.",
          "created_utc": 1698858919.0
        },
        {
          "id": "k7ej7o7",
          "author": "cloton27",
          "body": "Not a bad idea, but then you’ll still have to worry about people making comments about you not eating anything else. Especially if the safe food is not a typical Thanksgiving food.",
          "created_utc": 1698865524.0
        }
      ]
    },
    {
      "id": "k7fji6q",
      "author": "pasghetti_n_meatbals",
      "body": "Yes, people comment a lot when they shouldn't!! Years ago (my kiddo was about 2 1/2) and we went to family members house for Thanksgiving. We encountered questions about his eating differences (yes at that age) because he wasn't eating the typical holiday food! A young friend of the family, who we didn't know, must have over heard. He sat down beside us and told us in depth of his experiences (in hindsight, it must be ARFID). We instantly felt at ease and am so grateful he chose to talk to us, and for that night, I didn't feel like a mom failure.",
      "created_utc": 1698879045.0,
      "score": 2,
      "context": [
        {
          "id": "k7e0zi0",
          "author": "Littlerainbow02",
          "body": "How about making a safe food for yourself as part of the dinner and just eating that? That way you get to enjoy some delicious food too. If you are not hosting, you can bring a dish for others as a contribution too.",
          "created_utc": 1698858919.0
        },
        {
          "id": "k7ej7o7",
          "author": "cloton27",
          "body": "Not a bad idea, but then you’ll still have to worry about people making comments about you not eating anything else. Especially if the safe food is not a typical Thanksgiving food.",
          "created_utc": 1698865524.0
        }
      ]
    },
    {
      "id": "k7fvlxb",
      "author": "Happy_Flow826",
      "body": "My mom and step-dad are the best. I'm trying to balance between meeting my child's mental health needs by offering safe foods, while also trying to make sure he has some sort of balanced diet and the opportunities to try food with emotional support. I'm so proud of all the foods he's tried and the ways he's expanded from singular brands to multiple brands of safe foods. My mom and step-dad are the best in trying to support my son while also trying to make holidays normal and happy while also following my lead on feeding him.",
      "created_utc": 1698883968.0,
      "score": 2,
      "context": [
        {
          "id": "k7es459",
          "author": "Happy_Flow826",
          "body": "So it's my child that has suspected arfid. And while we do encourage trying food and exposing him to food in non-eating ways (think sensory bins, or helping with the shopping, or helping make foods if he enjoys it), holidays aren't meant for that they're meant for enjoying time with family. So my mom for the past two years has made chicken nuggets and cheese sticks as part of the meal course for everyone to have. Like she full on gets the jumbo bags of them, cooks the nuggets the way he likes and everyone is welcome to them, and she unwraps the cheesesticks and puts them on a platter just like any other side. My moms husband, he's literally the best I swear, will make his freezer corn weeks ahead of time just to make sure it's available and always sets some aside for my son just to make sure he has it and it doesn't get eaten all up on Thanksgiving.",
          "created_utc": 1698868771.0
        },
        {
          "id": "k7fselv",
          "author": "Sneezing_protractor",
          "body": "That's so sweet! I wish I had something like that when I was small; maybe Thanksgiving wouldn't be quite so awful now. Thank you for doing that for your child.",
          "created_utc": 1698882669.0
        }
      ]
    },
    {
      "id": "k7e3chl",
      "author": "lucksh0t",
      "body": "Sorry to hear that's a rough spot to be in. Lucky my mom and sister would back me 100% there about the only family I care about anymore.",
      "created_utc": 1698859770.0,
      "score": 1,
      "context": [
        {
          "id": "k7e0fdl",
          "author": "lucksh0t",
          "body": "I flat out refuse to go to Thanksgiving dinner anymore its not worth the stress and anxiety if anyone gets that upset they aren't worth calling family anyway",
          "created_utc": 1698858715.0
        },
        {
          "id": "k7e0vw5",
          "author": "brrratmobile",
          "body": "every year i think about not going but my family would definitely make it all about them and take it way too personally lol",
          "created_utc": 1698858883.0
        }
      ]
    },
    {
      "id": "ltf7t63",
      "author": "ARFID-ModTeam",
      "body": "Your post or comment was removed due to being rude to the ARFID community. ARFID is a diagnosable eating disorder, a diagnosis backed up by doctors and psychiatrists. Comments or responses that bully or harass sufferers of the condition are not acceptable.",
      "created_utc": 1729724164.0,
      "score": 1,
      "context": [
        {
          "id": "k7fg5kk",
          "author": "pasghetti_n_meatbals",
          "body": "Yes!!! My kiddo, age 7,  hates Thanksgiving. He loooooves the \"Turkey Trot\" that our family runs on Thanksgiving morning. So the first third of the day is spent there (outside, southern USA). Thanksgiving dinner was an unexpected meltdown (versus his normal just eat a few crackers and bolt from the table)  last year, and after having a few heart to heart discussions he let me in to all the big feelings!! You see folks, it wasn't just that sit down dinner, with the big smells and the gross food, it was everything that had been leading up to it over the course of the previous few days. It was the writing about Thanksgiving at school, the reading about Thanksgiving books at school, everybody talking about food, all the TV commercials (sooo many), etc!! This kiddo was bombarded with food that he didn't want to eat and he certainly didn't want to be pressured about. \n\nBut the startling and the most brutal for this mama's heart was hearing him talk about the feelings that it gave him. My kid experienced shame and failure for not being able to eat the food. He felt left out for not being able to participate. For all the world that he wants to be able he just simply can't. \n\nSo this year we are completely revamping thanksgiving, will totally attend the Turkey Trot because that's a favorite for everyone involved.  And we are going to serve what he chooses for everyone (so there will be Dino nuggets, Cheeto Mac and cheese, and Cool ranch Doritos on the main platters.) I'm getting his input on everything that he's willing to talk to me about!  \nAnyone out there has any suggestions on how to make the holiday easier for him or to help shift the focus from food to giving thanks, I certainly would appreciate it!\n\nEdited for TL;DR\nYes my kid hates thanksgiving, he likes running a Turkey Trot race. This year we're going to do things differently and I'll take anybody's suggestions for making it better.",
          "created_utc": 1698877638.0
        },
        {
          "id": "lsuwt2c",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1729440001.0
        }
      ]
    },
    {
      "id": "lsvc9om",
      "author": "0000425671",
      "body": "What are your favorite thanksgiving vegetables?",
      "created_utc": 1729444898.0,
      "score": 1,
      "context": [
        {
          "id": "k7d7750",
          "author": "None",
          "body": "I.fucking.hate.thanksgiving. Always have. First of all, why are we celebrating murder and genocide? Second WHY does it have to be all about food? Ughggg so many smells, and options, people bringing foods they made in their mysterious kitchens with their suspicious ingredients? Why are we all eating a turkey? What did they do to deserve this? Can I have some goldfish and can it be tomorrow now please. I hate it.",
          "created_utc": 1698847561.0
        },
        {
          "id": "lsuu6fs",
          "author": "0000425671",
          "body": "If you could choose what to have for thanksgiving dinner what would you serve?",
          "created_utc": 1729439151.0
        },
        {
          "id": "lsva6v0",
          "author": "None",
          "body": "Well I grew up eating English food for thanksgiving. My dad growing up in England is the only good thing about him, he came from meat and potatoes, thank god. So we would have a big roast with Yorkshire puddings and roasted potatoes it’s delicious, and it would easily be my death row meal. I’ve been to some other thanksgivings in my adult life and am always so disappointed to see stuffing and turkey and shit….its not that good lol. Why do people only eat it on thanksgiving? Probably because it’s not actually that good and they’re doing it for the sake of tradition….on a really fucked up holiday lol. \n\nI have a lot of qualms with a shitty holiday celebrating genocide where I have to gather in a room with family I don’t talk to except on holidays and eat together at a table…it’s my personal nightmare. I love being an adult though cause I can just leave functions early now or just not go. \n\nRoast, Yorkshire puddings, gravy and roasted potatoes would be my ideal meal though",
          "created_utc": 1729444251.0
        }
      ]
    },
    {
      "id": "lsvoxra",
      "author": "None",
      "body": "Green beans! Or broccoli!",
      "created_utc": 1729448667.0,
      "score": 1,
      "context": [
        {
          "id": "k7d7750",
          "author": "None",
          "body": "I.fucking.hate.thanksgiving. Always have. First of all, why are we celebrating murder and genocide? Second WHY does it have to be all about food? Ughggg so many smells, and options, people bringing foods they made in their mysterious kitchens with their suspicious ingredients? Why are we all eating a turkey? What did they do to deserve this? Can I have some goldfish and can it be tomorrow now please. I hate it.",
          "created_utc": 1698847561.0
        },
        {
          "id": "lsuu6fs",
          "author": "0000425671",
          "body": "If you could choose what to have for thanksgiving dinner what would you serve?",
          "created_utc": 1729439151.0
        },
        {
          "id": "lsva6v0",
          "author": "None",
          "body": "Well I grew up eating English food for thanksgiving. My dad growing up in England is the only good thing about him, he came from meat and potatoes, thank god. So we would have a big roast with Yorkshire puddings and roasted potatoes it’s delicious, and it would easily be my death row meal. I’ve been to some other thanksgivings in my adult life and am always so disappointed to see stuffing and turkey and shit….its not that good lol. Why do people only eat it on thanksgiving? Probably because it’s not actually that good and they’re doing it for the sake of tradition….on a really fucked up holiday lol. \n\nI have a lot of qualms with a shitty holiday celebrating genocide where I have to gather in a room with family I don’t talk to except on holidays and eat together at a table…it’s my personal nightmare. I love being an adult though cause I can just leave functions early now or just not go. \n\nRoast, Yorkshire puddings, gravy and roasted potatoes would be my ideal meal though",
          "created_utc": 1729444251.0
        },
        {
          "id": "lsvc9om",
          "author": "0000425671",
          "body": "What are your favorite thanksgiving vegetables?",
          "created_utc": 1729444898.0
        }
      ]
    }
  ]
}