{
  "id": "17orarf",
  "subreddit": "ARFID",
  "author": "80000lightyears",
  "created_utc": 1699233776.0,
  "title": "Eating disorder not taken seriously because of my weight",
  "selftext": "I'm obese, but *obviously* everyone with any eating disorder is severely underweight (good luck finding a stranger that even knows something other than anorexia exists). I eat once a day, yet I'm still fat because the only things I can tolerate consuming are junk from dieticians' nightmares. So of course I'm just picky and entitled.\n\n(The DSM-V criteria for ARFID doesn't even require you to be underweight either, but that part's ignored on most websites.)",
  "url": "https://www.reddit.com/r/ARFID/comments/17orarf/eating_disorder_not_taken_seriously_because_of_my/",
  "score": 85,
  "num_comments": 15,
  "comments": [
    {
      "id": "k80fk6u",
      "author": "RoundNectarine2507",
      "body": "I feel the same way, I’m a fat person who struggles to tolerate vegetables or anything with strong tastes. All my comforts are sweets and I eat like a child. I hate telling anyone about ARFID because I feel like everyone assumes I have Binge Eating Disorder because of my weight",
      "created_utc": 1699233968.0,
      "score": 54,
      "context": []
    },
    {
      "id": "k80iz0f",
      "author": "SB_Wife",
      "body": "I'm in the same boat. People do not understand how you can be fat but have an eating disorder that isn't binge eating.\n\nLike, sorry lots of processed foods are safe for me?",
      "created_utc": 1699235425.0,
      "score": 30,
      "context": []
    },
    {
      "id": "k81ugpi",
      "author": "Ihavemy_moments",
      "body": "Based on my BMI, I'm obese. Not diagnosed ARFID as only discovered the name for it recently. \n\nMy diet has always been extremely limited, but being in a long term relationship has had me working on improving my diet for nearly ten years now. I can do... 3 or 4 vegetables comfortably now, but fresh food is so inconsistent on texture and flavour, they often make me feel sick or like I have lead in my stomach, even if I ate that food yesterday and the day before. \n\nProcessed food is bad for us, but always looks and tastes the same (pretty much). In terms of diet I'm probably the healthiest I've ever been but I'm also not far off the heaviest. \n\nAdd in the ADHD, and I am very bad for snacking and seeking sugar. Does very often feel like I'm not in control of anything related to food.",
      "created_utc": 1699264957.0,
      "score": 4,
      "context": []
    },
    {
      "id": "k80t8lc",
      "author": "_mnmlst",
      "body": "I’ve had ARFID since 2018. Same disorder. Was super underweight 2018-2020, safe foods increased from basically nothing but still super limited, 2020-present I have been consistently gaining weight, and am super morbidly obese now. No one takes me seriously now.",
      "created_utc": 1699239892.0,
      "score": 9,
      "context": []
    },
    {
      "id": "k81rwrh",
      "author": "calmingthechaos",
      "body": "I am obese. Not diagnosed ARFID, because I'm not having much luck with eating disorder help in my area that also works with my schedule. People have ALWAYS assumed that I binge eat, or that I must eat a lot. I eat about two meals a day, maybe, and they're generally very small. I very rarely finish my entire meal. My diet is mainly pasta and chicken right now, with the occasional steak and potato thrown in. I have no idea how my body maintains as high of a weight as it does. That's all to say, I feel your pain. And how frustrating it is that people make assumptions based only on your weight.",
      "created_utc": 1699262796.0,
      "score": 5,
      "context": []
    },
    {
      "id": "k80j564",
      "author": "None",
      "body": "Yep! Story of my life here! I’m on average 200lb and I’m 5’4 but the problem is that I don’t look like it.",
      "created_utc": 1699235500.0,
      "score": 6,
      "context": []
    },
    {
      "id": "k82d4va",
      "author": "biscottiapricot",
      "body": "meanwhile im underweight but not dangerously so - people excuse my issues because im at a weight that's seen as desirable",
      "created_utc": 1699276899.0,
      "score": 4,
      "context": []
    },
    {
      "id": "k8410nz",
      "author": "_BobLoblawsLawBlog_",
      "body": "Did you know in Australia less than 6% of people with an eating disorder are \"underweight\" (according to the BMI - which is a rubbish measure however provides a helpful insight to the reality that EDs occur in all sizes)\n\nI'm not sure where you're located but I am a telehealth dietitian who has a special interest in working with people in fat / higher weight bodies experiencing eating disorders (including ARFID).\n\nhttps://instagram.com/more.than.nutrients?igshid=OGQ5ZDc2ODk2ZA==",
      "created_utc": 1699299832.0,
      "score": 2,
      "context": []
    },
    {
      "id": "k84j4xq",
      "author": "brokengirl89",
      "body": "When I finally went to the doctor for help with my eating, due to nutritional deficiencies and just being really stressed about everything, the dietitian they referred me to turned me away, on account that I’m a “normal weight”. They literally told me to come back if I lost weight they would reconsider. It’s taken me so long to work up the courage to ask for help, and for what? To be told I’m “not thin enough” to deserve it.",
      "created_utc": 1699306115.0,
      "score": 2,
      "context": []
    },
    {
      "id": "k84y7u3",
      "author": "iamtheultimateshoe",
      "body": "same ✌️",
      "created_utc": 1699311586.0,
      "score": 2,
      "context": []
    },
    {
      "id": "k85bu6k",
      "author": "None",
      "body": "yep… i eat in small portions too. but i’ve eaten the same 5 things since i was 4 years old, all processed and unhealthy food. going grocery shopping or eating in front of people is so embarrassing. it’s a lot harder to explain to people as an adult than when i was a kid",
      "created_utc": 1699317022.0,
      "score": 2,
      "context": []
    },
    {
      "id": "k85v0rx",
      "author": "picklecasserole",
      "body": "I've been dealing with the same issue for years. Nobody takes my ARFID seriously because I'm not skinny even though I have a history of literally passing out due to not eating. Something that has really helped me advocate for myself is getting consistent bloodwork done and having a way to see the results (a lot of healthcare systems have apps you can use for this). Even if you aren't underweight, severe malnutrition is really common in people with ARFID, so next time you go to the doctors request to get bloodwork to test for malnutrition (your psychiatrist can request bloodwork for it too). I've been doing this for about a year, so now every time I go to the doctors and they don't believe I have ARFID, I make them pull up all my test results that show that I've been chronically malnourished for the past year. In my experience, if you challenge your doctor and show that you're knowledgeable about your health (aka you googled your results and say that they prove you're malnourished), doctors tend to change their attitudes realllll quick and start taking you seriously. Hope this helps!!",
      "created_utc": 1699324901.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k869e4r",
      "author": "Nonbinary-Bones",
      "body": "I have had other eating disorders outside of ARFID and got diagnosed later in my 20s, and I am still struggling to beat it. I am used to telling people that atypical anorexia exists and that bulimia doesn't mean you're skinny. But most people I met (even professionals) look at me like I'm crazy when I mention ARFID. I know there are three types of ARFID:\n• one being lacking in nutrition but being able to eat, which often has those people are overweight BMIs\n•one being unable to eat because of senory issues, leading to normal or underweight BMIs\n•one being lacking interest/desire to eat or lacking  hunger leading most often to underweight BMIs \n\nBUT, that doesn't mean it doesn't fucking suck when people (especially doctors) mention how I'm morbidly obese so \"I can't possibly struggle to eat.\" It honestly makes me want to scream.",
      "created_utc": 1699331403.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k86dd7t",
      "author": "NoAstronomer3244",
      "body": "This. I hate how \"weight loss\" is seen as the universal symptom of ARFID when in reality it doesn't apply to everyone. I told my doctor about my worries surrounding ARFID and weight gain, she said \"we only have to be worried if you're losing weight. Not gaining.\" LIKE MAM, I GAINED 30 POUNDS IN JUST A FEW MONTHS!",
      "created_utc": 1699333612.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k81tncl",
      "author": "EllietteB",
      "body": "Yep, my mum is the only one who knows I have problems with food. She says I eat like a mouse. When it comes to actual food, I get full after like four spoonfuls. My weight comes from a lack of exercise and eating high sugar safe foods when I'm anxious or upset....which is often now that I'm doing my Master's.\n\nI remember the first time I actually told someone about my issues with food. It was a group of coworkers I had years ago. They kept commenting on how all I ever ate was salad. At the time, salads were my only safe food. I told them I literally only ever eat salads, and someone laughed and commented about my weight. That time, it was just my lack of exercise/depression that was affecting my weight.  I gave up on trying to get people to understand the issue I have with food after that. \n\nThere was actually a time when I got compliments about my weight because I'd lost some weight that was noticeable. Whenever people asked, I acted as if I didn't notice or had any idea what they were talking about. That's because at the time, I was having a lot of anxiety around my first relationship, and my only safe food was McDonald's. I lost weight from just eating a cheeseburger and chips every day. I knew people wouldn't believe me, so I kept quiet. My ex was the only one who noticed that I straight up refused to eat anything that wasn't a cheeseburger or chips, and he spent most of our dinner dates eating by himself. ARFID is wild.",
      "created_utc": 1699264265.0,
      "score": 7,
      "context": [
        {
          "id": "k80iz0f",
          "author": "SB_Wife",
          "body": "I'm in the same boat. People do not understand how you can be fat but have an eating disorder that isn't binge eating.\n\nLike, sorry lots of processed foods are safe for me?",
          "created_utc": 1699235425.0
        }
      ]
    }
  ]
}