{
  "id": "17rcsfs",
  "subreddit": "ARFID",
  "author": "dumbroad",
  "created_utc": 1699536046.0,
  "title": "anyone think about the restaraunt workers out there that know you're crazy",
  "selftext": "i mean this as a light hearted joke. im privileged to use uber eats a lot. essentially every 3 months i will have a safe food that i cycle through and order at least weekly if not twice a week. i'm always thinking about how there has to be someone on the restaraunt end thinking 'woah this person again?!'. uber has even sent me messages like 'you are x restaraunts biggest fan you place so many orders' lolol",
  "url": "https://www.reddit.com/r/ARFID/comments/17rcsfs/anyone_think_about_the_restaraunt_workers_out/",
  "score": 102,
  "num_comments": 36,
  "comments": [
    {
      "id": "k8i0bfx",
      "author": "None",
      "body": "Equally number of restaurant staff pissed off at complicated and unreasonable orders 😂\n\ni want a Caesar salad no dressing (yes no dressing -like, at all, not on the side) and croutons and cheese toppings in separate dishes on the side. \n\nThen eating Caesar salad with hands to pick out the middle white bit and craft an assembly line spanning the booth constructing each bite.",
      "created_utc": 1699537410.0,
      "score": 42,
      "context": []
    },
    {
      "id": "k8i2dht",
      "author": "OpheliaJade2382",
      "body": "Tbh they probably love you. I used to get excited about regulars when I worked in food service",
      "created_utc": 1699538325.0,
      "score": 41,
      "context": []
    },
    {
      "id": "k8ibz3w",
      "author": "CorpseProject",
      "body": "Im a picky arfid eater but also have 18 years of both BOH and FOH under my belt. \n\nWe don’t mind you. There’s a few rules to abide by though: don’t try to make up your own recipe and have the cook make it. Food temps, removing certain ingredients, all of that is totally normal. Don’t say you have an allergy when you don’t. Be nice to the servers. Don’t go into the kitchen or behind the bar. \n\nWhat I do when going to restaurants is I always read the menu before hand online, I ask questions about preparation styles (this says it has onions, are they raw? Could I have them cooked or removed?) and I chose cuisines that I either know I enjoy or I suspect I will enjoy. \n\nI also NEVER return a plate unless it’s something that can be fixed without wasting food. Like an undercooked steak, they don’t have to throw that out, it just needs more time on the grill. \n\nIn the end of the day, just calmly communicate what you are looking for, ask questions, and tip 20%.",
      "created_utc": 1699542280.0,
      "score": 14,
      "context": []
    },
    {
      "id": "k8in13u",
      "author": "Phlebbie",
      "body": "When I worked food service I loved regulars who were consistent with their orders. As a person with arfid, the people at the restaurants I visit love me. It's really fun when they just say \"the usual?\" And give me exactly what I want.",
      "created_utc": 1699546437.0,
      "score": 16,
      "context": []
    },
    {
      "id": "k8i4ty8",
      "author": "not-patrickstar",
      "body": "I go to different Taco Bell’s to avoid the shame of being recognized for me ordering the same thing everyday",
      "created_utc": 1699539384.0,
      "score": 13,
      "context": []
    },
    {
      "id": "k8ijavx",
      "author": "angeltay",
      "body": "My safe food is Taco Bell but because I’m a vegetarian I swap out all the beef for black beans. The Taco Bell subreddit came across my feed and there was a post from an employee talking about customized items. I asked if it was hard to swap the beef out for beans and a bunch of employees said no. I felt a lot better after that!\n\nI also used to work at a coffee shop that was a busy delivery location. There were people who would order delivery every day. The most I ever thought was, “Oh, it’s so and so!” Or, “What?? Switching it up today?? :0” if they changed their regular order. I never thought they were weird for ordering in every day. We had people who came in person every day, it’s basically the same thing. There’s probably people who go in person every day to the same restaurants you’re ordering in from often.",
      "created_utc": 1699545059.0,
      "score": 13,
      "context": []
    },
    {
      "id": "k8i5l1x",
      "author": "anxiety_ftw",
      "body": "There's a pizza place close to where I live and I always order a single Margherita and never anything else. I've ordered from it so many times I've started to get discounts and free lollipops with each order.",
      "created_utc": 1699539697.0,
      "score": 11,
      "context": []
    },
    {
      "id": "k8ilf7y",
      "author": "Nervous-Worry6092",
      "body": "I’m going through a pretty tough period right now\n\nI cycle through a few different Pizza Huts and two of them know me by name and my order: personal pizza with pineapple and pepperoni",
      "created_utc": 1699545839.0,
      "score": 8,
      "context": []
    },
    {
      "id": "k8irly3",
      "author": "honest-ingenuity-316",
      "body": "I go to Mexican restaurants and order a burger and fries, I think they’ve cracked the code",
      "created_utc": 1699548121.0,
      "score": 5,
      "context": []
    },
    {
      "id": "k8jhx29",
      "author": "narcoed",
      "body": "Before I moved cities, my local chick fil a recognized me every time I went through the drive thru. They recognized me so much that I didn’t even need to order anymore, I would pull and and the worker would say “number 1 with no pickles and sweet tea?” I loved it. They always got my order right and sometimes I would get extra food.",
      "created_utc": 1699557508.0,
      "score": 5,
      "context": []
    },
    {
      "id": "k8jysm2",
      "author": "Chemical-Damage-870",
      "body": "Seriously don’t worry about it. When I worked in restaurants it was fun to ask “the usual?” I never once make fun of anyone for just having a usual and I was young and stupid. Hell I don’t even have ARFIDS and every night back then I had a grilled cheese with extra pickles for my shift meal. Every time. Now I have a 9 year old son. He’s eaten the same meal at Wendy’s “Chicken Nugget Meal, regular nuggets, no sauce, sweet tea” since he was old enough to stop the kids meal. Nothing else. Not once. And usually multiple times a week. Never liked any other nuggets ever. I do this All. The. time. And we do door dash a lot. No one cares one bit",
      "created_utc": 1699563540.0,
      "score": 3,
      "context": []
    },
    {
      "id": "k8klrav",
      "author": "celestier",
      "body": "Every time I go to subway the workers there always express how much they like my order since it's so simple, plainest sub ever, just ham on Italian herb and cheese bread ☠️",
      "created_utc": 1699572183.0,
      "score": 3,
      "context": []
    },
    {
      "id": "k8kngev",
      "author": "sharkprincefishstick",
      "body": "The Walmart pickup people probably get my list ahead of time at this point. \n\n“Two bags of Tyson Fun Nuggets, four Gatorade Fits, two boxes confetti cake Pop Tarts, and a 12pk of ginger ale? That’s Fish’s order alright.” -My Walmart shopper, probably.",
      "created_utc": 1699572879.0,
      "score": 3,
      "context": []
    },
    {
      "id": "k8iyv8l",
      "author": "SnooDogs6359",
      "body": "me when I go to McDonald’s and order a cheeseburger “plain with only meat cheese and LIGHT onions”",
      "created_utc": 1699550727.0,
      "score": 2,
      "context": []
    },
    {
      "id": "k8jaiul",
      "author": "KrustenStewart",
      "body": "Back in the beginning of the year I was obsessed with this one restaurants chicken tenders I would order them 2-5 times a week for like 3-4 months then one day they were closed for good!! I’ve never recovered",
      "created_utc": 1699554882.0,
      "score": 2,
      "context": []
    },
    {
      "id": "k8jbt95",
      "author": "doguillo77",
      "body": "I work in fast food, and I love getting those orders! After that person orders the same thing a few times, I have their order memorized, so if I see them walking in I can get their food started while they’re waiting in line to order. Makes my job easier, and they get their usual order faster!\n\nI do also understand the anxiety from the customers POV. I *hate* being perceived, so once the staff starts to recognize me at specific restaurants and try to have small talk, I stop going in person 😭",
      "created_utc": 1699555338.0,
      "score": 2,
      "context": []
    },
    {
      "id": "k8jsqnn",
      "author": "eaterofgoldenfish",
      "body": "The people at my local chinese restaurant know me as the person who makes an order of 4 large cartons of egg drop soup every other week or so, which I'll eat over a number of days for every meal. They think I'm weird, but are really nice about it.",
      "created_utc": 1699561358.0,
      "score": 2,
      "context": []
    },
    {
      "id": "k8jw8o9",
      "author": "Pink_Dress",
      "body": "Ex Restaurant Worker here! Idk if it’s because I shave dietary restrictions, but I literally didn’t give a single f what people ordered and would usually tell them cheaper ways to achieve their desired meal. But in hindsight, I’ve never cared about what people eat so long as I’m not forced to eat it too 😅",
      "created_utc": 1699562621.0,
      "score": 2,
      "context": []
    },
    {
      "id": "k8kb9yu",
      "author": "calamitylamb",
      "body": "\"If we want the rewards of being loved we have to submit to the mortifying ordeal of being known.\"\n\nThere’s nothing wrong with being a recognizable customer! Be good to the restaurant workers and they shall be good to you! Regulars who are polite and tip appropriately are beloved of the staff. It’s okay to get the same thing all the time - think about it as a compliment to the chef!\n\nSome people have already made great points about acceptable modifications to menu items, so as long as you’re sticking within those guidelines don’t be pressed about your ordering habits. And always be sure to tip appropriately as well! If workers recognize your order, they’ll probably also remember that you were polite and a good customer.",
      "created_utc": 1699568078.0,
      "score": 2,
      "context": []
    },
    {
      "id": "k8kzpdb",
      "author": "Calm-Syllabub4519",
      "body": "There’s a restaurant I frequent in person a lot and I changed my order to a club sandwich one day instead of my usual grilled cheese and our waitress jokingly freaked out because she’s never seen me order anything but a grilled cheese lol. I think it makes them happy to know somebody has a routine and supports their business as part of it",
      "created_utc": 1699577968.0,
      "score": 2,
      "context": []
    },
    {
      "id": "k8m2pvq",
      "author": "Accomplished_Goal763",
      "body": "I’m a cook at a restaurant. I order DoorDash up to 3 times per day, half the time I don’t even eat the food. Sometimes I fall asleep and when I wake up, find the delivery sitting in front of my door. It can sit there for up to 10 hours. I feel extreme guilt due to this. I have ADHD as well, and my impulsivity is out of control. Sometimes I order from 3 different places at the same time so I can enjoy my meal, since I usually only like 1 or 2 off things from a single restaurant. \n\nSo… when I see the same people ordering the same thing almost daily at work, I never judge. I totally sympathize with them and even remember them by name. I spent 3 hours browsing DoorDash today and ordered nothing. I feel so guilty because I feel like wasting money on food that I end up not eating or eating 1/4 of my food is shitty of me, so tonight I ordered nothing. For the life of me, I cannot cook at home even tough I love being a cook at my little restaurant. I had nothing to eat today. I have hunger but no appetite, and tons of guilt. Over the course of the last 14 hours, I have filled 5 different DD carts with food from different restaurants and at the end decided that it’s not worth spending money to feed myself when I don’t even have an appetite. The hunger pangs though… 😓",
      "created_utc": 1699596280.0,
      "score": 2,
      "context": []
    },
    {
      "id": "k8jyk3s",
      "author": "MrSeanSir2",
      "body": "I went to a Red Robin recently and the waitress was pretty happy with the simplicity of my plain hamburger!",
      "created_utc": 1699563454.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k8kanze",
      "author": "kathvrt",
      "body": "The McDonalds drive thru people are so sick of me lmaooo",
      "created_utc": 1699567849.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k8m7x8y",
      "author": "iloveyoumiri",
      "body": "I’m a young alcoholic and I’m well remembered by the people where I get my booze. Half of them are happy to see me and half barely make eye contact",
      "created_utc": 1699599698.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k8n1jzu",
      "author": "wadingthroughtrauma",
      "body": "Lol all hail Linda who greets me with “the usual?” 7 years I’ve been going to that place.",
      "created_utc": 1699620890.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k8nbeov",
      "author": "UnderwaterParadise",
      "body": "As soon as a restaurant employee makes a comment like they’ve seen me before, or they know my order based on my face/name, or any kind of joke about it, I am so embarrassed I will never ever be seen in that establishment again.\n\nThere’s exactly one establishment that is an exception, been getting mac and cheese there once a month or so for the last decade and the one head waitress is really nice. That one feels less embarrassing because I was a child being taken there by my parents when I first started going.\n\nIt’s weird that I feel this way because I worked in fast food for 8 years, had lots of regulars with similar/same orders and I didn’t judge them one bit (unless it was for being assholes)",
      "created_utc": 1699625503.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k8ijl9p",
      "author": "angeltay",
      "body": "Finally remembered to tell my favorite breakfast restaurant (that I’ve been going to regularly for years) to not give me syrup with my waffles because I won’t use it and I don’t want to waste their syrup 😭",
      "created_utc": 1699545165.0,
      "score": 21,
      "context": [
        {
          "id": "k8i0bfx",
          "author": "None",
          "body": "Equally number of restaurant staff pissed off at complicated and unreasonable orders 😂\n\ni want a Caesar salad no dressing (yes no dressing -like, at all, not on the side) and croutons and cheese toppings in separate dishes on the side. \n\nThen eating Caesar salad with hands to pick out the middle white bit and craft an assembly line spanning the booth constructing each bite.",
          "created_utc": 1699537410.0
        }
      ]
    },
    {
      "id": "k8i0iqi",
      "author": "dumbroad",
      "body": "at least we're self aware it can be annoying 😂",
      "created_utc": 1699537502.0,
      "score": 11,
      "context": [
        {
          "id": "k8i0bfx",
          "author": "None",
          "body": "Equally number of restaurant staff pissed off at complicated and unreasonable orders 😂\n\ni want a Caesar salad no dressing (yes no dressing -like, at all, not on the side) and croutons and cheese toppings in separate dishes on the side. \n\nThen eating Caesar salad with hands to pick out the middle white bit and craft an assembly line spanning the booth constructing each bite.",
          "created_utc": 1699537410.0
        }
      ]
    },
    {
      "id": "k8i9gbk",
      "author": "ToukaMareeee",
      "body": "Same, work in food service too. I actually tend to do a little bit extra for regulars I like, at least where I can (luckily my boss is chill and has the same attitude).\n\nSo don't worry too much OP. either they don't care/don't notice or they like you a lot.",
      "created_utc": 1699541284.0,
      "score": 23,
      "context": [
        {
          "id": "k8i2dht",
          "author": "OpheliaJade2382",
          "body": "Tbh they probably love you. I used to get excited about regulars when I worked in food service",
          "created_utc": 1699538325.0
        }
      ]
    },
    {
      "id": "k8m31cs",
      "author": "ReneeLouvier",
      "body": "THIS. ALL OF THIS. ^^^ Bless you for this information. It should be pinned as the golden rules of ARFID dining. \n\nThank you",
      "created_utc": 1699596476.0,
      "score": 5,
      "context": [
        {
          "id": "k8ibz3w",
          "author": "CorpseProject",
          "body": "Im a picky arfid eater but also have 18 years of both BOH and FOH under my belt. \n\nWe don’t mind you. There’s a few rules to abide by though: don’t try to make up your own recipe and have the cook make it. Food temps, removing certain ingredients, all of that is totally normal. Don’t say you have an allergy when you don’t. Be nice to the servers. Don’t go into the kitchen or behind the bar. \n\nWhat I do when going to restaurants is I always read the menu before hand online, I ask questions about preparation styles (this says it has onions, are they raw? Could I have them cooked or removed?) and I chose cuisines that I either know I enjoy or I suspect I will enjoy. \n\nI also NEVER return a plate unless it’s something that can be fixed without wasting food. Like an undercooked steak, they don’t have to throw that out, it just needs more time on the grill. \n\nIn the end of the day, just calmly communicate what you are looking for, ask questions, and tip 20%.",
          "created_utc": 1699542280.0
        }
      ]
    },
    {
      "id": "k8ic98y",
      "author": "CorpseProject",
      "body": "You don’t have to do that, I’ve worked fast food and literally no one there cares that you come in for the same thing everyday. Just be nice to people.",
      "created_utc": 1699542390.0,
      "score": 16,
      "context": [
        {
          "id": "k8i4ty8",
          "author": "not-patrickstar",
          "body": "I go to different Taco Bell’s to avoid the shame of being recognized for me ordering the same thing everyday",
          "created_utc": 1699539384.0
        }
      ]
    },
    {
      "id": "k9e7eqs",
      "author": "Stronghold257",
      "body": "I always go to the same one because I find it’s usually better quality than others. I also always ask for no ice in my drink, and since I get mobile orders a lot I’ve often had workers recognize me and do the no ice before I even ask.",
      "created_utc": 1700074733.0,
      "score": 1,
      "context": [
        {
          "id": "k8i4ty8",
          "author": "not-patrickstar",
          "body": "I go to different Taco Bell’s to avoid the shame of being recognized for me ordering the same thing everyday",
          "created_utc": 1699539384.0
        }
      ]
    },
    {
      "id": "k8m367c",
      "author": "ReneeLouvier",
      "body": "My favorite type of pizza. 💕",
      "created_utc": 1699596556.0,
      "score": 2,
      "context": [
        {
          "id": "k8ilf7y",
          "author": "Nervous-Worry6092",
          "body": "I’m going through a pretty tough period right now\n\nI cycle through a few different Pizza Huts and two of them know me by name and my order: personal pizza with pineapple and pepperoni",
          "created_utc": 1699545839.0
        }
      ]
    },
    {
      "id": "k8mj19y",
      "author": "princesasha",
      "body": "last time the worker made fun of my sub after i already was waiting 30 minutes for a MOBILE order ….. i was FUMING LMFAOOOO.",
      "created_utc": 1699608306.0,
      "score": 2,
      "context": [
        {
          "id": "k8klrav",
          "author": "celestier",
          "body": "Every time I go to subway the workers there always express how much they like my order since it's so simple, plainest sub ever, just ham on Italian herb and cheese bread ☠️",
          "created_utc": 1699572183.0
        }
      ]
    },
    {
      "id": "k8ijtfv",
      "author": "angeltay",
      "body": "Same. Ooh, this regular ordered a banana bread, but we’ve sold so little today that we’ll be throwing out almost a whole loaf at the end of the night. You get two banana breads, friend.",
      "created_utc": 1699545249.0,
      "score": 18,
      "context": [
        {
          "id": "k8i2dht",
          "author": "OpheliaJade2382",
          "body": "Tbh they probably love you. I used to get excited about regulars when I worked in food service",
          "created_utc": 1699538325.0
        },
        {
          "id": "k8i9gbk",
          "author": "ToukaMareeee",
          "body": "Same, work in food service too. I actually tend to do a little bit extra for regulars I like, at least where I can (luckily my boss is chill and has the same attitude).\n\nSo don't worry too much OP. either they don't care/don't notice or they like you a lot.",
          "created_utc": 1699541284.0
        }
      ]
    },
    {
      "id": "k8ipojd",
      "author": "ToukaMareeee",
      "body": "Lmao exactly that hahaha. I sorta work in a sorta bakery at a holiday park, so we bake some breads they can have for breakfast. They can also order the fya before so we pack them before they enter. \n\n\"so you always order a bunch of cinnamon rolls? Well turned out the delivery went wrong and only have one left for direct sell. I'm not gonna sell just one cinnamon roll, have an extra for the little one bestie\"\n\nSo conclusion if you're a regular. The staff loves you, you have a reputation, a very good one. No matter how weird your orders are. No matter how things are going in life, you can always rely on Monday Mike. And Mike is missed if he doesn't order one Monday, the crew is in panic, what if he's dead? And there's a relief if he orders again. So if you as a regular get something extra for no charge sometimes, it's probably not a coincidence, rather a huge compliment",
      "created_utc": 1699547413.0,
      "score": 14,
      "context": [
        {
          "id": "k8i2dht",
          "author": "OpheliaJade2382",
          "body": "Tbh they probably love you. I used to get excited about regulars when I worked in food service",
          "created_utc": 1699538325.0
        },
        {
          "id": "k8i9gbk",
          "author": "ToukaMareeee",
          "body": "Same, work in food service too. I actually tend to do a little bit extra for regulars I like, at least where I can (luckily my boss is chill and has the same attitude).\n\nSo don't worry too much OP. either they don't care/don't notice or they like you a lot.",
          "created_utc": 1699541284.0
        },
        {
          "id": "k8ijtfv",
          "author": "angeltay",
          "body": "Same. Ooh, this regular ordered a banana bread, but we’ve sold so little today that we’ll be throwing out almost a whole loaf at the end of the night. You get two banana breads, friend.",
          "created_utc": 1699545249.0
        }
      ]
    }
  ]
}