{
  "id": "182ch62",
  "subreddit": "ARFID",
  "author": "ampupdaswag",
  "created_utc": 1700777905.0,
  "title": "Are all of you really skinny?",
  "selftext": "I definitely have ARFID. When I was younger I was always super skinny because schools controlled the menu and I only ate on grilled cheese and chicken nugget day. Now that I’m grown and bring my own lunch to work and choose what to get from the grocery store, it’s like I’ve been making up for lost time, and sometimes I just keep on eating. I am no longer skinny or even normal weight.\n\nFrom what I’ve read, everyone here is skinny. Is that true?\n\nAlso, a big victory I’ve had over the past year is adding tomatoes. If they’re thinly sliced, I can eat them on a ham sub or on burgers. Haven’t been able to share with people what a big deal this is because they don’t understand.\n\nNext goal is either beans, corn, tomatoes in salads, or bananas.\n\nCheers",
  "url": "https://www.reddit.com/r/ARFID/comments/182ch62/are_all_of_you_really_skinny/",
  "score": 116,
  "num_comments": 158,
  "comments": [
    {
      "id": "kahu1vx",
      "author": "Candlewaxeater",
      "body": "I know alot of people here actually struggle with weight because their safe foods are high in calories unfortunately :(",
      "created_utc": 1700778580.0,
      "score": 303,
      "context": []
    },
    {
      "id": "kai0idx",
      "author": "chernygal",
      "body": "Nope. I’m fat.",
      "created_utc": 1700781615.0,
      "score": 94,
      "context": []
    },
    {
      "id": "kahv99a",
      "author": "castroski7",
      "body": "I went from very skinny all life to now only eating super compulsively so ive gained a lot of weight so now my ossues with body image and eating became worse!",
      "created_utc": 1700779134.0,
      "score": 54,
      "context": []
    },
    {
      "id": "kahv61x",
      "author": "None",
      "body": "No a lot of people with arfid have safe foods that consist of fried foods and sweets so they end up eating it in abundance because they’re not getting the right nutrients outside of it, you don’t even have to be skinny to be anorexic. Eating disorders lie to us friend. Try not to compare yourself to others, but yea many arfid sufferers are overweight or obese, many of us are also thin or underweight…weight is one of the least important factors in an arfid diagnosis or treatment.",
      "created_utc": 1700779092.0,
      "score": 117,
      "context": []
    },
    {
      "id": "kahwb1i",
      "author": "sleeping-all-day",
      "body": "I'm average weight. A lot of people here have varying weights.   \n\n\nCongrats on the victory!",
      "created_utc": 1700779620.0,
      "score": 29,
      "context": []
    },
    {
      "id": "kai1omz",
      "author": "therealganjababe",
      "body": "Nope, all my safe goods are crap, so combined with mental health issues, sadly I'm obese. Trying to diet/eat healthy is basically impossible.",
      "created_utc": 1700782178.0,
      "score": 20,
      "context": []
    },
    {
      "id": "kahyqgv",
      "author": "Socke_on_the_road",
      "body": "I've also wondered about that because a lot of resources about ARFID talk about people being underweight while not mentioning the opposite at all and I've seen people here struggeling with that as well. But I'm overweight. My safe foods are mainly high calorie foods and I tend to compensate not having any food when I'm out with a lot of food when I get home. Also after not getting to have safe foods and being forced to eat foods that made me puke a lot when I still lived with my parents lead to me 'shoveling' my safe foods in every day when I moved out and got to decide everything on my own. I couldn't get my mind to change from 'eat as much as you can, you might not get safe food for the next week' to 'it's fine, you can have this every day now, a normal portion is enough' for a long time.\n\nCongrats on your victory with the tomatoes!",
      "created_utc": 1700780754.0,
      "score": 14,
      "context": []
    },
    {
      "id": "kahwyq3",
      "author": "smoothBrainEnby",
      "body": "I classify as obese on the bmi(the bmi is bs though). But then again my main safe food is pizza so it checks out i guess",
      "created_utc": 1700779923.0,
      "score": 32,
      "context": []
    },
    {
      "id": "kahu2ib",
      "author": "None",
      "body": "im very skinny",
      "created_utc": 1700778588.0,
      "score": 29,
      "context": []
    },
    {
      "id": "kahxwjc",
      "author": "Interesting-Cow8131",
      "body": "I'm very underweight between texture issues with food and battling anorexia it's hard to keep weight on",
      "created_utc": 1700780361.0,
      "score": 24,
      "context": []
    },
    {
      "id": "kai0lm9",
      "author": "Middle-Dot-2231",
      "body": "im very big, im not sure if numbers are allowed in this subreddit so i won't mention specifics but even at my highest weight, i was diagnosed with ARFID. restrictive doesn't necessarily always mean amount, it also means food variety. i eat pretty much only meat that's almost burnt it's so well done and carbs. i can eat a few fruits and veggies but it's very limited",
      "created_utc": 1700781656.0,
      "score": 11,
      "context": []
    },
    {
      "id": "kai2jad",
      "author": "Complete-One-5520",
      "body": "ARFID means you only eat certain things. Not that your eat nothing and not that those things are healthy.",
      "created_utc": 1700782605.0,
      "score": 9,
      "context": []
    },
    {
      "id": "kai74ms",
      "author": "Littlerainbow02",
      "body": "I´m personally underweight, but it depends on what your arfid type is and what are your safe foods. So you can pretty much be anywhere on the weight spectrum and still have arfid",
      "created_utc": 1700784883.0,
      "score": 10,
      "context": []
    },
    {
      "id": "kahxpsw",
      "author": "aroaceautistic",
      "body": "Im kind of fat. I don’t eat well but I don’t lose weight",
      "created_utc": 1700780274.0,
      "score": 5,
      "context": []
    },
    {
      "id": "kai5zuy",
      "author": "krk737",
      "body": "I had similar trajectory to you. I was very thin prior to being an adult with agency to buy/pick all of my own food. Now I’m both slightly overweight but with many vitamin deficiencies",
      "created_utc": 1700784327.0,
      "score": 5,
      "context": []
    },
    {
      "id": "kai76cz",
      "author": "xtinalaperra",
      "body": "Myself no! My safe foods are junk food (nuggets, fries, pizza) so I’m on the thicker side. However I tend not to eat a lot (I’ll eat twice a day most days with little to no snacks) so my weight can fluctuate.",
      "created_utc": 1700784907.0,
      "score": 4,
      "context": []
    },
    {
      "id": "kai7cb2",
      "author": "scared_sage",
      "body": "I'm overweight and my safe good is a 10 piece nugget and fries from McDonalds 😭",
      "created_utc": 1700784986.0,
      "score": 4,
      "context": []
    },
    {
      "id": "kai9lkl",
      "author": "NoIron9582",
      "body": "I've anyways been pretty skinny.  Between AFRID and my metabolism , I can't keep weight on . I was sick recently and lost about ten lbs , and I'm desperately trying to get it back .",
      "created_utc": 1700786098.0,
      "score": 4,
      "context": []
    },
    {
      "id": "kaigg1b",
      "author": "throwawaii4646",
      "body": "Nope I’m the complete opposite of skinny. ARFID is just one thing that makes my weight v high because my safe foods are not healthy at all and I struggle to eat healthy food at all if I’m honest. Currently trying to expand the foods I eat but it’s slow going so well done on the tomatoes, that’s amazing. I hope you reach your goals whatever they are 😊",
      "created_utc": 1700789542.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kai0u1i",
      "author": "Ru_rehtaeh",
      "body": "Nah I’m fat af lol. But in all seriousness, I’ve been loosing weight as I’ve been working to incorporate more foods into my diet that aren’t as calorie dense as my safe foods. Congrats on the tomatoes! Today I ate some cut up banana in pudding and felt super accomplished!",
      "created_utc": 1700781766.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kai1rod",
      "author": "Jan242004",
      "body": "I’m extremely skinny",
      "created_utc": 1700782221.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kai53bu",
      "author": "NothingButUnsavoury",
      "body": "I am quite thin, yes",
      "created_utc": 1700783874.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kai5y9o",
      "author": "None",
      "body": "My foods of choice are all absurdly unhealthy. I used to be underweight to the point of near starvation because my limited diet was accompanied by a severe anxiety of eating in of itself (I used to have obsessive thoughts about being poisoned or choking). \n\nNow, I can generally stomach any quantity but the nutritional value is lacking. I really struggle with eating very little but it is so dense in calories that I sometimes eat thousands of calories and its just chocolate and wine or whatever.",
      "created_utc": 1700784305.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kai7iv2",
      "author": "StarsInTheCity-",
      "body": "I’m skinny but not underweight.  I was pretty underweight in highschool when my anxiety based ARFID wasn’t controlled but now that I’m on anxiety meds, it’s a lot better (still not great by any means but better than it used to be).\n\nAs others here have said though, a lot of people with ARFID have safe foods that are quite unhealthy so not everyone with it is thin!",
      "created_utc": 1700785076.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kaiaa14",
      "author": "funkydyke",
      "body": "I’m obese",
      "created_utc": 1700786427.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kaied2x",
      "author": "capitannn",
      "body": "Depending on what you can eat and your eating habits it will vary from person to person. The majority of us are probably skinnier. Weight gain and loss is all calorie intake and there are ways to lessen that in safe and healthy ways if you are overweight.",
      "created_utc": 1700788487.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kai3j4u",
      "author": "Fr3nchT0astCrunch",
      "body": "I'm a big dude\n\nFortunately I'm not becoming bigger...somehow",
      "created_utc": 1700783099.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kai9tnj",
      "author": "dontdrinkgermx",
      "body": "definitely not, lol. I've always had more of an athletic, curvy build. not being able to exercise due to chronic pain has made it difficult to maintain a steady weight, especially being 18 and having my body still growing and changing. my safe foods are mostly carbs, dairy, fruits, etc, and since I already have a slow metabolism due to arfid, my body stores more fat in case I forget to eat and accidentally burn too many calories.",
      "created_utc": 1700786206.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kaianjb",
      "author": "None",
      "body": "&#x200B;\n\n&#x200B;\n\nNo, but then again I was never skinny. I'm 6'4\" and currently about 325 pounds, though I'm working on losing some. I'm hoping to get back down to at least 270 or 280 at some point. I got up to my current weight due to binge eating a ton of candy while going through a divorce a few years ago.",
      "created_utc": 1700786611.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kaiaxak",
      "author": "Herb_the_Nerd",
      "body": "I’m a pretty average weight, maybe a bit under. This is bc the few foods I eat are pretty high calorie, so it evens out",
      "created_utc": 1700786747.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kaicoqb",
      "author": "LookOk8134",
      "body": "I am actually a bit overweight right now but thats because my comfort foods are high in calories and I havent been exercising as much as I used to so the calories have been catching up I wish I could make changes to my diet but ARFID keeps me bound to only comfort food as you know so I'm trying to redevelop my active habits again.",
      "created_utc": 1700787633.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kaidb1y",
      "author": "eliaspen18",
      "body": "unfortunately i’ve always been heavy all of my life. 21f and though i don’t rly look it i weigh around 280",
      "created_utc": 1700787947.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kaiimm5",
      "author": "Dezert956",
      "body": "Nope! I'm an average and healthy weight :D\n\nI worked hard to get to it, and equally hard to maintain it.",
      "created_utc": 1700790641.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kaik13m",
      "author": "Logical_Ad_9372",
      "body": "I’m a personal trainer, so my job is actually helping me progress! I’m still considered underweight!",
      "created_utc": 1700791339.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kail5i3",
      "author": "literallyzee",
      "body": "Yes, but I have ARFID due to contamination OCD/emetophobia. I didn’t realize the link until my late 20s when I was diagnosed with OCD. I’ve always been very thin, never weighing more than 110 lbs (except while I was pregnant, the ARFID took a backseat and I weighed 160 lbs with both of my pregnancies). \n\nHowever, as of right now I weigh the most I’ve ever weighed without being pregnant. I’m 36, 5’7” and weigh 130 lbs. I have been in pretty extensive therapy for the past year and I am taking mirtazapine (which helps increase appetite). \n\nMaybe since you’ve accomplished eating tomatoes on sandwiches, salads could be the next step! I’m a huge fan of bananas. If you like peanut butter, you could try sliced bananas on peanut butter toast. It’s a favorite of mine and it includes protein ☺️",
      "created_utc": 1700791898.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kainkty",
      "author": "ash_bomb",
      "body": "I was very skinny then my metabolism slowed down and now I'm gaining weight quickly.",
      "created_utc": 1700793132.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kaio6jj",
      "author": "None",
      "body": "Underweight, missed my period a few times this year :(",
      "created_utc": 1700793435.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kairrya",
      "author": "CriticalSorcery",
      "body": "Yes, I’m 85 pounds which is unhealthy and underweight.",
      "created_utc": 1700795222.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kaivaib",
      "author": "caress_me_down13",
      "body": "Personally I am underweight because my ARFID is 80% fear of getting sick and rightfully so if I may say because I have severe IBS and colon damage from an infection I had. Other 20% is textural and sensory. But even before the infection, I was underweight even though my safe foods are junk foods. Like I could survive off of bread and crackers and cookies. For me it’s partially my metabolism but I’ll also avoid more nutrient dense foods that I should be eating bc I don’t want to get sick",
      "created_utc": 1700797026.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kaixcq2",
      "author": "Autismsaurus",
      "body": "I struggle with ARFID and anorexia at the same time, so it's always a battle. My safe foods are calorie dense, and I get anxious about eating too much of them and gaining weight.  Of course, not eating my safe foods means I end up eating nothing at all.  \n\nI'm working on recovery from the anorexia with a nutritionist and an ED therapist, and am currently at 4'11 and exactly 100 lbs, which my disordered brain still thinks is too heavy.",
      "created_utc": 1700798111.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kaiz2fb",
      "author": "Majestic-Skirt475",
      "body": "I used to be really skinny then I started binging on the foods I do eat, now I’m just normal, bmi 21",
      "created_utc": 1700799027.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kaj641z",
      "author": "coinlockercorndog",
      "body": "unfortunately i am. my family on both sides are naturally skinny and i got hit with those genes. i had anorexia which developed into arfid, and then was on medication which made me incapable of eating anything for a couple months. and to top it all off all my safe foods are “watery foods” (like cucumber, watermelon, etc). so yeah there’s my story on why i’m skinny..",
      "created_utc": 1700803133.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kaj85e7",
      "author": "lily_fairy",
      "body": "im underweight but i have other health issues too",
      "created_utc": 1700804420.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kajdxmx",
      "author": "Roubaix718",
      "body": "I was extremely underweight my whole life. Recently my BMI entered the normal range after a ton of work.",
      "created_utc": 1700808368.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kajligj",
      "author": "ShadowFalcon1",
      "body": "Raised Vegan by my mother. I’m classified as extremely underweight. All of my safe foods are very low in nutrients and are mostly vegetables. I am also generally just avoidant of food.\nJust sharing my experience as I see a lot to the contrary here.",
      "created_utc": 1700814185.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kajluzp",
      "author": "SwampGothMillionaire",
      "body": "I'm a healthy weight. But I will start to drop weight if I'm not careful, so I have \"cheats\" to keep weight on (mainly by drinking liquid calories).",
      "created_utc": 1700814470.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kajqy6p",
      "author": "ItsVinn",
      "body": "I used to be very skinny, but because I’m able to drink shakes and like supplements on the side (+hitting the gym), I’m now on normal weight but I’m not someone who’s jacked or very muscular.",
      "created_utc": 1700818774.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kak6mpu",
      "author": "dainty_dryad",
      "body": "I've always been really thin my entire life (constantly accused of being anorexic kin d of thin). Recently though, after spending several months in an ED treatment program, I've managed to gain almost 20lbs, so at least I've got a little bit of cushioning now ^_^",
      "created_utc": 1700830758.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kak9hxt",
      "author": "Sweet-Repeat-6591",
      "body": "I am and was skinny even when I ate cheeseburgers all day. I am stuck on >! 39-41kg (170cm 5’7) !<",
      "created_utc": 1700832423.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kakdwos",
      "author": "damyourlogic",
      "body": "I have ARFID and I used to be VERY skinny. But I am not skinny anymore.",
      "created_utc": 1700834750.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kakgv8l",
      "author": "Cats_Riding_Dragons",
      "body": "I can’t speak for others but for me personally yes, the reason ARFID is a concern is cause im quite a bit underweight and its not healthy at all.",
      "created_utc": 1700836215.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kal0666",
      "author": "Volcanogrove",
      "body": "My weight is like a yo-yo going between healthy weight to slightly underweight. But weight doesn’t necessarily translate to skinniness, currently I’m just a couple pounds over underweight and I’ve got a bit of a tummy. My face looks skinny though and if I start losing weight it shows in my face before anywhere else",
      "created_utc": 1700844626.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kale8rf",
      "author": "lovetempests",
      "body": "My safe foods are primarily chocolate and fried foods (chicken, fries) and also pasta. And yet I’m very skinny with a really fast metabolism. These foods may be high calorie but I don’t binge on them or eat high amounts, always had low appetite as well as restrictive eating.\n\nRemember that no foods are bad foods.",
      "created_utc": 1700850307.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kalinr1",
      "author": "Ok_Slice5350",
      "body": "I’ve always been under weight. Just recently I gained 5 pounds and now I’m in the safe zone. It was so exciting :)",
      "created_utc": 1700852116.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kallwbz",
      "author": "blowblowinbaby",
      "body": "I am under 100lbs so I’d say I’m relatively skinny",
      "created_utc": 1700853444.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kalm6v6",
      "author": "Puzzleheaded-Lie-978",
      "body": "yeah im definitely underweight and have struggled with it all my life :/",
      "created_utc": 1700853560.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kam524c",
      "author": "wadingthroughtrauma",
      "body": "I’m very underweight",
      "created_utc": 1700861114.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kanfhls",
      "author": "onel0venik",
      "body": "Congrats on adding tomatoes! That’s amazing!",
      "created_utc": 1700881904.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kaospis",
      "author": "ifinnishboy1",
      "body": "I was just barely a normal weight, i may have dropped to underweight recently but i don't know",
      "created_utc": 1700914385.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kappi8v",
      "author": "giantsfan310",
      "body": "I’ve been underweight my entire life",
      "created_utc": 1700930378.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ln4lcmx",
      "author": "YujinRoisu",
      "body": "Yes. Not only that I also have a high metabolism. I get picky when comes to food and sometimes forget to eat food due to brain not working correctly. Resulting to a skinny body and below average underweight.",
      "created_utc": 1726340550.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kai3atv",
      "author": "throwaway_185051108",
      "body": "damn. this made me sad ngl… i’ve always struggled with weight because i mainly only like unhealthy food. is the stereotype that we’re skinny??? :(",
      "created_utc": 1700782984.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kai8xj9",
      "author": "angeltay",
      "body": "No, I’m a chubster. All my safe foods are high in fat, carbs and calories and I don’t work out, and since I only eat once a day, [my body is constantly in starvation mode, so I hold onto my calories.](https://www.healthline.com/nutrition/starvation-mode) It sucks ass to be 4’10” and stay at 130-40lbs (obese for height) no matter what :)\n\nEdit: also, I can see how this disorder differs based on this comment section, so I totally see how people with ARFID being underweight makes sense",
      "created_utc": 1700785772.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kai52ow",
      "author": "littleghool",
      "body": "I am the antithesis of skinny. Just because you have a specific diet doesn't automatically mean you're small or underweight.",
      "created_utc": 1700783865.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lin5s1e",
      "author": "No_Valuable_9313",
      "body": "My sisters BF (both 20) has arfid and only eats frozen burgers from a box however he has a large appetite and is on the heavier side. Being that my sister lives with him she has adhered to his diet as well as they can’t afford to make 2 separate meals for themselves… both of them have gained a substantial amount of weight",
      "created_utc": 1723939655.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5agvxj",
      "author": "grass_and_dirt",
      "body": "I'm currently mid-sized because my restriction has gotten much worse over the past few years, but I am not underweight at all. I was overweight and even obese at some point growing up, because all of my safe foods were ultra processed high-calorie foods, fast food, deep-fried type stuff.",
      "created_utc": 1735957532.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kal2o0x",
      "author": "sugaredsnickerdoodle",
      "body": "I'm in a weird spot where I have a \"desirable\" figure because I gain weight but only in my chest and butt. What this has resulted in though, is me literally having to buy bras from specialty websites because my chest is not proportional to my waist. It just keeps gradually growing over the years. I do gain weight very slowly but I think that's just a metabolism thing, my husband eats way better than I, he has no texture issues really and enjoys healthy food, but he is overweight simply because of his family genetics. His dad is the only skinny one after he got really sick at one point and couldn't eat, lost a lot of weight and everyone thought he was gonna die.\n\nI do think once I get older it's going to start catching up to me. I eat horribly. And while I look okay, I'm not in good health or shape. I have no muscle, all my weight that I do have is fat and I have really high cholesterol and I'm only almost 25. It's almost frustrating because I feel like most doctors looked at my external appearance and concluded I was healthy, the only reason I found out my cholesterol was so high is because I was required to get a blood test for ADHD medication.",
      "created_utc": 1700845644.0,
      "score": 0,
      "context": []
    },
    {
      "id": "kahy17w",
      "author": "poliebog",
      "body": "Personally, I think I went from weight based restrictive ed to an anxiety based ARFID. So yh, I used to be skinny, not anymore. I think I'm physically worse rn bc my food/nutrient intake is so much more limited",
      "created_utc": 1700780422.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kai2s4a",
      "author": "Firstnamedotcom",
      "body": "Just my legs and arms. I’m working on my chest,tummy love handles.",
      "created_utc": 1700782725.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kai7o16",
      "author": "geekgeek2019",
      "body": "I was pretty normal weighted till I got PCOS, gained lots of weight and can't lose weight anymore and Arfid of course makes it worse",
      "created_utc": 1700785147.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kai9ee4",
      "author": "anilucy",
      "body": "i have stomach fat but my legs and arms look like 2 twigs lol",
      "created_utc": 1700786000.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kaia8jl",
      "author": "Himynameisemmuh",
      "body": "I’ve been both overweight, extremely underweight and then now in between. In my overweight stages it was because I would eat so much of the few foods I was comfortable with, underweight it was when it started getting worse for me and even the foods I was comfortable with just weren’t cutting it for me. Now I’ve learned to eat the right amount even though it’s very selective stuff.",
      "created_utc": 1700786407.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kaielko",
      "author": "Traumarama79",
      "body": "I was significantly underweight from age 2 through 25; my final adult weight then was 80lbs. I gained 25lbs at age 25. I am now 120lbs in part because of my bipolar meds made me put some more on.",
      "created_utc": 1700788608.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kaieo2h",
      "author": "None",
      "body": "No I also struggle with anorexia tendencies as well but I binge and then restrict. My safe foods are all bread and cheese so I have a lot of bloat. I love sweets too. I am also pregnant again not that it counts but most healthy foods other than fruit are disgusting to me",
      "created_utc": 1700788643.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kaifrng",
      "author": "BrandNewSidewalk",
      "body": "I have PCOS and diabetes.  I take insulin.  I should be on a very low carb diet but most meat and veggies are not in my safe food list.  So no lol I've never been skinny in my life.  Even when on a <1000 calorie a day diet I can't get skinny.",
      "created_utc": 1700789197.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kaigf17",
      "author": "_mnmlst",
      "body": "I was in the beginning but I’ve been obese for the majority of it.",
      "created_utc": 1700789529.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kaiirga",
      "author": "anonymous-musician",
      "body": "I've always struggled with being overweight, all my safe foods are super unhealthy, and I have a tendency to binge eat them.",
      "created_utc": 1700790708.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kaik2ng",
      "author": "nashamagirl99",
      "body": "I’m not skinny or fat. My weight has varied but always been in the normal BMI range.",
      "created_utc": 1700791361.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kailvgo",
      "author": "None",
      "body": "No. I wish. I’m overweight by at least 30 pounds.",
      "created_utc": 1700792267.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kaimif0",
      "author": "SnekkinHell",
      "body": "Nope around 125kg, and about 5\"10 I think. I'm pretty sure I have arfid and my tea for over the past decade has mostly consisted of some form of breaded chicken (nuggets, tenders, schnitzels) and chips/wedges and always bbq sauce.\n\nThere's other stuff I eat but not much that's a meal.",
      "created_utc": 1700792589.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kainnur",
      "author": "k8freed",
      "body": "I’m typically within a healthy weight range, but I fluctuate wildly within my weight range due to ARFID cycling. I’m short, so it’s somewhat noticeable. But even if my weight seems fine, barely eating for days at a time still takes its toll.",
      "created_utc": 1700793175.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kaio79c",
      "author": "SadisticGoose",
      "body": "Was a fat kid. Now I’m a fat adult. Every single piece of nutrition advice for weight loss is just foods I can’t eat. The only other option for weight loss is starving myself again.",
      "created_utc": 1700793444.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kairjkk",
      "author": "Double_Driver_4965",
      "body": "I’ve gone from being severely underweight and slightly overweight for my height. But at the moment I’m at a healthy weight, but I can attribute that to living mainly off of protein shakes/nutritional drinks. If you have the money protein shakes really help maintain a heathly weight, nobody would guess I have an extremely limited diet unless they spend a day with me.",
      "created_utc": 1700795108.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kais9lo",
      "author": "surrrita",
      "body": "No. I’m obese- combo of genetics and alternating safe foods being pizza and tacos.",
      "created_utc": 1700795472.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kaisuv4",
      "author": "mitchwalks",
      "body": "No. So for me I wouldn't eat unless there were safe foods, and when there were safe foods I ate A LOT of it because I didn't know when there would be safe foods again. As an adult it's been very hard to break that pattern and I still tend to overeat when there are safe foods at a meal. My safe foods are also high in carbs so that doesn't help.",
      "created_utc": 1700795775.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kaiuu06",
      "author": "spacedude2076",
      "body": "I don’t eat much food, but the food I do eat is unhealthy. My BMI is almost exactly in the middle if not slightly more. Even though I’m at a healthy weight I doubt I’m eating good.",
      "created_utc": 1700796793.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kaivqd2",
      "author": "ruthapplejuice",
      "body": "was bigger for most of my life but thinned out in my 20s. definitely the skinniest i’ve ever been currently at 28",
      "created_utc": 1700797257.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kaiwpp2",
      "author": "Prettynoises",
      "body": "I used to be, but not anymore. I don't know if I'd consider myself fat, but I do have a bit of a tummy. My arms don't have much flavor but I think it's heading in that direction due to my chronic illness and being pretty much unable to exercise aside from physical therapy (joint pain + cane usage). \n\nI eat vegetables and stuff I just don't eat very much of them, and probably eat more processed foods than anything. Not being able to cook makes it hard, and I don't cook with meat either and I dislike most vegan options so... I drink meal replacement shakes for protein. Honestly the meal replacement shakes apparently make you gain weight so it makes sense that I'd continue to gain weight while I'm on them. Since I'm also eating other foods most of the time.",
      "created_utc": 1700797777.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kaiwz0u",
      "author": "swansey_",
      "body": "I'm average weight but I was dangerously underweight my whole life. It was scary because I got sick with the stomach flu for a few days I would quickly lose so much weight they would threaten to hospitalize me.",
      "created_utc": 1700797910.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kaiyu2g",
      "author": "Lyllyanna",
      "body": "Yeah i think a good chunk of us are overweight. All my safe foods are high in calories or carbs, and really unhealthy. The healthy stuff seems to have too much variability— vegetables and meat cuts can be different every time you eat them. French fries and Doritos are the same every time! I honestly WISH i could find things I liked the texture of, was consistent, and healthy. I wish I could eat all the things everyone else can. I wish I was thinner and healthier, to be honest. But it’s so hard…",
      "created_utc": 1700798901.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kaiywrh",
      "author": "NoAstronomer3244",
      "body": "I USED to be until my ARFID came back and I gained 30 pounds. It sucks. It's because most of my safe food isn't healthy or good for me. Chicken nuggets, burgers, pizza, sushi, etc.",
      "created_utc": 1700798942.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kaizk5e",
      "author": "atuasaysyes",
      "body": "Yeah, i have AFRID and im underweight or atleast much skinner compared to my weight but i dont think its because AFRID people eat less or not wholly but probably because of faster metabolism but its def a part of low appetite/ not having a lot of food",
      "created_utc": 1700799290.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kaizp0o",
      "author": "Bankerlady10",
      "body": "Ha! No. My safe foods are cheeses and starches.",
      "created_utc": 1700799363.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kaiztss",
      "author": "calmingthechaos",
      "body": "I'm considered obese. The foods I eat are a lot of carbs. Actually, one of my biggest frustrations is that people assume I overeat and eat a lot of food at one time when I barely eat two meals a day with very minimal snacking. (As in, I don't eat anything between meals on the days I work and I might have a small bag of chips like the 50c ones or some fruit snacks or something on my day off.) I don't enjoy food. Food just gives me tons of anxiety, and I'm bored with all my safe foods.",
      "created_utc": 1700799435.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kaj1wbp",
      "author": "Sweetheart846",
      "body": "I’m not, my safe foods are all high in carbs/fat (pasta, bread, crackers, pastries, pizza, chips) it’s hard for me to eat any vegetables, fruits or meat and it’s gotten so bad that I will only eat meat around once every four months, fruit around once a year and vegetables around once every two months. As you can probably guess this makes me put on a lot of weight and has stunted my growth as this started when I was 13",
      "created_utc": 1700800596.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kaj2zmy",
      "author": "princessalyss_",
      "body": "I’m about as skinny as a beluga whale. \n\nMy diet is very beige and very high in calories :/",
      "created_utc": 1700801240.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kaj39ok",
      "author": "Aspennie",
      "body": "Nah, I’m kinda… slim thick is I guess the wording. I’ve got lots of weight on my thighs, my legs used to be pretty thin.",
      "created_utc": 1700801405.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kaj3brt",
      "author": "dizzycow84",
      "body": "Nope, nooooo. My safe foods are whatever keep my Pots at bay. Which unfortunately means crisps for breakfast and breakfast bars. But I did have a brief stink of peanut butter and banana on toast and it did the trick until I forgot to eat at all and ate crisps instead.\n\nNuggets, cheap sausages, whatever shape of starch to go with spaghetti hoops or frozen mixed veg for evening meal. \n\nI like to think of it as a balance but really it's just filling a gap. Stopping when I'm full and eating when I need to. \n\nI do try fruit but I still hate it. Even if I know I'm gonna hate it, it might change? Fruit is tricky. Never the right taste every single time.",
      "created_utc": 1700801439.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kaj7evx",
      "author": "pnkknife",
      "body": "I used to be til I hit puberty. Pasta with butter and whole milk are my top 2 so i’ve put on a lot unfortunately",
      "created_utc": 1700803951.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kaja99l",
      "author": "enpeace",
      "body": "I exercise a lot, so I burn enough to keep in pretty great shape, meaning I dont actually feel awful in my body anymore (sometimes I derealize tho that’s not fun)",
      "created_utc": 1700805813.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kajhqc9",
      "author": "Sound-Vapor",
      "body": "I'm overweight and since a couple of days ago have started to seriously try to lose weight.",
      "created_utc": 1700811209.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kajjg7b",
      "author": "None",
      "body": "I’m not, I’m actually a little overweight.",
      "created_utc": 1700812546.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kajjit4",
      "author": "amh8011",
      "body": "I’m technically “overweight” according to bmi (which is BS) but I’d consider myself fairly average. Definitely not underweight or skinny though.",
      "created_utc": 1700812603.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kajk1w2",
      "author": "puuds",
      "body": "I'm fat and have had arfid my whole life. I was never really skinny and always struggled to lose weight bc all my safe foods are high calories / saturated fats and I wish there was more representation for plus size ppl w arfid",
      "created_utc": 1700813026.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kajlbhl",
      "author": "Nah__me",
      "body": "My bmi is normal, but sometimes it borders underweight. To answer your question, I am skinny, a little more than I should be I guess.",
      "created_utc": 1700814034.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kajoenj",
      "author": "claraharlow",
      "body": "No, I have bulimia as well as ARFID, so I binge and restrict, I am overweight. Unfortunately my very restricted diet consists of junk, so that is also what I binge on.",
      "created_utc": 1700816598.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kajq9ra",
      "author": "batbirbofficial",
      "body": "nah i am definitely not skinny. one of my safe foods is diet coke, and when i say i drink it every day, i am unfortunately serious.",
      "created_utc": 1700818194.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kajrxv7",
      "author": "eli--12",
      "body": "No?? This is a really annoying assumption honestly, I get a lot of people dismissing my struggles because I'm overweight",
      "created_utc": 1700819622.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kajt45d",
      "author": "mattn1t",
      "body": "All of my safe foods are incredibly unhealthy but my equally unhealthy metabolism keeps me underweight. My ideal weight is 160 but I sit under 130 while not eating a fruit or vegetable in years\n\nI constantly feel like I'm at 15% battery and never can charge higher",
      "created_utc": 1700820622.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kak2ez0",
      "author": "crystalfairie",
      "body": "Nope. Fat as fuck",
      "created_utc": 1700828009.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kak3qiz",
      "author": "AetherDrew43",
      "body": "I'm chubby but not overweight.",
      "created_utc": 1700828918.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kakfere",
      "author": "None",
      "body": "i'd say not all, a lot of obesity nowadays unfortunately is based on some genetics. but many safe foods are high in fat, calories, carbohydrates and sodium\n\nmy husband is thin for his height and eats mostly fried and fast food. we can't get him to gain",
      "created_utc": 1700835510.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kakrbpz",
      "author": "None",
      "body": "6’4 naturally skinny but over the years had managed to get to around a healthy 210 with proper eating and exercise. I’ve been in a flair up for a good 3 months now and have lost about 35lbs. I’m officially skinnier than I like to be and now hate my body again. Wooo go me.\n\nEdit* I forgot to mention my ONLY safe food is flavor blasted gold fish.",
      "created_utc": 1700840931.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kakwvj3",
      "author": "Mike_Obrien23",
      "body": "I wish I was skinny but I'm sadly fat",
      "created_utc": 1700843261.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kaky6p7",
      "author": "tritian",
      "body": "I'm 6'4, fluctuate between 130-145 lbs and I almost never feel the sensation of hunger anymore.  Its definitely a problem.  I don't have insurance either, so who knows!?!",
      "created_utc": 1700843808.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kakytyk",
      "author": "laurenj2210",
      "body": "Subbed and dubbed",
      "created_utc": 1700844076.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kal2zdi",
      "author": "humansnackdispenser",
      "body": "I was always a thin borderline underweight kid due to the whole not eating thing. As an adult when I was taking certain meditations it was difficult for me to maintain any additional fat on my body even when I was eating 3 real meals a day. So I've been changing medications around and whatnot for the last 3 years. At this point I'm just starting to fill out a bit which has been a nice change. I'm not so constantly worried that I'm going to fall and break a bone. \n\nI think that a lot of us once we broaden our food horizons and finally satiate our hunger end up in fat bodies because our bodies are trying to make up for and protect us from going back to the starvation state. The science behind all of that is still pretty new, but there is a ton of evidence to show that diets don't work and its much better to love the bodies we have right now and only worry about staying fed.",
      "created_utc": 1700845773.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kal9qpd",
      "author": "NeverYummies",
      "body": "No, I was but now I’m just average I’m really tall though. I’m good weight for my height surprisingly. Enough. I mainly drink liquids  though, I drink most of my food. So that might be one of the reasons I’m not overweight. Idk 🤷‍♀️",
      "created_utc": 1700848493.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kalbxug",
      "author": "Mx-Helix-pomatia",
      "body": "Eating disorders do not define what weight you have.",
      "created_utc": 1700849381.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kam1f38",
      "author": "TyrannosaurusWrecks_",
      "body": "I definitely am but I know ARFID can also go the other way with weight for some people.",
      "created_utc": 1700859660.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kamh9dr",
      "author": "throwawaypatien",
      "body": "I was underweight as a child, but now I'm overweight since most of my safe foods are unhealthy processed junk food.",
      "created_utc": 1700866149.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kamj3oh",
      "author": "None",
      "body": "i have a fast metabolism so it's hard for me to gain weight and having arfid definitely doesnt help because sometimes i skip meals because i can't find anything to eat thats safe. im 5'3 and 90.5 lbs",
      "created_utc": 1700866934.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kamlfvy",
      "author": "deadfliesinsummer",
      "body": "It’s so relieving seeing all the replies of others whose safe foods made them fat",
      "created_utc": 1700867966.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kamrlz2",
      "author": "ThrowRA_lov",
      "body": "Currently underweight, yeah. Sucks because I thought I was doing much better with recovery. But every time I go to the doctor I drop in weight. Now I’m the smallest I’ve ever been and extremely insecure. I don’t feel like a woman, I feel like I look like a child. Everyone is noticing and telling me that I should get help. I deleted my instagram because I don’t even want to post anything of myself anymore. I feel like no matter what I’m doing I just keep dropping and dropping and I’m losing energy by the day. Im only 23f and I feel like 90 year old. My bones are constantly aching and I’ve passed out in the grocery store a bit ago. Im so discouraged and the negative insults from my own family about how I look like a skeleton and they can see my bones and i “don’t look good” is making me hate myself even more. I don’t even want to dress up in anything that shows my figure anymore so I just don’t hear a comment on my body .",
      "created_utc": 1700870774.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kamrudr",
      "author": "None",
      "body": "Was over 425lbs in January, pretty sure I was heavier than the scale could go. \nI'm down to 288ish now due to other health concerns. I started eating whole foods, which has basically brought me down to 6 different meals that I repeat over and over.",
      "created_utc": 1700870881.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kamsfuo",
      "author": "celestial-typhoon",
      "body": "I went from underweight to overweight over the 7 years I’ve had ARFID and expanded my safe foods. I feel like I have very little control around food.",
      "created_utc": 1700871154.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kan0tg9",
      "author": "Zero_Hesitation",
      "body": "I used to be on the line of morbidly obese and the only reason I'm not is because I changed careers and ended up in a ditch digging for 6 months straight and lost 80 pounds",
      "created_utc": 1700874987.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kao0ck1",
      "author": "None",
      "body": "no, my preferred foods are not really healthy. i’m not overweight or anything but not stick skinny either",
      "created_utc": 1700893282.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kar3q6p",
      "author": "Phoenixrjacxf",
      "body": "I'm bigger than I'd like to be myself",
      "created_utc": 1700949206.0,
      "score": 1,
      "context": []
    },
    {
      "id": "karn6ll",
      "author": "bumblebeebrey",
      "body": "lmao no, i have gained so much weight bc my safe foods are certain sweets and fast food",
      "created_utc": 1700956690.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ke4bg7u",
      "author": "Enzoid23",
      "body": "I'm luckily apparently a normal weight but I sure don't feel that way 🙃 (though it is unrelated to ARFID, it's just an insecurity that snuck up on me)",
      "created_utc": 1703035395.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kai05g9",
      "author": "apk5005",
      "body": "This is me. Pasta, potatoes, and dairy have taken their toll. I run at least one marathon a year and no one believes me. I have the heart of a race horse and the physique of a Clydesdale.",
      "created_utc": 1700781444.0,
      "score": 113,
      "context": [
        {
          "id": "kahu1vx",
          "author": "Candlewaxeater",
          "body": "I know alot of people here actually struggle with weight because their safe foods are high in calories unfortunately :(",
          "created_utc": 1700778580.0
        }
      ]
    },
    {
      "id": "kajxmf1",
      "author": "GreatWhiteBuffalo41",
      "body": "Me. Most of my safe foods are unfortunately fast foods",
      "created_utc": 1700824383.0,
      "score": 7,
      "context": [
        {
          "id": "kahu1vx",
          "author": "Candlewaxeater",
          "body": "I know alot of people here actually struggle with weight because their safe foods are high in calories unfortunately :(",
          "created_utc": 1700778580.0
        }
      ]
    },
    {
      "id": "kalw0yr",
      "author": "peanutbutternmtn",
      "body": "It me. Super duper high in calories.",
      "created_utc": 1700857515.0,
      "score": 1,
      "context": [
        {
          "id": "kahu1vx",
          "author": "Candlewaxeater",
          "body": "I know alot of people here actually struggle with weight because their safe foods are high in calories unfortunately :(",
          "created_utc": 1700778580.0
        }
      ]
    },
    {
      "id": "ke4asdj",
      "author": "Enzoid23",
      "body": "My mom says my diet is basically nothing but carbohydrates (and sugar) lol. Technically I do luckily probably have decent iron though because of how like 90% of my safe dinner foods are meat",
      "created_utc": 1703035124.0,
      "score": 1,
      "context": [
        {
          "id": "kahu1vx",
          "author": "Candlewaxeater",
          "body": "I know alot of people here actually struggle with weight because their safe foods are high in calories unfortunately :(",
          "created_utc": 1700778580.0
        }
      ]
    },
    {
      "id": "kai485y",
      "author": "AkiliDaniels",
      "body": "Samsies",
      "created_utc": 1700783443.0,
      "score": 22,
      "context": [
        {
          "id": "kai0idx",
          "author": "chernygal",
          "body": "Nope. I’m fat.",
          "created_utc": 1700781615.0
        }
      ]
    },
    {
      "id": "kajtytr",
      "author": "Adsilom",
      "body": "Same.",
      "created_utc": 1700821339.0,
      "score": 2,
      "context": [
        {
          "id": "kai0idx",
          "author": "chernygal",
          "body": "Nope. I’m fat.",
          "created_utc": 1700781615.0
        }
      ]
    },
    {
      "id": "kakadpr",
      "author": "imafuckingmessdude",
      "body": "Same.",
      "created_utc": 1700832911.0,
      "score": 2,
      "context": [
        {
          "id": "kai0idx",
          "author": "chernygal",
          "body": "Nope. I’m fat.",
          "created_utc": 1700781615.0
        }
      ]
    },
    {
      "id": "kajmiwa",
      "author": "ambiguousaffect",
      "body": "I prefer to say I’m fluffy 🤣",
      "created_utc": 1700815017.0,
      "score": 3,
      "context": [
        {
          "id": "kai0idx",
          "author": "chernygal",
          "body": "Nope. I’m fat.",
          "created_utc": 1700781615.0
        }
      ]
    },
    {
      "id": "kaiz5vl",
      "author": "NoAstronomer3244",
      "body": "ME TOO!! I'm a transmale, not on T, and this years weight gain due to ARFID has made me feel very dysphoric. I was already a little insecure before, now I'm really really insecure.",
      "created_utc": 1700799079.0,
      "score": 6,
      "context": [
        {
          "id": "kahv99a",
          "author": "castroski7",
          "body": "I went from very skinny all life to now only eating super compulsively so ive gained a lot of weight so now my ossues with body image and eating became worse!",
          "created_utc": 1700779134.0
        }
      ]
    },
    {
      "id": "kaijgpi",
      "author": "Wolfman726",
      "body": ">No a lot of people with arfid have safe foods that consist of fried foods and sweets so they end up eating it in abundance because they’re not getting the right nutrients outside of it\n\nYep this is me. East alot of stuff with calories and carbs. Im about HWP i think (5'6 and 140ish lbs.). Sometimes if im struggling with eating ill drop a little but always stay around 130/140. Been this way for many years. This all depends on your diet and your body chemistry, everyones different. Until you get to know me youd likely have no idea i have an ED.",
      "created_utc": 1700791056.0,
      "score": 14,
      "context": [
        {
          "id": "kahv61x",
          "author": "None",
          "body": "No a lot of people with arfid have safe foods that consist of fried foods and sweets so they end up eating it in abundance because they’re not getting the right nutrients outside of it, you don’t even have to be skinny to be anorexic. Eating disorders lie to us friend. Try not to compare yourself to others, but yea many arfid sufferers are overweight or obese, many of us are also thin or underweight…weight is one of the least important factors in an arfid diagnosis or treatment.",
          "created_utc": 1700779092.0
        }
      ]
    },
    {
      "id": "kakltlj",
      "author": "TheDyingSailor",
      "body": "Yep. I’m skinny but so is majority of my family. I think I have a higher metabolism than most and my ADHD also makes me forget to eat. So there are many factors to consider for my current weight. From what I know weight alone is not a reflection of ARFID. We come in all sizes.",
      "created_utc": 1700838535.0,
      "score": 4,
      "context": [
        {
          "id": "kahv61x",
          "author": "None",
          "body": "No a lot of people with arfid have safe foods that consist of fried foods and sweets so they end up eating it in abundance because they’re not getting the right nutrients outside of it, you don’t even have to be skinny to be anorexic. Eating disorders lie to us friend. Try not to compare yourself to others, but yea many arfid sufferers are overweight or obese, many of us are also thin or underweight…weight is one of the least important factors in an arfid diagnosis or treatment.",
          "created_utc": 1700779092.0
        }
      ]
    },
    {
      "id": "kairdfg",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1700795023.0,
      "score": 0,
      "context": [
        {
          "id": "kahv61x",
          "author": "None",
          "body": "No a lot of people with arfid have safe foods that consist of fried foods and sweets so they end up eating it in abundance because they’re not getting the right nutrients outside of it, you don’t even have to be skinny to be anorexic. Eating disorders lie to us friend. Try not to compare yourself to others, but yea many arfid sufferers are overweight or obese, many of us are also thin or underweight…weight is one of the least important factors in an arfid diagnosis or treatment.",
          "created_utc": 1700779092.0
        }
      ]
    },
    {
      "id": "kai9z39",
      "author": "angeltay",
      "body": "My safe food is Taco Bell tacos so I feel you ❤️",
      "created_utc": 1700786280.0,
      "score": 11,
      "context": [
        {
          "id": "kahwyq3",
          "author": "smoothBrainEnby",
          "body": "I classify as obese on the bmi(the bmi is bs though). But then again my main safe food is pizza so it checks out i guess",
          "created_utc": 1700779923.0
        }
      ]
    },
    {
      "id": "kaiz9ua",
      "author": "NoAstronomer3244",
      "body": "Yupp, me too. I eat pizza like... probably 3 times a week. I really try not to, but it's just the most convenient when I don't have time to cook.",
      "created_utc": 1700799139.0,
      "score": 3,
      "context": [
        {
          "id": "kahwyq3",
          "author": "smoothBrainEnby",
          "body": "I classify as obese on the bmi(the bmi is bs though). But then again my main safe food is pizza so it checks out i guess",
          "created_utc": 1700779923.0
        }
      ]
    },
    {
      "id": "kajildk",
      "author": "na0202",
      "body": "are you me??? same",
      "created_utc": 1700811877.0,
      "score": 4,
      "context": [
        {
          "id": "kahxwjc",
          "author": "Interesting-Cow8131",
          "body": "I'm very underweight between texture issues with food and battling anorexia it's hard to keep weight on",
          "created_utc": 1700780361.0
        }
      ]
    },
    {
      "id": "kale9pg",
      "author": "lovetempests",
      "body": "same",
      "created_utc": 1700850318.0,
      "score": 2,
      "context": [
        {
          "id": "kahxwjc",
          "author": "Interesting-Cow8131",
          "body": "I'm very underweight between texture issues with food and battling anorexia it's hard to keep weight on",
          "created_utc": 1700780361.0
        }
      ]
    },
    {
      "id": "kahxtdt",
      "author": "aroaceautistic",
      "body": "I rarely eat 3 meals a day and can’t lose weight anyways",
      "created_utc": 1700780321.0,
      "score": 2,
      "context": [
        {
          "id": "kahxpsw",
          "author": "aroaceautistic",
          "body": "Im kind of fat. I don’t eat well but I don’t lose weight",
          "created_utc": 1700780274.0
        }
      ]
    },
    {
      "id": "liqzhn3",
      "author": "thunder_eagle113",
      "body": "I bet I can guess your job.",
      "created_utc": 1724003749.0,
      "score": 1,
      "context": [
        {
          "id": "kai76cz",
          "author": "xtinalaperra",
          "body": "Myself no! My safe foods are junk food (nuggets, fries, pizza) so I’m on the thicker side. However I tend not to eat a lot (I’ll eat twice a day most days with little to no snacks) so my weight can fluctuate.",
          "created_utc": 1700784907.0
        }
      ]
    },
    {
      "id": "kai0w0i",
      "author": "Ru_rehtaeh",
      "body": "Losing not loosing 🤦🏻‍♀️",
      "created_utc": 1700781792.0,
      "score": 1,
      "context": [
        {
          "id": "kai0u1i",
          "author": "Ru_rehtaeh",
          "body": "Nah I’m fat af lol. But in all seriousness, I’ve been loosing weight as I’ve been working to incorporate more foods into my diet that aren’t as calorie dense as my safe foods. Congrats on the tomatoes! Today I ate some cut up banana in pudding and felt super accomplished!",
          "created_utc": 1700781766.0
        }
      ]
    },
    {
      "id": "kai5y13",
      "author": "Fr3nchT0astCrunch",
      "body": "There aren't really stereotypes for us at all since we're so unknown, but most people assume that folks like us are fat. Which isn't true.\n\nMost stereotypes about diseases like this are false, but they seem like common sense, so people just accept them. For example, not everyone with diabetes is fat, but you'll find that people always assume that anyway because it's associated with not eating well. I had a good friend in childhood whom I found out was diabetic after he died; he always looked and acted very robust, so it came as a surprise to just about everyone who knew him.",
      "created_utc": 1700784302.0,
      "score": 6,
      "context": [
        {
          "id": "kai3atv",
          "author": "throwaway_185051108",
          "body": "damn. this made me sad ngl… i’ve always struggled with weight because i mainly only like unhealthy food. is the stereotype that we’re skinny??? :(",
          "created_utc": 1700782984.0
        }
      ]
    },
    {
      "id": "ke4m76x",
      "author": "Candlewaxeater",
      "body": "the only thing keeping my iron up is cereal luckyy",
      "created_utc": 1703039939.0,
      "score": 1,
      "context": [
        {
          "id": "kahu1vx",
          "author": "Candlewaxeater",
          "body": "I know alot of people here actually struggle with weight because their safe foods are high in calories unfortunately :(",
          "created_utc": 1700778580.0
        },
        {
          "id": "ke4asdj",
          "author": "Enzoid23",
          "body": "My mom says my diet is basically nothing but carbohydrates (and sugar) lol. Technically I do luckily probably have decent iron though because of how like 90% of my safe dinner foods are meat",
          "created_utc": 1703035124.0
        }
      ]
    },
    {
      "id": "kaj5d8z",
      "author": "Puzzleheaded-War3197",
      "body": "Same here.",
      "created_utc": 1700802667.0,
      "score": 10,
      "context": [
        {
          "id": "kai0idx",
          "author": "chernygal",
          "body": "Nope. I’m fat.",
          "created_utc": 1700781615.0
        },
        {
          "id": "kai485y",
          "author": "AkiliDaniels",
          "body": "Samsies",
          "created_utc": 1700783443.0
        }
      ]
    },
    {
      "id": "kal3dpr",
      "author": "humansnackdispenser",
      "body": "Hugs friend ❤️ hoping you get the good boy juice soon",
      "created_utc": 1700845937.0,
      "score": 1,
      "context": [
        {
          "id": "kahv99a",
          "author": "castroski7",
          "body": "I went from very skinny all life to now only eating super compulsively so ive gained a lot of weight so now my ossues with body image and eating became worse!",
          "created_utc": 1700779134.0
        },
        {
          "id": "kaiz5vl",
          "author": "NoAstronomer3244",
          "body": "ME TOO!! I'm a transmale, not on T, and this years weight gain due to ARFID has made me feel very dysphoric. I was already a little insecure before, now I'm really really insecure.",
          "created_utc": 1700799079.0
        }
      ]
    },
    {
      "id": "l1p5c44",
      "author": "Accurate-Moment-2421",
      "body": "Bruh, Remilia is nice to humans in perfect memento. Also, read the perfect memento epilogue. A lot of youkais are way nicer than what's portrayed there, but Akyuu willingly distorted it so she can continue the encounter guide tradition.\n\nShe also saved a random dude from dying in the field, regularly throws parties that humans can attend, and the vampires only drink humans who wanted and were going to kill themselves (vampire contract)..\n\nShe literally saved a random dude from dying in the field, regularly throws parties that humans can attend, and the vampires only drink humans who wanted and were going to kill themselves (vampire contract).",
      "created_utc": 1714339817.0,
      "score": 1,
      "context": [
        {
          "id": "kahv61x",
          "author": "None",
          "body": "No a lot of people with arfid have safe foods that consist of fried foods and sweets so they end up eating it in abundance because they’re not getting the right nutrients outside of it, you don’t even have to be skinny to be anorexic. Eating disorders lie to us friend. Try not to compare yourself to others, but yea many arfid sufferers are overweight or obese, many of us are also thin or underweight…weight is one of the least important factors in an arfid diagnosis or treatment.",
          "created_utc": 1700779092.0
        },
        {
          "id": "kairdfg",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1700795023.0
        }
      ]
    },
    {
      "id": "kam1i60",
      "author": "TyrannosaurusWrecks_",
      "body": "same, I weigh more than that but im also tall. food really stresses me out but oh my god my diet is absolutely horrible im sure",
      "created_utc": 1700859694.0,
      "score": 1,
      "context": [
        {
          "id": "kahv61x",
          "author": "None",
          "body": "No a lot of people with arfid have safe foods that consist of fried foods and sweets so they end up eating it in abundance because they’re not getting the right nutrients outside of it, you don’t even have to be skinny to be anorexic. Eating disorders lie to us friend. Try not to compare yourself to others, but yea many arfid sufferers are overweight or obese, many of us are also thin or underweight…weight is one of the least important factors in an arfid diagnosis or treatment.",
          "created_utc": 1700779092.0
        },
        {
          "id": "kairdfg",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1700795023.0
        }
      ]
    },
    {
      "id": "kalwop3",
      "author": "Interesting-Cow8131",
      "body": "Possibly lol. Eating spoonfuls of nut butters is what's keeping me barely over 100lb, I'm 5'7\" !",
      "created_utc": 1700857769.0,
      "score": 3,
      "context": [
        {
          "id": "kahxwjc",
          "author": "Interesting-Cow8131",
          "body": "I'm very underweight between texture issues with food and battling anorexia it's hard to keep weight on",
          "created_utc": 1700780361.0
        },
        {
          "id": "kajildk",
          "author": "na0202",
          "body": "are you me??? same",
          "created_utc": 1700811877.0
        }
      ]
    },
    {
      "id": "kamfef6",
      "author": "NoAstronomer3244",
      "body": "Thank you, I hope so too.",
      "created_utc": 1700865364.0,
      "score": 1,
      "context": [
        {
          "id": "kahv99a",
          "author": "castroski7",
          "body": "I went from very skinny all life to now only eating super compulsively so ive gained a lot of weight so now my ossues with body image and eating became worse!",
          "created_utc": 1700779134.0
        },
        {
          "id": "kaiz5vl",
          "author": "NoAstronomer3244",
          "body": "ME TOO!! I'm a transmale, not on T, and this years weight gain due to ARFID has made me feel very dysphoric. I was already a little insecure before, now I'm really really insecure.",
          "created_utc": 1700799079.0
        },
        {
          "id": "kal3dpr",
          "author": "humansnackdispenser",
          "body": "Hugs friend ❤️ hoping you get the good boy juice soon",
          "created_utc": 1700845937.0
        }
      ]
    },
    {
      "id": "kamfobi",
      "author": "humansnackdispenser",
      "body": "I had to go off of it for health reasons and it's been making me kinda bummed so I feel you",
      "created_utc": 1700865478.0,
      "score": 2,
      "context": [
        {
          "id": "kahv99a",
          "author": "castroski7",
          "body": "I went from very skinny all life to now only eating super compulsively so ive gained a lot of weight so now my ossues with body image and eating became worse!",
          "created_utc": 1700779134.0
        },
        {
          "id": "kaiz5vl",
          "author": "NoAstronomer3244",
          "body": "ME TOO!! I'm a transmale, not on T, and this years weight gain due to ARFID has made me feel very dysphoric. I was already a little insecure before, now I'm really really insecure.",
          "created_utc": 1700799079.0
        },
        {
          "id": "kal3dpr",
          "author": "humansnackdispenser",
          "body": "Hugs friend ❤️ hoping you get the good boy juice soon",
          "created_utc": 1700845937.0
        },
        {
          "id": "kamfef6",
          "author": "NoAstronomer3244",
          "body": "Thank you, I hope so too.",
          "created_utc": 1700865364.0
        }
      ]
    }
  ]
}