{
  "id": "18hyp48",
  "subreddit": "ARFID",
  "author": "kibastorm",
  "created_utc": 1702522560.0,
  "title": "here’s me crying after forcing myself to eat a piece of broccoli and simultaneously trying not to puke… it was a success though bc i got it down ??",
  "selftext": "",
  "url": "https://www.reddit.com/gallery/18hyp48",
  "score": 228,
  "num_comments": 65,
  "comments": [
    {
      "id": "kd9szo8",
      "author": "mercurys-daughter",
      "body": "A win is a win ❤️",
      "created_utc": 1702522992.0,
      "score": 147,
      "context": []
    },
    {
      "id": "kd9wiz2",
      "author": "dumbroad",
      "body": "it gets better you have to keep trying. i stopped throwing up/dry heaving or crying around 25, could eat veggies in public in small amounts like 4x a yr by 27, now im 30 and it only feels pretty awful (instead of absolutely terrible), i can pass as relatively normal in public whenever needed, about 1x a week. i still make faces privately. \n\ni recommend squeezing a stress ball and positive self talk. \n\ni actually just had broccoli today. i use a vegetable dicer to chop it up into small pieces. i find this much easier than dealing with full broccoli stalk.",
      "created_utc": 1702524551.0,
      "score": 69,
      "context": []
    },
    {
      "id": "kdaypaf",
      "author": "pretzelsftm",
      "body": "The enotions ARE the therapy, not the food. Feeling all the feelings and seeing that you still wake up in the morning is what our brains need in order to fight back against this disorder. The fact you also ate any of the broccoli is a massive win - congrats and wish you all the best on the next one!",
      "created_utc": 1702549487.0,
      "score": 14,
      "context": []
    },
    {
      "id": "kda3m12",
      "author": "solitudanrian",
      "body": "Not the crying but I have seen the nausea in real time from a family member. Straight up dry heaves. Keeping it down IS a success.\n\nPlease keep trying. I hate mushrooms and always picked them out of my mum’s butter chicken but sometimes some sneak in and, while it’s taken a few years, I can ignore them in the curry. And honestly, I’m starting to come around about them.\n\nBroccoli and similar vegetables are such a crap shoot for us because of the texture. I *hate* broccoli because of the texture. Plus, there’s far more nutritious green that you can hide in a soup or a smoothie. \n\nI’m interested in how the piece of broccoli was presented to you?\n\n it’s perfectly fine to not like a certain vegetable. I don’t like broccoli, personally. It’s the texture.",
      "created_utc": 1702527907.0,
      "score": 13,
      "context": []
    },
    {
      "id": "kda2wns",
      "author": "gemmath",
      "body": "You did it, and for the sweetest reason because your mom made it. It was hard but you did it anyway!",
      "created_utc": 1702527557.0,
      "score": 6,
      "context": []
    },
    {
      "id": "kdbuw1t",
      "author": "blondiebabe001",
      "body": "Hey, as a mom of a kiddo with ARFID, please understand that even if you weren't able to eat the broccoli trying it at all is still a win. Progress is progress and exposure is key. You're brave for posting this and this Internet stranger is super proud of you. \n\nAs a piece of advice though, sometimes forcing yourself to swallow things can be counterproductive and can create subconscious stress or fear around certain foods. Even if you just place it in your mouth and immediately spit it out it still counts as an exposure, and the more exposure you get to textures/flavors the more likely you'll be to tolerate or even actually enjoy them. My son will take a bite and spit it into the trash so many times before he figures out whether or not he actually likes or hates it. I think it's because, as you mentioned, even if the taste isn't a problem sometimes there's an unexpected element that takes some getting used to or the multiple flavors and textures just overwhelms your senses. I guess long story short, it's okay to go at your own pace. You can stay within your comfort zone and still manage to add new foods to your safe food list, there's just a balance to find. Maybe try to give yourself a reasonable \"exit plan\" when it comes to trying new food, even if you don't use it sometimes just knowing you have the option to taste but don't have to commit to an actual chew-and-swallow bite is comforting. Obviously do whatever works best for you, I'm not trying to tell you how to live your life. Just thought I'd share what I've learned so far from a momma perspective 🫶",
      "created_utc": 1702566968.0,
      "score": 7,
      "context": []
    },
    {
      "id": "kd9vfiz",
      "author": "Roscoedash77",
      "body": "You’re so real for this. Proud of you 💜",
      "created_utc": 1702524059.0,
      "score": 7,
      "context": []
    },
    {
      "id": "kd9zh2l",
      "author": "peanutbutternmtn",
      "body": "You’re a lot braver than me.",
      "created_utc": 1702525907.0,
      "score": 8,
      "context": []
    },
    {
      "id": "kdb5unv",
      "author": "Clayr_Bayr",
      "body": "You’re doing so good and should be extremely proud of yourself. This is exposure therapy! Little by little, if you keep at it, it will get better. Just try to be gentle with yourself; I know how easy it is to fall into the self hatred hole. That makes it worse. Celebrate the small victories; you have a disorder that forces you to react physically to this food, and you overcame it through sheer willpower. That’s HUGE. I know this is all easier said than done, but I just want to reinforce some positive self assessment because this is a big win.",
      "created_utc": 1702554758.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kdbdpt8",
      "author": "small_pigeon",
      "body": "Good job!!! I recently tried broccoli for the first time too and found I actually like it a lot. It's okay if you don't like it though, you should be really proud of yourself for trying it!!!",
      "created_utc": 1702559290.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kda5tms",
      "author": "another-sad-gay-bich",
      "body": "I hate the thick part of broccoli and only eat the leafs at the end. It helps to run it through a food processor and that’s the only way I’ll eat it :’) you’re so brave I’m proud of you!!!",
      "created_utc": 1702529042.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kda8itm",
      "author": "Bankerlady10",
      "body": "So proud of you! You’re inspiring me to try again.",
      "created_utc": 1702530480.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kdbqjbu",
      "author": "caldus_x",
      "body": "this is amazing!! completely understand this feeling so deeply. even if i don’t hate the taste, my body is absolutely freaking out. it does get better overtime as you do more exposures! just always try to bring your body back into safety—remind yourself that last time you tried to eat broccoli you survived and were just fine. you got this!!",
      "created_utc": 1702565200.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kddj5vt",
      "author": "helllooksprettygood",
      "body": "Ngl that food looks gas but the mixing of stuff would make me throw my plate against a wall. Congrats on the w btw arfid is not slaytasic but u definitely are for that broccoli win",
      "created_utc": 1702589200.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kde2tv5",
      "author": "godsgirli",
      "body": "Wooohoooo A WIN IS A WIN IDC WHAT YALL SAY A WIN IS A WIN",
      "created_utc": 1702596897.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kdeppoz",
      "author": "Violet_Mermaid",
      "body": "Oh wow! You are braver than me. Congrats on getting it down. You’re doing amazing🥰",
      "created_utc": 1702606546.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kdetq3e",
      "author": "Mx-Helix-pomatia",
      "body": "Congratulations :)",
      "created_utc": 1702608253.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kdg7m6z",
      "author": "AetherDrew43",
      "body": "I know the feeling. I felt the same when I had to eat chicken soup shortly after my gallbladder surgery (an organ I lost mostly thanks to ARFID).\n\nCongrats on your victory!",
      "created_utc": 1702639837.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kdgccu7",
      "author": "titica420",
      "body": "me with pasta",
      "created_utc": 1702642782.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kdazjvk",
      "author": "tunecha",
      "body": "personally I would not do that because why torture yourself like this? I'd stick to my safe foods because there's no need for me to eat my unsafe foods. that may be the case with you, so if it's okay to ask, why do you want to get used to broccoli?",
      "created_utc": 1702550175.0,
      "score": -1,
      "context": []
    },
    {
      "id": "kdc3s2x",
      "author": "Fantastic-Leopard131",
      "body": "Take it slowly. If you push yourself too far you can “traumatize” (i use that word lightly here) yourself and just make it even harder the next time you try it. Exposure therapy works best in increments. Going from i cant eat broccoli to im eating broccoli is a huge jump. In treatments they approach it more step by step. \n\nStep one is you plate it. You did that so congrats thats a win in and of itself! Once you can get comfortable with it on the plate and get comfortable with it touching other foods, then step two is putting it in your mouth. That could be licking it, taking a tiny nibble, or simply trying it and spitting it out when it becomes too overwhelming. For example, a good place to start if you like pasta is to eat your favorite pasta with really tiny flakes of broccoli in it. \n\nWhen you can at least let it touch your mouth without too much distress then try eating it. Based on the pic those are pretty large chunks of broccoli. It may be better to cut them up into really tiny pieces and then eat it mixed in with the other food. You could even shred it to make is as minimally noticeable as possible. So instead of just a bite of broccoli, theres just a tiny bit on the fork but the majority of the bite contains a safe food. So in that pic eat a piece of carrot with a tinny bit of broccoli. You may start off with a fork thats 75% carrot/meat and 25% broccoli. Then work up to a bite thats more of a 50/50 ratio and so on until you can eat a full bite of broccoli without breaking down crying.\n\nIts great you’re pushing yourself, that deserves congratulations, but you shouldn’t be so distressed that youre crying. A response like that isnt going to be very helpful in the long run when attempting exposures. Yes this was successful, but in the long run you may actually see more success in tolerating this food if you don’t push so hard. It may sound counterintuitive, cause pushing yourself as far as you can go is usually a good thing, and while it is commendable its not necessarily the best tactic for beating ARFID. \n\nYou need to build trust with yourself. Trust that eating this food isnt so bad. If you force yourself to the point of crying youre breaking that trust with your own brain. If you allow yourself to stop when it becomes too overwhelming youll trust that the next time you try it, it wont be so bad bc youll know your distress will stay at manageable levels. We do need to learn to tolerate distress but there are lines where thats not helpful and will only leave us with a bad impression. The point of food exposures is to try to create good impression, to show your brain that wasnt so bad. So stopping when your distress reaches a certain point serves that purpose.\n\nIt’s definitely commendable that you’re pushing yourself, dont stop that but also try to be skillful in how you approach it. We kinda have the opposite problem as binge eaters. Someone with that diagnosis may avoid a certain food too much, causing them to break and go on a binge. For us its the opposite, if we force too hard we can break and then end up restricting that food even more. Its common to see “relapses” in treatment of ppl who did too much exposure which resulted in such an overwhelmed state that they then restrict heavily. So just find the balance that works best for you. Take this as a win absolutely, im just saying to be careful not to push too far to where it has the reverse consequences.",
      "created_utc": 1702570334.0,
      "score": 0,
      "context": []
    },
    {
      "id": "kda2vb4",
      "author": "donkiluminate",
      "body": "Congratulations!",
      "created_utc": 1702527539.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kda5l7w",
      "author": "withered_violets",
      "body": "Baby steps! Personally when having a meal like this, I cut up anything with a texture I struggle with, and eat it with a scoop of mashed potatoes (assuming you’re good with those). It helps",
      "created_utc": 1702528920.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kda9w1d",
      "author": "Alive-Finding-7584",
      "body": "Good job! 💚 \n\nI feel the same way, so I do my broccoli mashed up in curries or with rice and sauce. It takes on the flavour of whatever you put it with. \nYou can also get broccoli rice frozen in bags so it's like pre-mashed :)",
      "created_utc": 1702531253.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kdahmaw",
      "author": "Tanedra",
      "body": "Good work!\n\nI struggle with broccoli too. This year I've found that I can just about manage some if I have it in small pieces, alongside something else that has a) a mix of textures, and b) strong flavours. This means things like pie+mash, where the texture and flavour can be covered with other things.",
      "created_utc": 1702536110.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kdiv0y2",
      "author": "georgecostanzalvr",
      "body": "Congrats! Baby steps!!",
      "created_utc": 1702675207.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kdkuqty",
      "author": "randomlygeneratedbss",
      "body": "Proud of you!!!\n\nMay be preaching to choir but in case not, this helped me SO much:\n\n1) While others may find food to no longer be \na novelty after 1-2 tries, people with Arfid it may take 50+, so 50 nibbles over time may be a lot more effective at helping your brain know what to expect and adjust to the foreignness of it, without giving yourself a bad experience.\n\nAnd 2) trying one thing adjacent! So like adding a little touch of something to your safe food. \n\nFor example when I was younger, I would love “nachos”- plain refried beans, chips, cheese, plain cubed boiled chicken (only when made at home). Later, I moved to shredding the chicken, which I actually found better.\n\nThen, I ended up trying pineapple chicken at a restaurant and really liking it- it was similar to what I already had, with a predictable and good flavor with affecting the texture much, if anything softening it.\n\nSo *then* I cooked the shredded chicken in pineapple juice, added to nachos. Then I tried a slightly spicier bean. Then I really went ✨crazy✨ and added cinnamon and red pepper to the pineapple chicken. I became okay with jalepenos on it as long as I could pick them off because I didn’t mind the lingering taste. now I even eat them with sour cream! \n\nIt was a long multi year process that was entirely accidental, but it’s the best way for Arfid food therapy to work often times.\n\nI also realized with this realization that my disgust was about *novelty* that a lot of foods I actually liked the smell, taste, and even texture of, but my brain was telling me it was disgusting and I should spit it out/gag because it was foreign. It was a really disconcerting realization to come to, but it helps now to think about it in that sense when I nibble or try something every once in a while, just a taste or a bite, to familiarize myself with it over time! Predictable texture is definitely a must for me but there’s a lot of foods that check that box.\n\nI’ve added more foods recently than in my entire life, and it’s so great. Trying new food is so much less of an ordeal as well! \n\nI hope things keep getting easier!!",
      "created_utc": 1702707547.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kdmygb2",
      "author": "sweetpeachteas",
      "body": "that’s so great!!! I’ve been in this exact situation with watermelon haha. So proud of you 🥺",
      "created_utc": 1702747974.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kd9tqao",
      "author": "kibastorm",
      "body": "thank you… it was rough, i cried the entire time because my mom made it and i really really wanted to eat it and my brain/body kept trying to gag and puke and fuck man it was hard as hell, it didn’t even taste bad i don’t know why the fuck it was so difficult",
      "created_utc": 1702523310.0,
      "score": 92,
      "context": [
        {
          "id": "kd9szo8",
          "author": "mercurys-daughter",
          "body": "A win is a win ❤️",
          "created_utc": 1702522992.0
        }
      ]
    },
    {
      "id": "kde2v5x",
      "author": "godsgirli",
      "body": "Yes I commented the same thing lol",
      "created_utc": 1702596912.0,
      "score": 1,
      "context": [
        {
          "id": "kd9szo8",
          "author": "mercurys-daughter",
          "body": "A win is a win ❤️",
          "created_utc": 1702522992.0
        }
      ]
    },
    {
      "id": "kd9x39e",
      "author": "dumbroad",
      "body": "ps great work and thanks for sharing the reality",
      "created_utc": 1702524805.0,
      "score": 21,
      "context": [
        {
          "id": "kd9wiz2",
          "author": "dumbroad",
          "body": "it gets better you have to keep trying. i stopped throwing up/dry heaving or crying around 25, could eat veggies in public in small amounts like 4x a yr by 27, now im 30 and it only feels pretty awful (instead of absolutely terrible), i can pass as relatively normal in public whenever needed, about 1x a week. i still make faces privately. \n\ni recommend squeezing a stress ball and positive self talk. \n\ni actually just had broccoli today. i use a vegetable dicer to chop it up into small pieces. i find this much easier than dealing with full broccoli stalk.",
          "created_utc": 1702524551.0
        }
      ]
    },
    {
      "id": "kdasjfx",
      "author": "TechnicalCar4700",
      "body": "The stress ball suggestion actually sounds really good. I started intuitive eating. I stand in the store (which is one of my least favorite places) and look at something till I know if it seems appetizing at all (or with a recipe). It helps but dealing with food is still not easy. I heard an anorexic talk about wanting to starve herself to disappear and I so related. I have to try to take up space in the grocery store when I realized the self talk was saying I was in the way and I didn't deserve the space I occupied. It's sad but yeah, the positive self talk is important too",
      "created_utc": 1702544410.0,
      "score": 6,
      "context": [
        {
          "id": "kd9wiz2",
          "author": "dumbroad",
          "body": "it gets better you have to keep trying. i stopped throwing up/dry heaving or crying around 25, could eat veggies in public in small amounts like 4x a yr by 27, now im 30 and it only feels pretty awful (instead of absolutely terrible), i can pass as relatively normal in public whenever needed, about 1x a week. i still make faces privately. \n\ni recommend squeezing a stress ball and positive self talk. \n\ni actually just had broccoli today. i use a vegetable dicer to chop it up into small pieces. i find this much easier than dealing with full broccoli stalk.",
          "created_utc": 1702524551.0
        }
      ]
    },
    {
      "id": "kdbhumw",
      "author": "_VLW_",
      "body": "The positive self talk is so important!! I made more breakthroughs by actually forcing my inner monologue to be positive.",
      "created_utc": 1702561335.0,
      "score": 1,
      "context": [
        {
          "id": "kd9wiz2",
          "author": "dumbroad",
          "body": "it gets better you have to keep trying. i stopped throwing up/dry heaving or crying around 25, could eat veggies in public in small amounts like 4x a yr by 27, now im 30 and it only feels pretty awful (instead of absolutely terrible), i can pass as relatively normal in public whenever needed, about 1x a week. i still make faces privately. \n\ni recommend squeezing a stress ball and positive self talk. \n\ni actually just had broccoli today. i use a vegetable dicer to chop it up into small pieces. i find this much easier than dealing with full broccoli stalk.",
          "created_utc": 1702524551.0
        }
      ]
    },
    {
      "id": "kdb5ouc",
      "author": "kibastorm",
      "body": "thank you, i knew i needed to and i was actually able to eat one piece which is like freakin cool and couple things of the other foods because after eating the piece like kinda minimized the aversion to when it touched the other food gah i am happy i got over it lol",
      "created_utc": 1702554652.0,
      "score": 6,
      "context": [
        {
          "id": "kdaypaf",
          "author": "pretzelsftm",
          "body": "The enotions ARE the therapy, not the food. Feeling all the feelings and seeing that you still wake up in the morning is what our brains need in order to fight back against this disorder. The fact you also ate any of the broccoli is a massive win - congrats and wish you all the best on the next one!",
          "created_utc": 1702549487.0
        }
      ]
    },
    {
      "id": "kdb5i5i",
      "author": "kibastorm",
      "body": "it wasn’t even the texture or the taste, the smell got me for some reason and once i was able to eat a piece of it i was able to eat the other foods a little easier, i love steak and corn but the smell of the broccoli on them is what made it so difficult",
      "created_utc": 1702554533.0,
      "score": 3,
      "context": [
        {
          "id": "kda3m12",
          "author": "solitudanrian",
          "body": "Not the crying but I have seen the nausea in real time from a family member. Straight up dry heaves. Keeping it down IS a success.\n\nPlease keep trying. I hate mushrooms and always picked them out of my mum’s butter chicken but sometimes some sneak in and, while it’s taken a few years, I can ignore them in the curry. And honestly, I’m starting to come around about them.\n\nBroccoli and similar vegetables are such a crap shoot for us because of the texture. I *hate* broccoli because of the texture. Plus, there’s far more nutritious green that you can hide in a soup or a smoothie. \n\nI’m interested in how the piece of broccoli was presented to you?\n\n it’s perfectly fine to not like a certain vegetable. I don’t like broccoli, personally. It’s the texture.",
          "created_utc": 1702527907.0
        }
      ]
    },
    {
      "id": "kdb5cm2",
      "author": "kibastorm",
      "body": "yes ! thank you !!",
      "created_utc": 1702554429.0,
      "score": 2,
      "context": [
        {
          "id": "kda2wns",
          "author": "gemmath",
          "body": "You did it, and for the sweetest reason because your mom made it. It was hard but you did it anyway!",
          "created_utc": 1702527557.0
        }
      ]
    },
    {
      "id": "kdcrr3t",
      "author": "kibastorm",
      "body": "omg you are officially my internet momma 🥺❤️ thank you for all of your support and advice ! i’ve noticed the chewing is the hardest part and getting it into my mouth and swallowing it is working relatively well (gives me less time to over evaluate the taste/texture) my hardest thing in the past is when i’d chew i wouldn’t be able to swallow and would end up choking/gagging/puking and it would be worse i’ve found just putting it in my mouth a second to taste and then immediately swallow has helped a lot with getting my brain used to not puking from certain tastes/smells/textures ! you are doing amazing internet momma and your kiddos are so blessed to have you ❤️❤️❤️❤️",
      "created_utc": 1702579066.0,
      "score": 3,
      "context": [
        {
          "id": "kdbuw1t",
          "author": "blondiebabe001",
          "body": "Hey, as a mom of a kiddo with ARFID, please understand that even if you weren't able to eat the broccoli trying it at all is still a win. Progress is progress and exposure is key. You're brave for posting this and this Internet stranger is super proud of you. \n\nAs a piece of advice though, sometimes forcing yourself to swallow things can be counterproductive and can create subconscious stress or fear around certain foods. Even if you just place it in your mouth and immediately spit it out it still counts as an exposure, and the more exposure you get to textures/flavors the more likely you'll be to tolerate or even actually enjoy them. My son will take a bite and spit it into the trash so many times before he figures out whether or not he actually likes or hates it. I think it's because, as you mentioned, even if the taste isn't a problem sometimes there's an unexpected element that takes some getting used to or the multiple flavors and textures just overwhelms your senses. I guess long story short, it's okay to go at your own pace. You can stay within your comfort zone and still manage to add new foods to your safe food list, there's just a balance to find. Maybe try to give yourself a reasonable \"exit plan\" when it comes to trying new food, even if you don't use it sometimes just knowing you have the option to taste but don't have to commit to an actual chew-and-swallow bite is comforting. Obviously do whatever works best for you, I'm not trying to tell you how to live your life. Just thought I'd share what I've learned so far from a momma perspective 🫶",
          "created_utc": 1702566968.0
        }
      ]
    },
    {
      "id": "kdcsbso",
      "author": "kibastorm",
      "body": "also i have so much subconscious fear/stress i’ve noticed a lot that the less i process it and more JUST DO IT and process afterward it has worked and been way more reassuring because it’s like i don’t even give myself the opportunity to back out and i realize it’s like a lot less scary/uncomfortable than i otherwise would have anticipated it to be, last night was freakin hard because i let myself anticipate too much because i hit a HUGE threshold but i’m glad i was able to muscle up the strength to say “f**k THIS JUST DO IT” and i managed to do it even if my body wanted to puke i am glad i was able to control it more and keep telling myself “it’s in your head” because it so is for me !!",
      "created_utc": 1702579273.0,
      "score": 2,
      "context": [
        {
          "id": "kdbuw1t",
          "author": "blondiebabe001",
          "body": "Hey, as a mom of a kiddo with ARFID, please understand that even if you weren't able to eat the broccoli trying it at all is still a win. Progress is progress and exposure is key. You're brave for posting this and this Internet stranger is super proud of you. \n\nAs a piece of advice though, sometimes forcing yourself to swallow things can be counterproductive and can create subconscious stress or fear around certain foods. Even if you just place it in your mouth and immediately spit it out it still counts as an exposure, and the more exposure you get to textures/flavors the more likely you'll be to tolerate or even actually enjoy them. My son will take a bite and spit it into the trash so many times before he figures out whether or not he actually likes or hates it. I think it's because, as you mentioned, even if the taste isn't a problem sometimes there's an unexpected element that takes some getting used to or the multiple flavors and textures just overwhelms your senses. I guess long story short, it's okay to go at your own pace. You can stay within your comfort zone and still manage to add new foods to your safe food list, there's just a balance to find. Maybe try to give yourself a reasonable \"exit plan\" when it comes to trying new food, even if you don't use it sometimes just knowing you have the option to taste but don't have to commit to an actual chew-and-swallow bite is comforting. Obviously do whatever works best for you, I'm not trying to tell you how to live your life. Just thought I'd share what I've learned so far from a momma perspective 🫶",
          "created_utc": 1702566968.0
        }
      ]
    },
    {
      "id": "kda0i9q",
      "author": "kibastorm",
      "body": "thank you. it is really fucking tough. ❤️",
      "created_utc": 1702526393.0,
      "score": 1,
      "context": [
        {
          "id": "kd9vfiz",
          "author": "Roscoedash77",
          "body": "You’re so real for this. Proud of you 💜",
          "created_utc": 1702524059.0
        }
      ]
    },
    {
      "id": "kda0t89",
      "author": "kibastorm",
      "body": "this subreddit has become a bit of a diary for me honestly which has actually helped a LOT ! it’s REALLY fucking hard… 6 months ago i would’ve never touched anything on this plate… i wouldn’t have even gone near it… it’s been some hard fucking work but i want to be healthy and i want to feel good and eat better mentally, physically and socially/emotionally, you wholeheartedly believe you have to want it to be able to see results. it’s fucking hard though… lots of tears…",
      "created_utc": 1702526536.0,
      "score": 5,
      "context": [
        {
          "id": "kd9zh2l",
          "author": "peanutbutternmtn",
          "body": "You’re a lot braver than me.",
          "created_utc": 1702525907.0
        }
      ]
    },
    {
      "id": "kdb66zb",
      "author": "kibastorm",
      "body": "thank you 😭 i am with a therapist and nutritionist who both specialize with arfid and i have been trying to do a lot of exposure stuff because i’ve been SO put off by it for years and i am happy i’m in a place where i want to get better and i want to do better and they have really helped a LOT, i would’ve never even taken a bite of any of my food tonight if it weren’t for some pasture exposures and past things they’ve helped me through. also this subreddit helps a lot with how supportive everyone is and knowing that i’m not the only one who struggles with this stuff because i always thought i was just stupid and childish for my eating habits but it’s good to know there are people out there who are just as “picky” as i am, i love the internet 🤣❤️",
      "created_utc": 1702554980.0,
      "score": 3,
      "context": [
        {
          "id": "kdb5unv",
          "author": "Clayr_Bayr",
          "body": "You’re doing so good and should be extremely proud of yourself. This is exposure therapy! Little by little, if you keep at it, it will get better. Just try to be gentle with yourself; I know how easy it is to fall into the self hatred hole. That makes it worse. Celebrate the small victories; you have a disorder that forces you to react physically to this food, and you overcame it through sheer willpower. That’s HUGE. I know this is all easier said than done, but I just want to reinforce some positive self assessment because this is a big win.",
          "created_utc": 1702554758.0
        }
      ]
    },
    {
      "id": "kdblave",
      "author": "kibastorm",
      "body": "thank you ! i definitely am, the taste isn’t terrible honestly the smell is what got me the worst and the mushiness of the green little fluffy parts",
      "created_utc": 1702562932.0,
      "score": 1,
      "context": [
        {
          "id": "kdbdpt8",
          "author": "small_pigeon",
          "body": "Good job!!! I recently tried broccoli for the first time too and found I actually like it a lot. It's okay if you don't like it though, you should be really proud of yourself for trying it!!!",
          "created_utc": 1702559290.0
        }
      ]
    },
    {
      "id": "kdbrnfy",
      "author": "kibastorm",
      "body": "yes ! i am the type of person if i am not feeling something fully it’s never “enough” so i tend to find that i bring myself to a mental breaking point before it really “clicks” !",
      "created_utc": 1702565656.0,
      "score": 1,
      "context": [
        {
          "id": "kdbqjbu",
          "author": "caldus_x",
          "body": "this is amazing!! completely understand this feeling so deeply. even if i don’t hate the taste, my body is absolutely freaking out. it does get better overtime as you do more exposures! just always try to bring your body back into safety—remind yourself that last time you tried to eat broccoli you survived and were just fine. you got this!!",
          "created_utc": 1702565200.0
        }
      ]
    },
    {
      "id": "kdazofj",
      "author": "kibastorm",
      "body": "i want to get used to vegetables for health reasons because i am extremely nutrient deprived from it ☹️ also for social eating reasons, i have such a hard time eating at peoples houses so i really really want to condition myself to be more and more open to eating different foods and forcing myself to understand that it doesnt taste terrible and that it’s not “poison”",
      "created_utc": 1702550278.0,
      "score": 5,
      "context": [
        {
          "id": "kdazjvk",
          "author": "tunecha",
          "body": "personally I would not do that because why torture yourself like this? I'd stick to my safe foods because there's no need for me to eat my unsafe foods. that may be the case with you, so if it's okay to ask, why do you want to get used to broccoli?",
          "created_utc": 1702550175.0
        }
      ]
    },
    {
      "id": "kd9vo3v",
      "author": "mercurys-daughter",
      "body": "But you did it! You fought back and you won! It was hard as fuck and you did it",
      "created_utc": 1702524165.0,
      "score": 38,
      "context": [
        {
          "id": "kd9szo8",
          "author": "mercurys-daughter",
          "body": "A win is a win ❤️",
          "created_utc": 1702522992.0
        },
        {
          "id": "kd9tqao",
          "author": "kibastorm",
          "body": "thank you… it was rough, i cried the entire time because my mom made it and i really really wanted to eat it and my brain/body kept trying to gag and puke and fuck man it was hard as hell, it didn’t even taste bad i don’t know why the fuck it was so difficult",
          "created_utc": 1702523310.0
        }
      ]
    },
    {
      "id": "kd9ysnl",
      "author": "miab2020",
      "body": "This is huge!!!",
      "created_utc": 1702525591.0,
      "score": 10,
      "context": [
        {
          "id": "kd9szo8",
          "author": "mercurys-daughter",
          "body": "A win is a win ❤️",
          "created_utc": 1702522992.0
        },
        {
          "id": "kd9tqao",
          "author": "kibastorm",
          "body": "thank you… it was rough, i cried the entire time because my mom made it and i really really wanted to eat it and my brain/body kept trying to gag and puke and fuck man it was hard as hell, it didn’t even taste bad i don’t know why the fuck it was so difficult",
          "created_utc": 1702523310.0
        }
      ]
    },
    {
      "id": "kdbhgx0",
      "author": "None",
      "body": "You're a sweet daughter. I'm hoping your mom is understanding, it sounds like she might be from the way you speak about wanting to eat the food. Anyway, wishing you well with all of this. It's hard",
      "created_utc": 1702561155.0,
      "score": 8,
      "context": [
        {
          "id": "kd9szo8",
          "author": "mercurys-daughter",
          "body": "A win is a win ❤️",
          "created_utc": 1702522992.0
        },
        {
          "id": "kd9tqao",
          "author": "kibastorm",
          "body": "thank you… it was rough, i cried the entire time because my mom made it and i really really wanted to eat it and my brain/body kept trying to gag and puke and fuck man it was hard as hell, it didn’t even taste bad i don’t know why the fuck it was so difficult",
          "created_utc": 1702523310.0
        }
      ]
    },
    {
      "id": "kda0gwe",
      "author": "kibastorm",
      "body": "thank you so fucking much for all of your advise i’ll definitely try that. i’m planning to try and eat atleast one piece of each thing in the stir fry every day this week and build up from there. ❤️",
      "created_utc": 1702526375.0,
      "score": 18,
      "context": [
        {
          "id": "kd9wiz2",
          "author": "dumbroad",
          "body": "it gets better you have to keep trying. i stopped throwing up/dry heaving or crying around 25, could eat veggies in public in small amounts like 4x a yr by 27, now im 30 and it only feels pretty awful (instead of absolutely terrible), i can pass as relatively normal in public whenever needed, about 1x a week. i still make faces privately. \n\ni recommend squeezing a stress ball and positive self talk. \n\ni actually just had broccoli today. i use a vegetable dicer to chop it up into small pieces. i find this much easier than dealing with full broccoli stalk.",
          "created_utc": 1702524551.0
        },
        {
          "id": "kd9x39e",
          "author": "dumbroad",
          "body": "ps great work and thanks for sharing the reality",
          "created_utc": 1702524805.0
        }
      ]
    },
    {
      "id": "kdbskmp",
      "author": "dumbroad",
      "body": "this was so helpful to me. ive only focused on positive self talk while eating. i also hate the grocery store experience. i need to start trying it there. thank you",
      "created_utc": 1702566035.0,
      "score": 2,
      "context": [
        {
          "id": "kd9wiz2",
          "author": "dumbroad",
          "body": "it gets better you have to keep trying. i stopped throwing up/dry heaving or crying around 25, could eat veggies in public in small amounts like 4x a yr by 27, now im 30 and it only feels pretty awful (instead of absolutely terrible), i can pass as relatively normal in public whenever needed, about 1x a week. i still make faces privately. \n\ni recommend squeezing a stress ball and positive self talk. \n\ni actually just had broccoli today. i use a vegetable dicer to chop it up into small pieces. i find this much easier than dealing with full broccoli stalk.",
          "created_utc": 1702524551.0
        },
        {
          "id": "kdasjfx",
          "author": "TechnicalCar4700",
          "body": "The stress ball suggestion actually sounds really good. I started intuitive eating. I stand in the store (which is one of my least favorite places) and look at something till I know if it seems appetizing at all (or with a recipe). It helps but dealing with food is still not easy. I heard an anorexic talk about wanting to starve herself to disappear and I so related. I have to try to take up space in the grocery store when I realized the self talk was saying I was in the way and I didn't deserve the space I occupied. It's sad but yeah, the positive self talk is important too",
          "created_utc": 1702544410.0
        }
      ]
    },
    {
      "id": "kdebegv",
      "author": "solitudanrian",
      "body": "OMG same! You can slather as much cheese sauce as you want, it’s still gross. That said, there is a big difference between not liking a food and having the reactions we do. I *WISH* there was a way for me to enjoy them or even just tolerate it being part of a meal.\n\nI’m really proud of you. Even if you just learn to tolerate it in a meal, it’s better than not eating greens at all.",
      "created_utc": 1702600513.0,
      "score": 1,
      "context": [
        {
          "id": "kda3m12",
          "author": "solitudanrian",
          "body": "Not the crying but I have seen the nausea in real time from a family member. Straight up dry heaves. Keeping it down IS a success.\n\nPlease keep trying. I hate mushrooms and always picked them out of my mum’s butter chicken but sometimes some sneak in and, while it’s taken a few years, I can ignore them in the curry. And honestly, I’m starting to come around about them.\n\nBroccoli and similar vegetables are such a crap shoot for us because of the texture. I *hate* broccoli because of the texture. Plus, there’s far more nutritious green that you can hide in a soup or a smoothie. \n\nI’m interested in how the piece of broccoli was presented to you?\n\n it’s perfectly fine to not like a certain vegetable. I don’t like broccoli, personally. It’s the texture.",
          "created_utc": 1702527907.0
        },
        {
          "id": "kdb5i5i",
          "author": "kibastorm",
          "body": "it wasn’t even the texture or the taste, the smell got me for some reason and once i was able to eat a piece of it i was able to eat the other foods a little easier, i love steak and corn but the smell of the broccoli on them is what made it so difficult",
          "created_utc": 1702554533.0
        }
      ]
    },
    {
      "id": "kda0z7a",
      "author": "peanutbutternmtn",
      "body": "Yup. I want all that stuff too, but I’m not willing to put in the work. I just work out a shit ton and hope for the best. But sounds like you really got it going on. lol",
      "created_utc": 1702526614.0,
      "score": 4,
      "context": [
        {
          "id": "kd9zh2l",
          "author": "peanutbutternmtn",
          "body": "You’re a lot braver than me.",
          "created_utc": 1702525907.0
        },
        {
          "id": "kda0t89",
          "author": "kibastorm",
          "body": "this subreddit has become a bit of a diary for me honestly which has actually helped a LOT ! it’s REALLY fucking hard… 6 months ago i would’ve never touched anything on this plate… i wouldn’t have even gone near it… it’s been some hard fucking work but i want to be healthy and i want to feel good and eat better mentally, physically and socially/emotionally, you wholeheartedly believe you have to want it to be able to see results. it’s fucking hard though… lots of tears…",
          "created_utc": 1702526536.0
        }
      ]
    },
    {
      "id": "kdb686w",
      "author": "kibastorm",
      "body": "past*",
      "created_utc": 1702555001.0,
      "score": 1,
      "context": [
        {
          "id": "kdb5unv",
          "author": "Clayr_Bayr",
          "body": "You’re doing so good and should be extremely proud of yourself. This is exposure therapy! Little by little, if you keep at it, it will get better. Just try to be gentle with yourself; I know how easy it is to fall into the self hatred hole. That makes it worse. Celebrate the small victories; you have a disorder that forces you to react physically to this food, and you overcame it through sheer willpower. That’s HUGE. I know this is all easier said than done, but I just want to reinforce some positive self assessment because this is a big win.",
          "created_utc": 1702554758.0
        },
        {
          "id": "kdb66zb",
          "author": "kibastorm",
          "body": "thank you 😭 i am with a therapist and nutritionist who both specialize with arfid and i have been trying to do a lot of exposure stuff because i’ve been SO put off by it for years and i am happy i’m in a place where i want to get better and i want to do better and they have really helped a LOT, i would’ve never even taken a bite of any of my food tonight if it weren’t for some pasture exposures and past things they’ve helped me through. also this subreddit helps a lot with how supportive everyone is and knowing that i’m not the only one who struggles with this stuff because i always thought i was just stupid and childish for my eating habits but it’s good to know there are people out there who are just as “picky” as i am, i love the internet 🤣❤️",
          "created_utc": 1702554980.0
        }
      ]
    },
    {
      "id": "kdb6qbw",
      "author": "Clayr_Bayr",
      "body": "I’m literally starting with an ARFID therapist and dietician today, I hope so much that I am able to make similar progress. You’ve straight up inspired me, so thank you!",
      "created_utc": 1702555322.0,
      "score": 1,
      "context": [
        {
          "id": "kdb5unv",
          "author": "Clayr_Bayr",
          "body": "You’re doing so good and should be extremely proud of yourself. This is exposure therapy! Little by little, if you keep at it, it will get better. Just try to be gentle with yourself; I know how easy it is to fall into the self hatred hole. That makes it worse. Celebrate the small victories; you have a disorder that forces you to react physically to this food, and you overcame it through sheer willpower. That’s HUGE. I know this is all easier said than done, but I just want to reinforce some positive self assessment because this is a big win.",
          "created_utc": 1702554758.0
        },
        {
          "id": "kdb66zb",
          "author": "kibastorm",
          "body": "thank you 😭 i am with a therapist and nutritionist who both specialize with arfid and i have been trying to do a lot of exposure stuff because i’ve been SO put off by it for years and i am happy i’m in a place where i want to get better and i want to do better and they have really helped a LOT, i would’ve never even taken a bite of any of my food tonight if it weren’t for some pasture exposures and past things they’ve helped me through. also this subreddit helps a lot with how supportive everyone is and knowing that i’m not the only one who struggles with this stuff because i always thought i was just stupid and childish for my eating habits but it’s good to know there are people out there who are just as “picky” as i am, i love the internet 🤣❤️",
          "created_utc": 1702554980.0
        }
      ]
    },
    {
      "id": "kdb1dyy",
      "author": "tunecha",
      "body": "thank you for answering! I'm really proud of you. and if never shame you for that, and there is a gross stigma in society when someone struggles like you. and I wish people were understanding.",
      "created_utc": 1702551604.0,
      "score": 2,
      "context": [
        {
          "id": "kdazjvk",
          "author": "tunecha",
          "body": "personally I would not do that because why torture yourself like this? I'd stick to my safe foods because there's no need for me to eat my unsafe foods. that may be the case with you, so if it's okay to ask, why do you want to get used to broccoli?",
          "created_utc": 1702550175.0
        },
        {
          "id": "kdazofj",
          "author": "kibastorm",
          "body": "i want to get used to vegetables for health reasons because i am extremely nutrient deprived from it ☹️ also for social eating reasons, i have such a hard time eating at peoples houses so i really really want to condition myself to be more and more open to eating different foods and forcing myself to understand that it doesnt taste terrible and that it’s not “poison”",
          "created_utc": 1702550278.0
        }
      ]
    },
    {
      "id": "kda0agi",
      "author": "kibastorm",
      "body": "thank you so much, i am crying even more bc this sub is so kind and supportive 🥲❤️",
      "created_utc": 1702526291.0,
      "score": 28,
      "context": [
        {
          "id": "kd9szo8",
          "author": "mercurys-daughter",
          "body": "A win is a win ❤️",
          "created_utc": 1702522992.0
        },
        {
          "id": "kd9tqao",
          "author": "kibastorm",
          "body": "thank you… it was rough, i cried the entire time because my mom made it and i really really wanted to eat it and my brain/body kept trying to gag and puke and fuck man it was hard as hell, it didn’t even taste bad i don’t know why the fuck it was so difficult",
          "created_utc": 1702523310.0
        },
        {
          "id": "kd9vo3v",
          "author": "mercurys-daughter",
          "body": "But you did it! You fought back and you won! It was hard as fuck and you did it",
          "created_utc": 1702524165.0
        }
      ]
    },
    {
      "id": "kda0c8d",
      "author": "kibastorm",
      "body": "thank you so fucking much… like seriously.. ❤️",
      "created_utc": 1702526313.0,
      "score": 11,
      "context": [
        {
          "id": "kd9szo8",
          "author": "mercurys-daughter",
          "body": "A win is a win ❤️",
          "created_utc": 1702522992.0
        },
        {
          "id": "kd9tqao",
          "author": "kibastorm",
          "body": "thank you… it was rough, i cried the entire time because my mom made it and i really really wanted to eat it and my brain/body kept trying to gag and puke and fuck man it was hard as hell, it didn’t even taste bad i don’t know why the fuck it was so difficult",
          "created_utc": 1702523310.0
        },
        {
          "id": "kd9ysnl",
          "author": "miab2020",
          "body": "This is huge!!!",
          "created_utc": 1702525591.0
        }
      ]
    },
    {
      "id": "kdbl62a",
      "author": "kibastorm",
      "body": "thank you, she is very understanding for sure, especially because everyone told her i’d just “grow out of it” and here i am at 24 and still struggling with it !",
      "created_utc": 1702562871.0,
      "score": 5,
      "context": [
        {
          "id": "kd9szo8",
          "author": "mercurys-daughter",
          "body": "A win is a win ❤️",
          "created_utc": 1702522992.0
        },
        {
          "id": "kd9tqao",
          "author": "kibastorm",
          "body": "thank you… it was rough, i cried the entire time because my mom made it and i really really wanted to eat it and my brain/body kept trying to gag and puke and fuck man it was hard as hell, it didn’t even taste bad i don’t know why the fuck it was so difficult",
          "created_utc": 1702523310.0
        },
        {
          "id": "kdbhgx0",
          "author": "None",
          "body": "You're a sweet daughter. I'm hoping your mom is understanding, it sounds like she might be from the way you speak about wanting to eat the food. Anyway, wishing you well with all of this. It's hard",
          "created_utc": 1702561155.0
        }
      ]
    },
    {
      "id": "kdb4fbp",
      "author": "dumbroad",
      "body": "that is a great plan! you can do it 🥰",
      "created_utc": 1702553799.0,
      "score": 2,
      "context": [
        {
          "id": "kd9wiz2",
          "author": "dumbroad",
          "body": "it gets better you have to keep trying. i stopped throwing up/dry heaving or crying around 25, could eat veggies in public in small amounts like 4x a yr by 27, now im 30 and it only feels pretty awful (instead of absolutely terrible), i can pass as relatively normal in public whenever needed, about 1x a week. i still make faces privately. \n\ni recommend squeezing a stress ball and positive self talk. \n\ni actually just had broccoli today. i use a vegetable dicer to chop it up into small pieces. i find this much easier than dealing with full broccoli stalk.",
          "created_utc": 1702524551.0
        },
        {
          "id": "kd9x39e",
          "author": "dumbroad",
          "body": "ps great work and thanks for sharing the reality",
          "created_utc": 1702524805.0
        },
        {
          "id": "kda0gwe",
          "author": "kibastorm",
          "body": "thank you so fucking much for all of your advise i’ll definitely try that. i’m planning to try and eat atleast one piece of each thing in the stir fry every day this week and build up from there. ❤️",
          "created_utc": 1702526375.0
        }
      ]
    },
    {
      "id": "kdf1h01",
      "author": "Chicklecat13",
      "body": "Also try different ways of cooking it, for example I LOVE carrots roasted in the oven with honey, butter and garlic but if you give me boiled or steamed carrots I can’t cope. It’s the same with cauliflower and broccoli, I love them with a cheesy sauce over them but any other way and I cannot cope.",
      "created_utc": 1702611617.0,
      "score": 2,
      "context": [
        {
          "id": "kd9wiz2",
          "author": "dumbroad",
          "body": "it gets better you have to keep trying. i stopped throwing up/dry heaving or crying around 25, could eat veggies in public in small amounts like 4x a yr by 27, now im 30 and it only feels pretty awful (instead of absolutely terrible), i can pass as relatively normal in public whenever needed, about 1x a week. i still make faces privately. \n\ni recommend squeezing a stress ball and positive self talk. \n\ni actually just had broccoli today. i use a vegetable dicer to chop it up into small pieces. i find this much easier than dealing with full broccoli stalk.",
          "created_utc": 1702524551.0
        },
        {
          "id": "kd9x39e",
          "author": "dumbroad",
          "body": "ps great work and thanks for sharing the reality",
          "created_utc": 1702524805.0
        },
        {
          "id": "kda0gwe",
          "author": "kibastorm",
          "body": "thank you so fucking much for all of your advise i’ll definitely try that. i’m planning to try and eat atleast one piece of each thing in the stir fry every day this week and build up from there. ❤️",
          "created_utc": 1702526375.0
        }
      ]
    },
    {
      "id": "kdb5c1p",
      "author": "kibastorm",
      "body": "yeah the work isnt fun but one day at a time",
      "created_utc": 1702554419.0,
      "score": 1,
      "context": [
        {
          "id": "kd9zh2l",
          "author": "peanutbutternmtn",
          "body": "You’re a lot braver than me.",
          "created_utc": 1702525907.0
        },
        {
          "id": "kda0t89",
          "author": "kibastorm",
          "body": "this subreddit has become a bit of a diary for me honestly which has actually helped a LOT ! it’s REALLY fucking hard… 6 months ago i would’ve never touched anything on this plate… i wouldn’t have even gone near it… it’s been some hard fucking work but i want to be healthy and i want to feel good and eat better mentally, physically and socially/emotionally, you wholeheartedly believe you have to want it to be able to see results. it’s fucking hard though… lots of tears…",
          "created_utc": 1702526536.0
        },
        {
          "id": "kda0z7a",
          "author": "peanutbutternmtn",
          "body": "Yup. I want all that stuff too, but I’m not willing to put in the work. I just work out a shit ton and hope for the best. But sounds like you really got it going on. lol",
          "created_utc": 1702526614.0
        }
      ]
    },
    {
      "id": "kdb7bd4",
      "author": "kibastorm",
      "body": "that makes me so happy 😭 i am so proud of you for getting help !! it makes a huge difference, the biggest thing i’ve found is you HAVE to want it more than anything, like if you don’t wholeheartedly want change it won’t happen so you have to want it more than you want to be comfortable and also know that as long as you don’t have an allergy it’s not going to kill you and that everything is in your head and just your brain doing what it thinks it needs to to keep you safe, the brain is a great thing until it’s not and we have to kind if retrain our brains",
      "created_utc": 1702555692.0,
      "score": 2,
      "context": [
        {
          "id": "kdb5unv",
          "author": "Clayr_Bayr",
          "body": "You’re doing so good and should be extremely proud of yourself. This is exposure therapy! Little by little, if you keep at it, it will get better. Just try to be gentle with yourself; I know how easy it is to fall into the self hatred hole. That makes it worse. Celebrate the small victories; you have a disorder that forces you to react physically to this food, and you overcame it through sheer willpower. That’s HUGE. I know this is all easier said than done, but I just want to reinforce some positive self assessment because this is a big win.",
          "created_utc": 1702554758.0
        },
        {
          "id": "kdb66zb",
          "author": "kibastorm",
          "body": "thank you 😭 i am with a therapist and nutritionist who both specialize with arfid and i have been trying to do a lot of exposure stuff because i’ve been SO put off by it for years and i am happy i’m in a place where i want to get better and i want to do better and they have really helped a LOT, i would’ve never even taken a bite of any of my food tonight if it weren’t for some pasture exposures and past things they’ve helped me through. also this subreddit helps a lot with how supportive everyone is and knowing that i’m not the only one who struggles with this stuff because i always thought i was just stupid and childish for my eating habits but it’s good to know there are people out there who are just as “picky” as i am, i love the internet 🤣❤️",
          "created_utc": 1702554980.0
        },
        {
          "id": "kdb6qbw",
          "author": "Clayr_Bayr",
          "body": "I’m literally starting with an ARFID therapist and dietician today, I hope so much that I am able to make similar progress. You’ve straight up inspired me, so thank you!",
          "created_utc": 1702555322.0
        }
      ]
    },
    {
      "id": "kdb7emq",
      "author": "kibastorm",
      "body": "also know that you will probably cry and be super uncomfortable but if it ends up going better than expected than it’s like sweet now you have a new food that is a little less “unsafe”",
      "created_utc": 1702555749.0,
      "score": 2,
      "context": [
        {
          "id": "kdb5unv",
          "author": "Clayr_Bayr",
          "body": "You’re doing so good and should be extremely proud of yourself. This is exposure therapy! Little by little, if you keep at it, it will get better. Just try to be gentle with yourself; I know how easy it is to fall into the self hatred hole. That makes it worse. Celebrate the small victories; you have a disorder that forces you to react physically to this food, and you overcame it through sheer willpower. That’s HUGE. I know this is all easier said than done, but I just want to reinforce some positive self assessment because this is a big win.",
          "created_utc": 1702554758.0
        },
        {
          "id": "kdb66zb",
          "author": "kibastorm",
          "body": "thank you 😭 i am with a therapist and nutritionist who both specialize with arfid and i have been trying to do a lot of exposure stuff because i’ve been SO put off by it for years and i am happy i’m in a place where i want to get better and i want to do better and they have really helped a LOT, i would’ve never even taken a bite of any of my food tonight if it weren’t for some pasture exposures and past things they’ve helped me through. also this subreddit helps a lot with how supportive everyone is and knowing that i’m not the only one who struggles with this stuff because i always thought i was just stupid and childish for my eating habits but it’s good to know there are people out there who are just as “picky” as i am, i love the internet 🤣❤️",
          "created_utc": 1702554980.0
        },
        {
          "id": "kdb6qbw",
          "author": "Clayr_Bayr",
          "body": "I’m literally starting with an ARFID therapist and dietician today, I hope so much that I am able to make similar progress. You’ve straight up inspired me, so thank you!",
          "created_utc": 1702555322.0
        }
      ]
    },
    {
      "id": "kdb5s3j",
      "author": "kibastorm",
      "body": "no problem thank you ❤️❤️ it is torture but at the same time it is less torture the next time and the next !",
      "created_utc": 1702554711.0,
      "score": 2,
      "context": [
        {
          "id": "kdazjvk",
          "author": "tunecha",
          "body": "personally I would not do that because why torture yourself like this? I'd stick to my safe foods because there's no need for me to eat my unsafe foods. that may be the case with you, so if it's okay to ask, why do you want to get used to broccoli?",
          "created_utc": 1702550175.0
        },
        {
          "id": "kdazofj",
          "author": "kibastorm",
          "body": "i want to get used to vegetables for health reasons because i am extremely nutrient deprived from it ☹️ also for social eating reasons, i have such a hard time eating at peoples houses so i really really want to condition myself to be more and more open to eating different foods and forcing myself to understand that it doesnt taste terrible and that it’s not “poison”",
          "created_utc": 1702550278.0
        },
        {
          "id": "kdb1dyy",
          "author": "tunecha",
          "body": "thank you for answering! I'm really proud of you. and if never shame you for that, and there is a gross stigma in society when someone struggles like you. and I wish people were understanding.",
          "created_utc": 1702551604.0
        }
      ]
    },
    {
      "id": "kdc9bog",
      "author": "None",
      "body": "Well that is very nice, I'm glad to hear she's on your side 💜",
      "created_utc": 1702572389.0,
      "score": 2,
      "context": [
        {
          "id": "kd9szo8",
          "author": "mercurys-daughter",
          "body": "A win is a win ❤️",
          "created_utc": 1702522992.0
        },
        {
          "id": "kd9tqao",
          "author": "kibastorm",
          "body": "thank you… it was rough, i cried the entire time because my mom made it and i really really wanted to eat it and my brain/body kept trying to gag and puke and fuck man it was hard as hell, it didn’t even taste bad i don’t know why the fuck it was so difficult",
          "created_utc": 1702523310.0
        },
        {
          "id": "kdbhgx0",
          "author": "None",
          "body": "You're a sweet daughter. I'm hoping your mom is understanding, it sounds like she might be from the way you speak about wanting to eat the food. Anyway, wishing you well with all of this. It's hard",
          "created_utc": 1702561155.0
        },
        {
          "id": "kdbl62a",
          "author": "kibastorm",
          "body": "thank you, she is very understanding for sure, especially because everyone told her i’d just “grow out of it” and here i am at 24 and still struggling with it !",
          "created_utc": 1702562871.0
        }
      ]
    },
    {
      "id": "kdiplhg",
      "author": "unboxxed",
      "body": "This is such a big help! If you can try to pinpoint preparation methods that you like the most vs least, it may help you in finding the best dishes that will cause the least negative reactions! ❤️🫂 So incredibly proud of you, OP!!!\n\nIf it helps, [here's a blog post on 9 different methods for cooking broccoli](https://food52.com/blog/25552-how-to-cook-broccoli); The article mentions the author's cooking methods, and what the end results end up being (soft vs crispy).",
      "created_utc": 1702673419.0,
      "score": 1,
      "context": [
        {
          "id": "kd9wiz2",
          "author": "dumbroad",
          "body": "it gets better you have to keep trying. i stopped throwing up/dry heaving or crying around 25, could eat veggies in public in small amounts like 4x a yr by 27, now im 30 and it only feels pretty awful (instead of absolutely terrible), i can pass as relatively normal in public whenever needed, about 1x a week. i still make faces privately. \n\ni recommend squeezing a stress ball and positive self talk. \n\ni actually just had broccoli today. i use a vegetable dicer to chop it up into small pieces. i find this much easier than dealing with full broccoli stalk.",
          "created_utc": 1702524551.0
        },
        {
          "id": "kd9x39e",
          "author": "dumbroad",
          "body": "ps great work and thanks for sharing the reality",
          "created_utc": 1702524805.0
        },
        {
          "id": "kda0gwe",
          "author": "kibastorm",
          "body": "thank you so fucking much for all of your advise i’ll definitely try that. i’m planning to try and eat atleast one piece of each thing in the stir fry every day this week and build up from there. ❤️",
          "created_utc": 1702526375.0
        },
        {
          "id": "kdf1h01",
          "author": "Chicklecat13",
          "body": "Also try different ways of cooking it, for example I LOVE carrots roasted in the oven with honey, butter and garlic but if you give me boiled or steamed carrots I can’t cope. It’s the same with cauliflower and broccoli, I love them with a cheesy sauce over them but any other way and I cannot cope.",
          "created_utc": 1702611617.0
        }
      ]
    }
  ]
}