{
  "id": "18ouikh",
  "subreddit": "ARFID",
  "author": "LateBiloomer",
  "created_utc": 1703295417.0,
  "title": "Reddit when picky eaters exist: \"get over it\" \"childish\" Also Reddit when westerners are disgusted by organ meat: \"legitimate preference\"",
  "selftext": "Suddenly they understand when it's something they personally find disgusting 🤔\n\nSome comments are even trying to rationally justify how it's different to picky eating which I find funny.\n\nhttps://www.reddit.com/r/NoStupidQuestions/s/AALrmr8s7r",
  "url": "https://www.reddit.com/r/ARFID/comments/18ouikh/reddit_when_picky_eaters_exist_get_over_it/",
  "score": 147,
  "num_comments": 10,
  "comments": [
    {
      "id": "kejsrni",
      "author": "elfinglamour",
      "body": "I want someone to post the same thing and say brussel sprouts or something instead of organ meat.  \nThere is a comment in there saying it's not the same as an adult refusing to eat broccoli lol how? How is it not exactly the same?\n\nPersonally I don't like liver and kidney, but I know I don't like them because I've actually tried them before.  \nCan't believe I, a person that won't eat something onion has even looked at, am less of a baby than all the people on that thread.",
      "created_utc": 1703298396.0,
      "score": 38,
      "context": []
    },
    {
      "id": "kejts6r",
      "author": "Kelekona",
      "body": "I didn't read too much comments about \"being picky\" because the allergy and religious exemption people drowned it out.\n\nIt's a cultural blind-spot I guess because many redditors don't knowingly eat organ meat as part of their culture but are used to being called childish if they don't want to eat vegetables.  Also it made me realize that I had never questioned what was in braunschweiger.  (I like liver, so no worries.)\n\nAlso too many people think that mental illness is something to be ashamed of.  (Thinking that normal food is disgusting is a bit of a short-circuit.)",
      "created_utc": 1703298873.0,
      "score": 18,
      "context": []
    },
    {
      "id": "keka3dt",
      "author": "sharkprincefishstick",
      "body": "Amen. Not wanting to try a food is not wanting to try a food. And it’s even weirder because that’s just another cut of meat. It’s either all meat is gross or none of it should be gross to them, right?",
      "created_utc": 1703307361.0,
      "score": 10,
      "context": []
    },
    {
      "id": "kemphhe",
      "author": "GameMusic",
      "body": "Neurotypicals try to form any opinion which is not just rationalized cultural bias challenge IMPOSSIBLE",
      "created_utc": 1703351183.0,
      "score": 7,
      "context": []
    },
    {
      "id": "kejnv3i",
      "author": "Angelsscythe",
      "body": "I wouldn't mind too much...\n\nReddit can be both incredibly supportive and incredibly toxic. Some communauty has been nothing but sweet, other are just a giant pain in the ass. I guess it's because everybody are like that.\n\nOr it's the fact that organs are vastly known as yikes by people while other won't get that we can't stomach fat or fruit part in yaourt. (I give example for myself, Idk what are yours)",
      "created_utc": 1703296240.0,
      "score": 10,
      "context": []
    },
    {
      "id": "kejpgex",
      "author": "mlo9109",
      "body": "Ooh, as a vegetarian due in part to arfid (can't do animal products texture, smell, or taste wise), this hits hard. Like, you literally eat the same 3 dead animals on rotation every night (and the parts you're eating better not make you aware of that fact). And I'm the one with the limited diet?",
      "created_utc": 1703296918.0,
      "score": 7,
      "context": []
    },
    {
      "id": "kek7h3m",
      "author": "smalltown_dreamspeak",
      "body": "The comments on that post kind of shocked me. I was prepared to go into it learning that organ meat is viewed differently in Singapore in some way, but got the same \"allergies\" responses as basically anything else.",
      "created_utc": 1703305878.0,
      "score": 11,
      "context": [
        {
          "id": "kejsrni",
          "author": "elfinglamour",
          "body": "I want someone to post the same thing and say brussel sprouts or something instead of organ meat.  \nThere is a comment in there saying it's not the same as an adult refusing to eat broccoli lol how? How is it not exactly the same?\n\nPersonally I don't like liver and kidney, but I know I don't like them because I've actually tried them before.  \nCan't believe I, a person that won't eat something onion has even looked at, am less of a baby than all the people on that thread.",
          "created_utc": 1703298396.0
        }
      ]
    },
    {
      "id": "kelmpf0",
      "author": "mlo9109",
      "body": "And this is part of why I don't eat animal products. I'd be a terrible carnivore. I wouldn't eat anything that made it obvious what part of the animal it was or the whole animal (lobster, crab, etc.) I'd basically live on well done hamburger meat and boneless, skinless chicken breast. Might as well not eat any of it.",
      "created_utc": 1703335632.0,
      "score": 6,
      "context": [
        {
          "id": "keka3dt",
          "author": "sharkprincefishstick",
          "body": "Amen. Not wanting to try a food is not wanting to try a food. And it’s even weirder because that’s just another cut of meat. It’s either all meat is gross or none of it should be gross to them, right?",
          "created_utc": 1703307361.0
        }
      ]
    },
    {
      "id": "keks805",
      "author": "LeakyFountainPen",
      "body": "For *REAL!* \n\nNothing made me more confused than when I stopped eating animal products and my grandfather had so much to say about my meals after a *lifetime* of him telling me I was too picky for my (then undiagnosed) ARFID. \n\nLike \"Oh what's that grandpa? My tofurky dish is...*yucky,* you say? Hm...that reminds me a lot of something....I can't quite put my finger on it. You know a wise old man once told me to......suck it up and stop making such a fuss at dinner, and to just eat whatever was put in front of me....but I just can't quite remember who....\"",
      "created_utc": 1703317871.0,
      "score": 11,
      "context": [
        {
          "id": "kejpgex",
          "author": "mlo9109",
          "body": "Ooh, as a vegetarian due in part to arfid (can't do animal products texture, smell, or taste wise), this hits hard. Like, you literally eat the same 3 dead animals on rotation every night (and the parts you're eating better not make you aware of that fact). And I'm the one with the limited diet?",
          "created_utc": 1703296918.0
        }
      ]
    },
    {
      "id": "keo1npf",
      "author": "sharkprincefishstick",
      "body": "At this point, I’d say you aren’t really missing out on anything. There are so many alternatives to meat that taste as good- if not better -than the real thing. If my body could handle soy, I’d probably be vegetarian just because the options out there are really interesting!",
      "created_utc": 1703370740.0,
      "score": 3,
      "context": [
        {
          "id": "keka3dt",
          "author": "sharkprincefishstick",
          "body": "Amen. Not wanting to try a food is not wanting to try a food. And it’s even weirder because that’s just another cut of meat. It’s either all meat is gross or none of it should be gross to them, right?",
          "created_utc": 1703307361.0
        },
        {
          "id": "kelmpf0",
          "author": "mlo9109",
          "body": "And this is part of why I don't eat animal products. I'd be a terrible carnivore. I wouldn't eat anything that made it obvious what part of the animal it was or the whole animal (lobster, crab, etc.) I'd basically live on well done hamburger meat and boneless, skinless chicken breast. Might as well not eat any of it.",
          "created_utc": 1703335632.0
        }
      ]
    }
  ]
}