{
  "id": "19awkho",
  "subreddit": "ARFID",
  "author": "Normal_Article491",
  "created_utc": 1705705448.0,
  "title": "I asked my therapist today to read up on ARFID and she told me no.",
  "selftext": "She pointed to her bookshelf and said “it’s not in any of those” and she doesn’t believe in labels. \nI felt extremely invalidated. I really liked her up until this point and now I don’t think I can move past this. Isn’t ARFID in the dsm5?\n\nAdded (Monday am):\nShe emailed back but I’m too afraid to open it…. ",
  "url": "https://www.reddit.com/r/ARFID/comments/19awkho/i_asked_my_therapist_today_to_read_up_on_arfid/",
  "score": 210,
  "num_comments": 88,
  "comments": [
    {
      "id": "kinu7io",
      "author": "underinfinitebluesky",
      "body": "It is in the DSM5. Any person in a position like doctor or therapist who is in charge of the wellbeing of others, and who refuses to stay up to date with current research and understandings in that field, can't be trusted with being in charge of anyone's health.",
      "created_utc": 1705705879.0,
      "score": 371,
      "context": []
    },
    {
      "id": "kinykbn",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1705707537.0,
      "score": 102,
      "context": []
    },
    {
      "id": "kinuj0g",
      "author": "vorarefilia",
      "body": "Guess there was no DSM-5 on that bookshelf...",
      "created_utc": 1705705999.0,
      "score": 153,
      "context": []
    },
    {
      "id": "kinynbu",
      "author": "chunkeymunkeyandrunt",
      "body": "It was technically in previous DSM editions too, it was just labeled differently … \n\nYou should report her honestly. A therapist straight up refusing to educate themselves on something their client has brought up (and is a LEGITIMATE EATING DISORDER IN THE DSM V) is frankly dangerous in my opinion. What else is she refusing to educate herself on for her clients??\n\nETA: also, what the fuck is this ‘I don’t believe in labels’ HOMIE THE DSM IS LITERALLY A COMPENDIUM OF ALL THE LABELS WE HAVE FOR DISORDERS AND MEDICAL CONDITIONS?!??",
      "created_utc": 1705707571.0,
      "score": 75,
      "context": []
    },
    {
      "id": "kinym76",
      "author": "Agile-Artichoke9463",
      "body": "It is in the dsm5. Where the problem comes in is because it’s still such a new disorder even though it’s been added to it in the last decade or so, that a lot of doctors and professionals don’t yet acknowledge it or know about it. There’s so many variables when it comes to ARFID that a lot of them just don’t know how to treat it or handle it. Honestly the only thing that’s helped me is exposure therapy, and I’ve tried every therapy related to eating disorders, and ask yourself questions of the 4 senses. So what does it look like? What does it smell like? What does it feel like? And finally what it does it taste like? Describe the food as neutral as possible, and keep doing that exercise until you don’t need to do it anymore and keep exposing yourself to it as often as possible. I got super lucky with my therapist and my nutritionist cause trying to find help in Quebec was damn near impossible. They either didn’t know about it, or couldn’t help me cause I’m an adult. It’s frustrating. \n\nBut stay positive, try the exposure method, you got this!",
      "created_utc": 1705707558.0,
      "score": 11,
      "context": []
    },
    {
      "id": "kio5b1p",
      "author": "socraticalastor",
      "body": "Not a psychologist, but upper-year clinical psychology student here. Psychologists are bound to “evidence-based practice.” This means that not only are they required to practice therapies based on statistical evidence as to the efficacy, but they are also duty-bound to stay up to date on research and clinical information, including diagnoses within the DSM-5. I would encourage you to not only find a different therapist but let your state or country’s licensing organization know about her conduct, as that is grossly negligible and could cause serious harm to you or another patient, ESPECIALLY regarding eating disorders, whether weight-based or not. If you decide to report her and would like help finding out who to contact, feel free to reach out. I’m very sorry this happened to you.",
      "created_utc": 1705710174.0,
      "score": 5,
      "context": []
    },
    {
      "id": "kinywpl",
      "author": "ScobJob",
      "body": "It’s not helpful for you to feel invalidated, so it definitely would have been better for her to say something along the lines of, “I am hearing this is important to you that I know about ARFID. I’m curious, if everything went your way, what would the next steps be for our discussions?”\n\nShe should have accessed why this is important to you: do you want diagnosis validation and/or ARFID-based treatment help? Ultimately, gently, I do believe she is correct that the label is not as important unless it changes how she would treat you. She is not a dietician, so she can only help you with your feelings toward food. Many of these feelings are rooted in anxiety, so using anti-anxiety techniques is the answer here. \n\nDiagnoses can certainly feel validating and the help one can achieve by sharing in experiences with people with similar issues is beautiful. However, gently, I think some soul-searching here is valuable. Ask yourself what you would have wanted to go differently, make a plan, and advocate for yourself next session. [Here is a TherapistAid PDF on Assertive Communication that may be helpful for planning this out.](https://www.therapistaid.com/worksheets/assertive-communication)\n\nUltimately, this is my opinion, and we don’t need to agree! What matters is that you feel that you have some control and are respected by your therapist! \n\nAdditionally, I have found radical acceptance practices to be massively helpful in times of stress and in situations when I can’t make changes immediately, but need to soothe myself. [Here is a PDF worksheet on that if you are interested.](https://mhawv.org/wp-content/uploads/2021/04/Worksheet-Practicing-Radical-Acceptance.pdf)\n\nLastly, you got this! This may be a bit of a setback, but I believe you can advocate for the changes you need!",
      "created_utc": 1705707671.0,
      "score": 6,
      "context": []
    },
    {
      "id": "kio0si5",
      "author": "mercurys-daughter",
      "body": "Report her",
      "created_utc": 1705708401.0,
      "score": 5,
      "context": []
    },
    {
      "id": "kio26bm",
      "author": "StellaEtoile1",
      "body": "I’m so sorry she was so invalidating! Not to mention plain wrong!\nWould it be possible for you to let her know before your next session that you would like to spend a few sessions talking about?\nYou don’t even have to buy a copy it’s online for free. If you let her know in advance that you would like to have say in what you talk about and start with the fact that ARFID is a medical diagnosis and you would like it to be acknowledged as such and that you would like to control the conversation about it as opposed to being invalidated maybe she can be prepared and you guys can have a good conversation about it. If she refuses, maybe tell her that you would like to change therapists!\nBest of luck and keep us posted!",
      "created_utc": 1705708938.0,
      "score": 4,
      "context": []
    },
    {
      "id": "kiodrns",
      "author": "InevitablePersimmon6",
      "body": "It’s in the DSM-5. It was SED in the older versions. She’s wrong.",
      "created_utc": 1705713565.0,
      "score": 5,
      "context": []
    },
    {
      "id": "kioxoc8",
      "author": "MustProtectTheFairy",
      "body": "OP, tell your therapist to look up ICD-10 code F50.8.",
      "created_utc": 1705721963.0,
      "score": 5,
      "context": []
    },
    {
      "id": "kioystk",
      "author": "KidsDontEvenMatter",
      "body": "Not only do I have ARFID but I’m also a psychology major. We learnt about ARFID in Psychology 101. The most basic of basics. Absurd statement on her end if you ask me.",
      "created_utc": 1705722474.0,
      "score": 4,
      "context": []
    },
    {
      "id": "kinz1hd",
      "author": "geekgeek2019",
      "body": "change therapist!",
      "created_utc": 1705707722.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kiod7kk",
      "author": "Normal_Article491",
      "body": "Also she told me that I just needed to go to a naturopath or something like that, to look into my food allergies and intolerances. Because I’m allergic to egg yolks, pineapple, kiwi, and have a gluten sensitivity.",
      "created_utc": 1705713341.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kioy46c",
      "author": "EwDavid999",
      "body": "If you do speak to her again, it may be helpful to gain some type of closure. Starting with a brief \"hey, in our last meeting I brought up something I was worried about and you said you wouldn't look it up or into it. That concerns me. Can you explain what happened there?\" \n\nIf you feel as if she has one ounce of defensiveness instead of stepping up, apologizing & helping you to feel better then its time to cut ties. \n\n\"To be honest [therapist name], it feels as if you're more concerned with being right than ensuring this is a safe space for me to engage in any healing. The purpose of our meetings is for me to make progress and without trust and good faith, I don't see how that can happen now. It's best we part ways here because this isn't beneficial for myself any longer. It's unfortunate as I felt we had great previous sessions. Thank you for your time and I wish you the best in the future\"",
      "created_utc": 1705722161.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kip4ihi",
      "author": "skyekitty",
      "body": "Its in DSM 5 AND it  was in DSM 4 under \"Selective Eating Disorder\" (outdated name + age restricted diagnosis)\n\nediting to add: I was actually so lucky to have a doctor who's daughter also had ARFID advocate for me when making my referrals, try to see if you can find somebody informed in EDs and ask if they're familiar with ARFID. It's not \"treated\" the same way that  other EDs are",
      "created_utc": 1705725207.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kipgl4m",
      "author": "wasurenaku",
      "body": "My therapist during college specialized in anxiety and did research for best how to help me with ARFID and he was a “free” therapist. Definitely switch, your therapist should genuinely want to help you. Approaching treatment as anxiety helped me a lot by the way- ARFID is considered an eating disorder but I think phobia is a better way to describe/treat it.",
      "created_utc": 1705731916.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kiq5da5",
      "author": "None",
      "body": "“Naturopath” run for the hills! \n\nPlease make sure you see a therapist who specialises in eating disorders. Eating disorders are not something to mess around with. Time is of the essence.",
      "created_utc": 1705749963.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kiqjovn",
      "author": "Numerous_Formal4130",
      "body": "I’d be absolutely livid if I were you tbh. Arfid can make such a huge impact on one’s life and therefor their mental wellbeing. Her flat out saying “no” is basically insinuating she thinks you’re making it up and isn’t putting in the effort that’s HER job. Therapists who stick in their old ways instead of changing with the times are the very dangerous ones.",
      "created_utc": 1705758146.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kipfrou",
      "author": "Desert_Fairy",
      "body": "I caution you on telling her to open her own book. If her copy is more than 10 years old, it may be under a different name. \n\nOtherwise, your therapist just told you how badly she did in school. Because she obviously didn’t keep up with the whole scientific method thing.",
      "created_utc": 1705731403.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kipiltm",
      "author": "randomlygeneratedbss",
      "body": "Wow, fire her. More incompetencies and disrespect lurking: ARFID has BEEN in the dsm, and that’s not how you handle that regardless, at ALL",
      "created_utc": 1705733230.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kiqx4tx",
      "author": "mylifeisadankmeme",
      "body": "Eating disorders and disordered eating are real  \nThis woman is an idiot \nWorse, an arrogant idiot. \nYou deserve help not invalidation and feeling like you have to justify yourself. \nDon't give her another penny of your hard earned money. \nMe, I'd put in an official complaint digitally AND snail mail for paper trail too.",
      "created_utc": 1705763919.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kiww182",
      "author": "wfpinky",
      "body": "I’m sorry the person that you trusted to help you totally invalidated your completely reasonable concern/request. I am not a doctor or counselor in any way shape or form but I do see many of them due to my own mental and physical health issues. It is my understanding (in my state at least) mental health professionals are required by law to keep up with the latest DSM just like a school teacher or a nurse is required to complete a specific amount of continuing education courses throughout the year. The fact that your therapist was so quick to dismiss it by saying it doesn’t exist is…concerning. It would have been one thing had she said something like, “I am not well versed in ARFID, let me look into it” but that’s not what happened. I don’t expect my psychiatrist to know every single diagnosis listed in the DSM 5 off the top of his head but he has always been quick to humbly admit not being an expert on something in the moment and I respect him for it. If he doesn’t feel comfortable speaking on a particular diagnosis in the moment, for example ARFID, he makes a point to do serious research on it before my next session and then we discuss further. It’s a big reason why I trust him and he knows it. If it were me I’d be considering filing a complaint against your therapist with your state’s licensing board, but that’s a very personal decision that only you can make. All she had to do was a quick google search, hell she could have cracked open a recent copy of the DSM (which she should definitely have quick access to due to her profession). A complaint of this nature wouldn’t be enough for her to outright lose her license, but it may enough of a slap on the hand for her to realize she can’t be talking out of her ass like that.",
      "created_utc": 1705858192.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kisf5op",
      "author": "NoirLuvve",
      "body": "Sorry, but no therapist or mental health professional \"doesn't believe\" in labels. The entire foundation of psychotherapy is labeling and understanding thoughts, behaviors, and symptoms. Did she get her license in a cereal box?",
      "created_utc": 1705783312.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kit1b32",
      "author": "appanaula",
      "body": "That’s a terrible therapist",
      "created_utc": 1705791317.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kitct0x",
      "author": "chemilieon",
      "body": "That’s so tough, my therapist kinda did the opposite, she said she would read up on it but then never did and we haven’t discussed it since then",
      "created_utc": 1705795719.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kiuwbdf",
      "author": "Dezert956",
      "body": "Bish, it is absolutely in those",
      "created_utc": 1705819406.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kinv084",
      "author": "Normal_Article491",
      "body": "I’m so dissapointed.  I really really liked her and she was helping me a lot. But this just set me back and now I don’t think I should see her again. I don’t understand how she could just tell me “no” I won’t look into this further.",
      "created_utc": 1705706179.0,
      "score": 122,
      "context": [
        {
          "id": "kinu7io",
          "author": "underinfinitebluesky",
          "body": "It is in the DSM5. Any person in a position like doctor or therapist who is in charge of the wellbeing of others, and who refuses to stay up to date with current research and understandings in that field, can't be trusted with being in charge of anyone's health.",
          "created_utc": 1705705879.0
        }
      ]
    },
    {
      "id": "kinypik",
      "author": "Normal_Article491",
      "body": "Thank you. This is what I was planning on doing. I want to go back and show her and make her feel dumb because she made me feel so fucking stupid",
      "created_utc": 1705707593.0,
      "score": 52,
      "context": [
        {
          "id": "kinykbn",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1705707537.0
        }
      ]
    },
    {
      "id": "kinvaaj",
      "author": "Normal_Article491",
      "body": "There definitely was which is why I’m so confused….. I have a huge problem with self doubt so I’m wondering if I made it sound so new and uncommon that she just thought I found it online? Either way, it feels rude that she wouldn’t even be willing to look into it",
      "created_utc": 1705706284.0,
      "score": 74,
      "context": [
        {
          "id": "kinuj0g",
          "author": "vorarefilia",
          "body": "Guess there was no DSM-5 on that bookshelf...",
          "created_utc": 1705705999.0
        }
      ]
    },
    {
      "id": "kinzfvc",
      "author": "Normal_Article491",
      "body": "I really loved her until today and I can’t shake this horrible feeling now. It was so shocking that she said no so flat out. Like how close minded are you?????? I’m BAFFLED. and I consider myself a mental health professional as well who wants to get my masters in social work. And I already know that her behavior was so wrong in so many ways.",
      "created_utc": 1705707875.0,
      "score": 24,
      "context": [
        {
          "id": "kinynbu",
          "author": "chunkeymunkeyandrunt",
          "body": "It was technically in previous DSM editions too, it was just labeled differently … \n\nYou should report her honestly. A therapist straight up refusing to educate themselves on something their client has brought up (and is a LEGITIMATE EATING DISORDER IN THE DSM V) is frankly dangerous in my opinion. What else is she refusing to educate herself on for her clients??\n\nETA: also, what the fuck is this ‘I don’t believe in labels’ HOMIE THE DSM IS LITERALLY A COMPENDIUM OF ALL THE LABELS WE HAVE FOR DISORDERS AND MEDICAL CONDITIONS?!??",
          "created_utc": 1705707571.0
        }
      ]
    },
    {
      "id": "kioipom",
      "author": "Normal_Article491",
      "body": "What gets me is she even said “you know I believe that science is always changing and growing” but also told me that it’s concerning that I’m finding this diagnosis on the internet. Like didn’t even consider that it could be real???? What the fuck…. I’m so insulted because up until this point she has treated me with respect and knows that I’m a very self aware person with a psych degree who loves to research. Like I’ve read real medical articles on ARFID not just social media posts. \nI’m not saying she needed to believe me, but at least look into it to understand where I’m coming from.",
      "created_utc": 1705715552.0,
      "score": 11,
      "context": [
        {
          "id": "kinynbu",
          "author": "chunkeymunkeyandrunt",
          "body": "It was technically in previous DSM editions too, it was just labeled differently … \n\nYou should report her honestly. A therapist straight up refusing to educate themselves on something their client has brought up (and is a LEGITIMATE EATING DISORDER IN THE DSM V) is frankly dangerous in my opinion. What else is she refusing to educate herself on for her clients??\n\nETA: also, what the fuck is this ‘I don’t believe in labels’ HOMIE THE DSM IS LITERALLY A COMPENDIUM OF ALL THE LABELS WE HAVE FOR DISORDERS AND MEDICAL CONDITIONS?!??",
          "created_utc": 1705707571.0
        }
      ]
    },
    {
      "id": "kinz8kx",
      "author": "Normal_Article491",
      "body": "I appreciate you so so much! This is very helpful!!!! \n\nI wish my therapist didn’t shut me down so quickly. She said we could try different things to help my anxiety around eating but basically she won’t call it what I’m calling it and that she doesn’t believe I have an eating disorder because I don’t have body image issues. But how can I continue to see her when she didn’t even believe it was real? That makes me feel horrible. And she’s only 30 so she has only ever used the dsm5 so she should know about it.",
      "created_utc": 1705707797.0,
      "score": 12,
      "context": [
        {
          "id": "kinym76",
          "author": "Agile-Artichoke9463",
          "body": "It is in the dsm5. Where the problem comes in is because it’s still such a new disorder even though it’s been added to it in the last decade or so, that a lot of doctors and professionals don’t yet acknowledge it or know about it. There’s so many variables when it comes to ARFID that a lot of them just don’t know how to treat it or handle it. Honestly the only thing that’s helped me is exposure therapy, and I’ve tried every therapy related to eating disorders, and ask yourself questions of the 4 senses. So what does it look like? What does it smell like? What does it feel like? And finally what it does it taste like? Describe the food as neutral as possible, and keep doing that exercise until you don’t need to do it anymore and keep exposing yourself to it as often as possible. I got super lucky with my therapist and my nutritionist cause trying to find help in Quebec was damn near impossible. They either didn’t know about it, or couldn’t help me cause I’m an adult. It’s frustrating. \n\nBut stay positive, try the exposure method, you got this!",
          "created_utc": 1705707558.0
        }
      ]
    },
    {
      "id": "kioaggm",
      "author": "Normal_Article491",
      "body": "I feel crazy because she said “you’re fine, you eat.” And that was weird to me because when has she ever seen me eat? Why would she say that? I felt like I had to convince her that I wasn’t eating enough and I just can’t stop crying. And my session was 8 hours ago.",
      "created_utc": 1705712231.0,
      "score": 8,
      "context": [
        {
          "id": "kio5b1p",
          "author": "socraticalastor",
          "body": "Not a psychologist, but upper-year clinical psychology student here. Psychologists are bound to “evidence-based practice.” This means that not only are they required to practice therapies based on statistical evidence as to the efficacy, but they are also duty-bound to stay up to date on research and clinical information, including diagnoses within the DSM-5. I would encourage you to not only find a different therapist but let your state or country’s licensing organization know about her conduct, as that is grossly negligible and could cause serious harm to you or another patient, ESPECIALLY regarding eating disorders, whether weight-based or not. If you decide to report her and would like help finding out who to contact, feel free to reach out. I’m very sorry this happened to you.",
          "created_utc": 1705710174.0
        }
      ]
    },
    {
      "id": "kinzxh7",
      "author": "Normal_Article491",
      "body": "Part of me saw what she was saying that she can still help me but doesn’t need to call it what I call it, but it still felt wrong for her to invalidate me. It felt like she was insulted that I told her I was looking up eating disorder specialists. She said if I didn’t think we could solve the problem here, then fine…. \nWhich felt very petty to me…. Idk it just made me feel icky and I haven’t stopped crying since I left her office 6 hours ago",
      "created_utc": 1705708065.0,
      "score": 7,
      "context": [
        {
          "id": "kinywpl",
          "author": "ScobJob",
          "body": "It’s not helpful for you to feel invalidated, so it definitely would have been better for her to say something along the lines of, “I am hearing this is important to you that I know about ARFID. I’m curious, if everything went your way, what would the next steps be for our discussions?”\n\nShe should have accessed why this is important to you: do you want diagnosis validation and/or ARFID-based treatment help? Ultimately, gently, I do believe she is correct that the label is not as important unless it changes how she would treat you. She is not a dietician, so she can only help you with your feelings toward food. Many of these feelings are rooted in anxiety, so using anti-anxiety techniques is the answer here. \n\nDiagnoses can certainly feel validating and the help one can achieve by sharing in experiences with people with similar issues is beautiful. However, gently, I think some soul-searching here is valuable. Ask yourself what you would have wanted to go differently, make a plan, and advocate for yourself next session. [Here is a TherapistAid PDF on Assertive Communication that may be helpful for planning this out.](https://www.therapistaid.com/worksheets/assertive-communication)\n\nUltimately, this is my opinion, and we don’t need to agree! What matters is that you feel that you have some control and are respected by your therapist! \n\nAdditionally, I have found radical acceptance practices to be massively helpful in times of stress and in situations when I can’t make changes immediately, but need to soothe myself. [Here is a PDF worksheet on that if you are interested.](https://mhawv.org/wp-content/uploads/2021/04/Worksheet-Practicing-Radical-Acceptance.pdf)\n\nLastly, you got this! This may be a bit of a setback, but I believe you can advocate for the changes you need!",
          "created_utc": 1705707671.0
        }
      ]
    },
    {
      "id": "kioakpm",
      "author": "Normal_Article491",
      "body": "Should I really? I feel bad 😭 but also, I FEEL BAD! Like I feel horrible after this session and that feels wrong",
      "created_utc": 1705712279.0,
      "score": 5,
      "context": [
        {
          "id": "kio0si5",
          "author": "mercurys-daughter",
          "body": "Report her",
          "created_utc": 1705708401.0
        }
      ]
    },
    {
      "id": "kio9yoe",
      "author": "Normal_Article491",
      "body": "She straight up told me we can work to fix the problem but she won’t call it what I want her to and that the problem is just anxiety. Idk it just felt so weird and I feel so icky and I’m not totally sure how to go about this. Thankfully I have 2 weeks before next session.",
      "created_utc": 1705712032.0,
      "score": 3,
      "context": [
        {
          "id": "kio26bm",
          "author": "StellaEtoile1",
          "body": "I’m so sorry she was so invalidating! Not to mention plain wrong!\nWould it be possible for you to let her know before your next session that you would like to spend a few sessions talking about?\nYou don’t even have to buy a copy it’s online for free. If you let her know in advance that you would like to have say in what you talk about and start with the fact that ARFID is a medical diagnosis and you would like it to be acknowledged as such and that you would like to control the conversation about it as opposed to being invalidated maybe she can be prepared and you guys can have a good conversation about it. If she refuses, maybe tell her that you would like to change therapists!\nBest of luck and keep us posted!",
          "created_utc": 1705708938.0
        }
      ]
    },
    {
      "id": "kipqvcs",
      "author": "Normal_Article491",
      "body": "Thank you, I just added this to my email I sent her explaining how wronged I felt after todays session and how if she doesn’t feel the need to further educate herself on arfid then I don’t feel the need to see her again",
      "created_utc": 1705739052.0,
      "score": 3,
      "context": [
        {
          "id": "kioxoc8",
          "author": "MustProtectTheFairy",
          "body": "OP, tell your therapist to look up ICD-10 code F50.8.",
          "created_utc": 1705721963.0
        }
      ]
    },
    {
      "id": "kip7w23",
      "author": "EwDavid999",
      "body": "Bingo. I'm guessing she tends to be someone who disagrees with a lot of western medicine, including medications. That is scary. \n\nI have a gluten allergy and it's made my arfid so much worse.  This is because we have a valid reason to fear contamination! Also you have additional food allergies so that intensifies the fear. Your feelings are valid and you deserve a helper who doesn't let their own personal agenda, beliefs, misinformation and pride harm you instead of help you.",
      "created_utc": 1705726928.0,
      "score": 5,
      "context": [
        {
          "id": "kiod7kk",
          "author": "Normal_Article491",
          "body": "Also she told me that I just needed to go to a naturopath or something like that, to look into my food allergies and intolerances. Because I’m allergic to egg yolks, pineapple, kiwi, and have a gluten sensitivity.",
          "created_utc": 1705713341.0
        }
      ]
    },
    {
      "id": "kippt7z",
      "author": "Normal_Article491",
      "body": "Thank you for this so so much. This really helps me because I was struggling with how to go about this",
      "created_utc": 1705738267.0,
      "score": 2,
      "context": [
        {
          "id": "kioy46c",
          "author": "EwDavid999",
          "body": "If you do speak to her again, it may be helpful to gain some type of closure. Starting with a brief \"hey, in our last meeting I brought up something I was worried about and you said you wouldn't look it up or into it. That concerns me. Can you explain what happened there?\" \n\nIf you feel as if she has one ounce of defensiveness instead of stepping up, apologizing & helping you to feel better then its time to cut ties. \n\n\"To be honest [therapist name], it feels as if you're more concerned with being right than ensuring this is a safe space for me to engage in any healing. The purpose of our meetings is for me to make progress and without trust and good faith, I don't see how that can happen now. It's best we part ways here because this isn't beneficial for myself any longer. It's unfortunate as I felt we had great previous sessions. Thank you for your time and I wish you the best in the future\"",
          "created_utc": 1705722161.0
        }
      ]
    },
    {
      "id": "kipokp3",
      "author": "Normal_Article491",
      "body": "I just sent her an email that probably wasn’t the nicest but it also wasn’t derogatory in anyway. Just letting her know she’s wrong and to open up her dsm 5 and I sent several articles about the renaming and how it is not JUST anxiety but usually presents itself along with anxiety. Told her i hope she never makes anyone feel again the way she made me feel today",
      "created_utc": 1705737372.0,
      "score": 6,
      "context": [
        {
          "id": "kipfrou",
          "author": "Desert_Fairy",
          "body": "I caution you on telling her to open her own book. If her copy is more than 10 years old, it may be under a different name. \n\nOtherwise, your therapist just told you how badly she did in school. Because she obviously didn’t keep up with the whole scientific method thing.",
          "created_utc": 1705731403.0
        }
      ]
    },
    {
      "id": "kj1l8b2",
      "author": "Normal_Article491",
      "body": "Hey, I really appreciate the time you took to write this! I have been debating back and forth on whether to report her. I’m not sure what exactly the basis for reporting her would be? Only because I’ve never had to do this before and when I got very upset during session she told me that I was just having a bad reaction to her disagreeing with me. So I didn’t feel like I had any basis to report her. But maybe she was gaslighting me? I really feel so stupid after that session.",
      "created_utc": 1705933904.0,
      "score": 1,
      "context": [
        {
          "id": "kiww182",
          "author": "wfpinky",
          "body": "I’m sorry the person that you trusted to help you totally invalidated your completely reasonable concern/request. I am not a doctor or counselor in any way shape or form but I do see many of them due to my own mental and physical health issues. It is my understanding (in my state at least) mental health professionals are required by law to keep up with the latest DSM just like a school teacher or a nurse is required to complete a specific amount of continuing education courses throughout the year. The fact that your therapist was so quick to dismiss it by saying it doesn’t exist is…concerning. It would have been one thing had she said something like, “I am not well versed in ARFID, let me look into it” but that’s not what happened. I don’t expect my psychiatrist to know every single diagnosis listed in the DSM 5 off the top of his head but he has always been quick to humbly admit not being an expert on something in the moment and I respect him for it. If he doesn’t feel comfortable speaking on a particular diagnosis in the moment, for example ARFID, he makes a point to do serious research on it before my next session and then we discuss further. It’s a big reason why I trust him and he knows it. If it were me I’d be considering filing a complaint against your therapist with your state’s licensing board, but that’s a very personal decision that only you can make. All she had to do was a quick google search, hell she could have cracked open a recent copy of the DSM (which she should definitely have quick access to due to her profession). A complaint of this nature wouldn’t be enough for her to outright lose her license, but it may enough of a slap on the hand for her to realize she can’t be talking out of her ass like that.",
          "created_utc": 1705858192.0
        }
      ]
    },
    {
      "id": "kiphw3b",
      "author": "vi0l3t-crumbl3",
      "body": "Some therapists resist diagnosing. The best one I ever had was one. When you're someone who likes having a name for things it's frustrating (me). But if they are helping you, it's worth considering whether you can move past it. Finding a good therapist is hard!",
      "created_utc": 1705732756.0,
      "score": 31,
      "context": [
        {
          "id": "kinu7io",
          "author": "underinfinitebluesky",
          "body": "It is in the DSM5. Any person in a position like doctor or therapist who is in charge of the wellbeing of others, and who refuses to stay up to date with current research and understandings in that field, can't be trusted with being in charge of anyone's health.",
          "created_utc": 1705705879.0
        },
        {
          "id": "kinv084",
          "author": "Normal_Article491",
          "body": "I’m so dissapointed.  I really really liked her and she was helping me a lot. But this just set me back and now I don’t think I should see her again. I don’t understand how she could just tell me “no” I won’t look into this further.",
          "created_utc": 1705706179.0
        }
      ]
    },
    {
      "id": "kinz1ok",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1705707724.0,
      "score": 53,
      "context": [
        {
          "id": "kinykbn",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1705707537.0
        },
        {
          "id": "kinypik",
          "author": "Normal_Article491",
          "body": "Thank you. This is what I was planning on doing. I want to go back and show her and make her feel dumb because she made me feel so fucking stupid",
          "created_utc": 1705707593.0
        }
      ]
    },
    {
      "id": "kio6xlt",
      "author": "therealganjababe",
      "body": "Absolutely what I'd do. Fuck her for telling you that something that has such a huge effect on your life and psychology/well-being doesn't exist when it's clearly in the DMS-5. I would absolutely want to rub it in her face, and tell her to F off, and find a Dr who actually knows what they are talking about, and listens to their patients.\n\n\nI know that some therapists/Docs try to treat symptoms and not labels, because frankly there's a lot of comorbid issues with BP, and our experiences can vary. So it's not too strange to want to keep treating your symptoms, but to flat out deny this, and obviously refusing to even try looking it up because obvs 'they know best', is a tragedy and infuriating.",
      "created_utc": 1705710822.0,
      "score": 16,
      "context": [
        {
          "id": "kinykbn",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1705707537.0
        },
        {
          "id": "kinypik",
          "author": "Normal_Article491",
          "body": "Thank you. This is what I was planning on doing. I want to go back and show her and make her feel dumb because she made me feel so fucking stupid",
          "created_utc": 1705707593.0
        }
      ]
    },
    {
      "id": "kinyr4s",
      "author": "Normal_Article491",
      "body": "And I really really liked her",
      "created_utc": 1705707610.0,
      "score": 13,
      "context": [
        {
          "id": "kinykbn",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1705707537.0
        },
        {
          "id": "kinypik",
          "author": "Normal_Article491",
          "body": "Thank you. This is what I was planning on doing. I want to go back and show her and make her feel dumb because she made me feel so fucking stupid",
          "created_utc": 1705707593.0
        }
      ]
    },
    {
      "id": "kio3gwb",
      "author": "vorarefilia",
      "body": "It's not your job to convince your therapist!",
      "created_utc": 1705709446.0,
      "score": 44,
      "context": [
        {
          "id": "kinuj0g",
          "author": "vorarefilia",
          "body": "Guess there was no DSM-5 on that bookshelf...",
          "created_utc": 1705705999.0
        },
        {
          "id": "kinvaaj",
          "author": "Normal_Article491",
          "body": "There definitely was which is why I’m so confused….. I have a huge problem with self doubt so I’m wondering if I made it sound so new and uncommon that she just thought I found it online? Either way, it feels rude that she wouldn’t even be willing to look into it",
          "created_utc": 1705706284.0
        }
      ]
    },
    {
      "id": "kiorky2",
      "author": "MarsupialPristine677",
      "body": "Even if you came off that way, she handled it really unkindly and that’s not on you at all 💜 It’s definitely rude of her not to like. Crack open the DSM-5 and see that it’s literally right there in the book. Jesus. Even if someone shows up to therapy with wild theories (which you did not) that is a STARTING PLACE for the therapist to help figure out what the hap is fuckening, yk? I’m really sorry you’ve had such a nasty experience. 💜",
      "created_utc": 1705719273.0,
      "score": 14,
      "context": [
        {
          "id": "kinuj0g",
          "author": "vorarefilia",
          "body": "Guess there was no DSM-5 on that bookshelf...",
          "created_utc": 1705705999.0
        },
        {
          "id": "kinvaaj",
          "author": "Normal_Article491",
          "body": "There definitely was which is why I’m so confused….. I have a huge problem with self doubt so I’m wondering if I made it sound so new and uncommon that she just thought I found it online? Either way, it feels rude that she wouldn’t even be willing to look into it",
          "created_utc": 1705706284.0
        }
      ]
    },
    {
      "id": "kioflvx",
      "author": "Inverness07",
      "body": "It is definitely rude",
      "created_utc": 1705714303.0,
      "score": 10,
      "context": [
        {
          "id": "kinuj0g",
          "author": "vorarefilia",
          "body": "Guess there was no DSM-5 on that bookshelf...",
          "created_utc": 1705705999.0
        },
        {
          "id": "kinvaaj",
          "author": "Normal_Article491",
          "body": "There definitely was which is why I’m so confused….. I have a huge problem with self doubt so I’m wondering if I made it sound so new and uncommon that she just thought I found it online? Either way, it feels rude that she wouldn’t even be willing to look into it",
          "created_utc": 1705706284.0
        }
      ]
    },
    {
      "id": "kio0qfa",
      "author": "chunkeymunkeyandrunt",
      "body": "I can absolutely understand why you’d be having some feelings! I’m appalled on your behalf and I don’t know this lady at all! \n\nI just want to reiterate that **you did nothing wrong** and she is entirely at fault here. It’s so easy to internalize it and worry that something you did made her react this way, but that is not the case!!",
      "created_utc": 1705708379.0,
      "score": 15,
      "context": [
        {
          "id": "kinynbu",
          "author": "chunkeymunkeyandrunt",
          "body": "It was technically in previous DSM editions too, it was just labeled differently … \n\nYou should report her honestly. A therapist straight up refusing to educate themselves on something their client has brought up (and is a LEGITIMATE EATING DISORDER IN THE DSM V) is frankly dangerous in my opinion. What else is she refusing to educate herself on for her clients??\n\nETA: also, what the fuck is this ‘I don’t believe in labels’ HOMIE THE DSM IS LITERALLY A COMPENDIUM OF ALL THE LABELS WE HAVE FOR DISORDERS AND MEDICAL CONDITIONS?!??",
          "created_utc": 1705707571.0
        },
        {
          "id": "kinzfvc",
          "author": "Normal_Article491",
          "body": "I really loved her until today and I can’t shake this horrible feeling now. It was so shocking that she said no so flat out. Like how close minded are you?????? I’m BAFFLED. and I consider myself a mental health professional as well who wants to get my masters in social work. And I already know that her behavior was so wrong in so many ways.",
          "created_utc": 1705707875.0
        }
      ]
    },
    {
      "id": "kitazp0",
      "author": "EsmeSalinger",
      "body": "If you loved her until today, maybe this was an enactment.  Something triggered her countertransference and she didn’t catch it?   Rupture and repair can be a useful way of getting closer, so I hope she earns your trust back here.",
      "created_utc": 1705795024.0,
      "score": 1,
      "context": [
        {
          "id": "kinynbu",
          "author": "chunkeymunkeyandrunt",
          "body": "It was technically in previous DSM editions too, it was just labeled differently … \n\nYou should report her honestly. A therapist straight up refusing to educate themselves on something their client has brought up (and is a LEGITIMATE EATING DISORDER IN THE DSM V) is frankly dangerous in my opinion. What else is she refusing to educate herself on for her clients??\n\nETA: also, what the fuck is this ‘I don’t believe in labels’ HOMIE THE DSM IS LITERALLY A COMPENDIUM OF ALL THE LABELS WE HAVE FOR DISORDERS AND MEDICAL CONDITIONS?!??",
          "created_utc": 1705707571.0
        },
        {
          "id": "kinzfvc",
          "author": "Normal_Article491",
          "body": "I really loved her until today and I can’t shake this horrible feeling now. It was so shocking that she said no so flat out. Like how close minded are you?????? I’m BAFFLED. and I consider myself a mental health professional as well who wants to get my masters in social work. And I already know that her behavior was so wrong in so many ways.",
          "created_utc": 1705707875.0
        }
      ]
    },
    {
      "id": "kioyy09",
      "author": "_tropicalismo",
      "body": "Is your therapist an older lady? It sounds like she doesn't think the internet can be a reliable source of information. She probably thinks ARFID is some new social media pop psychology trend or something. If she is unwilling to further look into your potential diagnosis, then it's not worth exploring your needs with her any further.",
      "created_utc": 1705722540.0,
      "score": 3,
      "context": [
        {
          "id": "kinynbu",
          "author": "chunkeymunkeyandrunt",
          "body": "It was technically in previous DSM editions too, it was just labeled differently … \n\nYou should report her honestly. A therapist straight up refusing to educate themselves on something their client has brought up (and is a LEGITIMATE EATING DISORDER IN THE DSM V) is frankly dangerous in my opinion. What else is she refusing to educate herself on for her clients??\n\nETA: also, what the fuck is this ‘I don’t believe in labels’ HOMIE THE DSM IS LITERALLY A COMPENDIUM OF ALL THE LABELS WE HAVE FOR DISORDERS AND MEDICAL CONDITIONS?!??",
          "created_utc": 1705707571.0
        },
        {
          "id": "kioipom",
          "author": "Normal_Article491",
          "body": "What gets me is she even said “you know I believe that science is always changing and growing” but also told me that it’s concerning that I’m finding this diagnosis on the internet. Like didn’t even consider that it could be real???? What the fuck…. I’m so insulted because up until this point she has treated me with respect and knows that I’m a very self aware person with a psych degree who loves to research. Like I’ve read real medical articles on ARFID not just social media posts. \nI’m not saying she needed to believe me, but at least look into it to understand where I’m coming from.",
          "created_utc": 1705715552.0
        }
      ]
    },
    {
      "id": "kiqmjhz",
      "author": "rosallia",
      "body": "Does she have a phd at all",
      "created_utc": 1705759461.0,
      "score": 1,
      "context": [
        {
          "id": "kinynbu",
          "author": "chunkeymunkeyandrunt",
          "body": "It was technically in previous DSM editions too, it was just labeled differently … \n\nYou should report her honestly. A therapist straight up refusing to educate themselves on something their client has brought up (and is a LEGITIMATE EATING DISORDER IN THE DSM V) is frankly dangerous in my opinion. What else is she refusing to educate herself on for her clients??\n\nETA: also, what the fuck is this ‘I don’t believe in labels’ HOMIE THE DSM IS LITERALLY A COMPENDIUM OF ALL THE LABELS WE HAVE FOR DISORDERS AND MEDICAL CONDITIONS?!??",
          "created_utc": 1705707571.0
        },
        {
          "id": "kioipom",
          "author": "Normal_Article491",
          "body": "What gets me is she even said “you know I believe that science is always changing and growing” but also told me that it’s concerning that I’m finding this diagnosis on the internet. Like didn’t even consider that it could be real???? What the fuck…. I’m so insulted because up until this point she has treated me with respect and knows that I’m a very self aware person with a psych degree who loves to research. Like I’ve read real medical articles on ARFID not just social media posts. \nI’m not saying she needed to believe me, but at least look into it to understand where I’m coming from.",
          "created_utc": 1705715552.0
        }
      ]
    },
    {
      "id": "kiztr57",
      "author": "Traditional_Land_751",
      "body": "It sounds like she has a negative bias towards \"the Internet\", she should examine that a little closer.",
      "created_utc": 1705896023.0,
      "score": 1,
      "context": [
        {
          "id": "kinynbu",
          "author": "chunkeymunkeyandrunt",
          "body": "It was technically in previous DSM editions too, it was just labeled differently … \n\nYou should report her honestly. A therapist straight up refusing to educate themselves on something their client has brought up (and is a LEGITIMATE EATING DISORDER IN THE DSM V) is frankly dangerous in my opinion. What else is she refusing to educate herself on for her clients??\n\nETA: also, what the fuck is this ‘I don’t believe in labels’ HOMIE THE DSM IS LITERALLY A COMPENDIUM OF ALL THE LABELS WE HAVE FOR DISORDERS AND MEDICAL CONDITIONS?!??",
          "created_utc": 1705707571.0
        },
        {
          "id": "kioipom",
          "author": "Normal_Article491",
          "body": "What gets me is she even said “you know I believe that science is always changing and growing” but also told me that it’s concerning that I’m finding this diagnosis on the internet. Like didn’t even consider that it could be real???? What the fuck…. I’m so insulted because up until this point she has treated me with respect and knows that I’m a very self aware person with a psych degree who loves to research. Like I’ve read real medical articles on ARFID not just social media posts. \nI’m not saying she needed to believe me, but at least look into it to understand where I’m coming from.",
          "created_utc": 1705715552.0
        }
      ]
    },
    {
      "id": "kio0mke",
      "author": "Agile-Artichoke9463",
      "body": "Trust me I know. I’ve seen at least 4 different therapists that basically shut me down saying what I have isn’t a disorder so I felt so invalidated. And one of them was still a psychology student getting her doctorate, imagine that. Don’t give up though! \n\nAlso i learned a few tricks when it came to my anxiety cause it always got pretty bad when food was involved and crowds.\n1- focus on something other than food. Like watch a show or movie and do the exercises I mentioned \n2- take deep breaths in and out while counting down from 10 and repeat as many times as necessary\n3- there’s a name for it but for the life of me I can’t recall the actual name but same concept as 2, but squeeze your hands into fists as tight as possible or curl your toes so people don’t see what you’re doing and question you and slowly release and relax your body while counting down and breathing out\n4- lastly, if it’s really that bad, take a quick walk and come back. My anxiety was through the roof if it was a gathering and I always felt ashamed and embarrassed. Taking a quick walk or removing myself from the situation often times helped me but 3 I find was the most effective for me",
      "created_utc": 1705708337.0,
      "score": 3,
      "context": [
        {
          "id": "kinym76",
          "author": "Agile-Artichoke9463",
          "body": "It is in the dsm5. Where the problem comes in is because it’s still such a new disorder even though it’s been added to it in the last decade or so, that a lot of doctors and professionals don’t yet acknowledge it or know about it. There’s so many variables when it comes to ARFID that a lot of them just don’t know how to treat it or handle it. Honestly the only thing that’s helped me is exposure therapy, and I’ve tried every therapy related to eating disorders, and ask yourself questions of the 4 senses. So what does it look like? What does it smell like? What does it feel like? And finally what it does it taste like? Describe the food as neutral as possible, and keep doing that exercise until you don’t need to do it anymore and keep exposing yourself to it as often as possible. I got super lucky with my therapist and my nutritionist cause trying to find help in Quebec was damn near impossible. They either didn’t know about it, or couldn’t help me cause I’m an adult. It’s frustrating. \n\nBut stay positive, try the exposure method, you got this!",
          "created_utc": 1705707558.0
        },
        {
          "id": "kinz8kx",
          "author": "Normal_Article491",
          "body": "I appreciate you so so much! This is very helpful!!!! \n\nI wish my therapist didn’t shut me down so quickly. She said we could try different things to help my anxiety around eating but basically she won’t call it what I’m calling it and that she doesn’t believe I have an eating disorder because I don’t have body image issues. But how can I continue to see her when she didn’t even believe it was real? That makes me feel horrible. And she’s only 30 so she has only ever used the dsm5 so she should know about it.",
          "created_utc": 1705707797.0
        }
      ]
    },
    {
      "id": "kiozpyi",
      "author": "_tropicalismo",
      "body": "It's so frustrating how so many healthcare professionals equate the term \"eating disorder\" with \"person wants to be skinnier so they intentionally starve themselves\". Bigorexia and ARFID beg to differ",
      "created_utc": 1705722895.0,
      "score": 3,
      "context": [
        {
          "id": "kinym76",
          "author": "Agile-Artichoke9463",
          "body": "It is in the dsm5. Where the problem comes in is because it’s still such a new disorder even though it’s been added to it in the last decade or so, that a lot of doctors and professionals don’t yet acknowledge it or know about it. There’s so many variables when it comes to ARFID that a lot of them just don’t know how to treat it or handle it. Honestly the only thing that’s helped me is exposure therapy, and I’ve tried every therapy related to eating disorders, and ask yourself questions of the 4 senses. So what does it look like? What does it smell like? What does it feel like? And finally what it does it taste like? Describe the food as neutral as possible, and keep doing that exercise until you don’t need to do it anymore and keep exposing yourself to it as often as possible. I got super lucky with my therapist and my nutritionist cause trying to find help in Quebec was damn near impossible. They either didn’t know about it, or couldn’t help me cause I’m an adult. It’s frustrating. \n\nBut stay positive, try the exposure method, you got this!",
          "created_utc": 1705707558.0
        },
        {
          "id": "kinz8kx",
          "author": "Normal_Article491",
          "body": "I appreciate you so so much! This is very helpful!!!! \n\nI wish my therapist didn’t shut me down so quickly. She said we could try different things to help my anxiety around eating but basically she won’t call it what I’m calling it and that she doesn’t believe I have an eating disorder because I don’t have body image issues. But how can I continue to see her when she didn’t even believe it was real? That makes me feel horrible. And she’s only 30 so she has only ever used the dsm5 so she should know about it.",
          "created_utc": 1705707797.0
        }
      ]
    },
    {
      "id": "kiodg5a",
      "author": "socraticalastor",
      "body": "That is absolutely not okay, and you are not crazy. That is something that NOBODY should say to you, especially not a therapist or anyone in any position of medical or mental power over you.",
      "created_utc": 1705713436.0,
      "score": 6,
      "context": [
        {
          "id": "kio5b1p",
          "author": "socraticalastor",
          "body": "Not a psychologist, but upper-year clinical psychology student here. Psychologists are bound to “evidence-based practice.” This means that not only are they required to practice therapies based on statistical evidence as to the efficacy, but they are also duty-bound to stay up to date on research and clinical information, including diagnoses within the DSM-5. I would encourage you to not only find a different therapist but let your state or country’s licensing organization know about her conduct, as that is grossly negligible and could cause serious harm to you or another patient, ESPECIALLY regarding eating disorders, whether weight-based or not. If you decide to report her and would like help finding out who to contact, feel free to reach out. I’m very sorry this happened to you.",
          "created_utc": 1705710174.0
        },
        {
          "id": "kioaggm",
          "author": "Normal_Article491",
          "body": "I feel crazy because she said “you’re fine, you eat.” And that was weird to me because when has she ever seen me eat? Why would she say that? I felt like I had to convince her that I wasn’t eating enough and I just can’t stop crying. And my session was 8 hours ago.",
          "created_utc": 1705712231.0
        }
      ]
    },
    {
      "id": "kio1shs",
      "author": "ScobJob",
      "body": "I do wish you well with this journey and hope you find peace. I’m going to ever so slightly push and ask you why you need her to validate what you are feeling? I know this may feel like a very unhelpful question, and possibly even cruel depending on how upset you are, but how would you benefit if she validated what you said? What would be different?\n\nIf it’s that you wouldn’t feel sad, then this could be a concern. As much as it sucks, therapists are there to teach us to self-soothe and build habits of resiliency to be able to handle difficult times like this. Of course, this can only be done once you trust your therapist has good intentions, but after the rapport is built it is time for the hard work which does involve uncomfortable feelings. Emotional regulation is a muscle you need to develop to learn to react in ways where you don’t perceive danger from someone’s slight. I do understand that this may feel like a betrayal from your therapist. \n\nI hope you are eventually empowered to realize that you are in the driver’s seat here. How you go about your relationship with your therapist, to overcoming food aversions, to self-soothing in difficult times. CBT (more thought change based) and DBT (more recognizing physical symptoms of distress and physically enacting change) practices can be wonderful here. \n\nAs much as it is difficult, the hard work is done in the dark, not the light. Trees don’t grow tall and strong without wind, they would fall over without the pressure. This isn’t the bullshit toxic positivity where you need emotionally difficult experiences to be healthy, but to recognize that how you react to situations determines how you continue on in life.",
      "created_utc": 1705708787.0,
      "score": 1,
      "context": [
        {
          "id": "kinywpl",
          "author": "ScobJob",
          "body": "It’s not helpful for you to feel invalidated, so it definitely would have been better for her to say something along the lines of, “I am hearing this is important to you that I know about ARFID. I’m curious, if everything went your way, what would the next steps be for our discussions?”\n\nShe should have accessed why this is important to you: do you want diagnosis validation and/or ARFID-based treatment help? Ultimately, gently, I do believe she is correct that the label is not as important unless it changes how she would treat you. She is not a dietician, so she can only help you with your feelings toward food. Many of these feelings are rooted in anxiety, so using anti-anxiety techniques is the answer here. \n\nDiagnoses can certainly feel validating and the help one can achieve by sharing in experiences with people with similar issues is beautiful. However, gently, I think some soul-searching here is valuable. Ask yourself what you would have wanted to go differently, make a plan, and advocate for yourself next session. [Here is a TherapistAid PDF on Assertive Communication that may be helpful for planning this out.](https://www.therapistaid.com/worksheets/assertive-communication)\n\nUltimately, this is my opinion, and we don’t need to agree! What matters is that you feel that you have some control and are respected by your therapist! \n\nAdditionally, I have found radical acceptance practices to be massively helpful in times of stress and in situations when I can’t make changes immediately, but need to soothe myself. [Here is a PDF worksheet on that if you are interested.](https://mhawv.org/wp-content/uploads/2021/04/Worksheet-Practicing-Radical-Acceptance.pdf)\n\nLastly, you got this! This may be a bit of a setback, but I believe you can advocate for the changes you need!",
          "created_utc": 1705707671.0
        },
        {
          "id": "kinzxh7",
          "author": "Normal_Article491",
          "body": "Part of me saw what she was saying that she can still help me but doesn’t need to call it what I call it, but it still felt wrong for her to invalidate me. It felt like she was insulted that I told her I was looking up eating disorder specialists. She said if I didn’t think we could solve the problem here, then fine…. \nWhich felt very petty to me…. Idk it just made me feel icky and I haven’t stopped crying since I left her office 6 hours ago",
          "created_utc": 1705708065.0
        }
      ]
    },
    {
      "id": "kiob3jg",
      "author": "mercurys-daughter",
      "body": "You could try to give her a second chance and directly confront her and see how that goes. If she admits fault and changes, then ok. If she doubles down, report",
      "created_utc": 1705712491.0,
      "score": 4,
      "context": [
        {
          "id": "kio0si5",
          "author": "mercurys-daughter",
          "body": "Report her",
          "created_utc": 1705708401.0
        },
        {
          "id": "kioakpm",
          "author": "Normal_Article491",
          "body": "Should I really? I feel bad 😭 but also, I FEEL BAD! Like I feel horrible after this session and that feels wrong",
          "created_utc": 1705712279.0
        }
      ]
    },
    {
      "id": "kiomr0o",
      "author": "StellaEtoile1",
      "body": "What a strange situation! I hope you just straight up ask her why she’s digging in on this. It seems really unprofessional to not understand how damaging her ignorance is. You deserve a therapist who is more informed and empathetic. Please let us know how it works out!",
      "created_utc": 1705717218.0,
      "score": 3,
      "context": [
        {
          "id": "kio26bm",
          "author": "StellaEtoile1",
          "body": "I’m so sorry she was so invalidating! Not to mention plain wrong!\nWould it be possible for you to let her know before your next session that you would like to spend a few sessions talking about?\nYou don’t even have to buy a copy it’s online for free. If you let her know in advance that you would like to have say in what you talk about and start with the fact that ARFID is a medical diagnosis and you would like it to be acknowledged as such and that you would like to control the conversation about it as opposed to being invalidated maybe she can be prepared and you guys can have a good conversation about it. If she refuses, maybe tell her that you would like to change therapists!\nBest of luck and keep us posted!",
          "created_utc": 1705708938.0
        },
        {
          "id": "kio9yoe",
          "author": "Normal_Article491",
          "body": "She straight up told me we can work to fix the problem but she won’t call it what I want her to and that the problem is just anxiety. Idk it just felt so weird and I feel so icky and I’m not totally sure how to go about this. Thankfully I have 2 weeks before next session.",
          "created_utc": 1705712032.0
        }
      ]
    },
    {
      "id": "kir2g86",
      "author": "Desert_Fairy",
      "body": "Great job!",
      "created_utc": 1705765945.0,
      "score": 1,
      "context": [
        {
          "id": "kipfrou",
          "author": "Desert_Fairy",
          "body": "I caution you on telling her to open her own book. If her copy is more than 10 years old, it may be under a different name. \n\nOtherwise, your therapist just told you how badly she did in school. Because she obviously didn’t keep up with the whole scientific method thing.",
          "created_utc": 1705731403.0
        },
        {
          "id": "kipokp3",
          "author": "Normal_Article491",
          "body": "I just sent her an email that probably wasn’t the nicest but it also wasn’t derogatory in anyway. Just letting her know she’s wrong and to open up her dsm 5 and I sent several articles about the renaming and how it is not JUST anxiety but usually presents itself along with anxiety. Told her i hope she never makes anyone feel again the way she made me feel today",
          "created_utc": 1705737372.0
        }
      ]
    },
    {
      "id": "kj1og4m",
      "author": "wfpinky",
      "body": "I was in a situation last year where I found myself seriously debating reporting one of my doctors to the medical board (for something totally unrelated to ARFID) and it was honestly really stressful for me, which is why I said it’s a personal decision to make; it’s a weird mind fuck to even consider doing it I think. At least it was for me. I suggest googling something like “grounds for medical complaint to [state] psychiatric board”. I don’t know if criteria varies from state to state but that’s what I did when I was trying to figure out if I really even had legitimate grounds to file a complaint with the medical board, but researching it like that also helped me figure out the right way to word things in the event I chose to formally file. \n\nI’d have to do some research to figure out the correct terminology (which I’m happy to do if you’d like some help! feel free to dm me if so) but I feel like she definitely screwed up from a legal standpoint by basically saying “that disorder doesn’t exists” when it was quite literally in black and white in a book in the room with you when she said it. Maybe I’m wrong but that’s what kept popping up in my head as I read your post. Jesus, that sounds gaslighting as hell to me (which could just give you more fuel to add to your complaint IMO). On the bright side? It sounds like she’s made it very clear she is definitely NOT the therapist you should be working with. I know it sucks though when you feel like you’ve finally found one you “click” with and then they pull shit like this.",
      "created_utc": 1705935165.0,
      "score": 2,
      "context": [
        {
          "id": "kiww182",
          "author": "wfpinky",
          "body": "I’m sorry the person that you trusted to help you totally invalidated your completely reasonable concern/request. I am not a doctor or counselor in any way shape or form but I do see many of them due to my own mental and physical health issues. It is my understanding (in my state at least) mental health professionals are required by law to keep up with the latest DSM just like a school teacher or a nurse is required to complete a specific amount of continuing education courses throughout the year. The fact that your therapist was so quick to dismiss it by saying it doesn’t exist is…concerning. It would have been one thing had she said something like, “I am not well versed in ARFID, let me look into it” but that’s not what happened. I don’t expect my psychiatrist to know every single diagnosis listed in the DSM 5 off the top of his head but he has always been quick to humbly admit not being an expert on something in the moment and I respect him for it. If he doesn’t feel comfortable speaking on a particular diagnosis in the moment, for example ARFID, he makes a point to do serious research on it before my next session and then we discuss further. It’s a big reason why I trust him and he knows it. If it were me I’d be considering filing a complaint against your therapist with your state’s licensing board, but that’s a very personal decision that only you can make. All she had to do was a quick google search, hell she could have cracked open a recent copy of the DSM (which she should definitely have quick access to due to her profession). A complaint of this nature wouldn’t be enough for her to outright lose her license, but it may enough of a slap on the hand for her to realize she can’t be talking out of her ass like that.",
          "created_utc": 1705858192.0
        },
        {
          "id": "kj1l8b2",
          "author": "Normal_Article491",
          "body": "Hey, I really appreciate the time you took to write this! I have been debating back and forth on whether to report her. I’m not sure what exactly the basis for reporting her would be? Only because I’ve never had to do this before and when I got very upset during session she told me that I was just having a bad reaction to her disagreeing with me. So I didn’t feel like I had any basis to report her. But maybe she was gaslighting me? I really feel so stupid after that session.",
          "created_utc": 1705933904.0
        }
      ]
    },
    {
      "id": "kipovx9",
      "author": "Normal_Article491",
      "body": "I understand this, but it also feels like it’s just a personal preference on her part to not update herself on what current diagnosis are. According to her profession, she’s supposed to be up to date on those things and I’m supposed to be able to discuss these things with her. She literally told me I don’t have an eating disorder. Asked me why I was calling it that. Made me feel SOOOOOO STUPID. I resent her now. I don’t even want to ever look at her again tbh that’s how hurt I am",
      "created_utc": 1705737601.0,
      "score": 36,
      "context": [
        {
          "id": "kinu7io",
          "author": "underinfinitebluesky",
          "body": "It is in the DSM5. Any person in a position like doctor or therapist who is in charge of the wellbeing of others, and who refuses to stay up to date with current research and understandings in that field, can't be trusted with being in charge of anyone's health.",
          "created_utc": 1705705879.0
        },
        {
          "id": "kinv084",
          "author": "Normal_Article491",
          "body": "I’m so dissapointed.  I really really liked her and she was helping me a lot. But this just set me back and now I don’t think I should see her again. I don’t understand how she could just tell me “no” I won’t look into this further.",
          "created_utc": 1705706179.0
        },
        {
          "id": "kiphw3b",
          "author": "vi0l3t-crumbl3",
          "body": "Some therapists resist diagnosing. The best one I ever had was one. When you're someone who likes having a name for things it's frustrating (me). But if they are helping you, it's worth considering whether you can move past it. Finding a good therapist is hard!",
          "created_utc": 1705732756.0
        }
      ]
    },
    {
      "id": "kio1gqq",
      "author": "Normal_Article491",
      "body": "Hahaha I appreciate you. Thank you so much.",
      "created_utc": 1705708660.0,
      "score": 22,
      "context": [
        {
          "id": "kinykbn",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1705707537.0
        },
        {
          "id": "kinypik",
          "author": "Normal_Article491",
          "body": "Thank you. This is what I was planning on doing. I want to go back and show her and make her feel dumb because she made me feel so fucking stupid",
          "created_utc": 1705707593.0
        },
        {
          "id": "kinz1ok",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1705707724.0
        }
      ]
    },
    {
      "id": "kio8v0l",
      "author": "Normal_Article491",
      "body": "Her whole attitude toward the session was so weird to me. She seemed very arrogant today and I have no idea why. I’m genuinely so blown and I really spiraled during my session because I’ve had such a good relationship with her for the last 2 years. So when she just didn’t even want to do a quick search to understand what I was talking about, it really hurt and I can’t understand why. Like why not look it up so you know what I’m talking about? It just felt stubborn and weird. And why did she assume it wasn’t in her books? That was icky for sure.",
      "created_utc": 1705711594.0,
      "score": 16,
      "context": [
        {
          "id": "kinykbn",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1705707537.0
        },
        {
          "id": "kinypik",
          "author": "Normal_Article491",
          "body": "Thank you. This is what I was planning on doing. I want to go back and show her and make her feel dumb because she made me feel so fucking stupid",
          "created_utc": 1705707593.0
        },
        {
          "id": "kio6xlt",
          "author": "therealganjababe",
          "body": "Absolutely what I'd do. Fuck her for telling you that something that has such a huge effect on your life and psychology/well-being doesn't exist when it's clearly in the DMS-5. I would absolutely want to rub it in her face, and tell her to F off, and find a Dr who actually knows what they are talking about, and listens to their patients.\n\n\nI know that some therapists/Docs try to treat symptoms and not labels, because frankly there's a lot of comorbid issues with BP, and our experiences can vary. So it's not too strange to want to keep treating your symptoms, but to flat out deny this, and obviously refusing to even try looking it up because obvs 'they know best', is a tragedy and infuriating.",
          "created_utc": 1705710822.0
        }
      ]
    },
    {
      "id": "kipl3nk",
      "author": "Normal_Article491",
      "body": "I appreciate it, because this is exactly what I was thinking. After I was spiraling she asked me what I wanted to do about my eating after this? And I said, well I don’t know that’s why I wanted you to look into arfid to help me figure it out…. And I felt very attacked like I was expected to have a solution since I already had a diagnosis. But she’s only an lcsw so it’s not like she can diagnose me anyhow. I’m so confused by her rudeness. Don’t think I can trust her ever again. \nReally sucks building up that trust for two whole years just to be treated this way when I finally open up about something new.",
      "created_utc": 1705734928.0,
      "score": 7,
      "context": [
        {
          "id": "kinuj0g",
          "author": "vorarefilia",
          "body": "Guess there was no DSM-5 on that bookshelf...",
          "created_utc": 1705705999.0
        },
        {
          "id": "kinvaaj",
          "author": "Normal_Article491",
          "body": "There definitely was which is why I’m so confused….. I have a huge problem with self doubt so I’m wondering if I made it sound so new and uncommon that she just thought I found it online? Either way, it feels rude that she wouldn’t even be willing to look into it",
          "created_utc": 1705706284.0
        },
        {
          "id": "kiorky2",
          "author": "MarsupialPristine677",
          "body": "Even if you came off that way, she handled it really unkindly and that’s not on you at all 💜 It’s definitely rude of her not to like. Crack open the DSM-5 and see that it’s literally right there in the book. Jesus. Even if someone shows up to therapy with wild theories (which you did not) that is a STARTING PLACE for the therapist to help figure out what the hap is fuckening, yk? I’m really sorry you’ve had such a nasty experience. 💜",
          "created_utc": 1705719273.0
        }
      ]
    },
    {
      "id": "kio3lvs",
      "author": "Normal_Article491",
      "body": "Thank you so much, it really means a lot to me",
      "created_utc": 1705709502.0,
      "score": 9,
      "context": [
        {
          "id": "kinynbu",
          "author": "chunkeymunkeyandrunt",
          "body": "It was technically in previous DSM editions too, it was just labeled differently … \n\nYou should report her honestly. A therapist straight up refusing to educate themselves on something their client has brought up (and is a LEGITIMATE EATING DISORDER IN THE DSM V) is frankly dangerous in my opinion. What else is she refusing to educate herself on for her clients??\n\nETA: also, what the fuck is this ‘I don’t believe in labels’ HOMIE THE DSM IS LITERALLY A COMPENDIUM OF ALL THE LABELS WE HAVE FOR DISORDERS AND MEDICAL CONDITIONS?!??",
          "created_utc": 1705707571.0
        },
        {
          "id": "kinzfvc",
          "author": "Normal_Article491",
          "body": "I really loved her until today and I can’t shake this horrible feeling now. It was so shocking that she said no so flat out. Like how close minded are you?????? I’m BAFFLED. and I consider myself a mental health professional as well who wants to get my masters in social work. And I already know that her behavior was so wrong in so many ways.",
          "created_utc": 1705707875.0
        },
        {
          "id": "kio0qfa",
          "author": "chunkeymunkeyandrunt",
          "body": "I can absolutely understand why you’d be having some feelings! I’m appalled on your behalf and I don’t know this lady at all! \n\nI just want to reiterate that **you did nothing wrong** and she is entirely at fault here. It’s so easy to internalize it and worry that something you did made her react this way, but that is not the case!!",
          "created_utc": 1705708379.0
        }
      ]
    },
    {
      "id": "kippfho",
      "author": "Normal_Article491",
      "body": "She’s 30 years old, that’s the crazy thing.",
      "created_utc": 1705737988.0,
      "score": 2,
      "context": [
        {
          "id": "kinynbu",
          "author": "chunkeymunkeyandrunt",
          "body": "It was technically in previous DSM editions too, it was just labeled differently … \n\nYou should report her honestly. A therapist straight up refusing to educate themselves on something their client has brought up (and is a LEGITIMATE EATING DISORDER IN THE DSM V) is frankly dangerous in my opinion. What else is she refusing to educate herself on for her clients??\n\nETA: also, what the fuck is this ‘I don’t believe in labels’ HOMIE THE DSM IS LITERALLY A COMPENDIUM OF ALL THE LABELS WE HAVE FOR DISORDERS AND MEDICAL CONDITIONS?!??",
          "created_utc": 1705707571.0
        },
        {
          "id": "kioipom",
          "author": "Normal_Article491",
          "body": "What gets me is she even said “you know I believe that science is always changing and growing” but also told me that it’s concerning that I’m finding this diagnosis on the internet. Like didn’t even consider that it could be real???? What the fuck…. I’m so insulted because up until this point she has treated me with respect and knows that I’m a very self aware person with a psych degree who loves to research. Like I’ve read real medical articles on ARFID not just social media posts. \nI’m not saying she needed to believe me, but at least look into it to understand where I’m coming from.",
          "created_utc": 1705715552.0
        },
        {
          "id": "kioyy09",
          "author": "_tropicalismo",
          "body": "Is your therapist an older lady? It sounds like she doesn't think the internet can be a reliable source of information. She probably thinks ARFID is some new social media pop psychology trend or something. If she is unwilling to further look into your potential diagnosis, then it's not worth exploring your needs with her any further.",
          "created_utc": 1705722540.0
        }
      ]
    },
    {
      "id": "kiquloc",
      "author": "Normal_Article491",
      "body": "No lcsw",
      "created_utc": 1705762894.0,
      "score": 1,
      "context": [
        {
          "id": "kinynbu",
          "author": "chunkeymunkeyandrunt",
          "body": "It was technically in previous DSM editions too, it was just labeled differently … \n\nYou should report her honestly. A therapist straight up refusing to educate themselves on something their client has brought up (and is a LEGITIMATE EATING DISORDER IN THE DSM V) is frankly dangerous in my opinion. What else is she refusing to educate herself on for her clients??\n\nETA: also, what the fuck is this ‘I don’t believe in labels’ HOMIE THE DSM IS LITERALLY A COMPENDIUM OF ALL THE LABELS WE HAVE FOR DISORDERS AND MEDICAL CONDITIONS?!??",
          "created_utc": 1705707571.0
        },
        {
          "id": "kioipom",
          "author": "Normal_Article491",
          "body": "What gets me is she even said “you know I believe that science is always changing and growing” but also told me that it’s concerning that I’m finding this diagnosis on the internet. Like didn’t even consider that it could be real???? What the fuck…. I’m so insulted because up until this point she has treated me with respect and knows that I’m a very self aware person with a psych degree who loves to research. Like I’ve read real medical articles on ARFID not just social media posts. \nI’m not saying she needed to believe me, but at least look into it to understand where I’m coming from.",
          "created_utc": 1705715552.0
        },
        {
          "id": "kiqmjhz",
          "author": "rosallia",
          "body": "Does she have a phd at all",
          "created_utc": 1705759461.0
        }
      ]
    },
    {
      "id": "kipphwa",
      "author": "Normal_Article491",
      "body": "Yeah it honestly seemed like she had a really judgmental view on eating disorders despite telling me she wasn’t judging.",
      "created_utc": 1705738036.0,
      "score": 1,
      "context": [
        {
          "id": "kinym76",
          "author": "Agile-Artichoke9463",
          "body": "It is in the dsm5. Where the problem comes in is because it’s still such a new disorder even though it’s been added to it in the last decade or so, that a lot of doctors and professionals don’t yet acknowledge it or know about it. There’s so many variables when it comes to ARFID that a lot of them just don’t know how to treat it or handle it. Honestly the only thing that’s helped me is exposure therapy, and I’ve tried every therapy related to eating disorders, and ask yourself questions of the 4 senses. So what does it look like? What does it smell like? What does it feel like? And finally what it does it taste like? Describe the food as neutral as possible, and keep doing that exercise until you don’t need to do it anymore and keep exposing yourself to it as often as possible. I got super lucky with my therapist and my nutritionist cause trying to find help in Quebec was damn near impossible. They either didn’t know about it, or couldn’t help me cause I’m an adult. It’s frustrating. \n\nBut stay positive, try the exposure method, you got this!",
          "created_utc": 1705707558.0
        },
        {
          "id": "kinz8kx",
          "author": "Normal_Article491",
          "body": "I appreciate you so so much! This is very helpful!!!! \n\nI wish my therapist didn’t shut me down so quickly. She said we could try different things to help my anxiety around eating but basically she won’t call it what I’m calling it and that she doesn’t believe I have an eating disorder because I don’t have body image issues. But how can I continue to see her when she didn’t even believe it was real? That makes me feel horrible. And she’s only 30 so she has only ever used the dsm5 so she should know about it.",
          "created_utc": 1705707797.0
        },
        {
          "id": "kiozpyi",
          "author": "_tropicalismo",
          "body": "It's so frustrating how so many healthcare professionals equate the term \"eating disorder\" with \"person wants to be skinnier so they intentionally starve themselves\". Bigorexia and ARFID beg to differ",
          "created_utc": 1705722895.0
        }
      ]
    },
    {
      "id": "kio2njc",
      "author": "Normal_Article491",
      "body": "Because her not believing I have an eating disorder made me feel crazy. I don’t know how else to put it. I’m a very self aware person and I guess part of my reaction is I am shocked that she said no.\nI also wanted her to believe me because finding out about arfid helped me find a community which gave me hope. Why would she be against that for me? It just made me feel like we weren’t on the same page like we usually are.",
      "created_utc": 1705709126.0,
      "score": 4,
      "context": [
        {
          "id": "kinywpl",
          "author": "ScobJob",
          "body": "It’s not helpful for you to feel invalidated, so it definitely would have been better for her to say something along the lines of, “I am hearing this is important to you that I know about ARFID. I’m curious, if everything went your way, what would the next steps be for our discussions?”\n\nShe should have accessed why this is important to you: do you want diagnosis validation and/or ARFID-based treatment help? Ultimately, gently, I do believe she is correct that the label is not as important unless it changes how she would treat you. She is not a dietician, so she can only help you with your feelings toward food. Many of these feelings are rooted in anxiety, so using anti-anxiety techniques is the answer here. \n\nDiagnoses can certainly feel validating and the help one can achieve by sharing in experiences with people with similar issues is beautiful. However, gently, I think some soul-searching here is valuable. Ask yourself what you would have wanted to go differently, make a plan, and advocate for yourself next session. [Here is a TherapistAid PDF on Assertive Communication that may be helpful for planning this out.](https://www.therapistaid.com/worksheets/assertive-communication)\n\nUltimately, this is my opinion, and we don’t need to agree! What matters is that you feel that you have some control and are respected by your therapist! \n\nAdditionally, I have found radical acceptance practices to be massively helpful in times of stress and in situations when I can’t make changes immediately, but need to soothe myself. [Here is a PDF worksheet on that if you are interested.](https://mhawv.org/wp-content/uploads/2021/04/Worksheet-Practicing-Radical-Acceptance.pdf)\n\nLastly, you got this! This may be a bit of a setback, but I believe you can advocate for the changes you need!",
          "created_utc": 1705707671.0
        },
        {
          "id": "kinzxh7",
          "author": "Normal_Article491",
          "body": "Part of me saw what she was saying that she can still help me but doesn’t need to call it what I call it, but it still felt wrong for her to invalidate me. It felt like she was insulted that I told her I was looking up eating disorder specialists. She said if I didn’t think we could solve the problem here, then fine…. \nWhich felt very petty to me…. Idk it just made me feel icky and I haven’t stopped crying since I left her office 6 hours ago",
          "created_utc": 1705708065.0
        },
        {
          "id": "kio1shs",
          "author": "ScobJob",
          "body": "I do wish you well with this journey and hope you find peace. I’m going to ever so slightly push and ask you why you need her to validate what you are feeling? I know this may feel like a very unhelpful question, and possibly even cruel depending on how upset you are, but how would you benefit if she validated what you said? What would be different?\n\nIf it’s that you wouldn’t feel sad, then this could be a concern. As much as it sucks, therapists are there to teach us to self-soothe and build habits of resiliency to be able to handle difficult times like this. Of course, this can only be done once you trust your therapist has good intentions, but after the rapport is built it is time for the hard work which does involve uncomfortable feelings. Emotional regulation is a muscle you need to develop to learn to react in ways where you don’t perceive danger from someone’s slight. I do understand that this may feel like a betrayal from your therapist. \n\nI hope you are eventually empowered to realize that you are in the driver’s seat here. How you go about your relationship with your therapist, to overcoming food aversions, to self-soothing in difficult times. CBT (more thought change based) and DBT (more recognizing physical symptoms of distress and physically enacting change) practices can be wonderful here. \n\nAs much as it is difficult, the hard work is done in the dark, not the light. Trees don’t grow tall and strong without wind, they would fall over without the pressure. This isn’t the bullshit toxic positivity where you need emotionally difficult experiences to be healthy, but to recognize that how you react to situations determines how you continue on in life.",
          "created_utc": 1705708787.0
        }
      ]
    },
    {
      "id": "kiobxco",
      "author": "Normal_Article491",
      "body": "I’m sooooo bad at confrontation. My ass wants to just email her a picture of the dsm 5 entry 😭😂 I literally avoided eye contact for 30 mins after she told me she wouldn’t look into. I have no idea why I acted that way and I honestly feel too icky to even dig into it yet. I have an appt set for 2 weeks from today, not sure what I’ll say but I’ve found some research articles I think I am going to print out and bring with me at least",
      "created_utc": 1705712824.0,
      "score": 3,
      "context": [
        {
          "id": "kio0si5",
          "author": "mercurys-daughter",
          "body": "Report her",
          "created_utc": 1705708401.0
        },
        {
          "id": "kioakpm",
          "author": "Normal_Article491",
          "body": "Should I really? I feel bad 😭 but also, I FEEL BAD! Like I feel horrible after this session and that feels wrong",
          "created_utc": 1705712279.0
        },
        {
          "id": "kiob3jg",
          "author": "mercurys-daughter",
          "body": "You could try to give her a second chance and directly confront her and see how that goes. If she admits fault and changes, then ok. If she doubles down, report",
          "created_utc": 1705712491.0
        }
      ]
    },
    {
      "id": "kippmc4",
      "author": "Normal_Article491",
      "body": "I went ahead and sent her an email explaining how I felt when leaving and how I still feel this way 12 hours later. I attached some articles about ARFID and explained how it IS in the DSM 5. Will come back with an update when she replies! Probably won’t reply until Monday at least.",
      "created_utc": 1705738127.0,
      "score": 3,
      "context": [
        {
          "id": "kio26bm",
          "author": "StellaEtoile1",
          "body": "I’m so sorry she was so invalidating! Not to mention plain wrong!\nWould it be possible for you to let her know before your next session that you would like to spend a few sessions talking about?\nYou don’t even have to buy a copy it’s online for free. If you let her know in advance that you would like to have say in what you talk about and start with the fact that ARFID is a medical diagnosis and you would like it to be acknowledged as such and that you would like to control the conversation about it as opposed to being invalidated maybe she can be prepared and you guys can have a good conversation about it. If she refuses, maybe tell her that you would like to change therapists!\nBest of luck and keep us posted!",
          "created_utc": 1705708938.0
        },
        {
          "id": "kio9yoe",
          "author": "Normal_Article491",
          "body": "She straight up told me we can work to fix the problem but she won’t call it what I want her to and that the problem is just anxiety. Idk it just felt so weird and I feel so icky and I’m not totally sure how to go about this. Thankfully I have 2 weeks before next session.",
          "created_utc": 1705712032.0
        },
        {
          "id": "kiomr0o",
          "author": "StellaEtoile1",
          "body": "What a strange situation! I hope you just straight up ask her why she’s digging in on this. It seems really unprofessional to not understand how damaging her ignorance is. You deserve a therapist who is more informed and empathetic. Please let us know how it works out!",
          "created_utc": 1705717218.0
        }
      ]
    },
    {
      "id": "kiptf0n",
      "author": "vi0l3t-crumbl3",
      "body": "That's valid. You need someone you can trust.",
      "created_utc": 1705740947.0,
      "score": 14,
      "context": [
        {
          "id": "kinu7io",
          "author": "underinfinitebluesky",
          "body": "It is in the DSM5. Any person in a position like doctor or therapist who is in charge of the wellbeing of others, and who refuses to stay up to date with current research and understandings in that field, can't be trusted with being in charge of anyone's health.",
          "created_utc": 1705705879.0
        },
        {
          "id": "kinv084",
          "author": "Normal_Article491",
          "body": "I’m so dissapointed.  I really really liked her and she was helping me a lot. But this just set me back and now I don’t think I should see her again. I don’t understand how she could just tell me “no” I won’t look into this further.",
          "created_utc": 1705706179.0
        },
        {
          "id": "kiphw3b",
          "author": "vi0l3t-crumbl3",
          "body": "Some therapists resist diagnosing. The best one I ever had was one. When you're someone who likes having a name for things it's frustrating (me). But if they are helping you, it's worth considering whether you can move past it. Finding a good therapist is hard!",
          "created_utc": 1705732756.0
        },
        {
          "id": "kipovx9",
          "author": "Normal_Article491",
          "body": "I understand this, but it also feels like it’s just a personal preference on her part to not update herself on what current diagnosis are. According to her profession, she’s supposed to be up to date on those things and I’m supposed to be able to discuss these things with her. She literally told me I don’t have an eating disorder. Asked me why I was calling it that. Made me feel SOOOOOO STUPID. I resent her now. I don’t even want to ever look at her again tbh that’s how hurt I am",
          "created_utc": 1705737601.0
        }
      ]
    },
    {
      "id": "kioza57",
      "author": "_tropicalismo",
      "body": "If anything send her a picture of the page on the DSM with the actual ARFID diagnosis criteria, and add a citation so she can look it up herself. And definitely report her. Staying up to date with the modern literature in one's field is imperative, even more important for healthcare workers.",
      "created_utc": 1705722694.0,
      "score": 24,
      "context": [
        {
          "id": "kinykbn",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1705707537.0
        },
        {
          "id": "kinypik",
          "author": "Normal_Article491",
          "body": "Thank you. This is what I was planning on doing. I want to go back and show her and make her feel dumb because she made me feel so fucking stupid",
          "created_utc": 1705707593.0
        },
        {
          "id": "kinz1ok",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1705707724.0
        },
        {
          "id": "kio1gqq",
          "author": "Normal_Article491",
          "body": "Hahaha I appreciate you. Thank you so much.",
          "created_utc": 1705708660.0
        }
      ]
    },
    {
      "id": "kioav51",
      "author": "PetriMagyk",
      "body": "If she’s been good for two years, it might be worth having one more appointment and to ask if there was anything external going on during that session; maybe she was having a bad day? Doesn’t excuse it, but it’s worth bringing up so she knows that her work was inconsistent, and hopefully be able to take that into consideration and do better, if not with you then with other clients. Having a “debrief” on what went wrong with that session might clear things up or at least help transitioning to a different provider. \n\nRegardless, that fucking sucks, you deserve better, and addressing it isn’t your responsibility if you don’t want to.",
      "created_utc": 1705712396.0,
      "score": 16,
      "context": [
        {
          "id": "kinykbn",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1705707537.0
        },
        {
          "id": "kinypik",
          "author": "Normal_Article491",
          "body": "Thank you. This is what I was planning on doing. I want to go back and show her and make her feel dumb because she made me feel so fucking stupid",
          "created_utc": 1705707593.0
        },
        {
          "id": "kio6xlt",
          "author": "therealganjababe",
          "body": "Absolutely what I'd do. Fuck her for telling you that something that has such a huge effect on your life and psychology/well-being doesn't exist when it's clearly in the DMS-5. I would absolutely want to rub it in her face, and tell her to F off, and find a Dr who actually knows what they are talking about, and listens to their patients.\n\n\nI know that some therapists/Docs try to treat symptoms and not labels, because frankly there's a lot of comorbid issues with BP, and our experiences can vary. So it's not too strange to want to keep treating your symptoms, but to flat out deny this, and obviously refusing to even try looking it up because obvs 'they know best', is a tragedy and infuriating.",
          "created_utc": 1705710822.0
        },
        {
          "id": "kio8v0l",
          "author": "Normal_Article491",
          "body": "Her whole attitude toward the session was so weird to me. She seemed very arrogant today and I have no idea why. I’m genuinely so blown and I really spiraled during my session because I’ve had such a good relationship with her for the last 2 years. So when she just didn’t even want to do a quick search to understand what I was talking about, it really hurt and I can’t understand why. Like why not look it up so you know what I’m talking about? It just felt stubborn and weird. And why did she assume it wasn’t in her books? That was icky for sure.",
          "created_utc": 1705711594.0
        }
      ]
    },
    {
      "id": "kitkmo4",
      "author": "drosekelley",
      "body": "LCSWs can diagnose.",
      "created_utc": 1705798708.0,
      "score": 1,
      "context": [
        {
          "id": "kinuj0g",
          "author": "vorarefilia",
          "body": "Guess there was no DSM-5 on that bookshelf...",
          "created_utc": 1705705999.0
        },
        {
          "id": "kinvaaj",
          "author": "Normal_Article491",
          "body": "There definitely was which is why I’m so confused….. I have a huge problem with self doubt so I’m wondering if I made it sound so new and uncommon that she just thought I found it online? Either way, it feels rude that she wouldn’t even be willing to look into it",
          "created_utc": 1705706284.0
        },
        {
          "id": "kiorky2",
          "author": "MarsupialPristine677",
          "body": "Even if you came off that way, she handled it really unkindly and that’s not on you at all 💜 It’s definitely rude of her not to like. Crack open the DSM-5 and see that it’s literally right there in the book. Jesus. Even if someone shows up to therapy with wild theories (which you did not) that is a STARTING PLACE for the therapist to help figure out what the hap is fuckening, yk? I’m really sorry you’ve had such a nasty experience. 💜",
          "created_utc": 1705719273.0
        },
        {
          "id": "kipl3nk",
          "author": "Normal_Article491",
          "body": "I appreciate it, because this is exactly what I was thinking. After I was spiraling she asked me what I wanted to do about my eating after this? And I said, well I don’t know that’s why I wanted you to look into arfid to help me figure it out…. And I felt very attacked like I was expected to have a solution since I already had a diagnosis. But she’s only an lcsw so it’s not like she can diagnose me anyhow. I’m so confused by her rudeness. Don’t think I can trust her ever again. \nReally sucks building up that trust for two whole years just to be treated this way when I finally open up about something new.",
          "created_utc": 1705734928.0
        }
      ]
    },
    {
      "id": "kiqumjs",
      "author": "Normal_Article491",
      "body": "Just a masters in social work",
      "created_utc": 1705762904.0,
      "score": 1,
      "context": [
        {
          "id": "kinynbu",
          "author": "chunkeymunkeyandrunt",
          "body": "It was technically in previous DSM editions too, it was just labeled differently … \n\nYou should report her honestly. A therapist straight up refusing to educate themselves on something their client has brought up (and is a LEGITIMATE EATING DISORDER IN THE DSM V) is frankly dangerous in my opinion. What else is she refusing to educate herself on for her clients??\n\nETA: also, what the fuck is this ‘I don’t believe in labels’ HOMIE THE DSM IS LITERALLY A COMPENDIUM OF ALL THE LABELS WE HAVE FOR DISORDERS AND MEDICAL CONDITIONS?!??",
          "created_utc": 1705707571.0
        },
        {
          "id": "kioipom",
          "author": "Normal_Article491",
          "body": "What gets me is she even said “you know I believe that science is always changing and growing” but also told me that it’s concerning that I’m finding this diagnosis on the internet. Like didn’t even consider that it could be real???? What the fuck…. I’m so insulted because up until this point she has treated me with respect and knows that I’m a very self aware person with a psych degree who loves to research. Like I’ve read real medical articles on ARFID not just social media posts. \nI’m not saying she needed to believe me, but at least look into it to understand where I’m coming from.",
          "created_utc": 1705715552.0
        },
        {
          "id": "kiqmjhz",
          "author": "rosallia",
          "body": "Does she have a phd at all",
          "created_utc": 1705759461.0
        },
        {
          "id": "kiquloc",
          "author": "Normal_Article491",
          "body": "No lcsw",
          "created_utc": 1705762894.0
        }
      ]
    },
    {
      "id": "kioc6vw",
      "author": "mercurys-daughter",
      "body": "Emailing could be a great idea actually, and it gives you a paper trail in case you do need to report",
      "created_utc": 1705712932.0,
      "score": 7,
      "context": [
        {
          "id": "kio0si5",
          "author": "mercurys-daughter",
          "body": "Report her",
          "created_utc": 1705708401.0
        },
        {
          "id": "kioakpm",
          "author": "Normal_Article491",
          "body": "Should I really? I feel bad 😭 but also, I FEEL BAD! Like I feel horrible after this session and that feels wrong",
          "created_utc": 1705712279.0
        },
        {
          "id": "kiob3jg",
          "author": "mercurys-daughter",
          "body": "You could try to give her a second chance and directly confront her and see how that goes. If she admits fault and changes, then ok. If she doubles down, report",
          "created_utc": 1705712491.0
        },
        {
          "id": "kiobxco",
          "author": "Normal_Article491",
          "body": "I’m sooooo bad at confrontation. My ass wants to just email her a picture of the dsm 5 entry 😭😂 I literally avoided eye contact for 30 mins after she told me she wouldn’t look into. I have no idea why I acted that way and I honestly feel too icky to even dig into it yet. I have an appt set for 2 weeks from today, not sure what I’ll say but I’ve found some research articles I think I am going to print out and bring with me at least",
          "created_utc": 1705712824.0
        }
      ]
    },
    {
      "id": "kir5gsr",
      "author": "StellaEtoile1",
      "body": "Congratulations! After all, it’s so important to have an open, honest relationship with our therapists.",
      "created_utc": 1705767061.0,
      "score": 1,
      "context": [
        {
          "id": "kio26bm",
          "author": "StellaEtoile1",
          "body": "I’m so sorry she was so invalidating! Not to mention plain wrong!\nWould it be possible for you to let her know before your next session that you would like to spend a few sessions talking about?\nYou don’t even have to buy a copy it’s online for free. If you let her know in advance that you would like to have say in what you talk about and start with the fact that ARFID is a medical diagnosis and you would like it to be acknowledged as such and that you would like to control the conversation about it as opposed to being invalidated maybe she can be prepared and you guys can have a good conversation about it. If she refuses, maybe tell her that you would like to change therapists!\nBest of luck and keep us posted!",
          "created_utc": 1705708938.0
        },
        {
          "id": "kio9yoe",
          "author": "Normal_Article491",
          "body": "She straight up told me we can work to fix the problem but she won’t call it what I want her to and that the problem is just anxiety. Idk it just felt so weird and I feel so icky and I’m not totally sure how to go about this. Thankfully I have 2 weeks before next session.",
          "created_utc": 1705712032.0
        },
        {
          "id": "kiomr0o",
          "author": "StellaEtoile1",
          "body": "What a strange situation! I hope you just straight up ask her why she’s digging in on this. It seems really unprofessional to not understand how damaging her ignorance is. You deserve a therapist who is more informed and empathetic. Please let us know how it works out!",
          "created_utc": 1705717218.0
        },
        {
          "id": "kippmc4",
          "author": "Normal_Article491",
          "body": "I went ahead and sent her an email explaining how I felt when leaving and how I still feel this way 12 hours later. I attached some articles about ARFID and explained how it IS in the DSM 5. Will come back with an update when she replies! Probably won’t reply until Monday at least.",
          "created_utc": 1705738127.0
        }
      ]
    },
    {
      "id": "kipqs0b",
      "author": "Normal_Article491",
      "body": "I emailed her with several articles and a picture of the dsm-5 criteria for arfid. I hope she responds well, but I’m not expecting anything after how horrible the session went today. It felt as though she had something against eating disorders and just didn’t believe me. I feel so icky.",
      "created_utc": 1705738982.0,
      "score": 12,
      "context": [
        {
          "id": "kinykbn",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1705707537.0
        },
        {
          "id": "kinypik",
          "author": "Normal_Article491",
          "body": "Thank you. This is what I was planning on doing. I want to go back and show her and make her feel dumb because she made me feel so fucking stupid",
          "created_utc": 1705707593.0
        },
        {
          "id": "kinz1ok",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1705707724.0
        },
        {
          "id": "kio1gqq",
          "author": "Normal_Article491",
          "body": "Hahaha I appreciate you. Thank you so much.",
          "created_utc": 1705708660.0
        },
        {
          "id": "kioza57",
          "author": "_tropicalismo",
          "body": "If anything send her a picture of the page on the DSM with the actual ARFID diagnosis criteria, and add a citation so she can look it up herself. And definitely report her. Staying up to date with the modern literature in one's field is imperative, even more important for healthcare workers.",
          "created_utc": 1705722694.0
        }
      ]
    },
    {
      "id": "kip85ka",
      "author": "EwDavid999",
      "body": "Someone else who is in school said that it's even a legal requirement for her to stay up to date in her position. So you're 100% on this. Op def needs to report her.",
      "created_utc": 1705727067.0,
      "score": 5,
      "context": [
        {
          "id": "kinykbn",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1705707537.0
        },
        {
          "id": "kinypik",
          "author": "Normal_Article491",
          "body": "Thank you. This is what I was planning on doing. I want to go back and show her and make her feel dumb because she made me feel so fucking stupid",
          "created_utc": 1705707593.0
        },
        {
          "id": "kinz1ok",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1705707724.0
        },
        {
          "id": "kio1gqq",
          "author": "Normal_Article491",
          "body": "Hahaha I appreciate you. Thank you so much.",
          "created_utc": 1705708660.0
        },
        {
          "id": "kioza57",
          "author": "_tropicalismo",
          "body": "If anything send her a picture of the page on the DSM with the actual ARFID diagnosis criteria, and add a citation so she can look it up herself. And definitely report her. Staying up to date with the modern literature in one's field is imperative, even more important for healthcare workers.",
          "created_utc": 1705722694.0
        }
      ]
    },
    {
      "id": "kip5avf",
      "author": "drosekelley",
      "body": "Therapist here (my kiddo has ARFID), and I agree with this comment. It could be beneficial for both you and your therapist if you communicate how her behavior felt to you. Beneficial for you in that you’re advocating for yourself and being confident in your own truth, and not immediately giving up on a 2 year relationship. Beneficial for her in that she might grow as a therapist by hearing your experience. But I also agree that it’s not your obligation in any way to do that for her. \n\nFWIW, I had never heard of ARFID until my daughter was diagnosed. The diagnosis is only 10 years old. But if a client had brought it up to me, I would have immediately grabbed my DSM and then would educate myself on it. I’m sorry your therapist acted like she knew better than you did about your own experience.",
      "created_utc": 1705725602.0,
      "score": 12,
      "context": [
        {
          "id": "kinykbn",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1705707537.0
        },
        {
          "id": "kinypik",
          "author": "Normal_Article491",
          "body": "Thank you. This is what I was planning on doing. I want to go back and show her and make her feel dumb because she made me feel so fucking stupid",
          "created_utc": 1705707593.0
        },
        {
          "id": "kio6xlt",
          "author": "therealganjababe",
          "body": "Absolutely what I'd do. Fuck her for telling you that something that has such a huge effect on your life and psychology/well-being doesn't exist when it's clearly in the DMS-5. I would absolutely want to rub it in her face, and tell her to F off, and find a Dr who actually knows what they are talking about, and listens to their patients.\n\n\nI know that some therapists/Docs try to treat symptoms and not labels, because frankly there's a lot of comorbid issues with BP, and our experiences can vary. So it's not too strange to want to keep treating your symptoms, but to flat out deny this, and obviously refusing to even try looking it up because obvs 'they know best', is a tragedy and infuriating.",
          "created_utc": 1705710822.0
        },
        {
          "id": "kio8v0l",
          "author": "Normal_Article491",
          "body": "Her whole attitude toward the session was so weird to me. She seemed very arrogant today and I have no idea why. I’m genuinely so blown and I really spiraled during my session because I’ve had such a good relationship with her for the last 2 years. So when she just didn’t even want to do a quick search to understand what I was talking about, it really hurt and I can’t understand why. Like why not look it up so you know what I’m talking about? It just felt stubborn and weird. And why did she assume it wasn’t in her books? That was icky for sure.",
          "created_utc": 1705711594.0
        },
        {
          "id": "kioav51",
          "author": "PetriMagyk",
          "body": "If she’s been good for two years, it might be worth having one more appointment and to ask if there was anything external going on during that session; maybe she was having a bad day? Doesn’t excuse it, but it’s worth bringing up so she knows that her work was inconsistent, and hopefully be able to take that into consideration and do better, if not with you then with other clients. Having a “debrief” on what went wrong with that session might clear things up or at least help transitioning to a different provider. \n\nRegardless, that fucking sucks, you deserve better, and addressing it isn’t your responsibility if you don’t want to.",
          "created_utc": 1705712396.0
        }
      ]
    },
    {
      "id": "kitnjtf",
      "author": "Normal_Article491",
      "body": "I actually realized this after I did more research, whoops. Thanks for the correction !",
      "created_utc": 1705799867.0,
      "score": 1,
      "context": [
        {
          "id": "kinuj0g",
          "author": "vorarefilia",
          "body": "Guess there was no DSM-5 on that bookshelf...",
          "created_utc": 1705705999.0
        },
        {
          "id": "kinvaaj",
          "author": "Normal_Article491",
          "body": "There definitely was which is why I’m so confused….. I have a huge problem with self doubt so I’m wondering if I made it sound so new and uncommon that she just thought I found it online? Either way, it feels rude that she wouldn’t even be willing to look into it",
          "created_utc": 1705706284.0
        },
        {
          "id": "kiorky2",
          "author": "MarsupialPristine677",
          "body": "Even if you came off that way, she handled it really unkindly and that’s not on you at all 💜 It’s definitely rude of her not to like. Crack open the DSM-5 and see that it’s literally right there in the book. Jesus. Even if someone shows up to therapy with wild theories (which you did not) that is a STARTING PLACE for the therapist to help figure out what the hap is fuckening, yk? I’m really sorry you’ve had such a nasty experience. 💜",
          "created_utc": 1705719273.0
        },
        {
          "id": "kipl3nk",
          "author": "Normal_Article491",
          "body": "I appreciate it, because this is exactly what I was thinking. After I was spiraling she asked me what I wanted to do about my eating after this? And I said, well I don’t know that’s why I wanted you to look into arfid to help me figure it out…. And I felt very attacked like I was expected to have a solution since I already had a diagnosis. But she’s only an lcsw so it’s not like she can diagnose me anyhow. I’m so confused by her rudeness. Don’t think I can trust her ever again. \nReally sucks building up that trust for two whole years just to be treated this way when I finally open up about something new.",
          "created_utc": 1705734928.0
        },
        {
          "id": "kitkmo4",
          "author": "drosekelley",
          "body": "LCSWs can diagnose.",
          "created_utc": 1705798708.0
        }
      ]
    },
    {
      "id": "kiqwavr",
      "author": "rosallia",
      "body": "If she doesn’t work out look for a psychologist with a PhD or doctorate. Idk I’ve been through therapy since I was five. In my experience, I’ve always felt like I needed someone with higher knowledge and experience. If you can find someone with that criteria and your insurance can pay for it I’d really recommend it. \n\nI’m sorry she didn’t listen to you.",
      "created_utc": 1705763594.0,
      "score": 1,
      "context": [
        {
          "id": "kinynbu",
          "author": "chunkeymunkeyandrunt",
          "body": "It was technically in previous DSM editions too, it was just labeled differently … \n\nYou should report her honestly. A therapist straight up refusing to educate themselves on something their client has brought up (and is a LEGITIMATE EATING DISORDER IN THE DSM V) is frankly dangerous in my opinion. What else is she refusing to educate herself on for her clients??\n\nETA: also, what the fuck is this ‘I don’t believe in labels’ HOMIE THE DSM IS LITERALLY A COMPENDIUM OF ALL THE LABELS WE HAVE FOR DISORDERS AND MEDICAL CONDITIONS?!??",
          "created_utc": 1705707571.0
        },
        {
          "id": "kioipom",
          "author": "Normal_Article491",
          "body": "What gets me is she even said “you know I believe that science is always changing and growing” but also told me that it’s concerning that I’m finding this diagnosis on the internet. Like didn’t even consider that it could be real???? What the fuck…. I’m so insulted because up until this point she has treated me with respect and knows that I’m a very self aware person with a psych degree who loves to research. Like I’ve read real medical articles on ARFID not just social media posts. \nI’m not saying she needed to believe me, but at least look into it to understand where I’m coming from.",
          "created_utc": 1705715552.0
        },
        {
          "id": "kiqmjhz",
          "author": "rosallia",
          "body": "Does she have a phd at all",
          "created_utc": 1705759461.0
        },
        {
          "id": "kiquloc",
          "author": "Normal_Article491",
          "body": "No lcsw",
          "created_utc": 1705762894.0
        },
        {
          "id": "kiqumjs",
          "author": "Normal_Article491",
          "body": "Just a masters in social work",
          "created_utc": 1705762904.0
        }
      ]
    },
    {
      "id": "kiqjdfm",
      "author": "RealLivePersonInNC",
      "body": " I'm sorry she made you feel that way. She is the one in the wrong. I also know it can seem daunting to try to find a new therapist but it's so worthwhile to find the right fit - someone who can encourage you and not shame you.",
      "created_utc": 1705757999.0,
      "score": 5,
      "context": [
        {
          "id": "kinykbn",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1705707537.0
        },
        {
          "id": "kinypik",
          "author": "Normal_Article491",
          "body": "Thank you. This is what I was planning on doing. I want to go back and show her and make her feel dumb because she made me feel so fucking stupid",
          "created_utc": 1705707593.0
        },
        {
          "id": "kinz1ok",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1705707724.0
        },
        {
          "id": "kio1gqq",
          "author": "Normal_Article491",
          "body": "Hahaha I appreciate you. Thank you so much.",
          "created_utc": 1705708660.0
        },
        {
          "id": "kioza57",
          "author": "_tropicalismo",
          "body": "If anything send her a picture of the page on the DSM with the actual ARFID diagnosis criteria, and add a citation so she can look it up herself. And definitely report her. Staying up to date with the modern literature in one's field is imperative, even more important for healthcare workers.",
          "created_utc": 1705722694.0
        },
        {
          "id": "kipqs0b",
          "author": "Normal_Article491",
          "body": "I emailed her with several articles and a picture of the dsm-5 criteria for arfid. I hope she responds well, but I’m not expecting anything after how horrible the session went today. It felt as though she had something against eating disorders and just didn’t believe me. I feel so icky.",
          "created_utc": 1705738982.0
        }
      ]
    },
    {
      "id": "kit1l7j",
      "author": "_tropicalismo",
      "body": "Good to hear you were able to send her that email, I think this is the closest you'll get to getting closure with your therapist. I don't think it's worth having one more session with her to explain yourself or tell her \"I told you so\" in person. Especially if you were left crying for so long after the session. There's no need to alter your emotional state in this way. If you want to officially stop having sessions with her, email her again as a last goodbye and tell her that the way she invalidated you last session and the way it made you feel is not ok and you don't think you can move past this. But this is totally up to you, if you want to see her again then go for it.",
      "created_utc": 1705791418.0,
      "score": 2,
      "context": [
        {
          "id": "kinykbn",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1705707537.0
        },
        {
          "id": "kinypik",
          "author": "Normal_Article491",
          "body": "Thank you. This is what I was planning on doing. I want to go back and show her and make her feel dumb because she made me feel so fucking stupid",
          "created_utc": 1705707593.0
        },
        {
          "id": "kinz1ok",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1705707724.0
        },
        {
          "id": "kio1gqq",
          "author": "Normal_Article491",
          "body": "Hahaha I appreciate you. Thank you so much.",
          "created_utc": 1705708660.0
        },
        {
          "id": "kioza57",
          "author": "_tropicalismo",
          "body": "If anything send her a picture of the page on the DSM with the actual ARFID diagnosis criteria, and add a citation so she can look it up herself. And definitely report her. Staying up to date with the modern literature in one's field is imperative, even more important for healthcare workers.",
          "created_utc": 1705722694.0
        },
        {
          "id": "kipqs0b",
          "author": "Normal_Article491",
          "body": "I emailed her with several articles and a picture of the dsm-5 criteria for arfid. I hope she responds well, but I’m not expecting anything after how horrible the session went today. It felt as though she had something against eating disorders and just didn’t believe me. I feel so icky.",
          "created_utc": 1705738982.0
        }
      ]
    },
    {
      "id": "kippdz8",
      "author": "Normal_Article491",
      "body": "I appreciate your reply so much seeing as you can view this from both sides. My problem is that my therapist is only a year or two older than I am, she’s around 30. So the dsm-5 would be exactly what she learned from in under grad and grad school. I understand not being familiar with everything in it, it’s a large book, but to completely disregard and to just assume it wasn’t in there without even checking first, that hurt me a lot. \n\nI went and sent her an email explaining how distraught our session made me and I attached some links to medical articles discussing ARFID and about the change in name from previous DSM’s. I simply said that if she’s willing to look into I would be willing to come back, but if not then I think our professional relationship has run its course because I need someone supportive, not someone whose going to break me down",
      "created_utc": 1705737959.0,
      "score": 14,
      "context": [
        {
          "id": "kinykbn",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1705707537.0
        },
        {
          "id": "kinypik",
          "author": "Normal_Article491",
          "body": "Thank you. This is what I was planning on doing. I want to go back and show her and make her feel dumb because she made me feel so fucking stupid",
          "created_utc": 1705707593.0
        },
        {
          "id": "kio6xlt",
          "author": "therealganjababe",
          "body": "Absolutely what I'd do. Fuck her for telling you that something that has such a huge effect on your life and psychology/well-being doesn't exist when it's clearly in the DMS-5. I would absolutely want to rub it in her face, and tell her to F off, and find a Dr who actually knows what they are talking about, and listens to their patients.\n\n\nI know that some therapists/Docs try to treat symptoms and not labels, because frankly there's a lot of comorbid issues with BP, and our experiences can vary. So it's not too strange to want to keep treating your symptoms, but to flat out deny this, and obviously refusing to even try looking it up because obvs 'they know best', is a tragedy and infuriating.",
          "created_utc": 1705710822.0
        },
        {
          "id": "kio8v0l",
          "author": "Normal_Article491",
          "body": "Her whole attitude toward the session was so weird to me. She seemed very arrogant today and I have no idea why. I’m genuinely so blown and I really spiraled during my session because I’ve had such a good relationship with her for the last 2 years. So when she just didn’t even want to do a quick search to understand what I was talking about, it really hurt and I can’t understand why. Like why not look it up so you know what I’m talking about? It just felt stubborn and weird. And why did she assume it wasn’t in her books? That was icky for sure.",
          "created_utc": 1705711594.0
        },
        {
          "id": "kioav51",
          "author": "PetriMagyk",
          "body": "If she’s been good for two years, it might be worth having one more appointment and to ask if there was anything external going on during that session; maybe she was having a bad day? Doesn’t excuse it, but it’s worth bringing up so she knows that her work was inconsistent, and hopefully be able to take that into consideration and do better, if not with you then with other clients. Having a “debrief” on what went wrong with that session might clear things up or at least help transitioning to a different provider. \n\nRegardless, that fucking sucks, you deserve better, and addressing it isn’t your responsibility if you don’t want to.",
          "created_utc": 1705712396.0
        },
        {
          "id": "kip5avf",
          "author": "drosekelley",
          "body": "Therapist here (my kiddo has ARFID), and I agree with this comment. It could be beneficial for both you and your therapist if you communicate how her behavior felt to you. Beneficial for you in that you’re advocating for yourself and being confident in your own truth, and not immediately giving up on a 2 year relationship. Beneficial for her in that she might grow as a therapist by hearing your experience. But I also agree that it’s not your obligation in any way to do that for her. \n\nFWIW, I had never heard of ARFID until my daughter was diagnosed. The diagnosis is only 10 years old. But if a client had brought it up to me, I would have immediately grabbed my DSM and then would educate myself on it. I’m sorry your therapist acted like she knew better than you did about your own experience.",
          "created_utc": 1705725602.0
        }
      ]
    },
    {
      "id": "kiufadv",
      "author": "Normal_Article491",
      "body": "I actually sent her an email just like this and that’s where I’m leaving it. Thanks for the reply!!! I’ll update when she responds",
      "created_utc": 1705810694.0,
      "score": 3,
      "context": [
        {
          "id": "kinykbn",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1705707537.0
        },
        {
          "id": "kinypik",
          "author": "Normal_Article491",
          "body": "Thank you. This is what I was planning on doing. I want to go back and show her and make her feel dumb because she made me feel so fucking stupid",
          "created_utc": 1705707593.0
        },
        {
          "id": "kinz1ok",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1705707724.0
        },
        {
          "id": "kio1gqq",
          "author": "Normal_Article491",
          "body": "Hahaha I appreciate you. Thank you so much.",
          "created_utc": 1705708660.0
        },
        {
          "id": "kioza57",
          "author": "_tropicalismo",
          "body": "If anything send her a picture of the page on the DSM with the actual ARFID diagnosis criteria, and add a citation so she can look it up herself. And definitely report her. Staying up to date with the modern literature in one's field is imperative, even more important for healthcare workers.",
          "created_utc": 1705722694.0
        },
        {
          "id": "kipqs0b",
          "author": "Normal_Article491",
          "body": "I emailed her with several articles and a picture of the dsm-5 criteria for arfid. I hope she responds well, but I’m not expecting anything after how horrible the session went today. It felt as though she had something against eating disorders and just didn’t believe me. I feel so icky.",
          "created_utc": 1705738982.0
        },
        {
          "id": "kit1l7j",
          "author": "_tropicalismo",
          "body": "Good to hear you were able to send her that email, I think this is the closest you'll get to getting closure with your therapist. I don't think it's worth having one more session with her to explain yourself or tell her \"I told you so\" in person. Especially if you were left crying for so long after the session. There's no need to alter your emotional state in this way. If you want to officially stop having sessions with her, email her again as a last goodbye and tell her that the way she invalidated you last session and the way it made you feel is not ok and you don't think you can move past this. But this is totally up to you, if you want to see her again then go for it.",
          "created_utc": 1705791418.0
        }
      ]
    },
    {
      "id": "kitkgb9",
      "author": "drosekelley",
      "body": "Sounds like you handled it very skillfully! Good work. I’m so interested to hear how she responds to your email - I hope you’ll come post an update!",
      "created_utc": 1705798639.0,
      "score": 2,
      "context": [
        {
          "id": "kinykbn",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1705707537.0
        },
        {
          "id": "kinypik",
          "author": "Normal_Article491",
          "body": "Thank you. This is what I was planning on doing. I want to go back and show her and make her feel dumb because she made me feel so fucking stupid",
          "created_utc": 1705707593.0
        },
        {
          "id": "kio6xlt",
          "author": "therealganjababe",
          "body": "Absolutely what I'd do. Fuck her for telling you that something that has such a huge effect on your life and psychology/well-being doesn't exist when it's clearly in the DMS-5. I would absolutely want to rub it in her face, and tell her to F off, and find a Dr who actually knows what they are talking about, and listens to their patients.\n\n\nI know that some therapists/Docs try to treat symptoms and not labels, because frankly there's a lot of comorbid issues with BP, and our experiences can vary. So it's not too strange to want to keep treating your symptoms, but to flat out deny this, and obviously refusing to even try looking it up because obvs 'they know best', is a tragedy and infuriating.",
          "created_utc": 1705710822.0
        },
        {
          "id": "kio8v0l",
          "author": "Normal_Article491",
          "body": "Her whole attitude toward the session was so weird to me. She seemed very arrogant today and I have no idea why. I’m genuinely so blown and I really spiraled during my session because I’ve had such a good relationship with her for the last 2 years. So when she just didn’t even want to do a quick search to understand what I was talking about, it really hurt and I can’t understand why. Like why not look it up so you know what I’m talking about? It just felt stubborn and weird. And why did she assume it wasn’t in her books? That was icky for sure.",
          "created_utc": 1705711594.0
        },
        {
          "id": "kioav51",
          "author": "PetriMagyk",
          "body": "If she’s been good for two years, it might be worth having one more appointment and to ask if there was anything external going on during that session; maybe she was having a bad day? Doesn’t excuse it, but it’s worth bringing up so she knows that her work was inconsistent, and hopefully be able to take that into consideration and do better, if not with you then with other clients. Having a “debrief” on what went wrong with that session might clear things up or at least help transitioning to a different provider. \n\nRegardless, that fucking sucks, you deserve better, and addressing it isn’t your responsibility if you don’t want to.",
          "created_utc": 1705712396.0
        },
        {
          "id": "kip5avf",
          "author": "drosekelley",
          "body": "Therapist here (my kiddo has ARFID), and I agree with this comment. It could be beneficial for both you and your therapist if you communicate how her behavior felt to you. Beneficial for you in that you’re advocating for yourself and being confident in your own truth, and not immediately giving up on a 2 year relationship. Beneficial for her in that she might grow as a therapist by hearing your experience. But I also agree that it’s not your obligation in any way to do that for her. \n\nFWIW, I had never heard of ARFID until my daughter was diagnosed. The diagnosis is only 10 years old. But if a client had brought it up to me, I would have immediately grabbed my DSM and then would educate myself on it. I’m sorry your therapist acted like she knew better than you did about your own experience.",
          "created_utc": 1705725602.0
        },
        {
          "id": "kippdz8",
          "author": "Normal_Article491",
          "body": "I appreciate your reply so much seeing as you can view this from both sides. My problem is that my therapist is only a year or two older than I am, she’s around 30. So the dsm-5 would be exactly what she learned from in under grad and grad school. I understand not being familiar with everything in it, it’s a large book, but to completely disregard and to just assume it wasn’t in there without even checking first, that hurt me a lot. \n\nI went and sent her an email explaining how distraught our session made me and I attached some links to medical articles discussing ARFID and about the change in name from previous DSM’s. I simply said that if she’s willing to look into I would be willing to come back, but if not then I think our professional relationship has run its course because I need someone supportive, not someone whose going to break me down",
          "created_utc": 1705737959.0
        }
      ]
    }
  ]
}