{
  "id": "1aei6wo",
  "subreddit": "ARFID",
  "author": "chunkeymunkeyandrunt",
  "created_utc": 1706597199.0,
  "title": "Appreciation posts for friends who get me 😭❤️",
  "selftext": "This friend of mine is a legit foodie. He loves almost any food! We have a ‘game’ of sorts where he sends me a recipe/food, and I tell him all the reasons I don’t like it 😂 but every now and then he finds something within my parameters and it’s an exciting day for both of us.",
  "url": "https://i.redd.it/mxxz8e3oxifc1.jpeg",
  "score": 128,
  "num_comments": 7,
  "comments": [
    {
      "id": "kk8fzwx",
      "author": "esteemed-colleague",
      "body": "It's the simple things that count 💞",
      "created_utc": 1706604191.0,
      "score": 10,
      "context": []
    },
    {
      "id": "kkb6bzu",
      "author": "shortnsweet33",
      "body": "Life hack to others with “chunk” issues - put it in a blender and pulse a few times. I can eat all the chunky salsas and sauces now with this method! Sometimes whatever is cheapest/on sale has chunks so I’ve tried to get creative and work around it.",
      "created_utc": 1706646452.0,
      "score": 6,
      "context": []
    },
    {
      "id": "kk99uvc",
      "author": "Hazel-Ice",
      "body": "what's the recipe???",
      "created_utc": 1706622697.0,
      "score": 6,
      "context": []
    },
    {
      "id": "kk9adca",
      "author": "babyhands_8",
      "body": "raos is amazing!!!",
      "created_utc": 1706622919.0,
      "score": 4,
      "context": []
    },
    {
      "id": "kk9cl24",
      "author": "james321232",
      "body": "okay so I need to tell you my secret cause I think its perfect for ARFID, if you use marinara sauce for a bunch of stuff, I found that mixing some plain tomato sauce with salt, pepper, onion powder, garlic powder, and oregano makes a reallly yummy marinara sauce. best part being you dont have to worry at all about chunks of tomatos or onions in it cause you know everything that's in there!! and it's cheap to make!",
      "created_utc": 1706623862.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kp0bf94",
      "author": "treefittybananas",
      "body": "This makes me so happy to read! 🥰 I love seeing posts on here about the support people have in their lives for this stuff. He also sounds like such an awesome friend. ❤️\n\n\nAbout a week ago, I just started talking to someone to date and was dreading bringing up a few conditions, but especially ARFID (even compared to shit like chronic fainting, gastroparesis, kidney issues, legs constantly giving out/losing function, etc. that most people wouldn't expect since I don't \"look\" disabled and am in my late 20s). And he just so happens to be autistic (pretty sure I am, too, so that was a pleasant surprise) and when I told him I have ARFID, he happened to know about it a bit already and was just simply like, \"What can I do to help with it? And what all should be avoided when we're together?\" My jaw dropped, lmao. I was elated, especially because a big thing he said on his profile was about him being a foodie too, and even specifically loving some foods I can't be within 50 ft of, lol.\n\n\nWe need more people like them in the world, fr fr.",
      "created_utc": 1707129452.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kka4nax",
      "author": "chunkeymunkeyandrunt",
      "body": "He got back to me this morning with it! 🤩 https://www.foodandwine.com/recipes/tomato-sauce-onion-and-butter",
      "created_utc": 1706634080.0,
      "score": 3,
      "context": [
        {
          "id": "kk99uvc",
          "author": "Hazel-Ice",
          "body": "what's the recipe???",
          "created_utc": 1706622697.0
        }
      ]
    }
  ]
}