{
  "id": "1aoeygc",
  "subreddit": "ARFID",
  "author": "swayvie33",
  "created_utc": 1707676578.0,
  "title": "Do you ever think of arfid as a privileged disorder",
  "selftext": "Like if you were born in a more underdeveloped country would we still have arfid. Or if we were growing up in jails, homeless, etc. \n\nThat thought always make me feel bad that I’m actively avoiding food even though it is everywhere. \n\nIdk I’m just talking.",
  "url": "https://www.reddit.com/r/ARFID/comments/1aoeygc/do_you_ever_think_of_arfid_as_a_privileged/",
  "score": 203,
  "num_comments": 125,
  "comments": [
    {
      "id": "kpz2xhp",
      "author": "GuyOwasca",
      "body": "No, because I grew up homeless, living outdoors in tents and orphanages and shelters, eating government-issued commodities food (more like *refusing to eat*) and I still have ARFID. I just also grew up extremely malnourished and basically only ate cereal for the first fourteen years of my life.",
      "created_utc": 1707679808.0,
      "score": 209,
      "context": []
    },
    {
      "id": "kpywfet",
      "author": "thrivingsad",
      "body": "I grew up near homeless & in poverty.\n\nNo, it is not a privileged disorder. At most, those who have consistent access to their safe foods are lucky, because they don’t have to go through long periods of starvation because of inability to access those resources\n\nI know a lot of individuals who have ARFID, who were at some point homeless or in poverty as well",
      "created_utc": 1707677655.0,
      "score": 395,
      "context": []
    },
    {
      "id": "kpz32hp",
      "author": "ohhyouknow",
      "body": "More underdeveloped countries have eating disorders too. They are just less documented because they are less developed.",
      "created_utc": 1707679853.0,
      "score": 68,
      "context": []
    },
    {
      "id": "kpywqbn",
      "author": "None",
      "body": "Arfid actively has made every aspect of my life horrible. No I don't think its a  privileged disorder. This is the same mentality as finish your plate because children in Africa are starving. The world is awful but that doesn't mean your suffering is lesser because someone else has it worse. Suffering is suffering.",
      "created_utc": 1707677753.0,
      "score": 91,
      "context": []
    },
    {
      "id": "kpz0nas",
      "author": "theyspeakeasy",
      "body": "No, most of my same foods are poverty foods. Plain rice, veggies, beans, etc. are not “privileged” foods, they are some of the cheapest foods available on the planet. I’m not basing my diet around steak and caviar, y’all.",
      "created_utc": 1707679050.0,
      "score": 42,
      "context": []
    },
    {
      "id": "kpzfnn7",
      "author": "rewwindhuh",
      "body": "I grew up in a refuge. Dear god No thats a myth that ableists use\n\nThis is exactly what Survivorship Bias is.\n\nWhen ppl born with disabilities or debilitating health conditions arent able to access their survival needs, they die. Thats it. Look at the mortality rates for the places ur on abt, infant mortality especially. And for poverty and such too. How are these people going to be able to reach you and us in particular to communicate their struggles, when they may not even be able to survive let alone afford a phone and have enough time to figure out how to connect viral on social media?\n\nAnd then the extreme lack of information available globally, how disadvantaged people may also have learning disabilities or other circumstances which just means they may genuinely not ever find out this is the word for their experience. The list of factors goes on\n\nI was underweight my whole childhood, but my family didnt have any way to understand, hospitalisation was a threat rather than a way to get help. If i never escaped I would probably be dead or be dying, and the second my fragile housing stability crumbles / if I slip under the radar from the system thats supposed to help me, death would be on its way & thats just how it is as an outcome I have to prepare for",
      "created_utc": 1707684057.0,
      "score": 39,
      "context": []
    },
    {
      "id": "kpz4fjx",
      "author": "eaterofgoldenfish",
      "body": "ARFID is not a \"privileged disorder\": anyone can suffer from it. You can't think or feel your way out of it through brute force of will or because of your morals. People with more privilege are more likely to be able to afford treatment or compensatory strategies, however. Someone with ARFID in jail is going to be suffering more than someone with ARFID who is not in jail, all else being equal. Being in jail isn't going to magically cure the ARFID, and in fact may make it much much worse.",
      "created_utc": 1707680304.0,
      "score": 39,
      "context": []
    },
    {
      "id": "kpzeu5y",
      "author": "SleepwalkerWei",
      "body": "Definitely not. \n\nI grew up very poor and with a parent who wasn’t educated on food. My other parent sometimes wouldn’t even feed me when I was staying with them as they were usually passed out on the couch. As a result, I don’t have proper hunger cues, I don’t have a varied palette due to lack of exposure during childhood, I get full fast due to small portions, I can just turn my hunger off because I had to not feel it as a small child in order to cope. \n\nWhilst I have ADHD and sensory issues which affect my arfid, I don’t think I would have arfid had my childhood been different. My ADHD makes it hard to go get food for myself, but this wouldn’t be a problem if I didn’t have the ability to just turn off my hunger and if I didn’t view eating as optional. My sensory issues with food are due to being a “super taster” which, again, can be attributed to only eating basic, bland food growing up, and honestly so could my texture sensitivity too as I honestly only ate chicken nuggets, chips and bread growing up so I never had to adapt to different textures. \n\nMy older sibling who endured all of this with me went the other way and deals with obesity. Neither of us have a healthy relationship with food because we weren’t fed properly. I definitely do not think arfid is a disorder of privilege, but actually I’d be more inclined to say those in privileged positions who have Arfid are probably in the minority. Most of us more than likely had something during childhood which led to disordered eating, and often that something is some form of abuse.",
      "created_utc": 1707683782.0,
      "score": 20,
      "context": []
    },
    {
      "id": "kpzfzov",
      "author": "smalltown_dreamspeak",
      "body": "People can be afflicted with ARFID, even if they aren't in privileged circumstances. This is kind of in line with the \"ARFID is just being picky, if they're hungry enough they'll eat\" mindset.",
      "created_utc": 1707684168.0,
      "score": 17,
      "context": []
    },
    {
      "id": "kpzcvz5",
      "author": "0_Shinigami_0",
      "body": "I grew up like an inch over the poverty line. It's definitely not a privileged disorder",
      "created_utc": 1707683123.0,
      "score": 13,
      "context": []
    },
    {
      "id": "kpzhx9o",
      "author": "None",
      "body": "Not at all. \n\nYou'd be surprised the amount of people who have been homeless or in poverty (like myself) and still have ARFID.\n\nYou could be a Michelin star chef and have ARIFD. It doesn't discriminate.",
      "created_utc": 1707684812.0,
      "score": 10,
      "context": []
    },
    {
      "id": "kpz3374",
      "author": "PocketsMcgee",
      "body": "No, I think that the people who have less resources often suffer more and have a higher death potential from not having alternative options. They'll often just go without and it's dangerous but they're at the mercy of this disorder too.  They also generally won't have the same ability to talk about it on social media and in schools because they lack social resources too like internet/computer access and getting to places can hinder them too from accessing places to talk about their experiences as well. I think that's maybe why it seems like it's mostly more privileged circumstances talking about it.",
      "created_utc": 1707679860.0,
      "score": 9,
      "context": []
    },
    {
      "id": "kpznosr",
      "author": "grudgby",
      "body": "My arfid got worse when I was homeless",
      "created_utc": 1707686750.0,
      "score": 15,
      "context": []
    },
    {
      "id": "kpz5drq",
      "author": "jintana",
      "body": "I have a richer variety of safe foods with access to money, but when I’m broke or poor, including while I was a child, I’d prefer to literally go without than eat something unsafe.\n\nThe flip side of this is that if a food is the least bit safe, I love it. I ate a lot of Lima beans as a child; I eat a lot of tofu as an adult.",
      "created_utc": 1707680619.0,
      "score": 6,
      "context": []
    },
    {
      "id": "kpztm59",
      "author": "therealganjababe",
      "body": "I understand the strong dissent on this one, and those answers are important. However-\n\nI have absolutely thought about this myself, like what if I was sent to jail and nothing felt safe? I'm sure I'd starve for awhile, but at some point my need for food must overtake the ARFID, right? Otherwise people would be literally starving to death in prisons. I hopefully will never have a reason to go to jail, but this part of jail scares me the most.\n\nI was in a mental ward when I was 15, for over a Month. Luckily, thankfully, the kitchen would often make me a tiny cheeseburger, but mostly I lived in sugar cookies which were t always there of course, and would collect people's uneaten salads, which was like 2 pieces of iceberg lettuce and a tomato. At least the Thousand Island dressing was filling. \n\nBut legit, if I didn't have those few scarce and unhealthy options, what would I have done? I was 15 and locked up, I would have had zero options to eat.\n\n(My future boyfriend that I met there would have his Dad bring us Burger King occasionally and OMG it was like fn Xmas lol) My parents never brought me shit.",
      "created_utc": 1707688754.0,
      "score": 7,
      "context": []
    },
    {
      "id": "kpywazz",
      "author": "eric-710",
      "body": "Yeah I think about this all the time. My parents always talked about how there's children in Africa dying of starvation and here I am crying because I don't want to eat a certain food. But even as an adult and spending money on my own food I still struggle to eat things even though I'm the one buying it and wasting it. I feel guilty a lot but also helpless because eating is just miserable for me and I wish I didn't have to do it.",
      "created_utc": 1707677612.0,
      "score": 20,
      "context": []
    },
    {
      "id": "kpz3147",
      "author": "meladey",
      "body": "I think ARFID is a disorder that, at one point, served an evolutionary advantage, like Anorexia nervosa (which has more solid research in this area).\n\nIf you have an aversion towards certain foods, a disinterest in food, or a fear of choking or vomiting, then you would be better at seeking out good quality food. Just like AN serving the purpose of leading the tribe to food, despite starving, because they could ignore the reaction to their emaciated bodies, not expending energy on food unless it was truly worth the energy, in favor of moving and seeking out more food. People with ARFID would also be able to seek out more food without getting side-tracked, and were likely more perceptive to foods that would cause food poisoning.\n\nIt may come off as privileged now, if you constantly have access to your safe foods, but, no, it's not a disorder borne out of privilege, nor exclusive to the privileged.",
      "created_utc": 1707679841.0,
      "score": 15,
      "context": []
    },
    {
      "id": "kpywvta",
      "author": "Fun_Willingness_5698",
      "body": "No I don't think so, a child born with arfid in a rural, developing area with static and limited food options may just starve to death in infancy, and if there are medical records of it it would probably just be labeled as malnutrition. So yea it's privileged in the same sense that someone who's born and lives in an area without a significant malaria presence won't die  of malaria.",
      "created_utc": 1707677802.0,
      "score": 13,
      "context": []
    },
    {
      "id": "kpz4jkx",
      "author": "georgecostanzalvr",
      "body": "When I lived at home, and my parents prepared and payed for my food I was able to eat a lot better. I could eat healthy alternatives to my safe foods, and explore more options. ARFID affected my life still, but not like it does now that I am on my own. I’m on a tight budget, so I can’t afford healthier alternatives, and I can’t afford to stray from my safe foods to just try something new. If I don’t like it I feel super guilty throwing it away, or not eating it. I feel really boxed in. I don’t know if this is necessarily what you’re asking, but this is just my personal experience.",
      "created_utc": 1707680340.0,
      "score": 4,
      "context": []
    },
    {
      "id": "kpzghsm",
      "author": "Traditional_Bug9768",
      "body": "The scarcity of food I believe and lack of money contributed to me being arfid, and plenty of ppl around me. I moved to US as an adult and was recently diagnosed after years. Smh",
      "created_utc": 1707684335.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kpzpgv0",
      "author": "kingcrabmeat",
      "body": "Op, I'm not mad but no I fucking hate it I struggle everyday currently",
      "created_utc": 1707687344.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kpzsnuu",
      "author": "honest-ingenuity-316",
      "body": "No. If I didn’t have access to my safe foods, I wouldn’t not have arfid, I would die from malnutrition.",
      "created_utc": 1707688427.0,
      "score": 4,
      "context": []
    },
    {
      "id": "kpzwnfr",
      "author": "Sea_Proof2471",
      "body": "No, more nights than not we didn't have food for dinner growing up and I still had ARFID even then. I'd skip some of the only meals we did have if I didn't have safe foods",
      "created_utc": 1707689828.0,
      "score": 4,
      "context": []
    },
    {
      "id": "kpzq0m2",
      "author": "None",
      "body": "No but I have thought that if there was some kind of disaster or event in which the foods I eat were unavailable then I would possibly starve. Or possibly adapt? Could I force myself if it was about survival? Like what would I do if I’m stuck only eating bunker food or some shit.",
      "created_utc": 1707687530.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kpzwway",
      "author": "InevitablePersimmon6",
      "body": "I personally think that if I were somewhere unable to get to foods I find safe, I’d probably be extremely ill or possibly dead. I don’t see it as privileged at all. I’m sure you can find humans in poverty who can only eat certain foods. Everyone just loves to focus on making us feel bad by saying things like “there are starving children in Africa who’d eat that food!”",
      "created_utc": 1707689921.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kpzyz3q",
      "author": "katcomesback",
      "body": "no, I used to think so but I’d go five days without eating my safe food to save it for the weekend to have energy for monday. i developed anorexia due to trauma and poverty along with arfid and have had both for almost two decades, arfid alone for two decades",
      "created_utc": 1707690707.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kq02h5v",
      "author": "CrossdressTimelady",
      "body": "Not necessarily-- ARFID can often be treated during childhood, but it requires MORE resources from the parents than not treating it:  \n\n\n\\--Food getting wasted in the process of introducing new foods (in the book I have about curing ARFID, it warns people up front that they will waste food and money in the process)\n\n&#x200B;\n\n\\--More emotional resources from parents-- patience, a high emotional IQ, time, etc.\n\n  \n\\--Being able to see doctors and child psychologists about the issue  \n\n\n\\--The ability to cook unfamiliar foods in a way that is \\*actually desirable\\*.  I've discussed my issue with a friend who had a similar issue growing up, and he said that he didn't recover from ARFID until he started discovering better versions of certain foods.  He even said the type I have (which presents itself as looking like a vegetarian diet mostly) is probably due to the fact that \"bad vegetables are OK, but bad meat is REALLY bad.\"  \n\n\n\\--According to \"Nourishing Traditions Book of Baby and Childcare\", part of what causes picky eating is actually what the mother is eating during pregnancy and how foods are introduced during infancy/very early childhood.  A mother from a more prosperous background is more likely to be eating a wide variety of nutrient-dense foods during pregnancy and less likely to rely on the cheap, easy things that tend to cause ARFID like feeding the baby bottles of apple juice early in life.  To follow the advice in \"Nourishing Traditions\" you really do need to have a higher budget for food or at least a lot of time and access to a farm.  You simply won't find 95% of the foods they recommend in a food pantry.  \n\n\nHaving ARFID is not \"privileged\".  Having a family that actually treats it successfully during childhood would indicate that you're from a more comfortable financial background.",
      "created_utc": 1707692069.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kpz0dkc",
      "author": "samit2heck",
      "body": "An interesting point. My son has ARFID and I'm often very anxious that he should find himself in a position like incarnation or poverty when he's older. I don't think it's a privileged disorder, but like every disorder  how you're affected depends greatly on your circumstance.",
      "created_utc": 1707678958.0,
      "score": 4,
      "context": []
    },
    {
      "id": "kpzvv3z",
      "author": "OpheliaJade2382",
      "body": "Nope. Even when I was broke and on the verge of being homeless I was dealing with this. I just simply didn’t eat at all sometimes",
      "created_utc": 1707689534.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kpzzzc9",
      "author": "PeachesnKreamm",
      "body": "I don’t think so? Even when i have £0 i still can’t force myself to eat food if its not my safe foods so i just starve",
      "created_utc": 1707691097.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kq0etln",
      "author": "sneezing_forbidden",
      "body": "I feel like my ARFID stems from poverty i experienced when I was 1-4. Obviously I don’t remember things from when I was that age, but those are crucial developmental years. If you were not properly introduced to new foods, or often had to endure spoiled food, it makes sense your relationship to food will be messy. Most of my strong aversions AND safe foods are some of the few foods we did keep in the house during those years. (ex. mayonnaise makes me throw up. had to eat lots of mayo and bread. I love frozen waffles, super safe food, often had them those years.)",
      "created_utc": 1707697167.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kq1dj60",
      "author": "Avbitten",
      "body": "No, it's just if you are too poor to get your safe foods, you just die.",
      "created_utc": 1707710886.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kq2em5g",
      "author": "UpDownLeftRyan",
      "body": "Not sure, but I do often wonder how long it would take me to eat something new in like a stranded on a desert island scenario… or whether I’d still be like nah not eating that coconut don’t care",
      "created_utc": 1707734820.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kq3cagd",
      "author": "newsgal1877",
      "body": "I think the only difference between growing up in poverty with ARFID vs growing up in wealth with ARFID is probably a person’s safe foods. \n\nI like to imagine that somewhere out there is a person whose only safe foods are Lobster Thermidor, Evian water and Quail Eggs. Living in wealth would just change what foods you were possibly exposed to growing up - the disorder would still be there. \n\nHeck I just find it so interesting all the time the differences in safe foods between people with ARFID in general. One of my main safe food groups is cheese (in general). My son restricts cheese entirely UNLESS it’s on pizza.",
      "created_utc": 1707751946.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kpzfpfx",
      "author": "Professional_Ear9795",
      "body": "I hope OP gets a privilege check here. ARFID isn't a choice, and def isn't because we have the privilege of choosing.",
      "created_utc": 1707684072.0,
      "score": 5,
      "context": []
    },
    {
      "id": "kpzgagg",
      "author": "Traditional_Bug9768",
      "body": "Lmfaooooooo I was born in a third world country and have been “labeled a picky eater” and “malnourished” because they are familiar with Arfid. wtf is wrong with y’all? A lot of ppl who grew up in my conditions I know for a fact suffers from the same. You’re nuts for assuming this.",
      "created_utc": 1707684267.0,
      "score": 3,
      "context": []
    },
    {
      "id": "l7k8xxj",
      "author": "WildHelicopter8100",
      "body": "i think about this all the time i feel so mf bad for being revolted by most normal foods",
      "created_utc": 1717783176.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l9z9pbe",
      "author": "Emmett_Star-Cloudkin",
      "body": "I have this thought and I always feel so bad for it bc I lived in a household where we couldn't afford to eat every single day anyways. I think it stimmed from me being told by family that I was ingrateful for not eating because there were kids starving who needed food more than I did, and that if I was hungry enough I would eat (I didn't)",
      "created_utc": 1719187838.0,
      "score": 1,
      "context": []
    },
    {
      "id": "loq6z9x",
      "author": "New_Leather_3740",
      "body": "I didnt eat solid food until i was 5. had nothing to do with what social class we were in, i just couldnt fathom the feeling of anything in my mouth , chewing/swallowing, or around my face. arfid can come with sensory processing disorder which many autistic people have. i also have adhd so tend to just forget to eat and i wont feel hungry, i'll just be in extreme pain and really dizzy from not eating.",
      "created_utc": 1727201114.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lsjwo3o",
      "author": "Angelangepange",
      "body": "I have been thinking about this often especially as a child because of course my parents tried to make me eat by guilt tripping me with it.\nI think I would just end up dead.\nWhen I put food I can't eat in my mouth I vomit, people would hate me even more for \"wasting food\". So in the end I would end up malnourished even if people literally forced me to eat.\nI don't know obviously if extreme hunger would make my body stop gagging but it might not... imagine that.",
      "created_utc": 1729270344.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mswlchf",
      "author": "SleepAble5968",
      "body": "My friend’s son spent his first five years in a poorly funded orphanage and refused to eat to the point of malnutrition. Came home and was almost immediately diagnosed with ARFID. It can truly happen in any situation",
      "created_utc": 1747542112.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kpzhazd",
      "author": "Kelekona",
      "body": "I'd say that ARFID can develop if someone is constantly trying to eat food that makes them sick.",
      "created_utc": 1707684606.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kpz2ry2",
      "author": "FairyLullaby",
      "body": "I mean kind of but you could say that about anything",
      "created_utc": 1707679755.0,
      "score": -1,
      "context": []
    },
    {
      "id": "kq2899e",
      "author": "Unclesmekky",
      "body": "A privileged disorder ? What the fuck kinda retoric is that?",
      "created_utc": 1707729841.0,
      "score": -1,
      "context": []
    },
    {
      "id": "kq00bo7",
      "author": "isupposeyes",
      "body": "Sometimes I think if I had no other option I’d eat. But sometimes there is no other option and I still don’t. idk",
      "created_utc": 1707691229.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kq0a7tl",
      "author": "NoMethod6455",
      "body": "I think ARFID can exist in any context but the ability to choose obviously cannot and is a privilege regardless of how we might feel about it. If we were all in the average prison we wouldn’t have much choice most days, but I don’t think that would make the repulsion go away fundamentally.",
      "created_utc": 1707695275.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kq0brj5",
      "author": "AwokenQueen64",
      "body": "Growing up, a common phrase used against me was: \"*there are starving children in _____ *\"\n\nThough no amount of abuse, ridicule, or punishment would get me to eat something I don't like. I mean, I'd try to force down a spoonful when they got really screamy at me, but it was incredibly difficult, and I still wouldn't consume much, if at all. I delicately nibble on disliked foods at dinner events as to not be rude, but I give myself the smallest of portions of things i might *maybe* be able to survive through, and even still i won't use sauce or gravy or will avoid the salad and eat mostly the bread. Then try to hit a mcdonalds on the way home because I'd be sooooooo hungry!\n\nI can see myself still doing the same in a scenario where food is scarce. Heck, I worry about it if there was ever an apocalypse. I'd have to force myself to eat really gross stuff just to survive and I think I'd end up incredibly malnourished and starved because I'd only be able to consume incredibly small amounts of whatever it is.\n\nThere'd be lots of crying and gagging, that's for sure.",
      "created_utc": 1707695922.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kq0fae6",
      "author": "None",
      "body": "I have always had this question just never knew how to word it respectfully. I think about those poor kids in struggling countries and I think “I would eat none of the little food they receive” then I think what if one of these kids struggle with it too, do they have to just suffer past it or are the limited variety of foods the only safe foods they have. \n\nI also know struggles for everyone are different and what might suck for someone might not for another and comparing issues is not helpful to anyone, but it always kept me thinking.",
      "created_utc": 1707697347.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kq0jgjc",
      "author": "aroaceautistic",
      "body": "I eat foods that make me sick (digestive disorder) because of this illness I think we are just forced to have different priorities than other people",
      "created_utc": 1707698927.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kq0lmg1",
      "author": "KikiSparklexx",
      "body": "i’ve had this thought. i have not struggled with food insecurity for the majority of my life and the only other person with ARFID who i know in real life comes from a wealthy family who has never struggled with food insecurity. i would imagine people with ARFID who live in an underdeveloped country, live in poverty, homeless, etc. are just labeled picky or particular eaters. i would also imagine it’s just chalked up to a quirk or annoyance without much additional thought about why that person doesn’t stray from their safe food.",
      "created_utc": 1707699753.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kq0mvy4",
      "author": "AwkwardStarD",
      "body": "No I grew up in poverty it was just me my mom the black mold and the roaches",
      "created_utc": 1707700255.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kq152e2",
      "author": "2012amica2",
      "body": "Not particularly, no. I grew up in extreme poverty, an emotionally, verbally, and occasionally physically abusive household with two emotionally unstable and mentally ill parents who decided, for some reason, to have 2 kids they could traumatize. \n\n\nMy ARFID and disordered eating habits developed as a direct result of the environment I was raised in and family attitudes around food. A “privileged upbringing” would’ve been one without those things. Even if you developed ARFID growing up in a healthy(ier) household and good role models, having a disorder is never a privilege.",
      "created_utc": 1707707353.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kq15hut",
      "author": "HE715",
      "body": "For me I think it’s because my parents didn’t feed us a variety of foods, either as babies or kids. My siblings all have issues with food texture, some more than others. \n\nWith my kids I did baby led weaning where they tried different foods from 6 months on. Not purées, actual food. I’m hoping this will make them like more foods as they grow.",
      "created_utc": 1707707552.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kq16ylf",
      "author": "None",
      "body": "i used to think so, but more so because of the beliefs i held based on other people’s messages that i had internalized. one’s health suffering doesn’t seem to me like a “choice” made in clarity, health and  good conscience.",
      "created_utc": 1707708175.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kq19zes",
      "author": "SachiKaM",
      "body": "I’m one generation out of poverty. My Dad is black, inner city south, and was drafted (illegally), just to give context. Because of this he was a lot more rigid pertaining to food waste and control. That’s only one way to look at it though, especially once factoring i’m 100% sure I got it from him. \n\nI’ve been underweight since being an infant and resistant to eating. We can both go long periods not eating without difficulty. His threat was always along the line of “if you knew what it was to be hungry you would eat it”, insinuating my pickiness was entitlement mindset. Issue being I wasn’t hungry to begin with, so it was also perceived as defiant and my physical health was disregarded. \n\nI have two eating disorders, one was inherited and one was developmental because of this reoccurrence. It took becoming an adult to put it all together. My “safe” foods are what he had access to growing up, and subsequently what we grew up eating (for me minus meat, that was the entire fight). We have both always been the same amount restrictive.\n\nThat being said, there has to be nuance. When he was in Nam he ate what he had to while also fending for his life. He is just as proud of his forced food expansion as he is making it back home from hell. I’ve never been in that detrimental of a situation although the second closest I’ve been to death was via food refusal. \n\nThis was a bunch of mental stimming that only leads back to a chicken or the egg scenario. My answer is “no, but…” lol",
      "created_utc": 1707709481.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kq1hene",
      "author": "Lilymoon2653",
      "body": "No, but I was thinking last night and thought about how many other countless people were there in history like us who weren't able to eat like normal.\n\nThen that got me thinking if people with Arfid back then who didn't have as much access to safe foods were actually a portion of the deaths back then. Ik it weird wording but I hope that makes sense and it is something interesting to think about.",
      "created_utc": 1707712592.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kq1unfz",
      "author": "itsokghost",
      "body": "Never.",
      "created_utc": 1707719776.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kq1v9rc",
      "author": "First-Butterscotch-3",
      "body": "No...one of the many ways people tried to get me to eat was good deprivation, giving the bear minimum....no matter how hungry, I still gagged and almost puked with any of my unsafe foods",
      "created_utc": 1707720180.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kq1zpn5",
      "author": "UnderwaterParadise",
      "body": "I really do think about this a lot, especially when people ask things like “if you were on a deserted island wouldn’t you eat X” to challenge my food sensitivities. \n\nI’ve been in difficult food environments for extended periods, though I’ve been privileged not to be homeless or in extreme poverty. At summer camps where there are no options, in foreign countries where next to no safe foods were available, in school cafeterias… I would just eat nothing or like one unhealthy food on repeat. If I were there for even longer or had been there from birth, I wonder if anything would be different.\n\nI hate to admit that I’ve even fantasized about being locked into situations where fear foods are the only foods available, because I think it could cure me. I guess that’s what rehab centers are, but who can afford that if it’s not a life-threatening emergency?",
      "created_utc": 1707723249.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kq228d4",
      "author": "Elegant_Fun_4702",
      "body": "My mom always \"jokes\" i wouldnt have survived before the 90s and I always just say flatly \"its 2024\" or whatever year its mentioned. Idk why she jokes about it either.  Its the one thing that bothers me",
      "created_utc": 1707725123.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kq24xjl",
      "author": "Hoihe",
      "body": "You can make cheap meals with scarce resources that dont trigger texture sensitivities.\n\nI dont really have arfid, hudt sensory processing issues where certain tectured cause me to gag no matter how delicious and desired the meal is.\n\nBut nearly every ingredient can be prepared in ways to control its texture and minimize the bad or outright eliminate it. It just takes being considerate on side of family as a child and skill as an adult.",
      "created_utc": 1707727218.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kq252gx",
      "author": "Rogue_Spirit",
      "body": "Grew up in poverty, not having access to unspoiled food at times.  Still have always had ARFID.",
      "created_utc": 1707727328.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kq2azl9",
      "author": "BoubyWinky",
      "body": "I remember my brothers telling me I won't survive if I end up completly alone in an hostile environment and my answering was\n\"First, I'll try my best to never be in this type of situation, I'm not suicidal. And second, your chances aren't big either ! Must people die in those situations!\" \n\nI always think this argument is purely mean ! Saying this doesn't help anyone ! What's wrong with you? \nAre you enjoy me dying because you'll able to say \"See, I told you!\" ?!? ...",
      "created_utc": 1707731984.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kq2d6vg",
      "author": "floorenjoyer",
      "body": "I was born in an underdeveloped country and still have ARFID so no🤣",
      "created_utc": 1707733719.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kq2k2gq",
      "author": "None",
      "body": "I don't know, but I grew up with stories about the war (2nd world war) and the level of starvation that people went through, like eating only pine needles and shit like that...\nI think maybe there is some extreme point where someone would eat despite arfid or maybe not develop it?\n\nBut as a counter argument tho, we do have anorexic people today out there who look worse than people in the camps :( \n\nSo maybe for some it is, and for some  it isn't?",
      "created_utc": 1707738653.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kq2lxwc",
      "author": "witchfinder_",
      "body": "i live way below poverty line in a very poor country, still have ARFID. when i was homeless i still had ARFID. sleeping on benches and showering every 3 weeks, still ARFID. losing serious weight when i have to go to the hospital bc cant eat their food because ARFID.... show me on the doll where the privilege is. 🙄",
      "created_utc": 1707739821.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kq2uoba",
      "author": "swayvie33",
      "body": "I get it y’all. I was just ranting. Some of y’all in this tag are very negative js",
      "created_utc": 1707744510.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kq2wbmf",
      "author": "ReineDeLaSeine14",
      "body": "Absolutely not.",
      "created_utc": 1707745289.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kq3b45s",
      "author": "newsgal1877",
      "body": "No",
      "created_utc": 1707751496.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kq3g2u2",
      "author": "Shutterbug390",
      "body": "I don’t think it’s privileged. I think it just has a more significant effect on health if you’re poor. \n\nThere were plenty of times in my childhood where it was “eat what’s on the table or don’t eat because it’s literally the only food we have.” That didn’t make me suddenly able to eat things. I just learned to ignore the hunger pain to the point that my hunger cues are totally broken now. I was fortunate that pb&j was a safe food for me, as long as the bread was toasted. That’s something that you can usually pick up ingredients for cheaply, at food pantries, or get through government assistance. There were still times we ended up with a brand of peanut butter that I couldn’t eat, though. (The huge JIF recall last year absolutely screwed me because all the people who normally bought that were suddenly buying other brands. Most of the time, all I could get was great value, which is awful. Peanut butter remains one of my staples to this day.)\n\nI always loved going to camp each summer. But I also basically didn’t eat while I was there. When I was old enough to go to the teen camps, we were allowed to bring snacks and it was the first time I wasn’t sick from hunger by the end. \n\nBasically, less access to food doesn’t suddenly make you able to eat something. It just teaches you to tolerate hunger and could easily result in severe malnutrition if it lasted very long.",
      "created_utc": 1707753352.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kq5l4gj",
      "author": "Sea-Fix-3520",
      "body": "No, I think it's a coping mechanism and a way to control food and being out of control with food,and ignoring reality and the people, places and things around me that are unacceptable and that I can't change or manipulate.",
      "created_utc": 1707779945.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kq6cf8b",
      "author": "okfine_illjoinreddit",
      "body": "https://preview.redd.it/87lxh1y9i9ic1.jpeg?width=1170&format=pjpg&auto=webp&s=c378a6b5bcdfd4b261a98f444a040fbab46afb7a\n\nliterally just texted someone this the other day! obviously cannot say for sure as i haven't actually been in a dire survival situation like this example, but i will say as a working class adult who has not been able to afford groceries at certain points in my life, my ARFID did not go away just because accessing safe foods was harder. if anything i just restricted worse.",
      "created_utc": 1707790702.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kq6i6ah",
      "author": "MarsupialPristine677",
      "body": "Nah, most of the food I’m capable of eating is pretty cheap, and if I were born in different circumstances I probably would have starved to death as a child. I have been aware of this since I was a child, actually. I went on a 21 day wilderness backpacking trip, we got caught in a rainstorm so had to stay an extra few days… I physically could not get myself to eat & keep down food that my brain found unacceptable. It was, um, alarming. So yeah. I know the bad feelings you speak of in your original post and I hope you can be kind to yourself. You didn’t choose this and food is complicated 💜",
      "created_utc": 1707793011.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kq7cyje",
      "author": "Specific_Future_776",
      "body": "as a poor kid in britain im actually convinced arfid can be caused by poverty or the environmental aspects of poverty to say the least",
      "created_utc": 1707809088.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ktak1jw",
      "author": "Luna-Hazuki2006",
      "body": "Heck no! I am venezuelan, I lived in a time where it was almost imposible to find food and yet... I couldn't bring myself to anything other than my safe foods (that were pretty hard to find)",
      "created_utc": 1709558520.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kpz50q1",
      "author": "ohhyouknow",
      "body": "Seriously. Most people who started suffering from ARFID in childhood *were* starving and malnourished as a kid, even if they *did* have access to other things.\n\nThere are cultural dishes that are safe for me that I know no way in hell 99.99% of other ARFID folks would eat. \n\nOne of my favorite things to eat in the world is called boudin and thinking about what the ingredients are makes me feel so sick but bc it’s familiar to me and is consistent, the exact same, for each family who produces it in my area, I can eat it. \n\nIt’s a disorder. It isn’t rational, and doesn’t discriminate based on social or economic status and access to wider varieties of foods.",
      "created_utc": 1707680499.0,
      "score": 125,
      "context": [
        {
          "id": "kpz2xhp",
          "author": "GuyOwasca",
          "body": "No, because I grew up homeless, living outdoors in tents and orphanages and shelters, eating government-issued commodities food (more like *refusing to eat*) and I still have ARFID. I just also grew up extremely malnourished and basically only ate cereal for the first fourteen years of my life.",
          "created_utc": 1707679808.0
        }
      ]
    },
    {
      "id": "kq2m2og",
      "author": "witchfinder_",
      "body": "yes thank you exactly. thank you.",
      "created_utc": 1707739901.0,
      "score": 9,
      "context": [
        {
          "id": "kpz2xhp",
          "author": "GuyOwasca",
          "body": "No, because I grew up homeless, living outdoors in tents and orphanages and shelters, eating government-issued commodities food (more like *refusing to eat*) and I still have ARFID. I just also grew up extremely malnourished and basically only ate cereal for the first fourteen years of my life.",
          "created_utc": 1707679808.0
        }
      ]
    },
    {
      "id": "kzj0mx9",
      "author": "cxxdim",
      "body": "that part. (TW) >!i wouldn’t be unable to move or speak because of how hungry i was and still wouldn’t eat the one thing we had because it wasn’t what my body wanted. the thought of eating more dry cereal when i hadn’t had real food in days was more sickening than the nausea and dizziness from feeling my stomach eat itself!<",
      "created_utc": 1713100403.0,
      "score": 9,
      "context": [
        {
          "id": "kpz2xhp",
          "author": "GuyOwasca",
          "body": "No, because I grew up homeless, living outdoors in tents and orphanages and shelters, eating government-issued commodities food (more like *refusing to eat*) and I still have ARFID. I just also grew up extremely malnourished and basically only ate cereal for the first fourteen years of my life.",
          "created_utc": 1707679808.0
        }
      ]
    },
    {
      "id": "lft9hq1",
      "author": "futuredrweknowdis",
      "body": "Same. I didn’t have access to stable food until I was about 5 years old, and if anything people blame that for mine. They claim that if I had access to more types of foods when I was young I wouldn’t be so “picky.” I’ve struggled with being clinically underweight on and off throughout my life and if it wasn’t for nutrition bars and shakes I don’t know how I would survive.",
      "created_utc": 1722433786.0,
      "score": 4,
      "context": [
        {
          "id": "kpz2xhp",
          "author": "GuyOwasca",
          "body": "No, because I grew up homeless, living outdoors in tents and orphanages and shelters, eating government-issued commodities food (more like *refusing to eat*) and I still have ARFID. I just also grew up extremely malnourished and basically only ate cereal for the first fourteen years of my life.",
          "created_utc": 1707679808.0
        }
      ]
    },
    {
      "id": "ln0iml2",
      "author": "waterluvrxx",
      "body": "omg i also only ate cereal for a majority of my younger years, i haven't heard from anyone else with this experience! i really do feel that lack of exposure to other types of food in my childhood is what caused my food issues",
      "created_utc": 1726273376.0,
      "score": 2,
      "context": [
        {
          "id": "kpz2xhp",
          "author": "GuyOwasca",
          "body": "No, because I grew up homeless, living outdoors in tents and orphanages and shelters, eating government-issued commodities food (more like *refusing to eat*) and I still have ARFID. I just also grew up extremely malnourished and basically only ate cereal for the first fourteen years of my life.",
          "created_utc": 1707679808.0
        }
      ]
    },
    {
      "id": "kpyzdoj",
      "author": "underinfinitebluesky",
      "body": "Seconding this. This kind of thinking seems heavily influenced by people who shame ARFID sufferers for not being able to eat anything put in front of them by weaponizing other people's suffering as \"having it worse\". Having and managing ARFID while living in poverty is incredibly difficult and not at all \"privileged\".",
      "created_utc": 1707678630.0,
      "score": 165,
      "context": [
        {
          "id": "kpywfet",
          "author": "thrivingsad",
          "body": "I grew up near homeless & in poverty.\n\nNo, it is not a privileged disorder. At most, those who have consistent access to their safe foods are lucky, because they don’t have to go through long periods of starvation because of inability to access those resources\n\nI know a lot of individuals who have ARFID, who were at some point homeless or in poverty as well",
          "created_utc": 1707677655.0
        }
      ]
    },
    {
      "id": "kpz5tvn",
      "author": "Maxusam",
      "body": "Arguably, the poverty I grew up in, played a hand in my lack of interest for food now.",
      "created_utc": 1707680767.0,
      "score": 67,
      "context": [
        {
          "id": "kpywfet",
          "author": "thrivingsad",
          "body": "I grew up near homeless & in poverty.\n\nNo, it is not a privileged disorder. At most, those who have consistent access to their safe foods are lucky, because they don’t have to go through long periods of starvation because of inability to access those resources\n\nI know a lot of individuals who have ARFID, who were at some point homeless or in poverty as well",
          "created_utc": 1707677655.0
        }
      ]
    },
    {
      "id": "kq0myyx",
      "author": "AwkwardStarD",
      "body": "Yup yup",
      "created_utc": 1707700290.0,
      "score": 3,
      "context": [
        {
          "id": "kpywfet",
          "author": "thrivingsad",
          "body": "I grew up near homeless & in poverty.\n\nNo, it is not a privileged disorder. At most, those who have consistent access to their safe foods are lucky, because they don’t have to go through long periods of starvation because of inability to access those resources\n\nI know a lot of individuals who have ARFID, who were at some point homeless or in poverty as well",
          "created_utc": 1707677655.0
        }
      ]
    },
    {
      "id": "kq1cmm5",
      "author": "SachiKaM",
      "body": "I went to school for health and nutrition and remember reading that ARFID can’t factor food insecurity. I’m aware of how to read that objectively from a diagnostic pov, but to someone who didn’t know any better it comes off as callous and invalidating. I’ve seen the rhetoric used incorrectly on this sub multiple times. \n\nI didn’t but my Dad grew up poor, one really weird yet positive side effect of the generational trauma is all of my “safe” foods are low budget and focus on the individual macronutrient instead of processed foods; because they couldn’t afford it growing up. It’s sad people can’t differentiate why it is just as much of an issue to not be able to afford food the individual can consume. I will take a plate of plain broccoli over a 5* meal every single day.",
      "created_utc": 1707710506.0,
      "score": 2,
      "context": [
        {
          "id": "kpywfet",
          "author": "thrivingsad",
          "body": "I grew up near homeless & in poverty.\n\nNo, it is not a privileged disorder. At most, those who have consistent access to their safe foods are lucky, because they don’t have to go through long periods of starvation because of inability to access those resources\n\nI know a lot of individuals who have ARFID, who were at some point homeless or in poverty as well",
          "created_utc": 1707677655.0
        }
      ]
    },
    {
      "id": "kq07zy3",
      "author": "Professional_Ear9795",
      "body": "💯💯💯. I read a few weeks ago that Gaza has one of the highest rates of EDs rn.",
      "created_utc": 1707694345.0,
      "score": 24,
      "context": [
        {
          "id": "kpz32hp",
          "author": "ohhyouknow",
          "body": "More underdeveloped countries have eating disorders too. They are just less documented because they are less developed.",
          "created_utc": 1707679853.0
        }
      ]
    },
    {
      "id": "kq0335j",
      "author": "DrG2390",
      "body": "If it helps, I had a privileged upbringing with as wide a variety of foods I could tolerate and I’m still a super taster. It just has to do with how many tastebuds are on your tongue, which to my knowledge isn’t influenced by how varied or not varied your diet is. I could be wrong of course, but I do autopsies on medically donated bodies at a cadaver lad and that’s my understanding of it.\n\nEdited To add a word",
      "created_utc": 1707692315.0,
      "score": 7,
      "context": [
        {
          "id": "kpzeu5y",
          "author": "SleepwalkerWei",
          "body": "Definitely not. \n\nI grew up very poor and with a parent who wasn’t educated on food. My other parent sometimes wouldn’t even feed me when I was staying with them as they were usually passed out on the couch. As a result, I don’t have proper hunger cues, I don’t have a varied palette due to lack of exposure during childhood, I get full fast due to small portions, I can just turn my hunger off because I had to not feel it as a small child in order to cope. \n\nWhilst I have ADHD and sensory issues which affect my arfid, I don’t think I would have arfid had my childhood been different. My ADHD makes it hard to go get food for myself, but this wouldn’t be a problem if I didn’t have the ability to just turn off my hunger and if I didn’t view eating as optional. My sensory issues with food are due to being a “super taster” which, again, can be attributed to only eating basic, bland food growing up, and honestly so could my texture sensitivity too as I honestly only ate chicken nuggets, chips and bread growing up so I never had to adapt to different textures. \n\nMy older sibling who endured all of this with me went the other way and deals with obesity. Neither of us have a healthy relationship with food because we weren’t fed properly. I definitely do not think arfid is a disorder of privilege, but actually I’d be more inclined to say those in privileged positions who have Arfid are probably in the minority. Most of us more than likely had something during childhood which led to disordered eating, and often that something is some form of abuse.",
          "created_utc": 1707683782.0
        }
      ]
    },
    {
      "id": "kq011qp",
      "author": "isupposeyes",
      "body": "Yeah. Sometimes I do think exactly that. What if I wasn’t provided any safe foods for 2 weeks? Would I eat an unsafe food? Maybe. Who knows?",
      "created_utc": 1707691515.0,
      "score": 3,
      "context": [
        {
          "id": "kpzfzov",
          "author": "smalltown_dreamspeak",
          "body": "People can be afflicted with ARFID, even if they aren't in privileged circumstances. This is kind of in line with the \"ARFID is just being picky, if they're hungry enough they'll eat\" mindset.",
          "created_utc": 1707684168.0
        }
      ]
    },
    {
      "id": "kpz59di",
      "author": "ohhyouknow",
      "body": "There are children with ARFID starving in Africa too. If you’re starving you’re starving. It isn’t your fault. /:",
      "created_utc": 1707680578.0,
      "score": 14,
      "context": [
        {
          "id": "kpywazz",
          "author": "eric-710",
          "body": "Yeah I think about this all the time. My parents always talked about how there's children in Africa dying of starvation and here I am crying because I don't want to eat a certain food. But even as an adult and spending money on my own food I still struggle to eat things even though I'm the one buying it and wasting it. I feel guilty a lot but also helpless because eating is just miserable for me and I wish I didn't have to do it.",
          "created_utc": 1707677612.0
        }
      ]
    },
    {
      "id": "kpywewk",
      "author": "Garden-Gremlins",
      "body": "I think about this too. I try not to think about it too hard because there’s not much I can do to solve world hunger",
      "created_utc": 1707677650.0,
      "score": 2,
      "context": [
        {
          "id": "kpywazz",
          "author": "eric-710",
          "body": "Yeah I think about this all the time. My parents always talked about how there's children in Africa dying of starvation and here I am crying because I don't want to eat a certain food. But even as an adult and spending money on my own food I still struggle to eat things even though I'm the one buying it and wasting it. I feel guilty a lot but also helpless because eating is just miserable for me and I wish I didn't have to do it.",
          "created_utc": 1707677612.0
        }
      ]
    },
    {
      "id": "kpzi7ps",
      "author": "Kelekona",
      "body": "Interesting.  I thought it was a natural childhood stage that doesn't get switched off.  Basically at a certain age, kids will freak out if their carrots are cut differently.  For foragers, this would keep a child from eating something unless they know it's good and they're unlikely to eat something that looks close.  (There's no shame in having a malfunctioning anything.)",
      "created_utc": 1707684911.0,
      "score": 8,
      "context": [
        {
          "id": "kpz3147",
          "author": "meladey",
          "body": "I think ARFID is a disorder that, at one point, served an evolutionary advantage, like Anorexia nervosa (which has more solid research in this area).\n\nIf you have an aversion towards certain foods, a disinterest in food, or a fear of choking or vomiting, then you would be better at seeking out good quality food. Just like AN serving the purpose of leading the tribe to food, despite starving, because they could ignore the reaction to their emaciated bodies, not expending energy on food unless it was truly worth the energy, in favor of moving and seeking out more food. People with ARFID would also be able to seek out more food without getting side-tracked, and were likely more perceptive to foods that would cause food poisoning.\n\nIt may come off as privileged now, if you constantly have access to your safe foods, but, no, it's not a disorder borne out of privilege, nor exclusive to the privileged.",
          "created_utc": 1707679841.0
        }
      ]
    },
    {
      "id": "kpzqyhn",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1707687850.0,
      "score": 3,
      "context": [
        {
          "id": "kpywvta",
          "author": "Fun_Willingness_5698",
          "body": "No I don't think so, a child born with arfid in a rural, developing area with static and limited food options may just starve to death in infancy, and if there are medical records of it it would probably just be labeled as malnutrition. So yea it's privileged in the same sense that someone who's born and lives in an area without a significant malaria presence won't die  of malaria.",
          "created_utc": 1707677802.0
        }
      ]
    },
    {
      "id": "kpz4kui",
      "author": "Paid-Not-Payed-Bot",
      "body": "> prepared and *paid* for my\n\nFTFY.\n\nAlthough *payed* exists (the reason why autocorrection didn't help you), it is only correct in:\n\n * Nautical context, when it means to paint a surface, or to cover with something like tar or resin in order to make it waterproof or corrosion-resistant. *The deck is yet to be payed.*\n\n * *Payed out* when letting strings, cables or ropes out, by slacking them. *The rope is payed out! You can pull now.*\n\nUnfortunately, I was unable to find nautical or rope-related words in your comment.\n\n*Beep, boop, I'm a bot*",
      "created_utc": 1707680352.0,
      "score": -1,
      "context": [
        {
          "id": "kpz4jkx",
          "author": "georgecostanzalvr",
          "body": "When I lived at home, and my parents prepared and payed for my food I was able to eat a lot better. I could eat healthy alternatives to my safe foods, and explore more options. ARFID affected my life still, but not like it does now that I am on my own. I’m on a tight budget, so I can’t afford healthier alternatives, and I can’t afford to stray from my safe foods to just try something new. If I don’t like it I feel super guilty throwing it away, or not eating it. I feel really boxed in. I don’t know if this is necessarily what you’re asking, but this is just my personal experience.",
          "created_utc": 1707680340.0
        }
      ]
    },
    {
      "id": "kq0f0ff",
      "author": "sneezing_forbidden",
      "body": "Obviously this is just speculation, and I could be way off! I am no expert. Everyone is different, and ARFID is a wild card of a condition. So who knows 😬",
      "created_utc": 1707697240.0,
      "score": 1,
      "context": [
        {
          "id": "kq0etln",
          "author": "sneezing_forbidden",
          "body": "I feel like my ARFID stems from poverty i experienced when I was 1-4. Obviously I don’t remember things from when I was that age, but those are crucial developmental years. If you were not properly introduced to new foods, or often had to endure spoiled food, it makes sense your relationship to food will be messy. Most of my strong aversions AND safe foods are some of the few foods we did keep in the house during those years. (ex. mayonnaise makes me throw up. had to eat lots of mayo and bread. I love frozen waffles, super safe food, often had them those years.)",
          "created_utc": 1707697167.0
        }
      ]
    },
    {
      "id": "kq01b8a",
      "author": "isupposeyes",
      "body": "sounds like they weren’t assuming, and more asking it is a general question. A lot of people with ARFID are denied their safe foods as a way to prove that it’s not a real disorder, and that they’re just privileged, and OP may be one of those people.",
      "created_utc": 1707691618.0,
      "score": 4,
      "context": [
        {
          "id": "kpzgagg",
          "author": "Traditional_Bug9768",
          "body": "Lmfaooooooo I was born in a third world country and have been “labeled a picky eater” and “malnourished” because they are familiar with Arfid. wtf is wrong with y’all? A lot of ppl who grew up in my conditions I know for a fact suffers from the same. You’re nuts for assuming this.",
          "created_utc": 1707684267.0
        }
      ]
    },
    {
      "id": "kq087kd",
      "author": "Professional_Ear9795",
      "body": "No, not in every circumstance.",
      "created_utc": 1707694434.0,
      "score": 1,
      "context": [
        {
          "id": "kpzhazd",
          "author": "Kelekona",
          "body": "I'd say that ARFID can develop if someone is constantly trying to eat food that makes them sick.",
          "created_utc": 1707684606.0
        }
      ]
    },
    {
      "id": "kq5mtw6",
      "author": "CozmicOwl16",
      "body": "I googled boudin.  That is adventurous!  But If you grow up with someone who makes it well and often I could see growing to enjoy it/not me but someone else could. \n\nMy foods like that are chicken paprikash and bronslagger.  I would never fault anyone for refusing them.",
      "created_utc": 1707780600.0,
      "score": 7,
      "context": [
        {
          "id": "kpz2xhp",
          "author": "GuyOwasca",
          "body": "No, because I grew up homeless, living outdoors in tents and orphanages and shelters, eating government-issued commodities food (more like *refusing to eat*) and I still have ARFID. I just also grew up extremely malnourished and basically only ate cereal for the first fourteen years of my life.",
          "created_utc": 1707679808.0
        },
        {
          "id": "kpz50q1",
          "author": "ohhyouknow",
          "body": "Seriously. Most people who started suffering from ARFID in childhood *were* starving and malnourished as a kid, even if they *did* have access to other things.\n\nThere are cultural dishes that are safe for me that I know no way in hell 99.99% of other ARFID folks would eat. \n\nOne of my favorite things to eat in the world is called boudin and thinking about what the ingredients are makes me feel so sick but bc it’s familiar to me and is consistent, the exact same, for each family who produces it in my area, I can eat it. \n\nIt’s a disorder. It isn’t rational, and doesn’t discriminate based on social or economic status and access to wider varieties of foods.",
          "created_utc": 1707680499.0
        }
      ]
    },
    {
      "id": "kq00h7b",
      "author": "isupposeyes",
      "body": "my mother has used the “argument” (as if she can convince me to not have arfid) “what if you grew up in africa??” first of all not all africans are impoverished even though a lot of them are. but second, nah dude now i just feel even shittier for this disorder that i didn’t choose to have.",
      "created_utc": 1707691291.0,
      "score": 42,
      "context": [
        {
          "id": "kpywfet",
          "author": "thrivingsad",
          "body": "I grew up near homeless & in poverty.\n\nNo, it is not a privileged disorder. At most, those who have consistent access to their safe foods are lucky, because they don’t have to go through long periods of starvation because of inability to access those resources\n\nI know a lot of individuals who have ARFID, who were at some point homeless or in poverty as well",
          "created_utc": 1707677655.0
        },
        {
          "id": "kpyzdoj",
          "author": "underinfinitebluesky",
          "body": "Seconding this. This kind of thinking seems heavily influenced by people who shame ARFID sufferers for not being able to eat anything put in front of them by weaponizing other people's suffering as \"having it worse\". Having and managing ARFID while living in poverty is incredibly difficult and not at all \"privileged\".",
          "created_utc": 1707678630.0
        }
      ]
    },
    {
      "id": "kq1yku1",
      "author": "AideExtension3510",
      "body": "This is said a bit tongue in cheek, but it was quite advantageous for my mum that I had very restrictive arfid growing up, we really didn't have much money and I happily existed on a diet of cereal, brown rice, milk and peanut butter - definitely kept the feeding costs down...",
      "created_utc": 1707722430.0,
      "score": 7,
      "context": [
        {
          "id": "kpywfet",
          "author": "thrivingsad",
          "body": "I grew up near homeless & in poverty.\n\nNo, it is not a privileged disorder. At most, those who have consistent access to their safe foods are lucky, because they don’t have to go through long periods of starvation because of inability to access those resources\n\nI know a lot of individuals who have ARFID, who were at some point homeless or in poverty as well",
          "created_utc": 1707677655.0
        },
        {
          "id": "kpyzdoj",
          "author": "underinfinitebluesky",
          "body": "Seconding this. This kind of thinking seems heavily influenced by people who shame ARFID sufferers for not being able to eat anything put in front of them by weaponizing other people's suffering as \"having it worse\". Having and managing ARFID while living in poverty is incredibly difficult and not at all \"privileged\".",
          "created_utc": 1707678630.0
        }
      ]
    },
    {
      "id": "liiws4x",
      "author": "None",
      "body": "Yes. It is also influenced by culture. I grew up in poverty and in a culture that values slimy foods - the very foods that I can’t eat. Imagine having 70% of foods in the house being foods that you can’t eat and having to also smell disgusting food odors over and over as the same foods are reheated.",
      "created_utc": 1723873047.0,
      "score": 1,
      "context": [
        {
          "id": "kpywfet",
          "author": "thrivingsad",
          "body": "I grew up near homeless & in poverty.\n\nNo, it is not a privileged disorder. At most, those who have consistent access to their safe foods are lucky, because they don’t have to go through long periods of starvation because of inability to access those resources\n\nI know a lot of individuals who have ARFID, who were at some point homeless or in poverty as well",
          "created_utc": 1707677655.0
        },
        {
          "id": "kpyzdoj",
          "author": "underinfinitebluesky",
          "body": "Seconding this. This kind of thinking seems heavily influenced by people who shame ARFID sufferers for not being able to eat anything put in front of them by weaponizing other people's suffering as \"having it worse\". Having and managing ARFID while living in poverty is incredibly difficult and not at all \"privileged\".",
          "created_utc": 1707678630.0
        }
      ]
    },
    {
      "id": "kq56auc",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1707774681.0,
      "score": 1,
      "context": [
        {
          "id": "kpywfet",
          "author": "thrivingsad",
          "body": "I grew up near homeless & in poverty.\n\nNo, it is not a privileged disorder. At most, those who have consistent access to their safe foods are lucky, because they don’t have to go through long periods of starvation because of inability to access those resources\n\nI know a lot of individuals who have ARFID, who were at some point homeless or in poverty as well",
          "created_utc": 1707677655.0
        },
        {
          "id": "kpyzdoj",
          "author": "underinfinitebluesky",
          "body": "Seconding this. This kind of thinking seems heavily influenced by people who shame ARFID sufferers for not being able to eat anything put in front of them by weaponizing other people's suffering as \"having it worse\". Having and managing ARFID while living in poverty is incredibly difficult and not at all \"privileged\".",
          "created_utc": 1707678630.0
        }
      ]
    },
    {
      "id": "kpzw4ff",
      "author": "Grommet__",
      "body": "This. This doesn’t get talked about enough.",
      "created_utc": 1707689631.0,
      "score": 15,
      "context": [
        {
          "id": "kpywfet",
          "author": "thrivingsad",
          "body": "I grew up near homeless & in poverty.\n\nNo, it is not a privileged disorder. At most, those who have consistent access to their safe foods are lucky, because they don’t have to go through long periods of starvation because of inability to access those resources\n\nI know a lot of individuals who have ARFID, who were at some point homeless or in poverty as well",
          "created_utc": 1707677655.0
        },
        {
          "id": "kpz5tvn",
          "author": "Maxusam",
          "body": "Arguably, the poverty I grew up in, played a hand in my lack of interest for food now.",
          "created_utc": 1707680767.0
        }
      ]
    },
    {
      "id": "kpzfivc",
      "author": "Professional_Ear9795",
      "body": "Same 💯",
      "created_utc": 1707684012.0,
      "score": 14,
      "context": [
        {
          "id": "kpywfet",
          "author": "thrivingsad",
          "body": "I grew up near homeless & in poverty.\n\nNo, it is not a privileged disorder. At most, those who have consistent access to their safe foods are lucky, because they don’t have to go through long periods of starvation because of inability to access those resources\n\nI know a lot of individuals who have ARFID, who were at some point homeless or in poverty as well",
          "created_utc": 1707677655.0
        },
        {
          "id": "kpz5tvn",
          "author": "Maxusam",
          "body": "Arguably, the poverty I grew up in, played a hand in my lack of interest for food now.",
          "created_utc": 1707680767.0
        }
      ]
    },
    {
      "id": "kq0o9wt",
      "author": "serromani",
      "body": "THANK YOU. I've often suspected this but never been able to think of the right way to put it.\n\nIf you've been used to going without eating for extended periods of time since you were a toddler, of course it just doesn't really raise the same alarm systems that it seems to for most people...",
      "created_utc": 1707700793.0,
      "score": 10,
      "context": [
        {
          "id": "kpywfet",
          "author": "thrivingsad",
          "body": "I grew up near homeless & in poverty.\n\nNo, it is not a privileged disorder. At most, those who have consistent access to their safe foods are lucky, because they don’t have to go through long periods of starvation because of inability to access those resources\n\nI know a lot of individuals who have ARFID, who were at some point homeless or in poverty as well",
          "created_utc": 1707677655.0
        },
        {
          "id": "kpz5tvn",
          "author": "Maxusam",
          "body": "Arguably, the poverty I grew up in, played a hand in my lack of interest for food now.",
          "created_utc": 1707680767.0
        }
      ]
    },
    {
      "id": "kq0u3yj",
      "author": "ykrainechydai",
      "body": "It’s impossible to have a blanket statements about what kind of life experiences will shape a persons behaviour because there are always at least two (often more than two) general streams that people can go towards after having the same type of experience\n\n for instance I’ve been in poverty my entire adult life and was also Frequently in situations of food insufficiency growing up (for various reasons-  but also there were times when there was a lot of abundance but it was just never stable growing up) and I’ve been food insecure my entire adult life (i’m in my 30s) and my boyfriend grew up very poor without much food until he was in his mid 20s and he reacted to this is in ***direct ***opposition then I do to both his relationship with food and his relationship with money (which if you’re talking about the intersection between food and privilege is kind of synonymous) \n\nespecially because it’s so incredibly difficult to have any kind of issues with food and also be food insecure whether it’s something like this or another type of disorder or some other kind of physiological issue where food is a trigger for symptoms or pick and choose a few of the above🙋‍♀️Acting like you’d only have this condition if you’re privileged enough to have it is really ignorant and hurtful alltho it’s a common sentiment",
      "created_utc": 1707703066.0,
      "score": 5,
      "context": [
        {
          "id": "kpywfet",
          "author": "thrivingsad",
          "body": "I grew up near homeless & in poverty.\n\nNo, it is not a privileged disorder. At most, those who have consistent access to their safe foods are lucky, because they don’t have to go through long periods of starvation because of inability to access those resources\n\nI know a lot of individuals who have ARFID, who were at some point homeless or in poverty as well",
          "created_utc": 1707677655.0
        },
        {
          "id": "kpz5tvn",
          "author": "Maxusam",
          "body": "Arguably, the poverty I grew up in, played a hand in my lack of interest for food now.",
          "created_utc": 1707680767.0
        }
      ]
    },
    {
      "id": "kq6dmgk",
      "author": "Sea-Fix-3520",
      "body": "All my safe foods are non addictive, and I love 🎂🍰, 💘 desserts 🍪 bread and butter, stuffing,quiche goats milk yogurt and all kinds of things made with sugar and white flour.This is physical and I am not going to binge on broccolis and chicken meat, potatoes,but 🥣 Crea of wheat 🌾 and oatmeal with milk and sweet n low, but non sugar or rice,pasta, I will eat but stop. A 🍫 cake I will not be able to stop until the cake is gone.",
      "created_utc": 1707791184.0,
      "score": 2,
      "context": [
        {
          "id": "kpywfet",
          "author": "thrivingsad",
          "body": "I grew up near homeless & in poverty.\n\nNo, it is not a privileged disorder. At most, those who have consistent access to their safe foods are lucky, because they don’t have to go through long periods of starvation because of inability to access those resources\n\nI know a lot of individuals who have ARFID, who were at some point homeless or in poverty as well",
          "created_utc": 1707677655.0
        },
        {
          "id": "kq1cmm5",
          "author": "SachiKaM",
          "body": "I went to school for health and nutrition and remember reading that ARFID can’t factor food insecurity. I’m aware of how to read that objectively from a diagnostic pov, but to someone who didn’t know any better it comes off as callous and invalidating. I’ve seen the rhetoric used incorrectly on this sub multiple times. \n\nI didn’t but my Dad grew up poor, one really weird yet positive side effect of the generational trauma is all of my “safe” foods are low budget and focus on the individual macronutrient instead of processed foods; because they couldn’t afford it growing up. It’s sad people can’t differentiate why it is just as much of an issue to not be able to afford food the individual can consume. I will take a plate of plain broccoli over a 5* meal every single day.",
          "created_utc": 1707710506.0
        }
      ]
    },
    {
      "id": "kq054x8",
      "author": "smalltown_dreamspeak",
      "body": "What makes ARFID a disorder, and not just picky behavior, is that it disrupts ones ability to eat non-safe foods to a potentially dangerous extent. I've been in situations where I went dangerous lengths of time without food because I couldn't eat the food available to me without vomiting. Others have, too. \n\nThat's why it's so important to recognize this disorder as what it is, and treat accordingly.",
      "created_utc": 1707693158.0,
      "score": 8,
      "context": [
        {
          "id": "kpzfzov",
          "author": "smalltown_dreamspeak",
          "body": "People can be afflicted with ARFID, even if they aren't in privileged circumstances. This is kind of in line with the \"ARFID is just being picky, if they're hungry enough they'll eat\" mindset.",
          "created_utc": 1707684168.0
        },
        {
          "id": "kq011qp",
          "author": "isupposeyes",
          "body": "Yeah. Sometimes I do think exactly that. What if I wasn’t provided any safe foods for 2 weeks? Would I eat an unsafe food? Maybe. Who knows?",
          "created_utc": 1707691515.0
        }
      ]
    },
    {
      "id": "kq2m7oc",
      "author": "witchfinder_",
      "body": "there were times in my life that i starved for like a week straight because no access to \"safe\" foods so lol ..",
      "created_utc": 1707739983.0,
      "score": 5,
      "context": [
        {
          "id": "kpzfzov",
          "author": "smalltown_dreamspeak",
          "body": "People can be afflicted with ARFID, even if they aren't in privileged circumstances. This is kind of in line with the \"ARFID is just being picky, if they're hungry enough they'll eat\" mindset.",
          "created_utc": 1707684168.0
        },
        {
          "id": "kq011qp",
          "author": "isupposeyes",
          "body": "Yeah. Sometimes I do think exactly that. What if I wasn’t provided any safe foods for 2 weeks? Would I eat an unsafe food? Maybe. Who knows?",
          "created_utc": 1707691515.0
        }
      ]
    },
    {
      "id": "kpzkioo",
      "author": "meladey",
      "body": "I don't think that's how it started, as our ancestors probably didn't cut and plate food the way we do today. They probably tore things to feed to their children without much regard to looks- just to choking hazard. In modern times, though, it manifests that way!",
      "created_utc": 1707685687.0,
      "score": 6,
      "context": [
        {
          "id": "kpz3147",
          "author": "meladey",
          "body": "I think ARFID is a disorder that, at one point, served an evolutionary advantage, like Anorexia nervosa (which has more solid research in this area).\n\nIf you have an aversion towards certain foods, a disinterest in food, or a fear of choking or vomiting, then you would be better at seeking out good quality food. Just like AN serving the purpose of leading the tribe to food, despite starving, because they could ignore the reaction to their emaciated bodies, not expending energy on food unless it was truly worth the energy, in favor of moving and seeking out more food. People with ARFID would also be able to seek out more food without getting side-tracked, and were likely more perceptive to foods that would cause food poisoning.\n\nIt may come off as privileged now, if you constantly have access to your safe foods, but, no, it's not a disorder borne out of privilege, nor exclusive to the privileged.",
          "created_utc": 1707679841.0
        },
        {
          "id": "kpzi7ps",
          "author": "Kelekona",
          "body": "Interesting.  I thought it was a natural childhood stage that doesn't get switched off.  Basically at a certain age, kids will freak out if their carrots are cut differently.  For foragers, this would keep a child from eating something unless they know it's good and they're unlikely to eat something that looks close.  (There's no shame in having a malfunctioning anything.)",
          "created_utc": 1707684911.0
        }
      ]
    },
    {
      "id": "kq00x6i",
      "author": "Fun_Willingness_5698",
      "body": "Ok very young then",
      "created_utc": 1707691466.0,
      "score": 1,
      "context": [
        {
          "id": "kpywvta",
          "author": "Fun_Willingness_5698",
          "body": "No I don't think so, a child born with arfid in a rural, developing area with static and limited food options may just starve to death in infancy, and if there are medical records of it it would probably just be labeled as malnutrition. So yea it's privileged in the same sense that someone who's born and lives in an area without a significant malaria presence won't die  of malaria.",
          "created_utc": 1707677802.0
        },
        {
          "id": "kpzqyhn",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1707687850.0
        }
      ]
    },
    {
      "id": "kpz4p6k",
      "author": "georgecostanzalvr",
      "body": "Oops. Thank you bot.",
      "created_utc": 1707680392.0,
      "score": 2,
      "context": [
        {
          "id": "kpz4jkx",
          "author": "georgecostanzalvr",
          "body": "When I lived at home, and my parents prepared and payed for my food I was able to eat a lot better. I could eat healthy alternatives to my safe foods, and explore more options. ARFID affected my life still, but not like it does now that I am on my own. I’m on a tight budget, so I can’t afford healthier alternatives, and I can’t afford to stray from my safe foods to just try something new. If I don’t like it I feel super guilty throwing it away, or not eating it. I feel really boxed in. I don’t know if this is necessarily what you’re asking, but this is just my personal experience.",
          "created_utc": 1707680340.0
        },
        {
          "id": "kpz4kui",
          "author": "Paid-Not-Payed-Bot",
          "body": "> prepared and *paid* for my\n\nFTFY.\n\nAlthough *payed* exists (the reason why autocorrection didn't help you), it is only correct in:\n\n * Nautical context, when it means to paint a surface, or to cover with something like tar or resin in order to make it waterproof or corrosion-resistant. *The deck is yet to be payed.*\n\n * *Payed out* when letting strings, cables or ropes out, by slacking them. *The rope is payed out! You can pull now.*\n\nUnfortunately, I was unable to find nautical or rope-related words in your comment.\n\n*Beep, boop, I'm a bot*",
          "created_utc": 1707680352.0
        }
      ]
    },
    {
      "id": "kq0rgpu",
      "author": "Kelekona",
      "body": "Well yeah, there has to be something to explain \"privileged\" people developing ARFID.",
      "created_utc": 1707702053.0,
      "score": 1,
      "context": [
        {
          "id": "kpzhazd",
          "author": "Kelekona",
          "body": "I'd say that ARFID can develop if someone is constantly trying to eat food that makes them sick.",
          "created_utc": 1707684606.0
        },
        {
          "id": "kq087kd",
          "author": "Professional_Ear9795",
          "body": "No, not in every circumstance.",
          "created_utc": 1707694434.0
        }
      ]
    },
    {
      "id": "kq15in5",
      "author": "tehdesikitteh",
      "body": "Yes! There'd be a point where it's eat the unsafe food or die and then you get all the anxiety etc from that decision and the eating which just compounds the disorder.",
      "created_utc": 1707707563.0,
      "score": 11,
      "context": [
        {
          "id": "kpywfet",
          "author": "thrivingsad",
          "body": "I grew up near homeless & in poverty.\n\nNo, it is not a privileged disorder. At most, those who have consistent access to their safe foods are lucky, because they don’t have to go through long periods of starvation because of inability to access those resources\n\nI know a lot of individuals who have ARFID, who were at some point homeless or in poverty as well",
          "created_utc": 1707677655.0
        },
        {
          "id": "kpyzdoj",
          "author": "underinfinitebluesky",
          "body": "Seconding this. This kind of thinking seems heavily influenced by people who shame ARFID sufferers for not being able to eat anything put in front of them by weaponizing other people's suffering as \"having it worse\". Having and managing ARFID while living in poverty is incredibly difficult and not at all \"privileged\".",
          "created_utc": 1707678630.0
        },
        {
          "id": "kq00h7b",
          "author": "isupposeyes",
          "body": "my mother has used the “argument” (as if she can convince me to not have arfid) “what if you grew up in africa??” first of all not all africans are impoverished even though a lot of them are. but second, nah dude now i just feel even shittier for this disorder that i didn’t choose to have.",
          "created_utc": 1707691291.0
        }
      ]
    },
    {
      "id": "kq1k1ap",
      "author": "Digigoggles",
      "body": "I feel like that phrase is a bit racist and comes from old ideas used to justify colonialism. There are starving kids in America too! But yet they use that phrase. It might come partially from all the old ads and missionaries and stuff to help the starving kids in Africa too",
      "created_utc": 1707713818.0,
      "score": 6,
      "context": [
        {
          "id": "kpywfet",
          "author": "thrivingsad",
          "body": "I grew up near homeless & in poverty.\n\nNo, it is not a privileged disorder. At most, those who have consistent access to their safe foods are lucky, because they don’t have to go through long periods of starvation because of inability to access those resources\n\nI know a lot of individuals who have ARFID, who were at some point homeless or in poverty as well",
          "created_utc": 1707677655.0
        },
        {
          "id": "kpyzdoj",
          "author": "underinfinitebluesky",
          "body": "Seconding this. This kind of thinking seems heavily influenced by people who shame ARFID sufferers for not being able to eat anything put in front of them by weaponizing other people's suffering as \"having it worse\". Having and managing ARFID while living in poverty is incredibly difficult and not at all \"privileged\".",
          "created_utc": 1707678630.0
        },
        {
          "id": "kq00h7b",
          "author": "isupposeyes",
          "body": "my mother has used the “argument” (as if she can convince me to not have arfid) “what if you grew up in africa??” first of all not all africans are impoverished even though a lot of them are. but second, nah dude now i just feel even shittier for this disorder that i didn’t choose to have.",
          "created_utc": 1707691291.0
        }
      ]
    },
    {
      "id": "kq25552",
      "author": "Hoihe",
      "body": "Also.\n\nMost of it is preparation.\n\nSkillful, creative approach to ingredients can transform triggering textures i to other ones.\n\nAnd these are not hard approaches either: boiling is a simple cooking method without high tool requirement. Neither is baking. \n\nThe biggest trick is to recognize how ingredients interact ans maybe adjusting timings.\n\nFor instance rakott krumpli triggers my texture issues.\n\nNow , what if you baked the potatoes with the meat, and skipped the tejfol or added it while serving? Delicious.\n\nIt costs no more resources or time.",
      "created_utc": 1707727387.0,
      "score": 3,
      "context": [
        {
          "id": "kpywfet",
          "author": "thrivingsad",
          "body": "I grew up near homeless & in poverty.\n\nNo, it is not a privileged disorder. At most, those who have consistent access to their safe foods are lucky, because they don’t have to go through long periods of starvation because of inability to access those resources\n\nI know a lot of individuals who have ARFID, who were at some point homeless or in poverty as well",
          "created_utc": 1707677655.0
        },
        {
          "id": "kpyzdoj",
          "author": "underinfinitebluesky",
          "body": "Seconding this. This kind of thinking seems heavily influenced by people who shame ARFID sufferers for not being able to eat anything put in front of them by weaponizing other people's suffering as \"having it worse\". Having and managing ARFID while living in poverty is incredibly difficult and not at all \"privileged\".",
          "created_utc": 1707678630.0
        },
        {
          "id": "kq00h7b",
          "author": "isupposeyes",
          "body": "my mother has used the “argument” (as if she can convince me to not have arfid) “what if you grew up in africa??” first of all not all africans are impoverished even though a lot of them are. but second, nah dude now i just feel even shittier for this disorder that i didn’t choose to have.",
          "created_utc": 1707691291.0
        }
      ]
    },
    {
      "id": "kq3b9rt",
      "author": "Sea-Fix-3520",
      "body": "I heard that from my parents who whenever I asked for anything even small, would say there are children starving in Africa 🌍 which I knew intuitively,and my father guilted me with all immigrants in the WW2 that were hurt,maimed, couldn't speak English and I ate everything on my plate anyway.But it was like you have no right to complain about anything and others in the world have it much worse than you'll ever have.",
      "created_utc": 1707751556.0,
      "score": 2,
      "context": [
        {
          "id": "kpywfet",
          "author": "thrivingsad",
          "body": "I grew up near homeless & in poverty.\n\nNo, it is not a privileged disorder. At most, those who have consistent access to their safe foods are lucky, because they don’t have to go through long periods of starvation because of inability to access those resources\n\nI know a lot of individuals who have ARFID, who were at some point homeless or in poverty as well",
          "created_utc": 1707677655.0
        },
        {
          "id": "kpyzdoj",
          "author": "underinfinitebluesky",
          "body": "Seconding this. This kind of thinking seems heavily influenced by people who shame ARFID sufferers for not being able to eat anything put in front of them by weaponizing other people's suffering as \"having it worse\". Having and managing ARFID while living in poverty is incredibly difficult and not at all \"privileged\".",
          "created_utc": 1707678630.0
        },
        {
          "id": "kq00h7b",
          "author": "isupposeyes",
          "body": "my mother has used the “argument” (as if she can convince me to not have arfid) “what if you grew up in africa??” first of all not all africans are impoverished even though a lot of them are. but second, nah dude now i just feel even shittier for this disorder that i didn’t choose to have.",
          "created_utc": 1707691291.0
        }
      ]
    },
    {
      "id": "kq56pgt",
      "author": "underinfinitebluesky",
      "body": "I don't think you meant to reply to me directly because I'm agreeing with someone making that exact point.",
      "created_utc": 1707774816.0,
      "score": 2,
      "context": [
        {
          "id": "kpywfet",
          "author": "thrivingsad",
          "body": "I grew up near homeless & in poverty.\n\nNo, it is not a privileged disorder. At most, those who have consistent access to their safe foods are lucky, because they don’t have to go through long periods of starvation because of inability to access those resources\n\nI know a lot of individuals who have ARFID, who were at some point homeless or in poverty as well",
          "created_utc": 1707677655.0
        },
        {
          "id": "kpyzdoj",
          "author": "underinfinitebluesky",
          "body": "Seconding this. This kind of thinking seems heavily influenced by people who shame ARFID sufferers for not being able to eat anything put in front of them by weaponizing other people's suffering as \"having it worse\". Having and managing ARFID while living in poverty is incredibly difficult and not at all \"privileged\".",
          "created_utc": 1707678630.0
        },
        {
          "id": "kq56auc",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1707774681.0
        }
      ]
    },
    {
      "id": "kq043fv",
      "author": "Kelekona",
      "body": "I was thinking more about the young chimp not eating a leaf because it looks slightly sus.  It just gets really wild when parents start cutting the food into unnatural shapes.",
      "created_utc": 1707692725.0,
      "score": 4,
      "context": [
        {
          "id": "kpz3147",
          "author": "meladey",
          "body": "I think ARFID is a disorder that, at one point, served an evolutionary advantage, like Anorexia nervosa (which has more solid research in this area).\n\nIf you have an aversion towards certain foods, a disinterest in food, or a fear of choking or vomiting, then you would be better at seeking out good quality food. Just like AN serving the purpose of leading the tribe to food, despite starving, because they could ignore the reaction to their emaciated bodies, not expending energy on food unless it was truly worth the energy, in favor of moving and seeking out more food. People with ARFID would also be able to seek out more food without getting side-tracked, and were likely more perceptive to foods that would cause food poisoning.\n\nIt may come off as privileged now, if you constantly have access to your safe foods, but, no, it's not a disorder borne out of privilege, nor exclusive to the privileged.",
          "created_utc": 1707679841.0
        },
        {
          "id": "kpzi7ps",
          "author": "Kelekona",
          "body": "Interesting.  I thought it was a natural childhood stage that doesn't get switched off.  Basically at a certain age, kids will freak out if their carrots are cut differently.  For foragers, this would keep a child from eating something unless they know it's good and they're unlikely to eat something that looks close.  (There's no shame in having a malfunctioning anything.)",
          "created_utc": 1707684911.0
        },
        {
          "id": "kpzkioo",
          "author": "meladey",
          "body": "I don't think that's how it started, as our ancestors probably didn't cut and plate food the way we do today. They probably tore things to feed to their children without much regard to looks- just to choking hazard. In modern times, though, it manifests that way!",
          "created_utc": 1707685687.0
        }
      ]
    },
    {
      "id": "kq0wlno",
      "author": "Professional_Ear9795",
      "body": "Huh? Sensory issues exist in privileged ppl too? I'm not understanding ig",
      "created_utc": 1707704036.0,
      "score": 1,
      "context": [
        {
          "id": "kpzhazd",
          "author": "Kelekona",
          "body": "I'd say that ARFID can develop if someone is constantly trying to eat food that makes them sick.",
          "created_utc": 1707684606.0
        },
        {
          "id": "kq087kd",
          "author": "Professional_Ear9795",
          "body": "No, not in every circumstance.",
          "created_utc": 1707694434.0
        },
        {
          "id": "kq0rgpu",
          "author": "Kelekona",
          "body": "Well yeah, there has to be something to explain \"privileged\" people developing ARFID.",
          "created_utc": 1707702053.0
        }
      ]
    },
    {
      "id": "kq1414s",
      "author": "None",
      "body": "Sensory issues, lack of interest, and fear of adverse effects are the categories for ARFID. I personally just don't have much hunger and eating bores me a lot, so I just don't think about doing it. I don't think ARFID discriminates it's effects based on socioeconomic status, and not every \"privileged\" person has ARFID just from sensory issues or fear of adverse events.",
      "created_utc": 1707706946.0,
      "score": 1,
      "context": [
        {
          "id": "kpzhazd",
          "author": "Kelekona",
          "body": "I'd say that ARFID can develop if someone is constantly trying to eat food that makes them sick.",
          "created_utc": 1707684606.0
        },
        {
          "id": "kq087kd",
          "author": "Professional_Ear9795",
          "body": "No, not in every circumstance.",
          "created_utc": 1707694434.0
        },
        {
          "id": "kq0rgpu",
          "author": "Kelekona",
          "body": "Well yeah, there has to be something to explain \"privileged\" people developing ARFID.",
          "created_utc": 1707702053.0
        }
      ]
    },
    {
      "id": "kq5m50w",
      "author": "Sea-Fix-3520",
      "body": "I know my parents weren't racist,they saw pictures of starving people and my father spent 3 years in the army where he saw all kinds of poverty and human suffering.I think as my mother was Catholic,she wanted to help people and she gave food to pantries,and money to drives for charity.we know there are poor here,but you can access help here.No judgement,I am dysfunctional, and I can't get it together.",
      "created_utc": 1707780331.0,
      "score": 2,
      "context": [
        {
          "id": "kpywfet",
          "author": "thrivingsad",
          "body": "I grew up near homeless & in poverty.\n\nNo, it is not a privileged disorder. At most, those who have consistent access to their safe foods are lucky, because they don’t have to go through long periods of starvation because of inability to access those resources\n\nI know a lot of individuals who have ARFID, who were at some point homeless or in poverty as well",
          "created_utc": 1707677655.0
        },
        {
          "id": "kpyzdoj",
          "author": "underinfinitebluesky",
          "body": "Seconding this. This kind of thinking seems heavily influenced by people who shame ARFID sufferers for not being able to eat anything put in front of them by weaponizing other people's suffering as \"having it worse\". Having and managing ARFID while living in poverty is incredibly difficult and not at all \"privileged\".",
          "created_utc": 1707678630.0
        },
        {
          "id": "kq00h7b",
          "author": "isupposeyes",
          "body": "my mother has used the “argument” (as if she can convince me to not have arfid) “what if you grew up in africa??” first of all not all africans are impoverished even though a lot of them are. but second, nah dude now i just feel even shittier for this disorder that i didn’t choose to have.",
          "created_utc": 1707691291.0
        },
        {
          "id": "kq1k1ap",
          "author": "Digigoggles",
          "body": "I feel like that phrase is a bit racist and comes from old ideas used to justify colonialism. There are starving kids in America too! But yet they use that phrase. It might come partially from all the old ads and missionaries and stuff to help the starving kids in Africa too",
          "created_utc": 1707713818.0
        }
      ]
    },
    {
      "id": "ktw1j0q",
      "author": "adhd_as_fuck",
      "body": "This is one of those rare times I don't think it is. Or at least didn't start out that way. I know growing up in the 80s, that was something my mom always said. But Ethiopia was in the middle of the biggest famine that has occurred in modern times, something like half a million people died. There were always pledge drives all over the tv, it was in our weekly readers in school, there really wasn't any place you didn't see images of Ethiopian children starving.",
      "created_utc": 1709884565.0,
      "score": 2,
      "context": [
        {
          "id": "kpywfet",
          "author": "thrivingsad",
          "body": "I grew up near homeless & in poverty.\n\nNo, it is not a privileged disorder. At most, those who have consistent access to their safe foods are lucky, because they don’t have to go through long periods of starvation because of inability to access those resources\n\nI know a lot of individuals who have ARFID, who were at some point homeless or in poverty as well",
          "created_utc": 1707677655.0
        },
        {
          "id": "kpyzdoj",
          "author": "underinfinitebluesky",
          "body": "Seconding this. This kind of thinking seems heavily influenced by people who shame ARFID sufferers for not being able to eat anything put in front of them by weaponizing other people's suffering as \"having it worse\". Having and managing ARFID while living in poverty is incredibly difficult and not at all \"privileged\".",
          "created_utc": 1707678630.0
        },
        {
          "id": "kq00h7b",
          "author": "isupposeyes",
          "body": "my mother has used the “argument” (as if she can convince me to not have arfid) “what if you grew up in africa??” first of all not all africans are impoverished even though a lot of them are. but second, nah dude now i just feel even shittier for this disorder that i didn’t choose to have.",
          "created_utc": 1707691291.0
        },
        {
          "id": "kq1k1ap",
          "author": "Digigoggles",
          "body": "I feel like that phrase is a bit racist and comes from old ideas used to justify colonialism. There are starving kids in America too! But yet they use that phrase. It might come partially from all the old ads and missionaries and stuff to help the starving kids in Africa too",
          "created_utc": 1707713818.0
        }
      ]
    },
    {
      "id": "kq58aku",
      "author": "sagefairyy",
      "body": "My internet was lagging and don‘t know how that happened, so sorry! My bad.",
      "created_utc": 1707775345.0,
      "score": 2,
      "context": [
        {
          "id": "kpywfet",
          "author": "thrivingsad",
          "body": "I grew up near homeless & in poverty.\n\nNo, it is not a privileged disorder. At most, those who have consistent access to their safe foods are lucky, because they don’t have to go through long periods of starvation because of inability to access those resources\n\nI know a lot of individuals who have ARFID, who were at some point homeless or in poverty as well",
          "created_utc": 1707677655.0
        },
        {
          "id": "kpyzdoj",
          "author": "underinfinitebluesky",
          "body": "Seconding this. This kind of thinking seems heavily influenced by people who shame ARFID sufferers for not being able to eat anything put in front of them by weaponizing other people's suffering as \"having it worse\". Having and managing ARFID while living in poverty is incredibly difficult and not at all \"privileged\".",
          "created_utc": 1707678630.0
        },
        {
          "id": "kq56auc",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1707774681.0
        },
        {
          "id": "kq56pgt",
          "author": "underinfinitebluesky",
          "body": "I don't think you meant to reply to me directly because I'm agreeing with someone making that exact point.",
          "created_utc": 1707774816.0
        }
      ]
    },
    {
      "id": "kq06e8m",
      "author": "meladey",
      "body": "Oh, yes, exactly!! I think we probably helped our ancestors and their migratory tribes not get sick, by avoiding food that looked or smelled bad.",
      "created_utc": 1707693671.0,
      "score": 5,
      "context": [
        {
          "id": "kpz3147",
          "author": "meladey",
          "body": "I think ARFID is a disorder that, at one point, served an evolutionary advantage, like Anorexia nervosa (which has more solid research in this area).\n\nIf you have an aversion towards certain foods, a disinterest in food, or a fear of choking or vomiting, then you would be better at seeking out good quality food. Just like AN serving the purpose of leading the tribe to food, despite starving, because they could ignore the reaction to their emaciated bodies, not expending energy on food unless it was truly worth the energy, in favor of moving and seeking out more food. People with ARFID would also be able to seek out more food without getting side-tracked, and were likely more perceptive to foods that would cause food poisoning.\n\nIt may come off as privileged now, if you constantly have access to your safe foods, but, no, it's not a disorder borne out of privilege, nor exclusive to the privileged.",
          "created_utc": 1707679841.0
        },
        {
          "id": "kpzi7ps",
          "author": "Kelekona",
          "body": "Interesting.  I thought it was a natural childhood stage that doesn't get switched off.  Basically at a certain age, kids will freak out if their carrots are cut differently.  For foragers, this would keep a child from eating something unless they know it's good and they're unlikely to eat something that looks close.  (There's no shame in having a malfunctioning anything.)",
          "created_utc": 1707684911.0
        },
        {
          "id": "kpzkioo",
          "author": "meladey",
          "body": "I don't think that's how it started, as our ancestors probably didn't cut and plate food the way we do today. They probably tore things to feed to their children without much regard to looks- just to choking hazard. In modern times, though, it manifests that way!",
          "created_utc": 1707685687.0
        },
        {
          "id": "kq043fv",
          "author": "Kelekona",
          "body": "I was thinking more about the young chimp not eating a leaf because it looks slightly sus.  It just gets really wild when parents start cutting the food into unnatural shapes.",
          "created_utc": 1707692725.0
        }
      ]
    },
    {
      "id": "kq2r3gt",
      "author": "Kelekona",
      "body": "I'm sorry for not giving an exhaustive answer instead of just an example of how poor people could develop an eating disorder.",
      "created_utc": 1707742719.0,
      "score": 1,
      "context": [
        {
          "id": "kpzhazd",
          "author": "Kelekona",
          "body": "I'd say that ARFID can develop if someone is constantly trying to eat food that makes them sick.",
          "created_utc": 1707684606.0
        },
        {
          "id": "kq087kd",
          "author": "Professional_Ear9795",
          "body": "No, not in every circumstance.",
          "created_utc": 1707694434.0
        },
        {
          "id": "kq0rgpu",
          "author": "Kelekona",
          "body": "Well yeah, there has to be something to explain \"privileged\" people developing ARFID.",
          "created_utc": 1707702053.0
        },
        {
          "id": "kq0wlno",
          "author": "Professional_Ear9795",
          "body": "Huh? Sensory issues exist in privileged ppl too? I'm not understanding ig",
          "created_utc": 1707704036.0
        }
      ]
    },
    {
      "id": "kq5wnzj",
      "author": "Digigoggles",
      "body": "Yeah that makes sense. It doesn’t have to be all judgment, I just dislike that phrase and tbh the attitude that comes with it. In my opinion a lot of the attitudes of finish your plate other people don’t have that often comes from generational trauma or learned from someone else but it’s easier to pin the starvation on someone else.",
      "created_utc": 1707784448.0,
      "score": 3,
      "context": [
        {
          "id": "kpywfet",
          "author": "thrivingsad",
          "body": "I grew up near homeless & in poverty.\n\nNo, it is not a privileged disorder. At most, those who have consistent access to their safe foods are lucky, because they don’t have to go through long periods of starvation because of inability to access those resources\n\nI know a lot of individuals who have ARFID, who were at some point homeless or in poverty as well",
          "created_utc": 1707677655.0
        },
        {
          "id": "kpyzdoj",
          "author": "underinfinitebluesky",
          "body": "Seconding this. This kind of thinking seems heavily influenced by people who shame ARFID sufferers for not being able to eat anything put in front of them by weaponizing other people's suffering as \"having it worse\". Having and managing ARFID while living in poverty is incredibly difficult and not at all \"privileged\".",
          "created_utc": 1707678630.0
        },
        {
          "id": "kq00h7b",
          "author": "isupposeyes",
          "body": "my mother has used the “argument” (as if she can convince me to not have arfid) “what if you grew up in africa??” first of all not all africans are impoverished even though a lot of them are. but second, nah dude now i just feel even shittier for this disorder that i didn’t choose to have.",
          "created_utc": 1707691291.0
        },
        {
          "id": "kq1k1ap",
          "author": "Digigoggles",
          "body": "I feel like that phrase is a bit racist and comes from old ideas used to justify colonialism. There are starving kids in America too! But yet they use that phrase. It might come partially from all the old ads and missionaries and stuff to help the starving kids in Africa too",
          "created_utc": 1707713818.0
        },
        {
          "id": "kq5m50w",
          "author": "Sea-Fix-3520",
          "body": "I know my parents weren't racist,they saw pictures of starving people and my father spent 3 years in the army where he saw all kinds of poverty and human suffering.I think as my mother was Catholic,she wanted to help people and she gave food to pantries,and money to drives for charity.we know there are poor here,but you can access help here.No judgement,I am dysfunctional, and I can't get it together.",
          "created_utc": 1707780331.0
        }
      ]
    },
    {
      "id": "kq58psp",
      "author": "underinfinitebluesky",
      "body": "No problem lol",
      "created_utc": 1707775487.0,
      "score": 2,
      "context": [
        {
          "id": "kpywfet",
          "author": "thrivingsad",
          "body": "I grew up near homeless & in poverty.\n\nNo, it is not a privileged disorder. At most, those who have consistent access to their safe foods are lucky, because they don’t have to go through long periods of starvation because of inability to access those resources\n\nI know a lot of individuals who have ARFID, who were at some point homeless or in poverty as well",
          "created_utc": 1707677655.0
        },
        {
          "id": "kpyzdoj",
          "author": "underinfinitebluesky",
          "body": "Seconding this. This kind of thinking seems heavily influenced by people who shame ARFID sufferers for not being able to eat anything put in front of them by weaponizing other people's suffering as \"having it worse\". Having and managing ARFID while living in poverty is incredibly difficult and not at all \"privileged\".",
          "created_utc": 1707678630.0
        },
        {
          "id": "kq56auc",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1707774681.0
        },
        {
          "id": "kq56pgt",
          "author": "underinfinitebluesky",
          "body": "I don't think you meant to reply to me directly because I'm agreeing with someone making that exact point.",
          "created_utc": 1707774816.0
        },
        {
          "id": "kq58aku",
          "author": "sagefairyy",
          "body": "My internet was lagging and don‘t know how that happened, so sorry! My bad.",
          "created_utc": 1707775345.0
        }
      ]
    }
  ]
}