{
  "id": "1atxkkz",
  "subreddit": "ARFID",
  "author": "No-Register-1283",
  "created_utc": 1708272638.0,
  "title": "My doctor doesn't believe I have ARFID because I'm fat",
  "selftext": "I'm fat because my safe foods are mostly fast food and packaged foods. They're the same every time and they taste good. Also things like white bread, buttered noodles, stuff like that. I have binge eating disorder (diagnosed in high school) on top of everything because my mom was very controlling about what I eat so I used to hoard my safe snacks and eat them all at night when she was sleeping.\n\nI'm trying to get my weight under control but my doctor says \"the ARFID criteria says it comes with extreme weight loss so that isn't what you have\". I gag uncontrollably when I try to eat unsafe foods. I can branch out a tiny bit (I've been able to eat more kinds of meat recently) but I have so many memories as a kid of being forced to try something and throwing up and my mom getting mad at me and telling me I'm faking it. Finding out about ARFID was such a relief because it explained everything but my doctor won't believe me. \n\nIs she right? Do you have to lose a lot of weight to have ARFID? I never lost weight as a kid because my parents mostly just gave me the pasta and McDonald's and peanut butter sandwiches I asked for when they were done yelling at me for gagging when I tried eating a grape.",
  "url": "https://www.reddit.com/r/ARFID/comments/1atxkkz/my_doctor_doesnt_believe_i_have_arfid_because_im/",
  "score": 161,
  "num_comments": 40,
  "comments": [
    {
      "id": "kr06oq5",
      "author": "luminousrobot",
      "body": "They are absolutely uneducated on the subject. Find a new doctor",
      "created_utc": 1708272991.0,
      "score": 200,
      "context": []
    },
    {
      "id": "kr0a11z",
      "author": "NayanaGor",
      "body": "You can ABSOLUTELY have Binge Eating Disorder AND ARFID at the same time. Doctors will not recognize it, but it is possible and it's a nightmare. I know this from experience. I lived with BED for 32 years without even knowing I had it, and it hid my arfid symptoms for ages. I had suspected the arfid due to my sensory/texture issues, food phobias and more but my weight (and some early doctors) told me it was JUST a willpower issue.\n\nI literally had no idea I was binge eating! The portions I was eating seemed normal to me based on my lived experience growing up with other binge eaters and it hid my arfid. I was getting enough calories in to maintain/gain weight because I was filling up on junk because it was all I could tolerate and I was always feeling so hungry (or depressed, a big trigger) all the time. It wasn't until I actively addressed the BE that anyone took he arfid seriously because it couldn't be hidden anymore.\n\nI recommend keeping a food journal. Not to track calories or anything like that, but to track your aversions, etc. Having it written down, consistently, can help. Doctors love data. When I gave my primary a spiral notebook listing everything I'd eaten over the 2 months between our appointments, he took my statements about arfid a lot more seriously. The information was right there.\n\nHe could SEE what I was eating, what I wasn't, and that by that point, I should have been starving to death. I could have been classed as anorexia because I started shedding weight like a winter coat in summer basically the MOMENT I addressed the BE. You shouldn't have to do that to get the medical attention you need.\n\nI'm sorry this has been so difficult.",
      "created_utc": 1708274202.0,
      "score": 44,
      "context": []
    },
    {
      "id": "kr07m3f",
      "author": "None",
      "body": "No, find a new doctor. Body weight actually has little to do with ANY eating disorders, alot of people with anorexia aren’t even technically underweight. Also yes, you can still be malnourished and overweight. This doctor sounds shitty and uneducated.",
      "created_utc": 1708273327.0,
      "score": 65,
      "context": []
    },
    {
      "id": "kr0ae5g",
      "author": "leahcar55",
      "body": "I have been diagnosed with ARFID and I am overweight. I am in the same boat alot of my safe foods are carbs ans I tend to binge those carbs, processed foods, and fast food! I would find a new doc!",
      "created_utc": 1708274330.0,
      "score": 20,
      "context": []
    },
    {
      "id": "kr09yj3",
      "author": "ohmydearlucia",
      "body": "Is this your GP or a psychiatrist? ARFID is a mental illness, so it's not really for your GP to diagnose.",
      "created_utc": 1708274177.0,
      "score": 27,
      "context": []
    },
    {
      "id": "kr07oyo",
      "author": "wynterin",
      "body": "If you look up the diagnostic criteria for ARFID in the DSM-5 it says “one or more of the following”, one of which is being underweight. Nutritional deficiency, reliance on feeding tubes or supplements, or “marked interference with psychosocial functioning” (not entirely sure what that means tbh) are the other three, so if you fit one of those then you could still fit the criteria. Weight loss/being underweight is the only one in the DSM-IV, however, so it’s possible she just has outdated information.",
      "created_utc": 1708273355.0,
      "score": 17,
      "context": []
    },
    {
      "id": "kr0cf70",
      "author": "theatregirl1987",
      "body": "Find a new Dr. I have BED and ARFID. I am overweight. I still have ARFID and have been able to get treatment. Weight loss is only one criteria and it is not a requirement.",
      "created_utc": 1708275044.0,
      "score": 6,
      "context": []
    },
    {
      "id": "kr0ls7k",
      "author": "AbundantiaTheWitch",
      "body": "I never experienced extreme weight loss with arfid because even with limited foods it’s possible to eat generally normally (using the term lightly but I mean you can still have dinner as x carbs y protein etc). Especially since most people have this since they were very young and have learned how to manage it somewhat. And that’s ignoring the high chances of safe foods being unhealthy. Weight shouldn’t be a criteria for ED diagnosis. It’s not a weight disorder",
      "created_utc": 1708278273.0,
      "score": 4,
      "context": []
    },
    {
      "id": "kr1yqkp",
      "author": "ResearcherSmooth2414",
      "body": "I was overweight as well. I find that part of the criteria a bit of a surprise. A lot of people's safe foods seem to be peanut butter sandwiches and french fries. Would've thought overweight to be more common. But it is just a criteria and you don't need to meet every one.\n\nAlso find it odd how there is people in this world that can readily comprehend Anorexia and it being a mental disorder and there being no logic (for lack of a better term) to the aversions and thinking they are fat. But when it comes to ARFID they're just like it's in your head just eat it. Even my dad (who never forced me and was accepting of it) after it became a classified disorder was like. Oh but you didn't have that it was just in your head. Like yeah, that's what a psychological disorder is. My brother to his credit. Talking to him about it the other day. Straight up said. But that wasn't your fault. You had a disorder. You couldn't help it. And when i look back, he totally got it. And i remember sitting at dinners with a plate of food i didn't want to eat and him stealing food when no one was looking so it looked like i was eating it and they didn't ask questions. Hell, a couple times he even just swapped plates at the end so i could have an empty plate in front of me.",
      "created_utc": 1708295413.0,
      "score": 5,
      "context": []
    },
    {
      "id": "kr3b2es",
      "author": "isupposeyes",
      "body": "I’m overweight BECAUSE i have ARFID and it sounds like that’s the case for you too. Your doctor is wrong. The best course of action is to say “thank you for your opinion, can you please refer me to a specialist to make sure?”",
      "created_utc": 1708315306.0,
      "score": 5,
      "context": []
    },
    {
      "id": "kr15lpq",
      "author": "peanutbutternmtn",
      "body": "I have arfid and I’ve been fat as hell. I have to workout every just to be only slightly overweight bc my diet is so bad.",
      "created_utc": 1708284952.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kr1bmh0",
      "author": "LadyFCoffee",
      "body": "i’m in a similar position to you and sometimes i feel like banging my head against the wall",
      "created_utc": 1708287087.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kr3tt6h",
      "author": "mykeuk",
      "body": "I have ARFID and I'm fat, for the exact same reasons. My safe foods are bland, simple, high carb, high sugar and high fat foods and it s killing me.\n\nTo diet I've literally had to just stop eating because I have no healthy safe foods to fall back on, except chicken.",
      "created_utc": 1708325612.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kr0g4m0",
      "author": "hopefullythiswillend",
      "body": "Everyone’s body is different. I have always been on the smaller side but I have never lost weight even when I was having other significant side effects to not eating.",
      "created_utc": 1708276335.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kr0jfnv",
      "author": "Dry_Mirror_6676",
      "body": "I’m not officially diagnosed because honestly, I don’t feel the need to be. But most of the criteria fits me almost to the t. But I am also way overweight too. Because what I eat is usually “bad” for you. I’ve lost some weight by eating less, and I’ve been expanding my diet over the last 10 years. I can now eat baby carrots!!! \n\nBut if I ever decide to try to be diagnosed, I don’t think they would because of my weight. I’m just labeled a picky eater. Even when I explain that eating something that smells, looks, or tastes certain ways will make me gag/throw up people always just get that “look” we all know.",
      "created_utc": 1708277466.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kr1bzyf",
      "author": "JurneeMaddock",
      "body": "If you like this doctor, stop talking to them about it and talk to a dietician. If you don't like this doctor, get a new doctor who will recommend you a dietician.",
      "created_utc": 1708287221.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kr206ue",
      "author": "DerNogger",
      "body": "This was the reason l didn't believe I could have it for a long time. I kept gaining and losing weight depending on my current safe foods but my record weight was 250 lbs. Ask your doc what he thinks is gonna happen when you can eat nothing but potato chips and candy for a month 😅",
      "created_utc": 1708295959.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kr237af",
      "author": "m0ldybutter",
      "body": "omg my arfid experience is basically the exact same. i have not bothered going to a doctor bc i have body dysmorphia and i just cant handle being told i’m “too fat” to have this illness. your doctor is ignorant, as are a lot of doctors when it comes to arfid. you absolutely can be overweight and have this illness. i’m also a little overweight because my safe foods are literally just junk food/fast food and i hate it but i’m too scared to get help in fear of being invalidated like this. i LOVE food, but it has to be my specific safe foods, which are mostly unhealthy unfortunately. i’m sorry this was your experience, and i’m hoping you’re able to find a doctor who actually understands this eating disorder.",
      "created_utc": 1708297100.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kr29a10",
      "author": "contactwho",
      "body": "Also, we go to sooo many places that don’t have safe foods. So I eat something before I go, then eat something safe there, and then again later bc I didn’t have a real meal.  But when I’m counting calories I’ll see despite the fact that I didn’t really eat anything it ended up being a ton of calories. Three dinner rolls off a buffet didn’t fill me up but it was hundreds of calories and I ate before and after anticipating the hunger. \n\nFuck that guy",
      "created_utc": 1708299499.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kr4ixht",
      "author": "Ok-Committee-5867",
      "body": "The arfid criteria absolutely does not say you need to have severe weight loss to be diagnosed. \nThat’s incorrect. \n\nFind someone else to talk to. I’m sorry, she’s definitely dismissing you and you deserve someone who will take you seriously. \n\nWeight has nothing to do with it. If you struggle with what you suspect is arfid symptoms, that’s what’s important. Definitely not weight loss",
      "created_utc": 1708343462.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kr4n42x",
      "author": "pearyeet",
      "body": "I could have written this myself",
      "created_utc": 1708345946.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m55lv0v",
      "author": "UrDoinGood2",
      "body": "Lmao",
      "created_utc": 1735894140.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kr5iwa5",
      "author": "christina327",
      "body": "I mean what is your doctor supposed to say? Of course they’re going to say to eat healthy and exercise. They’re not going to say it’s OK to continue to eat limited foods that are unhealthy.",
      "created_utc": 1708359168.0,
      "score": 0,
      "context": []
    },
    {
      "id": "kr2ypa9",
      "author": "daisytire",
      "body": "weight loss has nothing to do with arfid besides *some* people becoming underweight from not eating, but that is not the diagnostic criteria, just a symptom... super weird. find a second opinion!!",
      "created_utc": 1708309897.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kr33ome",
      "author": "black_dragonfly13",
      "body": "If your doctor doesn't listen to you/dismisses your concerns, it's time to find a new doctor. Whatever your concern is (ARFID in this specific situation, unexplained pain, anything at all), if you're not being listened to, believed, and respected, it's time for a new doctor. \n\nI wholeheartedly agree with the other commenters who are also telling you to find a new doc., one who will listen to you. Your concerns are valid, and deserve to be treated as such.",
      "created_utc": 1708312024.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kr41x7j",
      "author": "jorwyn",
      "body": "Mine had no issues with me being fat and having ARFID. To him, of course both could be true because all my safe foods were high carb. \n\nThe whole thing went like this, \"so, I was talking to someone online who eats different foods, but is so much like me. She said she has something called ARFID, so I learned more about it. It really sounds like me.\" Him, \"that makes sense. You want therapy?\" Yes! \n\nCan't say the therapy has been easy, but when I look back to that conversation over a year ago, where I was then, and where I am now, I am doing a lot better! I still struggle, I won't lie, but I am eating better and have even lost a bit of weight.",
      "created_utc": 1708331152.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kr43wl8",
      "author": "fairypupp",
      "body": "you don’t have to lose any amount of weight to be diagnosed with any ED. i was diagnosed w/anorexia as a teenager and i was fat then and i still am, just goes to show you weight really isn’t usually calories in/calories out. EDs are diagnosed based on behaviors (although i think i did get dx’d with “atypical anorexia” which is kinda silly)",
      "created_utc": 1708332611.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kr45df7",
      "author": "Carlulua",
      "body": "That's stupid. As an example, someone could have a diet where they can only eat 5 different foods and all of them could be foods that contribute to weight gain or the person could just eat a lot of those foods.",
      "created_utc": 1708333696.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kr6d877",
      "author": "TheZombieBat",
      "body": "I’m someone who’s overweight and has ARFID and binge eating disorder. It doesn’t help that I have a lot of dietary restrictions (vegetarian, no dairy) so a lot of what I eat is pasta and potato based.",
      "created_utc": 1708369244.0,
      "score": 1,
      "context": []
    },
    {
      "id": "krdyf08",
      "author": "ConstructionAfraid17",
      "body": "I would just like to take a moment to say I’m proud of you for branching out and trying some new protein! That is such a massive step. Addressing the emotional triggers, and the past trauma that you’ve experienced, those big steps and I just wanted to say that not only am I proud of you, but I want you to take a moment have a deep breath, and be proud of yourself. You have come such a long way, and the road ahead may seem scary but please know you’re not alone. I don’t know how to private message people on this app, but please message me if you want to! I hope that’s not against the guidelines 😅\nDoctors have to follow very strict criteria to diagnose patients with certain things however, just because the doctor couldn’t “technically” diagnose you with ARFID doesn’t mean they couldn’t validate your experience. I have gone through anorexia (and still struggle with it) and it’s not documented in my chart at all and neither is ARFID all because I’ve been overweight my whole life. The only reason I’ve started to lose weight is because of the jaw pain and swallowing pain I’ve been experiencing. \nI guess what I’m trying to say is sometimes the people society tells us will have the answers and will validate our experiences are the ones who can hurt us, and traumatize us the most. Physicians don’t always have all the answers, but they’ve been trained to say they do. I live by the philosophy that it’s OK to say that you’re uneducated on a certain topic and unable to have an opinion on it. \nMy suggestion is if you have a patient portal or a way of emailing the office, just something in writing. And document what happened. Here’s a little template I made up for ya. \n“ Hi my name is X, DOB is DATE. I was following up to ensure that my visit with Dr. Name had all the documentation from our visit. Specifically concerning our conversation about XYZ, where at Dr. name informed me I did not meet the criteria for X diagnosis. I’d be very appreciative of a copy of the doctor's notes from my last visit. I’m more than happy to fill out a Medical Records release form. My best contact number is blank. Thank you for your time.”\nAnd always remember just because you’re upset with a doctor, please don’t take it out on the office staff❤️ and if you have a complaint against a doctor, the best person to ask for is the practice/office administrator. 😘\nSorry for the long post, I hope that I could make you feel a bit of validation in your experiences. Unfortunately, our healthcare system has a lot of issues and having a chronic illness means advocating for yourself every single day. And I hope that I made it just a little bit easier for you to do that.",
      "created_utc": 1708480549.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kr07afl",
      "author": "sjd208",
      "body": "Seriously, this doctor is woefully uneducated. You can be overweight and anorexic too.",
      "created_utc": 1708273211.0,
      "score": 56,
      "context": [
        {
          "id": "kr06oq5",
          "author": "luminousrobot",
          "body": "They are absolutely uneducated on the subject. Find a new doctor",
          "created_utc": 1708272991.0
        }
      ]
    },
    {
      "id": "krqi6uv",
      "author": "Rainyli",
      "body": "Not exactly the same thing but I find your story oddly validating. I see a lot of people with ARFID talking about how they hate food and eating in general, while I actually love eating as long as I'm eating my safe foods. Your suggestion about a food journal is a great idea too, I'm gonna try that! :)",
      "created_utc": 1708674469.0,
      "score": 3,
      "context": [
        {
          "id": "kr0a11z",
          "author": "NayanaGor",
          "body": "You can ABSOLUTELY have Binge Eating Disorder AND ARFID at the same time. Doctors will not recognize it, but it is possible and it's a nightmare. I know this from experience. I lived with BED for 32 years without even knowing I had it, and it hid my arfid symptoms for ages. I had suspected the arfid due to my sensory/texture issues, food phobias and more but my weight (and some early doctors) told me it was JUST a willpower issue.\n\nI literally had no idea I was binge eating! The portions I was eating seemed normal to me based on my lived experience growing up with other binge eaters and it hid my arfid. I was getting enough calories in to maintain/gain weight because I was filling up on junk because it was all I could tolerate and I was always feeling so hungry (or depressed, a big trigger) all the time. It wasn't until I actively addressed the BE that anyone took he arfid seriously because it couldn't be hidden anymore.\n\nI recommend keeping a food journal. Not to track calories or anything like that, but to track your aversions, etc. Having it written down, consistently, can help. Doctors love data. When I gave my primary a spiral notebook listing everything I'd eaten over the 2 months between our appointments, he took my statements about arfid a lot more seriously. The information was right there.\n\nHe could SEE what I was eating, what I wasn't, and that by that point, I should have been starving to death. I could have been classed as anorexia because I started shedding weight like a winter coat in summer basically the MOMENT I addressed the BE. You shouldn't have to do that to get the medical attention you need.\n\nI'm sorry this has been so difficult.",
          "created_utc": 1708274202.0
        }
      ]
    },
    {
      "id": "kr0dsh5",
      "author": "No-Register-1283",
      "body": "This was my GP who I talked to because I talked to my psychiatrist first and she hadn't heard of it lol",
      "created_utc": 1708275527.0,
      "score": 13,
      "context": [
        {
          "id": "kr09yj3",
          "author": "ohmydearlucia",
          "body": "Is this your GP or a psychiatrist? ARFID is a mental illness, so it's not really for your GP to diagnose.",
          "created_utc": 1708274177.0
        }
      ]
    },
    {
      "id": "kr0cnpz",
      "author": "theatregirl1987",
      "body": "I'm assuming the marked interference thing is about how it's difficult to go out to eat or sometimes even eat in front of other people",
      "created_utc": 1708275127.0,
      "score": 10,
      "context": [
        {
          "id": "kr07oyo",
          "author": "wynterin",
          "body": "If you look up the diagnostic criteria for ARFID in the DSM-5 it says “one or more of the following”, one of which is being underweight. Nutritional deficiency, reliance on feeding tubes or supplements, or “marked interference with psychosocial functioning” (not entirely sure what that means tbh) are the other three, so if you fit one of those then you could still fit the criteria. Weight loss/being underweight is the only one in the DSM-IV, however, so it’s possible she just has outdated information.",
          "created_utc": 1708273355.0
        }
      ]
    },
    {
      "id": "kr0dp0m",
      "author": "No-Register-1283",
      "body": "Yeah I definitely have the \"marked interference with psychosocial functioning\" lol. Going out to eat can be a nightmare. My partner and friends basically just let me pick where we go because they know if they choose I might not be able to eat. Sometimes we go for Chinese and I just eat a bowl of white rice. I feel so guilty about it. (I probably have severe nutritional deficiencies but my doctor won't do blood work for it so I don't really know.)",
      "created_utc": 1708275493.0,
      "score": 9,
      "context": [
        {
          "id": "kr07oyo",
          "author": "wynterin",
          "body": "If you look up the diagnostic criteria for ARFID in the DSM-5 it says “one or more of the following”, one of which is being underweight. Nutritional deficiency, reliance on feeding tubes or supplements, or “marked interference with psychosocial functioning” (not entirely sure what that means tbh) are the other three, so if you fit one of those then you could still fit the criteria. Weight loss/being underweight is the only one in the DSM-IV, however, so it’s possible she just has outdated information.",
          "created_utc": 1708273355.0
        }
      ]
    },
    {
      "id": "kre0djn",
      "author": "ConstructionAfraid17",
      "body": "They could at least validate their experience. \nAnd then referring to a therapist who specializes in nutrition or nutrition deficiencies… Or referring to just a nutritionist who has experience with eating disorders. \nYes, a doctor is going to say to eat healthy. But you also have to consider someone’s mental health and physical health. If you take away all of someone’s safe foods and give them no other options but conform or die, you’re essentially sentencing them to death because you’re not giving them any tools to succeed. Being a doctor shouldn’t be stating the facts at patients. It should be helping patients get to sustainable place and sometimes that takes years.",
      "created_utc": 1708481309.0,
      "score": 1,
      "context": [
        {
          "id": "kr5iwa5",
          "author": "christina327",
          "body": "I mean what is your doctor supposed to say? Of course they’re going to say to eat healthy and exercise. They’re not going to say it’s OK to continue to eat limited foods that are unhealthy.",
          "created_utc": 1708359168.0
        }
      ]
    },
    {
      "id": "kr0fu5f",
      "author": "SadisticGoose",
      "body": "Atypical anorexia is essentially anorexia without being underweight. I had it, but even when I went into treatment they refused to diagnose me with anorexia because I was overweight. They really didn’t know what to do with me since I’d had multiple eating disorders and mixed symptoms. The whole reason I became anorexic was to move from overweight to a normal weight. \n\nI don’t technically meet the diagnostic criteria for ARFID anymore, but I still experience enough symptoms that it doesn’t matter. I still have an eating disorder.",
      "created_utc": 1708276236.0,
      "score": 36,
      "context": [
        {
          "id": "kr06oq5",
          "author": "luminousrobot",
          "body": "They are absolutely uneducated on the subject. Find a new doctor",
          "created_utc": 1708272991.0
        },
        {
          "id": "kr07afl",
          "author": "sjd208",
          "body": "Seriously, this doctor is woefully uneducated. You can be overweight and anorexic too.",
          "created_utc": 1708273211.0
        }
      ]
    },
    {
      "id": "krrp0e7",
      "author": "NayanaGor",
      "body": "Exactly! ARFID is a little different for everyone, and it has lots of different aspects and presentations. Regardless of how it develops or presents, we all deserve a little compassion and understanding 💜",
      "created_utc": 1708698674.0,
      "score": 2,
      "context": [
        {
          "id": "kr0a11z",
          "author": "NayanaGor",
          "body": "You can ABSOLUTELY have Binge Eating Disorder AND ARFID at the same time. Doctors will not recognize it, but it is possible and it's a nightmare. I know this from experience. I lived with BED for 32 years without even knowing I had it, and it hid my arfid symptoms for ages. I had suspected the arfid due to my sensory/texture issues, food phobias and more but my weight (and some early doctors) told me it was JUST a willpower issue.\n\nI literally had no idea I was binge eating! The portions I was eating seemed normal to me based on my lived experience growing up with other binge eaters and it hid my arfid. I was getting enough calories in to maintain/gain weight because I was filling up on junk because it was all I could tolerate and I was always feeling so hungry (or depressed, a big trigger) all the time. It wasn't until I actively addressed the BE that anyone took he arfid seriously because it couldn't be hidden anymore.\n\nI recommend keeping a food journal. Not to track calories or anything like that, but to track your aversions, etc. Having it written down, consistently, can help. Doctors love data. When I gave my primary a spiral notebook listing everything I'd eaten over the 2 months between our appointments, he took my statements about arfid a lot more seriously. The information was right there.\n\nHe could SEE what I was eating, what I wasn't, and that by that point, I should have been starving to death. I could have been classed as anorexia because I started shedding weight like a winter coat in summer basically the MOMENT I addressed the BE. You shouldn't have to do that to get the medical attention you need.\n\nI'm sorry this has been so difficult.",
          "created_utc": 1708274202.0
        },
        {
          "id": "krqi6uv",
          "author": "Rainyli",
          "body": "Not exactly the same thing but I find your story oddly validating. I see a lot of people with ARFID talking about how they hate food and eating in general, while I actually love eating as long as I'm eating my safe foods. Your suggestion about a food journal is a great idea too, I'm gonna try that! :)",
          "created_utc": 1708674469.0
        }
      ]
    },
    {
      "id": "kr0h7ac",
      "author": "fishymcswims",
      "body": "Find a psychiatrist or therapist (or both!) who specialize in eating disorders. \n\nGPS/PCPs/family medicine, etc… do not have much training in psychiatry and mental health past medical school, as it is often an optional rotation during residency, or any training that is included is relatively brief. (This may not apply to all, but from the doctors I’ve talked to at work, it’s what I’ve learned from them.)  However, it’s understandable that for a lot of patients, GPs are the first place many go to when seeking help for mental health concerns.  It’s why I suggest seeking a mental health professional.  And even then, mental health professionals don’t always have experience or certification working with certain disorders, hence your psychiatrist who wasn’t familiar with ARFID.",
      "created_utc": 1708276705.0,
      "score": 13,
      "context": [
        {
          "id": "kr09yj3",
          "author": "ohmydearlucia",
          "body": "Is this your GP or a psychiatrist? ARFID is a mental illness, so it's not really for your GP to diagnose.",
          "created_utc": 1708274177.0
        },
        {
          "id": "kr0dsh5",
          "author": "No-Register-1283",
          "body": "This was my GP who I talked to because I talked to my psychiatrist first and she hadn't heard of it lol",
          "created_utc": 1708275527.0
        }
      ]
    }
  ]
}