{
  "id": "1b8ppuw",
  "subreddit": "ARFID",
  "author": "None",
  "created_utc": 1709800571.0,
  "title": "ARFID is holding me back romantically",
  "selftext": "I'm in bed right now just thinking and I'm so incredibly upset. I broke off a ~3 year relationship in 2022, and am just now getting to a place where I am thinking about looking for another romantic relationship. The main thing holding me back seems to be ARFID. I can't go on dates to restaraunts, even when I go with friends it's an incredibly embarrassing experience and \"picky eating\" is a big turnoff to what feels like the vast majority of people. Every other person on dating apps describe themselves as a \"foodie\" or have writing in their bio that says things like \"let me cook for you\". If I wanted to go out with them, I worry they'd feel the need to cater to my limitations rather than choose something they like and they'd begin to resent me for that, or feel embarrased by me. My negative feelings are further compounded by the fact that in a conversation earlier today the person I'm romantically interested in described ARFID as a major factor in a previous relationship ending. This person knows about my autism/ARFID but it seems they don't understand the full extent. I'm really into this person and I wish I could go on restaurant dates with them and eat some of their cooking but I just can't and I'm so sad. I want to try new foods, I want to be \"normal\", but I can't. Even thinking about trying the most basic staples (pasta, pizza, cheese, bread, etc) fills me with so much anxiety when I imagine the potential taste/textures in my mouth. If I can't even try that how can I try something like eggplant parmesan (their favorite dish)?  \n\nTldr; Romantic, even platonic relationships seem to have food as a central, crucial aspect to enjoy together and bond over and it's just not something that's possible for me and I am incredibly upset. Sorry for wall of text.",
  "url": "https://www.reddit.com/r/ARFID/comments/1b8ppuw/arfid_is_holding_me_back_romantically/",
  "score": 97,
  "num_comments": 28,
  "comments": [
    {
      "id": "ktqx8gu",
      "author": "thrivingsad",
      "body": "To be honest, I’ve never really had an issue with ARFID holding me back romantically. I may be an outlier on that, but my long term boyfriend has been kinda wonderful. \n\nMy boyfriend is someone with a wide palette. Being Hispanic, he has a ton of cultural foods & whatnot that he enjoys and has. He doesn’t expect me to eat his food, because he respects my limits & always says he’s just happy I am spending time with him above all else. I don’t know if he’s considered a foodie but he’s someone who loves trying foods & making all sorts of assortments of meals\n\nWe don’t do any form of food dates— we do hobby dates. Hobby dates allow us to focus on our interests or develop a new interest. It’s a lot more involved and feels more like you learn about one another by doing it rather than just… sitting and eating. Frankly I find sitting still and speaking to someone whilst anxiously waiting in a restaurant full of overwhelming things to be the least romantic thing… however I also am very autistic\n\nI also feel dating is more successful if you know a person from a hobby group rather than date randoms online a majority of the time. In the group environment there’s a lot less pressure and the same common interest— whatever hobby is being participated in. It just allows for a better understanding of one another and feels easier to bond naturally\n\nEither way…\n\nIf someone doesn’t date you solely because of something out of your control, they likely aren’t the type of people you want to be dating in the first place. Being a partner means boundaries & acceptance & middle grounds.\n\nI need to pace, alone, in the kitchen, while I eat. So usually I will eat my meal before my boyfriend. My boyfriend likes to eat around others, so when he eats I will simply be with him wherever he’s eating and engage with him. That is our middle ground \n\nAnyway, good luck!!",
      "created_utc": 1709806986.0,
      "score": 46,
      "context": []
    },
    {
      "id": "ktrsfkv",
      "author": "Wellslapmesilly",
      "body": "Normally I would agree with most of these comments about it being something that can be overcome. However, this person is flat out telling you that ARFID was a major factor in ending their previous relationship. This is someone who has already dealt with it and found it too difficult. Unfortunately it does not bode well, sorry.",
      "created_utc": 1709822585.0,
      "score": 28,
      "context": []
    },
    {
      "id": "ktrkbyh",
      "author": "PrematureGrandma",
      "body": "I’m a huuuuuge foodie and very adventurous eater and I’m happily married to a partner with ARFID. Before we dated I was absolutely the kind of person that said I would never Date someone who was a picky eater, and I placed a lot of stock in that, but it’s funny when you meet the right person you just realize how little that kind of stuff matters. \n\nI totally accept my partners eating habits now, and I advocate for them. I don’t tolerate people making fun of picky eaters around me. I’m still a huge foodie, and through our relationship my partner has also started to evolve into a foodie and has vastly grown their list of safe foods, which is awesome! But I also want to be clear I’ve never pushed them into that, or required it, I think I’ve just given them total acceptance when it comes to their food choices, so they feel less pressure and in turn will be more open to trying new things. \n\nAnyway, long answer to say; it’s not make or break. And even the people that may think they care, will realize they don’t care when it comes down to it. So good luck :)",
      "created_utc": 1709819414.0,
      "score": 19,
      "context": []
    },
    {
      "id": "ktqpobc",
      "author": "FeivelM",
      "body": "I’m sorry, and I know it’s frustrating, I think most of us would absolutely press the “off” button if we could. If it’s any consolation, my fiance doesn’t have ARFID but is absolutely not a foodie and I don’t feel it has got in the way of our relationship at all. \n\nBut is there anything you can work around at restaurants? If you find someone who isn’t that into food (I think I would actively avoid someone who describes themselves as a foodie), even if for the first couple of times you steer them towards somewhere you could at least have a side order or something, that might help rather than ruling out going to restaurants altogether?",
      "created_utc": 1709801433.0,
      "score": 11,
      "context": []
    },
    {
      "id": "ktrbbts",
      "author": "Alarow",
      "body": "Man, same, so much the same\n\nIt's a deal breaker for almost everyone, you have to constantly move the goalpost whenever the discussison is about food, it's such a fucking pain in the ass",
      "created_utc": 1709815385.0,
      "score": 10,
      "context": []
    },
    {
      "id": "ktsuwul",
      "author": "jizzyjazz2",
      "body": "i know this may not be a popular sentiment in this comment section, but in my experience arfid absolutely severly limits your pool of potential partners when you're interested in dating. forget dating apps, forget meeting people naturally and attending a casual get-together with no weird hiccups or conditions, and forget attempting to make a good impression on anyone when you love them. the fact that you have a problem with food is always a factor that stains the experience in the vast majority of cases, and this goes beyond just romantic relationships.\n\nthe only option left is to operate on the hope that you'll eventually find \"the one\" who both loves you unconditionally and completely accepts your baggage. i know this is what probably happened to a lot of people here, but i think even they would agree that something like this happening is super circumstantial and luck based. you can't force finding someone who is that open and caring, as most people look for *their* version of a perfect partner\n\nit certainly stings to be considered conventionally difficult to date, and in my time it has brought on great loneliness, but i've managed to cope with it lately. just my personal experience",
      "created_utc": 1709835949.0,
      "score": 10,
      "context": []
    },
    {
      "id": "ktsqd6f",
      "author": "peanutbutternmtn",
      "body": "I’m married, have arfid and my wife is a foodie. It’s doable my friend.",
      "created_utc": 1709834467.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ktu5fok",
      "author": "baby-the-T",
      "body": "I used to only do outings that didn't involve food which was really hard at first but definitely got easier. Food is so social but doing things like picnics where you bring your own food, going out just for coffee or a drink if you can tolerate that. I found going on walks, playing games, doing arts and crafts, creating little adventures around your city, taking a class together, swimming, and plenty of other non food activities are great. Also if there is a food you like and can eat you can center activities around those foods. If you're okay with popcorn, go to a movie. If you like boba tea get a drink and walk in a park, if you can do simple fast foods going to those places for a snack while you're out and about works too. That all just buys you time until you really know the person and are ready to tell them more about arfid and how it affects you.",
      "created_utc": 1709852840.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ktularw",
      "author": "jollyBrownDoggo",
      "body": "I used to think this too, I used to think that ARFID made me unworthy of love.\n\nBut there came a point where I just wanted to live my life and I didn’t want to let it control me and I put myself out there.\n\nI am now happily in a relationship with someone who is almost as picky as I am and we share many of the same food preferences.\n\nI have friends that are foodies who go out of their way to accommodate me, even though I don’t ask for it.\n\nI’ve realized that the right people will find you, as long as you put yourself out there a bit",
      "created_utc": 1709859963.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ktv9bjh",
      "author": "athey",
      "body": "I have no really useful advice. I was lucky in that my husband is allergic to the world, and his allergies overlapped with a lot of my ‘no-go’ foods.  It was wonderful at restaurants. I could use his allergies to justify some of my ‘picky’ eating choices. \n\nMaybe find a person with a lot of food allergies?  lol",
      "created_utc": 1709869497.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ktvxiu9",
      "author": "Dramatic-Growth1335",
      "body": "This was my main motivation to try new foods. I had an incredibly restrictive diet. I hadn't even used a knife and fork before the age of 24. \nGetting over the psychological barrier to allow yourself to try new foods is the hardest bit. But it's just a hump. Once you are over it you realise food isn't scary. You get used to things tasting bad and you can just chew and swallow. You get used to being surprised and finding things you like! \nI'm still not a fan of most red meats but I don't think there is a vegetable I dont like. \n\nGood luck",
      "created_utc": 1709881895.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ktsufaz",
      "author": "Killinemsmallz212",
      "body": "I imagine this experience with having your ARFID ending a previous relationship and is affecting your current love interest is triggering and I think is a good thing that you are acknowledging that so you could avoid the pattern of getting into these types of relationships. I personally have just learned about this being a diagnosis so before I would describe it as an extreme version of picky eating and be real upfront about it. Same thing I do with my other mental illnesses. I have used it in a sense of humor/ice breaker type convo to get a feel for how they respond. I have even put it as a joking part in dating apps in my about me. The successful relationships I have had before the person found it interesting part of me and want to know more. I would say especially adding in autism you need a partner that is patient and understanding and some people are just not that type of person. It really does suck and is embarrassing but if the person is really interested they wouldn’t view it as a deal breaker. My current gf has seen me have to spit out bites of food or return something I just couldn’t eat. If I’m going out to dinner with a group I would just eat before and then go for drinks or just have bread. I try not to let my food limitations dictate where we go unless I’m desperately hungry I just plan around the outing. Definitely not convenient and it does make dating difficult but if your partner doesn’t understand or isn’t willing to the relationship probably isn’t going to go anywhere long term",
      "created_utc": 1709835791.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kttqkla",
      "author": "Rare_Version6127",
      "body": "It is tough, but you will find someone who understands & would never resent you or judge you for it or anything! I still feel bad for my partner dealing with me all the time, he made pork chops the other night, which i really struggle with the texture of, i nearly threw up trying to force myself to eat it and ended up only eating the side dish. He cooks nearly every night, and has no problems making changes or making something different for me, and doesnt take it to heart when i cant get myself to eat what hes made. I hope you find that person for yourself soon!💕",
      "created_utc": 1709847715.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kttzs4y",
      "author": "kendraro",
      "body": "I just want to give a different perspective, what you have is a medical condition that is not all that different from the food allergies that I have. I don't feel bad about not eating food that will make me sneeze my head off (sorry if it inconveniences anyone but tough) and you should not feel bad either. Anyone who cares about you will understand. Look at it as a good way to weed out unkind people.",
      "created_utc": 1709850815.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ktx8zpq",
      "author": "lilburblue",
      "body": "The social aspect was one of the reasons I ended up seeking treatment. It was extremely isolating and having to discuss my eating habits with people whenever we went out made it significantly worse. My partner has never been bothered by my eating and after 7 years the point that finally made him ask me to reach out for help was the meltdown I had on the way to a work dinner with a set menu. \n\nThe person at eating disorder clinic was extremely compassionate and makes it a point to remind me every single time I struggle with this that it’s a medical condition, I’m not being ‘difficult’, and I don’t need to justify something being challenging to me. Every time I mentioned how it would be seen as rude to not eat at people’s homes, or to bring my own food she kept saying “Your FRIENDS will NOT care they will just be glad you’re eating.” \n\nAnother commenter actually made me laugh as they mentioned needing to pace in the kitchen to eat and same. This sub alone really helped me with being kinder to myself and realising I’m not “the only one”.",
      "created_utc": 1709909916.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ktz4tmw",
      "author": "Arccturus",
      "body": "It's something I think about all the time too as somebody who's never had a relationship and unfortunately there's no denying that for us with ARFID the dating scene is certainly more difficult. However that's not to say it's impossible. My best friend dates a girl with ARFID and whilst my friend is not a huge foodie, their relationship is really strong and ARFID has never been an issue within it. So it's possible to date with ARFID, and if it's possible than it's possible for you. Hobby dates as recommended below are certainly the way to go however if really is just luck as to whether or not the other person is willing to accommodate that. But I feel like if you meet someone away from anything food related then you'll have a much better chance being able to form something than if you meet someone on an app who most likely would expect a restaurant date as the first date.",
      "created_utc": 1709932670.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ktzyk9n",
      "author": "iambrahman1111",
      "body": "Wow! I swear I feel like I could have written this myself. It’s the hardest thing i deal with on a daily basis by a long shot. And every time I try to date I have all the same concerns as you do. It’s an awful feeling. The other day my favorite coworker told me he was going to take me out to eat and that we were going to chow down on all this stuff and I just hate having to go into details about being “picky”…. So I just don’t. And now I’ve been avoiding him. I can totally relate to your post on so many levels. It actually gave me a strange sense of relief to read so I hope me telling you are not alone gives you some type of relief too. Best of luck. Sending positive thoughts your way",
      "created_utc": 1709943641.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ku1yor5",
      "author": "2anonym00se1",
      "body": "My line is \"I have a ton of dietary restrictions and I usually eat before leaving the house. I'd love to hang out with you at a restaurant but I probably won't eat anything.\" If I'm asked to clarify I say \"I'd rather not get into it. I'm just very limited in what I can eat and prefer to prepare my own food.\" I don't try to explain ARFID because people really tend to not get it and trying to explain is so emotionally draining it's not worth it to me.\n\nI try to be casual and non-apologetic and just set the expectation that I probably won't eat. I've learned to not mind the awkwardness of being in a restaurant and just having a soda and socializing. And I usually have a snack and a nutrition drink with me in case I get hungry.\n\nI've dated foodies who express sadness that they can't cook for me and I say \"Yeah, that makes me sad too. But no, you can't cook for me.\" I imagine that's a dealbreaker/incompatibility for some people, but I've had really positive relationships with foodies who are okay with me not sharing that hobby.",
      "created_utc": 1709980897.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ktqzdx8",
      "author": "APleasantMartini",
      "body": "Nope.",
      "created_utc": 1709808497.0,
      "score": -4,
      "context": []
    },
    {
      "id": "kts6ic8",
      "author": "Mysterious-Bird4364",
      "body": "That's excellent advice.",
      "created_utc": 1709827495.0,
      "score": 7,
      "context": [
        {
          "id": "ktqx8gu",
          "author": "thrivingsad",
          "body": "To be honest, I’ve never really had an issue with ARFID holding me back romantically. I may be an outlier on that, but my long term boyfriend has been kinda wonderful. \n\nMy boyfriend is someone with a wide palette. Being Hispanic, he has a ton of cultural foods & whatnot that he enjoys and has. He doesn’t expect me to eat his food, because he respects my limits & always says he’s just happy I am spending time with him above all else. I don’t know if he’s considered a foodie but he’s someone who loves trying foods & making all sorts of assortments of meals\n\nWe don’t do any form of food dates— we do hobby dates. Hobby dates allow us to focus on our interests or develop a new interest. It’s a lot more involved and feels more like you learn about one another by doing it rather than just… sitting and eating. Frankly I find sitting still and speaking to someone whilst anxiously waiting in a restaurant full of overwhelming things to be the least romantic thing… however I also am very autistic\n\nI also feel dating is more successful if you know a person from a hobby group rather than date randoms online a majority of the time. In the group environment there’s a lot less pressure and the same common interest— whatever hobby is being participated in. It just allows for a better understanding of one another and feels easier to bond naturally\n\nEither way…\n\nIf someone doesn’t date you solely because of something out of your control, they likely aren’t the type of people you want to be dating in the first place. Being a partner means boundaries & acceptance & middle grounds.\n\nI need to pace, alone, in the kitchen, while I eat. So usually I will eat my meal before my boyfriend. My boyfriend likes to eat around others, so when he eats I will simply be with him wherever he’s eating and engage with him. That is our middle ground \n\nAnyway, good luck!!",
          "created_utc": 1709806986.0
        }
      ]
    },
    {
      "id": "ktsay36",
      "author": "Prettynoises",
      "body": "Exactly this, my partner and I met through a hobby (music) and we both have autism, so if one or the other doesn't like certain foods we don't make a big deal out of it. We just try to meet our needs however we can and do other things for fun.",
      "created_utc": 1709829186.0,
      "score": 4,
      "context": [
        {
          "id": "ktqx8gu",
          "author": "thrivingsad",
          "body": "To be honest, I’ve never really had an issue with ARFID holding me back romantically. I may be an outlier on that, but my long term boyfriend has been kinda wonderful. \n\nMy boyfriend is someone with a wide palette. Being Hispanic, he has a ton of cultural foods & whatnot that he enjoys and has. He doesn’t expect me to eat his food, because he respects my limits & always says he’s just happy I am spending time with him above all else. I don’t know if he’s considered a foodie but he’s someone who loves trying foods & making all sorts of assortments of meals\n\nWe don’t do any form of food dates— we do hobby dates. Hobby dates allow us to focus on our interests or develop a new interest. It’s a lot more involved and feels more like you learn about one another by doing it rather than just… sitting and eating. Frankly I find sitting still and speaking to someone whilst anxiously waiting in a restaurant full of overwhelming things to be the least romantic thing… however I also am very autistic\n\nI also feel dating is more successful if you know a person from a hobby group rather than date randoms online a majority of the time. In the group environment there’s a lot less pressure and the same common interest— whatever hobby is being participated in. It just allows for a better understanding of one another and feels easier to bond naturally\n\nEither way…\n\nIf someone doesn’t date you solely because of something out of your control, they likely aren’t the type of people you want to be dating in the first place. Being a partner means boundaries & acceptance & middle grounds.\n\nI need to pace, alone, in the kitchen, while I eat. So usually I will eat my meal before my boyfriend. My boyfriend likes to eat around others, so when he eats I will simply be with him wherever he’s eating and engage with him. That is our middle ground \n\nAnyway, good luck!!",
          "created_utc": 1709806986.0
        }
      ]
    },
    {
      "id": "ktsayge",
      "author": "Prettynoises",
      "body": "Exactly this, my partner and I met through a hobby (music) and we both have autism, so if one or the other doesn't like certain foods we don't make a big deal out of it. We just try to meet our needs however we can and do other things for fun.",
      "created_utc": 1709829191.0,
      "score": 4,
      "context": [
        {
          "id": "ktqx8gu",
          "author": "thrivingsad",
          "body": "To be honest, I’ve never really had an issue with ARFID holding me back romantically. I may be an outlier on that, but my long term boyfriend has been kinda wonderful. \n\nMy boyfriend is someone with a wide palette. Being Hispanic, he has a ton of cultural foods & whatnot that he enjoys and has. He doesn’t expect me to eat his food, because he respects my limits & always says he’s just happy I am spending time with him above all else. I don’t know if he’s considered a foodie but he’s someone who loves trying foods & making all sorts of assortments of meals\n\nWe don’t do any form of food dates— we do hobby dates. Hobby dates allow us to focus on our interests or develop a new interest. It’s a lot more involved and feels more like you learn about one another by doing it rather than just… sitting and eating. Frankly I find sitting still and speaking to someone whilst anxiously waiting in a restaurant full of overwhelming things to be the least romantic thing… however I also am very autistic\n\nI also feel dating is more successful if you know a person from a hobby group rather than date randoms online a majority of the time. In the group environment there’s a lot less pressure and the same common interest— whatever hobby is being participated in. It just allows for a better understanding of one another and feels easier to bond naturally\n\nEither way…\n\nIf someone doesn’t date you solely because of something out of your control, they likely aren’t the type of people you want to be dating in the first place. Being a partner means boundaries & acceptance & middle grounds.\n\nI need to pace, alone, in the kitchen, while I eat. So usually I will eat my meal before my boyfriend. My boyfriend likes to eat around others, so when he eats I will simply be with him wherever he’s eating and engage with him. That is our middle ground \n\nAnyway, good luck!!",
          "created_utc": 1709806986.0
        }
      ]
    },
    {
      "id": "ktwhw2f",
      "author": "None",
      "body": "Thank you for your advice and for sharing your experience. I feel a bit more level-headed now that I'm fully post-meltdown, and I realize that in past relationships I've never had food as a common interest, and have fully enjoyed those relationships while they lasted, with the relationship-ending factors being completely unrelated to food. Those past relationships have also all started organically through friends/hobbies, not through apps or actively seeking a relationship. I think you're right that hobby groups and such might be the way to go for me, not apps/randoms. \n\nI also agree that I should find someone that accepts this part of me and is willing to work with me as I try to expand my diet. Yesterday was a catalyst into me finally looking into counseling so that I can at least be able to eat enough foods to keep me healthy. I am just sad to potentially have to cut my losses with my current \"situationship\".\n\nThank you again for your kind and detailed response.",
      "created_utc": 1709897175.0,
      "score": 3,
      "context": [
        {
          "id": "ktqx8gu",
          "author": "thrivingsad",
          "body": "To be honest, I’ve never really had an issue with ARFID holding me back romantically. I may be an outlier on that, but my long term boyfriend has been kinda wonderful. \n\nMy boyfriend is someone with a wide palette. Being Hispanic, he has a ton of cultural foods & whatnot that he enjoys and has. He doesn’t expect me to eat his food, because he respects my limits & always says he’s just happy I am spending time with him above all else. I don’t know if he’s considered a foodie but he’s someone who loves trying foods & making all sorts of assortments of meals\n\nWe don’t do any form of food dates— we do hobby dates. Hobby dates allow us to focus on our interests or develop a new interest. It’s a lot more involved and feels more like you learn about one another by doing it rather than just… sitting and eating. Frankly I find sitting still and speaking to someone whilst anxiously waiting in a restaurant full of overwhelming things to be the least romantic thing… however I also am very autistic\n\nI also feel dating is more successful if you know a person from a hobby group rather than date randoms online a majority of the time. In the group environment there’s a lot less pressure and the same common interest— whatever hobby is being participated in. It just allows for a better understanding of one another and feels easier to bond naturally\n\nEither way…\n\nIf someone doesn’t date you solely because of something out of your control, they likely aren’t the type of people you want to be dating in the first place. Being a partner means boundaries & acceptance & middle grounds.\n\nI need to pace, alone, in the kitchen, while I eat. So usually I will eat my meal before my boyfriend. My boyfriend likes to eat around others, so when he eats I will simply be with him wherever he’s eating and engage with him. That is our middle ground \n\nAnyway, good luck!!",
          "created_utc": 1709806986.0
        }
      ]
    },
    {
      "id": "kts6siz",
      "author": "Mysterious-Bird4364",
      "body": "Agree. I think you can overcome this fear of relationships but not with someone who has their own baggage about food",
      "created_utc": 1709827593.0,
      "score": 8,
      "context": [
        {
          "id": "ktrsfkv",
          "author": "Wellslapmesilly",
          "body": "Normally I would agree with most of these comments about it being something that can be overcome. However, this person is flat out telling you that ARFID was a major factor in ending their previous relationship. This is someone who has already dealt with it and found it too difficult. Unfortunately it does not bode well, sorry.",
          "created_utc": 1709822585.0
        }
      ]
    },
    {
      "id": "ktwigb1",
      "author": "None",
      "body": "Yeah, I agree with you here. Just sad to have to cut my losses as this was the first person I've had genuine romantic feelings for since my last relationship crashed and burned. Appreciate your honesty, I'll get over it and try again soon (not with the same person ofc) haha",
      "created_utc": 1709897746.0,
      "score": 3,
      "context": [
        {
          "id": "ktrsfkv",
          "author": "Wellslapmesilly",
          "body": "Normally I would agree with most of these comments about it being something that can be overcome. However, this person is flat out telling you that ARFID was a major factor in ending their previous relationship. This is someone who has already dealt with it and found it too difficult. Unfortunately it does not bode well, sorry.",
          "created_utc": 1709822585.0
        }
      ]
    },
    {
      "id": "ktwi5hn",
      "author": "None",
      "body": "Lol kind of a solid plan. I wonder if they have conventions for people with tons of food allergies... I could just walk about around the entrance looking lost until a handsome, long-haired, epi-pen carrying man comes to my rescue :p",
      "created_utc": 1709897445.0,
      "score": 2,
      "context": [
        {
          "id": "ktv9bjh",
          "author": "athey",
          "body": "I have no really useful advice. I was lucky in that my husband is allergic to the world, and his allergies overlapped with a lot of my ‘no-go’ foods.  It was wonderful at restaurants. I could use his allergies to justify some of my ‘picky’ eating choices. \n\nMaybe find a person with a lot of food allergies?  lol",
          "created_utc": 1709869497.0
        }
      ]
    },
    {
      "id": "ktwgpq1",
      "author": "None",
      "body": "I appreciate you sharing your experience. This current bout of frustration feels like a turning point for me and I'm finally looking into counseling that can help me get over that psychological barrier. Definitely anxious because I know there's going to be a lot of exposure therapy involved but I'm hoping that having someone to walk me through my feelings and provide support will help.",
      "created_utc": 1709895837.0,
      "score": 3,
      "context": [
        {
          "id": "ktvxiu9",
          "author": "Dramatic-Growth1335",
          "body": "This was my main motivation to try new foods. I had an incredibly restrictive diet. I hadn't even used a knife and fork before the age of 24. \nGetting over the psychological barrier to allow yourself to try new foods is the hardest bit. But it's just a hump. Once you are over it you realise food isn't scary. You get used to things tasting bad and you can just chew and swallow. You get used to being surprised and finding things you like! \nI'm still not a fan of most red meats but I don't think there is a vegetable I dont like. \n\nGood luck",
          "created_utc": 1709881895.0
        }
      ]
    },
    {
      "id": "ktwhicf",
      "author": "Dramatic-Growth1335",
      "body": "All you can do is take a step forward. Sounds like that is exactly what you are doing. You've got this 💪",
      "created_utc": 1709896754.0,
      "score": 2,
      "context": [
        {
          "id": "ktvxiu9",
          "author": "Dramatic-Growth1335",
          "body": "This was my main motivation to try new foods. I had an incredibly restrictive diet. I hadn't even used a knife and fork before the age of 24. \nGetting over the psychological barrier to allow yourself to try new foods is the hardest bit. But it's just a hump. Once you are over it you realise food isn't scary. You get used to things tasting bad and you can just chew and swallow. You get used to being surprised and finding things you like! \nI'm still not a fan of most red meats but I don't think there is a vegetable I dont like. \n\nGood luck",
          "created_utc": 1709881895.0
        },
        {
          "id": "ktwgpq1",
          "author": "None",
          "body": "I appreciate you sharing your experience. This current bout of frustration feels like a turning point for me and I'm finally looking into counseling that can help me get over that psychological barrier. Definitely anxious because I know there's going to be a lot of exposure therapy involved but I'm hoping that having someone to walk me through my feelings and provide support will help.",
          "created_utc": 1709895837.0
        }
      ]
    }
  ]
}