{
  "id": "1bbybul",
  "subreddit": "ARFID",
  "author": "Potential_Ad8222",
  "created_utc": 1710145668.0,
  "title": "ARFID is lowkey hilarious",
  "selftext": "As someone diagnosed with arfid and all the exhausting baggage that comes along with that, sometimes I realise how funny or ridiculous some of my restrictions are and it makes me laugh. For example, I cant drink the last bit of milk in a bottle. I call it the Cursed Milk because for some reason that milk is dirty and I cant drink it. What are some of your restrictions that you find funny?",
  "url": "https://www.reddit.com/r/ARFID/comments/1bbybul/arfid_is_lowkey_hilarious/",
  "score": 408,
  "num_comments": 182,
  "comments": [
    {
      "id": "kuccomc",
      "author": "Emergency_Dinner_739",
      "body": "I always leave one bite of something left..? Literally whatever i may be eating, I’ll leave a bite left. No clue why I just don’t want that last bite.",
      "created_utc": 1710147278.0,
      "score": 192,
      "context": []
    },
    {
      "id": "kucdzsg",
      "author": "Ok-Committee-5867",
      "body": "I struggle with water bottles… if I leave one somewhere and then come back to it I can’t drink the water. It’s like it’s become contaminated lol. It’s weird. So I try to remember to take it with me between rooms so I’ll drink it",
      "created_utc": 1710148306.0,
      "score": 134,
      "context": []
    },
    {
      "id": "kuckjdt",
      "author": "DerNogger",
      "body": "Hot beverage = Mhh cozy, fuzzy, way to start the day\n\nCold beverage = Ah nice, refreshing, we love to see it\n\nWarm beverage = Ew disgusting, feral, get this cup of filth away from me",
      "created_utc": 1710153115.0,
      "score": 97,
      "context": []
    },
    {
      "id": "kucqpr3",
      "author": "Thedailybee",
      "body": "I feel like that moment when I’m chewing a bite of something I was craving and then suddenly my brain is like “SPIT IT OUT” is my this is ridiculous moment. Bc tf you mean? I can’t just swallow this last bite and be done ?? I HAVE to spit it out? 😒 like bro come ON.\n\nAnd why do I have to distract myself to eat leftovers? Have to have a silly little drink and my silly little videos so my brain doesn’t register we are eating left overs\n\nAnd last one- you know that scene from home alone where he makes his Mac and cheese and then doesn’t get to eat it? Yeah that’s another one because so many times I prepare a meal and sit down to eat it and immediately it’s like okay let’s get a Tupperware bc no way I’m eating this even tho I’m starving and I just sat down. Let me just get some popcorn instead of the meal I just slaved  over 🌚",
      "created_utc": 1710157050.0,
      "score": 74,
      "context": []
    },
    {
      "id": "kucw1oq",
      "author": "Mx-Helix-pomatia",
      "body": "Help I always refer to my eating disorder as clown disease because it’s so. 🤡",
      "created_utc": 1710159941.0,
      "score": 53,
      "context": []
    },
    {
      "id": "kuci0j4",
      "author": "geekgeek2019",
      "body": "That’s me with banana. Can’t eat the top and bottom lol",
      "created_utc": 1710151311.0,
      "score": 49,
      "context": []
    },
    {
      "id": "kud1o7p",
      "author": "greencash370",
      "body": "It's so stupid that I can't eat on bone meat. But as soon as it's off the bone, it's completely fine! Absolutely wack.",
      "created_utc": 1710162622.0,
      "score": 38,
      "context": []
    },
    {
      "id": "kuchqnm",
      "author": "kinkbongcrazybasin",
      "body": "I'm that way with cheese. The first couple of slices on each end of a block are cursed.",
      "created_utc": 1710151115.0,
      "score": 31,
      "context": []
    },
    {
      "id": "kucc3us",
      "author": "Bankerlady10",
      "body": "Ha! I’m the same with milk. I also won’t mix milks between jugs, I find that gross. I’m sure a jug has a bunch of mixed milk sources in it but in my mind each jug is different milk.",
      "created_utc": 1710146827.0,
      "score": 28,
      "context": []
    },
    {
      "id": "kucciw1",
      "author": "Beginning_Beat_5289",
      "body": "any sort of leftovers\n\ni will never touch vegemite (taste+texture) and sausages(had a bad experience once) - as an aussie i am considered crazy by those around me\n\nim super strict with best before and stuff whitch isn't that bad but my mum is pretty annoying about it\n\ni wont eat when others are around because i am to scared to be judged (not that funny but one of the things not talked about much)\n\ni wont eat food anyone offers me even if it is packaged, same for someone elses untouched meals\n\n&#x200B;\n\ni am weirdly ok with sharing food with my dog - like actualy eating the parts he licked - we shared ice cream a few days ago it felt so good to actualy enjoy ice cream and my dog makes stuff easier",
      "created_utc": 1710147152.0,
      "score": 26,
      "context": []
    },
    {
      "id": "kuddvf9",
      "author": "Latter-Report-8162",
      "body": "I can’t drink water from a glass. I have to drink it out of a bottle with a sports cap 😂 oh and I can’t drink tap water either. And I don’t care what anyone says bathroom water and kitchen water taste different 😂😂😂",
      "created_utc": 1710167665.0,
      "score": 29,
      "context": []
    },
    {
      "id": "kud6f50",
      "author": "tiictacs",
      "body": "the same thing can taste good or disgusting to me on different days. i can try to eat my favorite foods and have them taste absolutely gross suddenly \nbasically i need to gamble on whether i’m gonna be able to eat or is it gonna taste like garbage even tho it’s something i love",
      "created_utc": 1710164677.0,
      "score": 21,
      "context": []
    },
    {
      "id": "kud8eaa",
      "author": "Foundation-Used",
      "body": "I feel like it's the Stanford experiment between my gut and my brain. Just a frickin unhinged free-for-all in there.",
      "created_utc": 1710165487.0,
      "score": 19,
      "context": []
    },
    {
      "id": "kue619m",
      "author": "liv21098",
      "body": "For me it’s the fact that I can eat thin chips, but not thicker ones. Before I knew I had ARFID, I’d say it’s because the thicker ones are ‘too potatoey’. Everyone would always tell me ‘but they’re both potato?!’. \n\nObviously the actually problem is the difference in the texture, which is so much easier to explain to people now 😂",
      "created_utc": 1710177521.0,
      "score": 20,
      "context": []
    },
    {
      "id": "kud7tr1",
      "author": "TrickyVast1183",
      "body": "Thats like me with hot dogs. Can’t eat the last end bit of the hot dog. I don’t even have a reason, it’s just… “don’t eat that”-brain",
      "created_utc": 1710165254.0,
      "score": 13,
      "context": []
    },
    {
      "id": "kueg8uz",
      "author": "mercurys-daughter",
      "body": "It’s a very unserious condition like why am I scared of broccoli. It can’t hurt u babe relaxxxx",
      "created_utc": 1710180933.0,
      "score": 14,
      "context": []
    },
    {
      "id": "kuci1ni",
      "author": "fwmh_royale",
      "body": "i can't eat the last bite of a banana - weird because i can eat the top part (which is exactly the same) just fine 😭",
      "created_utc": 1710151334.0,
      "score": 12,
      "context": []
    },
    {
      "id": "kudsq6i",
      "author": "coat_me_in_galaxies",
      "body": "This is so highly specific and weird, but any drink that’s been sitting out uncovered. I won’t touch it. It HAS to have a lid no matter what kind of drink or else I won’t drink it.",
      "created_utc": 1710173057.0,
      "score": 12,
      "context": []
    },
    {
      "id": "kucokwa",
      "author": "numbertwofuccboi",
      "body": "you’re the first person i’ve ever seen that feels the same way i do about the last bit of liquid in a container, something about it just feels so wrong to me lol\n\nit extends to when i have to eat stuff out a bowl too. where i feel like the last bit of food that was at the bottom and in direct contact with the bowl (same with the food that’s on the perimeter and is touching the sides of the bowl) just feels like it’s contaminated, or tainted, or something and i shouldn’t be eating it \n\nnow that i think about it, it almost feels like i’m playing a game of “the floor is lava” with my food. the moment something comes in contact with the floor (in this instance it’s the container) it’s no longer any good lmao",
      "created_utc": 1710155772.0,
      "score": 10,
      "context": []
    },
    {
      "id": "kudaq06",
      "author": "WillingAnxiety",
      "body": "Room temp water. The moment it's no longer brainfreeze cold, it is of the devil.",
      "created_utc": 1710166428.0,
      "score": 10,
      "context": []
    },
    {
      "id": "kuf7zg9",
      "author": "None",
      "body": "Different shapes of pasta can only be eaten with certain sauces. Spaghetti is ranch only, bow tie and penne I can do tomato sauce, and fettuccine is alfredo only. I cannot eat spaghetti with tomato sauce or penne with alfredo or any other combination",
      "created_utc": 1710190049.0,
      "score": 8,
      "context": []
    },
    {
      "id": "kug1ivi",
      "author": "inviktus04",
      "body": "I was telling my ED therapist that I used to eat scrambled eggs all the time, but a few years back I had a bad time with eggs and now eggs are dead to me. \n\n...OH WAIT unless it's a fried egg on a burger with bacon, I FORGOT THAT'S ALSO AN EGG 😮 \n\nHaving that realization in real time with my therapist was fantastic 😂",
      "created_utc": 1710200336.0,
      "score": 9,
      "context": []
    },
    {
      "id": "kug18f7",
      "author": "Amazing_Duck_8298",
      "body": "Hose water is elite, fridge dispenser water is great, bathroom sink water is very good, and kitchen sink water is inedible. Even though it is all from the same water source.",
      "created_utc": 1710200224.0,
      "score": 8,
      "context": []
    },
    {
      "id": "kui775q",
      "author": "adhdphobic",
      "body": "This one is sooooo so stupid. I can take the entire day to drink a bottle/carton of iced coffee. Sitting out at room temp, whatever, literally 6 hours to drink it.\n\nBut the second it's been opened then put in the fridge I will no longer be able to drink it\n\nMy body said room temperature ice coffee that's been out all day? mmm yummers no chance of getting sick\n\nOpened and then refrigerated ice coffee? you will die",
      "created_utc": 1710242138.0,
      "score": 9,
      "context": []
    },
    {
      "id": "kucmogr",
      "author": "Waterfalls_x_Thunder",
      "body": "I’m glad I’m not alone 😅\n\nIf I open a packet of biscuits or cakes etc. I have to have the ones the opposite to where I opened. That seems like they are stored better. \n\nMeat etc, I don’t like the top slices. I prefer getting them from the middle and not the bottom. \n\nFood I oven cook, I only like to eat the food in the centre of the oven tray. I don’t eat the food on the edge. \n\nSometimes I just look at something and think, I can’t eat that bit and I don’t even know why. \n\nSometimes I can only eat things from specific places. Like using butter or spreads, I can’t use butter from the edges. \n\nIf I leave my drink unattended for a short while. I can’t drink it again. \n\nI am like this with items too. \n\nEXAMPLE:\n\nIf I leave a bag hanging up for a few months or so without use. I can’t use it again…",
      "created_utc": 1710154560.0,
      "score": 6,
      "context": []
    },
    {
      "id": "kueoa06",
      "author": "flamespond",
      "body": "I can’t eat bread heels",
      "created_utc": 1710183594.0,
      "score": 8,
      "context": []
    },
    {
      "id": "kue9s36",
      "author": "MzAdventure68",
      "body": "The center of almost any sandwich.  The bread/breading to meat ratio is wrong and can't be eaten.  Especially chicken.",
      "created_utc": 1710178768.0,
      "score": 5,
      "context": []
    },
    {
      "id": "kuf12x0",
      "author": "None",
      "body": "I can’t eat the crunchy ends of French fries. Every time I eat fries, I leave behind a pile of just the fry ends.",
      "created_utc": 1710187803.0,
      "score": 6,
      "context": []
    },
    {
      "id": "kudakpk",
      "author": "UnironicKawaiiGirl",
      "body": "I can't drink the last bit of any drink as well, makes me feel like gagging just thinking about it 😂",
      "created_utc": 1710166369.0,
      "score": 5,
      "context": []
    },
    {
      "id": "kufzokl",
      "author": "SachiKaM",
      "body": "How no matter how long I’ve gone w/o eating, external stimuli can turn any meal repulsive and I’m no longer hungry. More often the food is not the problem as I only eat safe foods. It’s my appetite that is fragile. Ex: sees public ketchup bottle **I don’t need ketchup. However shared air becomes a thought**, now my noodles are soggy and I’m full. I can’t control my thoughts or air filtration, I can control what I put in my body. Not wet noodles.",
      "created_utc": 1710199636.0,
      "score": 5,
      "context": []
    },
    {
      "id": "kug7ol4",
      "author": "EwDavid999",
      "body": "Idc if the food I'm eating is the most delicious food ever, if it passes the plane of the sink, it's not food anymore. \n\nThe top paper plate is contaminated.",
      "created_utc": 1710202692.0,
      "score": 5,
      "context": []
    },
    {
      "id": "kud7m2y",
      "author": "Aggravating_Day_8138",
      "body": "I can’t drink cold drinks it hast to be warm or hot. I can’t eat the ends of sausages the texture is weird to me. No sauses ever not even gravy or pasta sause. No pasta or pizza. I hate most textures. Chicken and potatoes are so so good tho.",
      "created_utc": 1710165168.0,
      "score": 4,
      "context": []
    },
    {
      "id": "kudc5fh",
      "author": "Accurate-Neck6933",
      "body": "I agree with the milk thing. It's been exposed to much more air therefore it's more spoiled.",
      "created_utc": 1710166992.0,
      "score": 4,
      "context": []
    },
    {
      "id": "kueegct",
      "author": "Ill_Sail3249",
      "body": "this is genuinely so fucking stupid, but one of my worst fear foods is spaghetti bolognese. Here’s the thing though: my ARFID is primarily sensory-related, so most of my fear foods are things that have unpleasant textures or tastes like spicy food, raw whole fruit etc. Not only do I not mind the taste or smell of spaghetti bolognese, I actually don’t mind the texture of the sauce either, so by all means it should be a safe food, right? Wrong! No matter how appetising it looks, I can’t even put a spoon of it in my mouth without gagging. It’s so fucking stupid and makes no sense. The only explanation I can think of is that it was a go-to dinner in my family around the time when I developed ARFID as a child, and that I had issues with choking/not properly swallowing certain foods.",
      "created_utc": 1710180330.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kuflmgi",
      "author": "Herb_the_Nerd",
      "body": "I only go to one restaurant where I eat two separate things. There’s only one food that I like toppings on. I still drink milk out of a sippy cup bc cups (for milk) ARE THE DEVIL",
      "created_utc": 1710194595.0,
      "score": 5,
      "context": []
    },
    {
      "id": "kuh1b5t",
      "author": "FlyWereAble",
      "body": "I can drink almost anything but for some reason all soup is off the table",
      "created_utc": 1710214479.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kulz9tb",
      "author": "Mysterious_Lynx_5341",
      "body": "I love cinnamon raisin bagels but hate raisins so I have to tear my bagel all apart to pick out every raisin before I can eat it",
      "created_utc": 1710291911.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kuegfpl",
      "author": "lizpol20",
      "body": "I can't ever finish a cup of tea - the dregs are just absolutely disgusting to me, like i feel queasy thinking about it!\n\nI also have the \"spit it out\" bit of my brain which leads to almost instant gagging until it's out. Brains are weird!",
      "created_utc": 1710180998.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kufpr2i",
      "author": "None",
      "body": "Oh my god me too.. I do this with the dregs of my coffee",
      "created_utc": 1710196026.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kug0yc5",
      "author": "Mac8cheeseenthusiast",
      "body": "Hot drink — yay nice, very comfy\n\nWarm beverage — satans offspring\n\nRoom temp — yes this more of this please\n\nCool — ehhh ok tolerable\n\nIcy — SPICY NO GODS NO THAT HURTS MY BRAIN",
      "created_utc": 1710200118.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kugb9gc",
      "author": "Lylli-Rose",
      "body": "I can’t share drinks. If someone takes a sip out of my drink I need a whole new drink.",
      "created_utc": 1710204043.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kugwr6v",
      "author": "charmanderstoes",
      "body": "if i make leftovers into something i won’t eat it, if my partner does i will",
      "created_utc": 1710212437.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kuqdmsf",
      "author": "None",
      "body": "Nothing about my case of ARFID has been funny. I’ve lost 35 pounds in under a year and stopped having any interest in food. I just stopped eating. I’m 21 years old and have been advised to seek clinical care in a hospital. I vomit every day. I see doctors and dietitians and therapists but at the end of the day it’s all up to me to fix. ARFID is not funny. And there is a difference between being a picky eater and having ARFID. I had the worst year of my life last year which is where this started. Now my life is better and I’m still losing weight. My restriction is everything. If I know I’m going to go somewhere the next day and eat in public or if I know my family/friends are making a meal, I won’t eat anything at all the day before in order to “save room” in my stomach. Basically, I have to be starving to eat a full meal. \n\nIt’s genuinely disturbing to me to read through these comments of people who generalize ARFID as being picky, and people saying it’s hilarious. It is NOT picky eating. It is an intense aversion to food and it’s just not funny at all. This has affected my life beyond what you can even guess. I really would not continue to say ARFID is funny because it is not.",
      "created_utc": 1710362124.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kufadwj",
      "author": "Letshavemorefun",
      "body": "I can’t drink water with meals and never at room temperature. Has to be cold and I have to have no other taste in my mouth.",
      "created_utc": 1710190835.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kuhczub",
      "author": "Blackroses7894",
      "body": "I love spaghetti BUT any flat pasta is a no go. I can't do linguini or fettuccine. But strangely enough, I love lasagna.",
      "created_utc": 1710220691.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kuxyztt",
      "author": "hamforbananas",
      "body": "I can eat fried chicken from chikfila, but any other chicken is a big no. I can only eat chicken from chikfila.",
      "created_utc": 1710474467.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lgvnhw7",
      "author": "AnonCelestialBodies",
      "body": "TIL that the last 1/15th of almond milk in the jug that always makes me suspicious af for no reason is called \"cursed milk\".",
      "created_utc": 1722998384.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kug2yyp",
      "author": "bishyfishyriceball",
      "body": "That I don’t like condiments because they are wet/savory but my favorite safe food is soup. 😭",
      "created_utc": 1710200889.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kugs7w9",
      "author": "None",
      "body": "the way i literally JUST did this with chocolate milk LMFAOOOOO i thought it was just a me thing (im even worse at restaurants)",
      "created_utc": 1710210499.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kuh6mlt",
      "author": "AltruisticFeed8290",
      "body": "SAME SAME WITH THE MILK",
      "created_utc": 1710217107.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kuhz9ex",
      "author": "BoubyWinky",
      "body": "To me is the fact that I easily feel \"full\" When I eat something \"meh\" but I have NO LIMITS with my safe food....\n\nMy brother used to tell me that for some food I have \"close to inhumane\" capacities ! :D",
      "created_utc": 1710236910.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kui7lxy",
      "author": "Putrid_Horse2948",
      "body": "I always leave 1 baked bean on the plate or I can’t drink the last bit of my drink because for some reason it’s disgusting",
      "created_utc": 1710242382.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kuidr9y",
      "author": "buggiesmile",
      "body": "It literally does not matter if I like the taste of something. If I think there’s too much meat on a sandwich and not enough cheese? Can’t eat it now. Think about the fact that there’s sauce on this thing I’ve been enjoying? Time to throw up. Like bruh you were liking the food, you were making progress, why is sauce the devil?",
      "created_utc": 1710245680.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kuk77sx",
      "author": "WeakExamination3209",
      "body": "One of my only safe foods is Heinz baked beans.\nI will only eat the smaller tins that come in a 3 pk I can’t eat beans from a large tin.\nDon’t know why so during covid while everyone was buying up the beans everyone I knew and me were trying to get me these beans or I probably would of starved or something",
      "created_utc": 1710269191.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kukccbo",
      "author": "Fast_Giraffe_3921",
      "body": "With certain foods in bowls I don’t like eating the outer ring of food cuz it just looks too different so I end up with an “O” of Mac and cheese or other foods like that 😭",
      "created_utc": 1710271005.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kukhopd",
      "author": "Leticia_the_bookworm",
      "body": "As a kid, I couldn't bear unsafe foods touching or even being near anything I ate. If we ordered pizza and it came with olives or onion, I couldn't just take them out and eat - it was permanently contaminated. If there was anything unsafe served on the table, I had to almost bury my head in my chest and pretend really hard it wasn't there, because otherwise I wouldn't be able to eat. And I'm not even talking about doing dishes - I found it so repulsive to think my plates and utensils were washed with the same sponge as all the other stuff.",
      "created_utc": 1710272907.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kuknkp5",
      "author": "None",
      "body": "I can drink orange juice but oranges are a no no. Its vise versa with apples.",
      "created_utc": 1710274977.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kunuaf3",
      "author": "Middle_Craft_4911",
      "body": "I can eat smoked salmon on a roll, cracker, but not on a normal sandwich. Same for sausage and cheese but cheese I also don't like on a roll, only on a cracker or on a sandwich but on sandwich it has to be Melted and combined with ham in a toaster😂",
      "created_utc": 1710329632.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kustvnd",
      "author": "PercentageWide6608",
      "body": "No leftovers, nothing that's been left in the fridge for more than 12 hours, and that's cutting it close. I can only have certain brands of things I don't fuck with certain generics or name brands. Gotta have kraft Mac and cheese can't be no different. I gotta have Vlasic pickles. I can't eat anything too close to expiration, I won't eat chicken nuggets, burgers, or fries without ketchup. I've cried because they didn't put ketchup with my nuggets so I genuinely would not eat them. I've cried because I got wheat bread instead of white bread on my sandwiches. \n\nReheating isn't really in my vocabulary much either once the food isn't warm anymore. it's gone sorry goodbye. I won't let my foods touch, I get multiple plates for multiple dishes. Silverware either I'll eneve get how people can go from a fork in one thing to a completely different one and just be ok with it. When anything looks \"different\" than it's supposed to.",
      "created_utc": 1710398132.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kuxze9r",
      "author": "hamforbananas",
      "body": "I can't eat pasta, but the moment it's a pasta bake or pasta in a salad it's okay",
      "created_utc": 1710474657.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l14ygi0",
      "author": "joshb44231",
      "body": "For me it’s some foods touching or combining. Like if I had Mac and cheese on a plate and they touch, I’d be grossed out. Also, ice cream cake is just a no for me because of the combination of the cake and ice cream.",
      "created_utc": 1714008872.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l9z93hu",
      "author": "Emmett_Star-Cloudkin",
      "body": "I can only eat the part of the corndog that doesn't touch the stick, like the first 1/3 of it and after that I can't eat it. I have learned to eat mini corndogs instead.",
      "created_utc": 1719187580.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lmi9w88",
      "author": "Life-Arena",
      "body": "I think it’s an OCD thing",
      "created_utc": 1726004980.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lqnku77",
      "author": "Single-Balance-3941",
      "body": "I DO THE SAME MILK THING WHAT",
      "created_utc": 1728239280.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lsn5cqm",
      "author": "Unhappy-Bake-2182",
      "body": "One thing I hate is the hard parts of stuff because when I eat drumsticks I rip the hard little muscle thing off then I eat it.",
      "created_utc": 1729314111.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lz3spzy",
      "author": "Big_Wrap9102",
      "body": "I like the beef and tomato pot noodles but there’s never enough sauce in the sachet. So I use bottled ketchup, but not Heinz, the cheap stuff is better.\n\nAnd the vegetables must be picked out before I pour the water, once I’ve poured the water, and then a few stirs with the fork to double check I got them all.\n\nThe vegetables are gross. I don’t like the gritty texture or how they’re so small they can get stuck in my teeth.\n\nIf I reach a point in the pot where the noodles feel “crunchy,” then the rest of the noodles must also be vile and the last quarter of the pot will be given to a family member or thrown away.\n\nSausage rolls are nice. But only the pastry. The meat is not good. Me and my dog have an understanding.\n\nApple juice is also nice. But only the cheap store brand sold at one specific shop.\n\nI like the McDonald’s cheese burgers. But I can’t stand onion. Mustard is tolerable, but only on days I feel relaxed and more “go with the flow.” Even if the onion is scraped out, I can taste and smell where it’s been.\n\nNo one else can add sauces to my food. It must be placed in the correct position, away from the food, so I can gently dip a fry at my leisure to apply the correct amount.\n\nI like the yoghurt drinks, but I don’t like the texture of large mouthfuls. I need to take tiny sips, so I can “chew” it once before swallowing.",
      "created_utc": 1732642272.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m22fcaa",
      "author": "ProjectTrill",
      "body": "I thought I was just a fuckin weirdo but now thanks to this sub-Reddit, I realize it's actually somewhat common to be this kind of fuckin weido. At least we aren't like eat-other-people kind of weird.",
      "created_utc": 1734208420.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mdqlwdv",
      "author": "allieboeing",
      "body": "dude if the food on the inside of the bun gets on the outside of the bun. wtf. logically i know it’s dumb asf but i cannot.",
      "created_utc": 1740020616.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mgsybxv",
      "author": "Alarming-Comment-469",
      "body": "When I was little I wouldn’t eat the last 1/4 of the cereal box and I’d call it the crumbly mess the scum. My dad came up with putting it into a colander and shaking out the crumbs. I’ve been using this technique for about 20 years. ",
      "created_utc": 1741495413.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mi7br34",
      "author": "Expensive-Ad5780",
      "body": "I do this with water, I call it spit water; it's the last bit. For some reason, I imagine all the tiny bit of saliva that goes back in the bottle is all accumulated at the end...",
      "created_utc": 1742181871.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mqvtkbl",
      "author": "Possible_Priority584",
      "body": "I'll be honest I have been seriously cracking up and some people's comments on ARFID posts 😭😭\nLike full adults in a fancy restaurant ordering chicken tenders off the kids menu has really cracked me up 😭\nBut also obviously hate that ARFID is a thing and we wish we could all eat whatever we want with peace",
      "created_utc": 1746539116.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kudgrzi",
      "author": "kmfoh",
      "body": "We call this “the bad part” and my husband has tried gaming my plate by putting one thing he know I won’t eat on it, so that can be “the bad part” and I can eat every bite of the things I really do enjoy 😂",
      "created_utc": 1710168773.0,
      "score": 116,
      "context": [
        {
          "id": "kuccomc",
          "author": "Emergency_Dinner_739",
          "body": "I always leave one bite of something left..? Literally whatever i may be eating, I’ll leave a bite left. No clue why I just don’t want that last bite.",
          "created_utc": 1710147278.0
        }
      ]
    },
    {
      "id": "kud1si0",
      "author": "redditsayd",
      "body": "SAME it’s literally repulsive",
      "created_utc": 1710162675.0,
      "score": 17,
      "context": [
        {
          "id": "kuccomc",
          "author": "Emergency_Dinner_739",
          "body": "I always leave one bite of something left..? Literally whatever i may be eating, I’ll leave a bite left. No clue why I just don’t want that last bite.",
          "created_utc": 1710147278.0
        }
      ]
    },
    {
      "id": "kuen6pw",
      "author": "oolongstory",
      "body": "My mom called this \"last-bite-itis\" (pronounced like a diagnosis) when seeing me do this as a kid. 😂",
      "created_utc": 1710183238.0,
      "score": 9,
      "context": [
        {
          "id": "kuccomc",
          "author": "Emergency_Dinner_739",
          "body": "I always leave one bite of something left..? Literally whatever i may be eating, I’ll leave a bite left. No clue why I just don’t want that last bite.",
          "created_utc": 1710147278.0
        }
      ]
    },
    {
      "id": "kudlskb",
      "author": "FunkyChickenHouse",
      "body": "Oh man I’m the opposite i NEED to have the last bite, i think it’s an OCD thing for me though",
      "created_utc": 1710170619.0,
      "score": 8,
      "context": [
        {
          "id": "kuccomc",
          "author": "Emergency_Dinner_739",
          "body": "I always leave one bite of something left..? Literally whatever i may be eating, I’ll leave a bite left. No clue why I just don’t want that last bite.",
          "created_utc": 1710147278.0
        }
      ]
    },
    {
      "id": "kujhwtr",
      "author": "rabbit7891",
      "body": "i do the opposite and eat the bad bite first so the last bite is the “perfect bite”",
      "created_utc": 1710260908.0,
      "score": 6,
      "context": [
        {
          "id": "kuccomc",
          "author": "Emergency_Dinner_739",
          "body": "I always leave one bite of something left..? Literally whatever i may be eating, I’ll leave a bite left. No clue why I just don’t want that last bite.",
          "created_utc": 1710147278.0
        }
      ]
    },
    {
      "id": "kuk99yx",
      "author": "jenniferlynne08",
      "body": "I truly didn’t know I wasn’t the only one who did this! The very last of things, be they food or drink, are cursed. \n\nAlso, for me I have to eat whatever the thing is all at one time. Pause for two minutes to have a conversation? All remaining food = cursed. I thought it was a temp thing but nope. 🤷🏻‍♀️",
      "created_utc": 1710269914.0,
      "score": 3,
      "context": [
        {
          "id": "kuccomc",
          "author": "Emergency_Dinner_739",
          "body": "I always leave one bite of something left..? Literally whatever i may be eating, I’ll leave a bite left. No clue why I just don’t want that last bite.",
          "created_utc": 1710147278.0
        }
      ]
    },
    {
      "id": "kufy3gb",
      "author": "SachiKaM",
      "body": "I chalk that bite up to the “clean plate club” entry fee that trashed my idea of communal dining. As an adult, I don’t want in your stoopid ass club anyway! 😤",
      "created_utc": 1710199038.0,
      "score": 2,
      "context": [
        {
          "id": "kuccomc",
          "author": "Emergency_Dinner_739",
          "body": "I always leave one bite of something left..? Literally whatever i may be eating, I’ll leave a bite left. No clue why I just don’t want that last bite.",
          "created_utc": 1710147278.0
        }
      ]
    },
    {
      "id": "kuhukzy",
      "author": "jenniferlynne08",
      "body": "YES. last bite is cursed. Dont know why but last bite is very very bad.",
      "created_utc": 1710233367.0,
      "score": 2,
      "context": [
        {
          "id": "kuccomc",
          "author": "Emergency_Dinner_739",
          "body": "I always leave one bite of something left..? Literally whatever i may be eating, I’ll leave a bite left. No clue why I just don’t want that last bite.",
          "created_utc": 1710147278.0
        }
      ]
    },
    {
      "id": "kufdc6h",
      "author": "FunnelCakeGoblin",
      "body": "Damn, I thought that was just how I was. It’s an ARFID thing?",
      "created_utc": 1710191824.0,
      "score": 1,
      "context": [
        {
          "id": "kuccomc",
          "author": "Emergency_Dinner_739",
          "body": "I always leave one bite of something left..? Literally whatever i may be eating, I’ll leave a bite left. No clue why I just don’t want that last bite.",
          "created_utc": 1710147278.0
        }
      ]
    },
    {
      "id": "kvemi72",
      "author": "Scorpiorising1818",
      "body": "I went from doing this and never knowing why to not wanting to leave anything on the plate 😭",
      "created_utc": 1710756036.0,
      "score": 1,
      "context": [
        {
          "id": "kuccomc",
          "author": "Emergency_Dinner_739",
          "body": "I always leave one bite of something left..? Literally whatever i may be eating, I’ll leave a bite left. No clue why I just don’t want that last bite.",
          "created_utc": 1710147278.0
        }
      ]
    },
    {
      "id": "ldx7wr9",
      "author": "ReputationOk4811",
      "body": "yes this is often the case for me. got better over time but I still have to spit it out occasionally if I try to eat it.",
      "created_utc": 1721393577.0,
      "score": 1,
      "context": [
        {
          "id": "kuccomc",
          "author": "Emergency_Dinner_739",
          "body": "I always leave one bite of something left..? Literally whatever i may be eating, I’ll leave a bite left. No clue why I just don’t want that last bite.",
          "created_utc": 1710147278.0
        }
      ]
    },
    {
      "id": "lnl71md",
      "author": "Upset_Book_6643",
      "body": "I am not alone! I did that most of my adult life.  It was very settling to me to leave a bite or two on my plate.  I didn’t feel pushed, it gave me control and also was a spiritual thing for me, acknowledging people who have no food.",
      "created_utc": 1726588713.0,
      "score": 1,
      "context": [
        {
          "id": "kuccomc",
          "author": "Emergency_Dinner_739",
          "body": "I always leave one bite of something left..? Literally whatever i may be eating, I’ll leave a bite left. No clue why I just don’t want that last bite.",
          "created_utc": 1710147278.0
        }
      ]
    },
    {
      "id": "lsk1y3l",
      "author": "poppunkdaddyy",
      "body": "YES OH MY GOD I DIDNT KNOW THAT WAS FROM THE ARFID",
      "created_utc": 1729272004.0,
      "score": 1,
      "context": [
        {
          "id": "kuccomc",
          "author": "Emergency_Dinner_739",
          "body": "I always leave one bite of something left..? Literally whatever i may be eating, I’ll leave a bite left. No clue why I just don’t want that last bite.",
          "created_utc": 1710147278.0
        }
      ]
    },
    {
      "id": "lxv882o",
      "author": "wandaemilyyy",
      "body": "Wow I’ve done that my whole life and had no idea why",
      "created_utc": 1731984981.0,
      "score": 1,
      "context": [
        {
          "id": "kuccomc",
          "author": "Emergency_Dinner_739",
          "body": "I always leave one bite of something left..? Literally whatever i may be eating, I’ll leave a bite left. No clue why I just don’t want that last bite.",
          "created_utc": 1710147278.0
        }
      ]
    },
    {
      "id": "kuci048",
      "author": "cweezie",
      "body": "reminds me of the little girl in Signs",
      "created_utc": 1710151303.0,
      "score": 16,
      "context": [
        {
          "id": "kucdzsg",
          "author": "Ok-Committee-5867",
          "body": "I struggle with water bottles… if I leave one somewhere and then come back to it I can’t drink the water. It’s like it’s become contaminated lol. It’s weird. So I try to remember to take it with me between rooms so I’ll drink it",
          "created_utc": 1710148306.0
        }
      ]
    },
    {
      "id": "kucmtx3",
      "author": "Waterfalls_x_Thunder",
      "body": "I’m the same! I can’t leave things unattended and expect to drink it after. It’s definitely as though it’s no longer safe.",
      "created_utc": 1710154657.0,
      "score": 10,
      "context": [
        {
          "id": "kucdzsg",
          "author": "Ok-Committee-5867",
          "body": "I struggle with water bottles… if I leave one somewhere and then come back to it I can’t drink the water. It’s like it’s become contaminated lol. It’s weird. So I try to remember to take it with me between rooms so I’ll drink it",
          "created_utc": 1710148306.0
        }
      ]
    },
    {
      "id": "kudlvw8",
      "author": "FunkyChickenHouse",
      "body": "Same! Only time I will is if it’s like in my room or somewhere “safe”",
      "created_utc": 1710170652.0,
      "score": 7,
      "context": [
        {
          "id": "kucdzsg",
          "author": "Ok-Committee-5867",
          "body": "I struggle with water bottles… if I leave one somewhere and then come back to it I can’t drink the water. It’s like it’s become contaminated lol. It’s weird. So I try to remember to take it with me between rooms so I’ll drink it",
          "created_utc": 1710148306.0
        }
      ]
    },
    {
      "id": "kusu79w",
      "author": "PercentageWide6608",
      "body": "YES I got a stanely cup as a gift and it just feels like gross. I don't feel like it's ever completely clean. I use disposable dishes for the most part because of my fears of dishes and their being leftover grime and stuff in them. I feel like they're never clean enough, ESPECIALLY when they've been sitting in the seek for a week. I genuinely have the impulse to throw the dishes away when they've been sitting like that but I know it's wasteful I just can't help it it feels so dirty even when they've been \"cleaned\". Handwashing doesn't feel enough, the dishwasher doesn't feel enough, and I always fear that I'm drinking/eating soap too after trying to hand wash stuff.",
      "created_utc": 1710398356.0,
      "score": 2,
      "context": [
        {
          "id": "kucdzsg",
          "author": "Ok-Committee-5867",
          "body": "I struggle with water bottles… if I leave one somewhere and then come back to it I can’t drink the water. It’s like it’s become contaminated lol. It’s weird. So I try to remember to take it with me between rooms so I’ll drink it",
          "created_utc": 1710148306.0
        }
      ]
    },
    {
      "id": "lnnmhmp",
      "author": "Upset_Book_6643",
      "body": "Same. I buy the 8oz bottles for that very reason.  Still can’t always finish and it grosses me out.  But i make coffee with it. Even that was repulsive at first, but ok now.",
      "created_utc": 1726617267.0,
      "score": 1,
      "context": [
        {
          "id": "kucdzsg",
          "author": "Ok-Committee-5867",
          "body": "I struggle with water bottles… if I leave one somewhere and then come back to it I can’t drink the water. It’s like it’s become contaminated lol. It’s weird. So I try to remember to take it with me between rooms so I’ll drink it",
          "created_utc": 1710148306.0
        }
      ]
    },
    {
      "id": "kuk9ucv",
      "author": "jenniferlynne08",
      "body": "If you’re comfy sharing it, what gender were you raised as? Bc I do this too and I’ve always wondered if it’s like something programmed hard in my brain so as to avoid getting roofied or whatever",
      "created_utc": 1710270110.0,
      "score": 1,
      "context": [
        {
          "id": "kucdzsg",
          "author": "Ok-Committee-5867",
          "body": "I struggle with water bottles… if I leave one somewhere and then come back to it I can’t drink the water. It’s like it’s become contaminated lol. It’s weird. So I try to remember to take it with me between rooms so I’ll drink it",
          "created_utc": 1710148306.0
        }
      ]
    },
    {
      "id": "kucvfcn",
      "author": "oddistrange",
      "body": "[Literally me.](https://i.redd.it/4482as8f52x91.png)",
      "created_utc": 1710159625.0,
      "score": 9,
      "context": [
        {
          "id": "kuckjdt",
          "author": "DerNogger",
          "body": "Hot beverage = Mhh cozy, fuzzy, way to start the day\n\nCold beverage = Ah nice, refreshing, we love to see it\n\nWarm beverage = Ew disgusting, feral, get this cup of filth away from me",
          "created_utc": 1710153115.0
        }
      ]
    },
    {
      "id": "kuealtz",
      "author": "DrG2390",
      "body": "I’m somewhat similar except I only like cold beverages. Everything else is gross to me",
      "created_utc": 1710179045.0,
      "score": 7,
      "context": [
        {
          "id": "kuckjdt",
          "author": "DerNogger",
          "body": "Hot beverage = Mhh cozy, fuzzy, way to start the day\n\nCold beverage = Ah nice, refreshing, we love to see it\n\nWarm beverage = Ew disgusting, feral, get this cup of filth away from me",
          "created_utc": 1710153115.0
        }
      ]
    },
    {
      "id": "kufzzf7",
      "author": "amh8011",
      "body": "I’m the complete opposite because I have super sensitive teeth and anything too extreme in either direction is so painful",
      "created_utc": 1710199750.0,
      "score": 4,
      "context": [
        {
          "id": "kuckjdt",
          "author": "DerNogger",
          "body": "Hot beverage = Mhh cozy, fuzzy, way to start the day\n\nCold beverage = Ah nice, refreshing, we love to see it\n\nWarm beverage = Ew disgusting, feral, get this cup of filth away from me",
          "created_utc": 1710153115.0
        }
      ]
    },
    {
      "id": "kue9x5c",
      "author": "luminousrobot",
      "body": "Same!",
      "created_utc": 1710178816.0,
      "score": 1,
      "context": [
        {
          "id": "kuckjdt",
          "author": "DerNogger",
          "body": "Hot beverage = Mhh cozy, fuzzy, way to start the day\n\nCold beverage = Ah nice, refreshing, we love to see it\n\nWarm beverage = Ew disgusting, feral, get this cup of filth away from me",
          "created_utc": 1710153115.0
        }
      ]
    },
    {
      "id": "kugx95w",
      "author": "HarleyJenkins",
      "body": "This is funny I joined this group because my 8 year old was just diagnosed with ARFID, but I will drink coffee with cream that’s been sitting on my desk all day.",
      "created_utc": 1710212651.0,
      "score": 1,
      "context": [
        {
          "id": "kuckjdt",
          "author": "DerNogger",
          "body": "Hot beverage = Mhh cozy, fuzzy, way to start the day\n\nCold beverage = Ah nice, refreshing, we love to see it\n\nWarm beverage = Ew disgusting, feral, get this cup of filth away from me",
          "created_utc": 1710153115.0
        }
      ]
    },
    {
      "id": "l4rm7x7",
      "author": "Lucky_Independent_80",
      "body": "I will only drink my water hot and my coffee cold.",
      "created_utc": 1716142632.0,
      "score": 1,
      "context": [
        {
          "id": "kuckjdt",
          "author": "DerNogger",
          "body": "Hot beverage = Mhh cozy, fuzzy, way to start the day\n\nCold beverage = Ah nice, refreshing, we love to see it\n\nWarm beverage = Ew disgusting, feral, get this cup of filth away from me",
          "created_utc": 1710153115.0
        }
      ]
    },
    {
      "id": "kudwns0",
      "author": "mamaxchaos",
      "body": "The SPIT IT OUT part!! Except I also have emetophobia so sometimes I’ll need to spit it out or I’ll die while also getting lockjaw because if I ever open my mouth again, Bad Things Will Happen.",
      "created_utc": 1710174386.0,
      "score": 15,
      "context": [
        {
          "id": "kucqpr3",
          "author": "Thedailybee",
          "body": "I feel like that moment when I’m chewing a bite of something I was craving and then suddenly my brain is like “SPIT IT OUT” is my this is ridiculous moment. Bc tf you mean? I can’t just swallow this last bite and be done ?? I HAVE to spit it out? 😒 like bro come ON.\n\nAnd why do I have to distract myself to eat leftovers? Have to have a silly little drink and my silly little videos so my brain doesn’t register we are eating left overs\n\nAnd last one- you know that scene from home alone where he makes his Mac and cheese and then doesn’t get to eat it? Yeah that’s another one because so many times I prepare a meal and sit down to eat it and immediately it’s like okay let’s get a Tupperware bc no way I’m eating this even tho I’m starving and I just sat down. Let me just get some popcorn instead of the meal I just slaved  over 🌚",
          "created_utc": 1710157050.0
        }
      ]
    },
    {
      "id": "kuenfxa",
      "author": "oolongstory",
      "body": "Ooh yup if I *think too hard* about the food that's in my mouth, I'm sunk",
      "created_utc": 1710183321.0,
      "score": 14,
      "context": [
        {
          "id": "kucqpr3",
          "author": "Thedailybee",
          "body": "I feel like that moment when I’m chewing a bite of something I was craving and then suddenly my brain is like “SPIT IT OUT” is my this is ridiculous moment. Bc tf you mean? I can’t just swallow this last bite and be done ?? I HAVE to spit it out? 😒 like bro come ON.\n\nAnd why do I have to distract myself to eat leftovers? Have to have a silly little drink and my silly little videos so my brain doesn’t register we are eating left overs\n\nAnd last one- you know that scene from home alone where he makes his Mac and cheese and then doesn’t get to eat it? Yeah that’s another one because so many times I prepare a meal and sit down to eat it and immediately it’s like okay let’s get a Tupperware bc no way I’m eating this even tho I’m starving and I just sat down. Let me just get some popcorn instead of the meal I just slaved  over 🌚",
          "created_utc": 1710157050.0
        }
      ]
    },
    {
      "id": "kuev4ru",
      "author": "PossiblyHero",
      "body": "I don't do leftovers.",
      "created_utc": 1710185843.0,
      "score": 9,
      "context": [
        {
          "id": "kucqpr3",
          "author": "Thedailybee",
          "body": "I feel like that moment when I’m chewing a bite of something I was craving and then suddenly my brain is like “SPIT IT OUT” is my this is ridiculous moment. Bc tf you mean? I can’t just swallow this last bite and be done ?? I HAVE to spit it out? 😒 like bro come ON.\n\nAnd why do I have to distract myself to eat leftovers? Have to have a silly little drink and my silly little videos so my brain doesn’t register we are eating left overs\n\nAnd last one- you know that scene from home alone where he makes his Mac and cheese and then doesn’t get to eat it? Yeah that’s another one because so many times I prepare a meal and sit down to eat it and immediately it’s like okay let’s get a Tupperware bc no way I’m eating this even tho I’m starving and I just sat down. Let me just get some popcorn instead of the meal I just slaved  over 🌚",
          "created_utc": 1710157050.0
        }
      ]
    },
    {
      "id": "kug4xx1",
      "author": "MaleficentInfant",
      "body": "The “SPIT IT OUT” part is so true, if my brain remembers I’m actually eating food and feels any sort of texture I get overwhelmingly nauseated. I can’t eat without at least two distractions because of this, I hate it so much",
      "created_utc": 1710201644.0,
      "score": 5,
      "context": [
        {
          "id": "kucqpr3",
          "author": "Thedailybee",
          "body": "I feel like that moment when I’m chewing a bite of something I was craving and then suddenly my brain is like “SPIT IT OUT” is my this is ridiculous moment. Bc tf you mean? I can’t just swallow this last bite and be done ?? I HAVE to spit it out? 😒 like bro come ON.\n\nAnd why do I have to distract myself to eat leftovers? Have to have a silly little drink and my silly little videos so my brain doesn’t register we are eating left overs\n\nAnd last one- you know that scene from home alone where he makes his Mac and cheese and then doesn’t get to eat it? Yeah that’s another one because so many times I prepare a meal and sit down to eat it and immediately it’s like okay let’s get a Tupperware bc no way I’m eating this even tho I’m starving and I just sat down. Let me just get some popcorn instead of the meal I just slaved  over 🌚",
          "created_utc": 1710157050.0
        }
      ]
    },
    {
      "id": "kue8jm1",
      "author": "dumbblonde1211",
      "body": "that’s funny i might start using that",
      "created_utc": 1710178353.0,
      "score": 8,
      "context": [
        {
          "id": "kucw1oq",
          "author": "Mx-Helix-pomatia",
          "body": "Help I always refer to my eating disorder as clown disease because it’s so. 🤡",
          "created_utc": 1710159941.0
        }
      ]
    },
    {
      "id": "kucn43y",
      "author": "Waterfalls_x_Thunder",
      "body": "So interesting 🤣\n\nI can eat the top. But never the bottom third.",
      "created_utc": 1710154843.0,
      "score": 19,
      "context": [
        {
          "id": "kuci0j4",
          "author": "geekgeek2019",
          "body": "That’s me with banana. Can’t eat the top and bottom lol",
          "created_utc": 1710151311.0
        }
      ]
    },
    {
      "id": "kue8itl",
      "author": "letfalltheflowers",
      "body": "I am the same way about bananas! I take off the top and eat it and then leave the bottom lol",
      "created_utc": 1710178346.0,
      "score": 4,
      "context": [
        {
          "id": "kuci0j4",
          "author": "geekgeek2019",
          "body": "That’s me with banana. Can’t eat the top and bottom lol",
          "created_utc": 1710151311.0
        }
      ]
    },
    {
      "id": "kufdjc0",
      "author": "FunnelCakeGoblin",
      "body": "I can eat the top but not the bottom. I wonder what would happen if I opened it upside down",
      "created_utc": 1710191892.0,
      "score": 3,
      "context": [
        {
          "id": "kuci0j4",
          "author": "geekgeek2019",
          "body": "That’s me with banana. Can’t eat the top and bottom lol",
          "created_utc": 1710151311.0
        }
      ]
    },
    {
      "id": "kuebnkl",
      "author": "CrisCanadian",
      "body": "I can only eat a banana by breaking pieces off. I can’t eat it like other people do. But right now bananas are off the list so yeah I feel you",
      "created_utc": 1710179394.0,
      "score": 2,
      "context": [
        {
          "id": "kuci0j4",
          "author": "geekgeek2019",
          "body": "That’s me with banana. Can’t eat the top and bottom lol",
          "created_utc": 1710151311.0
        }
      ]
    },
    {
      "id": "kuhhk2v",
      "author": "nevercomestheday",
      "body": "Me but with cucumbers",
      "created_utc": 1710223644.0,
      "score": 1,
      "context": [
        {
          "id": "kuci0j4",
          "author": "geekgeek2019",
          "body": "That’s me with banana. Can’t eat the top and bottom lol",
          "created_utc": 1710151311.0
        }
      ]
    },
    {
      "id": "ky3tabt",
      "author": "None",
      "body": "Can’t eat them all that’s a no food for me, the texture",
      "created_utc": 1712279903.0,
      "score": 1,
      "context": [
        {
          "id": "kuci0j4",
          "author": "geekgeek2019",
          "body": "That’s me with banana. Can’t eat the top and bottom lol",
          "created_utc": 1710151311.0
        }
      ]
    },
    {
      "id": "kue8fqk",
      "author": "dumbblonde1211",
      "body": "it’s crazy to me that people CAN eat meat off the bone. like chicken wings???? but i do love the boneless",
      "created_utc": 1710178317.0,
      "score": 13,
      "context": [
        {
          "id": "kud1o7p",
          "author": "greencash370",
          "body": "It's so stupid that I can't eat on bone meat. But as soon as it's off the bone, it's completely fine! Absolutely wack.",
          "created_utc": 1710162622.0
        }
      ]
    },
    {
      "id": "kudnuts",
      "author": "meghantronn",
      "body": "oh my god me too",
      "created_utc": 1710171362.0,
      "score": 7,
      "context": [
        {
          "id": "kud1o7p",
          "author": "greencash370",
          "body": "It's so stupid that I can't eat on bone meat. But as soon as it's off the bone, it's completely fine! Absolutely wack.",
          "created_utc": 1710162622.0
        }
      ]
    },
    {
      "id": "kufdrtr",
      "author": "FunnelCakeGoblin",
      "body": "Yeahhhhh this he texture is just different. Same meat, same animal, just different.",
      "created_utc": 1710191970.0,
      "score": 3,
      "context": [
        {
          "id": "kud1o7p",
          "author": "greencash370",
          "body": "It's so stupid that I can't eat on bone meat. But as soon as it's off the bone, it's completely fine! Absolutely wack.",
          "created_utc": 1710162622.0
        }
      ]
    },
    {
      "id": "kuhcj9y",
      "author": "Blackroses7894",
      "body": "Same! I can't do chicken wings with the bone but the moment it becomes boneless, my mind gives me the green light to eat it!",
      "created_utc": 1710220406.0,
      "score": 2,
      "context": [
        {
          "id": "kud1o7p",
          "author": "greencash370",
          "body": "It's so stupid that I can't eat on bone meat. But as soon as it's off the bone, it's completely fine! Absolutely wack.",
          "created_utc": 1710162622.0
        }
      ]
    },
    {
      "id": "kufpo4x",
      "author": "KitKatEmmy",
      "body": "SAME",
      "created_utc": 1710195998.0,
      "score": 3,
      "context": [
        {
          "id": "kuchqnm",
          "author": "kinkbongcrazybasin",
          "body": "I'm that way with cheese. The first couple of slices on each end of a block are cursed.",
          "created_utc": 1710151115.0
        }
      ]
    },
    {
      "id": "kudccmv",
      "author": "Accurate-Neck6933",
      "body": "What? Why? Who is mixing milk jugs?",
      "created_utc": 1710167070.0,
      "score": 15,
      "context": [
        {
          "id": "kucc3us",
          "author": "Bankerlady10",
          "body": "Ha! I’m the same with milk. I also won’t mix milks between jugs, I find that gross. I’m sure a jug has a bunch of mixed milk sources in it but in my mind each jug is different milk.",
          "created_utc": 1710146827.0
        }
      ]
    },
    {
      "id": "kucuxsk",
      "author": "oddistrange",
      "body": "Maybe it's my contamination fear, but not transferring milk to a different jug of milk just sounds like best practice food safety wise. At least in our homes. Because like you said the milk we drink is probably the milk of hundreds of cows from many separate containers, but then it gets pasteurized and bottled.",
      "created_utc": 1710159375.0,
      "score": 10,
      "context": [
        {
          "id": "kucc3us",
          "author": "Bankerlady10",
          "body": "Ha! I’m the same with milk. I also won’t mix milks between jugs, I find that gross. I’m sure a jug has a bunch of mixed milk sources in it but in my mind each jug is different milk.",
          "created_utc": 1710146827.0
        }
      ]
    },
    {
      "id": "kug0qnb",
      "author": "amh8011",
      "body": "I can no longer drink normal dairy milk because covid fucked with my immune system in so many ways and now my safe foods are even more limited than just my regular ARFID safe foods. But when I could drink dairy milk I was only able to drink my local store brand milk and every other milk tasted different and I couldn’t drink it. And every so often I’d come across a gallon that tasted so bad but only to me. I’d have other people try it and they said it tasted normal.\n\nBut I can mix plant based milk no problem. In fact I prefer it in some cases. I like mixing the normal oatly oatmilk with the full fat oatly oatmilk because that tastes and feels the best.",
      "created_utc": 1710200037.0,
      "score": 3,
      "context": [
        {
          "id": "kucc3us",
          "author": "Bankerlady10",
          "body": "Ha! I’m the same with milk. I also won’t mix milks between jugs, I find that gross. I’m sure a jug has a bunch of mixed milk sources in it but in my mind each jug is different milk.",
          "created_utc": 1710146827.0
        }
      ]
    },
    {
      "id": "kucvf7m",
      "author": "cleverCLEVERcharming",
      "body": "I HATE eating in front of people too!! And it took me until 36 years old to realize that was the common thread. Even sitting at home with my partner, I need a show on so that I know he’s distracted.",
      "created_utc": 1710159623.0,
      "score": 12,
      "context": [
        {
          "id": "kucciw1",
          "author": "Beginning_Beat_5289",
          "body": "any sort of leftovers\n\ni will never touch vegemite (taste+texture) and sausages(had a bad experience once) - as an aussie i am considered crazy by those around me\n\nim super strict with best before and stuff whitch isn't that bad but my mum is pretty annoying about it\n\ni wont eat when others are around because i am to scared to be judged (not that funny but one of the things not talked about much)\n\ni wont eat food anyone offers me even if it is packaged, same for someone elses untouched meals\n\n&#x200B;\n\ni am weirdly ok with sharing food with my dog - like actualy eating the parts he licked - we shared ice cream a few days ago it felt so good to actualy enjoy ice cream and my dog makes stuff easier",
          "created_utc": 1710147152.0
        }
      ]
    },
    {
      "id": "kucn10w",
      "author": "Waterfalls_x_Thunder",
      "body": "I with you with not eating offered out food. On rare occasions I have considered it. Then people get asked multiple questions. (People I’m comfortable with). \n\nHow long has it been opened?\nWhat time was it opened?\nHow have they been stored?\n\nBut still, it’s usually a big no after lol.",
      "created_utc": 1710154787.0,
      "score": 6,
      "context": [
        {
          "id": "kucciw1",
          "author": "Beginning_Beat_5289",
          "body": "any sort of leftovers\n\ni will never touch vegemite (taste+texture) and sausages(had a bad experience once) - as an aussie i am considered crazy by those around me\n\nim super strict with best before and stuff whitch isn't that bad but my mum is pretty annoying about it\n\ni wont eat when others are around because i am to scared to be judged (not that funny but one of the things not talked about much)\n\ni wont eat food anyone offers me even if it is packaged, same for someone elses untouched meals\n\n&#x200B;\n\ni am weirdly ok with sharing food with my dog - like actualy eating the parts he licked - we shared ice cream a few days ago it felt so good to actualy enjoy ice cream and my dog makes stuff easier",
          "created_utc": 1710147152.0
        }
      ]
    },
    {
      "id": "kudx6x2",
      "author": "mamaxchaos",
      "body": "Water in cups taste like CupTM, not WaterTM and I’ll die on that hill",
      "created_utc": 1710174566.0,
      "score": 14,
      "context": [
        {
          "id": "kuddvf9",
          "author": "Latter-Report-8162",
          "body": "I can’t drink water from a glass. I have to drink it out of a bottle with a sports cap 😂 oh and I can’t drink tap water either. And I don’t care what anyone says bathroom water and kitchen water taste different 😂😂😂",
          "created_utc": 1710167665.0
        }
      ]
    },
    {
      "id": "kudfzhz",
      "author": "fwmh_royale",
      "body": "omg same!! water from a glass is always too warm 😭",
      "created_utc": 1710168476.0,
      "score": 3,
      "context": [
        {
          "id": "kuddvf9",
          "author": "Latter-Report-8162",
          "body": "I can’t drink water from a glass. I have to drink it out of a bottle with a sports cap 😂 oh and I can’t drink tap water either. And I don’t care what anyone says bathroom water and kitchen water taste different 😂😂😂",
          "created_utc": 1710167665.0
        }
      ]
    },
    {
      "id": "kuebh1v",
      "author": "DrG2390",
      "body": "If it helps tap water usually has a bunch of shit in it you don’t want. I agree about the bathroom water vs kitchen water too… before I put my cyclic vomiting in remission I could always tell where the water came from and even in extreme dehydration couldn’t make myself drink enough of it. I would freeze bottles during the day so I didn’t have to go to the kitchen in the middle of the night. Cyclic vomiting doesn’t exactly let you sleep because you’re throwing up every 20 minutes and nauseous the rest of the time, so it was just easier to do all that instead of bugging my husband.",
      "created_utc": 1710179334.0,
      "score": 2,
      "context": [
        {
          "id": "kuddvf9",
          "author": "Latter-Report-8162",
          "body": "I can’t drink water from a glass. I have to drink it out of a bottle with a sports cap 😂 oh and I can’t drink tap water either. And I don’t care what anyone says bathroom water and kitchen water taste different 😂😂😂",
          "created_utc": 1710167665.0
        }
      ]
    },
    {
      "id": "kuk9vv2",
      "author": "SpeakOfTheMe",
      "body": "I’m with you on that one. I only drink bottled water out of a drink bottle, glasses freak me out and tap water is disgusting. I nearly passed out as a kid after not drinking for several days because I only had access to tap water. My parents underestimated how serious I was 😭😂",
      "created_utc": 1710270125.0,
      "score": 2,
      "context": [
        {
          "id": "kuddvf9",
          "author": "Latter-Report-8162",
          "body": "I can’t drink water from a glass. I have to drink it out of a bottle with a sports cap 😂 oh and I can’t drink tap water either. And I don’t care what anyone says bathroom water and kitchen water taste different 😂😂😂",
          "created_utc": 1710167665.0
        }
      ]
    },
    {
      "id": "kutpdtf",
      "author": "Lavender-Boo",
      "body": "i try explain this to people and i look crazy, but water from a glass is just unsafe 🙈",
      "created_utc": 1710419036.0,
      "score": 2,
      "context": [
        {
          "id": "kuddvf9",
          "author": "Latter-Report-8162",
          "body": "I can’t drink water from a glass. I have to drink it out of a bottle with a sports cap 😂 oh and I can’t drink tap water either. And I don’t care what anyone says bathroom water and kitchen water taste different 😂😂😂",
          "created_utc": 1710167665.0
        }
      ]
    },
    {
      "id": "ky3totn",
      "author": "None",
      "body": "Daughter says same thing",
      "created_utc": 1712280064.0,
      "score": 1,
      "context": [
        {
          "id": "kuddvf9",
          "author": "Latter-Report-8162",
          "body": "I can’t drink water from a glass. I have to drink it out of a bottle with a sports cap 😂 oh and I can’t drink tap water either. And I don’t care what anyone says bathroom water and kitchen water taste different 😂😂😂",
          "created_utc": 1710167665.0
        }
      ]
    },
    {
      "id": "kudxcnt",
      "author": "mamaxchaos",
      "body": "This is so fucking niche and I love it bc you’re so right",
      "created_utc": 1710174620.0,
      "score": 7,
      "context": [
        {
          "id": "kud8eaa",
          "author": "Foundation-Used",
          "body": "I feel like it's the Stanford experiment between my gut and my brain. Just a frickin unhinged free-for-all in there.",
          "created_utc": 1710165487.0
        }
      ]
    },
    {
      "id": "kufwpkr",
      "author": "liv21098",
      "body": "Another one is that I would eat chips but wouldn’t eat a potato. Everyone was like 🤔🤔. Again it’s a texture thing but still, it’s funny to look back at it without the whole context😂🫣",
      "created_utc": 1710198521.0,
      "score": 3,
      "context": [
        {
          "id": "kue619m",
          "author": "liv21098",
          "body": "For me it’s the fact that I can eat thin chips, but not thicker ones. Before I knew I had ARFID, I’d say it’s because the thicker ones are ‘too potatoey’. Everyone would always tell me ‘but they’re both potato?!’. \n\nObviously the actually problem is the difference in the texture, which is so much easier to explain to people now 😂",
          "created_utc": 1710177521.0
        }
      ]
    },
    {
      "id": "kuhbegv",
      "author": "TrickyVast1183",
      "body": "Haha yeah. I won’t eat ruffle chips. Not even a texture thing really, they’re the same size but… ruffle chips are a no no",
      "created_utc": 1710219729.0,
      "score": 1,
      "context": [
        {
          "id": "kue619m",
          "author": "liv21098",
          "body": "For me it’s the fact that I can eat thin chips, but not thicker ones. Before I knew I had ARFID, I’d say it’s because the thicker ones are ‘too potatoey’. Everyone would always tell me ‘but they’re both potato?!’. \n\nObviously the actually problem is the difference in the texture, which is so much easier to explain to people now 😂",
          "created_utc": 1710177521.0
        }
      ]
    },
    {
      "id": "kuxz42s",
      "author": "hamforbananas",
      "body": "SAME AND THEY'RE A SAFE FOOD",
      "created_utc": 1710474523.0,
      "score": 1,
      "context": [
        {
          "id": "kud7tr1",
          "author": "TrickyVast1183",
          "body": "Thats like me with hot dogs. Can’t eat the last end bit of the hot dog. I don’t even have a reason, it’s just… “don’t eat that”-brain",
          "created_utc": 1710165254.0
        }
      ]
    },
    {
      "id": "kuhcsgz",
      "author": "Blackroses7894",
      "body": "I try to tell myself this every day lmao Lole it's just spinach or just a carrot NOT a murderer lol still doesn't help though.",
      "created_utc": 1710220563.0,
      "score": 4,
      "context": [
        {
          "id": "kueg8uz",
          "author": "mercurys-daughter",
          "body": "It’s a very unserious condition like why am I scared of broccoli. It can’t hurt u babe relaxxxx",
          "created_utc": 1710180933.0
        }
      ]
    },
    {
      "id": "kudx3iy",
      "author": "mamaxchaos",
      "body": "I have to eat the edges first of all my pop tarts to get the most boring flavor out of the way first. I do the same thing with Reese’s cups lmao",
      "created_utc": 1710174534.0,
      "score": 11,
      "context": [
        {
          "id": "kuci1ni",
          "author": "fwmh_royale",
          "body": "i can't eat the last bite of a banana - weird because i can eat the top part (which is exactly the same) just fine 😭",
          "created_utc": 1710151334.0
        }
      ]
    },
    {
      "id": "kuh15lx",
      "author": "ShimmyPig",
      "body": "No no, that's valid. The bottom is the bananus. Never eat the bananus.",
      "created_utc": 1710214408.0,
      "score": 5,
      "context": [
        {
          "id": "kuci1ni",
          "author": "fwmh_royale",
          "body": "i can't eat the last bite of a banana - weird because i can eat the top part (which is exactly the same) just fine 😭",
          "created_utc": 1710151334.0
        }
      ]
    },
    {
      "id": "kug815r",
      "author": "EwDavid999",
      "body": "The PARTICLES that could float in it... no thank you",
      "created_utc": 1710202825.0,
      "score": 8,
      "context": [
        {
          "id": "kudsq6i",
          "author": "coat_me_in_galaxies",
          "body": "This is so highly specific and weird, but any drink that’s been sitting out uncovered. I won’t touch it. It HAS to have a lid no matter what kind of drink or else I won’t drink it.",
          "created_utc": 1710173057.0
        }
      ]
    },
    {
      "id": "l0pq4ud",
      "author": "Mattfromwii-sports",
      "body": "Ranch is a crime",
      "created_utc": 1713774052.0,
      "score": 3,
      "context": [
        {
          "id": "kuf7zg9",
          "author": "None",
          "body": "Different shapes of pasta can only be eaten with certain sauces. Spaghetti is ranch only, bow tie and penne I can do tomato sauce, and fettuccine is alfredo only. I cannot eat spaghetti with tomato sauce or penne with alfredo or any other combination",
          "created_utc": 1710190049.0
        }
      ]
    },
    {
      "id": "kuhldw7",
      "author": "smoothBrainEnby",
      "body": "Yo same! 😭 was my only source of protein for over 6 years and now i just cant. The texture. Feels rubbery.",
      "created_utc": 1710226342.0,
      "score": 3,
      "context": [
        {
          "id": "kug1ivi",
          "author": "inviktus04",
          "body": "I was telling my ED therapist that I used to eat scrambled eggs all the time, but a few years back I had a bad time with eggs and now eggs are dead to me. \n\n...OH WAIT unless it's a fried egg on a burger with bacon, I FORGOT THAT'S ALSO AN EGG 😮 \n\nHaving that realization in real time with my therapist was fantastic 😂",
          "created_utc": 1710200336.0
        }
      ]
    },
    {
      "id": "kug870f",
      "author": "EwDavid999",
      "body": "The texture should be illegal",
      "created_utc": 1710202886.0,
      "score": 4,
      "context": [
        {
          "id": "kueoa06",
          "author": "flamespond",
          "body": "I can’t eat bread heels",
          "created_utc": 1710183594.0
        }
      ]
    },
    {
      "id": "kuf182m",
      "author": "None",
      "body": "I am like this with burgers!",
      "created_utc": 1710187851.0,
      "score": 4,
      "context": [
        {
          "id": "kue9s36",
          "author": "MzAdventure68",
          "body": "The center of almost any sandwich.  The bread/breading to meat ratio is wrong and can't be eaten.  Especially chicken.",
          "created_utc": 1710178768.0
        }
      ]
    },
    {
      "id": "kugfx7y",
      "author": "misshunnyb23",
      "body": "i can’t eat the mushy parts or soft parts only the crunch or perfectly fried",
      "created_utc": 1710205790.0,
      "score": 7,
      "context": [
        {
          "id": "kuf12x0",
          "author": "None",
          "body": "I can’t eat the crunchy ends of French fries. Every time I eat fries, I leave behind a pile of just the fry ends.",
          "created_utc": 1710187803.0
        }
      ]
    },
    {
      "id": "kuxzb93",
      "author": "hamforbananas",
      "body": "SAME",
      "created_utc": 1710474618.0,
      "score": 1,
      "context": [
        {
          "id": "kuh1b5t",
          "author": "FlyWereAble",
          "body": "I can drink almost anything but for some reason all soup is off the table",
          "created_utc": 1710214479.0
        }
      ]
    },
    {
      "id": "kuemvpb",
      "author": "Naive_Ad_6505",
      "body": "THIS. The last few sips of any drink are basically poison to me I swear",
      "created_utc": 1710183138.0,
      "score": 2,
      "context": [
        {
          "id": "kuegfpl",
          "author": "lizpol20",
          "body": "I can't ever finish a cup of tea - the dregs are just absolutely disgusting to me, like i feel queasy thinking about it!\n\nI also have the \"spit it out\" bit of my brain which leads to almost instant gagging until it's out. Brains are weird!",
          "created_utc": 1710180998.0
        }
      ]
    },
    {
      "id": "kwjev0j",
      "author": "Potential_Ad8222",
      "body": "Bruh Im well aware its not picky eating. Ive struggled with arfid since I was a young child and along with multiple other mental health problems, it is extremely difficult to navigate. I dont eat for days because I also have to be starving to eat and have also seen dieticians and therapists. Ive also been malnourished and underweight in the past and had to be treated for that too and have since recovered. That being said, I am able to see the humor in some of my restrictions that objectively makes no sense or seems really silly and every other person who has replied shared the same sense of humor. You clearly dont and thats fine but dont reply and acuse me and 300 other people of not actually having arfid because we have gotten to a point where we arent wallowing in self pity.",
      "created_utc": 1711397877.0,
      "score": 4,
      "context": [
        {
          "id": "kuqdmsf",
          "author": "None",
          "body": "Nothing about my case of ARFID has been funny. I’ve lost 35 pounds in under a year and stopped having any interest in food. I just stopped eating. I’m 21 years old and have been advised to seek clinical care in a hospital. I vomit every day. I see doctors and dietitians and therapists but at the end of the day it’s all up to me to fix. ARFID is not funny. And there is a difference between being a picky eater and having ARFID. I had the worst year of my life last year which is where this started. Now my life is better and I’m still losing weight. My restriction is everything. If I know I’m going to go somewhere the next day and eat in public or if I know my family/friends are making a meal, I won’t eat anything at all the day before in order to “save room” in my stomach. Basically, I have to be starving to eat a full meal. \n\nIt’s genuinely disturbing to me to read through these comments of people who generalize ARFID as being picky, and people saying it’s hilarious. It is NOT picky eating. It is an intense aversion to food and it’s just not funny at all. This has affected my life beyond what you can even guess. I really would not continue to say ARFID is funny because it is not.",
          "created_utc": 1710362124.0
        }
      ]
    },
    {
      "id": "kuknxme",
      "author": "None",
      "body": "I cant eat meals without water",
      "created_utc": 1710275103.0,
      "score": 1,
      "context": [
        {
          "id": "kufadwj",
          "author": "Letshavemorefun",
          "body": "I can’t drink water with meals and never at room temperature. Has to be cold and I have to have no other taste in my mouth.",
          "created_utc": 1710190835.0
        }
      ]
    },
    {
      "id": "kuko7ae",
      "author": "None",
      "body": "I pretty much have this same experience",
      "created_utc": 1710275198.0,
      "score": 1,
      "context": [
        {
          "id": "kukhopd",
          "author": "Leticia_the_bookworm",
          "body": "As a kid, I couldn't bear unsafe foods touching or even being near anything I ate. If we ordered pizza and it came with olives or onion, I couldn't just take them out and eat - it was permanently contaminated. If there was anything unsafe served on the table, I had to almost bury my head in my chest and pretend really hard it wasn't there, because otherwise I wouldn't be able to eat. And I'm not even talking about doing dishes - I found it so repulsive to think my plates and utensils were washed with the same sponge as all the other stuff.",
          "created_utc": 1710272907.0
        }
      ]
    },
    {
      "id": "kug0dsg",
      "author": "inviktus04",
      "body": "Love this energy! So supportive 🖤",
      "created_utc": 1710199901.0,
      "score": 16,
      "context": [
        {
          "id": "kuccomc",
          "author": "Emergency_Dinner_739",
          "body": "I always leave one bite of something left..? Literally whatever i may be eating, I’ll leave a bite left. No clue why I just don’t want that last bite.",
          "created_utc": 1710147278.0
        },
        {
          "id": "kudgrzi",
          "author": "kmfoh",
          "body": "We call this “the bad part” and my husband has tried gaming my plate by putting one thing he know I won’t eat on it, so that can be “the bad part” and I can eat every bite of the things I really do enjoy 😂",
          "created_utc": 1710168773.0
        }
      ]
    },
    {
      "id": "lnl7box",
      "author": "Upset_Book_6643",
      "body": "Great tactic.  I enjoy leaving a bite on my plate. It’s not a negative for me.",
      "created_utc": 1726588801.0,
      "score": 2,
      "context": [
        {
          "id": "kuccomc",
          "author": "Emergency_Dinner_739",
          "body": "I always leave one bite of something left..? Literally whatever i may be eating, I’ll leave a bite left. No clue why I just don’t want that last bite.",
          "created_utc": 1710147278.0
        },
        {
          "id": "kudgrzi",
          "author": "kmfoh",
          "body": "We call this “the bad part” and my husband has tried gaming my plate by putting one thing he know I won’t eat on it, so that can be “the bad part” and I can eat every bite of the things I really do enjoy 😂",
          "created_utc": 1710168773.0
        }
      ]
    },
    {
      "id": "kueae55",
      "author": "DrG2390",
      "body": "It really is… I can be eating and liking my food and then it’s as if a switch flips and I don’t want it anywhere near me.",
      "created_utc": 1710178975.0,
      "score": 11,
      "context": [
        {
          "id": "kuccomc",
          "author": "Emergency_Dinner_739",
          "body": "I always leave one bite of something left..? Literally whatever i may be eating, I’ll leave a bite left. No clue why I just don’t want that last bite.",
          "created_utc": 1710147278.0
        },
        {
          "id": "kud1si0",
          "author": "redditsayd",
          "body": "SAME it’s literally repulsive",
          "created_utc": 1710162675.0
        }
      ]
    },
    {
      "id": "kufz48j",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1710199423.0,
      "score": 2,
      "context": [
        {
          "id": "kuccomc",
          "author": "Emergency_Dinner_739",
          "body": "I always leave one bite of something left..? Literally whatever i may be eating, I’ll leave a bite left. No clue why I just don’t want that last bite.",
          "created_utc": 1710147278.0
        },
        {
          "id": "kudlskb",
          "author": "FunkyChickenHouse",
          "body": "Oh man I’m the opposite i NEED to have the last bite, i think it’s an OCD thing for me though",
          "created_utc": 1710170619.0
        }
      ]
    },
    {
      "id": "kuk9lko",
      "author": "jenniferlynne08",
      "body": "I do this one AND the last bite is cursed thing! But neither 100% of the time. So it’s always a really fun gambling game to decide if I’m saving my perfect bite for last or not 😂",
      "created_utc": 1710270024.0,
      "score": 1,
      "context": [
        {
          "id": "kuccomc",
          "author": "Emergency_Dinner_739",
          "body": "I always leave one bite of something left..? Literally whatever i may be eating, I’ll leave a bite left. No clue why I just don’t want that last bite.",
          "created_utc": 1710147278.0
        },
        {
          "id": "kujhwtr",
          "author": "rabbit7891",
          "body": "i do the opposite and eat the bad bite first so the last bite is the “perfect bite”",
          "created_utc": 1710260908.0
        }
      ]
    },
    {
      "id": "l4rlpcn",
      "author": "Lucky_Independent_80",
      "body": "It’s always so disappointing when your bite is not as perfect and the bite before was better 😭 So much dissatisfaction",
      "created_utc": 1716142438.0,
      "score": 1,
      "context": [
        {
          "id": "kuccomc",
          "author": "Emergency_Dinner_739",
          "body": "I always leave one bite of something left..? Literally whatever i may be eating, I’ll leave a bite left. No clue why I just don’t want that last bite.",
          "created_utc": 1710147278.0
        },
        {
          "id": "kujhwtr",
          "author": "rabbit7891",
          "body": "i do the opposite and eat the bad bite first so the last bite is the “perfect bite”",
          "created_utc": 1710260908.0
        }
      ]
    },
    {
      "id": "kucu0jd",
      "author": "EternalOptomist4Hire",
      "body": "My mom always calls me “the girl from Signs” 😂",
      "created_utc": 1710158894.0,
      "score": 7,
      "context": [
        {
          "id": "kucdzsg",
          "author": "Ok-Committee-5867",
          "body": "I struggle with water bottles… if I leave one somewhere and then come back to it I can’t drink the water. It’s like it’s become contaminated lol. It’s weird. So I try to remember to take it with me between rooms so I’ll drink it",
          "created_utc": 1710148306.0
        },
        {
          "id": "kuci048",
          "author": "cweezie",
          "body": "reminds me of the little girl in Signs",
          "created_utc": 1710151303.0
        }
      ]
    },
    {
      "id": "kucqqyd",
      "author": "Ok-Committee-5867",
      "body": "Yeppp. It’s a tough one. If it goes out of my sight, I struggle to eat or drink it",
      "created_utc": 1710157070.0,
      "score": 4,
      "context": [
        {
          "id": "kucdzsg",
          "author": "Ok-Committee-5867",
          "body": "I struggle with water bottles… if I leave one somewhere and then come back to it I can’t drink the water. It’s like it’s become contaminated lol. It’s weird. So I try to remember to take it with me between rooms so I’ll drink it",
          "created_utc": 1710148306.0
        },
        {
          "id": "kucmtx3",
          "author": "Waterfalls_x_Thunder",
          "body": "I’m the same! I can’t leave things unattended and expect to drink it after. It’s definitely as though it’s no longer safe.",
          "created_utc": 1710154657.0
        }
      ]
    },
    {
      "id": "ky3t5fj",
      "author": "None",
      "body": "Me too",
      "created_utc": 1712279850.0,
      "score": 1,
      "context": [
        {
          "id": "kucdzsg",
          "author": "Ok-Committee-5867",
          "body": "I struggle with water bottles… if I leave one somewhere and then come back to it I can’t drink the water. It’s like it’s become contaminated lol. It’s weird. So I try to remember to take it with me between rooms so I’ll drink it",
          "created_utc": 1710148306.0
        },
        {
          "id": "kucmtx3",
          "author": "Waterfalls_x_Thunder",
          "body": "I’m the same! I can’t leave things unattended and expect to drink it after. It’s definitely as though it’s no longer safe.",
          "created_utc": 1710154657.0
        }
      ]
    },
    {
      "id": "kudmxm7",
      "author": "Ok-Committee-5867",
      "body": "I consider my room safe aswell! \nSometimes if I need to do something else while I’m eating I’ll take my food to my room, go do the thing (like move laundry to the dryer) and then get my food out of my room. It makes me feel better about it. I know it’s probably not the best but it’s hard not to when everything around food is so stressful, if I can manage just one part I don’t think I really care how odd it seems.",
      "created_utc": 1710171028.0,
      "score": 2,
      "context": [
        {
          "id": "kucdzsg",
          "author": "Ok-Committee-5867",
          "body": "I struggle with water bottles… if I leave one somewhere and then come back to it I can’t drink the water. It’s like it’s become contaminated lol. It’s weird. So I try to remember to take it with me between rooms so I’ll drink it",
          "created_utc": 1710148306.0
        },
        {
          "id": "kudlvw8",
          "author": "FunkyChickenHouse",
          "body": "Same! Only time I will is if it’s like in my room or somewhere “safe”",
          "created_utc": 1710170652.0
        }
      ]
    },
    {
      "id": "kutejvc",
      "author": "Ok-Committee-5867",
      "body": "I feel this a lot. I drink from disposable water bottles cause I can’t clean a reusable one enough to feel safe with it. \n\nWhen I try to hand wash things up I just wash it over and over again because it doesn’t feel clean to me. \n\nI also worry about eating soap. I was literally making a smoothie today and I had to wash up the blade for the blender and I was nervous that I hadn’t rinsed the soap off enough and that my smoothie was all soapy. It seemed okay when I blended it up but the cup and blade still smelt soapy and weird. It’s really hard, I feel like I’m crazy sometimes. Constantly checking if things are clean. \n\nI also have ocd but I believe a lot of food and contamination things overlap with arfid.",
      "created_utc": 1710413149.0,
      "score": 6,
      "context": [
        {
          "id": "kucdzsg",
          "author": "Ok-Committee-5867",
          "body": "I struggle with water bottles… if I leave one somewhere and then come back to it I can’t drink the water. It’s like it’s become contaminated lol. It’s weird. So I try to remember to take it with me between rooms so I’ll drink it",
          "created_utc": 1710148306.0
        },
        {
          "id": "kusu79w",
          "author": "PercentageWide6608",
          "body": "YES I got a stanely cup as a gift and it just feels like gross. I don't feel like it's ever completely clean. I use disposable dishes for the most part because of my fears of dishes and their being leftover grime and stuff in them. I feel like they're never clean enough, ESPECIALLY when they've been sitting in the seek for a week. I genuinely have the impulse to throw the dishes away when they've been sitting like that but I know it's wasteful I just can't help it it feels so dirty even when they've been \"cleaned\". Handwashing doesn't feel enough, the dishwasher doesn't feel enough, and I always fear that I'm drinking/eating soap too after trying to hand wash stuff.",
          "created_utc": 1710398356.0
        }
      ]
    },
    {
      "id": "kuneb0d",
      "author": "Ok-Committee-5867",
      "body": "Female! \n\nIt could be part of it? For me I’m convinced someone has altered my drink while I wasn’t looking. Although it’s quite irrational in this case as I’m just in my own home. \n\nBut I think if I went out and about more often I would feel definitely more worried about the possibility of strangers adding something to my drink. \n\n\nI also have contamination ocd so I’m unsure where this specific thing comes from since all my behaviours and symptoms kind of mixes together for me.",
      "created_utc": 1710318974.0,
      "score": 2,
      "context": [
        {
          "id": "kucdzsg",
          "author": "Ok-Committee-5867",
          "body": "I struggle with water bottles… if I leave one somewhere and then come back to it I can’t drink the water. It’s like it’s become contaminated lol. It’s weird. So I try to remember to take it with me between rooms so I’ll drink it",
          "created_utc": 1710148306.0
        },
        {
          "id": "kuk9ucv",
          "author": "jenniferlynne08",
          "body": "If you’re comfy sharing it, what gender were you raised as? Bc I do this too and I’ve always wondered if it’s like something programmed hard in my brain so as to avoid getting roofied or whatever",
          "created_utc": 1710270110.0
        }
      ]
    },
    {
      "id": "kuhj2sl",
      "author": "kmfoh",
      "body": "My kid calls them “the domes” and she vacillates between ONLY eating them and being repulsed by them.",
      "created_utc": 1710224694.0,
      "score": 1,
      "context": [
        {
          "id": "kuci0j4",
          "author": "geekgeek2019",
          "body": "That’s me with banana. Can’t eat the top and bottom lol",
          "created_utc": 1710151311.0
        },
        {
          "id": "kue8itl",
          "author": "letfalltheflowers",
          "body": "I am the same way about bananas! I take off the top and eat it and then leave the bottom lol",
          "created_utc": 1710178346.0
        }
      ]
    },
    {
      "id": "kug0tou",
      "author": "inviktus04",
      "body": "I had built up the courage to eat bananas and for a while I ate one nearly every day. Then I had a banana with a SUPER thick core... 🤢 \n\nT'was my last banana. It's been nearly 5 years. 😂😭",
      "created_utc": 1710200069.0,
      "score": 5,
      "context": [
        {
          "id": "kuci0j4",
          "author": "geekgeek2019",
          "body": "That’s me with banana. Can’t eat the top and bottom lol",
          "created_utc": 1710151311.0
        },
        {
          "id": "kufdjc0",
          "author": "FunnelCakeGoblin",
          "body": "I can eat the top but not the bottom. I wonder what would happen if I opened it upside down",
          "created_utc": 1710191892.0
        }
      ]
    },
    {
      "id": "lnl7q0d",
      "author": "Upset_Book_6643",
      "body": "I’ve tried it. It’s weird! Lol. But easier to peel.  I still didn’t like that end of the banana",
      "created_utc": 1726588929.0,
      "score": 2,
      "context": [
        {
          "id": "kuci0j4",
          "author": "geekgeek2019",
          "body": "That’s me with banana. Can’t eat the top and bottom lol",
          "created_utc": 1710151311.0
        },
        {
          "id": "kufdjc0",
          "author": "FunnelCakeGoblin",
          "body": "I can eat the top but not the bottom. I wonder what would happen if I opened it upside down",
          "created_utc": 1710191892.0
        }
      ]
    },
    {
      "id": "ky3tiw7",
      "author": "None",
      "body": "Same here. Daughter orders wings with bones I get boneless. I’m super picky about meat. There can be no veins or bloody parts or dark meat. I inspect each piece carefully before eating it",
      "created_utc": 1712279998.0,
      "score": 5,
      "context": [
        {
          "id": "kud1o7p",
          "author": "greencash370",
          "body": "It's so stupid that I can't eat on bone meat. But as soon as it's off the bone, it's completely fine! Absolutely wack.",
          "created_utc": 1710162622.0
        },
        {
          "id": "kue8fqk",
          "author": "dumbblonde1211",
          "body": "it’s crazy to me that people CAN eat meat off the bone. like chicken wings???? but i do love the boneless",
          "created_utc": 1710178317.0
        }
      ]
    },
    {
      "id": "kuh1185",
      "author": "kinkbongcrazybasin",
      "body": "It can be embarrassing since I don't know how to explain that it's cursed. At least I don't live alone, so the cursed cheese doesn't go to waste.",
      "created_utc": 1710214352.0,
      "score": 3,
      "context": [
        {
          "id": "kuchqnm",
          "author": "kinkbongcrazybasin",
          "body": "I'm that way with cheese. The first couple of slices on each end of a block are cursed.",
          "created_utc": 1710151115.0
        },
        {
          "id": "kufpo4x",
          "author": "KitKatEmmy",
          "body": "SAME",
          "created_utc": 1710195998.0
        }
      ]
    },
    {
      "id": "kuh3axl",
      "author": "Bankerlady10",
      "body": "When I pour out a glass and it doesn’t fill the glass, I won’t pour in another jug to top up that glass.",
      "created_utc": 1710215427.0,
      "score": 6,
      "context": [
        {
          "id": "kucc3us",
          "author": "Bankerlady10",
          "body": "Ha! I’m the same with milk. I also won’t mix milks between jugs, I find that gross. I’m sure a jug has a bunch of mixed milk sources in it but in my mind each jug is different milk.",
          "created_utc": 1710146827.0
        },
        {
          "id": "kudccmv",
          "author": "Accurate-Neck6933",
          "body": "What? Why? Who is mixing milk jugs?",
          "created_utc": 1710167070.0
        }
      ]
    },
    {
      "id": "kulsa11",
      "author": "BlanKitt",
      "body": "Re dairy milk:\n\nI'm (mostly) a super taster, and milk from the same brand can have different tastes all the time. I suspect moooost of the time it's because it's a seasonal difference I can usually taste, and it's kind of funny to tell people that milk can have a seasonal tasting difference lol",
      "created_utc": 1710289242.0,
      "score": 2,
      "context": [
        {
          "id": "kucc3us",
          "author": "Bankerlady10",
          "body": "Ha! I’m the same with milk. I also won’t mix milks between jugs, I find that gross. I’m sure a jug has a bunch of mixed milk sources in it but in my mind each jug is different milk.",
          "created_utc": 1710146827.0
        },
        {
          "id": "kug0qnb",
          "author": "amh8011",
          "body": "I can no longer drink normal dairy milk because covid fucked with my immune system in so many ways and now my safe foods are even more limited than just my regular ARFID safe foods. But when I could drink dairy milk I was only able to drink my local store brand milk and every other milk tasted different and I couldn’t drink it. And every so often I’d come across a gallon that tasted so bad but only to me. I’d have other people try it and they said it tasted normal.\n\nBut I can mix plant based milk no problem. In fact I prefer it in some cases. I like mixing the normal oatly oatmilk with the full fat oatly oatmilk because that tastes and feels the best.",
          "created_utc": 1710200037.0
        }
      ]
    },
    {
      "id": "kudos4i",
      "author": "Latter-Report-8162",
      "body": "Just tastes nasty 😂",
      "created_utc": 1710171688.0,
      "score": 2,
      "context": [
        {
          "id": "kuddvf9",
          "author": "Latter-Report-8162",
          "body": "I can’t drink water from a glass. I have to drink it out of a bottle with a sports cap 😂 oh and I can’t drink tap water either. And I don’t care what anyone says bathroom water and kitchen water taste different 😂😂😂",
          "created_utc": 1710167665.0
        },
        {
          "id": "kudfzhz",
          "author": "fwmh_royale",
          "body": "omg same!! water from a glass is always too warm 😭",
          "created_utc": 1710168476.0
        }
      ]
    },
    {
      "id": "kuhe622",
      "author": "pumpkinstylecoach",
      "body": "I love all things potato except for mashed potato (because of the texture) and people think that's weird too!",
      "created_utc": 1710221425.0,
      "score": 2,
      "context": [
        {
          "id": "kue619m",
          "author": "liv21098",
          "body": "For me it’s the fact that I can eat thin chips, but not thicker ones. Before I knew I had ARFID, I’d say it’s because the thicker ones are ‘too potatoey’. Everyone would always tell me ‘but they’re both potato?!’. \n\nObviously the actually problem is the difference in the texture, which is so much easier to explain to people now 😂",
          "created_utc": 1710177521.0
        },
        {
          "id": "kufwpkr",
          "author": "liv21098",
          "body": "Another one is that I would eat chips but wouldn’t eat a potato. Everyone was like 🤔🤔. Again it’s a texture thing but still, it’s funny to look back at it without the whole context😂🫣",
          "created_utc": 1710198521.0
        }
      ]
    },
    {
      "id": "kufdz6r",
      "author": "FunnelCakeGoblin",
      "body": "Me too!!!! My friends think it’s funny, but I just want to get the gross part out of the way so I can enjoy the rest!",
      "created_utc": 1710192035.0,
      "score": 2,
      "context": [
        {
          "id": "kuci1ni",
          "author": "fwmh_royale",
          "body": "i can't eat the last bite of a banana - weird because i can eat the top part (which is exactly the same) just fine 😭",
          "created_utc": 1710151334.0
        },
        {
          "id": "kudx3iy",
          "author": "mamaxchaos",
          "body": "I have to eat the edges first of all my pop tarts to get the most boring flavor out of the way first. I do the same thing with Reese’s cups lmao",
          "created_utc": 1710174534.0
        }
      ]
    },
    {
      "id": "kult44q",
      "author": "BlanKitt",
      "body": "I slapped my desk because I laughed so hard at \"bananus\".",
      "created_utc": 1710289564.0,
      "score": 3,
      "context": [
        {
          "id": "kuci1ni",
          "author": "fwmh_royale",
          "body": "i can't eat the last bite of a banana - weird because i can eat the top part (which is exactly the same) just fine 😭",
          "created_utc": 1710151334.0
        },
        {
          "id": "kuh15lx",
          "author": "ShimmyPig",
          "body": "No no, that's valid. The bottom is the bananus. Never eat the bananus.",
          "created_utc": 1710214408.0
        }
      ]
    },
    {
      "id": "kug88gv",
      "author": "coat_me_in_galaxies",
      "body": "One time I left a can of coke outside a little too long without drinking and when I went to take a sip next there was a BEE inside the can. Probably explains my straw usage lmao",
      "created_utc": 1710202901.0,
      "score": 4,
      "context": [
        {
          "id": "kudsq6i",
          "author": "coat_me_in_galaxies",
          "body": "This is so highly specific and weird, but any drink that’s been sitting out uncovered. I won’t touch it. It HAS to have a lid no matter what kind of drink or else I won’t drink it.",
          "created_utc": 1710173057.0
        },
        {
          "id": "kug815r",
          "author": "EwDavid999",
          "body": "The PARTICLES that could float in it... no thank you",
          "created_utc": 1710202825.0
        }
      ]
    },
    {
      "id": "l0qw3x6",
      "author": "None",
      "body": "That’s fair",
      "created_utc": 1713796420.0,
      "score": 1,
      "context": [
        {
          "id": "kuf7zg9",
          "author": "None",
          "body": "Different shapes of pasta can only be eaten with certain sauces. Spaghetti is ranch only, bow tie and penne I can do tomato sauce, and fettuccine is alfredo only. I cannot eat spaghetti with tomato sauce or penne with alfredo or any other combination",
          "created_utc": 1710190049.0
        },
        {
          "id": "l0pq4ud",
          "author": "Mattfromwii-sports",
          "body": "Ranch is a crime",
          "created_utc": 1713774052.0
        }
      ]
    },
    {
      "id": "kuibhhy",
      "author": "inviktus04",
      "body": "SO RUBBERY 💔",
      "created_utc": 1710244523.0,
      "score": 2,
      "context": [
        {
          "id": "kug1ivi",
          "author": "inviktus04",
          "body": "I was telling my ED therapist that I used to eat scrambled eggs all the time, but a few years back I had a bad time with eggs and now eggs are dead to me. \n\n...OH WAIT unless it's a fried egg on a burger with bacon, I FORGOT THAT'S ALSO AN EGG 😮 \n\nHaving that realization in real time with my therapist was fantastic 😂",
          "created_utc": 1710200336.0
        },
        {
          "id": "kuhldw7",
          "author": "smoothBrainEnby",
          "body": "Yo same! 😭 was my only source of protein for over 6 years and now i just cant. The texture. Feels rubbery.",
          "created_utc": 1710226342.0
        }
      ]
    },
    {
      "id": "kugg9oq",
      "author": "None",
      "body": "Ha, we would make great friends! Together we could finish an order of fries! 🤣🍟",
      "created_utc": 1710205914.0,
      "score": 5,
      "context": [
        {
          "id": "kuf12x0",
          "author": "None",
          "body": "I can’t eat the crunchy ends of French fries. Every time I eat fries, I leave behind a pile of just the fry ends.",
          "created_utc": 1710187803.0
        },
        {
          "id": "kugfx7y",
          "author": "misshunnyb23",
          "body": "i can’t eat the mushy parts or soft parts only the crunch or perfectly fried",
          "created_utc": 1710205790.0
        }
      ]
    },
    {
      "id": "kugga6o",
      "author": "None",
      "body": "Ha, we would make great friends! Together we could finish an order of fries! 🤣🍟",
      "created_utc": 1710205918.0,
      "score": 1,
      "context": [
        {
          "id": "kuf12x0",
          "author": "None",
          "body": "I can’t eat the crunchy ends of French fries. Every time I eat fries, I leave behind a pile of just the fry ends.",
          "created_utc": 1710187803.0
        },
        {
          "id": "kugfx7y",
          "author": "misshunnyb23",
          "body": "i can’t eat the mushy parts or soft parts only the crunch or perfectly fried",
          "created_utc": 1710205790.0
        }
      ]
    },
    {
      "id": "kwqhies",
      "author": "None",
      "body": "I definitely, absolutely, 100% am accusing the people with some picky eating as not having ARFID. Whether that’s 300 people or not. I understand finding humor in stuff like this to cope, but the way I read all of this was that ARFID is funny. It’s not funny, it’s not low-key hilarious. Some quirks can be funny I suppose, to each their own. I wouldn’t say I’m wallowing in self pity lol I definitely pity myself and that’s why I’m getting help. If sharing my story is wallowing in self pity then alright I guess. You shouldn’t care what I think, just like I don’t care that I’m the only one with sense. Genuinely though, good luck to you and your health. ARFID sucks.",
      "created_utc": 1711502812.0,
      "score": 2,
      "context": [
        {
          "id": "kuqdmsf",
          "author": "None",
          "body": "Nothing about my case of ARFID has been funny. I’ve lost 35 pounds in under a year and stopped having any interest in food. I just stopped eating. I’m 21 years old and have been advised to seek clinical care in a hospital. I vomit every day. I see doctors and dietitians and therapists but at the end of the day it’s all up to me to fix. ARFID is not funny. And there is a difference between being a picky eater and having ARFID. I had the worst year of my life last year which is where this started. Now my life is better and I’m still losing weight. My restriction is everything. If I know I’m going to go somewhere the next day and eat in public or if I know my family/friends are making a meal, I won’t eat anything at all the day before in order to “save room” in my stomach. Basically, I have to be starving to eat a full meal. \n\nIt’s genuinely disturbing to me to read through these comments of people who generalize ARFID as being picky, and people saying it’s hilarious. It is NOT picky eating. It is an intense aversion to food and it’s just not funny at all. This has affected my life beyond what you can even guess. I really would not continue to say ARFID is funny because it is not.",
          "created_utc": 1710362124.0
        },
        {
          "id": "kwjev0j",
          "author": "Potential_Ad8222",
          "body": "Bruh Im well aware its not picky eating. Ive struggled with arfid since I was a young child and along with multiple other mental health problems, it is extremely difficult to navigate. I dont eat for days because I also have to be starving to eat and have also seen dieticians and therapists. Ive also been malnourished and underweight in the past and had to be treated for that too and have since recovered. That being said, I am able to see the humor in some of my restrictions that objectively makes no sense or seems really silly and every other person who has replied shared the same sense of humor. You clearly dont and thats fine but dont reply and acuse me and 300 other people of not actually having arfid because we have gotten to a point where we arent wallowing in self pity.",
          "created_utc": 1711397877.0
        }
      ]
    },
    {
      "id": "kukoh71",
      "author": "Letshavemorefun",
      "body": "Okay",
      "created_utc": 1710275295.0,
      "score": 1,
      "context": [
        {
          "id": "kufadwj",
          "author": "Letshavemorefun",
          "body": "I can’t drink water with meals and never at room temperature. Has to be cold and I have to have no other taste in my mouth.",
          "created_utc": 1710190835.0
        },
        {
          "id": "kuknxme",
          "author": "None",
          "body": "I cant eat meals without water",
          "created_utc": 1710275103.0
        }
      ]
    },
    {
      "id": "kugeyhr",
      "author": "FunkyChickenHouse",
      "body": "I guess there just wouldn’t be a last bite because there wouldn’t have even been a first",
      "created_utc": 1710205430.0,
      "score": 1,
      "context": [
        {
          "id": "kuccomc",
          "author": "Emergency_Dinner_739",
          "body": "I always leave one bite of something left..? Literally whatever i may be eating, I’ll leave a bite left. No clue why I just don’t want that last bite.",
          "created_utc": 1710147278.0
        },
        {
          "id": "kudlskb",
          "author": "FunkyChickenHouse",
          "body": "Oh man I’m the opposite i NEED to have the last bite, i think it’s an OCD thing for me though",
          "created_utc": 1710170619.0
        },
        {
          "id": "kufz48j",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1710199423.0
        }
      ]
    },
    {
      "id": "kudn0c9",
      "author": "Ok-Committee-5867",
      "body": "Is it a show? I’ve never heard of this before 🤔",
      "created_utc": 1710171055.0,
      "score": 1,
      "context": [
        {
          "id": "kucdzsg",
          "author": "Ok-Committee-5867",
          "body": "I struggle with water bottles… if I leave one somewhere and then come back to it I can’t drink the water. It’s like it’s become contaminated lol. It’s weird. So I try to remember to take it with me between rooms so I’ll drink it",
          "created_utc": 1710148306.0
        },
        {
          "id": "kuci048",
          "author": "cweezie",
          "body": "reminds me of the little girl in Signs",
          "created_utc": 1710151303.0
        },
        {
          "id": "kucu0jd",
          "author": "EternalOptomist4Hire",
          "body": "My mom always calls me “the girl from Signs” 😂",
          "created_utc": 1710158894.0
        }
      ]
    },
    {
      "id": "kuwq7au",
      "author": "PercentageWide6608",
      "body": "That makes sense I totally relate to that 100% that's why I stay out of the kitchen most of the time I've realized. I hate the idea of soapy food. It makes sense you have OCD too.",
      "created_utc": 1710456667.0,
      "score": 1,
      "context": [
        {
          "id": "kucdzsg",
          "author": "Ok-Committee-5867",
          "body": "I struggle with water bottles… if I leave one somewhere and then come back to it I can’t drink the water. It’s like it’s become contaminated lol. It’s weird. So I try to remember to take it with me between rooms so I’ll drink it",
          "created_utc": 1710148306.0
        },
        {
          "id": "kusu79w",
          "author": "PercentageWide6608",
          "body": "YES I got a stanely cup as a gift and it just feels like gross. I don't feel like it's ever completely clean. I use disposable dishes for the most part because of my fears of dishes and their being leftover grime and stuff in them. I feel like they're never clean enough, ESPECIALLY when they've been sitting in the seek for a week. I genuinely have the impulse to throw the dishes away when they've been sitting like that but I know it's wasteful I just can't help it it feels so dirty even when they've been \"cleaned\". Handwashing doesn't feel enough, the dishwasher doesn't feel enough, and I always fear that I'm drinking/eating soap too after trying to hand wash stuff.",
          "created_utc": 1710398356.0
        },
        {
          "id": "kutejvc",
          "author": "Ok-Committee-5867",
          "body": "I feel this a lot. I drink from disposable water bottles cause I can’t clean a reusable one enough to feel safe with it. \n\nWhen I try to hand wash things up I just wash it over and over again because it doesn’t feel clean to me. \n\nI also worry about eating soap. I was literally making a smoothie today and I had to wash up the blade for the blender and I was nervous that I hadn’t rinsed the soap off enough and that my smoothie was all soapy. It seemed okay when I blended it up but the cup and blade still smelt soapy and weird. It’s really hard, I feel like I’m crazy sometimes. Constantly checking if things are clean. \n\nI also have ocd but I believe a lot of food and contamination things overlap with arfid.",
          "created_utc": 1710413149.0
        }
      ]
    },
    {
      "id": "kur317g",
      "author": "jenniferlynne08",
      "body": "I don’t have any answers but I do have the highest level of empathy bc this all sounds like exactly what I experience. I have the fear of * something * altering my drink even when I’m just in my own home — which is where I am any time I’m not at work. \n\nI don’t have an OCD diagnosis, but I do have ARFID, autism and adhd and a high suspicion of ocd that plays into the other things based on my own behavior (hoping I don’t sound like one of the TikTok gen z ppl that think they’re ocd bc they like their shit organized haha, I’ve genuinely noticed clinical OCD behavior in myself for years)\n\nAnd I’m just … yeah like if my drink or food isn’t with me and I walk away and come back to it, if it wasn’t sealed while I was away it’s Not Safe anymore.",
      "created_utc": 1710370708.0,
      "score": 1,
      "context": [
        {
          "id": "kucdzsg",
          "author": "Ok-Committee-5867",
          "body": "I struggle with water bottles… if I leave one somewhere and then come back to it I can’t drink the water. It’s like it’s become contaminated lol. It’s weird. So I try to remember to take it with me between rooms so I’ll drink it",
          "created_utc": 1710148306.0
        },
        {
          "id": "kuk9ucv",
          "author": "jenniferlynne08",
          "body": "If you’re comfy sharing it, what gender were you raised as? Bc I do this too and I’ve always wondered if it’s like something programmed hard in my brain so as to avoid getting roofied or whatever",
          "created_utc": 1710270110.0
        },
        {
          "id": "kuneb0d",
          "author": "Ok-Committee-5867",
          "body": "Female! \n\nIt could be part of it? For me I’m convinced someone has altered my drink while I wasn’t looking. Although it’s quite irrational in this case as I’m just in my own home. \n\nBut I think if I went out and about more often I would feel definitely more worried about the possibility of strangers adding something to my drink. \n\n\nI also have contamination ocd so I’m unsure where this specific thing comes from since all my behaviours and symptoms kind of mixes together for me.",
          "created_utc": 1710318974.0
        }
      ]
    },
    {
      "id": "kuhjb08",
      "author": "kmfoh",
      "body": "My husband eats all of the “bad” bites. I wonder how much food waste there would be in a couple where both had disordered eating 😬",
      "created_utc": 1710224855.0,
      "score": 4,
      "context": [
        {
          "id": "kuchqnm",
          "author": "kinkbongcrazybasin",
          "body": "I'm that way with cheese. The first couple of slices on each end of a block are cursed.",
          "created_utc": 1710151115.0
        },
        {
          "id": "kufpo4x",
          "author": "KitKatEmmy",
          "body": "SAME",
          "created_utc": 1710195998.0
        },
        {
          "id": "kuh1185",
          "author": "kinkbongcrazybasin",
          "body": "It can be embarrassing since I don't know how to explain that it's cursed. At least I don't live alone, so the cursed cheese doesn't go to waste.",
          "created_utc": 1710214352.0
        }
      ]
    },
    {
      "id": "kunjwc8",
      "author": "Accurate-Neck6933",
      "body": "Oh!! I get it.",
      "created_utc": 1710323121.0,
      "score": 2,
      "context": [
        {
          "id": "kucc3us",
          "author": "Bankerlady10",
          "body": "Ha! I’m the same with milk. I also won’t mix milks between jugs, I find that gross. I’m sure a jug has a bunch of mixed milk sources in it but in my mind each jug is different milk.",
          "created_utc": 1710146827.0
        },
        {
          "id": "kudccmv",
          "author": "Accurate-Neck6933",
          "body": "What? Why? Who is mixing milk jugs?",
          "created_utc": 1710167070.0
        },
        {
          "id": "kuh3axl",
          "author": "Bankerlady10",
          "body": "When I pour out a glass and it doesn’t fill the glass, I won’t pour in another jug to top up that glass.",
          "created_utc": 1710215427.0
        }
      ]
    },
    {
      "id": "kum3hng",
      "author": "amh8011",
      "body": "I suspect I’m a super taster as well. Sorry if this is a stupid question but is there a test for that?",
      "created_utc": 1710293537.0,
      "score": 1,
      "context": [
        {
          "id": "kucc3us",
          "author": "Bankerlady10",
          "body": "Ha! I’m the same with milk. I also won’t mix milks between jugs, I find that gross. I’m sure a jug has a bunch of mixed milk sources in it but in my mind each jug is different milk.",
          "created_utc": 1710146827.0
        },
        {
          "id": "kug0qnb",
          "author": "amh8011",
          "body": "I can no longer drink normal dairy milk because covid fucked with my immune system in so many ways and now my safe foods are even more limited than just my regular ARFID safe foods. But when I could drink dairy milk I was only able to drink my local store brand milk and every other milk tasted different and I couldn’t drink it. And every so often I’d come across a gallon that tasted so bad but only to me. I’d have other people try it and they said it tasted normal.\n\nBut I can mix plant based milk no problem. In fact I prefer it in some cases. I like mixing the normal oatly oatmilk with the full fat oatly oatmilk because that tastes and feels the best.",
          "created_utc": 1710200037.0
        },
        {
          "id": "kulsa11",
          "author": "BlanKitt",
          "body": "Re dairy milk:\n\nI'm (mostly) a super taster, and milk from the same brand can have different tastes all the time. I suspect moooost of the time it's because it's a seasonal difference I can usually taste, and it's kind of funny to tell people that milk can have a seasonal tasting difference lol",
          "created_utc": 1710289242.0
        }
      ]
    },
    {
      "id": "kudocig",
      "author": "EternalOptomist4Hire",
      "body": "Signs is an M Night Shyamalan movie from the early 2000’s starring Mel Gibson and Joaquin Phoenix",
      "created_utc": 1710171535.0,
      "score": 6,
      "context": [
        {
          "id": "kucdzsg",
          "author": "Ok-Committee-5867",
          "body": "I struggle with water bottles… if I leave one somewhere and then come back to it I can’t drink the water. It’s like it’s become contaminated lol. It’s weird. So I try to remember to take it with me between rooms so I’ll drink it",
          "created_utc": 1710148306.0
        },
        {
          "id": "kuci048",
          "author": "cweezie",
          "body": "reminds me of the little girl in Signs",
          "created_utc": 1710151303.0
        },
        {
          "id": "kucu0jd",
          "author": "EternalOptomist4Hire",
          "body": "My mom always calls me “the girl from Signs” 😂",
          "created_utc": 1710158894.0
        },
        {
          "id": "kudn0c9",
          "author": "Ok-Committee-5867",
          "body": "Is it a show? I’ve never heard of this before 🤔",
          "created_utc": 1710171055.0
        }
      ]
    },
    {
      "id": "kufiwvq",
      "author": "cweezie",
      "body": "a great scary movie!! i loved it as a kid.",
      "created_utc": 1710193682.0,
      "score": 1,
      "context": [
        {
          "id": "kucdzsg",
          "author": "Ok-Committee-5867",
          "body": "I struggle with water bottles… if I leave one somewhere and then come back to it I can’t drink the water. It’s like it’s become contaminated lol. It’s weird. So I try to remember to take it with me between rooms so I’ll drink it",
          "created_utc": 1710148306.0
        },
        {
          "id": "kuci048",
          "author": "cweezie",
          "body": "reminds me of the little girl in Signs",
          "created_utc": 1710151303.0
        },
        {
          "id": "kucu0jd",
          "author": "EternalOptomist4Hire",
          "body": "My mom always calls me “the girl from Signs” 😂",
          "created_utc": 1710158894.0
        },
        {
          "id": "kudn0c9",
          "author": "Ok-Committee-5867",
          "body": "Is it a show? I’ve never heard of this before 🤔",
          "created_utc": 1710171055.0
        }
      ]
    },
    {
      "id": "kumoqhj",
      "author": "BlanKitt",
      "body": "It's not a stupid question! Very few people really know about super tasters even existing, so being aware of how to find out if you are one isn't a stupid or silly question. :)\n\nThere's actually two ways to test. One is relatively reliable, the other is considered either very reliable or maybe 60% reliable from a light google search. Both are fairly cheap.\n\nThe cheap and fairly reliable method involves [food dye, and a piece of paper with a standard sized hole punched through it](https://www.wikihow.com/Tell-if-You%27re-a-Super-Taster) . The link is to a WikiHow that uses a hole punch sticker if that's easier, but basically just using the size of the hole for one of those 3 ring binder pieces of paper is what you use. Then you just have to count. I suggest googling for images of reference.\n\nThe other method is a simple strip of paper that can be purchased (usually from Amazon), and [this](https://www.amazon.com/gp/aw/d/B001D7FF5E?psc=1&ref=ppx_pop_mob_b_asin_title) is the one that I used and was shared around my dad's office. It's a strip of paper with PTC on it, and it will taste really bitter if you're a super taster, to the point of some people retching. Normal tasters may taste a little bitter but be okay with it, and non-tasters just taste paper and nothing else. I wound up tasting it as really, really bitter after a few moments, whereas the super tasters in my dad's office tasted it almost immediately. Thus why I lean towards I'm \"mostly\" a super taster.",
      "created_utc": 1710302448.0,
      "score": 2,
      "context": [
        {
          "id": "kucc3us",
          "author": "Bankerlady10",
          "body": "Ha! I’m the same with milk. I also won’t mix milks between jugs, I find that gross. I’m sure a jug has a bunch of mixed milk sources in it but in my mind each jug is different milk.",
          "created_utc": 1710146827.0
        },
        {
          "id": "kug0qnb",
          "author": "amh8011",
          "body": "I can no longer drink normal dairy milk because covid fucked with my immune system in so many ways and now my safe foods are even more limited than just my regular ARFID safe foods. But when I could drink dairy milk I was only able to drink my local store brand milk and every other milk tasted different and I couldn’t drink it. And every so often I’d come across a gallon that tasted so bad but only to me. I’d have other people try it and they said it tasted normal.\n\nBut I can mix plant based milk no problem. In fact I prefer it in some cases. I like mixing the normal oatly oatmilk with the full fat oatly oatmilk because that tastes and feels the best.",
          "created_utc": 1710200037.0
        },
        {
          "id": "kulsa11",
          "author": "BlanKitt",
          "body": "Re dairy milk:\n\nI'm (mostly) a super taster, and milk from the same brand can have different tastes all the time. I suspect moooost of the time it's because it's a seasonal difference I can usually taste, and it's kind of funny to tell people that milk can have a seasonal tasting difference lol",
          "created_utc": 1710289242.0
        },
        {
          "id": "kum3hng",
          "author": "amh8011",
          "body": "I suspect I’m a super taster as well. Sorry if this is a stupid question but is there a test for that?",
          "created_utc": 1710293537.0
        }
      ]
    }
  ]
}