{
  "id": "1bdayac",
  "subreddit": "ARFID",
  "author": "None",
  "created_utc": 1710283180.0,
  "title": "What’s something only people with ARFID would understand? ",
  "selftext": "Went to a coffee shop today and was PROUD of myself for still being able to drink it even though they gave me 2 little straws instead of 1 big straw ",
  "url": "https://www.reddit.com/r/ARFID/comments/1bdayac/whats_something_only_people_with_arfid_would/",
  "score": 123,
  "num_comments": 107,
  "comments": [
    {
      "id": "kuldtmt",
      "author": "ResurgentClusterfuck",
      "body": "The feeling of looking at your favorite food in the world but your stomach is locked down tight, and you know if you eat it you'll be sick",
      "created_utc": 1710283969.0,
      "score": 120,
      "context": []
    },
    {
      "id": "kulismj",
      "author": "crash----",
      "body": "If a safe food changes their packaging, it is no longer a safe food.",
      "created_utc": 1710285725.0,
      "score": 113,
      "context": []
    },
    {
      "id": "kuldejq",
      "author": "esteemed-colleague",
      "body": "Some foods are unsafe for no reason. I can’t tell you *why* it’s unsafe, it’s just unsafe and I’m not eating it.",
      "created_utc": 1710283828.0,
      "score": 191,
      "context": []
    },
    {
      "id": "kulnm7s",
      "author": "mearn2",
      "body": "I didn’t get a damn bit of credit for still drinking that Coke at a restaurant after it was served with a slice of lemon",
      "created_utc": 1710287478.0,
      "score": 94,
      "context": []
    },
    {
      "id": "kulwefy",
      "author": "Letshavemorefun",
      "body": "That my ARFID is harder on me then it is on my loved ones. \n\nThat post earlier today on popularopinions says it all. They just don’t get that it is SO much harder on us. None of us choose to be this way.",
      "created_utc": 1710290816.0,
      "score": 80,
      "context": []
    },
    {
      "id": "kulntqv",
      "author": "None",
      "body": "Just because I ate it last week, doesn't invalidate the fact that I can barely think about it now without gagging.\n\nFor YEARS... I mean since I was probably 15 or so (I'm 27), until just a month or so ago, parmesan Pasta Roni was one of my safe foods. Now it makes me cringe.",
      "created_utc": 1710287556.0,
      "score": 50,
      "context": []
    },
    {
      "id": "kuli9zi",
      "author": "SamTheDystopianRat",
      "body": "the sheer discomfort when people start complaining about 'picky eaters'",
      "created_utc": 1710285542.0,
      "score": 132,
      "context": []
    },
    {
      "id": "kum5jfx",
      "author": "floppicus",
      "body": "when someone you really don’t want to disappoint makes you food or gives you a snack, and you graciously chew and gag through it trying to be a nice person",
      "created_utc": 1710294322.0,
      "score": 38,
      "context": []
    },
    {
      "id": "kumlvn3",
      "author": "baymaxstan",
      "body": "I physically cannot “just eat healthy”. I am embarrassed and ashamed of the way I eat, but people still give me weird looks in restaurants when I order chicken tenders/mac & cheese/other safe food. I don’t enjoy being this way, people! But I cannot help it!",
      "created_utc": 1710301092.0,
      "score": 39,
      "context": []
    },
    {
      "id": "kulsimn",
      "author": "jintana",
      "body": "The inevitable talk behind my back that becomes an intervention in romantic relationships about how I am depriving my partner of the pleasure to basically be a foodie.",
      "created_utc": 1710289333.0,
      "score": 33,
      "context": []
    },
    {
      "id": "kum2eig",
      "author": "SachiKaM",
      "body": "It looks good, it smells good, it tastes good… “no thank you” 🙃",
      "created_utc": 1710293115.0,
      "score": 29,
      "context": []
    },
    {
      "id": "kulkb17",
      "author": "My_fat_fucking_nuts",
      "body": "The sheer anxiety you get when you are in social situations with food and people start talking about food specifically to you. \"Wow the menu looks great!\" \"What are you planning on getting?\" \"You should try this it's great!\" ect ad nauseum",
      "created_utc": 1710286268.0,
      "score": 62,
      "context": []
    },
    {
      "id": "kumj5oj",
      "author": "WillingTone193",
      "body": "I will be mid bite of a safe food or meal and suddenly just get sick of it and get stuck between finishing that bit or spitting it out.",
      "created_utc": 1710299864.0,
      "score": 23,
      "context": []
    },
    {
      "id": "kumx38e",
      "author": "manafanana",
      "body": "Going from ravenously hungry to completely full in two bites.",
      "created_utc": 1710306901.0,
      "score": 23,
      "context": []
    },
    {
      "id": "kum2l3s",
      "author": "None",
      "body": "That I am 38 years old and today was the first time I used the same spatula to flip french fries and a grilled cheese without even wiping it off. That was 4.5 hours ago and I am still beaming about how proud I am if myself 😊.",
      "created_utc": 1710293184.0,
      "score": 41,
      "context": []
    },
    {
      "id": "kumagz5",
      "author": "bloopbloopamfish",
      "body": "When I go to a nice restaurant with people and the server starts explaining their list of specials for the evening. It's always fancy stuff like octopus or something that I would never eat in a million years and I have to sit there and nod and pretend like I'm considering these options like everyone else. And then I just order chicken tenders from the kids menu.",
      "created_utc": 1710296274.0,
      "score": 18,
      "context": []
    },
    {
      "id": "kumhumc",
      "author": "anilucy",
      "body": "If I eat a safe food and if something is wrong with it, it’s never going to be a safe food again and I’ll never try it again.",
      "created_utc": 1710299290.0,
      "score": 17,
      "context": []
    },
    {
      "id": "kunin9i",
      "author": "Foxbytenz",
      "body": "The absolute fear when you hear the words \"should we go out for dinner somewhere?\"",
      "created_utc": 1710322220.0,
      "score": 15,
      "context": []
    },
    {
      "id": "kunbc6y",
      "author": "Lilymoon2653",
      "body": "Knowing your the reason your family can't go to certain restraunts to eat out even if they won't admit it",
      "created_utc": 1710316729.0,
      "score": 13,
      "context": []
    },
    {
      "id": "kunlelr",
      "author": "d20damage",
      "body": "That not all pasta tastes the same. The shape matters.\nMy parents used to argue with me half my childhood because I only like specific pasta types and it's all the same, back then I didn't realize the texture was the difficult part for me, so I kept trying to tell everyone they're not the same dough :')",
      "created_utc": 1710324163.0,
      "score": 14,
      "context": []
    },
    {
      "id": "kun1u20",
      "author": "TheCringeOverlord",
      "body": "no i cannot eat that chicken tender on my plate because it touched the pickle that i didn’t ask for and now it is tainted. I must avoid it lest i instantaneously combust from consuming a small fraction of pickle juice, eugh.",
      "created_utc": 1710309883.0,
      "score": 14,
      "context": []
    },
    {
      "id": "kulqzxz",
      "author": "None",
      "body": "I can’t drink the last little bit my matcha lattes",
      "created_utc": 1710288747.0,
      "score": 14,
      "context": []
    },
    {
      "id": "kumcq7i",
      "author": "S-quinn7292",
      "body": "The fact that whenever a company that makes a safe food puts out a “new improved recipe” version of said safe food it becomes a risk of if it’ll still be a safe food",
      "created_utc": 1710297169.0,
      "score": 12,
      "context": []
    },
    {
      "id": "kumuard",
      "author": "lovetoogoodtoleave",
      "body": "liking something and then looking at the ingredients only to discover it has one of your fear foods in it and now you feel like you’re going to throw up because you’ve been eating something gross and you can never eat that thing again because it has onions/coconut/whatever in it",
      "created_utc": 1710305308.0,
      "score": 12,
      "context": []
    },
    {
      "id": "kun9pgk",
      "author": "Rare_Version6127",
      "body": "Having one ‘off’ bite of food and not being able to eat the rest of it even tho i know its fine 🥲",
      "created_utc": 1710315509.0,
      "score": 11,
      "context": []
    },
    {
      "id": "kungndb",
      "author": "None",
      "body": "edge tan ten offbeat office abundant reminiscent strong rustic humor\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
      "created_utc": 1710320739.0,
      "score": 12,
      "context": []
    },
    {
      "id": "kumiy9d",
      "author": "WillingTone193",
      "body": "The first time I had diced tomatoes on a panini that otherwise was just the chicken and cheese and mayo was a super big day for me. I got really excited and shared how exciting it was and the look on their face was a combination of 🙄 and 🙄 although they did neither.",
      "created_utc": 1710299773.0,
      "score": 11,
      "context": []
    },
    {
      "id": "kumr4ql",
      "author": "RavenLunatic512",
      "body": "I can only eat at home. The social pressure on food in public is just too much.",
      "created_utc": 1710303628.0,
      "score": 11,
      "context": []
    },
    {
      "id": "kunc30m",
      "author": "Waterfalls_x_Thunder",
      "body": "I have to microwave/cook things longer than the instructions ask, otherwise I can’t eat it. \n\nOpening a packet of chocolate, seeing one weird spec and throwing the packet out. \n\nNot remembering if you have already opened something and have to throw it away just incase it wasnt fresh. \n\nExample - buying a bottle of water and likely opening it and taking a small sip.  To then open it later and not remember opening it earlier. So throw it away incase it’s been open too long. \n\nWhen things say they expire in 2-3 days after opening. But you can only handle day 1.",
      "created_utc": 1710317282.0,
      "score": 10,
      "context": []
    },
    {
      "id": "kuo2bfl",
      "author": "dosetoyevsky",
      "body": "Scraping the lettuce off a chicken sandwich doesn't make it OK again.",
      "created_utc": 1710333586.0,
      "score": 11,
      "context": []
    },
    {
      "id": "kumjggy",
      "author": "littleghool",
      "body": "Safe food might not taste the same at a different location \n\n(Please tell me I'm not the only one here 😆 there's a certain McDonald's in my area that I can't eat inside at because for some reason my chicky nugs and fries (safe foods) don't taste right there)",
      "created_utc": 1710299998.0,
      "score": 19,
      "context": []
    },
    {
      "id": "kum4cn1",
      "author": "great_equator",
      "body": "Eyes tearing up from extreme flavor, while others reach for the salt or condiments.",
      "created_utc": 1710293866.0,
      "score": 11,
      "context": []
    },
    {
      "id": "kumzt8e",
      "author": "RoseColoredSpecks",
      "body": "That I swear I’m not trying to be super picky I’m just running out of options here!!!",
      "created_utc": 1710308568.0,
      "score": 9,
      "context": []
    },
    {
      "id": "kuq36rz",
      "author": "Bebokomori",
      "body": "There is no sufficient substitute for a food. If I was cool with eating a substitute then I would not have given you the specific brand, flavor and box description. ",
      "created_utc": 1710358712.0,
      "score": 8,
      "context": []
    },
    {
      "id": "kuo1d3n",
      "author": "Lightning_And_Snow_",
      "body": "It's not a \"choice\", I see so much advice suggesting dietary changes for my chronic illness but I just can't do it. If I avoided all the things suggested, there would be basically nothing left I could eat, and people suggesting it just don't seem to understand that.",
      "created_utc": 1710333159.0,
      "score": 8,
      "context": []
    },
    {
      "id": "kumjgzu",
      "author": "jorwyn",
      "body": "The fact that a package can make a food okay. Like, if you put any tater tots in the paper cup/bowl thing from Taco Time, they're okay. If they're served any other way, I need to take a cautious bite first. They don't have to taste like the taco time ones or even look like them. Even I don't understand it, honestly. Putting them in that cup works! They're okay that way because they came from the \"magic\" taco time packaging. \n\nI had a friend who was a manager at one, and he gave me two huge stacks of brand new ones, so I could try other foods in them. Sadly, it only works with tater tots.",
      "created_utc": 1710300004.0,
      "score": 8,
      "context": []
    },
    {
      "id": "kunvvqq",
      "author": "rileydonohue",
      "body": "Eating something you really like but it’s not 100% processed garbage so an uneven texture/chunk slips through and you chew it and now you can never eat it again 😭",
      "created_utc": 1710330482.0,
      "score": 7,
      "context": []
    },
    {
      "id": "kutv9o1",
      "author": "Aquila-Calvitium",
      "body": "I just read through the comments and started crying because I don't feel alone anymore\n\nThere are people going through the same thing as me and I finally feel understood",
      "created_utc": 1710421658.0,
      "score": 6,
      "context": []
    },
    {
      "id": "kup80fo",
      "author": "None",
      "body": "The only reason I won't travel outside my country is food. Will I have a safe food there? Will I offend someone for not eating or liking their cuisine? Better just not travel then.",
      "created_utc": 1710348558.0,
      "score": 5,
      "context": []
    },
    {
      "id": "kumrtza",
      "author": "Darthcookie",
      "body": "That sometimes I’ll eat something if it’s cooked/presented in a certain way and even going as far as “needs to be a specific brand” but if one thing is different it’s a hard no. \n\nAnd eating something doesn’t necessarily makes it safe or enjoyable, just tolerable and I eat it because I’m an adult and I know I need certain nutrients.",
      "created_utc": 1710303986.0,
      "score": 4,
      "context": []
    },
    {
      "id": "kupq5l8",
      "author": "feeling-witchy",
      "body": "I'm not eating lunch today because a coworker got my order wrong (asked for no dressing and no side pickle) so I just pretended I wasn't hungry. I didn't want to explain the smell of dressing on my chicken wrap makes me gag to think about eating and the pickle touching the chips ruined everything else.\n\nInnocent mistake, but bummed me out I couldn't eat during my lunch meeting and just sat there.",
      "created_utc": 1710354424.0,
      "score": 5,
      "context": []
    },
    {
      "id": "kutxdc5",
      "author": "Toffee_Bee",
      "body": "Teachers making a big scene that you can't eat the food everyone's having on a school trip. For me it was a week long geography trip in Iceland, the bread had seeds in it and I can't eat soup. I was made fun of for it the rest of the trip (also happened to be my brithday) 🙃",
      "created_utc": 1710422524.0,
      "score": 4,
      "context": []
    },
    {
      "id": "kvfxhgf",
      "author": "BirdsNeedNames",
      "body": "love-hate relationship with restaurants. on the one hand, if it's a place I know I like, I get to have a safe food without all the hassle of cooking it myself (also, some foods I can only eat at restaurants; homemade frozen chicken tenders are a no-go, but from a chain or a good brew pub they're perfect). on the other hand, if it's a place I've never been, or if it's with people who don't know/understand my situation, or (god forbid) if they changed a recipe... awful awful awful. ",
      "created_utc": 1710777546.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kxi5ig7",
      "author": "TestSubject5kk",
      "body": "\"im hungry right now\"\n\n\"do you want some mac and cheese or pizza\"\n\n\"i dont want food\"",
      "created_utc": 1711947961.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kulkjfb",
      "author": "purplechunkymonkey",
      "body": "For my daughter tonight, it was the sheer frustration of having her safe foods available but not the one thing she wanted. She ran out and grocery shopping doesn't happen until the weekend. I don't drive and the stores I can walk to do not carry it since it's a store brand.",
      "created_utc": 1710286352.0,
      "score": 8,
      "context": []
    },
    {
      "id": "kupwzhb",
      "author": "Mysterious-Bird4364",
      "body": "I'm going to Tunisia in November and I'm afraid. I am allergic to cumin so that limits a lot of options. I went to Uganda and got bronchitis and everything tasted like burned rubber\nI ate so many protein bars.",
      "created_utc": 1710356667.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kut2bs1",
      "author": "Iam_weird123",
      "body": "The food I liked 2 weeks ago I might not like it now",
      "created_utc": 1710404371.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kuuu3u9",
      "author": "Curious_Field7953",
      "body": "When you are brought to your favorite safe restaurant as a surprise & they pre-ordered your favorite safe meal but you decided exactly 7.37 minutes ago you could NEVER ever eat that food in that restaurant EVER.",
      "created_utc": 1710434020.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kuvhhya",
      "author": "RelativelyAmbitious",
      "body": "Yes, I like cheese. Yes, I like ketchup. DO NOT put the two together...",
      "created_utc": 1710441658.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kv784in",
      "author": "lavenderspluto",
      "body": "Being celebrated for eating a fear food. I told my best friend I ate something and she celebrated from thousands of miles away",
      "created_utc": 1710627906.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kun2pwh",
      "author": "fairyinthedark",
      "body": "Can’t drink water unless it’s out of my water bottle. Restaurant water is not safe.",
      "created_utc": 1710310478.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kuxyt73",
      "author": "hamforbananas",
      "body": "Wish I could try other people's food, but I deny it because if I don't like it, it is *so obvious*. I don't mean to hurt anyone's feelings.",
      "created_utc": 1710474378.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kuy0hqx",
      "author": "vonoddly",
      "body": "Being so incrediblely specific. French fries are good but only these particular shapes… or I like Mac & Cheese but if it's velveta shells, I will throw it up.",
      "created_utc": 1710475174.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kunggqt",
      "author": "None",
      "body": "close crown cows bag disagreeable bored sort existence steep payment\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
      "created_utc": 1710320602.0,
      "score": 7,
      "context": [
        {
          "id": "kuldtmt",
          "author": "ResurgentClusterfuck",
          "body": "The feeling of looking at your favorite food in the world but your stomach is locked down tight, and you know if you eat it you'll be sick",
          "created_utc": 1710283969.0
        }
      ]
    },
    {
      "id": "lbx5gqg",
      "author": "Phoenixtdm",
      "body": "I don’t think I have ARFID but I’m autistic and that’s so relatable",
      "created_utc": 1720287035.0,
      "score": 3,
      "context": [
        {
          "id": "kuldtmt",
          "author": "ResurgentClusterfuck",
          "body": "The feeling of looking at your favorite food in the world but your stomach is locked down tight, and you know if you eat it you'll be sick",
          "created_utc": 1710283969.0
        }
      ]
    },
    {
      "id": "kumqnow",
      "author": "RavenLunatic512",
      "body": "If they change the packaging, what else did they change? 👀",
      "created_utc": 1710303393.0,
      "score": 38,
      "context": [
        {
          "id": "kulismj",
          "author": "crash----",
          "body": "If a safe food changes their packaging, it is no longer a safe food.",
          "created_utc": 1710285725.0
        }
      ]
    },
    {
      "id": "kuqzq1v",
      "author": "Erisaiya",
      "body": "It's even worse when they throw on a \"New recipe!!!!\" along with the visual change\n\nNo, don't change it, the last one was fine?!",
      "created_utc": 1710369557.0,
      "score": 12,
      "context": [
        {
          "id": "kulismj",
          "author": "crash----",
          "body": "If a safe food changes their packaging, it is no longer a safe food.",
          "created_utc": 1710285725.0
        }
      ]
    },
    {
      "id": "kulkoom",
      "author": "purplechunkymonkey",
      "body": "My daughter just lost Kraft m&c.",
      "created_utc": 1710286405.0,
      "score": 43,
      "context": [
        {
          "id": "kuldejq",
          "author": "esteemed-colleague",
          "body": "Some foods are unsafe for no reason. I can’t tell you *why* it’s unsafe, it’s just unsafe and I’m not eating it.",
          "created_utc": 1710283828.0
        }
      ]
    },
    {
      "id": "kumigsq",
      "author": "jorwyn",
      "body": "They're just not even food. It's like handing me a plate with wood chips and telling me to eat them. Even if I see you eating them, my brain just says there's something wrong with you, not that it must be food.",
      "created_utc": 1710299559.0,
      "score": 11,
      "context": [
        {
          "id": "kuldejq",
          "author": "esteemed-colleague",
          "body": "Some foods are unsafe for no reason. I can’t tell you *why* it’s unsafe, it’s just unsafe and I’m not eating it.",
          "created_utc": 1710283828.0
        }
      ]
    },
    {
      "id": "kulrdfb",
      "author": "solitudanrian",
      "body": "and some things are \"safe\" despite being known for their accquired taste. i'll drink cheap scotch neat but won't eat strawberries. i hate all those tiny holes. i'm finally coming around to grapes via the cotton candy ones. green ones kind taste like apples which i do like. it's just the texture that grosses me out.",
      "created_utc": 1710288892.0,
      "score": 15,
      "context": [
        {
          "id": "kuldejq",
          "author": "esteemed-colleague",
          "body": "Some foods are unsafe for no reason. I can’t tell you *why* it’s unsafe, it’s just unsafe and I’m not eating it.",
          "created_utc": 1710283828.0
        }
      ]
    },
    {
      "id": "kuncd9m",
      "author": "Waterfalls_x_Thunder",
      "body": "50% of the time, it goes against logic. \n\nBut my brain is adamant, this cannot be eaten!\n\nI get this for more than food and drink though!\n\nI get this over items too in the same manner. My items expire to me mentally and I can’t touch them after that moment.",
      "created_utc": 1710317496.0,
      "score": 7,
      "context": [
        {
          "id": "kuldejq",
          "author": "esteemed-colleague",
          "body": "Some foods are unsafe for no reason. I can’t tell you *why* it’s unsafe, it’s just unsafe and I’m not eating it.",
          "created_utc": 1710283828.0
        }
      ]
    },
    {
      "id": "kupqxx9",
      "author": "Marizard1187",
      "body": "My bf knew about my arfid but was dumbfounded when I told him that he made Mac and cheese in the wrong pot, and served it in a plastic bowl with a fork therefore making it inedible, we found out maybe I need to be more specific about those things ahead of time in the future 😅",
      "created_utc": 1710354689.0,
      "score": 4,
      "context": [
        {
          "id": "kuldejq",
          "author": "esteemed-colleague",
          "body": "Some foods are unsafe for no reason. I can’t tell you *why* it’s unsafe, it’s just unsafe and I’m not eating it.",
          "created_utc": 1710283828.0
        }
      ]
    },
    {
      "id": "kuotbpb",
      "author": "flordemaga",
      "body": "I call them “became evil.” It tends to be temporary, but not always.",
      "created_utc": 1710343710.0,
      "score": 1,
      "context": [
        {
          "id": "kuldejq",
          "author": "esteemed-colleague",
          "body": "Some foods are unsafe for no reason. I can’t tell you *why* it’s unsafe, it’s just unsafe and I’m not eating it.",
          "created_utc": 1710283828.0
        }
      ]
    },
    {
      "id": "kulpbgj",
      "author": "okoktrip",
      "body": "you are so strong that is honestly a grand issue",
      "created_utc": 1710288109.0,
      "score": 30,
      "context": [
        {
          "id": "kulnm7s",
          "author": "mearn2",
          "body": "I didn’t get a damn bit of credit for still drinking that Coke at a restaurant after it was served with a slice of lemon",
          "created_utc": 1710287478.0
        }
      ]
    },
    {
      "id": "kum0swy",
      "author": "EternalOptomist4Hire",
      "body": "I’m giving you credit right now for being a real one 🫶",
      "created_utc": 1710292498.0,
      "score": 11,
      "context": [
        {
          "id": "kulnm7s",
          "author": "mearn2",
          "body": "I didn’t get a damn bit of credit for still drinking that Coke at a restaurant after it was served with a slice of lemon",
          "created_utc": 1710287478.0
        }
      ]
    },
    {
      "id": "kumiqjo",
      "author": "jorwyn",
      "body": "I actually like it that way, but everyone looks at me like I'm crazy. Who serves it that way?!\n\nI should get credit for not taking my sandwich apart and eating it one ingredient at a time when it didn't look like those sandwiches usually do. Did I? No, I did not get credit. It was hard!",
      "created_utc": 1710299677.0,
      "score": 8,
      "context": [
        {
          "id": "kulnm7s",
          "author": "mearn2",
          "body": "I didn’t get a damn bit of credit for still drinking that Coke at a restaurant after it was served with a slice of lemon",
          "created_utc": 1710287478.0
        }
      ]
    },
    {
      "id": "kum3140",
      "author": "k94ever",
      "body": "I feel ya !!!",
      "created_utc": 1710293358.0,
      "score": 2,
      "context": [
        {
          "id": "kulnm7s",
          "author": "mearn2",
          "body": "I didn’t get a damn bit of credit for still drinking that Coke at a restaurant after it was served with a slice of lemon",
          "created_utc": 1710287478.0
        }
      ]
    },
    {
      "id": "kum7pyh",
      "author": "MarsupialPristine677",
      "body": "You are an inspiration 🫡",
      "created_utc": 1710295179.0,
      "score": 2,
      "context": [
        {
          "id": "kulnm7s",
          "author": "mearn2",
          "body": "I didn’t get a damn bit of credit for still drinking that Coke at a restaurant after it was served with a slice of lemon",
          "created_utc": 1710287478.0
        }
      ]
    },
    {
      "id": "kum83ta",
      "author": "PeachOnAWarmBeach",
      "body": "I didn't see that one,  but yeah.  Ppl look for reasons to hate others and be superior.  The only right answer and way to do or experience things is THEIR WAY.   It's worse than ever towards us and basically,  anyone different in any way.  I think they  form their identity and worth on things like the foods they eat or don't eat, what they like to do or be is the only way that's correct.  If you're different and you're okay with it,  that threatens their worth in their minds.  So they have to put others down to be superior and validate themselves.",
      "created_utc": 1710295332.0,
      "score": 25,
      "context": [
        {
          "id": "kulwefy",
          "author": "Letshavemorefun",
          "body": "That my ARFID is harder on me then it is on my loved ones. \n\nThat post earlier today on popularopinions says it all. They just don’t get that it is SO much harder on us. None of us choose to be this way.",
          "created_utc": 1710290816.0
        }
      ]
    },
    {
      "id": "kulr89x",
      "author": "smallbluedinosaur",
      "body": "I’m so glad someone else says they can’t even think about it. I can’t even look at some stuff or be near it and I thought I was alone in that",
      "created_utc": 1710288837.0,
      "score": 13,
      "context": [
        {
          "id": "kulntqv",
          "author": "None",
          "body": "Just because I ate it last week, doesn't invalidate the fact that I can barely think about it now without gagging.\n\nFor YEARS... I mean since I was probably 15 or so (I'm 27), until just a month or so ago, parmesan Pasta Roni was one of my safe foods. Now it makes me cringe.",
          "created_utc": 1710287556.0
        }
      ]
    },
    {
      "id": "kup7ylx",
      "author": "Backrow6",
      "body": "The first time I ever ate pork chops they were served cold. After driving for 3 hours with my girlfriend to meet her parents. We arrived late in the evening and the whole family just watched us eat.",
      "created_utc": 1710348542.0,
      "score": 4,
      "context": [
        {
          "id": "kum5jfx",
          "author": "floppicus",
          "body": "when someone you really don’t want to disappoint makes you food or gives you a snack, and you graciously chew and gag through it trying to be a nice person",
          "created_utc": 1710294322.0
        }
      ]
    },
    {
      "id": "kup8jrd",
      "author": "None",
      "body": "Or you'd rather lose a friendship than chew and gag through the food. 😵",
      "created_utc": 1710348730.0,
      "score": 4,
      "context": [
        {
          "id": "kum5jfx",
          "author": "floppicus",
          "body": "when someone you really don’t want to disappoint makes you food or gives you a snack, and you graciously chew and gag through it trying to be a nice person",
          "created_utc": 1710294322.0
        }
      ]
    },
    {
      "id": "kumzkl8",
      "author": "RoseColoredSpecks",
      "body": "I completely relate to this.",
      "created_utc": 1710308417.0,
      "score": 2,
      "context": [
        {
          "id": "kum5jfx",
          "author": "floppicus",
          "body": "when someone you really don’t want to disappoint makes you food or gives you a snack, and you graciously chew and gag through it trying to be a nice person",
          "created_utc": 1710294322.0
        }
      ]
    },
    {
      "id": "lbx5tqi",
      "author": "Phoenixtdm",
      "body": "My ex made me try a broccoli casserole and I gagged and she was like what is your problem",
      "created_utc": 1720287150.0,
      "score": 2,
      "context": [
        {
          "id": "kum5jfx",
          "author": "floppicus",
          "body": "when someone you really don’t want to disappoint makes you food or gives you a snack, and you graciously chew and gag through it trying to be a nice person",
          "created_utc": 1710294322.0
        }
      ]
    },
    {
      "id": "kumzhya",
      "author": "RoseColoredSpecks",
      "body": "But it’s not like you are telling them not to eat the food right? I don’t really understand this one unless you two don’t go to specific places ever together? But still, it’s wrong for others to assume things like that.",
      "created_utc": 1710308371.0,
      "score": 7,
      "context": [
        {
          "id": "kulsimn",
          "author": "jintana",
          "body": "The inevitable talk behind my back that becomes an intervention in romantic relationships about how I am depriving my partner of the pleasure to basically be a foodie.",
          "created_utc": 1710289333.0
        }
      ]
    },
    {
      "id": "kuo0189",
      "author": "None",
      "body": "This one!! It makes it worse when someone makes something homemade and is so excited for people to try it including myself- I always have to be like “It’s not a personal thing, I am sure it is delicious to most people but I still am not gonna try it… smells/looks good tho” \n\nThey get so butthurt😭",
      "created_utc": 1710332541.0,
      "score": 8,
      "context": [
        {
          "id": "kum2eig",
          "author": "SachiKaM",
          "body": "It looks good, it smells good, it tastes good… “no thank you” 🙃",
          "created_utc": 1710293115.0
        }
      ]
    },
    {
      "id": "kumtdzw",
      "author": "contactwho",
      "body": "God! What is people’s fucking obsession with what other people are eating?! A groups dinner out is the worst! Everyone at the table asking everyone else what they are going to eat for to order. And the one person who didn’t ask at the ordering stage has to ask what you got when your feed arrives.  Why do they care?!",
      "created_utc": 1710304808.0,
      "score": 20,
      "context": [
        {
          "id": "kulkb17",
          "author": "My_fat_fucking_nuts",
          "body": "The sheer anxiety you get when you are in social situations with food and people start talking about food specifically to you. \"Wow the menu looks great!\" \"What are you planning on getting?\" \"You should try this it's great!\" ect ad nauseum",
          "created_utc": 1710286268.0
        }
      ]
    },
    {
      "id": "kupw7sa",
      "author": "Mysterious-Bird4364",
      "body": "I hate this so much",
      "created_utc": 1710356411.0,
      "score": 5,
      "context": [
        {
          "id": "kumx38e",
          "author": "manafanana",
          "body": "Going from ravenously hungry to completely full in two bites.",
          "created_utc": 1710306901.0
        }
      ]
    },
    {
      "id": "lbx5zz8",
      "author": "Phoenixtdm",
      "body": "I don’t think I have ARFID but I’m autistic and I get this. It’s so annoying",
      "created_utc": 1720287204.0,
      "score": 2,
      "context": [
        {
          "id": "kumx38e",
          "author": "manafanana",
          "body": "Going from ravenously hungry to completely full in two bites.",
          "created_utc": 1710306901.0
        }
      ]
    },
    {
      "id": "kum9evn",
      "author": "None",
      "body": "I’m proud of you!",
      "created_utc": 1710295852.0,
      "score": 8,
      "context": [
        {
          "id": "kum2l3s",
          "author": "None",
          "body": "That I am 38 years old and today was the first time I used the same spatula to flip french fries and a grilled cheese without even wiping it off. That was 4.5 hours ago and I am still beaming about how proud I am if myself 😊.",
          "created_utc": 1710293184.0
        }
      ]
    },
    {
      "id": "kumixp1",
      "author": "jorwyn",
      "body": "Good job! I can't do grilled cheese, but I'm proud of you. It's hard to change things like that.",
      "created_utc": 1710299765.0,
      "score": 5,
      "context": [
        {
          "id": "kum2l3s",
          "author": "None",
          "body": "That I am 38 years old and today was the first time I used the same spatula to flip french fries and a grilled cheese without even wiping it off. That was 4.5 hours ago and I am still beaming about how proud I am if myself 😊.",
          "created_utc": 1710293184.0
        }
      ]
    },
    {
      "id": "mqvjstv",
      "author": "Possible_Priority584",
      "body": "I am cracking up at this one 😂",
      "created_utc": 1746535729.0,
      "score": 1,
      "context": [
        {
          "id": "kumagz5",
          "author": "bloopbloopamfish",
          "body": "When I go to a nice restaurant with people and the server starts explaining their list of specials for the evening. It's always fancy stuff like octopus or something that I would never eat in a million years and I have to sit there and nod and pretend like I'm considering these options like everyone else. And then I just order chicken tenders from the kids menu.",
          "created_utc": 1710296274.0
        }
      ]
    },
    {
      "id": "kunvcot",
      "author": "None",
      "body": "I've been struggling with this, because I'm pregnant, and the morning sickness is making me associate the foods I ate with the nausea and vomiting. I have exactly ONE safe food a day now, and it changes every morning...",
      "created_utc": 1710330201.0,
      "score": 4,
      "context": [
        {
          "id": "kumhumc",
          "author": "anilucy",
          "body": "If I eat a safe food and if something is wrong with it, it’s never going to be a safe food again and I’ll never try it again.",
          "created_utc": 1710299290.0
        }
      ]
    },
    {
      "id": "kxi6528",
      "author": "TestSubject5kk",
      "body": "thats scarry for more than one reason",
      "created_utc": 1711948348.0,
      "score": 1,
      "context": [
        {
          "id": "kunin9i",
          "author": "Foxbytenz",
          "body": "The absolute fear when you hear the words \"should we go out for dinner somewhere?\"",
          "created_utc": 1710322220.0
        }
      ]
    },
    {
      "id": "kupwppw",
      "author": "Mysterious-Bird4364",
      "body": "Shape is essential. Some of the cute pasta is too gluey for me. Like bows, sometimes they are okay. Other times gross. Fat pasta is gross like linguine.",
      "created_utc": 1710356577.0,
      "score": 7,
      "context": [
        {
          "id": "kunlelr",
          "author": "d20damage",
          "body": "That not all pasta tastes the same. The shape matters.\nMy parents used to argue with me half my childhood because I only like specific pasta types and it's all the same, back then I didn't realize the texture was the difficult part for me, so I kept trying to tell everyone they're not the same dough :')",
          "created_utc": 1710324163.0
        }
      ]
    },
    {
      "id": "kumq3qi",
      "author": "FreddyPlayz",
      "body": "This past week I was telling my mom how I was working with my OT about my food issues and how excited I was and she was barely holding back a laugh, made me kinda feel like shit ☹️",
      "created_utc": 1710303116.0,
      "score": 6,
      "context": [
        {
          "id": "kumiy9d",
          "author": "WillingTone193",
          "body": "The first time I had diced tomatoes on a panini that otherwise was just the chicken and cheese and mayo was a super big day for me. I got really excited and shared how exciting it was and the look on their face was a combination of 🙄 and 🙄 although they did neither.",
          "created_utc": 1710299773.0
        }
      ]
    },
    {
      "id": "kupjz5z",
      "author": "BolognaMountain",
      "body": "The comment about not remembering if you opened something or not and having to toss it - spot on. I work a dirty job, too, so it’s not like things gross me out easily. But I need to know that I opened it or it’s not safe.",
      "created_utc": 1710352422.0,
      "score": 2,
      "context": [
        {
          "id": "kunc30m",
          "author": "Waterfalls_x_Thunder",
          "body": "I have to microwave/cook things longer than the instructions ask, otherwise I can’t eat it. \n\nOpening a packet of chocolate, seeing one weird spec and throwing the packet out. \n\nNot remembering if you have already opened something and have to throw it away just incase it wasnt fresh. \n\nExample - buying a bottle of water and likely opening it and taking a small sip.  To then open it later and not remember opening it earlier. So throw it away incase it’s been open too long. \n\nWhen things say they expire in 2-3 days after opening. But you can only handle day 1.",
          "created_utc": 1710317282.0
        }
      ]
    },
    {
      "id": "kuofbfh",
      "author": "ExaltedDemonic",
      "body": "In the example you provided, I would assume that specific McDonald's just has bad cooks. There are a few McDonald's around me and one of my safe foods is their fries, I only go to one because the others give me stale or undercooked fries. Similar situation with my morning coffee.",
      "created_utc": 1710338792.0,
      "score": 5,
      "context": [
        {
          "id": "kumjggy",
          "author": "littleghool",
          "body": "Safe food might not taste the same at a different location \n\n(Please tell me I'm not the only one here 😆 there's a certain McDonald's in my area that I can't eat inside at because for some reason my chicky nugs and fries (safe foods) don't taste right there)",
          "created_utc": 1710299998.0
        }
      ]
    },
    {
      "id": "kupcc78",
      "author": "afarrell2021",
      "body": "Im that way with pizza! Even if its a chain, in my experience a diff location makes it way different 🥲",
      "created_utc": 1710349956.0,
      "score": 3,
      "context": [
        {
          "id": "kumjggy",
          "author": "littleghool",
          "body": "Safe food might not taste the same at a different location \n\n(Please tell me I'm not the only one here 😆 there's a certain McDonald's in my area that I can't eat inside at because for some reason my chicky nugs and fries (safe foods) don't taste right there)",
          "created_utc": 1710299998.0
        }
      ]
    },
    {
      "id": "kv7utmu",
      "author": "pink_elle",
      "body": "YES!! i can’t eat certain foods if they aren’t in original container (such as chic fil a nuggets)",
      "created_utc": 1710637154.0,
      "score": 2,
      "context": [
        {
          "id": "kumjgzu",
          "author": "jorwyn",
          "body": "The fact that a package can make a food okay. Like, if you put any tater tots in the paper cup/bowl thing from Taco Time, they're okay. If they're served any other way, I need to take a cautious bite first. They don't have to taste like the taco time ones or even look like them. Even I don't understand it, honestly. Putting them in that cup works! They're okay that way because they came from the \"magic\" taco time packaging. \n\nI had a friend who was a manager at one, and he gave me two huge stacks of brand new ones, so I could try other foods in them. Sadly, it only works with tater tots.",
          "created_utc": 1710300004.0
        }
      ]
    },
    {
      "id": "kxi5l5v",
      "author": "TestSubject5kk",
      "body": "im convinced ever since kraft made their mac and cheese cups more dark blue a few years ago its different",
      "created_utc": 1711948008.0,
      "score": 3,
      "context": [
        {
          "id": "kulismj",
          "author": "crash----",
          "body": "If a safe food changes their packaging, it is no longer a safe food.",
          "created_utc": 1710285725.0
        },
        {
          "id": "kumqnow",
          "author": "RavenLunatic512",
          "body": "If they change the packaging, what else did they change? 👀",
          "created_utc": 1710303393.0
        }
      ]
    },
    {
      "id": "kulqpwo",
      "author": "solitudanrian",
      "body": "i read this and mouthed \"oh dear god\". i feel for her and hope she finds a replacement soon.",
      "created_utc": 1710288639.0,
      "score": 63,
      "context": [
        {
          "id": "kuldejq",
          "author": "esteemed-colleague",
          "body": "Some foods are unsafe for no reason. I can’t tell you *why* it’s unsafe, it’s just unsafe and I’m not eating it.",
          "created_utc": 1710283828.0
        },
        {
          "id": "kulkoom",
          "author": "purplechunkymonkey",
          "body": "My daughter just lost Kraft m&c.",
          "created_utc": 1710286405.0
        }
      ]
    },
    {
      "id": "kun05ym",
      "author": "jenniferlynne08",
      "body": "Kraft Mac and cheese is one of the only ones I’ve been able to keep for my entire life, my heart breaks for you and her. I truly hope you guys find some other safe food soon",
      "created_utc": 1710308792.0,
      "score": 6,
      "context": [
        {
          "id": "kuldejq",
          "author": "esteemed-colleague",
          "body": "Some foods are unsafe for no reason. I can’t tell you *why* it’s unsafe, it’s just unsafe and I’m not eating it.",
          "created_utc": 1710283828.0
        },
        {
          "id": "kulkoom",
          "author": "purplechunkymonkey",
          "body": "My daughter just lost Kraft m&c.",
          "created_utc": 1710286405.0
        }
      ]
    },
    {
      "id": "kv25q9w",
      "author": "oh_such_rhetoric",
      "body": "I have also lost it, it used to be great if it was still hot and the cheese sauce was still melty and liquidy, but after that it gets too dry and I just can’t eat it. Recently made some without realizing use kindred the water and it turned out too dry from the start. Now I can’t bring myself to try it again.",
      "created_utc": 1710541645.0,
      "score": 1,
      "context": [
        {
          "id": "kuldejq",
          "author": "esteemed-colleague",
          "body": "Some foods are unsafe for no reason. I can’t tell you *why* it’s unsafe, it’s just unsafe and I’m not eating it.",
          "created_utc": 1710283828.0
        },
        {
          "id": "kulkoom",
          "author": "purplechunkymonkey",
          "body": "My daughter just lost Kraft m&c.",
          "created_utc": 1710286405.0
        }
      ]
    },
    {
      "id": "lbx5jm4",
      "author": "Phoenixtdm",
      "body": "I used to like it until I realized it’s plastic cheese and now the thought and look of it makes me want to throw up",
      "created_utc": 1720287062.0,
      "score": 1,
      "context": [
        {
          "id": "kuldejq",
          "author": "esteemed-colleague",
          "body": "Some foods are unsafe for no reason. I can’t tell you *why* it’s unsafe, it’s just unsafe and I’m not eating it.",
          "created_utc": 1710283828.0
        },
        {
          "id": "kulkoom",
          "author": "purplechunkymonkey",
          "body": "My daughter just lost Kraft m&c.",
          "created_utc": 1710286405.0
        }
      ]
    },
    {
      "id": "kunljjx",
      "author": "pirateshipsx",
      "body": "Omg finally someone else who deconstructs their sandwiches! I need to feel the textures in my hands to make sure they're safe ones and if they're not, I get turned off real damn quick lmao",
      "created_utc": 1710324258.0,
      "score": 4,
      "context": [
        {
          "id": "kulnm7s",
          "author": "mearn2",
          "body": "I didn’t get a damn bit of credit for still drinking that Coke at a restaurant after it was served with a slice of lemon",
          "created_utc": 1710287478.0
        },
        {
          "id": "kumiqjo",
          "author": "jorwyn",
          "body": "I actually like it that way, but everyone looks at me like I'm crazy. Who serves it that way?!\n\nI should get credit for not taking my sandwich apart and eating it one ingredient at a time when it didn't look like those sandwiches usually do. Did I? No, I did not get credit. It was hard!",
          "created_utc": 1710299677.0
        }
      ]
    },
    {
      "id": "kuoixd2",
      "author": "jintana",
      "body": "It’s always up to them to eat what they like. Somewhere along the line, they decide that my food needs for safety are problematic. \n\nSometimes it crops up because “we can’t eat the same meals at home,” regardless of which of us is cooking. Sometimes it’s embarrassment over my food choices in front of their friends and family, as sometimes my need for safety can feel like rejection or weirdness.\n\nIt never should be, but sometimes is, what I choose at a restaurant. That’s my business. All that should matter to the other person that I can find something. Hell, I tend to be a cheap date.\n\nFood tends to be a love language, where saying “we are the same thing at the same time and felt the same way about it” is super soulmate-y. I guess I feel the same way about when people need safe foods - that they’re soulmate-ish.",
      "created_utc": 1710340088.0,
      "score": 6,
      "context": [
        {
          "id": "kulsimn",
          "author": "jintana",
          "body": "The inevitable talk behind my back that becomes an intervention in romantic relationships about how I am depriving my partner of the pleasure to basically be a foodie.",
          "created_utc": 1710289333.0
        },
        {
          "id": "kumzhya",
          "author": "RoseColoredSpecks",
          "body": "But it’s not like you are telling them not to eat the food right? I don’t really understand this one unless you two don’t go to specific places ever together? But still, it’s wrong for others to assume things like that.",
          "created_utc": 1710308371.0
        }
      ]
    },
    {
      "id": "kup8uml",
      "author": "None",
      "body": "We should start asking them what kind of fuel they put in their vehicles, what gas stations they love/hate, etc. ",
      "created_utc": 1710348826.0,
      "score": 7,
      "context": [
        {
          "id": "kulkb17",
          "author": "My_fat_fucking_nuts",
          "body": "The sheer anxiety you get when you are in social situations with food and people start talking about food specifically to you. \"Wow the menu looks great!\" \"What are you planning on getting?\" \"You should try this it's great!\" ect ad nauseum",
          "created_utc": 1710286268.0
        },
        {
          "id": "kumtdzw",
          "author": "contactwho",
          "body": "God! What is people’s fucking obsession with what other people are eating?! A groups dinner out is the worst! Everyone at the table asking everyone else what they are going to eat for to order. And the one person who didn’t ask at the ordering stage has to ask what you got when your feed arrives.  Why do they care?!",
          "created_utc": 1710304808.0
        }
      ]
    },
    {
      "id": "lcboedc",
      "author": "manafanana",
      "body": "I saw you commented on this old comment and just thought I’d mention that I’m ADHD and have an appointment with a GI doctor to see if I might have gastroparesis. It’s something that I only heard of recently and would explain my symptoms I was attributing to ADHD and/or to ARFID.",
      "created_utc": 1720514968.0,
      "score": 1,
      "context": [
        {
          "id": "kumx38e",
          "author": "manafanana",
          "body": "Going from ravenously hungry to completely full in two bites.",
          "created_utc": 1710306901.0
        },
        {
          "id": "lbx5zz8",
          "author": "Phoenixtdm",
          "body": "I don’t think I have ARFID but I’m autistic and I get this. It’s so annoying",
          "created_utc": 1720287204.0
        }
      ]
    },
    {
      "id": "kv7xzdh",
      "author": "jorwyn",
      "body": "It's only certain foods, too. Like, I don't care how yakisoba is packaged, but I agree about chicken nuggets from pretty much anywhere. Some things just.. I don't understand it, honestly.",
      "created_utc": 1710638475.0,
      "score": 2,
      "context": [
        {
          "id": "kumjgzu",
          "author": "jorwyn",
          "body": "The fact that a package can make a food okay. Like, if you put any tater tots in the paper cup/bowl thing from Taco Time, they're okay. If they're served any other way, I need to take a cautious bite first. They don't have to taste like the taco time ones or even look like them. Even I don't understand it, honestly. Putting them in that cup works! They're okay that way because they came from the \"magic\" taco time packaging. \n\nI had a friend who was a manager at one, and he gave me two huge stacks of brand new ones, so I could try other foods in them. Sadly, it only works with tater tots.",
          "created_utc": 1710300004.0
        },
        {
          "id": "kv7utmu",
          "author": "pink_elle",
          "body": "YES!! i can’t eat certain foods if they aren’t in original container (such as chic fil a nuggets)",
          "created_utc": 1710637154.0
        }
      ]
    },
    {
      "id": "kulqzaq",
      "author": "purplechunkymonkey",
      "body": "Me too! Personally I find it gross but my family loves it. But she's down to so few foods now. At least some are healthy.",
      "created_utc": 1710288740.0,
      "score": 29,
      "context": [
        {
          "id": "kuldejq",
          "author": "esteemed-colleague",
          "body": "Some foods are unsafe for no reason. I can’t tell you *why* it’s unsafe, it’s just unsafe and I’m not eating it.",
          "created_utc": 1710283828.0
        },
        {
          "id": "kulkoom",
          "author": "purplechunkymonkey",
          "body": "My daughter just lost Kraft m&c.",
          "created_utc": 1710286405.0
        },
        {
          "id": "kulqpwo",
          "author": "solitudanrian",
          "body": "i read this and mouthed \"oh dear god\". i feel for her and hope she finds a replacement soon.",
          "created_utc": 1710288639.0
        }
      ]
    },
    {
      "id": "kunmjiy",
      "author": "jorwyn",
      "body": "I can eat them without doing it if I've had them before at that place and they look exactly the same as usual. That's a huge improvement for me, actually. But if it's a new place or they look different, I just can't guarantee I'll be okay with the textures or flavours. If I try one thing and it's bad, I can just not eat the rest of that thing, but if I do that with the whole sandwich, then the whole sandwich is bad. I can't take that thing off. It doesn't work. Sometimes, I can then deconstruct it and eat things separately, but not reliably. \n\nAs a kid, I deconstructed everything except deviled eggs and soups. Everything. Even pizza. It drove my mother nuts, so I'd get in trouble. That really didn't help me get over it at all. \n\nI somehow just stopped having ARFID when I hit puberty. It was awesome! And then it came back when I got pregnant and never went away again. Ugh. But it had a good lasting thing. I had way more safe foods after than before, and there were a lot less things I had to deconstruct, but sandwiches are just an issue. \n\nThrough therapy, I've managed to add a lot of veggies the last couple of years. I'm pretty happy about that. Still isn't helping with sandwiches. It's like I just don't trust them. Who knows what's hiding in there? I love subway, because I can watch them put everything on.",
      "created_utc": 1710324926.0,
      "score": 2,
      "context": [
        {
          "id": "kulnm7s",
          "author": "mearn2",
          "body": "I didn’t get a damn bit of credit for still drinking that Coke at a restaurant after it was served with a slice of lemon",
          "created_utc": 1710287478.0
        },
        {
          "id": "kumiqjo",
          "author": "jorwyn",
          "body": "I actually like it that way, but everyone looks at me like I'm crazy. Who serves it that way?!\n\nI should get credit for not taking my sandwich apart and eating it one ingredient at a time when it didn't look like those sandwiches usually do. Did I? No, I did not get credit. It was hard!",
          "created_utc": 1710299677.0
        },
        {
          "id": "kunljjx",
          "author": "pirateshipsx",
          "body": "Omg finally someone else who deconstructs their sandwiches! I need to feel the textures in my hands to make sure they're safe ones and if they're not, I get turned off real damn quick lmao",
          "created_utc": 1710324258.0
        }
      ]
    },
    {
      "id": "lcd01fp",
      "author": "Phoenixtdm",
      "body": "I have ADHD too",
      "created_utc": 1720537664.0,
      "score": 1,
      "context": [
        {
          "id": "kumx38e",
          "author": "manafanana",
          "body": "Going from ravenously hungry to completely full in two bites.",
          "created_utc": 1710306901.0
        },
        {
          "id": "lbx5zz8",
          "author": "Phoenixtdm",
          "body": "I don’t think I have ARFID but I’m autistic and I get this. It’s so annoying",
          "created_utc": 1720287204.0
        },
        {
          "id": "lcboedc",
          "author": "manafanana",
          "body": "I saw you commented on this old comment and just thought I’d mention that I’m ADHD and have an appointment with a GI doctor to see if I might have gastroparesis. It’s something that I only heard of recently and would explain my symptoms I was attributing to ADHD and/or to ARFID.",
          "created_utc": 1720514968.0
        }
      ]
    },
    {
      "id": "kuluz2v",
      "author": "solitudanrian",
      "body": "We don't really have \"American cheese\" or what I assume Americans call cheddar here unless it's on McDonalds burgers. Kraft Mac and Cheese mimics it at least a little. If we had american cheddar here, I'd go full Homer\n\n&#x200B;\n\nhttps://preview.redd.it/13h54kr1zznc1.jpeg?width=640&format=pjpg&auto=webp&s=02e59517101e58d877e0d687522cb374c365403f\n\nI'm glad to hear the foods she still has are foods that are healthy that she can eat! Something to consider is that a lot of companies are changing their recipes of their food these days to make things cheaper and cheaper. Especially anything frozen or shelf stable. It's often ARFID, but sometimes they change it and it makes it unpalatable for us.",
      "created_utc": 1710290277.0,
      "score": 9,
      "context": [
        {
          "id": "kuldejq",
          "author": "esteemed-colleague",
          "body": "Some foods are unsafe for no reason. I can’t tell you *why* it’s unsafe, it’s just unsafe and I’m not eating it.",
          "created_utc": 1710283828.0
        },
        {
          "id": "kulkoom",
          "author": "purplechunkymonkey",
          "body": "My daughter just lost Kraft m&c.",
          "created_utc": 1710286405.0
        },
        {
          "id": "kulqpwo",
          "author": "solitudanrian",
          "body": "i read this and mouthed \"oh dear god\". i feel for her and hope she finds a replacement soon.",
          "created_utc": 1710288639.0
        },
        {
          "id": "kulqzaq",
          "author": "purplechunkymonkey",
          "body": "Me too! Personally I find it gross but my family loves it. But she's down to so few foods now. At least some are healthy.",
          "created_utc": 1710288740.0
        }
      ]
    },
    {
      "id": "kuu95t2",
      "author": "purplechunkymonkey",
      "body": "American cheese and cheddar are two completely different cheeses and taste nothing alike.",
      "created_utc": 1710426923.0,
      "score": 2,
      "context": [
        {
          "id": "kuldejq",
          "author": "esteemed-colleague",
          "body": "Some foods are unsafe for no reason. I can’t tell you *why* it’s unsafe, it’s just unsafe and I’m not eating it.",
          "created_utc": 1710283828.0
        },
        {
          "id": "kulkoom",
          "author": "purplechunkymonkey",
          "body": "My daughter just lost Kraft m&c.",
          "created_utc": 1710286405.0
        },
        {
          "id": "kulqpwo",
          "author": "solitudanrian",
          "body": "i read this and mouthed \"oh dear god\". i feel for her and hope she finds a replacement soon.",
          "created_utc": 1710288639.0
        },
        {
          "id": "kulqzaq",
          "author": "purplechunkymonkey",
          "body": "Me too! Personally I find it gross but my family loves it. But she's down to so few foods now. At least some are healthy.",
          "created_utc": 1710288740.0
        },
        {
          "id": "kuluz2v",
          "author": "solitudanrian",
          "body": "We don't really have \"American cheese\" or what I assume Americans call cheddar here unless it's on McDonalds burgers. Kraft Mac and Cheese mimics it at least a little. If we had american cheddar here, I'd go full Homer\n\n&#x200B;\n\nhttps://preview.redd.it/13h54kr1zznc1.jpeg?width=640&format=pjpg&auto=webp&s=02e59517101e58d877e0d687522cb374c365403f\n\nI'm glad to hear the foods she still has are foods that are healthy that she can eat! Something to consider is that a lot of companies are changing their recipes of their food these days to make things cheaper and cheaper. Especially anything frozen or shelf stable. It's often ARFID, but sometimes they change it and it makes it unpalatable for us.",
          "created_utc": 1710290277.0
        }
      ]
    },
    {
      "id": "kuygls3",
      "author": "solitudanrian",
      "body": "Well you can’t get Maccas cheese in supermarkets so it seemed like american cheese",
      "created_utc": 1710484758.0,
      "score": 1,
      "context": [
        {
          "id": "kuldejq",
          "author": "esteemed-colleague",
          "body": "Some foods are unsafe for no reason. I can’t tell you *why* it’s unsafe, it’s just unsafe and I’m not eating it.",
          "created_utc": 1710283828.0
        },
        {
          "id": "kulkoom",
          "author": "purplechunkymonkey",
          "body": "My daughter just lost Kraft m&c.",
          "created_utc": 1710286405.0
        },
        {
          "id": "kulqpwo",
          "author": "solitudanrian",
          "body": "i read this and mouthed \"oh dear god\". i feel for her and hope she finds a replacement soon.",
          "created_utc": 1710288639.0
        },
        {
          "id": "kulqzaq",
          "author": "purplechunkymonkey",
          "body": "Me too! Personally I find it gross but my family loves it. But she's down to so few foods now. At least some are healthy.",
          "created_utc": 1710288740.0
        },
        {
          "id": "kuluz2v",
          "author": "solitudanrian",
          "body": "We don't really have \"American cheese\" or what I assume Americans call cheddar here unless it's on McDonalds burgers. Kraft Mac and Cheese mimics it at least a little. If we had american cheddar here, I'd go full Homer\n\n&#x200B;\n\nhttps://preview.redd.it/13h54kr1zznc1.jpeg?width=640&format=pjpg&auto=webp&s=02e59517101e58d877e0d687522cb374c365403f\n\nI'm glad to hear the foods she still has are foods that are healthy that she can eat! Something to consider is that a lot of companies are changing their recipes of their food these days to make things cheaper and cheaper. Especially anything frozen or shelf stable. It's often ARFID, but sometimes they change it and it makes it unpalatable for us.",
          "created_utc": 1710290277.0
        },
        {
          "id": "kuu95t2",
          "author": "purplechunkymonkey",
          "body": "American cheese and cheddar are two completely different cheeses and taste nothing alike.",
          "created_utc": 1710426923.0
        }
      ]
    },
    {
      "id": "kv02x5b",
      "author": "purplechunkymonkey",
      "body": "That is probably American cheese. I know in the US it is.",
      "created_utc": 1710515765.0,
      "score": 1,
      "context": [
        {
          "id": "kuldejq",
          "author": "esteemed-colleague",
          "body": "Some foods are unsafe for no reason. I can’t tell you *why* it’s unsafe, it’s just unsafe and I’m not eating it.",
          "created_utc": 1710283828.0
        },
        {
          "id": "kulkoom",
          "author": "purplechunkymonkey",
          "body": "My daughter just lost Kraft m&c.",
          "created_utc": 1710286405.0
        },
        {
          "id": "kulqpwo",
          "author": "solitudanrian",
          "body": "i read this and mouthed \"oh dear god\". i feel for her and hope she finds a replacement soon.",
          "created_utc": 1710288639.0
        },
        {
          "id": "kulqzaq",
          "author": "purplechunkymonkey",
          "body": "Me too! Personally I find it gross but my family loves it. But she's down to so few foods now. At least some are healthy.",
          "created_utc": 1710288740.0
        },
        {
          "id": "kuluz2v",
          "author": "solitudanrian",
          "body": "We don't really have \"American cheese\" or what I assume Americans call cheddar here unless it's on McDonalds burgers. Kraft Mac and Cheese mimics it at least a little. If we had american cheddar here, I'd go full Homer\n\n&#x200B;\n\nhttps://preview.redd.it/13h54kr1zznc1.jpeg?width=640&format=pjpg&auto=webp&s=02e59517101e58d877e0d687522cb374c365403f\n\nI'm glad to hear the foods she still has are foods that are healthy that she can eat! Something to consider is that a lot of companies are changing their recipes of their food these days to make things cheaper and cheaper. Especially anything frozen or shelf stable. It's often ARFID, but sometimes they change it and it makes it unpalatable for us.",
          "created_utc": 1710290277.0
        },
        {
          "id": "kuu95t2",
          "author": "purplechunkymonkey",
          "body": "American cheese and cheddar are two completely different cheeses and taste nothing alike.",
          "created_utc": 1710426923.0
        },
        {
          "id": "kuygls3",
          "author": "solitudanrian",
          "body": "Well you can’t get Maccas cheese in supermarkets so it seemed like american cheese",
          "created_utc": 1710484758.0
        }
      ]
    }
  ]
}