{
  "id": "1bimmi1",
  "subreddit": "ARFID",
  "author": "None",
  "created_utc": 1710861265.0,
  "title": "8 year old son is a walking skeleton ",
  "selftext": "My son is 8, turning 9 soon. He has ARFID. Getting him to eat anything is a battle. It's a hit or miss if he eats Breakfast, and if he does then it's a few bites and he is done. The won't even touch his school lunches. Just ends up throwing his whole tray away. He goes to a private school and his lunches are amazing and all the other kids eat it up. His teachers have been concerned too. At dinner time, he eats the smallest bites possible and it takes HOURS to get him to eat what his 3 year old brother can eat in 10 mins. I'm talking a single pea at a time for example. He is so picky that he will pick one thing he wants and will eat only that. Nothing else. If it's not exactly what he wants then he just doesn't eat. When told he can't leave his plate till he puts effort in trying, he will purposely gag himself till he throws up. But its not like there is anything in his stomach other then water. This kid won't even eat a snickers bar. I'm about to switch doctors because I'm tired of being told that he is fine and will eat when he is hungry but he is never hungry! Being able to count every rib and vertebrae is not normal! His shoulder blades stick out so much and he cant sit on hard seats because of his boney butt. He can't keep up with his friends. He is so weak that he can't do what the other kids are doing like running, climbing the monkey bars, jump rope, anything due to no muscle mass at all. Hugging him feels like hugging a skeleton. I'm losing my mind tring to get him to eat. Snack bars, protein shakes, vitamins, pastas, McDonald's, anything to get him to pack on some pounds. We ask him why and he tells us he just doesn't like it or just doesnt want anything. Even if it was something he told us was his favorite. The other day he had a PB&J sandwich with a handful of chips that took him an hour and a half to finish. No distractions. Just him at the table starring at it. One micro bite at a time with his mom and I reminding him every 15 min that he needs to focus on eating so he can go back outside to play with his friends. We feel so frustrated. We are thinking of putting him on medication to increase his appetite. We put him in a karate class thinking he would work up an appetite but it hasn't worked. I don't understand it. ",
  "url": "https://www.reddit.com/r/ARFID/comments/1bimmi1/8_year_old_son_is_a_walking_skeleton/",
  "score": 126,
  "num_comments": 59,
  "comments": [
    {
      "id": "kvlb6il",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1710862564.0,
      "score": 217,
      "context": []
    },
    {
      "id": "kvljgqt",
      "author": "velociraptor56",
      "body": "My son was like this at 12. \n\n1 thing that helped was an SSRI. There was a clear anxiety component for my kid. The SSRI calmed that down a little, and he was less suspicious of his safe foods. \n\nHe is not purposely gagging himself. This is ARFID, he’s not refusing to eat on purpose. You need to change your mindset in order to help him. Minimize pressure and force around eating. When eating is full of stress, his symptoms will be worse. I recognize how difficult this is, as I’ve been there. Fed is best - if your son will eat ice cream for breakfast, give him ice cream for the time being. I sent my son with a candy bar for lunch for months while he was in treatment - because it is genuinely better than nothing.",
      "created_utc": 1710865431.0,
      "score": 180,
      "context": []
    },
    {
      "id": "kvllrye",
      "author": "BolognaMountain",
      "body": "I know only what you posted, but it sounds like there’s a lot of pressure to eat and eat quickly. What you’re doing isn’t working, so you need to try something new. Let him sit on the couch and watch tv if it helps. Or play on the tablet. Or eat in his room. Whatever. Try something new. You can work on changing behaviors when he is fed and feeling better. Right now he just needs to eat.",
      "created_utc": 1710866225.0,
      "score": 137,
      "context": []
    },
    {
      "id": "kvllgru",
      "author": "None",
      "body": "you need to switch doctors because yours sounds uninformed on this disorder and in turn negligent to your son. try to find an OT (occupational therapist) specializing in ARFID, they’re out there and will do exposure therapies to help (idk the technical name).\n\n“he will eat when he’s hungry” is absolutely not how ARFID works. not to mention when you are so malnourished and unaware of your hunger cues eating becomes even more unpleasant because of GI reactions nausea bloating etc.\n\nfor me only focusing on my food and nothing else just makes it harder to eat, because i have more time to think about how gross i feel, how not hungry i am, notice all the bodily reactions i get that feel bad, etc. it’s much easier for me to eat when i have someone talking to me, music playing, or something to read or fidget with.\n\nalso i know this is so hard on you as parents and it’s difficult to not get emotional but it’s likely that your son is responding to your visible distress and anxiety around his food habits by feeling even more stressed about them, which just makes it harder to eat when you know everyone is worried and watching. it adds a lot of pressure.\n\nalso he is NOT purposefully gagging himself. if you read many posts on here you will see that is a very common reaction from us. it is not voluntary. stop thinking he is doing this on purpose. he is not and he is struggling just as much if not more than you are as a parent with this.",
      "created_utc": 1710866120.0,
      "score": 61,
      "context": []
    },
    {
      "id": "kvld8ad",
      "author": "toocomplicated1",
      "body": "Talk to his pediatrician, seriously. My daughter had to be hospitalized for deficiency because of her Arfid and had to have a NG-tube and now a g-tube. Which probably sounds like the way you have to go when it gets this bad. Hope the best for you both!! 🩶 it takes a lot on us as mothers as well .",
      "created_utc": 1710863264.0,
      "score": 55,
      "context": []
    },
    {
      "id": "kvl97pz",
      "author": "keto_and_me",
      "body": "I would definitely get a 2nd opinion. In the mean time our pediatrician always suggests shakes like ensure. My stepdaughter doesn’t like them, but she has been willing to try. Fairlife protein shakes are very similar to chocolate milk and she will do one of those every once in a a while.",
      "created_utc": 1710861885.0,
      "score": 55,
      "context": []
    },
    {
      "id": "kvm90vx",
      "author": "KingTalis",
      "body": ">he will purposely gag himself till he throws up\n\nHe is NOT purposefully gagging himself. That is a response to you trying to force him to eat something that he mentally cannot handle.\n\nHe isn't going to \"work up an appetite\". He is not going to magically be able to eat because you tell him to try. Medication to increase his appetite is not going to help.\n\nThis is not being picky. This is a neurological disorder rendering him unable to eat. Feel free to comb through this subreddit and find the adults that are fully aware of what is going on having to have NG tubes put in because they cannot get themselves to eat. ARFID can be so severe that  of us would starve before we could down something that wasn't a safe food.\n\nYou need to find a competent Doctor who is knowledgeable in ARFID. Too many Doctors are ignorant about the subject and too full of themselves to learn.",
      "created_utc": 1710873975.0,
      "score": 46,
      "context": []
    },
    {
      "id": "kvlris5",
      "author": "TempleOfCyclops",
      "body": "I can tell you with absolute certainty that forcing him to sit at his plate till he eats is not going to IMPROVE his interest in food on any level.\n\nIf someone was staring at me trying to force me to eat with “no distractions” but the person who is demanding so much of me, I would also refuse to ever eat. \n\nI know this, because that was my childhood, and all it did was increase my insecurity, lead me not to trust others, and give me way more of a complex about ever eating in front of another human being.\n\nThat’s torture.",
      "created_utc": 1710868145.0,
      "score": 43,
      "context": []
    },
    {
      "id": "kvlc2od",
      "author": "whatdoidonowdamnit",
      "body": "Do the medication. Try a bunch of protein shakes. My kids liked pediasure at that age. I add vegan ice cream to powder plant based protein mixes for my lactose intolerant kid and run it through the blender to smooth it out. My kids are both on meds to stimulate appetite. One is an allergy led and the other is an anxiety med but the exact meds are chosen because they have increased appetite as a side effect. \n \nMy other suggestion is distractions at the table. At that age my kids ate way more when they were focused on something else. My younger son is ten and still eats the gogo squeeze packets on a daily basis, the yogurts and the fruit/veg ones. \n \nHow much water does he drink? When mine were little I gave them a tiny juice in the morning and by the time they finished that they would be open to the idea of food. Before the juice it was considered a personal insult to offer them food.",
      "created_utc": 1710862870.0,
      "score": 22,
      "context": []
    },
    {
      "id": "kvlq1iz",
      "author": "None",
      "body": "I was like this as a kid! Now 24! Be patient and kind. Pressure to eat can make it worse and increase the generic dislike of food through stressful association (I know it's frustrating and scary).\n\nWaiting until someome is 'hungry enough' will never work. I HATE that attitude, because I am someone who will literally starve instead of eat something that makes me uncomfortable.\n\nI'd recommend finding snacks that are easy to snack on whenever. I find mealtimes adding the pressure to eat soooo destructive!! \n\nAnd explore what it is that he likes/dislikes about food. I categorise taste, texture and temperature.. then work with that using cooking knowledge to try make something palatable. If you can get your son involved in the cooking side of stuff I think that would be very beneficial, you can expose him to lots of food and knowledge about how to do it without any pressure!!",
      "created_utc": 1710867647.0,
      "score": 21,
      "context": []
    },
    {
      "id": "kvlmojm",
      "author": "purplechunkymonkey",
      "body": "Figure out what he is willing to eat and provide that. But also know that safe foods often cycle. My daughter rarely eats the same meal as the rest of the family. But she is maintaining a healthy weight. Her pediatrician approved cereal as a good meal alternative because it is enhanced with vitamins. Pediatrician also has her on a daily vitamin.",
      "created_utc": 1710866531.0,
      "score": 18,
      "context": []
    },
    {
      "id": "kvmy9z2",
      "author": "anxiety_ftw",
      "body": "For starters, switch doctors, as that one clearly has absolutely no knowledge of how to treat ARFID.\n\nBut your behavior also isn't helping. I was in the exact same position as your son. I was eating very little, and I was forced to sit at the table eating things I may or may not like until I finish it, not allowed to pursue any other stimulation. I've always had trouble with eating, but having such an astronomical amount of pressure put onto me because of something I simply can't control contributed to my food trauma and later ARFID.\n\nI distinctly remember being shown pictures of extremely slim and boney people with anorexia, and told that I would turn out like them, malnourished and unhealthy. I felt such shame from that. You need to understand, not eating is not a choice but rather a mental block that you can't bypass consciously.\n\n> He is so picky that he will pick one thing he wants and will eat only that. Nothing else.\n\nThis is what we call a safe food. It's usually something reliable or simple that doesn't take much mental effort for us to eat, or something our brains simply decided wasn't a threat. If he won't eat anything else, give him some of his safe food. It may feel wrong, especially if it's unhealthy for whatever reason, but it's so much easier to stomach safe foods over unsafe foods.\n\n> No distractions. Just him at the table starring at it.\n\nI can't stress this enough: don't do this. Cease immediately. Depriving a child of stimulation is questionable enough, but when it's done in the name of forcing a child with ARFID to eat it never helps. Try to let him eat while watching TV, or doing something else that he finds enjoyable.\n\nYou don't seem to understand that your child has a serious eating disorder that can't be rectified with mere parenting. Provide a safe, stress-free atmosphere for your child. If you're looking for somewhere to start, then try to abolish meal times and provide simple things to snack on throughout the day.",
      "created_utc": 1710882399.0,
      "score": 13,
      "context": []
    },
    {
      "id": "kvlnj3b",
      "author": "hungo_bungo",
      "body": "Get a new doctor. Try protein/meal replacement shakes, there are so many of them. Have you tried letting him eat in a room alone while watching tv (assuming he likes watching tv)? \n\nAs someone who has ARFID, certain surroundings/environments put more pressure on me to eat & therefore I am unable to. If him being isolated seems to work more than anything else, get a mini fridge in his room. This way he can easily access his foods in his own space. \n\nAlso maybe try to not verbally ask him what he wants to eat but do a picture book/board of some sort where he can point to the pictures.",
      "created_utc": 1710866816.0,
      "score": 10,
      "context": []
    },
    {
      "id": "kvmm5vc",
      "author": "vorarefilia",
      "body": "I understand it's frustrating and scary as a parent to watch your kid waste away, but please rethink your approach to your kid's symptoms. He's not making himself gag, he is gagging. He's not picky, he's bound to eating only certain foods. He doesn't only eat what he wants, he eats what he can.\nYour decision to change doctors is surely the best.",
      "created_utc": 1710878361.0,
      "score": 8,
      "context": []
    },
    {
      "id": "kvmn5fa",
      "author": "okoktrip",
      "body": "definitely stop forcing him. it sounds like the anxiety of meal time is stressing him out tbh. try giving him a random smack during an activity and see if he gobbles it down. i also have arfid and its always been easier to eat when im mentay busy. also the stress of eating is way worse than the actual chewing. also, check with ur dentist!! could be a mouth issue u never know",
      "created_utc": 1710878690.0,
      "score": 8,
      "context": []
    },
    {
      "id": "kvm6pqr",
      "author": "Numap",
      "body": "Look for a Developmental Pediatrician.",
      "created_utc": 1710873206.0,
      "score": 6,
      "context": []
    },
    {
      "id": "kvmc9q9",
      "author": "None",
      "body": "i have quite a few family members who suffered really bad arfid growing up (like very underweight; won't eat anything other than the occasional fruit or chocolate). a thing that really helped them was eating while watching something, or playing a videogame. it's like their appetite would be back, or like they wouldn't be grossed out anymore. my mum would make them these really fatty toasts with lots of butter, cheese and prosciutto, and they'd nom down up to 3 sandwiches at once if they were distracted enough! i suggest you try eating with movies, tv shows or videogames. something really engaging.",
      "created_utc": 1710875054.0,
      "score": 5,
      "context": []
    },
    {
      "id": "kvma9wm",
      "author": "Sassy_Spicy",
      "body": "I wish I had a solution, but I also have an 8 year old with ARFID and he is also falling off of his curve by the day. I’m here for solidarity and in hopes that there’s a suggestion left that helps my kiddo as well. Thank you for posting this.",
      "created_utc": 1710874389.0,
      "score": 5,
      "context": []
    },
    {
      "id": "kvm2f9b",
      "author": "AsOsh",
      "body": "Occupational Therapy helped my twins a lot. It can't be underestimated.\n\nTheir sensory issues where addressed slowly and at their own pace. But if that's not an option, I've heard some good feedback from feeding therapy?",
      "created_utc": 1710871768.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kvmlmmv",
      "author": "Opposite-Birthday69",
      "body": "Change doctors and give him what he wants until he gains a bit of weight. Other people have good suggestions such as distractions. \n\nI know it’s very difficult but trying to create more positive memories with food will help. When you have so many negative memories you start to dread eating. I cannot eat at most potlucks because I have had to use my epi pen too many times because people didn’t realize that their dish had coconut in it. I get anxious eating out because I don’t know if what they’re doing with the food. I only eat at the same few places where I know I won’t get sick. \n\nI do think that the most important thing is getting him to gain a little weight before trying to include other foods. I am extremely picky (my main ARFID symptom is fear of chocking to death/ anaphylaxis) and I have never gotten used to a lot of foods and downright hate a lot. I try to focus on what I can eat and try foods that tolerate to expand what I eat.",
      "created_utc": 1710878184.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kvn6pd6",
      "author": "luteyla",
      "body": "Are you also on Facebook \"[ARFID Parents/Carers Support Group (previously diagnosed as SED)](https://www.facebook.com/groups/1188680687816813/?hoisted_section_header_type=recently_seen&multi_permalinks=7955552864462861&__cft__[0]=AZVwZ451DW4mnJV1nxvcBuu9OERciQseRuTO6b1z7hfuvq-xjEnebT1LpvGeoPna9vTQjGspkAeEg2Mq03SngOLiuF9ioyVE8qyV37rOTPmnUUIzLrd9Ct44wv3eGGy19tfujL7_UGhPAyi4COHgbIK4yNF8-sHtUwgj3F2HNFtVU0Hmbbj2zxFS20uZo3x2Zx8&__tn__=-UC%2CP-R]-R)\" group? Someone shared a Whey protein powder that is tasteless. Maybe your kid can drink it? It has all the protein the body needs. Of course then there is other things like iron, b12 etc.",
      "created_utc": 1710885268.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kvnd64x",
      "author": "Aquila-Calvitium",
      "body": "100% change doctors, that is a doctor who doesn't understand eating disorders at all\n\nI'm not an expert but I suggest seeing a dietary specialist specifically. If this continues he may have to be admitted to hospital and be put on a drip.\n\nAs someone with ARFID myself, I just can't think of any tips or tricks to get him to eat. When it comes to this disorder, if you can't then you just can't.",
      "created_utc": 1710887523.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kvnuqap",
      "author": "FutureDiscoPop",
      "body": "What about tiny snacks throughout the day instead of sitting and focusing on one meal? \n\nMaybe encourage him to eat while he's doing something else (like talking to someone or playing a game?) so that the focus is not solely on the food?",
      "created_utc": 1710894004.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kvnwqv5",
      "author": "SachiKaM",
      "body": "I’ve been this way for 31 years but it was much worse during those developmental stages. Into adulthood I’ve come to realize anxiety plays a huge part in my appetite. Personal preference amounts to my “pickiness”. Separating the two has been critical on multiple occasions. Fed is always best, don’t over prioritize nutrients if it’s all or nothing. My school anxiety was hell for every meal. Feeling “forced” or criticized only fueled the anxiety. I do better eating while distracted. \n\nAt school I was eventually excused from communal lunch or eating obligations. This made me able to relax enough to eat dinner. Same at home and in general, I can’t/won’t eat around other people. Stimulus overload ≠ hungry. Likewise, once your body acclimates to finding comfort in starvation, you are more comfortable when your stomach is empty. My hunger cues are not conditioned to make me want to eat. Don’t count on him eating when he gets hungry, the Dr is wrong. \n\nHunger and serotonin play hand and hand. Boost his serotonin and you will likely lose some of that push back against food.",
      "created_utc": 1710894763.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kvq9f05",
      "author": "georgecostanzalvr",
      "body": "Take him to therapy, take yourselves to therapy. This is hard on everyone and you don’t want your frustration to make the situation worse. It sounds like your frustration is making your perspective of the situation a little skewed, understandably, but be cognizant that he is not intentionally doing anything. He wants to eat just as much as you want him to, but he is even more clueless than you are on how to accomplish that! I highly recommend distracting him while he’s eats. Give him a sandwich and sit him in front of the TV, or talk to him, make him bring out side with him and take a bite every five minutes. It’s a lot easier to do something you hate when it’s not the main focus. Good luck to y’all and your son!",
      "created_utc": 1710941219.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kvr04lz",
      "author": "manafanana",
      "body": "Forcing a child with ARFID to sit at the table alone staring at their food, and then expecting the child to eat is as absurd as forcing a child with a broken leg to forgo a cast and crutches, and then expecting the child to walk across the room. Your child has a medical condition. He’s not choosing to not behave in the way you expect. HE LITERALLY CAN’T, and your expectations are unreasonable. Please, for the sake of your child stop forcing him to sit at the table and stare at his food. It’s the exact opposite of helpful.",
      "created_utc": 1710950559.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kvtsu7s",
      "author": "SubzeroNYC",
      "body": "Olanzapine helped for us",
      "created_utc": 1710985134.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kvn75ru",
      "author": "Infurl",
      "body": "Mirtazapine was an overnight game changer for my daughter. Half the lowest dose pill (7.5mg) at night and the next day she started munching and munching. Faster than an SSRI, not sure if other people have had success too, but want to share here in case it’s helpful.",
      "created_utc": 1710885424.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kvnl3d4",
      "author": "InevitablePersimmon6",
      "body": "Can he take a packed lunch to school? I never would have eaten the school food. My mom packed my lunch and my sister’s lunch everyday. \n\nWill be drink things like Pediasure?\n\nI can’t imagine he’s not hungry. There’s probably something else going on. I wouldn’t eat no matter how starving I am, even now, if I didn’t have any safe foods around. I’d just drink a ton of water and let it go.",
      "created_utc": 1710890419.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kvq0zsf",
      "author": "Spider_pig448",
      "body": "Get him on liquid supplements. PediaSure, Boost, whatever. Maintaining weight is much more important than food diversity",
      "created_utc": 1710937630.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kvqb5vt",
      "author": "SpiceAndNicee",
      "body": "Use distractions, it may help. I feel the task of eating even my favourite things very daunting. Unless I’m talking to someone or watching something or reading something I physically can not eat. Having to eat and experience every little texture of the bite is overwhelming and too much.\n\nAll the above mentioned is great but sometimes using distracting to eat will help in the short term until the bigger issues are dealt with and ironed out.",
      "created_utc": 1710941903.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kvqwuxs",
      "author": "None",
      "body": "He's definitely not purposely throwing up. When I was a kid it used to happen to me too and my mom would always yell at me saying I'm purposely doing it but I wasn't! \n\nWho likes to throw up? \n\nI used to force myself to eat but that maked me nauseous and I'd eventually throw up. \n\nA big part for why I couldn't eat was definitely unmanaged anxiety. I'm better at managing anxiety now but whenever I'm sad or anxious I lose my appetite and even looking at food makes me disgusted. \n\nYou should definitely change doctors also please try to not get mad, that will definitely help with some of the anxiety part.",
      "created_utc": 1710949492.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kvuq4sa",
      "author": "Mustard-cutt-r",
      "body": "It would benefit the whole family to start working with specialists in ARFID and EDs.",
      "created_utc": 1711002044.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kvxy22n",
      "author": "HalcyontheCookie",
      "body": "Not sure if this has been said, but I wouldn't focus at all on exercise now. We made that mistake, and our child was truly too far off the weight scale to burn more calories exercising. Find his most favourite calorie-rich foods, let him eat them when he wants to for now, and give him reward for every gain he makes! By all means necessary, find a specialist in ARFID ASAP! Most family physicians have little knowledge about EDs. I say all of this from experience. Take care!",
      "created_utc": 1711052648.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kw0pvuq",
      "author": "Single-Ad-1104",
      "body": "My daughter was hospitalized from malnutrition after losing a ton of weight last year so I feel your pain, it is so hopeless. I honestly began giving her anything she wanted to eat, whenever she wanted it. This became Hershey bars for lunch and chocolate milkshakes for dinner. I started using pediasure mixed with Hershey syrup (to hide the vitamin flavor) to mix up the milkshakes and it worked like a charm to get her healthy within a month. I know that this sounds insane and unhealthy but it was my only option besides being in the hospital hooked up to tubes for nutrition. She slowly started eating chicken nuggets and sometimes cheese and that’s where we are now. Those are her only foods but finding a drink you can sneak nutrients into is *key* to getting them healthy and energetic enough to even think about any real food. Also dental hygiene has to obviously be on level 100, which is it’s own battle.",
      "created_utc": 1711098057.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kvodnqj",
      "author": "CozmicOwl16",
      "body": "If you’re in a medicinal state that allows it.  The only thing that has helped me overcome my food discomfort is THC.  I hope you find help. As an adult who’s already diagnosed with OCD, I think there’s a clear correlation.",
      "created_utc": 1710901374.0,
      "score": 0,
      "context": []
    },
    {
      "id": "kvm95qh",
      "author": "kendraro",
      "body": "Ice cream isn't mentioned enough on this sub! We do a lot of Haagen-Dazs at our house.",
      "created_utc": 1710874020.0,
      "score": 80,
      "context": [
        {
          "id": "kvlb6il",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1710862564.0
        }
      ]
    },
    {
      "id": "kvpa6ht",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1710920030.0,
      "score": 21,
      "context": [
        {
          "id": "kvljgqt",
          "author": "velociraptor56",
          "body": "My son was like this at 12. \n\n1 thing that helped was an SSRI. There was a clear anxiety component for my kid. The SSRI calmed that down a little, and he was less suspicious of his safe foods. \n\nHe is not purposely gagging himself. This is ARFID, he’s not refusing to eat on purpose. You need to change your mindset in order to help him. Minimize pressure and force around eating. When eating is full of stress, his symptoms will be worse. I recognize how difficult this is, as I’ve been there. Fed is best - if your son will eat ice cream for breakfast, give him ice cream for the time being. I sent my son with a candy bar for lunch for months while he was in treatment - because it is genuinely better than nothing.",
          "created_utc": 1710865431.0
        }
      ]
    },
    {
      "id": "kvlvyh0",
      "author": "None",
      "body": "This. Sitting at the table staring at my plate for hours not allowed to get up until I ate is the source of so much trauma and food shame for me. He’s being taught to dread mealtimes, telling him to focus on eating and not letting him play until he does is only making things worse. I know how helpless this feels, but you’ve gotta start reshaping his mind around food and mealtimes because I bet that’s half the battle for him. Listen to this episode of this parenting podcast I love, they interviewed a certified pediatriic nutritionist with her masters, I learned so much and unlearned alot too. \n\nhttps://podcasts.apple.com/us/podcast/childproof/id1683225645?i=1000648999964\n\nGet a new doctor, and find someone that works with eating disorders, even better if you can find someone in pediatric nutrition. If you can’t, therapy is a good start.",
      "created_utc": 1710869620.0,
      "score": 99,
      "context": [
        {
          "id": "kvllrye",
          "author": "BolognaMountain",
          "body": "I know only what you posted, but it sounds like there’s a lot of pressure to eat and eat quickly. What you’re doing isn’t working, so you need to try something new. Let him sit on the couch and watch tv if it helps. Or play on the tablet. Or eat in his room. Whatever. Try something new. You can work on changing behaviors when he is fed and feeling better. Right now he just needs to eat.",
          "created_utc": 1710866225.0
        }
      ]
    },
    {
      "id": "kvo9v17",
      "author": "jenniferlynne08",
      "body": "Yep! A big part of my ARFID stems from the trauma of having to sit at the table and stare at my food with no distractions until I finished. \n\nIn fact, now that I’m mid-recovery, the way I talk about it is I have to “approach it from the side”. I usually just start by putting the food near me and picking a show and once I’m engrossed in the show, grab it and start slowly picking at it. I might set it down and declare myself “done” but start picking at it again 45 min later.\n\nOP, consider changing the rigidity. The pressure to eat is often what kills my appetite in the first place. I’m sure it’s so terrifying to watch your baby become a skeleton but you don’t want to give him the idea that he’s letting you down by not eating.",
      "created_utc": 1710899850.0,
      "score": 22,
      "context": [
        {
          "id": "kvllrye",
          "author": "BolognaMountain",
          "body": "I know only what you posted, but it sounds like there’s a lot of pressure to eat and eat quickly. What you’re doing isn’t working, so you need to try something new. Let him sit on the couch and watch tv if it helps. Or play on the tablet. Or eat in his room. Whatever. Try something new. You can work on changing behaviors when he is fed and feeling better. Right now he just needs to eat.",
          "created_utc": 1710866225.0
        }
      ]
    },
    {
      "id": "kvoih1k",
      "author": "brokengirl89",
      "body": "THIS. My daughter will barely eat unless I put her in front of a screen. Then she will eat a full meal without even realising she’s done it. Is it good practice for most kids? No. But it works for us because otherwise she is a literal skeleton. Throw out everything you think you know about “proper” eating. The goal *right now*, *at this stage* is to get calories in. Any calories, any way you can.",
      "created_utc": 1710903398.0,
      "score": 17,
      "context": [
        {
          "id": "kvllrye",
          "author": "BolognaMountain",
          "body": "I know only what you posted, but it sounds like there’s a lot of pressure to eat and eat quickly. What you’re doing isn’t working, so you need to try something new. Let him sit on the couch and watch tv if it helps. Or play on the tablet. Or eat in his room. Whatever. Try something new. You can work on changing behaviors when he is fed and feeling better. Right now he just needs to eat.",
          "created_utc": 1710866225.0
        }
      ]
    },
    {
      "id": "kvqwyw4",
      "author": "manafanana",
      "body": "Yeah, my first reaction was why the heck is he at the table that whole time. Even now to get through a normal sized meal I have to keep it near me for half the day while I’m working.",
      "created_utc": 1710949528.0,
      "score": 5,
      "context": [
        {
          "id": "kvllrye",
          "author": "BolognaMountain",
          "body": "I know only what you posted, but it sounds like there’s a lot of pressure to eat and eat quickly. What you’re doing isn’t working, so you need to try something new. Let him sit on the couch and watch tv if it helps. Or play on the tablet. Or eat in his room. Whatever. Try something new. You can work on changing behaviors when he is fed and feeling better. Right now he just needs to eat.",
          "created_utc": 1710866225.0
        }
      ]
    },
    {
      "id": "kvmpywh",
      "author": "Mysterious-Bird4364",
      "body": "An OT is the best advice. He's probably got all kinds of sensory issues with food. And the advice to change your mindset. Increasing anxiety around food is the worst thing",
      "created_utc": 1710879632.0,
      "score": 12,
      "context": [
        {
          "id": "kvllgru",
          "author": "None",
          "body": "you need to switch doctors because yours sounds uninformed on this disorder and in turn negligent to your son. try to find an OT (occupational therapist) specializing in ARFID, they’re out there and will do exposure therapies to help (idk the technical name).\n\n“he will eat when he’s hungry” is absolutely not how ARFID works. not to mention when you are so malnourished and unaware of your hunger cues eating becomes even more unpleasant because of GI reactions nausea bloating etc.\n\nfor me only focusing on my food and nothing else just makes it harder to eat, because i have more time to think about how gross i feel, how not hungry i am, notice all the bodily reactions i get that feel bad, etc. it’s much easier for me to eat when i have someone talking to me, music playing, or something to read or fidget with.\n\nalso i know this is so hard on you as parents and it’s difficult to not get emotional but it’s likely that your son is responding to your visible distress and anxiety around his food habits by feeling even more stressed about them, which just makes it harder to eat when you know everyone is worried and watching. it adds a lot of pressure.\n\nalso he is NOT purposefully gagging himself. if you read many posts on here you will see that is a very common reaction from us. it is not voluntary. stop thinking he is doing this on purpose. he is not and he is struggling just as much if not more than you are as a parent with this.",
          "created_utc": 1710866120.0
        }
      ]
    },
    {
      "id": "kvmtmb0",
      "author": "JayWolf3017",
      "body": "The Fairlife ones are so far the best ones I've had. Ensure is a bit grainy? I don't know how else to describe it. Premier protein, the flavors are quite intense.",
      "created_utc": 1710880847.0,
      "score": 11,
      "context": [
        {
          "id": "kvl97pz",
          "author": "keto_and_me",
          "body": "I would definitely get a 2nd opinion. In the mean time our pediatrician always suggests shakes like ensure. My stepdaughter doesn’t like them, but she has been willing to try. Fairlife protein shakes are very similar to chocolate milk and she will do one of those every once in a a while.",
          "created_utc": 1710861885.0
        }
      ]
    },
    {
      "id": "kvpgdeu",
      "author": "AetherDrew43",
      "body": "How well is ARFID known, if you don't mind me asking?\n\nBecause I swear no one in my country has heard of it.",
      "created_utc": 1710924982.0,
      "score": 5,
      "context": [
        {
          "id": "kvm90vx",
          "author": "KingTalis",
          "body": ">he will purposely gag himself till he throws up\n\nHe is NOT purposefully gagging himself. That is a response to you trying to force him to eat something that he mentally cannot handle.\n\nHe isn't going to \"work up an appetite\". He is not going to magically be able to eat because you tell him to try. Medication to increase his appetite is not going to help.\n\nThis is not being picky. This is a neurological disorder rendering him unable to eat. Feel free to comb through this subreddit and find the adults that are fully aware of what is going on having to have NG tubes put in because they cannot get themselves to eat. ARFID can be so severe that  of us would starve before we could down something that wasn't a safe food.\n\nYou need to find a competent Doctor who is knowledgeable in ARFID. Too many Doctors are ignorant about the subject and too full of themselves to learn.",
          "created_utc": 1710873975.0
        }
      ]
    },
    {
      "id": "kvlooe6",
      "author": "hungo_bungo",
      "body": "Also, does your son have Autism and or PDA? If so, these can really feed into ARFID and they will all feed off of one another.",
      "created_utc": 1710867198.0,
      "score": 11,
      "context": [
        {
          "id": "kvlnj3b",
          "author": "hungo_bungo",
          "body": "Get a new doctor. Try protein/meal replacement shakes, there are so many of them. Have you tried letting him eat in a room alone while watching tv (assuming he likes watching tv)? \n\nAs someone who has ARFID, certain surroundings/environments put more pressure on me to eat & therefore I am unable to. If him being isolated seems to work more than anything else, get a mini fridge in his room. This way he can easily access his foods in his own space. \n\nAlso maybe try to not verbally ask him what he wants to eat but do a picture book/board of some sort where he can point to the pictures.",
          "created_utc": 1710866816.0
        }
      ]
    },
    {
      "id": "kvoul1f",
      "author": "ToughLilNugget",
      "body": "This. Autistic niece with ARFID and quite good insight into her condition/determination to try and work around it ALWAYS distracts herself when eating. Do whatever works - watch TV, play a mobile game, walk and eat - literally anything. \n\nAnd if there’s anything he can eat currently focus on getting him that in exactly the way he needs it. Anything going in is better than nothing.\n\nAnd yes. New doctor. As fast as possible. He will be headed for malnutrition if he doesn’t get the right support and care.",
      "created_utc": 1710909314.0,
      "score": 1,
      "context": [
        {
          "id": "kvmc9q9",
          "author": "None",
          "body": "i have quite a few family members who suffered really bad arfid growing up (like very underweight; won't eat anything other than the occasional fruit or chocolate). a thing that really helped them was eating while watching something, or playing a videogame. it's like their appetite would be back, or like they wouldn't be grossed out anymore. my mum would make them these really fatty toasts with lots of butter, cheese and prosciutto, and they'd nom down up to 3 sandwiches at once if they were distracted enough! i suggest you try eating with movies, tv shows or videogames. something really engaging.",
          "created_utc": 1710875054.0
        }
      ]
    },
    {
      "id": "kvr1oev",
      "author": "manafanana",
      "body": "This is a fine suggestion for an adult, but there’s a lot of science about the lasting harm THC does to developing brains. It is definitely not a safe option for an 8 yo child.",
      "created_utc": 1710951069.0,
      "score": 3,
      "context": [
        {
          "id": "kvodnqj",
          "author": "CozmicOwl16",
          "body": "If you’re in a medicinal state that allows it.  The only thing that has helped me overcome my food discomfort is THC.  I hope you find help. As an adult who’s already diagnosed with OCD, I think there’s a clear correlation.",
          "created_utc": 1710901374.0
        }
      ]
    },
    {
      "id": "kvn8oe6",
      "author": "smarty_skirts",
      "body": "It’s tillamook here- so high in fat!! 👍👍👍",
      "created_utc": 1710885944.0,
      "score": 20,
      "context": [
        {
          "id": "kvlb6il",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1710862564.0
        },
        {
          "id": "kvm95qh",
          "author": "kendraro",
          "body": "Ice cream isn't mentioned enough on this sub! We do a lot of Haagen-Dazs at our house.",
          "created_utc": 1710874020.0
        }
      ]
    },
    {
      "id": "kvqwar1",
      "author": "manafanana",
      "body": "I mean, it *is possible* he’s not hungry, speaking from my own experience. There are hormones that trigger the hunger sensation, and they can become out of whack just like any other hormones. There were definitely many, many times when I was a child that I didn’t feel hungry, even though I was starving. When I got into high school I became self-aware enough that I knew I needed to eat if I got a headache or started experiencing symptoms of low blood sugar, but I still didn’t (and still don’t) experience the physical sensation of hunger every time I need to eat.",
      "created_utc": 1710949306.0,
      "score": 8,
      "context": [
        {
          "id": "kvljgqt",
          "author": "velociraptor56",
          "body": "My son was like this at 12. \n\n1 thing that helped was an SSRI. There was a clear anxiety component for my kid. The SSRI calmed that down a little, and he was less suspicious of his safe foods. \n\nHe is not purposely gagging himself. This is ARFID, he’s not refusing to eat on purpose. You need to change your mindset in order to help him. Minimize pressure and force around eating. When eating is full of stress, his symptoms will be worse. I recognize how difficult this is, as I’ve been there. Fed is best - if your son will eat ice cream for breakfast, give him ice cream for the time being. I sent my son with a candy bar for lunch for months while he was in treatment - because it is genuinely better than nothing.",
          "created_utc": 1710865431.0
        },
        {
          "id": "kvpa6ht",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1710920030.0
        }
      ]
    },
    {
      "id": "kvlx9km",
      "author": "None",
      "body": "You’ve also got to completely hide your frustration and annoyance with mealtimes, he will mimic and take that on, it’s also teaching him to feel anxiety around food. He knows your stressed and he will take that on, he’s already going through enough. there’s I know it sucks, but you have to for him. \n\nAlso, he is not gagging on purpose. ARFID Is not fun, or a choice, and as shitty as it is for you, it’s 10x worse with him. His hunger cues are likely non existent at this point and he’s not yet old enough to realize the dizziness and nausea and irritability and weakness are all hunger cues. ARFID is hard, and lonely, and I wish my mom would have educated herself and helped me more, but we also didn’t have the knowledge then that we do now. Be ready to advocate for him, you will have to educate others and even doctors, and yourself. You need to stand up for him when family comments on his eating habits or food, it’s not their business period and it’s just piling the shame on him. YOU have the opportunity to be a safe space for him, take it! Being on this sub is great for you to gain perspective and get some answers, I applaud you for that👏🏻",
      "created_utc": 1710870057.0,
      "score": 59,
      "context": [
        {
          "id": "kvllrye",
          "author": "BolognaMountain",
          "body": "I know only what you posted, but it sounds like there’s a lot of pressure to eat and eat quickly. What you’re doing isn’t working, so you need to try something new. Let him sit on the couch and watch tv if it helps. Or play on the tablet. Or eat in his room. Whatever. Try something new. You can work on changing behaviors when he is fed and feeling better. Right now he just needs to eat.",
          "created_utc": 1710866225.0
        },
        {
          "id": "kvlvyh0",
          "author": "None",
          "body": "This. Sitting at the table staring at my plate for hours not allowed to get up until I ate is the source of so much trauma and food shame for me. He’s being taught to dread mealtimes, telling him to focus on eating and not letting him play until he does is only making things worse. I know how helpless this feels, but you’ve gotta start reshaping his mind around food and mealtimes because I bet that’s half the battle for him. Listen to this episode of this parenting podcast I love, they interviewed a certified pediatriic nutritionist with her masters, I learned so much and unlearned alot too. \n\nhttps://podcasts.apple.com/us/podcast/childproof/id1683225645?i=1000648999964\n\nGet a new doctor, and find someone that works with eating disorders, even better if you can find someone in pediatric nutrition. If you can’t, therapy is a good start.",
          "created_utc": 1710869620.0
        }
      ]
    },
    {
      "id": "kvqxx52",
      "author": "manafanana",
      "body": "Bingo. ‘Fed is best’ doesn’t just apply to babies. We need to get the calories in whatever way works.",
      "created_utc": 1710949837.0,
      "score": 3,
      "context": [
        {
          "id": "kvllrye",
          "author": "BolognaMountain",
          "body": "I know only what you posted, but it sounds like there’s a lot of pressure to eat and eat quickly. What you’re doing isn’t working, so you need to try something new. Let him sit on the couch and watch tv if it helps. Or play on the tablet. Or eat in his room. Whatever. Try something new. You can work on changing behaviors when he is fed and feeling better. Right now he just needs to eat.",
          "created_utc": 1710866225.0
        },
        {
          "id": "kvoih1k",
          "author": "brokengirl89",
          "body": "THIS. My daughter will barely eat unless I put her in front of a screen. Then she will eat a full meal without even realising she’s done it. Is it good practice for most kids? No. But it works for us because otherwise she is a literal skeleton. Throw out everything you think you know about “proper” eating. The goal *right now*, *at this stage* is to get calories in. Any calories, any way you can.",
          "created_utc": 1710903398.0
        }
      ]
    },
    {
      "id": "kvnj48i",
      "author": "AbeliaGG",
      "body": "I did premier for years.. it still tastes strongly of whey no matter what flavor. For SOME reason that fair life chocolate legit tastes like a melted chocolate soft serve.",
      "created_utc": 1710889691.0,
      "score": 7,
      "context": [
        {
          "id": "kvl97pz",
          "author": "keto_and_me",
          "body": "I would definitely get a 2nd opinion. In the mean time our pediatrician always suggests shakes like ensure. My stepdaughter doesn’t like them, but she has been willing to try. Fairlife protein shakes are very similar to chocolate milk and she will do one of those every once in a a while.",
          "created_utc": 1710861885.0
        },
        {
          "id": "kvmtmb0",
          "author": "JayWolf3017",
          "body": "The Fairlife ones are so far the best ones I've had. Ensure is a bit grainy? I don't know how else to describe it. Premier protein, the flavors are quite intense.",
          "created_utc": 1710880847.0
        }
      ]
    },
    {
      "id": "kvofbaw",
      "author": "weirdsituati0n",
      "body": "Nutrition shake girlie chiming in here – ensure gives me the ick, boost doesn’t. Sometimes you’ve gotta try a few! \n\nFairlife are sooo good, probably my fav. But my dietician eventually persuaded me to switch to boost 😇",
      "created_utc": 1710902058.0,
      "score": 3,
      "context": [
        {
          "id": "kvl97pz",
          "author": "keto_and_me",
          "body": "I would definitely get a 2nd opinion. In the mean time our pediatrician always suggests shakes like ensure. My stepdaughter doesn’t like them, but she has been willing to try. Fairlife protein shakes are very similar to chocolate milk and she will do one of those every once in a a while.",
          "created_utc": 1710861885.0
        },
        {
          "id": "kvmtmb0",
          "author": "JayWolf3017",
          "body": "The Fairlife ones are so far the best ones I've had. Ensure is a bit grainy? I don't know how else to describe it. Premier protein, the flavors are quite intense.",
          "created_utc": 1710880847.0
        }
      ]
    },
    {
      "id": "kvpvzo3",
      "author": "NotApplicableMC",
      "body": "Its occurrence is estimated to be as common as anorexia nervosa, and has been in the DSM since 2013. But it doesn’t seem to be widespread knowledge in the medical field at all. \n\nIf I had to guess, it’s probably because it’s unlike any other ED. Most EDs are connected to body image and present as more of an addiction, whereas ARFID is mostly aversion to texture & taste, disinterest in food, or eating-related phobias (choking). It can’t be treated in the same way as other EDs, because it’s not an addiction and has nothing to do with body image, which is what a lot of ED doctors don’t understand. \n\nTreatment for ARFID is more similar to OCD or PTSD, because it’s primarily sensory or trauma based disorder. Most ED doctors aren’t educated on that. You have to find specialists which are super rare.",
      "created_utc": 1710935163.0,
      "score": 5,
      "context": [
        {
          "id": "kvm90vx",
          "author": "KingTalis",
          "body": ">he will purposely gag himself till he throws up\n\nHe is NOT purposefully gagging himself. That is a response to you trying to force him to eat something that he mentally cannot handle.\n\nHe isn't going to \"work up an appetite\". He is not going to magically be able to eat because you tell him to try. Medication to increase his appetite is not going to help.\n\nThis is not being picky. This is a neurological disorder rendering him unable to eat. Feel free to comb through this subreddit and find the adults that are fully aware of what is going on having to have NG tubes put in because they cannot get themselves to eat. ARFID can be so severe that  of us would starve before we could down something that wasn't a safe food.\n\nYou need to find a competent Doctor who is knowledgeable in ARFID. Too many Doctors are ignorant about the subject and too full of themselves to learn.",
          "created_utc": 1710873975.0
        },
        {
          "id": "kvpgdeu",
          "author": "AetherDrew43",
          "body": "How well is ARFID known, if you don't mind me asking?\n\nBecause I swear no one in my country has heard of it.",
          "created_utc": 1710924982.0
        }
      ]
    },
    {
      "id": "kvshfdq",
      "author": "CozmicOwl16",
      "body": "I know a child with seizures who is prescribed medical thc suckers. I don’t think you know better than doctors. But enjoy that high horse.",
      "created_utc": 1710968036.0,
      "score": 0,
      "context": [
        {
          "id": "kvodnqj",
          "author": "CozmicOwl16",
          "body": "If you’re in a medicinal state that allows it.  The only thing that has helped me overcome my food discomfort is THC.  I hope you find help. As an adult who’s already diagnosed with OCD, I think there’s a clear correlation.",
          "created_utc": 1710901374.0
        },
        {
          "id": "kvr1oev",
          "author": "manafanana",
          "body": "This is a fine suggestion for an adult, but there’s a lot of science about the lasting harm THC does to developing brains. It is definitely not a safe option for an 8 yo child.",
          "created_utc": 1710951069.0
        }
      ]
    },
    {
      "id": "kvnplwp",
      "author": "NiasRhapsody",
      "body": "Kirkland brand ice cream too! It’s the most delicious store bought ice cream I’ve EVER tasted!",
      "created_utc": 1710892087.0,
      "score": 12,
      "context": [
        {
          "id": "kvlb6il",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1710862564.0
        },
        {
          "id": "kvm95qh",
          "author": "kendraro",
          "body": "Ice cream isn't mentioned enough on this sub! We do a lot of Haagen-Dazs at our house.",
          "created_utc": 1710874020.0
        },
        {
          "id": "kvn8oe6",
          "author": "smarty_skirts",
          "body": "It’s tillamook here- so high in fat!! 👍👍👍",
          "created_utc": 1710885944.0
        }
      ]
    },
    {
      "id": "kvopj7a",
      "author": "JayWolf3017",
      "body": "May I ask why they wanted you to switch to boost?",
      "created_utc": 1710906648.0,
      "score": 2,
      "context": [
        {
          "id": "kvl97pz",
          "author": "keto_and_me",
          "body": "I would definitely get a 2nd opinion. In the mean time our pediatrician always suggests shakes like ensure. My stepdaughter doesn’t like them, but she has been willing to try. Fairlife protein shakes are very similar to chocolate milk and she will do one of those every once in a a while.",
          "created_utc": 1710861885.0
        },
        {
          "id": "kvmtmb0",
          "author": "JayWolf3017",
          "body": "The Fairlife ones are so far the best ones I've had. Ensure is a bit grainy? I don't know how else to describe it. Premier protein, the flavors are quite intense.",
          "created_utc": 1710880847.0
        },
        {
          "id": "kvofbaw",
          "author": "weirdsituati0n",
          "body": "Nutrition shake girlie chiming in here – ensure gives me the ick, boost doesn’t. Sometimes you’ve gotta try a few! \n\nFairlife are sooo good, probably my fav. But my dietician eventually persuaded me to switch to boost 😇",
          "created_utc": 1710902058.0
        }
      ]
    },
    {
      "id": "kvpxn6o",
      "author": "AetherDrew43",
      "body": "I'm really unsure if I have ARFID, but many of its symptoms describe me perfectly. I find most food repulsive, and stick mostly to my safe foods and I very rarely add anything new to my menu.\n\nI don't even like pizza, for that matter.\n\nBut if you're saying that finding specialists is super rare and most EDs don't even know about it, then my chances of finding one in my country (Ecuador) are very low. Ugh...",
      "created_utc": 1710936007.0,
      "score": 4,
      "context": [
        {
          "id": "kvm90vx",
          "author": "KingTalis",
          "body": ">he will purposely gag himself till he throws up\n\nHe is NOT purposefully gagging himself. That is a response to you trying to force him to eat something that he mentally cannot handle.\n\nHe isn't going to \"work up an appetite\". He is not going to magically be able to eat because you tell him to try. Medication to increase his appetite is not going to help.\n\nThis is not being picky. This is a neurological disorder rendering him unable to eat. Feel free to comb through this subreddit and find the adults that are fully aware of what is going on having to have NG tubes put in because they cannot get themselves to eat. ARFID can be so severe that  of us would starve before we could down something that wasn't a safe food.\n\nYou need to find a competent Doctor who is knowledgeable in ARFID. Too many Doctors are ignorant about the subject and too full of themselves to learn.",
          "created_utc": 1710873975.0
        },
        {
          "id": "kvpgdeu",
          "author": "AetherDrew43",
          "body": "How well is ARFID known, if you don't mind me asking?\n\nBecause I swear no one in my country has heard of it.",
          "created_utc": 1710924982.0
        },
        {
          "id": "kvpvzo3",
          "author": "NotApplicableMC",
          "body": "Its occurrence is estimated to be as common as anorexia nervosa, and has been in the DSM since 2013. But it doesn’t seem to be widespread knowledge in the medical field at all. \n\nIf I had to guess, it’s probably because it’s unlike any other ED. Most EDs are connected to body image and present as more of an addiction, whereas ARFID is mostly aversion to texture & taste, disinterest in food, or eating-related phobias (choking). It can’t be treated in the same way as other EDs, because it’s not an addiction and has nothing to do with body image, which is what a lot of ED doctors don’t understand. \n\nTreatment for ARFID is more similar to OCD or PTSD, because it’s primarily sensory or trauma based disorder. Most ED doctors aren’t educated on that. You have to find specialists which are super rare.",
          "created_utc": 1710935163.0
        }
      ]
    },
    {
      "id": "kvpyehh",
      "author": "NotApplicableMC",
      "body": "I really recommend just getting this book [The Picky Eater’s Recovery Book by Dr Jennifer J Thomas](https://amzn.eu/d/5xdiFWU). It’s literally a self-help guide, has loads of tables and worksheets. The first part of the book explains what ARFID is and the 3 different ways it can present, plus a host of possible causes. Just the first part of the book is invaluable IMO. \n\nObviously recovery is not easy, but this book has at least made it possible. (My fiancé has ARFID and we’ve gradually found more safe foods with the aid of this book).",
      "created_utc": 1710936390.0,
      "score": 2,
      "context": [
        {
          "id": "kvm90vx",
          "author": "KingTalis",
          "body": ">he will purposely gag himself till he throws up\n\nHe is NOT purposefully gagging himself. That is a response to you trying to force him to eat something that he mentally cannot handle.\n\nHe isn't going to \"work up an appetite\". He is not going to magically be able to eat because you tell him to try. Medication to increase his appetite is not going to help.\n\nThis is not being picky. This is a neurological disorder rendering him unable to eat. Feel free to comb through this subreddit and find the adults that are fully aware of what is going on having to have NG tubes put in because they cannot get themselves to eat. ARFID can be so severe that  of us would starve before we could down something that wasn't a safe food.\n\nYou need to find a competent Doctor who is knowledgeable in ARFID. Too many Doctors are ignorant about the subject and too full of themselves to learn.",
          "created_utc": 1710873975.0
        },
        {
          "id": "kvpgdeu",
          "author": "AetherDrew43",
          "body": "How well is ARFID known, if you don't mind me asking?\n\nBecause I swear no one in my country has heard of it.",
          "created_utc": 1710924982.0
        },
        {
          "id": "kvpvzo3",
          "author": "NotApplicableMC",
          "body": "Its occurrence is estimated to be as common as anorexia nervosa, and has been in the DSM since 2013. But it doesn’t seem to be widespread knowledge in the medical field at all. \n\nIf I had to guess, it’s probably because it’s unlike any other ED. Most EDs are connected to body image and present as more of an addiction, whereas ARFID is mostly aversion to texture & taste, disinterest in food, or eating-related phobias (choking). It can’t be treated in the same way as other EDs, because it’s not an addiction and has nothing to do with body image, which is what a lot of ED doctors don’t understand. \n\nTreatment for ARFID is more similar to OCD or PTSD, because it’s primarily sensory or trauma based disorder. Most ED doctors aren’t educated on that. You have to find specialists which are super rare.",
          "created_utc": 1710935163.0
        },
        {
          "id": "kvpxn6o",
          "author": "AetherDrew43",
          "body": "I'm really unsure if I have ARFID, but many of its symptoms describe me perfectly. I find most food repulsive, and stick mostly to my safe foods and I very rarely add anything new to my menu.\n\nI don't even like pizza, for that matter.\n\nBut if you're saying that finding specialists is super rare and most EDs don't even know about it, then my chances of finding one in my country (Ecuador) are very low. Ugh...",
          "created_utc": 1710936007.0
        }
      ]
    },
    {
      "id": "kvq3ig1",
      "author": "AetherDrew43",
      "body": "Well, thanks. But ordering through Amazon is very limited for me... I love my country, but DAMN is it hard to get stuff here.\n\nI'm royally screwed getting help. I already lost my gallbladder because of this eating disorder. And I feel I will carry this burden for the rest of my life.",
      "created_utc": 1710938763.0,
      "score": 1,
      "context": [
        {
          "id": "kvm90vx",
          "author": "KingTalis",
          "body": ">he will purposely gag himself till he throws up\n\nHe is NOT purposefully gagging himself. That is a response to you trying to force him to eat something that he mentally cannot handle.\n\nHe isn't going to \"work up an appetite\". He is not going to magically be able to eat because you tell him to try. Medication to increase his appetite is not going to help.\n\nThis is not being picky. This is a neurological disorder rendering him unable to eat. Feel free to comb through this subreddit and find the adults that are fully aware of what is going on having to have NG tubes put in because they cannot get themselves to eat. ARFID can be so severe that  of us would starve before we could down something that wasn't a safe food.\n\nYou need to find a competent Doctor who is knowledgeable in ARFID. Too many Doctors are ignorant about the subject and too full of themselves to learn.",
          "created_utc": 1710873975.0
        },
        {
          "id": "kvpgdeu",
          "author": "AetherDrew43",
          "body": "How well is ARFID known, if you don't mind me asking?\n\nBecause I swear no one in my country has heard of it.",
          "created_utc": 1710924982.0
        },
        {
          "id": "kvpvzo3",
          "author": "NotApplicableMC",
          "body": "Its occurrence is estimated to be as common as anorexia nervosa, and has been in the DSM since 2013. But it doesn’t seem to be widespread knowledge in the medical field at all. \n\nIf I had to guess, it’s probably because it’s unlike any other ED. Most EDs are connected to body image and present as more of an addiction, whereas ARFID is mostly aversion to texture & taste, disinterest in food, or eating-related phobias (choking). It can’t be treated in the same way as other EDs, because it’s not an addiction and has nothing to do with body image, which is what a lot of ED doctors don’t understand. \n\nTreatment for ARFID is more similar to OCD or PTSD, because it’s primarily sensory or trauma based disorder. Most ED doctors aren’t educated on that. You have to find specialists which are super rare.",
          "created_utc": 1710935163.0
        },
        {
          "id": "kvpxn6o",
          "author": "AetherDrew43",
          "body": "I'm really unsure if I have ARFID, but many of its symptoms describe me perfectly. I find most food repulsive, and stick mostly to my safe foods and I very rarely add anything new to my menu.\n\nI don't even like pizza, for that matter.\n\nBut if you're saying that finding specialists is super rare and most EDs don't even know about it, then my chances of finding one in my country (Ecuador) are very low. Ugh...",
          "created_utc": 1710936007.0
        },
        {
          "id": "kvpyehh",
          "author": "NotApplicableMC",
          "body": "I really recommend just getting this book [The Picky Eater’s Recovery Book by Dr Jennifer J Thomas](https://amzn.eu/d/5xdiFWU). It’s literally a self-help guide, has loads of tables and worksheets. The first part of the book explains what ARFID is and the 3 different ways it can present, plus a host of possible causes. Just the first part of the book is invaluable IMO. \n\nObviously recovery is not easy, but this book has at least made it possible. (My fiancé has ARFID and we’ve gradually found more safe foods with the aid of this book).",
          "created_utc": 1710936390.0
        }
      ]
    }
  ]
}