{
  "id": "1bktwlt",
  "subreddit": "ARFID",
  "author": "kawaiikitten03",
  "created_utc": 1711094104.0,
  "title": "Does anyone else with ARFID pretend like they don’t have it",
  "selftext": "I keep catching myself lying about liking or knowing other foods outside my safe circle. My friend was talking to me about fast food places, then that turned into talking about burgers and what one is the best. She was ranting about how the burgers at ___ were better than the ones at ___ and I just kept agreeing and building on what she was saying despite never having a burger in my life. Something similar happened when we were talking about soft drinks, I claimed I liked Pepsi more than other drinks even though I’ve never had anything other than water and a very certain apple juice brand lol. Is this a universal thing or am I just too ashamed of my arfid",
  "url": "https://www.reddit.com/r/ARFID/comments/1bktwlt/does_anyone_else_with_arfid_pretend_like_they/",
  "score": 88,
  "num_comments": 22,
  "comments": [
    {
      "id": "kw11z7q",
      "author": "Alarow",
      "body": "Arfid is basically unknown so even if I were to talk about it they wouldn't understand anyway\n\nMight as well pretend I'm normal",
      "created_utc": 1711106096.0,
      "score": 24,
      "context": []
    },
    {
      "id": "kw14h81",
      "author": "cleverCLEVERcharming",
      "body": "I do this a lot with food topics but all topics really, especially when making small talk. I used to take it waaaaay too far and then look like I was lying about some really small thing. So I adjusted my language just a bit. Instead of saying, “yeah, I like pepsi way more too” I replace it with the general population “people seem to really like pepsi more too.” What I’m really trying to do is just be agreeable and make small talk without having to bring up my deep dark mental health quirks. So I try to generalize even more to keep things vague and superficial but still genuine and interesting. Maybe that trick might work?",
      "created_utc": 1711107460.0,
      "score": 17,
      "context": []
    },
    {
      "id": "kw0u92a",
      "author": "Moosycakes",
      "body": "Yep, it’s really rough socially 😳\nI can get pretty embarrassed about it, particularly if I think I’m causing problems. Sometimes I feel like if I share my real food opinions then I’ll just shut down the conversation. People don’t really like to hear about how you don’t like most food, it’s not relatable as most people have such a natural food motivation.\n\nFood is also so intertwined with morality that if I say ‘I don’t like that’ or ‘I don’t really eat that’ then it sometimes seems like people take it as me trying to act superior/like I’m some health goddess who would never touch (whatever food the other person likes or brought up in the conversation). I promise I don’t think I’m better than you because I won’t touch your fave food! And eating a good variety of foods you love is way healthier than my boring and bland diet anyway. But a lot of people don’t get that because they subconsciously connect a restrictive diet with health even though that’s not really how it works 😫",
      "created_utc": 1711101254.0,
      "score": 11,
      "context": []
    },
    {
      "id": "kw0zyp6",
      "author": "BolognaMountain",
      "body": "This is the UNO Theory played out in real life. \n\nYou’re having a conversation with someone and, like UNO, you can put down a matching number or a matching color to keep the conversation going. You want to keep the conversation going, and keep playing, so you keep putting down the right cards. In reality, your stack of cards is from a standard deck, and you can’t put down a jack of spades, because you know that’s the wrong thing to play to keep going. So you keep playing UNO with what you have.",
      "created_utc": 1711104926.0,
      "score": 9,
      "context": []
    },
    {
      "id": "kw1mtju",
      "author": "Ru_rehtaeh",
      "body": "I don’t exactly do this, but I also don’t let on how much food bothers me. I don’t talk about my issues with food, I just work with what I’ve got and I’ve trained myself to at least take a bite of something I think will be tolerable so it looks like I ate something. But I can almost always find something I’ll eat on the menu now that I’m semi recovered",
      "created_utc": 1711115374.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kw1wxt5",
      "author": "Foliage_Freak",
      "body": "It’s ok to mask when we don’t feel comfortable talking about food.\n\nI work in a restaurant currently and they are always encouraging us to try food. To the point that people have noticed when I don’t. Tbh I just usually will dip my fork into something and act as if I have a huge bite and then respond accordingly.\n\nNothing worse than having to eat an unsafe food in front of all your peers. 🤢",
      "created_utc": 1711118923.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kw33cgp",
      "author": "ParfaitDisastrous306",
      "body": "Yeah I’ve been traveling lately - I find myself in so many conservations when people are like “oh I’ve been eating so unhealthy lately I need to eat more veg” “ the fresh fruit and veg here is so bad/ expensive” and I’m like hmmm yes even though I’ve never eaten vegetable in my life",
      "created_utc": 1711132921.0,
      "score": 4,
      "context": []
    },
    {
      "id": "kw6dqva",
      "author": "Yours_truly_snow",
      "body": "I don’t know if this is being offensive but it is generally going to be unhelpful, so I apologize in advance. I don’t personally go through this but if I found out someone had continually lied to me about trying a burger and had a whole improv convo abt it, not only would I be impressed but that would genuinely be the funniest revelation ever.",
      "created_utc": 1711188221.0,
      "score": 4,
      "context": []
    },
    {
      "id": "kw1yzo3",
      "author": "DogTracksJacks",
      "body": "eh thats too much energy. and what if they try and make me eat a food i lied about liking? nah not worth the effort or the risk",
      "created_utc": 1711119616.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kw33cw5",
      "author": "PeachOnAWarmBeach",
      "body": "I just ate,  my stomach is feeling off,  i have/ had a late  meal already planned,  toothache.....\n\n\nI'm here for the company,  which i value with or without food.",
      "created_utc": 1711132925.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kw3fd6t",
      "author": "APairOfRaggedQuarks",
      "body": "I don’t lie about it if asked, but I also don’t correct people’s assumptions—most salads are safe for me, so people just assume I’m too health-conscious for fast food & too frugal to go out to other restaurants. \n\nIf someone asks about a food I don’t eat, I just say I haven’t tried it—usually no one asks follow-up questions, or they’ll say “oh you have to try some sometime!” before continuing the conversation as normal. For all they know, I’m vegetarian or have an allergy or something, & they’re always too polite to pry 🤷‍♀️",
      "created_utc": 1711136945.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kw5sj9n",
      "author": "InevitablePersimmon6",
      "body": "I just say I have allergies to people who don’t know me well. Or that I just ate.",
      "created_utc": 1711172160.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kw8ujp0",
      "author": "AbbreviationsNo3918",
      "body": "Yes I absolutely do this too. I feel weird shame when I share that I don’t like certain things, like I’m a picky adult child or closed minded. It does tend to turn a conversation south or shut it down, which I never want to do. It might not be the healthiest approach but in general I pretend like I don’t have arfid to everyone except the closest people in my life. No one understands it and the last thing I ever want to do is have to explain it to anyone.",
      "created_utc": 1711225886.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kw13c8s",
      "author": "OpheliaJade2382",
      "body": "I don’t do this but I get why you would. Most people would be surprised that you haven’t tried things but I don’t think they’d judge you negatively",
      "created_utc": 1711106847.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kw3pts0",
      "author": "violentlysuzanna",
      "body": "man, i totally get what youre saying, i did the same thing until about a month ago when i found out i have ARFID. before that, Id get mad at myself for being “super picky” or for “not liking veggies and fruits”, and obviously i felt ashamed because society frowns upon that. plus, feeling different from everyone else, especially with something thats a basic need like eating, it can get really tricky and confusing when you dont want to stand out.",
      "created_utc": 1711140510.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kw5eq18",
      "author": "spaghettify",
      "body": "yeah. for some reason people get really judgmental about picky eaters to the point where i’ve seen people say it genuinely makes them angry. so I don’t really talk about my ed unless it’s a safe person\n\nalso my parents used to yell at me because I would have trouble finding things or places I was able to eat so that probably didn’t help",
      "created_utc": 1711164526.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kw7o8rm",
      "author": "wadingthroughtrauma",
      "body": "Yes",
      "created_utc": 1711210473.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kw0r8hy",
      "author": "rilo_cat",
      "body": "i simply tell people “i don’t eat that animal” and they hush usually (more often than not, they’re offering me some meat stuff i don’t want)",
      "created_utc": 1711099082.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kw1x1dn",
      "author": "Foliage_Freak",
      "body": "This is soooo smart. I’m def going to use",
      "created_utc": 1711118956.0,
      "score": 5,
      "context": [
        {
          "id": "kw14h81",
          "author": "cleverCLEVERcharming",
          "body": "I do this a lot with food topics but all topics really, especially when making small talk. I used to take it waaaaay too far and then look like I was lying about some really small thing. So I adjusted my language just a bit. Instead of saying, “yeah, I like pepsi way more too” I replace it with the general population “people seem to really like pepsi more too.” What I’m really trying to do is just be agreeable and make small talk without having to bring up my deep dark mental health quirks. So I try to generalize even more to keep things vague and superficial but still genuine and interesting. Maybe that trick might work?",
          "created_utc": 1711107460.0
        }
      ]
    },
    {
      "id": "kw3w005",
      "author": "kawaiikitten03",
      "body": "Will definitely be using this",
      "created_utc": 1711142650.0,
      "score": 3,
      "context": [
        {
          "id": "kw14h81",
          "author": "cleverCLEVERcharming",
          "body": "I do this a lot with food topics but all topics really, especially when making small talk. I used to take it waaaaay too far and then look like I was lying about some really small thing. So I adjusted my language just a bit. Instead of saying, “yeah, I like pepsi way more too” I replace it with the general population “people seem to really like pepsi more too.” What I’m really trying to do is just be agreeable and make small talk without having to bring up my deep dark mental health quirks. So I try to generalize even more to keep things vague and superficial but still genuine and interesting. Maybe that trick might work?",
          "created_utc": 1711107460.0
        }
      ]
    },
    {
      "id": "kw6f2ja",
      "author": "kawaiikitten03",
      "body": "LOL this made me feel sorta less guilty about it🤗",
      "created_utc": 1711189198.0,
      "score": 2,
      "context": [
        {
          "id": "kw6dqva",
          "author": "Yours_truly_snow",
          "body": "I don’t know if this is being offensive but it is generally going to be unhelpful, so I apologize in advance. I don’t personally go through this but if I found out someone had continually lied to me about trying a burger and had a whole improv convo abt it, not only would I be impressed but that would genuinely be the funniest revelation ever.",
          "created_utc": 1711188221.0
        }
      ]
    }
  ]
}