{
  "id": "1bm4p39",
  "subreddit": "ARFID",
  "author": "Furstname74727",
  "created_utc": 1711232421.0,
  "title": "My doctor laughed at me today",
  "selftext": "I went to the doctor today to get prescribed some antibiotics for my uti, we didnt talk for very long but she asked me what vitamins i take, I said what type of multivitamins I take, and she laughed at me. Ive been taking the same multivitamin liquid since I was a kid because its the only one that tastes good enough for me to not puke it up and I guess its more associated with being for kids than adults since she laughed and asked me when I'll start acting like an adult while still laughing. I just feel undermined and embarassed, I really like my multivitamin liquid but now I'm embarassed to even have them, I feel like no one takes me seriously and like I'm just a big joke to everyone when they find out I dont/cant eat normally :(",
  "url": "https://www.reddit.com/r/ARFID/comments/1bm4p39/my_doctor_laughed_at_me_today/",
  "score": 150,
  "num_comments": 47,
  "comments": [
    {
      "id": "kw9da45",
      "author": "EllieAtBakerStreet",
      "body": "Fuck em. You are not a joke. Drs who laugh at you are awful. I take the kids flintstones gummy vitamins because they’re cheaper than adult gummy vitamins for me.",
      "created_utc": 1711233039.0,
      "score": 161,
      "context": []
    },
    {
      "id": "kw9etgv",
      "author": "RunaroundX",
      "body": "Its inappropriate for a DR to laugh at their patient. Leave a bad review and find a new dr",
      "created_utc": 1711233647.0,
      "score": 37,
      "context": []
    },
    {
      "id": "kw9drvi",
      "author": "booksncatsn",
      "body": "I'm glad you found one that tastes good! That's  so inappropriate for a Dr to talk like that. \n\nMay I ask what you take? I cant find a liquid one that my daughter likes. Thank you!",
      "created_utc": 1711233234.0,
      "score": 29,
      "context": []
    },
    {
      "id": "kw9eop1",
      "author": "underinfinitebluesky",
      "body": "That's really gross and unprofessional of them, there's nothing wrong with taking in vitamins in the way that works best for you.",
      "created_utc": 1711233594.0,
      "score": 19,
      "context": []
    },
    {
      "id": "kw9qu7k",
      "author": "Kelekona",
      "body": "Is there some sort of oversight that you can report him to?\n\nPeople who worry about \"childish\" vs \"adult\" are small-minded idjits and it's a shame that other people are the ones to suffer from their disorder.",
      "created_utc": 1711238459.0,
      "score": 16,
      "context": []
    },
    {
      "id": "kwaa08k",
      "author": "matramepapi",
      "body": "Fuck that noise. I work at a health food store and almost every supplement we sell has a liquid and a gummy/chewable version. For ADULTS. I’ve seen hundreds of adults buy these products too and I have some as well. Don’t stop whatever works for you, it isn’t anybody else’s business to judge.",
      "created_utc": 1711246445.0,
      "score": 15,
      "context": []
    },
    {
      "id": "kwadyie",
      "author": "ShoutoutToWomen",
      "body": "Genuinely, tell her superior. Anyone on my medical team would be appalled to hear about something like that, and they're right to hypothetically be so. \n\n1) Your health and wellbeing isn't a joke and shouldn't be laughed at. \n2) This is extremely unprofessional and in her field, I'd say \"fucked up\". The amount of time spent to make sure that these situations don't happen is ridiculous.\n3) Anyone capable of stepping out of their own ego knows what kind of damage this could do. Someone who's job is to recognize, resolve, and respect the issues other people have should especially be aware of what the consequences could be.",
      "created_utc": 1711248224.0,
      "score": 14,
      "context": []
    },
    {
      "id": "kwa9hmb",
      "author": "CherryPickerKill",
      "body": "I would report them right now",
      "created_utc": 1711246216.0,
      "score": 8,
      "context": []
    },
    {
      "id": "kwac2xr",
      "author": "JadeT522",
      "body": "Time for a new PCP and very unprofessional on her part! I remember my mom taking me to my PCP for disordered eating and my dr literally said to me “You need to start eating okay.” Years down the line my psychiatrist begged me to go see her and she told me that I was 30 Lbs. overweight. That day I went home so depressed that I left her a horrible review online and requested a new PCP.",
      "created_utc": 1711247366.0,
      "score": 6,
      "context": []
    },
    {
      "id": "kwa4yvw",
      "author": "AbbreviationsNo3918",
      "body": "That’s absolute BS. Your doctor sounds ignorant. Never feel shame for taking a multivitamin that is good for your body. Of all the things to feel self conscious about, this should not be one.",
      "created_utc": 1711244271.0,
      "score": 5,
      "context": []
    },
    {
      "id": "kwcbm4k",
      "author": "None",
      "body": "I have had a doctor laugh at me for taking miralax 2 times a day saying it's a \"kids laxative\" , when it was ANOTHER doctor who prescribed it to me after I kept ending up in the hospital with diverticulitis caused by chronic constipation caused by IBS. If I even miss one dose of the miralax I am in the bathroom with terrible pain if I make sure I take it every morning and every night I can go without pain. Miralax isn't even marketed directly to children I get that alot of children use it because it's gentle and non habit forming but it's generally made for people of any age.But boy did that one doctors making fun of me sting and stick with me.",
      "created_utc": 1711290168.0,
      "score": 4,
      "context": []
    },
    {
      "id": "kwc5zs6",
      "author": "vaguely_sardonic",
      "body": "Hell no, find a new doctor. Doctors shouldn't discourage their patients from taking care of themselves however they have to.",
      "created_utc": 1711287808.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kwafuoo",
      "author": "EternalOptomist4Hire",
      "body": "That doctor is TRASH. I just started going to the dentist again after losing insurance, and I’ve been asking her different questions, especially as I can’t do mint. She said that if the label show the same numbers, they’ll do the same thing. You’re honestly such a boss for taking care of yourself and taking vitamins daily! I’m not there yet, but I feel like it would be so helpful to have that extra reassurance. \n\nWhen I was 9, I went to my doctor and told her I had pneumonia. She said “no, you don’t have pneumonia” and that’s the story of how I had pneumonia for a month and a half. Doctors can be idiots medically AND also because they don’t understand social cues.\n\nEven when you see someone professional for their help, you still get to give input, and be involved in the conversation about what’s happening. If your doctor was concerned, they should have asked about the FORM of your vitamins and why it was necessary, and ask if you wanted to change what you were taking. \n\nGood luck, I hope you feel better soon! There’s nothing embarrassing about taking care of yourself!",
      "created_utc": 1711249093.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kwawdep",
      "author": "Complete-Sir-2620",
      "body": "i take kids vitamins as well because they’re less harsh on my stomach! fuck that doctor",
      "created_utc": 1711257676.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kwco4jq",
      "author": "serendipty3821",
      "body": "That's awful, I'm sorry. I take a multivitamin gummy not necessary because of arfid but because of my ADHD- I could take a pill but because of the extra step required of drinking water with it I won't end up taking it.",
      "created_utc": 1711294957.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kwd29bz",
      "author": "ssspiral",
      "body": "should have asked her when she’s gonna start acting like a professional",
      "created_utc": 1711300075.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kwdj2pr",
      "author": "Ok-Werewolf-5320",
      "body": "im so sorry your doctor laughed at you thats not fair and not appropriate and i use kids vitamins because i have a feeding tube and need liquid vitamins and the kids ones i’ve always taken the kids liquid even before my feeding tube placement even i take kids benydral and kids Tylenol and kids Motrin because they don’t have liquid in adults and i need liquid of mostly everything so i used kids everything i had a doctor ask me why and i said ask my medical team they advised me and the doctor laughed at me and said wow didn’t know your body was like a child but i am sensitive to medication but children meds dont have the same effect there easier on my body.",
      "created_utc": 1711305999.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kwe3hh2",
      "author": "brokengirl89",
      "body": "OP. I had a similar experience at the pharmacy the other day as I take “children’s antihistamine liquid”. I asked for help as my current brand was discontinued and I needed to find a new one, that wasn’t peach flavoured as I’m allergic. My boyfriend came with me although he stood several paces away. The lady looked at me so strangely and when I confirmed it was for me, commented at least 5 times that “it was for children” and that she “didn’t even know if it would work on adults” (Of course it does, you just take double the child dose. Wtf? You work at a pharmacy, you should know this). It was incredibly humiliating and demeaning the way she said it.\n\nI will continue to enjoy my grape flavoured antihistamine and she can feel ashamed of herself because I certainly don’t, and neither should you. I take a kids vitamin most of the time too. Kids vitamins and medicines are the way!",
      "created_utc": 1711313317.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kwe3qz0",
      "author": "arewedeadyett",
      "body": "Nothing wrong with liquid or kids vitamins! I didn’t know how to swallow a pill until I was in my late teens because a doctor said “it’s about time I learn”. I’ve always had a choking phobia and to this day it’s still hard for me to take pills. Also kid’s vitamins are usually cheaper, taste better, and do the exact same thing! Fuck that doctor!",
      "created_utc": 1711313412.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kwf84b3",
      "author": "SpiritualSun3274",
      "body": "That boils my blood so unprofessional and I would file a grievance",
      "created_utc": 1711328733.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kwheb9a",
      "author": "Overall_Mind_9754",
      "body": "Report them to your state medical board and keep taking your delicious liquid vitamin",
      "created_utc": 1711373350.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kwal2of",
      "author": "dumbroad",
      "body": "she shouldnt have laughed at you, but she should have seriously explained that the vitamin isnt sufficient for adults",
      "created_utc": 1711251598.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kwahig4",
      "author": "Herb_the_Nerd",
      "body": "Just for the record, I also take a liquid medicine meant for like 8-11 yr olds, so your not alone on this. Fuck that doctor. It’s doctors like these that make me concerned about the way ppl whose job it is to help you just ignore and laugh at your needs. I’ve heard too many stories of people going to the doctors about serious issues, and they undermine it like it’s nothing. Then almost always the person turns out to have a serious illness. I’m tired of it. I’m sorry this happened to you.",
      "created_utc": 1711249875.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kwakj3i",
      "author": "Reasonable-Driver-63",
      "body": "Do the vitamins work properly for your adult body? Yes? Ok, then you have no reason to stop.  That's the whole point... it makes no sense to change to the regular ones if they'll be a bother to you. Personally, the ones I take tastes real bad, worse than other meds I take daily. But anyway the point is: focus on yourself, that's what matters",
      "created_utc": 1711251332.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kwbgt9k",
      "author": "mushroomfan9999",
      "body": "That is extremely unprofessional of her.. If you can, find a different doctor and i reccomend reporting her.",
      "created_utc": 1711272752.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kwbjo1z",
      "author": "laurenj2210",
      "body": "Doctors are people, people are dicks. I was told i could take kids calpol as an adult as long as i doubled the dose",
      "created_utc": 1711274914.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kwbnlcz",
      "author": "axw3555",
      "body": "Call up the clinic/practice/whatever and complain. That’s totally unacceptable for a professional.",
      "created_utc": 1711277751.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kwbt5jx",
      "author": "kawaiikitten03",
      "body": "that docter really sucks and had no reason to laugh, i know loads of people who dont have arfid or any other sort of problems and still use children vitamin / gummies, i use them myself they taste way better so your deff not a big joke or even a small one for that matter 👍💕",
      "created_utc": 1711281354.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kwbyin6",
      "author": "blxoom",
      "body": "fuck that \"doctor\" went to 6 years of school yet can't show simple human empathy and understanding.\n\nsome people are smart yet really really stupid EQ wise. sorry about that.",
      "created_utc": 1711284260.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kwb58j4",
      "author": "dollyswans",
      "body": "You should report his behavior. If you want someone else to- I gladly will on your behalf",
      "created_utc": 1711263696.0,
      "score": 0,
      "context": []
    },
    {
      "id": "kw9f1cb",
      "author": "Furstname74727",
      "body": "Thank you, I'm really glad to hear I'm not alone in taking \"kids\" vitamins",
      "created_utc": 1711233735.0,
      "score": 41,
      "context": [
        {
          "id": "kw9da45",
          "author": "EllieAtBakerStreet",
          "body": "Fuck em. You are not a joke. Drs who laugh at you are awful. I take the kids flintstones gummy vitamins because they’re cheaper than adult gummy vitamins for me.",
          "created_utc": 1711233039.0
        }
      ]
    },
    {
      "id": "kw9hjlr",
      "author": "solitudanrian",
      "body": "I don't see how a vitamin for kids would be sufficient enough for an adult?",
      "created_utc": 1711234739.0,
      "score": 10,
      "context": [
        {
          "id": "kw9da45",
          "author": "EllieAtBakerStreet",
          "body": "Fuck em. You are not a joke. Drs who laugh at you are awful. I take the kids flintstones gummy vitamins because they’re cheaper than adult gummy vitamins for me.",
          "created_utc": 1711233039.0
        }
      ]
    },
    {
      "id": "kw9ewzu",
      "author": "Furstname74727",
      "body": "Thank you! I take Haliborange Sugar Free Multivitamin Liquid (theres 2 versions, i take the one thats not for literal babies lol). Ive never been a fan of oranges but I've always loved the taste of it",
      "created_utc": 1711233687.0,
      "score": 12,
      "context": [
        {
          "id": "kw9drvi",
          "author": "booksncatsn",
          "body": "I'm glad you found one that tastes good! That's  so inappropriate for a Dr to talk like that. \n\nMay I ask what you take? I cant find a liquid one that my daughter likes. Thank you!",
          "created_utc": 1711233234.0
        }
      ]
    },
    {
      "id": "kw9sruk",
      "author": "booksncatsn",
      "body": "Ah it doesn't look like I can get that one in Canada. Thanks though!",
      "created_utc": 1711239255.0,
      "score": 7,
      "context": [
        {
          "id": "kw9drvi",
          "author": "booksncatsn",
          "body": "I'm glad you found one that tastes good! That's  so inappropriate for a Dr to talk like that. \n\nMay I ask what you take? I cant find a liquid one that my daughter likes. Thank you!",
          "created_utc": 1711233234.0
        }
      ]
    },
    {
      "id": "kwaa6jg",
      "author": "matramepapi",
      "body": "Honestly you would be justified in reporting this doctor for laughing in your face. Imagine how she treats other patients if she thinks an adult taking a liquid multi is “childish” or funny somehow. Some people can’t swallow pills, any doctor worth your time will know this.",
      "created_utc": 1711246521.0,
      "score": 8,
      "context": [
        {
          "id": "kwaa08k",
          "author": "matramepapi",
          "body": "Fuck that noise. I work at a health food store and almost every supplement we sell has a liquid and a gummy/chewable version. For ADULTS. I’ve seen hundreds of adults buy these products too and I have some as well. Don’t stop whatever works for you, it isn’t anybody else’s business to judge.",
          "created_utc": 1711246445.0
        }
      ]
    },
    {
      "id": "kwdudv4",
      "author": "Furstname74727",
      "body": "I'm so sorry your doctor said that to you :( I hope one day doctors learn to stop judging their patients (who theyre supposed to be helping feel good and comfortable) for simple stuff like this",
      "created_utc": 1711310049.0,
      "score": 2,
      "context": [
        {
          "id": "kwdj2pr",
          "author": "Ok-Werewolf-5320",
          "body": "im so sorry your doctor laughed at you thats not fair and not appropriate and i use kids vitamins because i have a feeding tube and need liquid vitamins and the kids ones i’ve always taken the kids liquid even before my feeding tube placement even i take kids benydral and kids Tylenol and kids Motrin because they don’t have liquid in adults and i need liquid of mostly everything so i used kids everything i had a doctor ask me why and i said ask my medical team they advised me and the doctor laughed at me and said wow didn’t know your body was like a child but i am sensitive to medication but children meds dont have the same effect there easier on my body.",
          "created_utc": 1711305999.0
        }
      ]
    },
    {
      "id": "kwc6x8q",
      "author": "Furstname74727",
      "body": "thank you, but the one i take it sufficient for adults. its labelled as being good \"for the whole family\" in the sense that both kids and adults can benefit from taking it",
      "created_utc": 1711288216.0,
      "score": 1,
      "context": [
        {
          "id": "kwal2of",
          "author": "dumbroad",
          "body": "she shouldnt have laughed at you, but she should have seriously explained that the vitamin isnt sufficient for adults",
          "created_utc": 1711251598.0
        }
      ]
    },
    {
      "id": "kw9lcyi",
      "author": "Ephoder",
      "body": "Bro I didn't know people even had such mental misconceptions vitamins \"meant\" for kids! That's really weird to be honest, I'm so surprised. Your doctor's a tool, report them to the hospital for misbehavior of conduct and rudeness, fire their ass, completely unprofessional behavior",
      "created_utc": 1711236278.0,
      "score": 22,
      "context": [
        {
          "id": "kw9da45",
          "author": "EllieAtBakerStreet",
          "body": "Fuck em. You are not a joke. Drs who laugh at you are awful. I take the kids flintstones gummy vitamins because they’re cheaper than adult gummy vitamins for me.",
          "created_utc": 1711233039.0
        },
        {
          "id": "kw9f1cb",
          "author": "Furstname74727",
          "body": "Thank you, I'm really glad to hear I'm not alone in taking \"kids\" vitamins",
          "created_utc": 1711233735.0
        }
      ]
    },
    {
      "id": "kwcptjz",
      "author": "LemonfishSoda",
      "body": "Necessity aside: Even if you didn't have food issues and just took them because you couldn't afford a balanced diet, or even if you could eat and afford everything but took the vitamins because you couldn't shop often and relied on durable food, or whatever other reason one might have:\n\nIt *still* would be fine for you to choose these vitamins over any \"more adult\" branded ones, and it *still* would be rude to laugh at you for doing so. \n\nIf you enjoy something and it doesn't harm anyone, people need to mind their darn business.",
      "created_utc": 1711295581.0,
      "score": 5,
      "context": [
        {
          "id": "kw9da45",
          "author": "EllieAtBakerStreet",
          "body": "Fuck em. You are not a joke. Drs who laugh at you are awful. I take the kids flintstones gummy vitamins because they’re cheaper than adult gummy vitamins for me.",
          "created_utc": 1711233039.0
        },
        {
          "id": "kw9f1cb",
          "author": "Furstname74727",
          "body": "Thank you, I'm really glad to hear I'm not alone in taking \"kids\" vitamins",
          "created_utc": 1711233735.0
        }
      ]
    },
    {
      "id": "kw9hfbu",
      "author": "CaraLara",
      "body": "Not at all, I take kids multi vit chewies too. Why do we have to grow up? What's the benefit? Vitamins are vitamins. What a boring, laugh less life the doctor must lead.",
      "created_utc": 1711234692.0,
      "score": 8,
      "context": [
        {
          "id": "kw9da45",
          "author": "EllieAtBakerStreet",
          "body": "Fuck em. You are not a joke. Drs who laugh at you are awful. I take the kids flintstones gummy vitamins because they’re cheaper than adult gummy vitamins for me.",
          "created_utc": 1711233039.0
        },
        {
          "id": "kw9f1cb",
          "author": "Furstname74727",
          "body": "Thank you, I'm really glad to hear I'm not alone in taking \"kids\" vitamins",
          "created_utc": 1711233735.0
        }
      ]
    },
    {
      "id": "kwhl3kj",
      "author": "ExcitingAide6095",
      "body": "You are not alone in taking vitamins aimed at children. I take them at nearly 40. Why? Because ARFID. Need I say more? You do what's best for you and accommodate yourself. Put a complaint in about the GP. ",
      "created_utc": 1711375975.0,
      "score": 3,
      "context": [
        {
          "id": "kw9da45",
          "author": "EllieAtBakerStreet",
          "body": "Fuck em. You are not a joke. Drs who laugh at you are awful. I take the kids flintstones gummy vitamins because they’re cheaper than adult gummy vitamins for me.",
          "created_utc": 1711233039.0
        },
        {
          "id": "kw9f1cb",
          "author": "Furstname74727",
          "body": "Thank you, I'm really glad to hear I'm not alone in taking \"kids\" vitamins",
          "created_utc": 1711233735.0
        }
      ]
    },
    {
      "id": "kwa4n7m",
      "author": "EllieAtBakerStreet",
      "body": "I figure that it’s better than nothing. And the two vitamins that I’m clinically deficient in I’m prescribed specific pills for anyway, so I view the gummies as just bonus vitamins.",
      "created_utc": 1711244136.0,
      "score": 10,
      "context": [
        {
          "id": "kw9da45",
          "author": "EllieAtBakerStreet",
          "body": "Fuck em. You are not a joke. Drs who laugh at you are awful. I take the kids flintstones gummy vitamins because they’re cheaper than adult gummy vitamins for me.",
          "created_utc": 1711233039.0
        },
        {
          "id": "kw9hjlr",
          "author": "solitudanrian",
          "body": "I don't see how a vitamin for kids would be sufficient enough for an adult?",
          "created_utc": 1711234739.0
        }
      ]
    },
    {
      "id": "kw9uc36",
      "author": "Furstname74727",
      "body": "Ah thats unfortunate, I wish you luck in finding one your daughter likes! :)",
      "created_utc": 1711239896.0,
      "score": 5,
      "context": [
        {
          "id": "kw9drvi",
          "author": "booksncatsn",
          "body": "I'm glad you found one that tastes good! That's  so inappropriate for a Dr to talk like that. \n\nMay I ask what you take? I cant find a liquid one that my daughter likes. Thank you!",
          "created_utc": 1711233234.0
        },
        {
          "id": "kw9sruk",
          "author": "booksncatsn",
          "body": "Ah it doesn't look like I can get that one in Canada. Thanks though!",
          "created_utc": 1711239255.0
        }
      ]
    },
    {
      "id": "kwdzi51",
      "author": "Ok-Werewolf-5320",
      "body": "exactly",
      "created_utc": 1711311880.0,
      "score": 1,
      "context": [
        {
          "id": "kwdj2pr",
          "author": "Ok-Werewolf-5320",
          "body": "im so sorry your doctor laughed at you thats not fair and not appropriate and i use kids vitamins because i have a feeding tube and need liquid vitamins and the kids ones i’ve always taken the kids liquid even before my feeding tube placement even i take kids benydral and kids Tylenol and kids Motrin because they don’t have liquid in adults and i need liquid of mostly everything so i used kids everything i had a doctor ask me why and i said ask my medical team they advised me and the doctor laughed at me and said wow didn’t know your body was like a child but i am sensitive to medication but children meds dont have the same effect there easier on my body.",
          "created_utc": 1711305999.0
        },
        {
          "id": "kwdudv4",
          "author": "Furstname74727",
          "body": "I'm so sorry your doctor said that to you :( I hope one day doctors learn to stop judging their patients (who theyre supposed to be helping feel good and comfortable) for simple stuff like this",
          "created_utc": 1711310049.0
        }
      ]
    },
    {
      "id": "kwc961d",
      "author": "dumbroad",
      "body": "oh nice, then your doctor is extra stupid",
      "created_utc": 1711289167.0,
      "score": 2,
      "context": [
        {
          "id": "kwal2of",
          "author": "dumbroad",
          "body": "she shouldnt have laughed at you, but she should have seriously explained that the vitamin isnt sufficient for adults",
          "created_utc": 1711251598.0
        },
        {
          "id": "kwc6x8q",
          "author": "Furstname74727",
          "body": "thank you, but the one i take it sufficient for adults. its labelled as being good \"for the whole family\" in the sense that both kids and adults can benefit from taking it",
          "created_utc": 1711288216.0
        }
      ]
    },
    {
      "id": "kw9vfqd",
      "author": "Vyce223",
      "body": "While generally there's not much difference, they are different. Different vitamins sometimes and I believe lower amounts too due to children being lower weight. Similar to how senior vitamins exist, they often add extra vitamins that seniors tend to be more lacking. \n\nI'd just give a general \"adult\" multivitamin a look for those who are taking a kids one and compare it see if it may benefit to take a second one.",
      "created_utc": 1711240342.0,
      "score": 15,
      "context": [
        {
          "id": "kw9da45",
          "author": "EllieAtBakerStreet",
          "body": "Fuck em. You are not a joke. Drs who laugh at you are awful. I take the kids flintstones gummy vitamins because they’re cheaper than adult gummy vitamins for me.",
          "created_utc": 1711233039.0
        },
        {
          "id": "kw9f1cb",
          "author": "Furstname74727",
          "body": "Thank you, I'm really glad to hear I'm not alone in taking \"kids\" vitamins",
          "created_utc": 1711233735.0
        },
        {
          "id": "kw9lcyi",
          "author": "Ephoder",
          "body": "Bro I didn't know people even had such mental misconceptions vitamins \"meant\" for kids! That's really weird to be honest, I'm so surprised. Your doctor's a tool, report them to the hospital for misbehavior of conduct and rudeness, fire their ass, completely unprofessional behavior",
          "created_utc": 1711236278.0
        }
      ]
    },
    {
      "id": "kx1e6v7",
      "author": "solitudanrian",
      "body": "If the things you're deficient in, you're getting a prescribed supplement for then I think it's okay. They do make adult gummies now that taste no different than regular gummy lollies. They've gotten a lot better with the taste in recent years.\n\nEither way, that doctor was an asshole for laughing rather than just asking what the reason was that you're not taking adult ones. The liquid is better than nothing and it's not like you're deficient in so many things that it's worrying.",
      "created_utc": 1711671273.0,
      "score": 1,
      "context": [
        {
          "id": "kw9da45",
          "author": "EllieAtBakerStreet",
          "body": "Fuck em. You are not a joke. Drs who laugh at you are awful. I take the kids flintstones gummy vitamins because they’re cheaper than adult gummy vitamins for me.",
          "created_utc": 1711233039.0
        },
        {
          "id": "kw9hjlr",
          "author": "solitudanrian",
          "body": "I don't see how a vitamin for kids would be sufficient enough for an adult?",
          "created_utc": 1711234739.0
        },
        {
          "id": "kwa4n7m",
          "author": "EllieAtBakerStreet",
          "body": "I figure that it’s better than nothing. And the two vitamins that I’m clinically deficient in I’m prescribed specific pills for anyway, so I view the gummies as just bonus vitamins.",
          "created_utc": 1711244136.0
        }
      ]
    }
  ]
}