{
  "id": "1bzbmvd",
  "subreddit": "ARFID",
  "author": "youARFIDwhatyoueat",
  "created_utc": 1712615477.0,
  "title": "Server got annoyed with me at a restaurant",
  "selftext": "So my partner and I were out of town this weekend to see a show. She wanted to try out this Mexican restaurant that was nearby to the venue, so we went in for a bite. We've been together a long time and she's well aware of my ARFID (and very understanding and supportive of it I might add), but she's also a foodie and my ARFID can often get in the way of that when we're out together. It was more of a problem at the beginning of our relationship, we've learned to find a balance on that these days. Anyway we planned ahead for this as is our usual plan when she wants to eat somewhere I can't, and we had stopped at a Pizza Hut beforehand so I could eat some breadsticks real quick. No problems there, we go to the Mexican restaurant and sit down to eat. That's when the fun starts.\n\nMy partner orders some empanadas, I just get a beer to prep for the show since I had already eaten. The server asks why I'm not eating and I say I ate before we came since we were just popping in quick before the show (which was true), she shakes her head a bit at that but is cool with it. At this point I should note the place wasn't full and we weren't preventing others from eating, so this wasn't a case of 'useless ARFID guy is wasting a space in my restaurant'. Anyways she comes back later to check in on our meal, my partner tells her she's loving it. The server says to me 'Have you at least tried it?', to which I say 'I actually can't, I have an eating disorder.'. She comes back with 'It's OK, it's halal!' which was hilarious on its own as something being halal has literally nothing to do with eating disorders, but when I tell her 'I still can't try it sorry' she shakes her head and loudly groans at me while giving me a look like I just took a shit on the table.\n\nIt wasn't a big deal at the end of the day and I didn't make a scene or anything, my partner finished her meal and we left with no further problems. I've definitely been treated a lot worse at restaurants before. And to be completely honest I'm very, very used to this happening to me. I've had probably over a hundred experiences just like this in my life at restaurants. But I figured I'd mention it to this subreddit as I'm sure so many of you have also had experiences like this, and it just goes to show how much further we still have to go on public education on this disorder. Just another day in the ARFID life!\n\nIf you've got any restaurant server horror stories (won't let you order off the kid's menu, offended that you're requesting the food made a particular way, that sort of stuff) feel free to share!",
  "url": "https://www.reddit.com/r/ARFID/comments/1bzbmvd/server_got_annoyed_with_me_at_a_restaurant/",
  "score": 108,
  "num_comments": 31,
  "comments": [
    {
      "id": "kyow8al",
      "author": "cj7695",
      "body": "I HATE when servers make comments about what I do or don’t order. Like why does it matter to you? I can understand if I’m making 30 changes to a dish, but if I ask for one thing off or don’t eat why is it any of their business why?",
      "created_utc": 1712618597.0,
      "score": 120,
      "context": []
    },
    {
      "id": "kyoygeq",
      "author": "Isadum",
      "body": "Might be a cultural thing I’m Mexican and unfortunately they feel it’s disrespectful to refuse to eat food. It’s made so many circumstances so uncomfortable and made me feel so guilty. Even tho my own family knows I have trouble eating they still pester me and give me dirty looks after all these years. I’m sorry this happened but I’m glad you were able to handle it so well. It helps give me courage to do the same after reading how you handled it. I’ve learned to just not care anymore.",
      "created_utc": 1712619471.0,
      "score": 41,
      "context": []
    },
    {
      "id": "kyp87dq",
      "author": "nomoreadminspls",
      "body": "At a wedding just getting plain bread, which they had plenty of, was like asking for a kidney.",
      "created_utc": 1712623262.0,
      "score": 33,
      "context": []
    },
    {
      "id": "kyq9a84",
      "author": "Damsel_IRL",
      "body": "I'm sorry that happened to you. What a rude person! \n\nOne time I ordered a piece of pie from a diner and it had optional ice cream that I declined, not even because of my ARFID but because I'm lactose intolerant, and the women would not stop badgering me that I should get ice cream on it and making rude comments. She was so rude! Kept expecting me to change my mind, even after I had eaten like half my slice! I never went back to that place and I never will. I can't remember if I told her why I didn't want it, but even if I didn't it's none of her business and not her place to try and talk me into eating something I clearly stated multiple times I didn't want. I've had waitresses be rude about not wanting onions or bell peppers too, but I'll never forget the ice cream pusher.",
      "created_utc": 1712639735.0,
      "score": 15,
      "context": []
    },
    {
      "id": "kyptqbi",
      "author": "ipushfatkiidz",
      "body": "I‘m sorry this happened OP. Some people are incredibly pushy and the fact that you even told her you have an eating disorder must already be uncomfortable.. \n\nI admit, I do had to laugh with her answer was „dont worry, its halal“ I‘m muslim and eat halal only so its like I have ARFID and the „halal disorder“ on top lol 😂",
      "created_utc": 1712631846.0,
      "score": 15,
      "context": []
    },
    {
      "id": "kyrwabf",
      "author": "BoubyWinky",
      "body": "I'm sorry I laugh so hard at the \"It's OK it's halal\" answer to \"I have an eating disorder\" .... \nBeing Muslim is not an eating disorder xD What the f*ck ?? :D",
      "created_utc": 1712673466.0,
      "score": 14,
      "context": []
    },
    {
      "id": "kyr64k1",
      "author": "Bankerlady10",
      "body": "There’s been times where they won’t allow me to order off the kid menu (even though I say it’s ok to charge me an adult meal price) so then I say there’s nothing else I’ll eat. They try and “call my bluff” by walking away but coming back later to check again. No… I’m not kidding, it was that grilled cheese or nothing. I’m not trying to be difficult or get a cheap meal, it’s literally my only option. There are times they are super accommodating and understanding. Then I wonder if they have someone with ARFID in their life.",
      "created_utc": 1712662355.0,
      "score": 13,
      "context": []
    },
    {
      "id": "kypibnt",
      "author": "Cut-Unique",
      "body": "That server should be fired. The fact that she assumes that someone who follows a halal diet has an eating disorder means that she either is ignorant or is a low-key racist.\n\nI'm sorry you had to go through that OP.",
      "created_utc": 1712627234.0,
      "score": 21,
      "context": []
    },
    {
      "id": "kyq5lnb",
      "author": "None",
      "body": "I always get nervous when going with people to a restaurant. Most places having mozzarella sticks is a God Send.",
      "created_utc": 1712637603.0,
      "score": 8,
      "context": []
    },
    {
      "id": "kyrf0px",
      "author": "LemonfishSoda",
      "body": "I'm not one to make things hard for people who try to do their job, but this is one instance where I think you should have asked for the manager. \n\nWhat anyone eats, or whether they eat at all, is none of the server's business as long as you're not breaking rules. You didn't try to bring in outside food, you didn't just occupy a table without ordering anything, you were fine. She needs to be less judgemental.",
      "created_utc": 1712666671.0,
      "score": 8,
      "context": []
    },
    {
      "id": "kyqnltd",
      "author": "Beginning_Beat_5289",
      "body": "im 14 and generally act and kinda look younger so normally i can do pretty good with kids meals, if i cant then i discuss with younger brothers about them getting a adult meal and i get there kids meal.\n\nI generally avoid eating out when possible because misophonia\n\ni have been judged by server/waiter at a restraint once where my extended family bassicaly hired a private room and i chose to sit on the floor in the corner near a window instead of at a table like they said that i really should make use of the tables and chairs and be social (like actualy told me) if it was about potential mess then they ignored my baby cousin who was legit having bits of food end up all on the floor",
      "created_utc": 1712649719.0,
      "score": 6,
      "context": []
    },
    {
      "id": "kyrwz33",
      "author": "BoubyWinky",
      "body": "I once got yelled at because I didn't see the \"Served with salad\" written in THE TINIEST LITTLEST MINI TYPO at the very bottom of the menu... And logically, I asked for another Fish and Chips without salad.... \n\nOh my God she humiliated me in front of my brother and all his friends for a sentence that was almost impossible to read !!!\nI was so shy I didn't say a word....",
      "created_utc": 1712673714.0,
      "score": 7,
      "context": []
    },
    {
      "id": "kys8pk6",
      "author": "Current-Necessary320",
      "body": "Recently I went out w my boyfriend to one of our favorite spots for a quick brunch before we had to drive to a concert that was in a city 2hrs away. My dietician and I have been working on exposures so I decided to try the chicken and waffles, as separately they’re both things I can enjoy but I have difficulty combining them. When I ordered I double checked with the waiter that everything listed (jam, syrup, fruit, etc) was on the side and he said it was. After waiting a while my dish comes out and everything he said was on the side was piled right on top of both the chicken and waffles 🫠 I tried to eat some of it but I nearly threw up and my boyfriend was ready to tell off the waiter on my behalf but we had to leave and I didn’t think it would be worth it (I’m already anxious and conflict avoidant) so we just left soon after but it really made me think differently abt one of our favorite spots :(",
      "created_utc": 1712677809.0,
      "score": 7,
      "context": []
    },
    {
      "id": "kyrh7wn",
      "author": "jacoofont",
      "body": "I completely understand. Once my friends and I went out to a fancy burger joint. None of the burgers were “normal” so I just asked for the kids burg that comes with cheese and ketchup. The rest were made of caribou and buffalo and all that. I’d like to try it maybe but I didn’t want to order something that I didn’t think I’d like. The server legit said “you’re not a very adventurous person are you?” I wanted to cry lol. Safe to say I didn’t leave a tip.",
      "created_utc": 1712667619.0,
      "score": 5,
      "context": []
    },
    {
      "id": "kyqiomr",
      "author": "Own_Librarian_6954",
      "body": "As a server with ARFID I’m so sorry this happened! Like others have said, maybe it’s a cultural thing. I personally never make people try food or order if they don’t want too. Very odd behaviour from the server especially after you are brave enough to mention that you have an eating disorder.",
      "created_utc": 1712646018.0,
      "score": 5,
      "context": []
    },
    {
      "id": "kysf6hz",
      "author": "bishyfishyriceball",
      "body": "I have a feeling that this situation is similar to some in retail. It is usually their bosses pushing them to ask people to order stuff or try something (so they’ll order it). Some restaurants treat their waiters like half salespeople with trying to recommend stuff to customers or specials to get people to spend more money. They want to make as much money as possible. I know retail workers hate having to do it so I would bet that the server was only saying it because their boss was asking them to get you to order something.",
      "created_utc": 1712680052.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kysiru3",
      "author": "Affectionate_Fly8319",
      "body": "I’m sorry. People don’t always understand eating disorders especially ARFID. Don’t let that discourage you from going out and enjoying the company of others.",
      "created_utc": 1712681277.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kz7m7ss",
      "author": "None",
      "body": "Yeah I went to a local Italian restaurant with family this is years ago. So of course they all order the chicken parm and stuff like that. This was my first time there so to be safe I ordered chicken tenders and chocolate milk. Well damn not only did my brother and sister make a big freaking deal about it but the waitress was a complete bitch about it as well “ THATS what your ordering?” So yeah you are not alone in being treated like crap for arfid. I hope that waitress was happy when I took the tip off the table that my family left😉",
      "created_utc": 1712916124.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kysvpd6",
      "author": "Prettynoises",
      "body": "I would like to mention that even if the restaurant isn't missing out on money, that your server is. Servers get sat in a rotation, and if you don't eat it doesn't matter they still won't get sat until their next rotation. Your server will assume that you also won't be tipping either, bc a tip is usually a percentage of the meal price. \n\nNot to say that she was justified in being rude, but you were also being rude by going to a restaurant and not eating. It's not your fault that restaurants don't pay their servers a living wage, but that's the deal with tipped workers. \n\nI also don't think you should have to buy food you won't eat, or try to force yourself to eat things either, but maybe next time let the server know you'll still be tipping. It won't make people magically understand your eating disorder, but more often than not your server is probably just mad about missed wages than caring about what you eat, although maybe that was just me, idk.",
      "created_utc": 1712685655.0,
      "score": -3,
      "context": []
    },
    {
      "id": "kyoz1pe",
      "author": "youARFIDwhatyoueat",
      "body": "It's usually saving them ingredients anyways - shouldn't they be happy? I'm not asking for the entire meal to be redone, I just don't want bacon or mushrooms or chives or whatever else in/on it.\n\nIt's even worse when you ask them something about a menu item like 'this just mac and cheese right, they won't put onions or chives or something on top?' and they say yes, then you get the meal and the chef has put little chives on it for presentation purposes or something. They even had onion mixed INTO a mac and cheese once (it did not say that on the menu). That is very, very problematic for someone with ARFID.",
      "created_utc": 1712619704.0,
      "score": 46,
      "context": [
        {
          "id": "kyow8al",
          "author": "cj7695",
          "body": "I HATE when servers make comments about what I do or don’t order. Like why does it matter to you? I can understand if I’m making 30 changes to a dish, but if I ask for one thing off or don’t eat why is it any of their business why?",
          "created_utc": 1712618597.0
        }
      ]
    },
    {
      "id": "kypppan",
      "author": "bloodreina_",
      "body": "Imo I’m a server and normally if I’d comment on somebody’s meal it’s normally a joke to make some conversation. \nIdk if this helps at all!\n\nEdit: this obviously isn’t the case in the post, but I thought a servers perspective might help, since afrid is an anxiety inducing condition, I thought a servers pov may help alleviate some fears/feelings of judgement.",
      "created_utc": 1712630187.0,
      "score": -6,
      "context": [
        {
          "id": "kyow8al",
          "author": "cj7695",
          "body": "I HATE when servers make comments about what I do or don’t order. Like why does it matter to you? I can understand if I’m making 30 changes to a dish, but if I ask for one thing off or don’t eat why is it any of their business why?",
          "created_utc": 1712618597.0
        }
      ]
    },
    {
      "id": "kyp03yy",
      "author": "youARFIDwhatyoueat",
      "body": "It's possible! I should say though I've had this happen for multiple cultures through the years so I'm not sure it's a culturally specific thing. I find it happens more in restaurants where the chefs/employees are particularly proud of the food, or if they have a great reputation. Someone like me comes along and it's almost like 'what, you're too good for the food here?'\n\nWhich suffice to say is not my intention, but it's hard to explain that when you're asking them to change the food. Some places I simply won't eat, because I know they'll treat me as lesser than if I try to and I just don't want that feeling. I'd rather spend my money elsewhere.",
      "created_utc": 1712620121.0,
      "score": 17,
      "context": [
        {
          "id": "kyoygeq",
          "author": "Isadum",
          "body": "Might be a cultural thing I’m Mexican and unfortunately they feel it’s disrespectful to refuse to eat food. It’s made so many circumstances so uncomfortable and made me feel so guilty. Even tho my own family knows I have trouble eating they still pester me and give me dirty looks after all these years. I’m sorry this happened but I’m glad you were able to handle it so well. It helps give me courage to do the same after reading how you handled it. I’ve learned to just not care anymore.",
          "created_utc": 1712619471.0
        }
      ]
    },
    {
      "id": "kyubzs0",
      "author": "DrG2390",
      "body": "My late fiancé hated ice cream and I was the only one who understood him on that. Everyone kept telling him how good it was as if that would change his mind. Just like me and chocolate.",
      "created_utc": 1712703843.0,
      "score": 3,
      "context": [
        {
          "id": "kyq9a84",
          "author": "Damsel_IRL",
          "body": "I'm sorry that happened to you. What a rude person! \n\nOne time I ordered a piece of pie from a diner and it had optional ice cream that I declined, not even because of my ARFID but because I'm lactose intolerant, and the women would not stop badgering me that I should get ice cream on it and making rude comments. She was so rude! Kept expecting me to change my mind, even after I had eaten like half my slice! I never went back to that place and I never will. I can't remember if I told her why I didn't want it, but even if I didn't it's none of her business and not her place to try and talk me into eating something I clearly stated multiple times I didn't want. I've had waitresses be rude about not wanting onions or bell peppers too, but I'll never forget the ice cream pusher.",
          "created_utc": 1712639735.0
        }
      ]
    },
    {
      "id": "kyuvlpd",
      "author": "SarahL1990",
      "body": "Why would fish & chips be served with salad? Is this a standard thing?",
      "created_utc": 1712711468.0,
      "score": 1,
      "context": [
        {
          "id": "kyrwz33",
          "author": "BoubyWinky",
          "body": "I once got yelled at because I didn't see the \"Served with salad\" written in THE TINIEST LITTLEST MINI TYPO at the very bottom of the menu... And logically, I asked for another Fish and Chips without salad.... \n\nOh my God she humiliated me in front of my brother and all his friends for a sentence that was almost impossible to read !!!\nI was so shy I didn't say a word....",
          "created_utc": 1712673714.0
        }
      ]
    },
    {
      "id": "kypgzby",
      "author": "crypticcos",
      "body": "People: “Ugh, why can’t you just *pick off* the (thing you don’t like) instead of asking for it to be held off on?”\n\nARFIDer: *picks thing off*\n\nPeople: “OMG you are so wasteful! And privileged! Y’know someone HOMELESS wouldn’t have wasted food like that…”",
      "created_utc": 1712626701.0,
      "score": 38,
      "context": [
        {
          "id": "kyow8al",
          "author": "cj7695",
          "body": "I HATE when servers make comments about what I do or don’t order. Like why does it matter to you? I can understand if I’m making 30 changes to a dish, but if I ask for one thing off or don’t eat why is it any of their business why?",
          "created_utc": 1712618597.0
        },
        {
          "id": "kyoz1pe",
          "author": "youARFIDwhatyoueat",
          "body": "It's usually saving them ingredients anyways - shouldn't they be happy? I'm not asking for the entire meal to be redone, I just don't want bacon or mushrooms or chives or whatever else in/on it.\n\nIt's even worse when you ask them something about a menu item like 'this just mac and cheese right, they won't put onions or chives or something on top?' and they say yes, then you get the meal and the chef has put little chives on it for presentation purposes or something. They even had onion mixed INTO a mac and cheese once (it did not say that on the menu). That is very, very problematic for someone with ARFID.",
          "created_utc": 1712619704.0
        }
      ]
    },
    {
      "id": "kyp7kyg",
      "author": "cj7695",
      "body": "Or even just someone with an allergy! Like imagine you were really allergic to onions and they didn’t even mention it on the menu.",
      "created_utc": 1712623026.0,
      "score": 23,
      "context": [
        {
          "id": "kyow8al",
          "author": "cj7695",
          "body": "I HATE when servers make comments about what I do or don’t order. Like why does it matter to you? I can understand if I’m making 30 changes to a dish, but if I ask for one thing off or don’t eat why is it any of their business why?",
          "created_utc": 1712618597.0
        },
        {
          "id": "kyoz1pe",
          "author": "youARFIDwhatyoueat",
          "body": "It's usually saving them ingredients anyways - shouldn't they be happy? I'm not asking for the entire meal to be redone, I just don't want bacon or mushrooms or chives or whatever else in/on it.\n\nIt's even worse when you ask them something about a menu item like 'this just mac and cheese right, they won't put onions or chives or something on top?' and they say yes, then you get the meal and the chef has put little chives on it for presentation purposes or something. They even had onion mixed INTO a mac and cheese once (it did not say that on the menu). That is very, very problematic for someone with ARFID.",
          "created_utc": 1712619704.0
        }
      ]
    },
    {
      "id": "kyvlq15",
      "author": "calmingthechaos",
      "body": "Omg the onions in the mac and cheese. Who *does* that? Longhorn, apparently.",
      "created_utc": 1712722882.0,
      "score": 3,
      "context": [
        {
          "id": "kyow8al",
          "author": "cj7695",
          "body": "I HATE when servers make comments about what I do or don’t order. Like why does it matter to you? I can understand if I’m making 30 changes to a dish, but if I ask for one thing off or don’t eat why is it any of their business why?",
          "created_utc": 1712618597.0
        },
        {
          "id": "kyoz1pe",
          "author": "youARFIDwhatyoueat",
          "body": "It's usually saving them ingredients anyways - shouldn't they be happy? I'm not asking for the entire meal to be redone, I just don't want bacon or mushrooms or chives or whatever else in/on it.\n\nIt's even worse when you ask them something about a menu item like 'this just mac and cheese right, they won't put onions or chives or something on top?' and they say yes, then you get the meal and the chef has put little chives on it for presentation purposes or something. They even had onion mixed INTO a mac and cheese once (it did not say that on the menu). That is very, very problematic for someone with ARFID.",
          "created_utc": 1712619704.0
        }
      ]
    },
    {
      "id": "kyq46wi",
      "author": "aroaceautistic",
      "body": "Bro we don’t need y’all making fun of us while we’re out to dinner",
      "created_utc": 1712636837.0,
      "score": 30,
      "context": [
        {
          "id": "kyow8al",
          "author": "cj7695",
          "body": "I HATE when servers make comments about what I do or don’t order. Like why does it matter to you? I can understand if I’m making 30 changes to a dish, but if I ask for one thing off or don’t eat why is it any of their business why?",
          "created_utc": 1712618597.0
        },
        {
          "id": "kypppan",
          "author": "bloodreina_",
          "body": "Imo I’m a server and normally if I’d comment on somebody’s meal it’s normally a joke to make some conversation. \nIdk if this helps at all!\n\nEdit: this obviously isn’t the case in the post, but I thought a servers perspective might help, since afrid is an anxiety inducing condition, I thought a servers pov may help alleviate some fears/feelings of judgement.",
          "created_utc": 1712630187.0
        }
      ]
    },
    {
      "id": "kyqifgg",
      "author": "Perchance09",
      "body": "Why on earth would any server do that?",
      "created_utc": 1712645836.0,
      "score": 8,
      "context": [
        {
          "id": "kyow8al",
          "author": "cj7695",
          "body": "I HATE when servers make comments about what I do or don’t order. Like why does it matter to you? I can understand if I’m making 30 changes to a dish, but if I ask for one thing off or don’t eat why is it any of their business why?",
          "created_utc": 1712618597.0
        },
        {
          "id": "kypppan",
          "author": "bloodreina_",
          "body": "Imo I’m a server and normally if I’d comment on somebody’s meal it’s normally a joke to make some conversation. \nIdk if this helps at all!\n\nEdit: this obviously isn’t the case in the post, but I thought a servers perspective might help, since afrid is an anxiety inducing condition, I thought a servers pov may help alleviate some fears/feelings of judgement.",
          "created_utc": 1712630187.0
        }
      ]
    },
    {
      "id": "kyw3py4",
      "author": "BoubyWinky",
      "body": "In France they have this obsession with putting salad (which absolutely DISGUST ME) everywhere .... But at least it's written in a normal Typo in the menu and you can ask not to have it ! When you can see it ...",
      "created_utc": 1712734672.0,
      "score": 1,
      "context": [
        {
          "id": "kyrwz33",
          "author": "BoubyWinky",
          "body": "I once got yelled at because I didn't see the \"Served with salad\" written in THE TINIEST LITTLEST MINI TYPO at the very bottom of the menu... And logically, I asked for another Fish and Chips without salad.... \n\nOh my God she humiliated me in front of my brother and all his friends for a sentence that was almost impossible to read !!!\nI was so shy I didn't say a word....",
          "created_utc": 1712673714.0
        },
        {
          "id": "kyuvlpd",
          "author": "SarahL1990",
          "body": "Why would fish & chips be served with salad? Is this a standard thing?",
          "created_utc": 1712711468.0
        }
      ]
    },
    {
      "id": "kyq5m24",
      "author": "bloodreina_",
      "body": "https://preview.redd.it/wydv8llwudtc1.jpeg?width=453&format=pjpg&auto=webp&s=e824fe193d421243662c848e748227cf2583971a",
      "created_utc": 1712637609.0,
      "score": 3,
      "context": [
        {
          "id": "kyow8al",
          "author": "cj7695",
          "body": "I HATE when servers make comments about what I do or don’t order. Like why does it matter to you? I can understand if I’m making 30 changes to a dish, but if I ask for one thing off or don’t eat why is it any of their business why?",
          "created_utc": 1712618597.0
        },
        {
          "id": "kypppan",
          "author": "bloodreina_",
          "body": "Imo I’m a server and normally if I’d comment on somebody’s meal it’s normally a joke to make some conversation. \nIdk if this helps at all!\n\nEdit: this obviously isn’t the case in the post, but I thought a servers perspective might help, since afrid is an anxiety inducing condition, I thought a servers pov may help alleviate some fears/feelings of judgement.",
          "created_utc": 1712630187.0
        },
        {
          "id": "kyq46wi",
          "author": "aroaceautistic",
          "body": "Bro we don’t need y’all making fun of us while we’re out to dinner",
          "created_utc": 1712636837.0
        }
      ]
    }
  ]
}