{
  "id": "1bzf3bi",
  "subreddit": "ARFID",
  "author": "menta00000",
  "created_utc": 1712624393.0,
  "title": "I was tricked into eating something gross and now I don't want to eat anymore",
  "selftext": "Someone gave me a quesadilla. I thought it tasted gross, and two bites in, they told me it was sheep brain. I immediately went to wash my mouth. I'm hungry, but I feel so grossed out I don't want anything. I just wanted to share because it was awful.",
  "url": "https://www.reddit.com/r/ARFID/comments/1bzf3bi/i_was_tricked_into_eating_something_gross_and_now/",
  "score": 98,
  "num_comments": 17,
  "comments": [
    {
      "id": "kypd1c7",
      "author": "chunkeymunkeyandrunt",
      "body": "What the actual fuck? I hope this person is not someone you associate with ever again. Like I would literally barf if this happened to me. \n\nLike first of all who the fuck just casually has SHEEP BRAIN and cooks with it regularly? Even in cultures where the brain is used in cooking, it’s usually a delicacy (aka not a common dish, but something ‘fancy’ or special occasion). \n\nI am so sorry this happened to you. Take some time to process it, and hopefully you’ll be able to nibble on some safe food soon.",
      "created_utc": 1712625142.0,
      "score": 121,
      "context": []
    },
    {
      "id": "kypm5f0",
      "author": "Beginning_Comfort176",
      "body": "hi OP i’m so sorry this happened to you! it must have been traumatic to be eating something you believed to be “safe” only for it to be something else. i wonder if anyone here will have any specific advice for how to move forward after a traumatic food experience. \n\ni hope you can eat something soon, maybe try watching one of your favourite comfort shows and distracting yourself and making it less about the act of eating / swallowing and more about something you’re doing automatically.\n\ndeep breaths and big hugs x",
      "created_utc": 1712628757.0,
      "score": 43,
      "context": []
    },
    {
      "id": "kyq5rn2",
      "author": "thebeautifulduckling",
      "body": "I don’t know for sure because I’m a life-long ARFID-er, but I’m pretty sure this would be disgusting and violating as fuck even for a regular person who wasn’t expecting to unknowingly consume SHEEPS BRAIN…gross. I’m so sorry you had to go through that :(",
      "created_utc": 1712637693.0,
      "score": 36,
      "context": []
    },
    {
      "id": "kypq1gd",
      "author": "JoJoShoo",
      "body": "Looking forward to reading the update in Nuclear Revenge.   Seriously, I thought it was going to read something like cottage cheese but damn!!!",
      "created_utc": 1712630323.0,
      "score": 23,
      "context": []
    },
    {
      "id": "kypluht",
      "author": "jols0543",
      "body": "i’m so sorry they did that to you, that’s not okay at all",
      "created_utc": 1712628634.0,
      "score": 8,
      "context": []
    },
    {
      "id": "kyptf7h",
      "author": "imisstherxge",
      "body": "i would actually die and cut them out of my life immediately",
      "created_utc": 1712631716.0,
      "score": 8,
      "context": []
    },
    {
      "id": "kyrge6g",
      "author": "3ThatUserNameIsTaken",
      "body": "why the F would someone do that to you? let alone anyone?? that is sick, and im sorry you had to experience that",
      "created_utc": 1712667267.0,
      "score": 8,
      "context": []
    },
    {
      "id": "kyqmfgb",
      "author": "jeannesloaf",
      "body": "People who do stuff like this are the absolute worst. I’m so sorry babe. Make sure to drink some water if you can and maybe think about some of your favorite foods and your favorite times eating them and it could make you want to eat them.",
      "created_utc": 1712648823.0,
      "score": 6,
      "context": []
    },
    {
      "id": "kys0jrw",
      "author": "None",
      "body": "That person is not your friend",
      "created_utc": 1712674978.0,
      "score": 6,
      "context": []
    },
    {
      "id": "kyt0m0g",
      "author": "Kelekona",
      "body": "That would be rude AF even if they didn't know you had an eating disorder.",
      "created_utc": 1712687320.0,
      "score": 4,
      "context": []
    },
    {
      "id": "kyto22i",
      "author": "Ru_rehtaeh",
      "body": "What the actual fuck? No. Cut that person out. That’s not even funny even if you didn’t have arfid.",
      "created_utc": 1712695201.0,
      "score": 5,
      "context": []
    },
    {
      "id": "kytvftv",
      "author": "Reverse2057",
      "body": "I'm sorry this happened to you. \n\nI had something similar happen to me in high school. Someone fed me mystery meat and cheese on crackers and after I ate it told me it was cow's brain. Jokes on them, I didn't flinch since it just tasted like soft hamburger and looked like grilled chicken lol.",
      "created_utc": 1712697712.0,
      "score": 4,
      "context": []
    },
    {
      "id": "kys7dl5",
      "author": "sharkprincefishstick",
      "body": "I’m emetophobic ARFID so most “weird” foods don’t really freak me out, but Jesus Christ.. That feels like something you shouldn’t just spring on someone. \n\nI’m sorry that happened to you, OP. That’s really twisted and I hope you feel better soon.",
      "created_utc": 1712677351.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kyt9udk",
      "author": "Lunanair",
      "body": "I'm someone who doesn't have ARFID (it showed up on my feed), and I find this gross. I don't like any part of sheep, but even if I did I would be so upset if no one told me that there was sheep brain inside the quesadilla, not to say being tricked into eating it! I hope that this person doesn't bother you again.",
      "created_utc": 1712690456.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kyt0ehs",
      "author": "Kelekona",
      "body": "I'm not ARFID because I can eat just about anything generally recognised as food, (I might even willingly try a bite of sheep-brain quesdilla.)  \n\nTricking someone into eating something like that is rude AF.  Some people get grossed out by bread having lard in it, (they're silly but it's not right to argue with them,) and these days there are enough belief-based food restrictions that it should be normalized to tell people about anything unexpected.",
      "created_utc": 1712687249.0,
      "score": 7,
      "context": [
        {
          "id": "kyq5rn2",
          "author": "thebeautifulduckling",
          "body": "I don’t know for sure because I’m a life-long ARFID-er, but I’m pretty sure this would be disgusting and violating as fuck even for a regular person who wasn’t expecting to unknowingly consume SHEEPS BRAIN…gross. I’m so sorry you had to go through that :(",
          "created_utc": 1712637693.0
        }
      ]
    },
    {
      "id": "kytf4lv",
      "author": "purplechunkymonkey",
      "body": "I'm not ARFID and find that offensive as fuck. You don't mess with peoples food.",
      "created_utc": 1712692224.0,
      "score": 6,
      "context": [
        {
          "id": "kyq5rn2",
          "author": "thebeautifulduckling",
          "body": "I don’t know for sure because I’m a life-long ARFID-er, but I’m pretty sure this would be disgusting and violating as fuck even for a regular person who wasn’t expecting to unknowingly consume SHEEPS BRAIN…gross. I’m so sorry you had to go through that :(",
          "created_utc": 1712637693.0
        }
      ]
    },
    {
      "id": "kyua5fg",
      "author": "menta00000",
      "body": "This one tasted like rotten egg",
      "created_utc": 1712703136.0,
      "score": 2,
      "context": [
        {
          "id": "kytvftv",
          "author": "Reverse2057",
          "body": "I'm sorry this happened to you. \n\nI had something similar happen to me in high school. Someone fed me mystery meat and cheese on crackers and after I ate it told me it was cow's brain. Jokes on them, I didn't flinch since it just tasted like soft hamburger and looked like grilled chicken lol.",
          "created_utc": 1712697712.0
        }
      ]
    }
  ]
}