{
  "id": "1d9pr4v",
  "subreddit": "ARFID",
  "author": "Old-Locksmith-6537",
  "created_utc": 1717699757.0,
  "title": "Anyone not eat fruits and veg?",
  "selftext": "I can eat anything except those. I absolutely hate and gag everytime I eat them. I’m a 21 year old dude btw.\n\nBut I ABSOLUTELY  need fiber in my diet , especially, because if not I have horrible bathroom, skin problems, and depression. So for my replacement of fruits and veg I take Metamucil or any psyllium husk powder (make sure I hit 25g+ fiber so 3 tbsp) and a multivitamin, and a magnesium supplement because why not, and have never felt better. I also exercise a lot.\n\nThe best part is, I feel like it actually helps as a replacement and I can be CONSISTENT with it. \n\nAnyone do the same?\n",
  "url": "https://www.reddit.com/r/ARFID/comments/1d9pr4v/anyone_not_eat_fruits_and_veg/",
  "score": 95,
  "num_comments": 51,
  "comments": [
    {
      "id": "l7exlla",
      "author": "catonthewindow",
      "body": "I don’t eat any meat and the closest thing to vegetables i eat is chips and guacamole. and my only fruits are bananas and grapes. honestly I should start taking vitamins",
      "created_utc": 1717700192.0,
      "score": 26,
      "context": []
    },
    {
      "id": "l7fm6cg",
      "author": "purpleelephant77",
      "body": "Do you like applesauce? There are some apple/fruit sauce pouches that have some veggies in them — not a ton but also that means you can’t taste them. If the taste of fruit isn’t an issue you could make a milkshake and add some frozen strawberries or raspberries — that will eliminate texture problems, I use a full cup of frozen fruit in the shakes I make and it’s still very much milkshake texture, not smoothie.",
      "created_utc": 1717708311.0,
      "score": 16,
      "context": []
    },
    {
      "id": "l7hiv95",
      "author": "ratedgforgenitals",
      "body": "Yes!! I'm glad I'm not the only one. This is absolutely how my ARFID represents. I cannot eat fruits and vegetables. It's a texture problem for me - if I bite into a fruit or vegetable I completely gag - sometimes vomit - and lose my appetite. \n\nLuckily it's just a texture issue and not a taste one. I can puree vegetables and eat them no problem, as long as it's completely pureed to paste. But the second I can feel that vegetable texture, it's game over.",
      "created_utc": 1717737307.0,
      "score": 16,
      "context": []
    },
    {
      "id": "l7flljl",
      "author": "Owlmaescia",
      "body": "I'm a 36F and my trigger foods are fruit and vegetables. I'm working with my dietitian to try new vegetables but I need to boost my fiber intake. I currently don't take anything for it.",
      "created_utc": 1717708111.0,
      "score": 13,
      "context": []
    },
    {
      "id": "l7fc7ba",
      "author": "Livdenn",
      "body": "Fruit and veg are really hard for me as well, but I find if I can sit down and try to eat it consistently and mindfully over a few weeks or months I can get to the point where I can actually eat and sometimes even enjoy it. I can only really work on one or two foods at a time, but I try to at least bite into everything with no pressure to actually consume it.",
      "created_utc": 1717704965.0,
      "score": 8,
      "context": []
    },
    {
      "id": "l7ja4fv",
      "author": "Less-Percentage-7421",
      "body": "I feel like I’ve always been afraid of fruits and veggies and have always felt so wrong and shameful about it. The validation I feel from reading all your comments makes me feel so relieved. No one food (from the ground or otherwise) will make or break how your body functions. Our bodies are incredibly adaptive and can turn many things we want to eat into what it actually needs to function. We can eat what we want and still be well nourished. And we can be well nourished without eating food from the ground like we are living in the 1800s.",
      "created_utc": 1717771464.0,
      "score": 7,
      "context": []
    },
    {
      "id": "l7fhdyk",
      "author": "WarmPlant",
      "body": "I’m a 21f and can’t remember ever having eaten fruits or vegetables to completion and rarely gotten close to them. Closest I come in drinking OJ sometimes to prevent scurvy. Might need to hop on those vitamins you’re talking about, especially now I’m at the gym. Thanks for the tip",
      "created_utc": 1717706676.0,
      "score": 7,
      "context": []
    },
    {
      "id": "l7g7rxv",
      "author": "spring-sapling",
      "body": "Fruit I'm okay with but veg has been a constant fear food since childhood. I'm 23 and can only eat very small potions of carrot, sweetcorn and petite pois peas(cannot eat the bigger garden peas). I don't take any supplements or vitamins but honestly I probably should",
      "created_utc": 1717716454.0,
      "score": 6,
      "context": []
    },
    {
      "id": "l7gvlvw",
      "author": "emayuyu",
      "body": "21 as well and fruits and veggies are my biggest enemy!! i feel seen😭",
      "created_utc": 1717726063.0,
      "score": 5,
      "context": []
    },
    {
      "id": "l7fbtu7",
      "author": "Hachem24",
      "body": "I eat almost no vegetables and haven't for as long as I can remember (22 yrs old). Also don't eat a lot of other stuff on top of that but I do eat fruits. Sometimes I take [this](https://www.amazon.com/Natures-Way-Garden-Veggies-Vcaps/dp/B0009ETA80/ref=sr_1_5?crid=13S9F46OKLMH4&dib=eyJ2IjoiMSJ9.ckxdVOIB7upzV3Kpf5J56NdqpO1JuU9hpVTGaHffXwF7hB2Jml7LFpd_AcIPqVZKq8lSQBLWsrwHeafJe5CZBXvAcJZxApp6cha5kXLnWeZx66e_D4GRxICEwJlvV_Lb5L8HAagNRqR7k7d4BdPResTEdYD0-n8Q2Go8Fia8QQdBSpltOyBP6tjkc2oKtZ6Yc-uMZfRXFMwg-plNyzNuYK1LYejS5V0chZVe30abjLNKN1xRcn43x2BowiuZXP0Av8yKXzTIpl3629twF0JymIKpYPodK4K9pRbQs6BDuWk.LgLEUCrjhbM5jfuqpB_Is6pDxTa_Ki4cX8wG_EvpR0U&dib_tag=se&keywords=vegetable+supplement&qid=1717704765&sprefix=vegetable+supplement%2Caps%2C165&sr=8-5), though I honestly haven't been consistent enough with it to tell if it hasn't any effect.",
      "created_utc": 1717704843.0,
      "score": 5,
      "context": []
    },
    {
      "id": "l7g6xga",
      "author": "SamTheDystopianRat",
      "body": "do you like popcorn or cereal? i hate fruits and veg, had terrible fiber issues but now I'm a certified popcorn addict and they've been solved",
      "created_utc": 1717716117.0,
      "score": 4,
      "context": []
    },
    {
      "id": "l7gsst6",
      "author": "JurneeMaddock",
      "body": "I've been having some \"tummy troubles\" lately too. I can't eat fruits or vegetables because of the textures and they always taste bitter to me, so that's probably why I have my bathroom issues...",
      "created_utc": 1717724895.0,
      "score": 4,
      "context": []
    },
    {
      "id": "l7hnqy0",
      "author": "Unlucky-Photograph69",
      "body": "I'm quite similar. The only plant type foods I can have are potatoes and rice. Everything else, including all fruits and vegetables, are all trigger foods. I basically live off of processed carbs. I can have some other things like dairy and eggs, but not much else :(",
      "created_utc": 1717740238.0,
      "score": 4,
      "context": []
    },
    {
      "id": "l7fq2cn",
      "author": "crackalac",
      "body": "I love fruits but veggies are the worst.",
      "created_utc": 1717709688.0,
      "score": 3,
      "context": []
    },
    {
      "id": "l7hjhlf",
      "author": "SunshinerSONE9",
      "body": "Same here, 26 y.o. and still struggling with veggies and fruit, although I will eat avocados. I also like salsas if they’re super blended up. \n\nI’m working with a dietician who handles eating disorders currently, and my goal is eventually to try again through exposure therapy. ARFID just gets harder the older you get tbh",
      "created_utc": 1717737668.0,
      "score": 3,
      "context": []
    },
    {
      "id": "l7gw4ss",
      "author": "Calliope420",
      "body": "I can't do it, they are never consistent! Sometimes, when I feel the scurvy kicking in, I throw a bunch of veggies in a pot and boil them. Them I blend the hell out of them until its basically just soup. Eat with bread.",
      "created_utc": 1717726272.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l7h533f",
      "author": "ibelieveinaliens111",
      "body": "I absolutely hate fruits and veggies, too. I enjoy some fruit flavors (at least the ones that are candied or heavily processed, like ketchup or strawberry candy) but the real deal is off the table. I’m graduating high school tomorrow and I haven’t had a pure fruit or vegetable, of my own will, since I was 4.\n\nI can’t give much advice, but you’re not alone. I’d consider trying fruit gummies as an alternative to avoid the textural part of fruits, but they’re not a long term substitute.",
      "created_utc": 1717730126.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l7he1gi",
      "author": "sharkprincefishstick",
      "body": "Baby food! If not the jar/pouches, then try the yogurt drops or waffles, or cookies/biscuits made with vegetables.\n\nGranola is high in fiber, and tastes great!",
      "created_utc": 1717734615.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l7hmrhe",
      "author": "madeleine59",
      "body": "smoothi",
      "created_utc": 1717739629.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l7ic8i4",
      "author": "bullfrogftw",
      "body": "52/M   \nHaven't been able to keep most vegetables in their whole cooked or raw form since I was old enough to fight back.     \nFruit for the most part is no problem, I can handle most fruits(I just don't because of the sugars),     \nmelons are an issue and some berries.    \nAnything cruciferous(broccoli, Brussel sprouts) is not staying in me, root vegetables(yams, sweet potatoes, etc.) also a no-go zone, marrow(cucumber, squash, etc.)  is a miss, nightshades(tomatoes, peppers) I can't eat raw, but roasted pureed, smoked, and cooked in any many of condiment or sauce and I'm down with it.    \nCorn, potatoes, mushrooms, to a lesser extent peas and carrots are OK,    \nAvocados I will tolerate in sushi and a good guac, most leafy salad type veggies(lettuce, kale, spinach) are fine, probably because I have them with cheese, croutons, dressing, bacon bits in a unhealthy salad    \nTry as I might even a mouthful will initiate an immediate violent rejection, I have supplemented for many years with supplements and vitamins, hopefully it will be enough     \nWeirdly I love radishes, onions make my lips burn(but I like em) and I live on enough garlic to kill a colony of vampires",
      "created_utc": 1717757059.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l7ios4h",
      "author": "freshlycuttoenails",
      "body": "Haven't been diagnosed so I don't take any supplement or vitamins in place of fruits and veggies but yeah I also don't eat any fruits or veggies the only vegetable I eat is potato and it's gotta be fried in a specific pan in specific oil and made by my grandma lmaoo also chips and specifically McDonald's fries",
      "created_utc": 1717763371.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l7ip2qf",
      "author": "Independent_Desk8457",
      "body": "I’m 22 and don’t eat fruit or veg either. I also gag as soon as i try. I have an ileostomy, a lot of fruit and veg cause blockages so I have a reason to avoid them more now lol",
      "created_utc": 1717763500.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l7mz8jr",
      "author": "anewdawnanewme",
      "body": "I'm not diagnosed yet, but I am confident I will be. I am fine with fruit (other than bananas) but cannot handle veg (besides corn and potatoes) I think they all taste like wet dirt, and will begin gagging after a couple forced bites. Some safe foods can also be contaminated by touch (like chicken strips or other fried items placed on lettuce leaves)  \n\nHowever onion, celery or carrots blended into soups are fine. I also don't do spicy or beans because they are too close to veg.\n\npea soup is ok if blended but I won't eat peas any other way and I  pick peas and carrots out of pot pies.🤷‍♀️",
      "created_utc": 1717824139.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l7pduxj",
      "author": "is_bench",
      "body": "I’m so glad I’m not alone. I can’t stand the texture of fruits and veg and I’m a mess so I might try this",
      "created_utc": 1717869371.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l7fecch",
      "author": "Grungslinger",
      "body": "I don't eat fruits at all, and only eat a limited amount of vegetables only when cooked. That's honestly an improvement than how it used to be, so I'm not too mad at myself for that. \n\nWeirdly, every time I do blood work, it comes out fine (other than slight anemia, but that's unrelated). So I don't take any multivitamins.",
      "created_utc": 1717705660.0,
      "score": 3,
      "context": []
    },
    {
      "id": "l7fimh3",
      "author": "gunswithkids",
      "body": "i love the terra kai juce supplement for this!!",
      "created_utc": 1717707090.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l7fp3ia",
      "author": "Most_Experience4494",
      "body": "I don’t eat any fruits or vegetables really besides chips - plain with only salt & pepper. I can eat an apple cut up into lil chunks but I barely eat them",
      "created_utc": 1717709342.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l7fypng",
      "author": "Nearby-Ad5666",
      "body": "They recommend this for anyone who isn't able to consume a good amount of fiber.",
      "created_utc": 1717712880.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l7gc4vh",
      "author": "houinky",
      "body": "I cant eat any fruit whatsoever which i find really hard because i lack alot of nutrients because of this... i can eat a few types of veg but they have to be from the same place etc... i can eat brocoli, peas, edamame and potato",
      "created_utc": 1717718176.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l7gz3ny",
      "author": "taylorscorpse",
      "body": "I’ve found that spinach hides itself, so I’ve been putting it in foods like pizza and pasta with lots of cheese and sauce to disguise the taste.",
      "created_utc": 1717727503.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l7hh2ot",
      "author": "Clean-Chipmunk2934",
      "body": "i eat vegetables but no fruit. i find ice pops and juice helpful though not consistently i need to be better abt it",
      "created_utc": 1717736282.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l7hvvrl",
      "author": "JoChiCat",
      "body": "I was always told that bran is a great source of fibre, I can bake it into biscuits and the like very easily.",
      "created_utc": 1717745614.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l7hxw57",
      "author": "johnny-Low-Five",
      "body": "Get a nice\nJuicer! Changed my life",
      "created_utc": 1717747049.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l7i6obv",
      "author": "sphericalcreature",
      "body": "You can get things like fibre brownies that are really good!  oats do too so if you can eat them in any capacity that would help you out",
      "created_utc": 1717753429.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l7ihv2f",
      "author": "glorae",
      "body": "I use the fiber gummies from amazon, honestly. I love a lot of fruits and an ok amount of veggies, but due to... Stuff... It's hard for me to get enough. My GI wanted me to do metamucil, insurance wouldn't cover it so i tried to do the psyllium husk stuff and i legit *couldn't even get myself to open the bag* bc that texture is one of my fear things.\n\nGummies? Easy, tasty, reliable taste *&* texture? Sign me the hell up.",
      "created_utc": 1717760119.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l7j92r7",
      "author": "quacksmeow",
      "body": "i'm a 20 y/o female, and i can't eat and fruits or veggies. i can, however, eat apples, watermelon, and i like fruit flavored things. I don't eat those fruits often though. Trying to get into supplements for not eating well, but it's been a hard mental struggle my whole life with arfid. You're definitely not alone :p",
      "created_utc": 1717771105.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l7ji97q",
      "author": "None",
      "body": "I do like a good handful of fruits and veg but I don't always feel like eating them, and certain fresh fruits go bad so quickly it makes me not want to buy them, because what if I don't want to eat them and then they go bad? I have a gross thing to throw out and I wasted money. \n\nStrawberry and raspberry go bad so quick😞",
      "created_utc": 1717774243.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l7kaxeu",
      "author": "Huge-Whereas-8803",
      "body": "I hateeeee vegetables but I actually do enjoy fruits. I should probably take something to supplement the veggies",
      "created_utc": 1717783835.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l7liti6",
      "author": "Manospondylus_gigas",
      "body": "Oh shit, I never eat fruits or veg and have all those problems especially horrible eczema on my hands",
      "created_utc": 1717799555.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l7ljfw5",
      "author": "Manospondylus_gigas",
      "body": "After looking up psyllium husk it seems to be quite expensive, like a 200g bag is a tenner which would only be 8 days worth if you take 25g a day - how do you get it affordably?",
      "created_utc": 1717799807.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n1njxhc",
      "author": "sonicbro1991",
      "body": "I'll literally eat almost anything, but fruits and veggies, i absolutely cannot. It's both a taste and texture issue for mr",
      "created_utc": 1751817857.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l7lf7th",
      "author": "bsrc_rrt",
      "body": "Same age and same dislike of fruit and veg here. What is your dietitian doing to help? \n\nAs for fiber and veg/fruit I an taking fiberwise the orange flavor and mixing it with Kalia greens powder, watermelon flavor. Together tastes pretty good. I mix them because slamming two 12 Oz, less than desirable drinks a day seems daunting. Together I can cough them in a few minutes and be done.",
      "created_utc": 1717798115.0,
      "score": 3,
      "context": [
        {
          "id": "l7flljl",
          "author": "Owlmaescia",
          "body": "I'm a 36F and my trigger foods are fruit and vegetables. I'm working with my dietitian to try new vegetables but I need to boost my fiber intake. I currently don't take anything for it.",
          "created_utc": 1717708111.0
        }
      ]
    },
    {
      "id": "l7wcs0f",
      "author": "Jaceywac3y",
      "body": "I feel the same way reading this stuff… I’ve always been shamed by ppl I told or who found I I don’t eat veggies and fruits, its so nice not to be shamed",
      "created_utc": 1717981987.0,
      "score": 2,
      "context": [
        {
          "id": "l7ja4fv",
          "author": "Less-Percentage-7421",
          "body": "I feel like I’ve always been afraid of fruits and veggies and have always felt so wrong and shameful about it. The validation I feel from reading all your comments makes me feel so relieved. No one food (from the ground or otherwise) will make or break how your body functions. Our bodies are incredibly adaptive and can turn many things we want to eat into what it actually needs to function. We can eat what we want and still be well nourished. And we can be well nourished without eating food from the ground like we are living in the 1800s.",
          "created_utc": 1717771464.0
        }
      ]
    },
    {
      "id": "l7p22g2",
      "author": "VettedBot",
      "body": "Hi, I’m Vetted AI Bot! I researched the **'Nature's Way Veggie Powder Blend 900mg'** and I thought you might find the following analysis helpful.\n\n**Users liked:**\n* Convenient way to get daily veggies (backed by 3 comments)\n* Easy to consume with no aftertaste (backed by 2 comments)\n* Helps improve overall well-being (backed by 3 comments)\n\n**Users disliked:**\n* No noticeable health benefits (backed by 6 comments)\n* Inconsistent product description (backed by 3 comments)\n* Unpleasant taste and smell (backed by 2 comments)\n\n\nIf you'd like to **summon me to ask about a product**, just make a post with its link and tag me, [like in this example.](https://www.reddit.com/r/tablets/comments/1444zdn/comment/kerx8h0/) \n\nThis message was generated by a (very smart) bot. If you found it helpful, let us know with an upvote and a “good bot!” reply and please feel free to provide feedback on how it can be improved.\n\n *Powered by* [*vetted.ai*](https://vetted.ai/?utm\\_source=reddit&utm\\_medium=comment&utm\\_campaign=bot)",
      "created_utc": 1717864901.0,
      "score": 1,
      "context": [
        {
          "id": "l7fbtu7",
          "author": "Hachem24",
          "body": "I eat almost no vegetables and haven't for as long as I can remember (22 yrs old). Also don't eat a lot of other stuff on top of that but I do eat fruits. Sometimes I take [this](https://www.amazon.com/Natures-Way-Garden-Veggies-Vcaps/dp/B0009ETA80/ref=sr_1_5?crid=13S9F46OKLMH4&dib=eyJ2IjoiMSJ9.ckxdVOIB7upzV3Kpf5J56NdqpO1JuU9hpVTGaHffXwF7hB2Jml7LFpd_AcIPqVZKq8lSQBLWsrwHeafJe5CZBXvAcJZxApp6cha5kXLnWeZx66e_D4GRxICEwJlvV_Lb5L8HAagNRqR7k7d4BdPResTEdYD0-n8Q2Go8Fia8QQdBSpltOyBP6tjkc2oKtZ6Yc-uMZfRXFMwg-plNyzNuYK1LYejS5V0chZVe30abjLNKN1xRcn43x2BowiuZXP0Av8yKXzTIpl3629twF0JymIKpYPodK4K9pRbQs6BDuWk.LgLEUCrjhbM5jfuqpB_Is6pDxTa_Ki4cX8wG_EvpR0U&dib_tag=se&keywords=vegetable+supplement&qid=1717704765&sprefix=vegetable+supplement%2Caps%2C165&sr=8-5), though I honestly haven't been consistent enough with it to tell if it hasn't any effect.",
          "created_utc": 1717704843.0
        }
      ]
    },
    {
      "id": "l7v99s9",
      "author": "VettedBot",
      "body": "Hi, I’m Vetted AI Bot! I researched the **Nature's Way Veggie Powder Blend 900mg** and I thought you might find the following analysis helpful.\n\n**Users liked:**\n* Convenient way to get daily veggies (backed by 3 comments)\n* Easy to consume with no aftertaste (backed by 2 comments)\n* Helps improve overall well-being (backed by 3 comments)\n\n**Users disliked:**\n* No noticeable health benefits (backed by 6 comments)\n* Inconsistent product description (backed by 3 comments)\n* Unpleasant taste and smell (backed by 2 comments)\n\n\nIf you'd like to **summon me to ask about a product**, just make a post with its link and tag me, [like in this example.](https://www.reddit.com/r/tablets/comments/1444zdn/comment/kerx8h0/) \n\nThis message was generated by a (very smart) bot. If you found it helpful, let us know with an upvote and a “good bot!” reply and please feel free to provide feedback on how it can be improved.\n\n *Powered by* [*vetted.ai*](https://vetted.ai/?utm\\_source=reddit&utm\\_medium=comment&utm\\_campaign=bot)",
      "created_utc": 1717966067.0,
      "score": 1,
      "context": [
        {
          "id": "l7fbtu7",
          "author": "Hachem24",
          "body": "I eat almost no vegetables and haven't for as long as I can remember (22 yrs old). Also don't eat a lot of other stuff on top of that but I do eat fruits. Sometimes I take [this](https://www.amazon.com/Natures-Way-Garden-Veggies-Vcaps/dp/B0009ETA80/ref=sr_1_5?crid=13S9F46OKLMH4&dib=eyJ2IjoiMSJ9.ckxdVOIB7upzV3Kpf5J56NdqpO1JuU9hpVTGaHffXwF7hB2Jml7LFpd_AcIPqVZKq8lSQBLWsrwHeafJe5CZBXvAcJZxApp6cha5kXLnWeZx66e_D4GRxICEwJlvV_Lb5L8HAagNRqR7k7d4BdPResTEdYD0-n8Q2Go8Fia8QQdBSpltOyBP6tjkc2oKtZ6Yc-uMZfRXFMwg-plNyzNuYK1LYejS5V0chZVe30abjLNKN1xRcn43x2BowiuZXP0Av8yKXzTIpl3629twF0JymIKpYPodK4K9pRbQs6BDuWk.LgLEUCrjhbM5jfuqpB_Is6pDxTa_Ki4cX8wG_EvpR0U&dib_tag=se&keywords=vegetable+supplement&qid=1717704765&sprefix=vegetable+supplement%2Caps%2C165&sr=8-5), though I honestly haven't been consistent enough with it to tell if it hasn't any effect.",
          "created_utc": 1717704843.0
        }
      ]
    },
    {
      "id": "l8eaol8",
      "author": "VettedBot",
      "body": "Hi, I’m Vetted AI Bot! I researched the **'Nature's Way Veggie Powder Blend 900mg per 2 Capsule Serving'** and I thought you might find the following analysis helpful.\n\n**Users liked:**\n* Convenient way to get daily veggies (backed by 3 comments)\n* Easy to consume with no aftertaste (backed by 2 comments)\n* Helps improve overall well-being (backed by 3 comments)\n\n**Users disliked:**\n* No noticeable health benefits (backed by 6 comments)\n* Inconsistent product description (backed by 3 comments)\n* Unpleasant taste and smell (backed by 2 comments)\n\n\nIf you'd like to **summon me to ask about a product**, just make a post with its link and tag me, [like in this example.](https://www.reddit.com/r/tablets/comments/1444zdn/comment/kerx8h0/) \n\nThis message was generated by a (very smart) bot. If you found it helpful, let us know with an upvote and a “good bot!” reply and please feel free to provide feedback on how it can be improved.\n\n *Powered by* [*vetted.ai*](https://vetted.ai/?utm\\_source=reddit&utm\\_medium=comment&utm\\_campaign=bot)",
      "created_utc": 1718266857.0,
      "score": 1,
      "context": [
        {
          "id": "l7fbtu7",
          "author": "Hachem24",
          "body": "I eat almost no vegetables and haven't for as long as I can remember (22 yrs old). Also don't eat a lot of other stuff on top of that but I do eat fruits. Sometimes I take [this](https://www.amazon.com/Natures-Way-Garden-Veggies-Vcaps/dp/B0009ETA80/ref=sr_1_5?crid=13S9F46OKLMH4&dib=eyJ2IjoiMSJ9.ckxdVOIB7upzV3Kpf5J56NdqpO1JuU9hpVTGaHffXwF7hB2Jml7LFpd_AcIPqVZKq8lSQBLWsrwHeafJe5CZBXvAcJZxApp6cha5kXLnWeZx66e_D4GRxICEwJlvV_Lb5L8HAagNRqR7k7d4BdPResTEdYD0-n8Q2Go8Fia8QQdBSpltOyBP6tjkc2oKtZ6Yc-uMZfRXFMwg-plNyzNuYK1LYejS5V0chZVe30abjLNKN1xRcn43x2BowiuZXP0Av8yKXzTIpl3629twF0JymIKpYPodK4K9pRbQs6BDuWk.LgLEUCrjhbM5jfuqpB_Is6pDxTa_Ki4cX8wG_EvpR0U&dib_tag=se&keywords=vegetable+supplement&qid=1717704765&sprefix=vegetable+supplement%2Caps%2C165&sr=8-5), though I honestly haven't been consistent enough with it to tell if it hasn't any effect.",
          "created_utc": 1717704843.0
        }
      ]
    },
    {
      "id": "n2cyl94",
      "author": "Thunder_breeze",
      "body": "Omg SAME I can only handle apples that don’t have that god awful weird sandy texture, I would rather eat a soap bar than eat one of those types of apples",
      "created_utc": 1752153850.0,
      "score": 1,
      "context": [
        {
          "id": "n1njxhc",
          "author": "sonicbro1991",
          "body": "I'll literally eat almost anything, but fruits and veggies, i absolutely cannot. It's both a taste and texture issue for mr",
          "created_utc": 1751817857.0
        }
      ]
    },
    {
      "id": "l7lgq1d",
      "author": "Owlmaescia",
      "body": "My dietitian is doing exposure therapy with me. I've tried broccoli, green beans, carrots, sweet potatoes and we're currently working on peas. I need to practice eating them but I haven't beside trying them once or a few times. \n\nI have to check those out. I need fiber but I haven't found a good source. I take multivitamin and vitamin D by Megafood. However I don't take anything for a vegetable/fruit replacement.",
      "created_utc": 1717798718.0,
      "score": 1,
      "context": [
        {
          "id": "l7flljl",
          "author": "Owlmaescia",
          "body": "I'm a 36F and my trigger foods are fruit and vegetables. I'm working with my dietitian to try new vegetables but I need to boost my fiber intake. I currently don't take anything for it.",
          "created_utc": 1717708111.0
        },
        {
          "id": "l7lf7th",
          "author": "bsrc_rrt",
          "body": "Same age and same dislike of fruit and veg here. What is your dietitian doing to help? \n\nAs for fiber and veg/fruit I an taking fiberwise the orange flavor and mixing it with Kalia greens powder, watermelon flavor. Together tastes pretty good. I mix them because slamming two 12 Oz, less than desirable drinks a day seems daunting. Together I can cough them in a few minutes and be done.",
          "created_utc": 1717798115.0
        }
      ]
    },
    {
      "id": "l7ltt0l",
      "author": "bsrc_rrt",
      "body": "Good luck! I hope it all goes well. I just can't handle temhe feel and sound when veggies or fruit crunch in my mouth. It's terrible. I hope it works well for you!",
      "created_utc": 1717804016.0,
      "score": 2,
      "context": [
        {
          "id": "l7flljl",
          "author": "Owlmaescia",
          "body": "I'm a 36F and my trigger foods are fruit and vegetables. I'm working with my dietitian to try new vegetables but I need to boost my fiber intake. I currently don't take anything for it.",
          "created_utc": 1717708111.0
        },
        {
          "id": "l7lf7th",
          "author": "bsrc_rrt",
          "body": "Same age and same dislike of fruit and veg here. What is your dietitian doing to help? \n\nAs for fiber and veg/fruit I an taking fiberwise the orange flavor and mixing it with Kalia greens powder, watermelon flavor. Together tastes pretty good. I mix them because slamming two 12 Oz, less than desirable drinks a day seems daunting. Together I can cough them in a few minutes and be done.",
          "created_utc": 1717798115.0
        },
        {
          "id": "l7lgq1d",
          "author": "Owlmaescia",
          "body": "My dietitian is doing exposure therapy with me. I've tried broccoli, green beans, carrots, sweet potatoes and we're currently working on peas. I need to practice eating them but I haven't beside trying them once or a few times. \n\nI have to check those out. I need fiber but I haven't found a good source. I take multivitamin and vitamin D by Megafood. However I don't take anything for a vegetable/fruit replacement.",
          "created_utc": 1717798718.0
        }
      ]
    },
    {
      "id": "l7lviih",
      "author": "Owlmaescia",
      "body": "Thank you. Trust me, I have my gag moments when trying them as the taste and texture can be overwhelming but I have some coping skills and I found that when they're slightly overcooked that help a lot getting through those moments. It's not easy but I'm working on it. I wish you well on your journey too!",
      "created_utc": 1717804734.0,
      "score": 2,
      "context": [
        {
          "id": "l7flljl",
          "author": "Owlmaescia",
          "body": "I'm a 36F and my trigger foods are fruit and vegetables. I'm working with my dietitian to try new vegetables but I need to boost my fiber intake. I currently don't take anything for it.",
          "created_utc": 1717708111.0
        },
        {
          "id": "l7lf7th",
          "author": "bsrc_rrt",
          "body": "Same age and same dislike of fruit and veg here. What is your dietitian doing to help? \n\nAs for fiber and veg/fruit I an taking fiberwise the orange flavor and mixing it with Kalia greens powder, watermelon flavor. Together tastes pretty good. I mix them because slamming two 12 Oz, less than desirable drinks a day seems daunting. Together I can cough them in a few minutes and be done.",
          "created_utc": 1717798115.0
        },
        {
          "id": "l7lgq1d",
          "author": "Owlmaescia",
          "body": "My dietitian is doing exposure therapy with me. I've tried broccoli, green beans, carrots, sweet potatoes and we're currently working on peas. I need to practice eating them but I haven't beside trying them once or a few times. \n\nI have to check those out. I need fiber but I haven't found a good source. I take multivitamin and vitamin D by Megafood. However I don't take anything for a vegetable/fruit replacement.",
          "created_utc": 1717798718.0
        },
        {
          "id": "l7ltt0l",
          "author": "bsrc_rrt",
          "body": "Good luck! I hope it all goes well. I just can't handle temhe feel and sound when veggies or fruit crunch in my mouth. It's terrible. I hope it works well for you!",
          "created_utc": 1717804016.0
        }
      ]
    }
  ]
}