{
  "id": "1dai73t",
  "subreddit": "ARFID",
  "author": "astrostar2",
  "created_utc": 1717785389.0,
  "title": "Anyone else can’t handle condiments or dressings?",
  "selftext": "I cannot stand ketchup, mayonnaise, mustard, ranch, bbq sauce, ranch, etc. \nI can eat tomato sauce but that’s literally it. Everything else makes me gag. Anyone else have this problem? My family gets mad at me for being “too picky” when they have to make my burgers or salads plain.\n",
  "url": "https://www.reddit.com/r/ARFID/comments/1dai73t/anyone_else_cant_handle_condiments_or_dressings/",
  "score": 99,
  "num_comments": 47,
  "comments": [
    {
      "id": "l7kkd8w",
      "author": "chunkeymunkeyandrunt",
      "body": "I’ve never understood the complaint of making food with less ingredients. It’s _less work_. All they have to do is hand you a bun and the burger. Done. For a salad, just set aside a serving of lettuce before adding the dressing. People really be acting like we’re expecting them to grow and harvest a whole ass plant just for us, not just take 5 seconds to set some aside. \n\nBut also, you’re capable enough to be assembling these things yourself so their complaint is even less valid!! Literally _all_ they have to do is say ‘Hey OP, come get your plate before we add the dressing please!’ It’s **not that hard** 🥲 \n\nPersonally I can handle most condiments but I prefer to be able to put them on myself, so I can control the ratio and not have a soggy mess!! Blech!",
      "created_utc": 1717787020.0,
      "score": 52,
      "context": []
    },
    {
      "id": "l7kgv77",
      "author": "OG1999x",
      "body": "Here! Too much flavor. Too much going on.",
      "created_utc": 1717785826.0,
      "score": 18,
      "context": []
    },
    {
      "id": "l7khuh7",
      "author": "Rare_Version6127",
      "body": "Yes! Ive never been able to handle any condiments or dressings. Im too scared to eat burgers and salads around people lmao. I forced myself to eat condiments on a hot dog once, because a friend had made it for me and I was embarrassed and didnt want to turn it down. I ended up throwing it all up anyways😅 i think the only sauces i can tolerate personally are tomato sauce and gravy, no clue why",
      "created_utc": 1717786158.0,
      "score": 16,
      "context": []
    },
    {
      "id": "l7l0h5q",
      "author": "troparow",
      "body": "I can't handle ANY sauce",
      "created_utc": 1717792590.0,
      "score": 16,
      "context": []
    },
    {
      "id": "l7l2oao",
      "author": "baasheepgreat",
      "body": "Absolutely. One of my biggest aversions.",
      "created_utc": 1717793356.0,
      "score": 14,
      "context": []
    },
    {
      "id": "l7kreiq",
      "author": "bubbleurry",
      "body": "i hate it too! i just can't stand the smell, texture or color of any sauce. my worst nightmare is when they put this on top of food without asking, especially on fries, like why would you do that? 😭😭😭",
      "created_utc": 1717789438.0,
      "score": 13,
      "context": []
    },
    {
      "id": "l7l43y3",
      "author": "tobeasloth",
      "body": "I really struggle with ‘wet’ and saucy foods! Why do I want something soggy in my mouth? The only condiment I would have is ketchup and that is the tiniest amount and I put it on my food in a very particular way.",
      "created_utc": 1717793857.0,
      "score": 13,
      "context": []
    },
    {
      "id": "l7ku7ap",
      "author": "Fit-Cauliflower-9229",
      "body": "Oh I’m the opposite!\n\nI love these and use them to drown thing I moderately like.\n\nI’m very picky want it comes to taste, so lemon and others kind of sauce help me make somes foods more familiar.",
      "created_utc": 1717790404.0,
      "score": 12,
      "context": []
    },
    {
      "id": "l7lb1jq",
      "author": "apizzamx",
      "body": "i dont like them, not because of the flavour or whatever, but because they are usually a different temperature to the food i am eating. if im eating hot fries im not dipping them into cold ketchup (i also hate the taste of ketchup anyways). also.. often get upset about the idea of my dry food getting wet. i don’t mind some sauces on my burger as long as it is not touching the bun (bc wet bread is a huge fear food)",
      "created_utc": 1717796458.0,
      "score": 8,
      "context": []
    },
    {
      "id": "l7m30dg",
      "author": "Tay_Tay1997",
      "body": "I can't stand condiments, they make me gag too",
      "created_utc": 1717807995.0,
      "score": 5,
      "context": []
    },
    {
      "id": "l7l45pe",
      "author": "BatFace",
      "body": "I've never liked condiments. My husband came up with the term \"a memory of mayo\" for the few times I want it on my sandwich.",
      "created_utc": 1717793874.0,
      "score": 5,
      "context": []
    },
    {
      "id": "l7l7kkb",
      "author": "jols0543",
      "body": "no sauce at all for me most of the time",
      "created_utc": 1717795101.0,
      "score": 4,
      "context": []
    },
    {
      "id": "l7lifni",
      "author": "Manospondylus_gigas",
      "body": "I hateee sauces and condiments they ruin things",
      "created_utc": 1717799402.0,
      "score": 4,
      "context": []
    },
    {
      "id": "l7lpe34",
      "author": "turtleluver69",
      "body": "yes same here! i think it’s a texture thing for me, most things i like crispy and adding condiments/ sauces changes that. I will eat salad dressing but only lightly because i cant stand the sogginess when there is too much. That took me a while thought i used to only eat my salads with nothing on top!",
      "created_utc": 1717802208.0,
      "score": 4,
      "context": []
    },
    {
      "id": "l7kht95",
      "author": "Salt_Worldliness7976",
      "body": "Same here! I only like marinara and mayo on sandwiches, but not everything",
      "created_utc": 1717786147.0,
      "score": 3,
      "context": []
    },
    {
      "id": "l7kjpt7",
      "author": "TashaT50",
      "body": "I can handle a little bit of bbq sauce on a burger but that’s only since my 30s. I can do a few brands of Italian salad dressing and occasionally handmade balsamic vinegar dressing on salad. Otherwise I use salt on tomatoes and cucumbers. My salads are fairly plain: tomatoes, skinned cucumbers, iceberg lettuce (starter to tolerate romaine occasionally), grated carrots, I do like crushed tortilla chips, and grated cheese in salad as well as sour cream LOL. No mayo, ketchup, mayonnaise, mustard, ranch on anything ever. Tomato sauce belongs on pasta or pizza or for dipping fried mozzarella sticks, or bread sticks in. I do enjoy some olive oil and garlic/herb dipping combos for rolls & soft bread sticks.",
      "created_utc": 1717786796.0,
      "score": 3,
      "context": []
    },
    {
      "id": "l7kvx6i",
      "author": "Emergency-Cookie-290",
      "body": "I eat tomato sauce on pasta but other than that it makes me cry even thinking about eating sauce or condiments",
      "created_utc": 1717790997.0,
      "score": 3,
      "context": []
    },
    {
      "id": "l7lqy4i",
      "author": "Ginger_Cat_Ventures",
      "body": "In the opposite. To get myself to eat a food I’ll have a ton of condiments because I view food as a vehicle for sauce 😂. It’s interesting how different our food preferences can be but I don’t think you are strange at all!",
      "created_utc": 1717802841.0,
      "score": 3,
      "context": []
    },
    {
      "id": "l7qrvdc",
      "author": "halfeatencakeslice",
      "body": "ME OH MY GOD 😭😭 I have always hated condiments. When I was a kid even touching a ketchup bottle would make me cry I’m deadass too 🥲",
      "created_utc": 1717889438.0,
      "score": 3,
      "context": []
    },
    {
      "id": "l7l1ct2",
      "author": "slowly-rotting-dying",
      "body": "oh absolutely. especially sour or bitter ones and especially if they're runny D: gods i cant stand runny or liquidy toppings",
      "created_utc": 1717792897.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l7l4kpl",
      "author": "crown-jewel",
      "body": "Yep. I am known amongst friends/family/the guy at my favorite lunch place that I don’t want sauce. Sauce/dips/dressing all freak me out and nothing terrifies me more than a precarious honey mustard container on my plate when I order chicken strips at a restaurant 😅\n\nI like sauce on pasta and will eat it on pizza (though prefer light sauce), but that’s about it.",
      "created_utc": 1717794019.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l7l70o6",
      "author": "Viener-Schnitzel",
      "body": "Literally cannot eat even a spec of any condiment or dressing. The vast majority of the time I use olive oil as a replacement.",
      "created_utc": 1717794898.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l7lqpte",
      "author": "None",
      "body": "Yeah, I'm the exact same with condaments and dressings, always eating things plain as possible. I'm still baffled by Ketchup, as I love Tomato/Spegetti sauce, except on Pizza. I can't eat Pizza with a Tomato sauce base. Shrugs.",
      "created_utc": 1717802746.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l7lwc48",
      "author": "anonymous-musician",
      "body": "Marinara is the only condiment I actually like, if zi had to zi could probably choke down ketchup, but everything else is a big fat nope from me. Unless you count dipping French fries in a milkshake, I do surprisingly like that",
      "created_utc": 1717805082.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l7m24wd",
      "author": "lily_fairy",
      "body": "yes omg im so glad this sub exists so i don't feel insane. i can't do any of the ones you listed and also don't like tomato sauce. they're the hardest foods for me to watch other people eat or even just be around. i can handle salad dressing if it's not too much but that's pretty much it.",
      "created_utc": 1717807606.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l7mdnvj",
      "author": "None",
      "body": "I ONLY like ranch on a select few things but every other sauce/condiment is a huge no. My family has gotten used to it but I always feel awkward ordering sandwiches dry cause I’m so judged.",
      "created_utc": 1717812788.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l7mhdy8",
      "author": "claravoyance",
      "body": "I'm okay with ketchup, salsa, and BBQ sauce, but that's about it — I despise creamy condiments like ranch, mayo, sour cream etc. 🤢",
      "created_utc": 1717814533.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l7mvk5m",
      "author": "Complete-One-5520",
      "body": "Yes. Goo is not food.",
      "created_utc": 1717821933.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l7mzjgh",
      "author": "theoneandonlyjan",
      "body": "Out of everything you listed, BBQ sauce is the only one I eat (and I love it), but I grew up in the south so that’s kind of a requirement!",
      "created_utc": 1717824326.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l7n111r",
      "author": "Infamous_Ad_7864",
      "body": "I can only handle specific sauce sometimes on very specific foods. Pizza with ranch, fries with ketchup, chicken nuggets get barbeque. Noodles with sauce I can handle, but as soon as it gets even a bit cold,,, eugh. Salad is a nightmare for me, especially dressing. I'd rather just have the ingredients individually and make little wraps so I can controk exactly what I'm eating",
      "created_utc": 1717825254.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l7naqtc",
      "author": "thatsnuckinfutz",
      "body": "id die if i didnt have bbq sauce or hot sauce...that's actually what gets me to eat somethin lol\n\ni hate ranch and ketchup tho so i get it",
      "created_utc": 1717831824.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l7ng4c6",
      "author": "None",
      "body": "I can't handle them either. There is just too much going on. The most I can handle is some salt and vinegar on my chips dipped into some curry sauce. But I can't stand anything like a burger, I just get the buns, at least it's something to eat, and McDonalds is usually pretty good at toasting them perfectly before giving them to me.",
      "created_utc": 1717835769.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l7nr806",
      "author": "BMoreBeowulf",
      "body": "I’m on the opposite end actually. I use a ton of condiments, usually to help drown out the taste of food I only moderately like/enjoy the taste of. \n\nI’ve actually been working on trying salads a bit recently. I hate the texture but I’ve been putting Italian dressing on and it has made it more tolerable. Not great by any stretch, but it’s something.",
      "created_utc": 1717843886.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l7nyuj7",
      "author": "skorletun",
      "body": "I love condiments except on salads. Salad texture is already very varied. I don't need to add liquid too!!!!",
      "created_utc": 1717848417.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l7oimun",
      "author": "None",
      "body": "Not me however I just wish your parents didn't get mad. It isn't just wrong, but counterproductive as well.",
      "created_utc": 1717857477.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l7oj5ni",
      "author": "NoNefariousness2995",
      "body": "Yes me too something in my brain just cant handle a liquid being savoury!",
      "created_utc": 1717857686.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l7pozdi",
      "author": "RavenLunatic512",
      "body": "Yes, and apparently justified too. The nutritionist told me to avoid things with vinegar for my migraines, which includes most condiments.",
      "created_utc": 1717873660.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l7tv7hx",
      "author": "Patanew1945",
      "body": "Me too if a burger comes w ketchup on it i have to have someone else wipe it off, if it comws w mayonnaise i will not eat it at all and give it to someone else",
      "created_utc": 1717948389.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mbp1l45",
      "author": "julienorthlancs",
      "body": "I hate going to a food place, and every item on there is some burger with 5 billion toppings and condiments and a million textures, I can't stand it!",
      "created_utc": 1739037769.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l7kmny1",
      "author": "BirdsNeedNames",
      "body": "yep! i hate condiments. sorry i don't want to eat wet french fries, lol. (also, i like things to have one uniform texture/flavor when possible and condiments ruin that.)\n\n\nalthough, i don't mind sweet condiments usually (maple syrup, whipped cream, chocolate sauce, frosting, etc.) but i guess most people wouldn't count those as \"condiments\" per se. i think it's because i'm much less picky with sweet foods and desserts (i have no idea why though).\n\n\nalso, your family is being ridiculous. you're asking them to do *less work.* also, with burgers, don't most people do the condiments themselves to suit their individual tastes (i don't eat burgers so i wouldn't know)? when my friends get burgers this is how they do it: everyone gets their own burger and then person A puts a shitton of ketchup on theirs, person B just puts a little bit, person C puts every single condiment known to man, person D puts nothing, et cetera. it takes five seconds to set aside a plain burger or plain salad. not hard at all. i just wanted to reassure you that you're not asking too much and they're the ones being ridiculous.",
      "created_utc": 1717787807.0,
      "score": 3,
      "context": []
    },
    {
      "id": "l7kkjod",
      "author": "chunkeymunkeyandrunt",
      "body": "I literally washed and cleaned a hot dog once because it had mustard on it 😭 the bun was not salvageable but I was so hungry I didn’t want to waste the hot dog itself",
      "created_utc": 1717787081.0,
      "score": 15,
      "context": [
        {
          "id": "l7khuh7",
          "author": "Rare_Version6127",
          "body": "Yes! Ive never been able to handle any condiments or dressings. Im too scared to eat burgers and salads around people lmao. I forced myself to eat condiments on a hot dog once, because a friend had made it for me and I was embarrassed and didnt want to turn it down. I ended up throwing it all up anyways😅 i think the only sauces i can tolerate personally are tomato sauce and gravy, no clue why",
          "created_utc": 1717786158.0
        }
      ]
    },
    {
      "id": "l7pp9zv",
      "author": "RavenLunatic512",
      "body": "Maybe I'm projecting my own issues, but could you be sensitive to vinegar? It's added to so many condiments, but it won't be in tomato sauce or gravy. My nutritionist told me to avoid anything fermented for my migraines.",
      "created_utc": 1717873778.0,
      "score": 3,
      "context": [
        {
          "id": "l7khuh7",
          "author": "Rare_Version6127",
          "body": "Yes! Ive never been able to handle any condiments or dressings. Im too scared to eat burgers and salads around people lmao. I forced myself to eat condiments on a hot dog once, because a friend had made it for me and I was embarrassed and didnt want to turn it down. I ended up throwing it all up anyways😅 i think the only sauces i can tolerate personally are tomato sauce and gravy, no clue why",
          "created_utc": 1717786158.0
        }
      ]
    },
    {
      "id": "l7z7wa5",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1718034703.0,
      "score": 2,
      "context": [
        {
          "id": "l7qrvdc",
          "author": "halfeatencakeslice",
          "body": "ME OH MY GOD 😭😭 I have always hated condiments. When I was a kid even touching a ketchup bottle would make me cry I’m deadass too 🥲",
          "created_utc": 1717889438.0
        }
      ]
    },
    {
      "id": "l7klgj0",
      "author": "Rare_Version6127",
      "body": "Omg yes i would totally do that too😂 i just wish people werent so mean about it sometimes! That was like 10 years ago and I can barely even eat hot dogs at all anymore still, totally ruined it for me🥲 ive never felt more understood then i do in this sub lol",
      "created_utc": 1717787395.0,
      "score": 5,
      "context": [
        {
          "id": "l7khuh7",
          "author": "Rare_Version6127",
          "body": "Yes! Ive never been able to handle any condiments or dressings. Im too scared to eat burgers and salads around people lmao. I forced myself to eat condiments on a hot dog once, because a friend had made it for me and I was embarrassed and didnt want to turn it down. I ended up throwing it all up anyways😅 i think the only sauces i can tolerate personally are tomato sauce and gravy, no clue why",
          "created_utc": 1717786158.0
        },
        {
          "id": "l7kkjod",
          "author": "chunkeymunkeyandrunt",
          "body": "I literally washed and cleaned a hot dog once because it had mustard on it 😭 the bun was not salvageable but I was so hungry I didn’t want to waste the hot dog itself",
          "created_utc": 1717787081.0
        }
      ]
    },
    {
      "id": "mbz7oyd",
      "author": "Terrible-Complex8653",
      "body": "You too? Thank you for sharing this! I’ve also scraped many a burger patty to remove unauthorized mayo or excessive ketchup, and I’m merciless — clean margins are a must! I’ve had to so thoroughly treat burger buns that they were tattered flaps by the time I’d rid them of sauce.\n\nI also rinse packaged ham slices to get rid of the gelatin.",
      "created_utc": 1739169429.0,
      "score": 1,
      "context": [
        {
          "id": "l7khuh7",
          "author": "Rare_Version6127",
          "body": "Yes! Ive never been able to handle any condiments or dressings. Im too scared to eat burgers and salads around people lmao. I forced myself to eat condiments on a hot dog once, because a friend had made it for me and I was embarrassed and didnt want to turn it down. I ended up throwing it all up anyways😅 i think the only sauces i can tolerate personally are tomato sauce and gravy, no clue why",
          "created_utc": 1717786158.0
        },
        {
          "id": "l7kkjod",
          "author": "chunkeymunkeyandrunt",
          "body": "I literally washed and cleaned a hot dog once because it had mustard on it 😭 the bun was not salvageable but I was so hungry I didn’t want to waste the hot dog itself",
          "created_utc": 1717787081.0
        }
      ]
    },
    {
      "id": "l7ppqho",
      "author": "Rare_Version6127",
      "body": "I actually really hate vinegar, never even thought of the vinegar aspect of it tho! Thats interesting",
      "created_utc": 1717873958.0,
      "score": 4,
      "context": [
        {
          "id": "l7khuh7",
          "author": "Rare_Version6127",
          "body": "Yes! Ive never been able to handle any condiments or dressings. Im too scared to eat burgers and salads around people lmao. I forced myself to eat condiments on a hot dog once, because a friend had made it for me and I was embarrassed and didnt want to turn it down. I ended up throwing it all up anyways😅 i think the only sauces i can tolerate personally are tomato sauce and gravy, no clue why",
          "created_utc": 1717786158.0
        },
        {
          "id": "l7pp9zv",
          "author": "RavenLunatic512",
          "body": "Maybe I'm projecting my own issues, but could you be sensitive to vinegar? It's added to so many condiments, but it won't be in tomato sauce or gravy. My nutritionist told me to avoid anything fermented for my migraines.",
          "created_utc": 1717873778.0
        }
      ]
    },
    {
      "id": "l7zxb0n",
      "author": "halfeatencakeslice",
      "body": "SAME LIKE IT’S SO CRAZY TO THINK LIKE… idk other ppl feel this way 😭😭 THAT’S SO FUNNY THO LMAO. I’m laughing but ik kid me would’ve been like “you have my vote 😁”\n\nI can touch bottles now but it’s still vaguely gross to me, and I absolutely will not if it has any ketchup residue on it 😭😭😭😭 GOD NO",
      "created_utc": 1718043187.0,
      "score": 1,
      "context": [
        {
          "id": "l7qrvdc",
          "author": "halfeatencakeslice",
          "body": "ME OH MY GOD 😭😭 I have always hated condiments. When I was a kid even touching a ketchup bottle would make me cry I’m deadass too 🥲",
          "created_utc": 1717889438.0
        },
        {
          "id": "l7z7wa5",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1718034703.0
        }
      ]
    },
    {
      "id": "l7pqj4b",
      "author": "RavenLunatic512",
      "body": "Yeah it never occurred to me either until she said that. And I learned that a lot of other things I don't like are really high in histamine levels! It helped me feel less crazy about this stuff. My body has real legitimate reasons for not liking certain foods. Learning to actually listen to my body really helped.",
      "created_utc": 1717874273.0,
      "score": 3,
      "context": [
        {
          "id": "l7khuh7",
          "author": "Rare_Version6127",
          "body": "Yes! Ive never been able to handle any condiments or dressings. Im too scared to eat burgers and salads around people lmao. I forced myself to eat condiments on a hot dog once, because a friend had made it for me and I was embarrassed and didnt want to turn it down. I ended up throwing it all up anyways😅 i think the only sauces i can tolerate personally are tomato sauce and gravy, no clue why",
          "created_utc": 1717786158.0
        },
        {
          "id": "l7pp9zv",
          "author": "RavenLunatic512",
          "body": "Maybe I'm projecting my own issues, but could you be sensitive to vinegar? It's added to so many condiments, but it won't be in tomato sauce or gravy. My nutritionist told me to avoid anything fermented for my migraines.",
          "created_utc": 1717873778.0
        },
        {
          "id": "l7ppqho",
          "author": "Rare_Version6127",
          "body": "I actually really hate vinegar, never even thought of the vinegar aspect of it tho! Thats interesting",
          "created_utc": 1717873958.0
        }
      ]
    }
  ]
}