{
  "id": "1dnqtai",
  "subreddit": "ARFID",
  "author": "kneelessrexxy",
  "created_utc": 1719269330.0,
  "title": "DAE buy food and never eat it?",
  "selftext": "I am diagnosed. I do this really annoying thing for myself and my bank account where I say I’m going to try a new food, I go to the store and buy it, and it just sits in my fridge or my pantry until it goes bad. And then maybe I’ll buy it again and actually try it, but what the fuck. Why do I do that. Does anyone have any advice about how to actually just eat it the first time? ",
  "url": "https://www.reddit.com/r/ARFID/comments/1dnqtai/dae_buy_food_and_never_eat_it/",
  "score": 147,
  "num_comments": 51,
  "comments": [
    {
      "id": "la4mety",
      "author": "wrld333",
      "body": "Yep. all the time. I view it as, 3 years ago I would have never even picked it up at the store. I guess I am making progress, but it makes me sad. I just wish I could eat it. Mostly with fruit, I buy it and it goes bad and I’m like damn (repeat next month)",
      "created_utc": 1719272375.0,
      "score": 72,
      "context": []
    },
    {
      "id": "la4huu5",
      "author": "toastermasters",
      "body": "For me I find that if I put stuff where I can’t see it I will not eat it. Therefore, the bottom drawer in my fridge is for condiments, because if I want a condiment I will go look for it. Food I want to eat goes on a shelf I can see or in the fridge door.",
      "created_utc": 1719270614.0,
      "score": 29,
      "context": []
    },
    {
      "id": "la4kfz2",
      "author": "FunnelCakeGoblin",
      "body": "I am at a php right now. They had me order a food today, but I didn’t feel like I could eat it. They said that’s okay because I ate least ordered it, so that’s progress. I know you feel you are wasting the food or money by letting the first one spoil, but if that is what needs to be done for you to eat it the second time, then that’s okay. It’s still progress. It doesn’t have to be all at once.",
      "created_utc": 1719271614.0,
      "score": 24,
      "context": []
    },
    {
      "id": "la4thth",
      "author": "s317sv17vnv",
      "body": "I'm one of those people that if I don't see the food, I'm gonna forget about it. It's particularly annoying because I live with my mom and she gets pissed at me for leaving food on the counter or even my side of the dining table (hard to forget it's there when it's literally right in front of you), but then she also yells at me about how I'm so wasteful because there's so much expired food in the pantry.",
      "created_utc": 1719275038.0,
      "score": 10,
      "context": []
    },
    {
      "id": "la4lr9c",
      "author": "Upset-Lavishness-522",
      "body": "Yep, hummus. Every damn time.",
      "created_utc": 1719272120.0,
      "score": 9,
      "context": []
    },
    {
      "id": "la55brs",
      "author": "weirdsituati0n",
      "body": "Wowza yes, all the time!!!!! \n\nIt makes me feel so wasteful and I think there’s probs some shame in there. Once there’s something that I’m avoiding, I’ll stop going in the fridge or pantry altogether because I don’t want to be reminded I’m avoiding it. \n\nSomething that’s helped me is giving myself permission to eat straight from the fridge (I’m not spending time plating my food, lol) AND making a move towards the kitchen *as soon as I notice* any interest in food. Oh, and giving myself permission to toss it if I don’t like it, even if I only had one bite!\n\nGood luck, I’m right there with ya 🙃",
      "created_utc": 1719279697.0,
      "score": 4,
      "context": []
    },
    {
      "id": "la4opru",
      "author": "youARFIDwhatyoueat",
      "body": "I have on occasion bought food to try, only to never actually feel brave enough to try it and end up just wasting it.",
      "created_utc": 1719273261.0,
      "score": 5,
      "context": []
    },
    {
      "id": "la4uf6r",
      "author": "pinkcottonfrog",
      "body": "Always, it makes me feel so quilty",
      "created_utc": 1719275407.0,
      "score": 5,
      "context": []
    },
    {
      "id": "la4x4o1",
      "author": "marie-purrie",
      "body": "Sameee but now I do it with my parents money (since I do their grocery shopping as well) and they are rightfully annoyed 🙃",
      "created_utc": 1719276463.0,
      "score": 3,
      "context": []
    },
    {
      "id": "la4x95k",
      "author": "MeepOfDeath2113",
      "body": "This happens so much to me! Good intentions but fear takes over 😩",
      "created_utc": 1719276513.0,
      "score": 3,
      "context": []
    },
    {
      "id": "la4xoyh",
      "author": "Miserable-Coffee",
      "body": "Out of sight out of mind. I don't even end up finishing the food I like once it's in the fridge I just keep forgetting and letting it rot it's so disappointing",
      "created_utc": 1719276687.0,
      "score": 3,
      "context": []
    },
    {
      "id": "la53wll",
      "author": "joshb44231",
      "body": "I do that all the time. I have a shit ton of frozen fruits I bought several months ago to try, and I’m pretty sure they’re freezer burnt or close to.",
      "created_utc": 1719279131.0,
      "score": 3,
      "context": []
    },
    {
      "id": "la5ebys",
      "author": "Traumarama79",
      "body": "Constantly. It's to the point where I try to only buy fresh food if I'm about to fix a meal I know I'm hungry for and will eat. I've tried the meal prep thing and it just doesn't work. I either let it rot in my fridge or take up space in my freezer.",
      "created_utc": 1719283223.0,
      "score": 3,
      "context": []
    },
    {
      "id": "la6d04e",
      "author": "WinterSoldierFetish",
      "body": "I don't even want to think about the amount of yoghurt I've thrown out because of this. that's the one food I want to be able to eat, but I do one spoon and can't do more than that.",
      "created_utc": 1719302325.0,
      "score": 3,
      "context": []
    },
    {
      "id": "la515jo",
      "author": "_jamethan",
      "body": "All the time. My family hates it. I hate it too… but they don’t get that so they give me a hard time about it. They tell me to only buy things that I will eat. So I walk out of the grocery store with cereal, maybe some chips or something, and protein shakes.",
      "created_utc": 1719278041.0,
      "score": 2,
      "context": []
    },
    {
      "id": "la55ux8",
      "author": "bluejen",
      "body": "Yeah it’s like a personality trait of mine at this point",
      "created_utc": 1719279896.0,
      "score": 2,
      "context": []
    },
    {
      "id": "la5b70o",
      "author": "Forward_Material_378",
      "body": "So so so much! Thank god I have a dog that is a literal garbage disposal so almost nothing goes to waste. Between me and the kids’ waste I don’t even have to buy dog food",
      "created_utc": 1719281957.0,
      "score": 2,
      "context": []
    },
    {
      "id": "la6g3ho",
      "author": "None",
      "body": "All the time. Though I'm sure I probably have ADHD which doesn't help -- it's really easy to forget about food if I don't see it, and then it goes off... But I also buy food to try and then never get myself into the right state to do so. It's tricky.",
      "created_utc": 1719304588.0,
      "score": 2,
      "context": []
    },
    {
      "id": "la52lzc",
      "author": "Armayra",
      "body": "I used to do this with veggies alllllll the time. I wanted to get more veggies into my diet so I'd just buy those steamfresh ones you stick in the microwave, but then they'd just sit in my freezer forever. Then it was recommended to me to try and combine them with one of my safe foods - noodles. Next time I was at the store I found this frozen chow main that came with multiple veggies and noodles. The way I then got myself to eat it was by telling myself if I couldn't stand the veggies, I'd just pick them out and only eat the noodles. It worked for me and I've increased from zero veggies to a small handful. Hopefully you can do something similar with whatever food it is and it will work for you as well :)",
      "created_utc": 1719278614.0,
      "score": 1,
      "context": []
    },
    {
      "id": "la54xx3",
      "author": "Worth-Win5433",
      "body": "100%. For me we’re talking basic things like vegetables. Cheese, bread, tortilla chips are so much easier.",
      "created_utc": 1719279545.0,
      "score": 1,
      "context": []
    },
    {
      "id": "la5nbti",
      "author": "helvegenn",
      "body": "i buy new drinks all the time and then i leave them in the fridge until they’re no good",
      "created_utc": 1719287005.0,
      "score": 1,
      "context": []
    },
    {
      "id": "la5ne5s",
      "author": "luminousfloret",
      "body": "Just found this sub and I’m blown away already how hard I relate to all this. I tried to get myself to try spam for years. Bought it, it just sat there. I would look at it and tell myself “maybe tomorrow”. Tomorrow never came. I do this with foods I like too. I don’t know why",
      "created_utc": 1719287036.0,
      "score": 1,
      "context": []
    },
    {
      "id": "la677ua",
      "author": "Elegant-Possession62",
      "body": "Yeah sometimes i feel bold at the store but then i get home and am immediately like “ew”",
      "created_utc": 1719298231.0,
      "score": 1,
      "context": []
    },
    {
      "id": "la6k0q4",
      "author": "MxMCube",
      "body": "I'll often keep buying snacks over and over until my pantry is full, then I'll maybe start eating some of it because I can't buy any more. It's confusing",
      "created_utc": 1719307458.0,
      "score": 1,
      "context": []
    },
    {
      "id": "la6xkft",
      "author": "NoriFinn",
      "body": "I do this even with food I like. It is like if It is not right in my face I forget it exists. This has also caused me to buy more when I have said thing in the cabinet.",
      "created_utc": 1719315831.0,
      "score": 1,
      "context": []
    },
    {
      "id": "la6z57k",
      "author": "DenseAstronomer3631",
      "body": "Guilty and I freaking hate it 😭 there are multiple factors for me, but yeah...",
      "created_utc": 1719316611.0,
      "score": 1,
      "context": []
    },
    {
      "id": "la75xlg",
      "author": "MissLuna93",
      "body": "ALL. THE. TIME. It's like the closer it gets to being a reality of trying to, the more I freeze up and get nervous and sick. So in the supermarket I'm thinking yeah, I can try that, no big deal then when it comes it I can't even cook it let alone eat.",
      "created_utc": 1719319776.0,
      "score": 1,
      "context": []
    },
    {
      "id": "la7lv5c",
      "author": "sxkuba",
      "body": "all the damn time. even with food I do eat, I tend to forget about it, or just not fancy it and then it goes bad. and I throw away so much food. it's really frustrating",
      "created_utc": 1719325966.0,
      "score": 1,
      "context": []
    },
    {
      "id": "la7mw7o",
      "author": "Vness374",
      "body": "This happens all the time at my house, between my 19 year olds ARFID and both of our ADHD.  My kid feels guilty about wasting food, but I recently found a way to make them feel better about it… I feed their leftovers/waste to the crows!  They are scavengers and can eat almost anything (I try to avoid salt, rinse any seasoning/sauce off… the crows don’t care about it being soggy!) of course, now the crows are spoiled and ignore any fruit or veges (they love meat!) but the squirrels and chipmunks come and eat what the crows leave behind \n\nI know it’s a weird and random suggestion, but my kid feels so much better knowing the food isn’t getting wasted, and are supporting my bird feeding hyperfixation",
      "created_utc": 1719326328.0,
      "score": 1,
      "context": []
    },
    {
      "id": "la7wf6g",
      "author": "melmcc01",
      "body": "I'm really bad for forgetting to try something cause I'm not used to going to a fridge/cupboards as all the majority of my og safe foods are crisps etc, I set reminders on my phone to try it or for my protein shakes  so I don't forget before it goes bad! Or when I buy stuff usually it's stuff that I can eat that night with dinner",
      "created_utc": 1719329579.0,
      "score": 1,
      "context": []
    },
    {
      "id": "la8a3qg",
      "author": "SnooSnoo96035",
      "body": "I have bars of very nice quality chocolates in my freezer... they have been in there for YEARS.  Some I've purchased, and others were gifted by coworkers at holiday/ birthday celebrations. \n\nI don't even work with or speak to these people anymore.",
      "created_utc": 1719334131.0,
      "score": 1,
      "context": []
    },
    {
      "id": "la8p7av",
      "author": "Designer-Match-2149",
      "body": "All the time ",
      "created_utc": 1719339068.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lac83ne",
      "author": "rqdivm",
      "body": "yes :( i used to get my mom to buy cucumbers because i like them but im so scared of them being mushy or slightly off in flavour that i end up letting them rot in the fridge :(",
      "created_utc": 1719394492.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ladjjo2",
      "author": "singlepaIerose",
      "body": "i do this all the time. i reccomend putting a reminder (like a whiteboard or note) on the front of the fridge to make sure you dont forget. idk if this'd be good for you, but pressuring myself with something like \"think about how hard out of date food is to deal with\" helps me to actually eat it",
      "created_utc": 1719415613.0,
      "score": 1,
      "context": []
    },
    {
      "id": "la4q6kk",
      "author": "shortnsweet33",
      "body": "One of the perks of having a dog is I can buy an entire container of strawberries and hype myself up to eat one and then my dog will get strawberries for treats for a while and I’ll even freeze them so she can have a post summertime walk snack too lol. \n\nIt also helps to eat my one strawberry with the dog beside me eating them and going wide eyed like “this is fucking delicious MORE PLEASE” … can’t be that bad right? \n\nMaybe I’m just crazy 🤣",
      "created_utc": 1719273795.0,
      "score": 27,
      "context": [
        {
          "id": "la4mety",
          "author": "wrld333",
          "body": "Yep. all the time. I view it as, 3 years ago I would have never even picked it up at the store. I guess I am making progress, but it makes me sad. I just wish I could eat it. Mostly with fruit, I buy it and it goes bad and I’m like damn (repeat next month)",
          "created_utc": 1719272375.0
        }
      ]
    },
    {
      "id": "la55ibe",
      "author": "weirdsituati0n",
      "body": "damn (repeat next month) hits so hard",
      "created_utc": 1719279765.0,
      "score": 1,
      "context": [
        {
          "id": "la4mety",
          "author": "wrld333",
          "body": "Yep. all the time. I view it as, 3 years ago I would have never even picked it up at the store. I guess I am making progress, but it makes me sad. I just wish I could eat it. Mostly with fruit, I buy it and it goes bad and I’m like damn (repeat next month)",
          "created_utc": 1719272375.0
        }
      ]
    },
    {
      "id": "la4hxlm",
      "author": "kneelessrexxy",
      "body": "I really appreciate this, thanks",
      "created_utc": 1719270644.0,
      "score": 2,
      "context": [
        {
          "id": "la4huu5",
          "author": "toastermasters",
          "body": "For me I find that if I put stuff where I can’t see it I will not eat it. Therefore, the bottom drawer in my fridge is for condiments, because if I want a condiment I will go look for it. Food I want to eat goes on a shelf I can see or in the fridge door.",
          "created_utc": 1719270614.0
        }
      ]
    },
    {
      "id": "lab8yfb",
      "author": "Impossible_Ad1396",
      "body": "I switched to this and honestly made a huge difference. Still struggle with leftovers but I also try to plan at least two meals and make a list of ingredients and buy less than I need. Ie two or one capsicum instead of 3 so they dont rot. And stuff that doesnt go off like onions, rice, pasta, flour i get in bulk. I have ARFID too so eating is a whole thing. I have found a couple resources and worksheets to figure it out better so starting that today",
      "created_utc": 1719372609.0,
      "score": 2,
      "context": [
        {
          "id": "la4huu5",
          "author": "toastermasters",
          "body": "For me I find that if I put stuff where I can’t see it I will not eat it. Therefore, the bottom drawer in my fridge is for condiments, because if I want a condiment I will go look for it. Food I want to eat goes on a shelf I can see or in the fridge door.",
          "created_utc": 1719270614.0
        }
      ]
    },
    {
      "id": "la7n67g",
      "author": "Vness374",
      "body": "This is genius",
      "created_utc": 1719326423.0,
      "score": 1,
      "context": [
        {
          "id": "la4huu5",
          "author": "toastermasters",
          "body": "For me I find that if I put stuff where I can’t see it I will not eat it. Therefore, the bottom drawer in my fridge is for condiments, because if I want a condiment I will go look for it. Food I want to eat goes on a shelf I can see or in the fridge door.",
          "created_utc": 1719270614.0
        }
      ]
    },
    {
      "id": "la4ukkh",
      "author": "kneelessrexxy",
      "body": "Thanks so much this is so kind and helpful",
      "created_utc": 1719275464.0,
      "score": 3,
      "context": [
        {
          "id": "la4kfz2",
          "author": "FunnelCakeGoblin",
          "body": "I am at a php right now. They had me order a food today, but I didn’t feel like I could eat it. They said that’s okay because I ate least ordered it, so that’s progress. I know you feel you are wasting the food or money by letting the first one spoil, but if that is what needs to be done for you to eat it the second time, then that’s okay. It’s still progress. It doesn’t have to be all at once.",
          "created_utc": 1719271614.0
        }
      ]
    },
    {
      "id": "la4lya8",
      "author": "kneelessrexxy",
      "body": "SAME",
      "created_utc": 1719272196.0,
      "score": 2,
      "context": [
        {
          "id": "la4lr9c",
          "author": "Upset-Lavishness-522",
          "body": "Yep, hummus. Every damn time.",
          "created_utc": 1719272120.0
        }
      ]
    },
    {
      "id": "la6c61g",
      "author": "OneSmallStar",
      "body": "taking hummus off my shopping list right now because I know I will do that same thing. i WANT to like it though :’)",
      "created_utc": 1719301714.0,
      "score": 1,
      "context": [
        {
          "id": "la4lr9c",
          "author": "Upset-Lavishness-522",
          "body": "Yep, hummus. Every damn time.",
          "created_utc": 1719272120.0
        }
      ]
    },
    {
      "id": "la4x8ue",
      "author": "marie-purrie",
      "body": "Quinoa is the problem, not me 🤣 why is it so healthy but squishy looking 🤪",
      "created_utc": 1719276509.0,
      "score": 2,
      "context": [
        {
          "id": "la4x4o1",
          "author": "marie-purrie",
          "body": "Sameee but now I do it with my parents money (since I do their grocery shopping as well) and they are rightfully annoyed 🙃",
          "created_utc": 1719276463.0
        }
      ]
    },
    {
      "id": "la553gz",
      "author": "Worth-Win5433",
      "body": "I live on cereal.",
      "created_utc": 1719279606.0,
      "score": 1,
      "context": [
        {
          "id": "la515jo",
          "author": "_jamethan",
          "body": "All the time. My family hates it. I hate it too… but they don’t get that so they give me a hard time about it. They tell me to only buy things that I will eat. So I walk out of the grocery store with cereal, maybe some chips or something, and protein shakes.",
          "created_utc": 1719278041.0
        }
      ]
    },
    {
      "id": "la54ljy",
      "author": "qning",
      "body": ">It also helps to eat my one strawberry with the dog beside me eating them and going wide eyed like “this is fucking delicious MORE PLEASE” … can’t be that bad right?\n\nThis is awesome. We call those buddy bites in treatment. \n \n \n \n\n>Maybe I’m just crazy 🤣\n\nAren’t we all.",
      "created_utc": 1719279406.0,
      "score": 14,
      "context": [
        {
          "id": "la4mety",
          "author": "wrld333",
          "body": "Yep. all the time. I view it as, 3 years ago I would have never even picked it up at the store. I guess I am making progress, but it makes me sad. I just wish I could eat it. Mostly with fruit, I buy it and it goes bad and I’m like damn (repeat next month)",
          "created_utc": 1719272375.0
        },
        {
          "id": "la4q6kk",
          "author": "shortnsweet33",
          "body": "One of the perks of having a dog is I can buy an entire container of strawberries and hype myself up to eat one and then my dog will get strawberries for treats for a while and I’ll even freeze them so she can have a post summertime walk snack too lol. \n\nIt also helps to eat my one strawberry with the dog beside me eating them and going wide eyed like “this is fucking delicious MORE PLEASE” … can’t be that bad right? \n\nMaybe I’m just crazy 🤣",
          "created_utc": 1719273795.0
        }
      ]
    },
    {
      "id": "la520dh",
      "author": "visturge",
      "body": "nah, i do the same thing with my dog lol, she's like a trash compactor",
      "created_utc": 1719278380.0,
      "score": 4,
      "context": [
        {
          "id": "la4mety",
          "author": "wrld333",
          "body": "Yep. all the time. I view it as, 3 years ago I would have never even picked it up at the store. I guess I am making progress, but it makes me sad. I just wish I could eat it. Mostly with fruit, I buy it and it goes bad and I’m like damn (repeat next month)",
          "created_utc": 1719272375.0
        },
        {
          "id": "la4q6kk",
          "author": "shortnsweet33",
          "body": "One of the perks of having a dog is I can buy an entire container of strawberries and hype myself up to eat one and then my dog will get strawberries for treats for a while and I’ll even freeze them so she can have a post summertime walk snack too lol. \n\nIt also helps to eat my one strawberry with the dog beside me eating them and going wide eyed like “this is fucking delicious MORE PLEASE” … can’t be that bad right? \n\nMaybe I’m just crazy 🤣",
          "created_utc": 1719273795.0
        }
      ]
    },
    {
      "id": "la9nhex",
      "author": "LowRhubarb5668",
      "body": "You just have to make sure the dog can have the food too. Somethings like grapes are good for humans not for dogs. But I used to do this too unfortunately my dog passed away a couple of years ago.",
      "created_utc": 1719350239.0,
      "score": 1,
      "context": [
        {
          "id": "la4mety",
          "author": "wrld333",
          "body": "Yep. all the time. I view it as, 3 years ago I would have never even picked it up at the store. I guess I am making progress, but it makes me sad. I just wish I could eat it. Mostly with fruit, I buy it and it goes bad and I’m like damn (repeat next month)",
          "created_utc": 1719272375.0
        },
        {
          "id": "la4q6kk",
          "author": "shortnsweet33",
          "body": "One of the perks of having a dog is I can buy an entire container of strawberries and hype myself up to eat one and then my dog will get strawberries for treats for a while and I’ll even freeze them so she can have a post summertime walk snack too lol. \n\nIt also helps to eat my one strawberry with the dog beside me eating them and going wide eyed like “this is fucking delicious MORE PLEASE” … can’t be that bad right? \n\nMaybe I’m just crazy 🤣",
          "created_utc": 1719273795.0
        }
      ]
    },
    {
      "id": "la7w89h",
      "author": "toastermasters",
      "body": "Thank you :) I actually stole the idea from an autism content creator on tiktok, but I don’t know who it was and I no longer have the app.",
      "created_utc": 1719329512.0,
      "score": 2,
      "context": [
        {
          "id": "la4huu5",
          "author": "toastermasters",
          "body": "For me I find that if I put stuff where I can’t see it I will not eat it. Therefore, the bottom drawer in my fridge is for condiments, because if I want a condiment I will go look for it. Food I want to eat goes on a shelf I can see or in the fridge door.",
          "created_utc": 1719270614.0
        },
        {
          "id": "la7n67g",
          "author": "Vness374",
          "body": "This is genius",
          "created_utc": 1719326423.0
        }
      ]
    },
    {
      "id": "la4mnrm",
      "author": "Upset-Lavishness-522",
      "body": "There's a sad pot in our fridge, open a week with a chips worth sampled. I even kind of liked it? But I'm not eating it after a week, can't justify buying more as it's still there, but im not eating it as it's been open for a week. So, wait for sell by date, throw it out (along with the carrots I swore I'd eat with it) and then repeat. I swear, if I added up the money I spent doing shit like this I'd be destroyed.",
      "created_utc": 1719272470.0,
      "score": 7,
      "context": [
        {
          "id": "la4lr9c",
          "author": "Upset-Lavishness-522",
          "body": "Yep, hummus. Every damn time.",
          "created_utc": 1719272120.0
        },
        {
          "id": "la4lya8",
          "author": "kneelessrexxy",
          "body": "SAME",
          "created_utc": 1719272196.0
        }
      ]
    },
    {
      "id": "la5hzb0",
      "author": "shortnsweet33",
      "body": "Its truly fantastic. If the cheese has been open for too long (for me to use but is perfectly fine still) then she gets her daily pill wrapped in cheese so I don't waste it lol",
      "created_utc": 1719284688.0,
      "score": 4,
      "context": [
        {
          "id": "la4mety",
          "author": "wrld333",
          "body": "Yep. all the time. I view it as, 3 years ago I would have never even picked it up at the store. I guess I am making progress, but it makes me sad. I just wish I could eat it. Mostly with fruit, I buy it and it goes bad and I’m like damn (repeat next month)",
          "created_utc": 1719272375.0
        },
        {
          "id": "la4q6kk",
          "author": "shortnsweet33",
          "body": "One of the perks of having a dog is I can buy an entire container of strawberries and hype myself up to eat one and then my dog will get strawberries for treats for a while and I’ll even freeze them so she can have a post summertime walk snack too lol. \n\nIt also helps to eat my one strawberry with the dog beside me eating them and going wide eyed like “this is fucking delicious MORE PLEASE” … can’t be that bad right? \n\nMaybe I’m just crazy 🤣",
          "created_utc": 1719273795.0
        },
        {
          "id": "la520dh",
          "author": "visturge",
          "body": "nah, i do the same thing with my dog lol, she's like a trash compactor",
          "created_utc": 1719278380.0
        }
      ]
    },
    {
      "id": "la9o45k",
      "author": "shortnsweet33",
      "body": "For sure always check things before sharing with pets! Sorry to hear about your dog. I hope you two had many wonderful memories together ❤️",
      "created_utc": 1719350454.0,
      "score": 1,
      "context": [
        {
          "id": "la4mety",
          "author": "wrld333",
          "body": "Yep. all the time. I view it as, 3 years ago I would have never even picked it up at the store. I guess I am making progress, but it makes me sad. I just wish I could eat it. Mostly with fruit, I buy it and it goes bad and I’m like damn (repeat next month)",
          "created_utc": 1719272375.0
        },
        {
          "id": "la4q6kk",
          "author": "shortnsweet33",
          "body": "One of the perks of having a dog is I can buy an entire container of strawberries and hype myself up to eat one and then my dog will get strawberries for treats for a while and I’ll even freeze them so she can have a post summertime walk snack too lol. \n\nIt also helps to eat my one strawberry with the dog beside me eating them and going wide eyed like “this is fucking delicious MORE PLEASE” … can’t be that bad right? \n\nMaybe I’m just crazy 🤣",
          "created_utc": 1719273795.0
        },
        {
          "id": "la9nhex",
          "author": "LowRhubarb5668",
          "body": "You just have to make sure the dog can have the food too. Somethings like grapes are good for humans not for dogs. But I used to do this too unfortunately my dog passed away a couple of years ago.",
          "created_utc": 1719350239.0
        }
      ]
    }
  ]
}