{
  "id": "1dpa7kw",
  "subreddit": "ARFID",
  "author": "Avetheelf",
  "created_utc": 1719437577.0,
  "title": "Does anyone else wish they could be a vegetarian but can't because they'd risk serious malnutrition? ",
  "selftext": "I tried to be a vegetarian once as a teenager but I ended up in the hospital in a lot of pain because I had become so malnourished. \nBut I just really love all animals and feel a lot of guilt sometimes that I eat animals that I love like chickens, cows, and pigs. \n\nIt's not that I don't think we should eat them but more that I personally feel sad at the idea of being the reason this animal is no longer alive. \n\nHowever even today with my diet being more expanded than when I was a teenager is still think cutting meat out of my diet would have a serious detriment to my health. \n\nI suppose I am just frustrated I don't get the freedom to choose whether or not I eat meat and that the guilt of eating something I care about is just something I may have to learn to live with. \n\nAlso I know there is the beyond lab grown meat now but I am so scared I'll hate the texture that I haven't even tried it yet. ",
  "url": "https://www.reddit.com/r/ARFID/comments/1dpa7kw/does_anyone_else_wish_they_could_be_a_vegetarian/",
  "score": 86,
  "num_comments": 70,
  "comments": [
    {
      "id": "lafiv4f",
      "author": "SamTheDystopianRat",
      "body": "i managed it. it might not be the best for me, but, if couldn't take eating the animals. i urge you to at least try the synthetic substitutes though. the chicken ones are phenomenal and they can convince me with my horrific sensory/textural issues, they might work for you too",
      "created_utc": 1719439096.0,
      "score": 31,
      "context": []
    },
    {
      "id": "lafwuud",
      "author": "Honeydewskyy20",
      "body": "Meat textures has made me inadvertently a vegetarian. Just thinking about meat makes me nauseous. And yes, my doctor has said that I am showing signs of malnutrition. I have to take iron supplements and drink protein shakes daily.",
      "created_utc": 1719444212.0,
      "score": 23,
      "context": []
    },
    {
      "id": "laglph5",
      "author": "mydogisagoblin",
      "body": "I’m a vegan and will never go back. I actually feel like I have more options as a vegan because I was always getting grossed out by animal products in my food. I’m more willing to try new things if they are vegan because I know none of that stuff is in it., if that makes sense.",
      "created_utc": 1719453807.0,
      "score": 8,
      "context": []
    },
    {
      "id": "lafpax2",
      "author": "ZestycloseExtent8981",
      "body": "For me, after I watched a documentary on animal agriculture when I was 13, I couldn’t stop thinking about it. I googled exposure therapy techniques and basically forced myself to learn to eat just enough variety that i could cut out meat and dairy and be okay ( I really learned how to like tofu ). I’m in about the same physical shape as I was when I was eating meat, not amazing , but also not horrible. I struggle with eating enough calories regardless of whether I am eating meat or not lol. But anyways , i’m 19 now and still don’t eat meat or dairy! It’s definitely doable but very hard at the beginning.",
      "created_utc": 1719441397.0,
      "score": 6,
      "context": []
    },
    {
      "id": "lag3snj",
      "author": "LeakyFountainPen",
      "body": "Oh man, yeah, it was a struggle. The first time I tried to go vegetarian as a teen,  I ended up cutting out like...90% of my menu. I drank a lot of protein shakes back then, lol. Eventually my parents had to put the foot down.\n\nBut!! A few years later, I managed to make the jump with a broader menu and a better game-plan.\n\n*One thing I will say is that it's not a zero-sum game. You can try cutting out more and more meats over the course of several years as your safe-menu expands.*\n\nMaybe a \"Meatless Mondays\" method, followed by \"Meatless Monday & Tuesday\" and slowly build from there.\n\nAlso, if you're concerned with texture, I will say: I LOVE the fake meat textures because they're always so consistent. I used to spend 50% of my meat-prep and meat-eating cutting out gristle and white strips and dark spots and bits with Wrong Texture, and worries about skin and bone and 9 million other things. But the veggie meats don't have ANY of that and it's SUCH a relief to my ARFID.\n\nI would suggest starting with \"Impossible\" brand chicken nuggets to start. They're so handy and yummy and they're fairly similar to normal bake-at-home nuggets. They're probably my favorite fake meat.\n\nI've also found that the joys of making veggie burgers at home (not the Beyond or Impossible, but from scratch) is that I can dial in the EXACT texture I want. A tablespoon of extra rice or a dash of tomato sauce can make a WORLD of difference for my specific texture needs.\n\n.\n\n((Also, Beyond Meat isn't lab-grown, the lab-grown stuff is still in development for commercial sale in the US (unless I missed a HUGE announcement)\n\nBeyond & Impossible are both made from plant-derived ingredients and have a different molecular makeup than meat.))\n\n.\n\nBest wishes to you!!",
      "created_utc": 1719446882.0,
      "score": 7,
      "context": []
    },
    {
      "id": "lagnhrx",
      "author": "velociraptor56",
      "body": "ARFID parent here - The beyond chicken nuggets are very good. I haven’t eaten chicken in 20 years, but my husband assures me there is very little difference.\n\nI will say that there are tons of ethical concerns in the world. People with ARFID tend to be very sensitive, at least I’ve found, in general. Which is a great thing - to have empathy for others - but can also be very difficult. You all just feel things very deeply. You know that whole saying about “putting on your oxygen mask first before helping others” - that is this situation.",
      "created_utc": 1719454521.0,
      "score": 7,
      "context": []
    },
    {
      "id": "lafougg",
      "author": "None",
      "body": "I personally want to go pescatarian (basically vegetarian with the addition of seafoods) but I cannot escape chicken as, for me, it’s one of the easiest sources of protein for me to eat.",
      "created_utc": 1719441228.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lageb1b",
      "author": "plastickghost",
      "body": "it hasn’t been hard for me, if anything helped me not be as scared/grossed out over food. most times i tend to eat the same safe foods over and over, but still hit all my goals for intake. it’s not as hard as a lot of people make it out to be, definitely a learning curve though",
      "created_utc": 1719450904.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lag8zd9",
      "author": "Manospondylus_gigas",
      "body": "I'm vegan and just take a lot of supplements",
      "created_utc": 1719448868.0,
      "score": 3,
      "context": []
    },
    {
      "id": "laheqxw",
      "author": "SnooSnoo96035",
      "body": "I eat carnivore with a major focus on ruminating animals.  I can't do carbs or sugar. Plants (fiber) upset my digestion, I'm allergic to legumes and have diverticulitis, so nothing with seeds either.  All those health problems came after being vegan, then raw vegan for YEARS.  \n\nI wish I could just have a balanced relationship with food.  Either extreme is still so restrictive.",
      "created_utc": 1719467869.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lafjp9o",
      "author": "Mountain-Classroom61",
      "body": "For sure my issue is more so that my mother hates vegetables and so growing up I wasn’t Introduced to a lot and thus can’t stand most of them (I have gotten past some of it and pride myself that I eat more veg than my family) as far as meat I only really eat chicken (steak and beef once or twice a month at most) I would never give up dairy products tho as most of my diet these days is cream cheese whoops",
      "created_utc": 1719439389.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lagvi22",
      "author": "mercurys-daughter",
      "body": "Going vegetarian helped me a lot, but I feel this way about being vegan. I can’t make that leap without risking my health",
      "created_utc": 1719457827.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lahn9ar",
      "author": "listlessgod",
      "body": "Meat is one of the things I can’t eat because of arfid. I haven’t eaten it since I was 9 maybe?? And was really fussy about it before then too but my mom made me eat it and only stopped forcing me to when I was 9 lol. My reasons are not bc of ethics but solely because meat freaks me out and I gag trying to eat it. I just find it disgusting and it’s solely an arfid thing probably. There’s other sources of protein other than meat though, there’s dairy, nuts, beans, eggs, grains, tofu, quinoa, seeds, protein shakes/bars/powder, and even some fake meats that have protein. I don’t like fake meat either because it’s too similar to meat but I hear it’s pretty similar although some brands seem to be better than others. Honestly, be careful cutting out food groups especially if you have arfid. You could slowly try to eat less meat while incorporating some other sources of protein and weaning yourself off of it, that way you can easily stop if you get sick again. It seems much safer to do it like that with a meal plan involved and you can slowly adjust to a new diet that way that still has protein involved rather than stopping cold turkey (no pun intended lol)",
      "created_utc": 1719473417.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lahqh4a",
      "author": "dhcirkekcheia",
      "body": "I once had some messed up quorn so it put me right off meat substitutes, but I’d love to be vegetarian.\nI just don’t eat enough foods to be able to swing it, as I already don’t meet my nutritional needs",
      "created_utc": 1719475714.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lai8lum",
      "author": "gerkinvangogh",
      "body": "My bf has ARFID and manages perfectly well to be vegetarian. Quinoa is your best friend! Adapts to pretty much all flavours.",
      "created_utc": 1719487579.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lafgnah",
      "author": "froggy21997",
      "body": "Yeah, I tried being vegetarian about 5 years ago because I wanted to cook for myself,  and I'm always worried about undercooking meat. My protein and B12 and iron intake were constantly lower than they were supposed to be, so I had to switch back to eating frozen meals with meat.",
      "created_utc": 1719438335.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lafsq7e",
      "author": "No-Weird522",
      "body": "ive been told theres no reason why we cant just all be vegan but between my arfid and my stomach issues when i tried to be vegan i had almost nothing to eat. in theory yes we could survive as vegans but its so unpractical and hard for most people. chicken and eggs are my only protein source in my diet and im just kinda accepting theres nothing i can do, its not my fault the meat industry is bad and im doing what i can to stay healthy.",
      "created_utc": 1719442657.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lafi3u5",
      "author": "Jaceywac3y",
      "body": "Uhhhg totally. I’m a huge animal lover and I wish I could got vegetarian really bad- but most substitution options are just really not for me… so I’m just kinda stuck.\n\nI get what you mean when you say you just wish you got the choice to choose. I think a lot of ppl don’t understand that we don’t get to pick our safe foods unfortunately :/",
      "created_utc": 1719438835.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lag8lzj",
      "author": "LameOCallahan",
      "body": "I went vegan and it rlly messed up my health, gradually turned to pescatarianism and now I eat meat but have to force myself not to think about it too much 😭",
      "created_utc": 1719448729.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lagaoz7",
      "author": "Amazing-Cellist3672",
      "body": "I worried for years before taking the plunge. I went pescatarian, because salmon is one of my safe foods. Luckily beans and lentils are also safe. I have to take iron supplements and I'm sure I'm not as well nourished as I would be if I ate meat (although I only ever ate chicken nuggets and ground beef) but I'm okay and MUCH happier this way",
      "created_utc": 1719449516.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lagqvxa",
      "author": "Shellyboms75",
      "body": "All my life I hated the thought of eating meat, but my ARFID meant I cant eat fruit or veg so I felt so torn. If I didn't eat meat what on earth could I eat?\n\nA few years ago I found Quorn products and I had pretty much naturally gone off most meat (stopping smoking made my sense of smell stronger and I was repulsed by fatty smells).\n\nI was basically only eating Chicken and Burgers.\n\nI found alternative meat free versions which I actually liked and knew I could substitute them for meat.\n\nIt did take a lot of trial and error and I threw a lot away, but I have now found a lot I like.\n\nIf you can get hold of Quorn products, their Nuggets are amazing, their Sausage Patties are just like those at McDonalds (My non veggie sister introduced me to the sausage patties as her and her fella think they are the nearest to Mcdonalds they have found). Also Beyond burgers are epic, Mcdonalds use them in their McPlant burgers which are delicious. I add a bit of butter to the Beyond Burger at the end of cooking and fry up some frozen onion pieces to go with it and I am close to the McPlant now!\n\nI didn't find any real beef or pork substitutes I like though.\n\nQuorn pieces I use in place of meat but they can be a bit bland. I do enjoy curries and asian food so can make them more interesting.\n\nSadly though my diet still isn't good, in addition to no fruit, veg, meat or milk I stuff myself with a lot of carbs, Pasta, Rice, Breads etc.\n\nIt is about 3 years now since I went Veggie and am so happy I did. I think it is highly unlikely I will become vegan though.\n\nIf you can afford to try them there are some excellent meat substitute products on the market now, we are very lucky.\n\nIf you love pasta dishes, heavily spiced or sauce dishes you will be able to substitute the meat quite easily.",
      "created_utc": 1719455894.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lagtm4q",
      "author": "frenchynerd",
      "body": "I like tofu. You can cook it so many different ways, it's cheap, easy to digest, full of proteins, calcium, vitamins.",
      "created_utc": 1719457025.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lah418e",
      "author": "M1RR0R",
      "body": "Morningstar and Impossible nuggets are amazing especially in an air fryer, toaster 2nd best. I like beyond 2.0 better than the original and impossible beef is not as good as it used to be but still decent if you cook it right. Flavored hummus as a dip for your veggie of choice is great too.",
      "created_utc": 1719461853.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lai47oj",
      "author": "5minutecall",
      "body": "I became a vegetarian at 3 when I found out meat was animals and could not cope with the thought of eating them.  Didn’t go down well at all with my family considering my Dad has owned and operated trawlers and commercial trout boats his whole life, and I refused to even handle any of the seafood that came off his boats lol\n\nI manage.  My iron does occasionally get quite low, but I prefer to sit through infusions than even the thought of eating meat.  Plus I’ve been told by dietitians that I would probably get quite ill if I tried to start eating red meat after 30 years of not eating it.  My body wouldn’t know how to process it.",
      "created_utc": 1719485096.0,
      "score": 1,
      "context": []
    },
    {
      "id": "laij9g7",
      "author": "No-Bonus-7543",
      "body": "Just depends on your 'safe' food. I'm a life long vegetarian, who eats no fruit or vegetables. My blood always comes back fine!",
      "created_utc": 1719492579.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lais75g",
      "author": "Robotgirl3",
      "body": "Im vegan,have ibd,and arfid and im obese.\n\n meat,eggs and dairy all have textures i cant stand though so it was easy to stop eating them since i rarely did growing up.\n\nAfter 8 years of veganism my bloodwork shows i have all my nutrients and im healthy besides the fatness lol",
      "created_utc": 1719496102.0,
      "score": 1,
      "context": []
    },
    {
      "id": "laj65nu",
      "author": "Designer-Match-2149",
      "body": "I only eat three things, corn. Chicken, and Turkey. If I went vegetarian I definitely be malnourished and I don’t wana be tube fed again!",
      "created_utc": 1719500957.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lajv8bz",
      "author": "deadhogdroppin",
      "body": "I eat a shit ton of beans because meat isn’t so reliable for me. I’m not a strict vegetarian, though. I can eat some fish/crabs and chicken from the same place. Sometimes I do worry about not getting enough protein, because I’ve started working out.",
      "created_utc": 1719509111.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lajvy2x",
      "author": "ASpaceOstrich",
      "body": "Yep. I can't form any argument against veganism but I eat what the brain allows me to eat.",
      "created_utc": 1719509340.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lajz46e",
      "author": "apizzamx",
      "body": "i literally JUST stopped being veggie (and before that, vegan) because i have realised my nutritional intake is absolutely pants. \n\ntbf i only eat poultry, fish and animal byproducts. i couldnt make myself eat beef or pork etc. \n\ni was vegan for 5 years and i was so unhealthy.. my hair was so flat and dead and my skin was sullen etc. i had no energy for anything. \n\ni only started eating chicken a week ago but it has been such a lifesaver already bc on the days i wanted to eat nothing i found the idea of chicken tenders as Not Awful and so managed to eat them. without them i’d have gone hungry like before. \n\nso my advice : try it if you want, but limiting your already small selection of foods is not always a great idea. there are many other ways to care for the animals!!",
      "created_utc": 1719510373.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lakm32i",
      "author": "GravityDefining",
      "body": "If I stopped eating chicken, I would have next to no protein in my diet.",
      "created_utc": 1719517820.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lakndtu",
      "author": "ItemSuccessful2403",
      "body": "Already am",
      "created_utc": 1719518237.0,
      "score": 1,
      "context": []
    },
    {
      "id": "laku6r4",
      "author": "None",
      "body": "I have ARFID and have been vegetarian for 3 years. I often joke that I'm a 'salad-dodging vegetarian'. There's only a small group of fruits and vegetables I'm happy to eat, I do take supplements to cover my other bases, and I've had my blood checked and all levels were normal.\n\nA lot of meat substitutes are great, to the point that when we get take out I sometimes have to get my boyfriend to try what I've ordered to confirm it's not real meat. Beyond Meat burgers are incredible, and if you can get hold of Linda McCartney products where you are, I'd highly recommend them!",
      "created_utc": 1719520424.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lalbmvd",
      "author": "TootMCT",
      "body": "I used to be a vegan but had to go back to eating dairy etc because there weren’t enough foods I could eat. Super recently I started eating meat again, it feels so freeing to actually be able to eat many more things now, but I feel really sad since I love animals so so much! I have disabilities that make me unable to cook most of the time, I rely on foods that don’t need much or any cooking, there is already a limited number of vegetarian or vegan options and combined with arfid, there was almost no food I could eat. I also feel sad and frustrated that I can’t choose what diet I want to have, and I really wish I could be vegan again",
      "created_utc": 1719526360.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lamlfk4",
      "author": "Environmental-Cat942",
      "body": "try opting for organic/free range/holistically farmed stuff! it might be a bit more costly but i personally find solace in knowing that the farms take care of their animals. my family is multiple generations of butchers lol, but my nan will only buy from Temple Grandin approved farms because they TAKE CARE of their animals. im wanting to try bacon bc im deficient in some stuff and i know getting it from my grandparents will be the best option for me",
      "created_utc": 1719544631.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lamm26a",
      "author": "Environmental-Cat942",
      "body": "try opting for organic/free range/holistically farmed stuff! it might be a bit more costly but i personally find solace in knowing that the farms take care of their animals. my family is multiple generations of butchers lol, but my nan will only buy from Temple Grandin approved farms because they TAKE CARE of their animals. im wanting to try bacon bc im deficient in some stuff and i know getting it from my grandparents will be the best option for me",
      "created_utc": 1719544960.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lapk82b",
      "author": "ResurgentClusterfuck",
      "body": "I tried it and got so sick I almost needed hospitalization \n\nNow I confine my meat eating to things that don't remind me of where it comes from, because if I remember that I can't eat the thing anymore",
      "created_utc": 1719595832.0,
      "score": 1,
      "context": []
    },
    {
      "id": "law98ty",
      "author": "South_Bathroom5979",
      "body": "You guys are eating meat?",
      "created_utc": 1719699260.0,
      "score": 1,
      "context": []
    },
    {
      "id": "laxzj8g",
      "author": "Icy_Junket4521",
      "body": "You eating an animal or not makes no difference besides a decrease in happiness in your life. The animals still dead and they'll keep dying",
      "created_utc": 1719728501.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lb32xqx",
      "author": "UniqueStrength4611",
      "body": "I don’t eat most meats I just eat prosciutto and bulgogi but when I say I can’t eat a certain meat when I’m offered it I get asked “are you vegetarian” and then I have to tell them that I don’t like it and they side eye me or it feels like they’re judging me so that’s a part of why I wanna be veg so now I just say I’m basically veg but I eat meat once or twice every two months or I say I’m almost vegetarian and if they ask wdym I say I eat prosciutto and bulgogi but I can’t eat other meat bc of my Ed- if I don’t know the person very well or I’m at a restaurant I just say I’m veg",
      "created_utc": 1719810296.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lag1wx3",
      "author": "Emergency-Cookie-290",
      "body": "I think the trauma that comes with eating animals can do more damage to you and can make ARFRID harder to recover from, do you have any safe foods or foods you’re willing to try that are vegetarian? You could also take supplements if you’re lacking something",
      "created_utc": 1719446155.0,
      "score": 0,
      "context": []
    },
    {
      "id": "lagvg35",
      "author": "vampirelasagna",
      "body": "wrench unused flowery nine dolls market different air cooing mourn\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
      "created_utc": 1719457804.0,
      "score": 5,
      "context": [
        {
          "id": "lafiv4f",
          "author": "SamTheDystopianRat",
          "body": "i managed it. it might not be the best for me, but, if couldn't take eating the animals. i urge you to at least try the synthetic substitutes though. the chicken ones are phenomenal and they can convince me with my horrific sensory/textural issues, they might work for you too",
          "created_utc": 1719439096.0
        }
      ]
    },
    {
      "id": "laga7m1",
      "author": "bfaithr",
      "body": "I’m trying to keep meat in my diet and it’s so hard. I can really only tolerate meat that’s so processed that I can’t tell it used to be alive (I’m writing this while eating McNuggets). And even then, I can only eat meat like twice a month",
      "created_utc": 1719449335.0,
      "score": 7,
      "context": [
        {
          "id": "lafwuud",
          "author": "Honeydewskyy20",
          "body": "Meat textures has made me inadvertently a vegetarian. Just thinking about meat makes me nauseous. And yes, my doctor has said that I am showing signs of malnutrition. I have to take iron supplements and drink protein shakes daily.",
          "created_utc": 1719444212.0
        }
      ]
    },
    {
      "id": "laikpow",
      "author": "cunt_tree",
      "body": "Please also make sure you are taking B12",
      "created_utc": 1719493178.0,
      "score": 5,
      "context": [
        {
          "id": "lafwuud",
          "author": "Honeydewskyy20",
          "body": "Meat textures has made me inadvertently a vegetarian. Just thinking about meat makes me nauseous. And yes, my doctor has said that I am showing signs of malnutrition. I have to take iron supplements and drink protein shakes daily.",
          "created_utc": 1719444212.0
        }
      ]
    },
    {
      "id": "lagmeto",
      "author": "mydogisagoblin",
      "body": "Wanted to add that I've been vegan for almost 6 years and was vegetarian for 12 before that, and have never had any signs of malnutrition and i get a checkup yearly at the doctor, which involves blood tests and everything. So it can be done!",
      "created_utc": 1719454088.0,
      "score": 1,
      "context": [
        {
          "id": "laglph5",
          "author": "mydogisagoblin",
          "body": "I’m a vegan and will never go back. I actually feel like I have more options as a vegan because I was always getting grossed out by animal products in my food. I’m more willing to try new things if they are vegan because I know none of that stuff is in it., if that makes sense.",
          "created_utc": 1719453807.0
        }
      ]
    },
    {
      "id": "lagrmal",
      "author": "myangelhood",
      "body": "The lab grown stuff seems promising for a food as energy dense as meat, but it seems like theyre trying to market it to meat eaters by adding the gross and inconsistent parts of meat… even saw a clip of a fake steak with fake myoglobin…",
      "created_utc": 1719456194.0,
      "score": 3,
      "context": [
        {
          "id": "lag3snj",
          "author": "LeakyFountainPen",
          "body": "Oh man, yeah, it was a struggle. The first time I tried to go vegetarian as a teen,  I ended up cutting out like...90% of my menu. I drank a lot of protein shakes back then, lol. Eventually my parents had to put the foot down.\n\nBut!! A few years later, I managed to make the jump with a broader menu and a better game-plan.\n\n*One thing I will say is that it's not a zero-sum game. You can try cutting out more and more meats over the course of several years as your safe-menu expands.*\n\nMaybe a \"Meatless Mondays\" method, followed by \"Meatless Monday & Tuesday\" and slowly build from there.\n\nAlso, if you're concerned with texture, I will say: I LOVE the fake meat textures because they're always so consistent. I used to spend 50% of my meat-prep and meat-eating cutting out gristle and white strips and dark spots and bits with Wrong Texture, and worries about skin and bone and 9 million other things. But the veggie meats don't have ANY of that and it's SUCH a relief to my ARFID.\n\nI would suggest starting with \"Impossible\" brand chicken nuggets to start. They're so handy and yummy and they're fairly similar to normal bake-at-home nuggets. They're probably my favorite fake meat.\n\nI've also found that the joys of making veggie burgers at home (not the Beyond or Impossible, but from scratch) is that I can dial in the EXACT texture I want. A tablespoon of extra rice or a dash of tomato sauce can make a WORLD of difference for my specific texture needs.\n\n.\n\n((Also, Beyond Meat isn't lab-grown, the lab-grown stuff is still in development for commercial sale in the US (unless I missed a HUGE announcement)\n\nBeyond & Impossible are both made from plant-derived ingredients and have a different molecular makeup than meat.))\n\n.\n\nBest wishes to you!!",
          "created_utc": 1719446882.0
        }
      ]
    },
    {
      "id": "lajl0co",
      "author": "SoftAffectionate591",
      "body": "I wouldn’t worry about a “label” for your eating preference. Just eat pescatarian plus chicken if it works well for you! Chicken used to work pretty well for me, at least skinless, boneless breast, but I just can’t do it anymore and it’s been a task to keep my protein up as I lift regularly. I’m glad you have something that works well for you!",
      "created_utc": 1719505809.0,
      "score": 2,
      "context": [
        {
          "id": "lafougg",
          "author": "None",
          "body": "I personally want to go pescatarian (basically vegetarian with the addition of seafoods) but I cannot escape chicken as, for me, it’s one of the easiest sources of protein for me to eat.",
          "created_utc": 1719441228.0
        }
      ]
    },
    {
      "id": "lagre8o",
      "author": "Shellyboms75",
      "body": "I feel a lot less spooked by plant based foods - Meat used to often freak me out, gristle, fat, any veins or anatomical stuff would put me right off.\n\nI do eat processed meat substitutes but I am so much more relaxed knowing I wont find bones or gross stuff in there.",
      "created_utc": 1719456103.0,
      "score": 3,
      "context": [
        {
          "id": "lageb1b",
          "author": "plastickghost",
          "body": "it hasn’t been hard for me, if anything helped me not be as scared/grossed out over food. most times i tend to eat the same safe foods over and over, but still hit all my goals for intake. it’s not as hard as a lot of people make it out to be, definitely a learning curve though",
          "created_utc": 1719450904.0
        }
      ]
    },
    {
      "id": "laj75p5",
      "author": "Nearby-Ad5666",
      "body": "This is a good point. My daughter has been vegetarian for 20 years. Her last pregnancy was really hard, she had to get several transfusions and had diabetes from the pregnancy which increased her risk of developing DB2 later. Her children are omnivores who don't eat pork, my SIL is Muslim so they have a pork free household. I gave a lot of sympathy for those who can't eat because of the thought of killing animals, I just know I'd be dead if I get any more restrictions on my diet.",
      "created_utc": 1719501289.0,
      "score": 2,
      "context": [
        {
          "id": "laheqxw",
          "author": "SnooSnoo96035",
          "body": "I eat carnivore with a major focus on ruminating animals.  I can't do carbs or sugar. Plants (fiber) upset my digestion, I'm allergic to legumes and have diverticulitis, so nothing with seeds either.  All those health problems came after being vegan, then raw vegan for YEARS.  \n\nI wish I could just have a balanced relationship with food.  Either extreme is still so restrictive.",
          "created_utc": 1719467869.0
        }
      ]
    },
    {
      "id": "laj7vnq",
      "author": "Nearby-Ad5666",
      "body": "Quorn isn't for everyone it's made with Fusarium venenatum which disagrees with some people. But it's only one meat replacement option.",
      "created_utc": 1719501527.0,
      "score": 1,
      "context": [
        {
          "id": "lahqh4a",
          "author": "dhcirkekcheia",
          "body": "I once had some messed up quorn so it put me right off meat substitutes, but I’d love to be vegetarian.\nI just don’t eat enough foods to be able to swing it, as I already don’t meet my nutritional needs",
          "created_utc": 1719475714.0
        }
      ]
    },
    {
      "id": "laj7g4s",
      "author": "Nearby-Ad5666",
      "body": "Meat thermometer will help! It's really great. I have trouble with tough chewy food and overcooked is hard for me. I don't want rare though I grew up with a family that loves very rare meat and runny eggs",
      "created_utc": 1719501384.0,
      "score": 2,
      "context": [
        {
          "id": "lafgnah",
          "author": "froggy21997",
          "body": "Yeah, I tried being vegetarian about 5 years ago because I wanted to cook for myself,  and I'm always worried about undercooking meat. My protein and B12 and iron intake were constantly lower than they were supposed to be, so I had to switch back to eating frozen meals with meat.",
          "created_utc": 1719438335.0
        }
      ]
    },
    {
      "id": "laj891r",
      "author": "Nearby-Ad5666",
      "body": "You can try to eat grass fed or grass fed local, there are ethical farms",
      "created_utc": 1719501650.0,
      "score": 1,
      "context": [
        {
          "id": "lafsq7e",
          "author": "No-Weird522",
          "body": "ive been told theres no reason why we cant just all be vegan but between my arfid and my stomach issues when i tried to be vegan i had almost nothing to eat. in theory yes we could survive as vegans but its so unpractical and hard for most people. chicken and eggs are my only protein source in my diet and im just kinda accepting theres nothing i can do, its not my fault the meat industry is bad and im doing what i can to stay healthy.",
          "created_utc": 1719442657.0
        }
      ]
    },
    {
      "id": "lagrstd",
      "author": "myangelhood",
      "body": "Lmfao",
      "created_utc": 1719456269.0,
      "score": 0,
      "context": [
        {
          "id": "lag1wx3",
          "author": "Emergency-Cookie-290",
          "body": "I think the trauma that comes with eating animals can do more damage to you and can make ARFRID harder to recover from, do you have any safe foods or foods you’re willing to try that are vegetarian? You could also take supplements if you’re lacking something",
          "created_utc": 1719446155.0
        }
      ]
    },
    {
      "id": "lai0mqf",
      "author": "SamTheDystopianRat",
      "body": "I'm in the UK so i might have different ones available. Birdseye Dippers worked very well for me, but my absolute favourite is VFC goujons. i freaked out when i first bit into them but then i remembered it's cause I'd forgotten the texture of chicken and that it was basically exact. i got my mum who still eats meat to confirm how realistic they were because I'm still shocked.",
      "created_utc": 1719482819.0,
      "score": 2,
      "context": [
        {
          "id": "lafiv4f",
          "author": "SamTheDystopianRat",
          "body": "i managed it. it might not be the best for me, but, if couldn't take eating the animals. i urge you to at least try the synthetic substitutes though. the chicken ones are phenomenal and they can convince me with my horrific sensory/textural issues, they might work for you too",
          "created_utc": 1719439096.0
        },
        {
          "id": "lagvg35",
          "author": "vampirelasagna",
          "body": "wrench unused flowery nine dolls market different air cooing mourn\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
          "created_utc": 1719457804.0
        }
      ]
    },
    {
      "id": "lb33lss",
      "author": "UniqueStrength4611",
      "body": "Just realized I replied to the wrong comment and idk if u get the notif for that so commenting here :)",
      "created_utc": 1719810685.0,
      "score": 1,
      "context": [
        {
          "id": "lafiv4f",
          "author": "SamTheDystopianRat",
          "body": "i managed it. it might not be the best for me, but, if couldn't take eating the animals. i urge you to at least try the synthetic substitutes though. the chicken ones are phenomenal and they can convince me with my horrific sensory/textural issues, they might work for you too",
          "created_utc": 1719439096.0
        },
        {
          "id": "lagvg35",
          "author": "vampirelasagna",
          "body": "wrench unused flowery nine dolls market different air cooing mourn\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
          "created_utc": 1719457804.0
        }
      ]
    },
    {
      "id": "lagdob9",
      "author": "Honeydewskyy20",
      "body": "Yesss I get that. Chicken nuggets used to be one of the safer foods I’d eat but it got knocked off a few years ago. But the feeling you described with the super processed food and not knowing it used to be alive definitely hit spot on for me!",
      "created_utc": 1719450655.0,
      "score": 5,
      "context": [
        {
          "id": "lafwuud",
          "author": "Honeydewskyy20",
          "body": "Meat textures has made me inadvertently a vegetarian. Just thinking about meat makes me nauseous. And yes, my doctor has said that I am showing signs of malnutrition. I have to take iron supplements and drink protein shakes daily.",
          "created_utc": 1719444212.0
        },
        {
          "id": "laga7m1",
          "author": "bfaithr",
          "body": "I’m trying to keep meat in my diet and it’s so hard. I can really only tolerate meat that’s so processed that I can’t tell it used to be alive (I’m writing this while eating McNuggets). And even then, I can only eat meat like twice a month",
          "created_utc": 1719449335.0
        }
      ]
    },
    {
      "id": "laj5v4m",
      "author": "Nearby-Ad5666",
      "body": "That's amazing you can eat that way with a restrictive ED. I need the variety of fruit, veg, meat eggs dairy just to get enough calories sustain me. Mine is adult onset and a big part is loss of most of my sense of taste and choking. Since nothing tastes amazing anymore I look to texture and variety. I eat nuts and granola type things and add hemp hearts into stuff.",
      "created_utc": 1719500860.0,
      "score": 3,
      "context": [
        {
          "id": "laglph5",
          "author": "mydogisagoblin",
          "body": "I’m a vegan and will never go back. I actually feel like I have more options as a vegan because I was always getting grossed out by animal products in my food. I’m more willing to try new things if they are vegan because I know none of that stuff is in it., if that makes sense.",
          "created_utc": 1719453807.0
        },
        {
          "id": "lagmeto",
          "author": "mydogisagoblin",
          "body": "Wanted to add that I've been vegan for almost 6 years and was vegetarian for 12 before that, and have never had any signs of malnutrition and i get a checkup yearly at the doctor, which involves blood tests and everything. So it can be done!",
          "created_utc": 1719454088.0
        }
      ]
    },
    {
      "id": "laifqrl",
      "author": "Honeydewskyy20",
      "body": "Please tell me how you eat as a vegetarian. Doctor states I’m nutrient deficient and recommended iron supplements based on my last blood test. I go back in September for another round of tests and hoping for better numbers. I take the supplements and I added shakes to my diet and I’m trying to do better overall but I often find myself back in old habits of only eating the foods I know I can rely on or not eating at all.",
      "created_utc": 1719491041.0,
      "score": 1,
      "context": [
        {
          "id": "laglph5",
          "author": "mydogisagoblin",
          "body": "I’m a vegan and will never go back. I actually feel like I have more options as a vegan because I was always getting grossed out by animal products in my food. I’m more willing to try new things if they are vegan because I know none of that stuff is in it., if that makes sense.",
          "created_utc": 1719453807.0
        },
        {
          "id": "lagmeto",
          "author": "mydogisagoblin",
          "body": "Wanted to add that I've been vegan for almost 6 years and was vegetarian for 12 before that, and have never had any signs of malnutrition and i get a checkup yearly at the doctor, which involves blood tests and everything. So it can be done!",
          "created_utc": 1719454088.0
        }
      ]
    },
    {
      "id": "lagt0yp",
      "author": "LeakyFountainPen",
      "body": "Yeah, I don't know if I ever plan on eating the lab-grown stuff for myself just bc I never really LOVED meat texture to begin with.\n\nBut I'm ALL IN on it as a concept, not only for meat-eaters or people with medical/sensory issues BUT ALSO for dog & cat food (& other predator pets, like snakes)\n\nIt's gonna be a game-changer regardless 🏆",
      "created_utc": 1719456775.0,
      "score": 2,
      "context": [
        {
          "id": "lag3snj",
          "author": "LeakyFountainPen",
          "body": "Oh man, yeah, it was a struggle. The first time I tried to go vegetarian as a teen,  I ended up cutting out like...90% of my menu. I drank a lot of protein shakes back then, lol. Eventually my parents had to put the foot down.\n\nBut!! A few years later, I managed to make the jump with a broader menu and a better game-plan.\n\n*One thing I will say is that it's not a zero-sum game. You can try cutting out more and more meats over the course of several years as your safe-menu expands.*\n\nMaybe a \"Meatless Mondays\" method, followed by \"Meatless Monday & Tuesday\" and slowly build from there.\n\nAlso, if you're concerned with texture, I will say: I LOVE the fake meat textures because they're always so consistent. I used to spend 50% of my meat-prep and meat-eating cutting out gristle and white strips and dark spots and bits with Wrong Texture, and worries about skin and bone and 9 million other things. But the veggie meats don't have ANY of that and it's SUCH a relief to my ARFID.\n\nI would suggest starting with \"Impossible\" brand chicken nuggets to start. They're so handy and yummy and they're fairly similar to normal bake-at-home nuggets. They're probably my favorite fake meat.\n\nI've also found that the joys of making veggie burgers at home (not the Beyond or Impossible, but from scratch) is that I can dial in the EXACT texture I want. A tablespoon of extra rice or a dash of tomato sauce can make a WORLD of difference for my specific texture needs.\n\n.\n\n((Also, Beyond Meat isn't lab-grown, the lab-grown stuff is still in development for commercial sale in the US (unless I missed a HUGE announcement)\n\nBeyond & Impossible are both made from plant-derived ingredients and have a different molecular makeup than meat.))\n\n.\n\nBest wishes to you!!",
          "created_utc": 1719446882.0
        },
        {
          "id": "lagrmal",
          "author": "myangelhood",
          "body": "The lab grown stuff seems promising for a food as energy dense as meat, but it seems like theyre trying to market it to meat eaters by adding the gross and inconsistent parts of meat… even saw a clip of a fake steak with fake myoglobin…",
          "created_utc": 1719456194.0
        }
      ]
    },
    {
      "id": "lal3o59",
      "author": "dhcirkekcheia",
      "body": "Ah it wasn’t that it didn’t agree with me, it just had black plastic-y rubber-y things in it and I was too grossed out to try it again",
      "created_utc": 1719523551.0,
      "score": 1,
      "context": [
        {
          "id": "lahqh4a",
          "author": "dhcirkekcheia",
          "body": "I once had some messed up quorn so it put me right off meat substitutes, but I’d love to be vegetarian.\nI just don’t eat enough foods to be able to swing it, as I already don’t meet my nutritional needs",
          "created_utc": 1719475714.0
        },
        {
          "id": "laj7vnq",
          "author": "Nearby-Ad5666",
          "body": "Quorn isn't for everyone it's made with Fusarium venenatum which disagrees with some people. But it's only one meat replacement option.",
          "created_utc": 1719501527.0
        }
      ]
    },
    {
      "id": "lb33cc6",
      "author": "UniqueStrength4611",
      "body": "I don’t remember what the brand name is (I’ll try and look into it) but when I was younger I had these AMAZING chicken nuggets and I’ve eaten them forever only to find out that they were fake fish sticks this whole time- (I found out two years ago- I had eaten them for 5 years at that point) they taste exactly like the real thing I’m in the us so I don’t know if they have it where u live (if where u live is not in the us) but if I remember the name I’ll get back to u",
      "created_utc": 1719810533.0,
      "score": 1,
      "context": [
        {
          "id": "lafiv4f",
          "author": "SamTheDystopianRat",
          "body": "i managed it. it might not be the best for me, but, if couldn't take eating the animals. i urge you to at least try the synthetic substitutes though. the chicken ones are phenomenal and they can convince me with my horrific sensory/textural issues, they might work for you too",
          "created_utc": 1719439096.0
        },
        {
          "id": "lagvg35",
          "author": "vampirelasagna",
          "body": "wrench unused flowery nine dolls market different air cooing mourn\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
          "created_utc": 1719457804.0
        },
        {
          "id": "lai0mqf",
          "author": "SamTheDystopianRat",
          "body": "I'm in the UK so i might have different ones available. Birdseye Dippers worked very well for me, but my absolute favourite is VFC goujons. i freaked out when i first bit into them but then i remembered it's cause I'd forgotten the texture of chicken and that it was basically exact. i got my mum who still eats meat to confirm how realistic they were because I'm still shocked.",
          "created_utc": 1719482819.0
        }
      ]
    },
    {
      "id": "laj7cm7",
      "author": "mydogisagoblin",
      "body": "I think that's great! I have a much more bland diet than anyone I know, and it is also restrictive (and becoming more so as I am disliking more and more), but the few things I do like are good enough I guess. Almost everything I eat has to be customized in some way, so I don't eat out much, and make a lot of things at home with my own tastes in mind. Like I can't stand the taste of oregano, which is seemingly in almost everything, and I can't eat anything with spice/heat, anything with much fat/oil (I had my gallbladder removed when I was 15, and I have IBS, so fat is a no-go) and I have a lot of issues with texture... so it's tough. But I’m an ethical vegan, and do it all for the animals, so I always feel that my discomfort is not worth an animal's suffering. Makes it easier to stick to it and find a way. I also have a vegan dietician that I meet up with a couple times a year to help me with it all.\n\nSide note: check out the vegan Babybel cheeses. They are a great snack!\n\nI also think it helps to live in a town where the grocery stores carry a lot of vegan options. I can definitely see it being more difficult if I didn't have as much access. \n\nIf you ever have any questions about any of it let me know! As I said, I've been at this a long time!",
      "created_utc": 1719501352.0,
      "score": 2,
      "context": [
        {
          "id": "laglph5",
          "author": "mydogisagoblin",
          "body": "I’m a vegan and will never go back. I actually feel like I have more options as a vegan because I was always getting grossed out by animal products in my food. I’m more willing to try new things if they are vegan because I know none of that stuff is in it., if that makes sense.",
          "created_utc": 1719453807.0
        },
        {
          "id": "lagmeto",
          "author": "mydogisagoblin",
          "body": "Wanted to add that I've been vegan for almost 6 years and was vegetarian for 12 before that, and have never had any signs of malnutrition and i get a checkup yearly at the doctor, which involves blood tests and everything. So it can be done!",
          "created_utc": 1719454088.0
        },
        {
          "id": "laj5v4m",
          "author": "Nearby-Ad5666",
          "body": "That's amazing you can eat that way with a restrictive ED. I need the variety of fruit, veg, meat eggs dairy just to get enough calories sustain me. Mine is adult onset and a big part is loss of most of my sense of taste and choking. Since nothing tastes amazing anymore I look to texture and variety. I eat nuts and granola type things and add hemp hearts into stuff.",
          "created_utc": 1719500860.0
        }
      ]
    },
    {
      "id": "laiylb8",
      "author": "mydogisagoblin",
      "body": "I am a vegan, not a vegetarian (I eat no dairy, meat, honey... anything that has any animal derived ingredients, and I own no leather, wool, etc. and go to no zoos, aquariums, elephant rides, nothing that involves benefitting from animals for my entertainment), but I just eat a very varied diet. I am AuDHD (more ADHD in general) and get bored of foods after one meal so I rarely eat the same thing twice in one week. I eat vegan meal replacement shakes every morning with either oat or soy milk. For lunch I usually snack. Sometimes it's a lightlife hot dog, sometimes it's a clif bar, sometimes it's a smoothie. One of my safest foods is a pb&j on a tortilla. Then for dinner I eat whatever sounds good. Sometimes it's Thai food (they can make a lot of their meals vegan if you ask), Taco Bell bean burritos without cheese, sometimes it's mashed potatoes and corn with a homemade vegan brown gravy, homemade pizza, we found a recipe for an amazing vegan queso... \n\nI eat a TON of beans. I add beans to my queso, my salads, everywhere I can. They contain amino acids, protein, fat, carbs... they are great!\n\nIt takes more effort to learn how to eat vegan for sure, but my husband and I are both vegan which helps a lot and after you figure it out, it becomes much easier.  And I’m not saying that all of that is the healthiest of food, but neither of us have ever been nutritionally deficient. Oh and I take a vegan multivitamin and a vegan (algae oil) omega 3/6/9 daily.",
      "created_utc": 1719498397.0,
      "score": 2,
      "context": [
        {
          "id": "laglph5",
          "author": "mydogisagoblin",
          "body": "I’m a vegan and will never go back. I actually feel like I have more options as a vegan because I was always getting grossed out by animal products in my food. I’m more willing to try new things if they are vegan because I know none of that stuff is in it., if that makes sense.",
          "created_utc": 1719453807.0
        },
        {
          "id": "lagmeto",
          "author": "mydogisagoblin",
          "body": "Wanted to add that I've been vegan for almost 6 years and was vegetarian for 12 before that, and have never had any signs of malnutrition and i get a checkup yearly at the doctor, which involves blood tests and everything. So it can be done!",
          "created_utc": 1719454088.0
        },
        {
          "id": "laifqrl",
          "author": "Honeydewskyy20",
          "body": "Please tell me how you eat as a vegetarian. Doctor states I’m nutrient deficient and recommended iron supplements based on my last blood test. I go back in September for another round of tests and hoping for better numbers. I take the supplements and I added shakes to my diet and I’m trying to do better overall but I often find myself back in old habits of only eating the foods I know I can rely on or not eating at all.",
          "created_utc": 1719491041.0
        }
      ]
    },
    {
      "id": "laj8xtq",
      "author": "Nearby-Ad5666",
      "body": "I can't do vegan but I applaud you for regularly seeing a dietician for advice. And having vegan options readily available is a real help. My sil is Pesctarian and eats a lot of veggie burgers and things like that too",
      "created_utc": 1719501875.0,
      "score": 1,
      "context": [
        {
          "id": "laglph5",
          "author": "mydogisagoblin",
          "body": "I’m a vegan and will never go back. I actually feel like I have more options as a vegan because I was always getting grossed out by animal products in my food. I’m more willing to try new things if they are vegan because I know none of that stuff is in it., if that makes sense.",
          "created_utc": 1719453807.0
        },
        {
          "id": "lagmeto",
          "author": "mydogisagoblin",
          "body": "Wanted to add that I've been vegan for almost 6 years and was vegetarian for 12 before that, and have never had any signs of malnutrition and i get a checkup yearly at the doctor, which involves blood tests and everything. So it can be done!",
          "created_utc": 1719454088.0
        },
        {
          "id": "laj5v4m",
          "author": "Nearby-Ad5666",
          "body": "That's amazing you can eat that way with a restrictive ED. I need the variety of fruit, veg, meat eggs dairy just to get enough calories sustain me. Mine is adult onset and a big part is loss of most of my sense of taste and choking. Since nothing tastes amazing anymore I look to texture and variety. I eat nuts and granola type things and add hemp hearts into stuff.",
          "created_utc": 1719500860.0
        },
        {
          "id": "laj7cm7",
          "author": "mydogisagoblin",
          "body": "I think that's great! I have a much more bland diet than anyone I know, and it is also restrictive (and becoming more so as I am disliking more and more), but the few things I do like are good enough I guess. Almost everything I eat has to be customized in some way, so I don't eat out much, and make a lot of things at home with my own tastes in mind. Like I can't stand the taste of oregano, which is seemingly in almost everything, and I can't eat anything with spice/heat, anything with much fat/oil (I had my gallbladder removed when I was 15, and I have IBS, so fat is a no-go) and I have a lot of issues with texture... so it's tough. But I’m an ethical vegan, and do it all for the animals, so I always feel that my discomfort is not worth an animal's suffering. Makes it easier to stick to it and find a way. I also have a vegan dietician that I meet up with a couple times a year to help me with it all.\n\nSide note: check out the vegan Babybel cheeses. They are a great snack!\n\nI also think it helps to live in a town where the grocery stores carry a lot of vegan options. I can definitely see it being more difficult if I didn't have as much access. \n\nIf you ever have any questions about any of it let me know! As I said, I've been at this a long time!",
          "created_utc": 1719501352.0
        }
      ]
    },
    {
      "id": "laj65xp",
      "author": "Nearby-Ad5666",
      "body": "I just bought the algae oil omega 3 supplement. The capsules are nicely sized and easy to swallow",
      "created_utc": 1719500959.0,
      "score": 1,
      "context": [
        {
          "id": "laglph5",
          "author": "mydogisagoblin",
          "body": "I’m a vegan and will never go back. I actually feel like I have more options as a vegan because I was always getting grossed out by animal products in my food. I’m more willing to try new things if they are vegan because I know none of that stuff is in it., if that makes sense.",
          "created_utc": 1719453807.0
        },
        {
          "id": "lagmeto",
          "author": "mydogisagoblin",
          "body": "Wanted to add that I've been vegan for almost 6 years and was vegetarian for 12 before that, and have never had any signs of malnutrition and i get a checkup yearly at the doctor, which involves blood tests and everything. So it can be done!",
          "created_utc": 1719454088.0
        },
        {
          "id": "laifqrl",
          "author": "Honeydewskyy20",
          "body": "Please tell me how you eat as a vegetarian. Doctor states I’m nutrient deficient and recommended iron supplements based on my last blood test. I go back in September for another round of tests and hoping for better numbers. I take the supplements and I added shakes to my diet and I’m trying to do better overall but I often find myself back in old habits of only eating the foods I know I can rely on or not eating at all.",
          "created_utc": 1719491041.0
        },
        {
          "id": "laiylb8",
          "author": "mydogisagoblin",
          "body": "I am a vegan, not a vegetarian (I eat no dairy, meat, honey... anything that has any animal derived ingredients, and I own no leather, wool, etc. and go to no zoos, aquariums, elephant rides, nothing that involves benefitting from animals for my entertainment), but I just eat a very varied diet. I am AuDHD (more ADHD in general) and get bored of foods after one meal so I rarely eat the same thing twice in one week. I eat vegan meal replacement shakes every morning with either oat or soy milk. For lunch I usually snack. Sometimes it's a lightlife hot dog, sometimes it's a clif bar, sometimes it's a smoothie. One of my safest foods is a pb&j on a tortilla. Then for dinner I eat whatever sounds good. Sometimes it's Thai food (they can make a lot of their meals vegan if you ask), Taco Bell bean burritos without cheese, sometimes it's mashed potatoes and corn with a homemade vegan brown gravy, homemade pizza, we found a recipe for an amazing vegan queso... \n\nI eat a TON of beans. I add beans to my queso, my salads, everywhere I can. They contain amino acids, protein, fat, carbs... they are great!\n\nIt takes more effort to learn how to eat vegan for sure, but my husband and I are both vegan which helps a lot and after you figure it out, it becomes much easier.  And I’m not saying that all of that is the healthiest of food, but neither of us have ever been nutritionally deficient. Oh and I take a vegan multivitamin and a vegan (algae oil) omega 3/6/9 daily.",
          "created_utc": 1719498397.0
        }
      ]
    },
    {
      "id": "laj7nef",
      "author": "mydogisagoblin",
      "body": "Absolutely! They contain the same quality (or better) of omegas without the fish being involved at all! I promote them all the time for people that are open to them!",
      "created_utc": 1719501451.0,
      "score": 1,
      "context": [
        {
          "id": "laglph5",
          "author": "mydogisagoblin",
          "body": "I’m a vegan and will never go back. I actually feel like I have more options as a vegan because I was always getting grossed out by animal products in my food. I’m more willing to try new things if they are vegan because I know none of that stuff is in it., if that makes sense.",
          "created_utc": 1719453807.0
        },
        {
          "id": "lagmeto",
          "author": "mydogisagoblin",
          "body": "Wanted to add that I've been vegan for almost 6 years and was vegetarian for 12 before that, and have never had any signs of malnutrition and i get a checkup yearly at the doctor, which involves blood tests and everything. So it can be done!",
          "created_utc": 1719454088.0
        },
        {
          "id": "laifqrl",
          "author": "Honeydewskyy20",
          "body": "Please tell me how you eat as a vegetarian. Doctor states I’m nutrient deficient and recommended iron supplements based on my last blood test. I go back in September for another round of tests and hoping for better numbers. I take the supplements and I added shakes to my diet and I’m trying to do better overall but I often find myself back in old habits of only eating the foods I know I can rely on or not eating at all.",
          "created_utc": 1719491041.0
        },
        {
          "id": "laiylb8",
          "author": "mydogisagoblin",
          "body": "I am a vegan, not a vegetarian (I eat no dairy, meat, honey... anything that has any animal derived ingredients, and I own no leather, wool, etc. and go to no zoos, aquariums, elephant rides, nothing that involves benefitting from animals for my entertainment), but I just eat a very varied diet. I am AuDHD (more ADHD in general) and get bored of foods after one meal so I rarely eat the same thing twice in one week. I eat vegan meal replacement shakes every morning with either oat or soy milk. For lunch I usually snack. Sometimes it's a lightlife hot dog, sometimes it's a clif bar, sometimes it's a smoothie. One of my safest foods is a pb&j on a tortilla. Then for dinner I eat whatever sounds good. Sometimes it's Thai food (they can make a lot of their meals vegan if you ask), Taco Bell bean burritos without cheese, sometimes it's mashed potatoes and corn with a homemade vegan brown gravy, homemade pizza, we found a recipe for an amazing vegan queso... \n\nI eat a TON of beans. I add beans to my queso, my salads, everywhere I can. They contain amino acids, protein, fat, carbs... they are great!\n\nIt takes more effort to learn how to eat vegan for sure, but my husband and I are both vegan which helps a lot and after you figure it out, it becomes much easier.  And I’m not saying that all of that is the healthiest of food, but neither of us have ever been nutritionally deficient. Oh and I take a vegan multivitamin and a vegan (algae oil) omega 3/6/9 daily.",
          "created_utc": 1719498397.0
        },
        {
          "id": "laj65xp",
          "author": "Nearby-Ad5666",
          "body": "I just bought the algae oil omega 3 supplement. The capsules are nicely sized and easy to swallow",
          "created_utc": 1719500959.0
        }
      ]
    },
    {
      "id": "laj8gy8",
      "author": "Nearby-Ad5666",
      "body": "My husband takes these giant fish oil pills. I just can't swallow them. I use chewable magnesium because those capsules are too big.",
      "created_utc": 1719501722.0,
      "score": 1,
      "context": [
        {
          "id": "laglph5",
          "author": "mydogisagoblin",
          "body": "I’m a vegan and will never go back. I actually feel like I have more options as a vegan because I was always getting grossed out by animal products in my food. I’m more willing to try new things if they are vegan because I know none of that stuff is in it., if that makes sense.",
          "created_utc": 1719453807.0
        },
        {
          "id": "lagmeto",
          "author": "mydogisagoblin",
          "body": "Wanted to add that I've been vegan for almost 6 years and was vegetarian for 12 before that, and have never had any signs of malnutrition and i get a checkup yearly at the doctor, which involves blood tests and everything. So it can be done!",
          "created_utc": 1719454088.0
        },
        {
          "id": "laifqrl",
          "author": "Honeydewskyy20",
          "body": "Please tell me how you eat as a vegetarian. Doctor states I’m nutrient deficient and recommended iron supplements based on my last blood test. I go back in September for another round of tests and hoping for better numbers. I take the supplements and I added shakes to my diet and I’m trying to do better overall but I often find myself back in old habits of only eating the foods I know I can rely on or not eating at all.",
          "created_utc": 1719491041.0
        },
        {
          "id": "laiylb8",
          "author": "mydogisagoblin",
          "body": "I am a vegan, not a vegetarian (I eat no dairy, meat, honey... anything that has any animal derived ingredients, and I own no leather, wool, etc. and go to no zoos, aquariums, elephant rides, nothing that involves benefitting from animals for my entertainment), but I just eat a very varied diet. I am AuDHD (more ADHD in general) and get bored of foods after one meal so I rarely eat the same thing twice in one week. I eat vegan meal replacement shakes every morning with either oat or soy milk. For lunch I usually snack. Sometimes it's a lightlife hot dog, sometimes it's a clif bar, sometimes it's a smoothie. One of my safest foods is a pb&j on a tortilla. Then for dinner I eat whatever sounds good. Sometimes it's Thai food (they can make a lot of their meals vegan if you ask), Taco Bell bean burritos without cheese, sometimes it's mashed potatoes and corn with a homemade vegan brown gravy, homemade pizza, we found a recipe for an amazing vegan queso... \n\nI eat a TON of beans. I add beans to my queso, my salads, everywhere I can. They contain amino acids, protein, fat, carbs... they are great!\n\nIt takes more effort to learn how to eat vegan for sure, but my husband and I are both vegan which helps a lot and after you figure it out, it becomes much easier.  And I’m not saying that all of that is the healthiest of food, but neither of us have ever been nutritionally deficient. Oh and I take a vegan multivitamin and a vegan (algae oil) omega 3/6/9 daily.",
          "created_utc": 1719498397.0
        },
        {
          "id": "laj65xp",
          "author": "Nearby-Ad5666",
          "body": "I just bought the algae oil omega 3 supplement. The capsules are nicely sized and easy to swallow",
          "created_utc": 1719500959.0
        },
        {
          "id": "laj7nef",
          "author": "mydogisagoblin",
          "body": "Absolutely! They contain the same quality (or better) of omegas without the fish being involved at all! I promote them all the time for people that are open to them!",
          "created_utc": 1719501451.0
        }
      ]
    },
    {
      "id": "laj9hbm",
      "author": "mydogisagoblin",
      "body": "I agree. I can't do large pills either. And as soon as I have a bad experience with something like that, it's like my brain says \"never again\" and I am unable to try again. Very frustrating, but I’m told this is part of the ARFID.",
      "created_utc": 1719502050.0,
      "score": 3,
      "context": [
        {
          "id": "laglph5",
          "author": "mydogisagoblin",
          "body": "I’m a vegan and will never go back. I actually feel like I have more options as a vegan because I was always getting grossed out by animal products in my food. I’m more willing to try new things if they are vegan because I know none of that stuff is in it., if that makes sense.",
          "created_utc": 1719453807.0
        },
        {
          "id": "lagmeto",
          "author": "mydogisagoblin",
          "body": "Wanted to add that I've been vegan for almost 6 years and was vegetarian for 12 before that, and have never had any signs of malnutrition and i get a checkup yearly at the doctor, which involves blood tests and everything. So it can be done!",
          "created_utc": 1719454088.0
        },
        {
          "id": "laifqrl",
          "author": "Honeydewskyy20",
          "body": "Please tell me how you eat as a vegetarian. Doctor states I’m nutrient deficient and recommended iron supplements based on my last blood test. I go back in September for another round of tests and hoping for better numbers. I take the supplements and I added shakes to my diet and I’m trying to do better overall but I often find myself back in old habits of only eating the foods I know I can rely on or not eating at all.",
          "created_utc": 1719491041.0
        },
        {
          "id": "laiylb8",
          "author": "mydogisagoblin",
          "body": "I am a vegan, not a vegetarian (I eat no dairy, meat, honey... anything that has any animal derived ingredients, and I own no leather, wool, etc. and go to no zoos, aquariums, elephant rides, nothing that involves benefitting from animals for my entertainment), but I just eat a very varied diet. I am AuDHD (more ADHD in general) and get bored of foods after one meal so I rarely eat the same thing twice in one week. I eat vegan meal replacement shakes every morning with either oat or soy milk. For lunch I usually snack. Sometimes it's a lightlife hot dog, sometimes it's a clif bar, sometimes it's a smoothie. One of my safest foods is a pb&j on a tortilla. Then for dinner I eat whatever sounds good. Sometimes it's Thai food (they can make a lot of their meals vegan if you ask), Taco Bell bean burritos without cheese, sometimes it's mashed potatoes and corn with a homemade vegan brown gravy, homemade pizza, we found a recipe for an amazing vegan queso... \n\nI eat a TON of beans. I add beans to my queso, my salads, everywhere I can. They contain amino acids, protein, fat, carbs... they are great!\n\nIt takes more effort to learn how to eat vegan for sure, but my husband and I are both vegan which helps a lot and after you figure it out, it becomes much easier.  And I’m not saying that all of that is the healthiest of food, but neither of us have ever been nutritionally deficient. Oh and I take a vegan multivitamin and a vegan (algae oil) omega 3/6/9 daily.",
          "created_utc": 1719498397.0
        },
        {
          "id": "laj65xp",
          "author": "Nearby-Ad5666",
          "body": "I just bought the algae oil omega 3 supplement. The capsules are nicely sized and easy to swallow",
          "created_utc": 1719500959.0
        },
        {
          "id": "laj7nef",
          "author": "mydogisagoblin",
          "body": "Absolutely! They contain the same quality (or better) of omegas without the fish being involved at all! I promote them all the time for people that are open to them!",
          "created_utc": 1719501451.0
        },
        {
          "id": "laj8gy8",
          "author": "Nearby-Ad5666",
          "body": "My husband takes these giant fish oil pills. I just can't swallow them. I use chewable magnesium because those capsules are too big.",
          "created_utc": 1719501722.0
        }
      ]
    },
    {
      "id": "laja45f",
      "author": "Nearby-Ad5666",
      "body": "It certainly can be. I have dismotility which means my esophagus doesn't work properly all the time",
      "created_utc": 1719502253.0,
      "score": 1,
      "context": [
        {
          "id": "laglph5",
          "author": "mydogisagoblin",
          "body": "I’m a vegan and will never go back. I actually feel like I have more options as a vegan because I was always getting grossed out by animal products in my food. I’m more willing to try new things if they are vegan because I know none of that stuff is in it., if that makes sense.",
          "created_utc": 1719453807.0
        },
        {
          "id": "lagmeto",
          "author": "mydogisagoblin",
          "body": "Wanted to add that I've been vegan for almost 6 years and was vegetarian for 12 before that, and have never had any signs of malnutrition and i get a checkup yearly at the doctor, which involves blood tests and everything. So it can be done!",
          "created_utc": 1719454088.0
        },
        {
          "id": "laifqrl",
          "author": "Honeydewskyy20",
          "body": "Please tell me how you eat as a vegetarian. Doctor states I’m nutrient deficient and recommended iron supplements based on my last blood test. I go back in September for another round of tests and hoping for better numbers. I take the supplements and I added shakes to my diet and I’m trying to do better overall but I often find myself back in old habits of only eating the foods I know I can rely on or not eating at all.",
          "created_utc": 1719491041.0
        },
        {
          "id": "laiylb8",
          "author": "mydogisagoblin",
          "body": "I am a vegan, not a vegetarian (I eat no dairy, meat, honey... anything that has any animal derived ingredients, and I own no leather, wool, etc. and go to no zoos, aquariums, elephant rides, nothing that involves benefitting from animals for my entertainment), but I just eat a very varied diet. I am AuDHD (more ADHD in general) and get bored of foods after one meal so I rarely eat the same thing twice in one week. I eat vegan meal replacement shakes every morning with either oat or soy milk. For lunch I usually snack. Sometimes it's a lightlife hot dog, sometimes it's a clif bar, sometimes it's a smoothie. One of my safest foods is a pb&j on a tortilla. Then for dinner I eat whatever sounds good. Sometimes it's Thai food (they can make a lot of their meals vegan if you ask), Taco Bell bean burritos without cheese, sometimes it's mashed potatoes and corn with a homemade vegan brown gravy, homemade pizza, we found a recipe for an amazing vegan queso... \n\nI eat a TON of beans. I add beans to my queso, my salads, everywhere I can. They contain amino acids, protein, fat, carbs... they are great!\n\nIt takes more effort to learn how to eat vegan for sure, but my husband and I are both vegan which helps a lot and after you figure it out, it becomes much easier.  And I’m not saying that all of that is the healthiest of food, but neither of us have ever been nutritionally deficient. Oh and I take a vegan multivitamin and a vegan (algae oil) omega 3/6/9 daily.",
          "created_utc": 1719498397.0
        },
        {
          "id": "laj65xp",
          "author": "Nearby-Ad5666",
          "body": "I just bought the algae oil omega 3 supplement. The capsules are nicely sized and easy to swallow",
          "created_utc": 1719500959.0
        },
        {
          "id": "laj7nef",
          "author": "mydogisagoblin",
          "body": "Absolutely! They contain the same quality (or better) of omegas without the fish being involved at all! I promote them all the time for people that are open to them!",
          "created_utc": 1719501451.0
        },
        {
          "id": "laj8gy8",
          "author": "Nearby-Ad5666",
          "body": "My husband takes these giant fish oil pills. I just can't swallow them. I use chewable magnesium because those capsules are too big.",
          "created_utc": 1719501722.0
        },
        {
          "id": "laj9hbm",
          "author": "mydogisagoblin",
          "body": "I agree. I can't do large pills either. And as soon as I have a bad experience with something like that, it's like my brain says \"never again\" and I am unable to try again. Very frustrating, but I’m told this is part of the ARFID.",
          "created_utc": 1719502050.0
        }
      ]
    },
    {
      "id": "lajazb6",
      "author": "mydogisagoblin",
      "body": "Oh man, that's gotta be so frustrating! I’m sorry you have to deal with that!",
      "created_utc": 1719502538.0,
      "score": 2,
      "context": [
        {
          "id": "laglph5",
          "author": "mydogisagoblin",
          "body": "I’m a vegan and will never go back. I actually feel like I have more options as a vegan because I was always getting grossed out by animal products in my food. I’m more willing to try new things if they are vegan because I know none of that stuff is in it., if that makes sense.",
          "created_utc": 1719453807.0
        },
        {
          "id": "lagmeto",
          "author": "mydogisagoblin",
          "body": "Wanted to add that I've been vegan for almost 6 years and was vegetarian for 12 before that, and have never had any signs of malnutrition and i get a checkup yearly at the doctor, which involves blood tests and everything. So it can be done!",
          "created_utc": 1719454088.0
        },
        {
          "id": "laifqrl",
          "author": "Honeydewskyy20",
          "body": "Please tell me how you eat as a vegetarian. Doctor states I’m nutrient deficient and recommended iron supplements based on my last blood test. I go back in September for another round of tests and hoping for better numbers. I take the supplements and I added shakes to my diet and I’m trying to do better overall but I often find myself back in old habits of only eating the foods I know I can rely on or not eating at all.",
          "created_utc": 1719491041.0
        },
        {
          "id": "laiylb8",
          "author": "mydogisagoblin",
          "body": "I am a vegan, not a vegetarian (I eat no dairy, meat, honey... anything that has any animal derived ingredients, and I own no leather, wool, etc. and go to no zoos, aquariums, elephant rides, nothing that involves benefitting from animals for my entertainment), but I just eat a very varied diet. I am AuDHD (more ADHD in general) and get bored of foods after one meal so I rarely eat the same thing twice in one week. I eat vegan meal replacement shakes every morning with either oat or soy milk. For lunch I usually snack. Sometimes it's a lightlife hot dog, sometimes it's a clif bar, sometimes it's a smoothie. One of my safest foods is a pb&j on a tortilla. Then for dinner I eat whatever sounds good. Sometimes it's Thai food (they can make a lot of their meals vegan if you ask), Taco Bell bean burritos without cheese, sometimes it's mashed potatoes and corn with a homemade vegan brown gravy, homemade pizza, we found a recipe for an amazing vegan queso... \n\nI eat a TON of beans. I add beans to my queso, my salads, everywhere I can. They contain amino acids, protein, fat, carbs... they are great!\n\nIt takes more effort to learn how to eat vegan for sure, but my husband and I are both vegan which helps a lot and after you figure it out, it becomes much easier.  And I’m not saying that all of that is the healthiest of food, but neither of us have ever been nutritionally deficient. Oh and I take a vegan multivitamin and a vegan (algae oil) omega 3/6/9 daily.",
          "created_utc": 1719498397.0
        },
        {
          "id": "laj65xp",
          "author": "Nearby-Ad5666",
          "body": "I just bought the algae oil omega 3 supplement. The capsules are nicely sized and easy to swallow",
          "created_utc": 1719500959.0
        },
        {
          "id": "laj7nef",
          "author": "mydogisagoblin",
          "body": "Absolutely! They contain the same quality (or better) of omegas without the fish being involved at all! I promote them all the time for people that are open to them!",
          "created_utc": 1719501451.0
        },
        {
          "id": "laj8gy8",
          "author": "Nearby-Ad5666",
          "body": "My husband takes these giant fish oil pills. I just can't swallow them. I use chewable magnesium because those capsules are too big.",
          "created_utc": 1719501722.0
        },
        {
          "id": "laj9hbm",
          "author": "mydogisagoblin",
          "body": "I agree. I can't do large pills either. And as soon as I have a bad experience with something like that, it's like my brain says \"never again\" and I am unable to try again. Very frustrating, but I’m told this is part of the ARFID.",
          "created_utc": 1719502050.0
        },
        {
          "id": "laja45f",
          "author": "Nearby-Ad5666",
          "body": "It certainly can be. I have dismotility which means my esophagus doesn't work properly all the time",
          "created_utc": 1719502253.0
        }
      ]
    }
  ]
}