{
  "id": "1e13w5j",
  "subreddit": "ARFID",
  "author": "epelthins",
  "created_utc": 1720743368.0,
  "title": "I ate a strawberry during therapy!",
  "selftext": "This was yesterday. I’ve been wanting to do exposure therapy with some new foods, and strawberries was top of my list. My family members eat them a lot and it made me feel kinda silly when I would replace it with chocolate or something. \n\nSo I ate one! I gagged a little bit while I did it, but I ate the whole thing! It doesn’t taste that bad either!! It was a little sour but like in a good way. The seeds didn’t even freak me out the way I thought they would! \n\nIdk I’m just really happy about it :)",
  "url": "https://www.reddit.com/r/ARFID/comments/1e13w5j/i_ate_a_strawberry_during_therapy/",
  "score": 148,
  "num_comments": 16,
  "comments": [
    {
      "id": "lcrg0am",
      "author": "Nearby-Ad5666",
      "body": "They can get pretty bland or tart. Fresh are best",
      "created_utc": 1720744403.0,
      "score": 27,
      "context": []
    },
    {
      "id": "lcrh016",
      "author": "Erisaiya",
      "body": "I always dip mine in sugar! I love them that way. Congrats!",
      "created_utc": 1720744784.0,
      "score": 17,
      "context": []
    },
    {
      "id": "lcrovam",
      "author": "BirdsNeedNames",
      "body": "congrats!!! whether or not strawberries become part of your regular diet now, trying and finishing one was certainly an accomplishment. strawberries for me are a food where i quite like the flavor but can't stand the texture (see also: omelettes, sauteed onions, most nuts). my family also eats a lot of them, and i typically only partake when we can get local in-season strawberries (better and more consistent texture/flavor).\n\nsomething i recently started doing is just putting a bunch of whole strawberries in a blender with a few other ingredients (water, lemon juice, honey, cornstarch) and freezing them into healthy or \"all-natural\" popsicles. that way i can enjoy the flavor but with a much easier, and more uniform, texture. it also nullifies any of the weird or bad textures that come with out-of-season strawberries, because they're all blended up. if you liked the flavor of strawberries but not so much the texture, then i highly recommend blending them into popsicles or smoothies; it genuinely feels like eating a dessert, except it's actually somewhat healthy. \n\noh yeah also, beware of frozen strawberries!!! people without arfid will try to tell you that they taste the same as fresh ones, but *they are lying to you!!!!!* (mostly kidding, but i swear there's something *off* about frozen strawberries and nobody seems to believe me)\n\nsorry for the rant; i've just also been excited about strawberries lately because i found a way to more reliably eat them. again, i'm so glad for you that you were able to work up the courage to try one, and i hope that this can potentially lead to more opportunities to try things or even a new safe food (and like i said, even if it doesn't, trying it at all is a huge win on its own). this stranger on reddit is proud of you :)",
      "created_utc": 1720747910.0,
      "score": 7,
      "context": []
    },
    {
      "id": "lcrsjgf",
      "author": "HelloNebula-",
      "body": "If you’re able to eat strawberries now I highly recommend eating chocolate dipped strawberries if you haven’t already. They make a great treat and the chocolate goes very well with that tart/sour flavor.",
      "created_utc": 1720749374.0,
      "score": 7,
      "context": []
    },
    {
      "id": "lcrpsgn",
      "author": "ArcherFawkes",
      "body": "Strawberries dipped in chocolate or yogurt.. yummm\n\nI hate the seeds as well but I have learned to ignore them after a while 😅 congrats on your step forward!",
      "created_utc": 1720748280.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lcrzxi7",
      "author": "JustPaula",
      "body": "Nice! I feel like strawberries are a complicated food with all of the different textures. Good for you!",
      "created_utc": 1720752399.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lcvcxv4",
      "author": "RogueSlytherin",
      "body": "I highly recommend growing some of your own, if you can! They’re so much sweeter, and you get to see the whole growing process. Plus, picking berries with family is fun!",
      "created_utc": 1720807368.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lcrxl4d",
      "author": "All-about-balance",
      "body": "That’s amazing!! You should feel very proud of yourself. One of the hardest things for me is trying it the first time, after that it gets a little bit easier. :)",
      "created_utc": 1720751419.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lcs1u2q",
      "author": "racheltheangel222",
      "body": "those scare the hell out of me lmao. great job ⭐️",
      "created_utc": 1720753219.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lcs55nu",
      "author": "GamingJCD",
      "body": "congrats!! i admire ur bravery 💫",
      "created_utc": 1720754681.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lctze1a",
      "author": "storyofohno",
      "body": "Congrats!!!",
      "created_utc": 1720791050.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lcw1mij",
      "author": "bubble-buddy2",
      "body": "Congrats! I remember trying an orange. Took my forever just to peel it because I was so anxious.",
      "created_utc": 1720815515.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lcw4lyy",
      "author": "None",
      "body": "I like to chop my strawberries up into smaller pieces. Helps to eat small pieces and also seems to make the bites more consistent.",
      "created_utc": 1720816510.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ld377l7",
      "author": "6lb8ozBabyJesus",
      "body": "Proud of you! Know farm fresh food is totally different than store bought. A grocery peach is not the same as a farm fresh peach. It really make a a difference esp is the USA",
      "created_utc": 1720928048.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ldq7ui4",
      "author": "ComposerNo9785",
      "body": "I remember watching a dating show when I was a kid and the guy brought strawberries on their first date and he gave her a dirty look when she said \"I've never had a strawberry before\". I think she managed to eat one but I'm sure he had no idea what it took her. The camera pressure probably helped a lot.\n\nAnyway, glad to hear this as someone's who has never eaten one. They have tons of vitamin c which is good for everything and hard to find in other foods.",
      "created_utc": 1721279190.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ldqch4x",
      "author": "Beast_Unicorn_Jones7",
      "body": "WOOOOOOOO GO YOU!!!!",
      "created_utc": 1721281863.0,
      "score": 1,
      "context": []
    }
  ]
}