{
  "id": "1e9o3es",
  "subreddit": "ARFID",
  "author": "ninetaelz",
  "created_utc": 1721679109.0,
  "title": "Please just don't comment on my food ",
  "selftext": "It's just not needed or helpful. I already know. I get it's not always the healthiest. I get that it may seem childish to you. I get that you might not like it or think it's weird. I get that maybe I'm eating at a weird time or that maybe it's not enough. I'm aware. \n\nIt's already hard enough to eat. Commenting on it doesn't help - it just makes me more self-conscious and more aware of the food. It just makes it that little extra bit harder to eat and a lot harder to eat when others are around. \n\n(I'm just frustrated. I've asked my parents so many times to please not comment things like this, and they always inevitably do. And then when I remind them, they say I'm being too sensitive and they can't say anything. It makes me feel like I'm the villain for asking them to think before speaking and it just makes me dislike food even more) ",
  "url": "https://www.reddit.com/r/ARFID/comments/1e9o3es/please_just_dont_comment_on_my_food/",
  "score": 88,
  "num_comments": 10,
  "comments": [
    {
      "id": "legep83",
      "author": "_echoO",
      "body": "Food is food , thats how i see it for now haha . Like people Say here : fed is best",
      "created_utc": 1721687866.0,
      "score": 17,
      "context": []
    },
    {
      "id": "leginw4",
      "author": "thunderflicker",
      "body": "what's important is that you eat.  i rather see someone eat pizza everyday then see them starve. at least imo",
      "created_utc": 1721689286.0,
      "score": 13,
      "context": []
    },
    {
      "id": "lei6vzi",
      "author": "Ace_C7",
      "body": "I remember over a year ago, a coworker approached me and started bothering me about my food choices. I guess he thought he had the right, as he's the father of my best friend. It really sucks because I had just managed to be comfortable with eating in front of others in public. His one comment has me unable to eat in the break room unless I'm alone to this day.\n\nI'm an adult now and I work the night shift so I don't have to eat dinner with my family or make my own when they're around. It's been a bit of a life saver.",
      "created_utc": 1721715345.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lemr4im",
      "author": "None",
      "body": "food is just food. it's really hard to have an eating disorder. we can't worry about what is and isn't healthy - if we don't eat, we'll die. it's as simple as that. people need to mind their own damn business!! i hope you can enjoy your safe foods in peace ♥️",
      "created_utc": 1721780044.0,
      "score": 3,
      "context": []
    },
    {
      "id": "len4q1w",
      "author": "Fun_Intention_5371",
      "body": "Thank you!!!!\n\nI thought I was the only one that felt this way. \n\nJust let me eat what I'm gonna eat. I don't comment on anyone else's food. \n\nDon't make it weird because then I'm gonna get weirder about it",
      "created_utc": 1721785268.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lelnvqy",
      "author": "TheBackyardigirl",
      "body": "Ugh, my issues definitely got worse from people commenting on it. “Why are you eating *that* we have other food” “Dont snack dinner will be ready in half an hour” thanks i guess i just won’t eat then 🫠",
      "created_utc": 1721766514.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lemespi",
      "author": "lureithleon",
      "body": "I'm so sorry, that's one of the worst parts. It will completely kill my ability to eat when someone comments on it.\n\nSending emotional support ❤️",
      "created_utc": 1721775534.0,
      "score": 2,
      "context": []
    },
    {
      "id": "leqnvur",
      "author": "ibelieveinaliens111",
      "body": "I hate when people stare, too. I have a weird way of eating stuff, and sometimes I eat weird things, and my mom will always comment “It’s just so fascinating to watch you eat.” and it’s so embarrassing! It makes me lose my appetite.",
      "created_utc": 1721842533.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lego642",
      "author": "ninetaelz",
      "body": "Same. Thank you :)",
      "created_utc": 1721691313.0,
      "score": 3,
      "context": [
        {
          "id": "leginw4",
          "author": "thunderflicker",
          "body": "what's important is that you eat.  i rather see someone eat pizza everyday then see them starve. at least imo",
          "created_utc": 1721689286.0
        }
      ]
    },
    {
      "id": "lexwu79",
      "author": "ninetaelz",
      "body": "Jeez. To be honest, even if I didn't have an eating disorder, I would still hate that? Like, no. You aren't someone in my family or a medical professional, you don't have any reason to comment on what I am eating? I'm sorry! \n\nI can imagine. I've thought about working a night job for that reason in particular honestly, but I dunno if it would be great or horrible otherwise, haha.",
      "created_utc": 1721944897.0,
      "score": 1,
      "context": [
        {
          "id": "lei6vzi",
          "author": "Ace_C7",
          "body": "I remember over a year ago, a coworker approached me and started bothering me about my food choices. I guess he thought he had the right, as he's the father of my best friend. It really sucks because I had just managed to be comfortable with eating in front of others in public. His one comment has me unable to eat in the break room unless I'm alone to this day.\n\nI'm an adult now and I work the night shift so I don't have to eat dinner with my family or make my own when they're around. It's been a bit of a life saver.",
          "created_utc": 1721715345.0
        }
      ]
    }
  ]
}