{
  "id": "1eh8wz0",
  "subreddit": "ARFID",
  "author": "smash1ftw",
  "created_utc": 1722490435.0,
  "title": "Does anyone else also say “I’m allergic”?",
  "selftext": "I really hate tomatoes—the smell, taste, feel, and look of them. If they touch anything or are in the same bag, I can’t eat the food. Sometimes, I’m a little embarrassed by this and just say I’m allergic, especially at places known for getting my rigid order right. Ugh, why do they have to put tomatoes on literally everything?\n\nSame goes for seafood. I will vomit. ",
  "url": "https://www.reddit.com/r/ARFID/comments/1eh8wz0/does_anyone_else_also_say_im_allergic/",
  "score": 89,
  "num_comments": 47,
  "comments": [
    {
      "id": "lfxpngf",
      "author": "Luthenya",
      "body": "I just say \"I don't eat it\" and hope for no further questions. \n\nCause I *do* smuggle most of the \"ugh\"-stuff into my body through smoothies in small amounts (i.e. spinach or berries). Just not the pure version with pieces or glibber.\n\nEdit: if acquaintances or colleagues have the guts to still ask why, or the classic \"If you are vegan and don't eat veggies WHAT DO YOU EAT THEN??!\" 😱, I am fully prepared to give them a 30 minute speech to endure. No F-s given.\n\nIn restaurants I will only order what I know and only go to new restaurants after researching the menu and corresponding images on Google, TripAdvisor etc. If all else fails it's fries or pasta w/o sauce.",
      "created_utc": 1722492299.0,
      "score": 36,
      "context": []
    },
    {
      "id": "lfxq4cf",
      "author": "gayassjackrabbit",
      "body": "As someone who’s worked quite a few food service jobs, I absolutely say I’m allergic if I think they’re at too high of a risk of getting it wrong. I’ve seen way too many things get just picked out if someone makes the order wrong, and things like tomatoes can leave residue that will make the rest of the food otherwise inedible to me.\n\nEven in cases where it might be a bit of an obvious lie, I’m okay with looking stupid if it means I’ll get something I can actually eat",
      "created_utc": 1722492589.0,
      "score": 28,
      "context": []
    },
    {
      "id": "lfxt2oi",
      "author": "None",
      "body": "I've said I have an \"aversion\" to certain foods. People don't usually think about it and assume that it's allergies, but it also leaves open the ability to explain what it really is if someone sees me eating something that is made with that thing. \n\nFor example, peanut butter. Even just the smell of peanut butter makes me so naseus that I can't eat in the same room as someone who is eating a PB&J. \n\nSaying I have an aversion to it, and not an allergy, has always been best since I do eat a lot of stuff with peanuts, as long as it isn't in butter form. People still end up seeing me eat trail mix and stuff like that, so they'd think I was lying about something for no reason if I did say it was an allergy lol",
      "created_utc": 1722494454.0,
      "score": 18,
      "context": []
    },
    {
      "id": "lfxndrk",
      "author": "sillydogcircus",
      "body": "Eggs. I’m allergic to a bunch of other stuff, so it’s believable. I HATE eggs.",
      "created_utc": 1722490930.0,
      "score": 11,
      "context": []
    },
    {
      "id": "lfxtejx",
      "author": "KalexXm",
      "body": "I’m allergic to peanuts and always use the “cross contamination” excuse not to eat a lot of things🥲 I also pretend to have stomach issues and that if I eat anything out of my usual diet I’ll get sick",
      "created_utc": 1722494667.0,
      "score": 6,
      "context": []
    },
    {
      "id": "lfxwlgu",
      "author": "esteemed-colleague",
      "body": "“I’m allergic (to the taste)”",
      "created_utc": 1722496740.0,
      "score": 6,
      "context": []
    },
    {
      "id": "lfybgfa",
      "author": "Darillium-",
      "body": "I just say that \"I can't eat it\", and people usually assume or at least treat it as if I'm allergic. That way I don't have to lie either, though sometimes at restaurants I'll just say that I'm allergic because it's easier (ever since that one time that they mistakenly put ALL the toppings on my burger instead of NONE, and they were just going to take it back to the kitchen and scrape off most of the sauce and everything instead of remaking it).🤢",
      "created_utc": 1722506827.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lfzkku3",
      "author": "KenMixtape",
      "body": "I've used \"I'm allergic\" before.  Now I usually say \"I have sensory issues\" since I think most people can understand that these days.",
      "created_utc": 1722525609.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lg0ivxs",
      "author": "St4r_5lut",
      "body": "I use the allergy thing all the time, especially for more healthy dishes. I also have the excuse of using my metabolic disorder csid so I can get away with weird food habits bc no one understands it.\n\n“Hey you want *blank thing I don’t want*” Sorry bro didn’t bring my meds gotta limit what I eat\n\n“Hey can I have some of your water” nope sorry my meds are in it you will get diarrhea. (It doesn’t actually cause diarrhea I’m just making bs up so people don’t take my shit)",
      "created_utc": 1722536360.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lfxp5x6",
      "author": "smash1ftw",
      "body": "It’s nicer than saying don’t get it wrong this time. Especially with the prices of things these days sheesh",
      "created_utc": 1722491998.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lfyslys",
      "author": "No_Reach3179",
      "body": "Honestly I recommend it. Obviously don’t go crazy & say you’re allergic to literally everything someone offers but when you’re getting food made, you should. \n\nYou don’t know how many times I’ve sadly had to pick those nasty tomatoes off my chipotle bowl because they messed my order up. It ruined everything bc it all tasted like tomato.",
      "created_utc": 1722515546.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lfyen5w",
      "author": "DyingLies",
      "body": "I tried a few times to say that \"i'm allergic\" but unfortunately nobody believed it. They were like \"You can't be allergic to that many things.\" \"Nobody is allergic to that.\" I was so tired of trying to justify myself so I quickly decided to just told people I have a medical condition that doesn't allow me to eat certain foods.",
      "created_utc": 1722508605.0,
      "score": 6,
      "context": []
    },
    {
      "id": "lfzfifp",
      "author": "kates_cupcakes",
      "body": "I say this with mushrooms and shellfish, o can’t eat them at all. I used to say this with bananas until I accidentally had some and realized that I am actually allergic to bananas. It was a fun realization lol",
      "created_utc": 1722523965.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lfzi4pe",
      "author": "None",
      "body": "I only say I'm allergic if I'm actually allergic to it (dairy, shellfish). Otherwise I explain I just don't eat it. I have no problem telling people I don't eat things, and sometimes I do get hit with the \"what DO you eat\" but I'm used to it. I've had ARFID all my life so I don't mind. ",
      "created_utc": 1722524820.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lg15e6y",
      "author": "Perchance09",
      "body": "When I was little and couldn't articulate what this felt like, I used to say that I'm allergic. This was back when ARFID wasn't even a recognised disorder, so there was no way to make anyone understand. Unfortunately, no one believed me (and still don't believe me), so I don't even bother saying anything now. \n\n\nAlso, I hate tomatoes, too! I've puked just at the sight of it. Why are they on everything? I cannot stand them!",
      "created_utc": 1722543378.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lfzfzoh",
      "author": "TashaT50",
      "body": "I say I’m allergic to restaurants I don’t trust to get it right as I’ve sent food back and too frequently it’s obvious they tried scraping the things things off - like gross. I was a waitress for a few years in my 20s and remember how some staff took offense and ignored special orders. \n\nSeafood is my main gag/vomit and only junk food snacking for days. This problem started in the womb per se as I had dairy issues and had to go on soy formula which came out the year before I was born. I’m not sure why my mom didn’t give up dairy once it was confirmed that was the problem. As soon as solid foods were introduced if I didn’t like something I refused to eat anything for hours and if they tried to reintroduce it I refused to taste it and refused to eat anything else for hours. I learned not to trust people before I was one.\n\nI also have some food sensitivities, not actual allergies, I’m not going to end up in ER or die, but I’ll end up with painful digestive problems, bloody noses, congestion, migraines for a few days. Not fun. \n\nHopefully some time in the future people will be respected when it comes to special requests and we won’t have to lie. I feel like preferences should be respected whether they are life threatening or simply dislikes.",
      "created_utc": 1722524120.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lfzk5yj",
      "author": "Fun_Intention_5371",
      "body": "I wish I would have thought of this earlier in life. \n\nI'm so used to owning it that I usually forget. Even with stuff I'm actually allergic to",
      "created_utc": 1722525477.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lfzswy2",
      "author": "alectric_",
      "body": "Yup.",
      "created_utc": 1722528256.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lfzvdhh",
      "author": "Voyage_to_Artantica",
      "body": "I usually don’t get into this situation honestly. I do have allergies though so I don’t think I’d ever lie ab it just bc I need to make sure that my allergies are done correctly.",
      "created_utc": 1722529040.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lg044wf",
      "author": "Nearby-Ad5666",
      "body": "I say I have a bad reaction. I can't eat things with cumin because it makes me sick. I have no allergy test to prove this. I also can't eat super dry chewy food and I hate sticky stuff like caramel. I often just say I can't eat X",
      "created_utc": 1722531777.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lg1psxj",
      "author": "Interesting-Cow8131",
      "body": "I'm a vegetarian so that kinda helps a bit, a very convenient excuse not to eat a lot of things. And I also don't go out to eat,  ever. I have an aversion to other people preparing my food. So not going out to eat (or ordering delivery) saves me from having to make an excuse in the first place",
      "created_utc": 1722549970.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lg1u8r5",
      "author": "MysticSnowfang",
      "body": "I call it a \"Food sensitivity\" or I just flat out say I have a condition.   \nUnless it's garlic, then I can actully say I've got an intolerance. (which SUCKS because garlic bread WAS a safe food. And tastewise it is)   \nBut my belly disagreed.",
      "created_utc": 1722551553.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lg35lzv",
      "author": "mishasebastian",
      "body": "I just say “I can’t eat that” and if I’m close enough with them I’ll explain why but if we aren’t close then that’s all they get",
      "created_utc": 1722570153.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lg38gri",
      "author": "athey",
      "body": "I was fortunate enough that my husband actually *was* allergic to most of my ‘no way’ foods. \n\nSo I could just use him as an excuse. \n\nBut then it turned out that the type of allergy he has could be fixed with a daily pill, and now my excuse is gone.",
      "created_utc": 1722571481.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lg3r7vc",
      "author": "GenjiVEVO",
      "body": "I dont want to risk saying that in case the restaurants denies me service in case they think they might accidentally make me sick lol",
      "created_utc": 1722581991.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lgfcts3",
      "author": "allegraorallegro",
      "body": "i have before!!! i HATE the texture of nuts- they’re chalky, they’re gross, and they are not appealing to me. i ended up telling some people i was allergic, but eventually decided to stop doing that because i like peanut butter a lot 😅",
      "created_utc": 1722761026.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lfxo0nx",
      "author": "None",
      "body": "I don't. Everyone knows you're not allergic. I've seen people look really stupid for claiming an allergy because they couldnt just say they don't want to eat something. Especially when the allergen is also in the alternative food they request. ",
      "created_utc": 1722491307.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lg0awln",
      "author": "bell83",
      "body": "I used it a few times when I was a kid.",
      "created_utc": 1722533893.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lg13tv1",
      "author": "Silent_County9707",
      "body": "Yup, I went and stayed and families houses last week and I had too come up with so many excuses",
      "created_utc": 1722542904.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lg1a8hn",
      "author": "NoFrame6654",
      "body": "My go to is that I’m a strict vegetarian since birth",
      "created_utc": 1722544840.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lg1t9q2",
      "author": "LowRhubarb5668",
      "body": "I used to do that more when I was younger especially when I was in daycare. Somehow when I was probably 5ish I figured out that if I told the daycare people that I was allergic to something they wouldn’t force/guilt me to eat or drink something which one I remember was pineapple juice. I don’t do so much now as google is my friend for menus, I don’t eat out a lot, and I’m in therapy so I can work towards rebuilding my relationship with food.",
      "created_utc": 1722551202.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lg3ocnm",
      "author": "emeon_",
      "body": "I used to say that with mustard until I stopped seeing it as unsafe",
      "created_utc": 1722580212.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lg4ln2b",
      "author": "thecrowsystem",
      "body": "oranges!!! they make me so sick",
      "created_utc": 1722600246.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lg521gh",
      "author": "None",
      "body": "sometimes yes if i can get away with it, but some people who i know for a while will realize im allergic to everything lol\n\nin those cases i end up just blankly telling them what will end up happening if they make me eat what they're trying to (usually constant vomiting for the next hour)",
      "created_utc": 1722606663.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lg8x0z1",
      "author": "yamiryukia330",
      "body": "I say I don't eat it and if pressed i will say it doesn't agree with me or if they're closer that is have aversions that are hard to explain, usually texture or smell related.",
      "created_utc": 1722655367.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lfxrzbh",
      "author": "smash1ftw",
      "body": "But seriously that’s awesome that you can live that healthy lifestyle while still living with food avoidance",
      "created_utc": 1722493755.0,
      "score": 11,
      "context": [
        {
          "id": "lfxpngf",
          "author": "Luthenya",
          "body": "I just say \"I don't eat it\" and hope for no further questions. \n\nCause I *do* smuggle most of the \"ugh\"-stuff into my body through smoothies in small amounts (i.e. spinach or berries). Just not the pure version with pieces or glibber.\n\nEdit: if acquaintances or colleagues have the guts to still ask why, or the classic \"If you are vegan and don't eat veggies WHAT DO YOU EAT THEN??!\" 😱, I am fully prepared to give them a 30 minute speech to endure. No F-s given.\n\nIn restaurants I will only order what I know and only go to new restaurants after researching the menu and corresponding images on Google, TripAdvisor etc. If all else fails it's fries or pasta w/o sauce.",
          "created_utc": 1722492299.0
        }
      ]
    },
    {
      "id": "lfxruky",
      "author": "smash1ftw",
      "body": "Oh definitely I agree",
      "created_utc": 1722493670.0,
      "score": 4,
      "context": [
        {
          "id": "lfxq4cf",
          "author": "gayassjackrabbit",
          "body": "As someone who’s worked quite a few food service jobs, I absolutely say I’m allergic if I think they’re at too high of a risk of getting it wrong. I’ve seen way too many things get just picked out if someone makes the order wrong, and things like tomatoes can leave residue that will make the rest of the food otherwise inedible to me.\n\nEven in cases where it might be a bit of an obvious lie, I’m okay with looking stupid if it means I’ll get something I can actually eat",
          "created_utc": 1722492589.0
        }
      ]
    },
    {
      "id": "lg04med",
      "author": "Nearby-Ad5666",
      "body": "I like the taste but it often makes me choke. Foods that are think and pasty choke me",
      "created_utc": 1722531934.0,
      "score": 2,
      "context": [
        {
          "id": "lfxt2oi",
          "author": "None",
          "body": "I've said I have an \"aversion\" to certain foods. People don't usually think about it and assume that it's allergies, but it also leaves open the ability to explain what it really is if someone sees me eating something that is made with that thing. \n\nFor example, peanut butter. Even just the smell of peanut butter makes me so naseus that I can't eat in the same room as someone who is eating a PB&J. \n\nSaying I have an aversion to it, and not an allergy, has always been best since I do eat a lot of stuff with peanuts, as long as it isn't in butter form. People still end up seeing me eat trail mix and stuff like that, so they'd think I was lying about something for no reason if I did say it was an allergy lol",
          "created_utc": 1722494454.0
        }
      ]
    },
    {
      "id": "lfxokrs",
      "author": "smash1ftw",
      "body": "Oh yea no thanks Egg smell ewe I’m sorry",
      "created_utc": 1722491643.0,
      "score": 4,
      "context": [
        {
          "id": "lfxndrk",
          "author": "sillydogcircus",
          "body": "Eggs. I’m allergic to a bunch of other stuff, so it’s believable. I HATE eggs.",
          "created_utc": 1722490930.0
        }
      ]
    },
    {
      "id": "lfz3r13",
      "author": "smash1ftw",
      "body": "Don’t forget the smell haha",
      "created_utc": 1722519953.0,
      "score": 4,
      "context": [
        {
          "id": "lfxwlgu",
          "author": "esteemed-colleague",
          "body": "“I’m allergic (to the taste)”",
          "created_utc": 1722496740.0
        }
      ]
    },
    {
      "id": "lg11w63",
      "author": "smash1ftw",
      "body": "I love that. Good for you I wish I could be more brave with my sass lol",
      "created_utc": 1722542318.0,
      "score": 4,
      "context": [
        {
          "id": "lg0ivxs",
          "author": "St4r_5lut",
          "body": "I use the allergy thing all the time, especially for more healthy dishes. I also have the excuse of using my metabolic disorder csid so I can get away with weird food habits bc no one understands it.\n\n“Hey you want *blank thing I don’t want*” Sorry bro didn’t bring my meds gotta limit what I eat\n\n“Hey can I have some of your water” nope sorry my meds are in it you will get diarrhea. (It doesn’t actually cause diarrhea I’m just making bs up so people don’t take my shit)",
          "created_utc": 1722536360.0
        }
      ]
    },
    {
      "id": "lg04x18",
      "author": "Nearby-Ad5666",
      "body": "I say I have texture issues",
      "created_utc": 1722532026.0,
      "score": 3,
      "context": [
        {
          "id": "lfzfifp",
          "author": "kates_cupcakes",
          "body": "I say this with mushrooms and shellfish, o can’t eat them at all. I used to say this with bananas until I accidentally had some and realized that I am actually allergic to bananas. It was a fun realization lol",
          "created_utc": 1722523965.0
        }
      ]
    },
    {
      "id": "lg18ff1",
      "author": "smash1ftw",
      "body": "Right it’s so rude to ruin food like that salad on food is just wrong",
      "created_utc": 1722544291.0,
      "score": 2,
      "context": [
        {
          "id": "lg15e6y",
          "author": "Perchance09",
          "body": "When I was little and couldn't articulate what this felt like, I used to say that I'm allergic. This was back when ARFID wasn't even a recognised disorder, so there was no way to make anyone understand. Unfortunately, no one believed me (and still don't believe me), so I don't even bother saying anything now. \n\n\nAlso, I hate tomatoes, too! I've puked just at the sight of it. Why are they on everything? I cannot stand them!",
          "created_utc": 1722543378.0
        }
      ]
    },
    {
      "id": "lggmtlr",
      "author": "smash1ftw",
      "body": "Haha I use to like ketchup so tomatoes sometimes got me that way too lol",
      "created_utc": 1722784251.0,
      "score": 1,
      "context": [
        {
          "id": "lgfcts3",
          "author": "allegraorallegro",
          "body": "i have before!!! i HATE the texture of nuts- they’re chalky, they’re gross, and they are not appealing to me. i ended up telling some people i was allergic, but eventually decided to stop doing that because i like peanut butter a lot 😅",
          "created_utc": 1722761026.0
        }
      ]
    },
    {
      "id": "lfxoggz",
      "author": "smash1ftw",
      "body": "Other food item? oh my French fries dipped in oh yea nothing lol or my fish with my other fish",
      "created_utc": 1722491571.0,
      "score": 2,
      "context": [
        {
          "id": "lfxo0nx",
          "author": "None",
          "body": "I don't. Everyone knows you're not allergic. I've seen people look really stupid for claiming an allergy because they couldnt just say they don't want to eat something. Especially when the allergen is also in the alternative food they request. ",
          "created_utc": 1722491307.0
        }
      ]
    },
    {
      "id": "lfxtovo",
      "author": "Luthenya",
      "body": "Thanks dear ♥️ That's actually a very recent achievement for me :) Even if it's just teeny tiny amounts it feels great to kinda achieve that. My partner prepares the smoothies so I don't have to touch \"the green stuff\" and sometimes idk what else he secretly puts in there 😅 As long as it doesn't taste like the ingredient and has a smooth texture it's passing.\n\nBut let's be honest: it's just lucky coincidence that for me it's mostly texture, not the thought of the food itself. I have that with some foods (mainly meat and cucumber) so I kinda know what you're about. Not the easiest but we are how we are, no apologies 🙏",
      "created_utc": 1722494847.0,
      "score": 12,
      "context": [
        {
          "id": "lfxpngf",
          "author": "Luthenya",
          "body": "I just say \"I don't eat it\" and hope for no further questions. \n\nCause I *do* smuggle most of the \"ugh\"-stuff into my body through smoothies in small amounts (i.e. spinach or berries). Just not the pure version with pieces or glibber.\n\nEdit: if acquaintances or colleagues have the guts to still ask why, or the classic \"If you are vegan and don't eat veggies WHAT DO YOU EAT THEN??!\" 😱, I am fully prepared to give them a 30 minute speech to endure. No F-s given.\n\nIn restaurants I will only order what I know and only go to new restaurants after researching the menu and corresponding images on Google, TripAdvisor etc. If all else fails it's fries or pasta w/o sauce.",
          "created_utc": 1722492299.0
        },
        {
          "id": "lfxrzbh",
          "author": "smash1ftw",
          "body": "But seriously that’s awesome that you can live that healthy lifestyle while still living with food avoidance",
          "created_utc": 1722493755.0
        }
      ]
    },
    {
      "id": "lfxrg9s",
      "author": "sillydogcircus",
      "body": "I have friends surprised I don’t even bake with them. No. Hate eggs.",
      "created_utc": 1722493420.0,
      "score": 5,
      "context": [
        {
          "id": "lfxndrk",
          "author": "sillydogcircus",
          "body": "Eggs. I’m allergic to a bunch of other stuff, so it’s believable. I HATE eggs.",
          "created_utc": 1722490930.0
        },
        {
          "id": "lfxokrs",
          "author": "smash1ftw",
          "body": "Oh yea no thanks Egg smell ewe I’m sorry",
          "created_utc": 1722491643.0
        }
      ]
    },
    {
      "id": "lfxs56s",
      "author": "Luthenya",
      "body": "Side info for 100% passing as allergic: in your case, a tomato allergy could be histamine intolerance or PFAS / type 1 hypersensitivity with cross allergy to hazel, birch, alder, different grasses and some stuff like peaches, celery, melons, or potatoes due to profilins cross-linking with IgE. Work-me://off.",
      "created_utc": 1722493858.0,
      "score": 4,
      "context": [
        {
          "id": "lfxo0nx",
          "author": "None",
          "body": "I don't. Everyone knows you're not allergic. I've seen people look really stupid for claiming an allergy because they couldnt just say they don't want to eat something. Especially when the allergen is also in the alternative food they request. ",
          "created_utc": 1722491307.0
        },
        {
          "id": "lfxoggz",
          "author": "smash1ftw",
          "body": "Other food item? oh my French fries dipped in oh yea nothing lol or my fish with my other fish",
          "created_utc": 1722491571.0
        }
      ]
    }
  ]
}