{
  "id": "1emb93z",
  "subreddit": "ARFID",
  "author": "None",
  "created_utc": 1723035890.0,
  "title": "Aside from the main thing of being unable to eat most things, whats the worst part about it for you?",
  "selftext": "For me its  \nwhenever doctors ask me/my parents about my diet, i feel like the way they explain it is always embarrassing\n\npeople who dont get it or constantly make it a point to talk about \"how much your missing out on\"\n\nconstantly feeling unintentionally excluded or forgotten about when a group does anything food related (getting food for everyone, going out to eat together, etc)\n\nbeing very underweight and malnourished",
  "url": "https://www.reddit.com/r/ARFID/comments/1emb93z/aside_from_the_main_thing_of_being_unable_to_eat/",
  "score": 81,
  "num_comments": 79,
  "comments": [
    {
      "id": "lgxp16x",
      "author": "Cold_Pressure5351",
      "body": "The worst part for me is when I have not been able to eat all day, so I cook a safe food. But when I go to eat it I lose my appetite and throw the food out.",
      "created_utc": 1723037285.0,
      "score": 82,
      "context": []
    },
    {
      "id": "lgxqud1",
      "author": "WildWallFlower97",
      "body": "Worrying about my health is a huge one. My safe foods aren't the best for me and as I'm getting a bit older I'm starting to worry. \nOther than that it's just embarrassing. I've skipped so many social events, I hate when people comment on the fact that I'm not eating. Like just mind your own business and leave me alone. I don't understand why it's such a big deal to everyone else what I do or don't eat.",
      "created_utc": 1723037942.0,
      "score": 55,
      "context": []
    },
    {
      "id": "lgxup5b",
      "author": "honeybin_sugar",
      "body": "Ppl not understanding and just dismissing it a picky eating, making jokes about what you eat or commenting negatively about the choice of food.\n\nAppetite literally not existing, yet still having to think of sth to eat to not starve, even tho not eating anything sounds way better, but yk you can't do that.\n\n\"Side effects\" like a shitty immune system, nutrition deficiencies, unhealthy Weight-loss, such things that come as a by product an affect your health.\n\nNot being able to eat sth even tho it looks so damn good or smells nice bc it includes a texture, food or whatever and therefore ain't an option.",
      "created_utc": 1723039270.0,
      "score": 34,
      "context": []
    },
    {
      "id": "lgxr8h8",
      "author": "SB_Wife",
      "body": "The fact most people don't get it. People don't understand if you just don't lile food, especially if you're like me and fat as well. I like processed food because it's predictable, and that makes it easy to eat for me.\n\nWe do Friday lunches at work and that's awkward sometimes but my coworkers are generally chill about it and my boss is super supportive and tries to make sure what we do is inclusive.",
      "created_utc": 1723038079.0,
      "score": 25,
      "context": []
    },
    {
      "id": "lgy91jf",
      "author": "39dayou",
      "body": "never really feeling fully satisfied and having to explain to ppl even closest to me that it isn’t just picky eating. having to hear how difficult you are and how they find it annoying/inconvenient to find somewhere to eat when w me then imagine how it is for me to live like this every day for every meal. it really is debilitating",
      "created_utc": 1723043930.0,
      "score": 15,
      "context": []
    },
    {
      "id": "lgyy8cv",
      "author": "ALostNessie",
      "body": "rn it’s the social aspects and being shamed. i was on a tour group recently and the guide shamed me for not “immersing myself” and wasting food :/ (i did not have any choice on what food we were served and was just going to wait until i was on my own to eat)",
      "created_utc": 1723051639.0,
      "score": 14,
      "context": []
    },
    {
      "id": "lgzdowp",
      "author": "Ok-Barry-512",
      "body": "Seeing my partner try to plan around my safe foods, he spends days and days researching restaurants before a vacation to screen the menus for things I’ll eat. I didn’t know about ARFID until about two weeks ago and after I learned about it, I realized just how much he truly loves me (and also wracked with guilt for how my disorder impacts his life, but mostly love). \nAlso, having “eating windows” if that makes sense? Like having an appetite and then not eating before it disappears again. Or feeling sick when food is put in front of me and then ravenous as soon as we leave.\nAnd deficiencies… I have osteoporosis at 30yo.",
      "created_utc": 1723056329.0,
      "score": 13,
      "context": []
    },
    {
      "id": "lgxv7cr",
      "author": "geekgeek2019",
      "body": "wasting food or when people put efforts to try to make me eat AND ACID FREAKING REFLUX",
      "created_utc": 1723039445.0,
      "score": 8,
      "context": []
    },
    {
      "id": "lgyvuyl",
      "author": "Living-Celebration57",
      "body": "Oh I got one, when you haven’t eaten in a while  so u start to shake and get sleepy it’s like it erases the urge to eat even tho u know u need to but now you’re too tired and u just want to sleep.",
      "created_utc": 1723050923.0,
      "score": 9,
      "context": []
    },
    {
      "id": "lgzodht",
      "author": "Miserable_Unit_9529",
      "body": "Ordering food and asking for things to not be on it and being looked at as a child 🙁 or being made fun of for ordering “cucumbers” instead of a side salad",
      "created_utc": 1723059607.0,
      "score": 8,
      "context": []
    },
    {
      "id": "lgykba5",
      "author": "starsandsunandmoon",
      "body": "The constant weight gain, despite trying to be healthier, from my body thinking its going to experience another famine.\n\nI'm 26, and at this point, I believe I'm going to be fat for the rest of my life. Arfid on top of cholinergic urticaria means both food and exercise are extremely limited for me, and that has to be the hardest thing for me to cope with.",
      "created_utc": 1723047415.0,
      "score": 7,
      "context": []
    },
    {
      "id": "lgynhx9",
      "author": "georgecostanzalvr",
      "body": "Not being able to navigate health issues because of my eating habits. I have been diagnosed with some stomach issues and the only way to really make them go away is to change my diet, but I just can’t. I do what I can, but I know I’ll never be able to eat completely clean or follow some strict diet. And when I tell doctors this I feel like a loser or like they think I don’t want to feel better. I do want to feel better, but I/my brain/body will always choose to not eat over eating something that I don’t want.",
      "created_utc": 1723048385.0,
      "score": 7,
      "context": []
    },
    {
      "id": "lgyvcnc",
      "author": "Ok-Flounder-914",
      "body": "It affecting my social life. I have a boyfriend and he LOVES food. He wants to go to restaurants all the time, but I just can't do it. Just thinking about it makes me feel horrible. \n\nAlso being worried about my health, i have a lot of vitamin deficiencies and that gives me all sorts of symptoms. Most of my safe foods are unhealthy unfortunately, which makes me very worried about my health.",
      "created_utc": 1723050770.0,
      "score": 8,
      "context": []
    },
    {
      "id": "lgyz700",
      "author": "kashmoneykl",
      "body": "Wanting to gain weight so badly, but not being able to get enough in me because of my ARFID",
      "created_utc": 1723051928.0,
      "score": 8,
      "context": []
    },
    {
      "id": "lgzb8jp",
      "author": "idekkbruhh",
      "body": "Knowing I have to eat at some point",
      "created_utc": 1723055586.0,
      "score": 7,
      "context": []
    },
    {
      "id": "lgyscll",
      "author": "RamblingRose63",
      "body": "When my sugar gets low It triggers anxiety I literally can't control it sometimes and then I'm on a rollercoaster of scared to eat and hungry like I'm gonna pass out",
      "created_utc": 1723049858.0,
      "score": 7,
      "context": []
    },
    {
      "id": "lgyw93u",
      "author": "Kauuori",
      "body": "Deficiency",
      "created_utc": 1723051040.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lgz72co",
      "author": "drama_life_user",
      "body": "Not eating in front of people without fail they always have to point it out that I never seemed to grow up that I shouldn't still be eating like that at my age or that it's disrespectful not to finish the food  or on the other hand the few times I do it is inappropriate nevermind the fact I'm only doing it to stay conscious but yeah",
      "created_utc": 1723054312.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lh0rrkd",
      "author": "eggsoda23",
      "body": "The constant shame I feel about my diet and the knowledge that there isn't much I can do about it. I know my diet isn't the healthiest but it's all I'm able to eat 😔",
      "created_utc": 1723072320.0,
      "score": 6,
      "context": []
    },
    {
      "id": "lgxw6u6",
      "author": "two-of-me",
      "body": "When people say “nah it’s not that spicy” when my mouth is ON FIRE!",
      "created_utc": 1723039778.0,
      "score": 6,
      "context": []
    },
    {
      "id": "lgzd8th",
      "author": "Domestic_Fox",
      "body": "Being a mother and having to deal with being in charge of a whole families food when I have two Ed’s, and also the planning/shopping/prepping and cooking of said food when my children also share in these struggles. \n\nBeing autistic/adhd and having things the literal worst. I literally don’t have the energy or want to even feed myself. Like there is no battery storage to charge up myself a little to be able to eat. Therefore I barely eat, which makes it even shittier because I’m angry and hungry all the time while cooking food for everyone literally everyday for the rest of my life. \n\nWe need to get food pills going because that seems like my only options. No food or food pills that don’t exist",
      "created_utc": 1723056194.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lgzgpy8",
      "author": "Miserable-Coffee",
      "body": "I’d say the worst is the fact that this is not a very well known disorder and is treated like a mental health issue when physical health treatments are the only things that have helped me. Most doctors just don’t know what it is and don’t even want to know. I just wish there was more research done into this and more treatments. When I finally found a doctor that knew what this was after years of trying to get help they told me 1. They aren’t trained on this and not one doctor in my entire city is trained in treating this and 2. Treatments are only available for children because once you become an adult it’s very unlikely that anything will help you so they said I was a hopeless case. They see how bad my health has gotten and still don’t wish to help or offer me any advice. Plus since it’s labelled a mental health issue, a lot of doctors don’t wanna touch this with a 10ft pole and those trained on mental health issues say that it’s not my mind that’s causing this so they can’t help. People with ARFID in the UK are in a catch 22.",
      "created_utc": 1723057251.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lgypdt3",
      "author": "None",
      "body": "Losing alot of weight  ",
      "created_utc": 1723048963.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lh0dxrh",
      "author": "thatsnuckinfutz",
      "body": "my arfid is just food avoidance in general, i dont enjoy eating and often would rather just not eat.\n\nthe worst aspect of that tbh is living in a society where every gathering is surrounded by meals/eating. I have a slow month this month so naturally everyone wants to hang/catch up and it's always including food. I love catchin up with friends but it being over a meal 9 times out of 10 is just so off-putting 😂 but it's a cultural thing so i just roll with it.",
      "created_utc": 1723067546.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lh1o8b2",
      "author": "jintana",
      "body": "Romantic partners resented me for not being interested in sharing food experiences or preparing certain foods.",
      "created_utc": 1723084406.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lgznest",
      "author": "Fit-Cauliflower-9229",
      "body": "The nerve damage from b12 deficiency",
      "created_utc": 1723059315.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lh00msr",
      "author": "BakedTaterTits",
      "body": "Having to pack my own food to hang out with friends when I know there will be food. \n\nBeing called a picky eater like I have a choice about it, at all.\n\nTaking one bite of a safe food I've been looking forward to all day, and it's suddenly horrible, and I can't eat it anymore.",
      "created_utc": 1723063331.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lh0dmxd",
      "author": "luminousrobot",
      "body": "Knowing my husband will never really understand and I’ll probably never meet another person like me. That and the weight gain from all the carbs",
      "created_utc": 1723067447.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lh0tqa6",
      "author": "DyingLies",
      "body": "For me the worst part is having everyone judging you. Apart from that I already have huge difficulties to socialize, and having people wondering \"why are you always eating the same things over and over again?\", \"you can't eat that food? But everyone loves it, that's so weird\" make it even harder.",
      "created_utc": 1723073017.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lh1ykfu",
      "author": "None",
      "body": "My health definitely because I already have digestive issues but also how my list of safe foods is shrinking really quickly. I just attempted to eat some noodles I used to really like and they were awful. This keeps happening and I worry I’ll end up damaging my metabolism. I’m already super tired all the time from not eating as much as I should",
      "created_utc": 1723088728.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lh2rqap",
      "author": "Ilovecars24",
      "body": "Food waste? It makes me feel very guilty how much food i waste cause of it",
      "created_utc": 1723105338.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lh38se0",
      "author": "Thedailybee",
      "body": "Some people have already said a lot of worst parts but one for me is when I’m around a kid and they eat more than me 😐 why is a toddler able to eat better than I am !!",
      "created_utc": 1723115788.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lh9nqfk",
      "author": "multifandomfreak46",
      "body": "Feeling like an inconvenience to other people",
      "created_utc": 1723207946.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lhaw0hc",
      "author": "St4r_5lut",
      "body": "When people act like telling you to eat healthy will magically fix all your issues. \nYes, I know grandpa, I need to eat my vegetables. But I’ve never seen you drink anything except beer my entire life so maybe we both have eating issues.",
      "created_utc": 1723222487.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lgyecob",
      "author": "bassc_",
      "body": "Knowing I‘ll never be healthy, being hungry all the time but not wanting to eat because food sucks.",
      "created_utc": 1723045580.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lh0gqib",
      "author": "taytartot",
      "body": "Absolute excruciating pain",
      "created_utc": 1723068484.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lh1pkpc",
      "author": "Jaceywac3y",
      "body": "The social isolation, food brings people together and it only seems to divide me further from my peers…",
      "created_utc": 1723084939.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lh1ujcc",
      "author": "gayassjackrabbit",
      "body": "Constantly needing to defend my eating habits. My friends all know I have food sensitivities and have all been super great about it, but I’ve had extremely few friends whose families didn’t accuse me of being anorexic the first several times of meeting me. Even if I was, why would you think commenting like that would help?\n\nHad an ex boyfriend whose parents went on a 45 minute lecture about how I didn’t have to worry about looking dainty eating in front of their son and how I was already too thin and just jeez lady let me eat my pocket cheerios in peace your meal looks so wonderful but you are going to be very insulted when I put this into my mouth and immediately vomit",
      "created_utc": 1723086973.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lh1vpz5",
      "author": "kilroy-was-here-2543",
      "body": "Aside from the more common answers, missing out of the social aspect of food. Sure you can still be there with people and talk, but on occasion where theirs food I’ll eat it feels better.",
      "created_utc": 1723087477.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lh20hvm",
      "author": "ZestycloseExtent8981",
      "body": "for me it’s how often i have to go to doctors appointments for issues related to malnutrition",
      "created_utc": 1723089606.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lh229iz",
      "author": "MrsCyanide",
      "body": "I get anxiety if I’m going to someone’s house for dinner or on a trip. I get scared there won’t be anything I’ll be able to eat and I’ll have to go hungry. I’ve made excuses that I feel sick or I’m full etc. Thankfully my boyfriend’s family literally asks no questions about my “odd” eating habits and they don’t judge. They just always ask me what I would like to eat from the available menu for takeout, or they have my safe foods stashed away in their house just incase. \n\nThey treat me like their own and I’m super lucky for it (,:",
      "created_utc": 1723090420.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lh2cpzw",
      "author": "Thick-Bank-4471",
      "body": "Im super short. Its mainly genetics but i tell ya the ARFID does NOT help. 4’7 male at 16",
      "created_utc": 1723095915.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lh2jmz7",
      "author": "apizzamx",
      "body": "the fact that i really struggle with other people cooking for me, i feel really guilty when people offer to make food and i get disgusted at the thought of it. (the thoughts aren’t as prevalent about eating at restaurants? idk why. the food there just feels like its Safer). \nWhen friends make me food and it has unsafe elements i just feel awful and try to force it down but often doesn’t work. \nfamily made food is less scary because i’ve had it since birth so it’s predictable and safe.",
      "created_utc": 1723100083.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lh2mba2",
      "author": "hanniiiie",
      "body": "Malpractice by doctors, in my case it’s been so bad it almost killed me and then almost had me kill myself. But that’s now in the past, so nowadays the worst thing is being unable to participate and enjoy food related social situations. For example I was recently in Japan, and I was not allowed in restaurants unless I ordered something. So I had to sit alone outside while my friends ate and had a good time.",
      "created_utc": 1723101785.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lh3ls9v",
      "author": "Pale-Dragonfruit-765",
      "body": "my weight fluctuating like crazyyyy due to changes in my appetite/diet. but that ties with the anxiety i have about going out with friends/family, especially because so much of social life revolves around food.",
      "created_utc": 1723121507.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lh46ol3",
      "author": "None",
      "body": "The weight loss. I’m so underweight everyone comments on it. The amount of time it takes to swallow food is so so embarrassing and missing out on social events because food is involved. I would be happy to eat all food if I could swallow it but I just can’t. It’s ruining my life",
      "created_utc": 1723128701.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lh55c9v",
      "author": "bubble-buddy2",
      "body": "I don't enjoy food most of the time. Meals aren't a fun thing. Lots of people enjoy good hearty meals but for me, eating is just a requirement. I wish I could feel excited for food more often.",
      "created_utc": 1723139336.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lh9lqh6",
      "author": "pussylover1004",
      "body": "Traveling, especially in a foreign country. So much of partaking in other cultures is trying their food, and I so badly wish I could just participate like a normal person. It's so isolating being the only one not eating because of my ARFID and I feel guilty/insensitive. Not to mention going to bed hungry on vacation 🥴",
      "created_utc": 1723207146.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lh46pt9",
      "author": "None",
      "body": "The weight loss. I’m so underweight everyone comments on it. The amount of time it takes to swallow food is so so embarrassing and missing out on social events because food is involved. I would be happy to eat all food if I could swallow it but I just can’t. It’s ruining my life!",
      "created_utc": 1723128711.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lh46r3z",
      "author": "None",
      "body": "The weight loss. I’m so underweight everyone comments on it. The amount of time it takes to swallow food is so so embarrassing and missing out on social events because food is involved. I would be happy to eat all food if I could swallow it but I just can’t. It’s ruining my life!",
      "created_utc": 1723128720.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lh0kbwr",
      "author": "None",
      "body": "THIS! The food waste makes me feel so guilty. Sometimes I’ll be craving a safe food, make it and by the time it’s ready I don’t want it anymore. I can’t force myself to eat something I don’t want either so it almost always goes in the trash (or my boyfriend’s stomach if he likes it) I also struggle with early satiation because my hunger cues are all fucked up, so even when I do eat something, I can only eat a few bites before I’m full:/",
      "created_utc": 1723069722.0,
      "score": 9,
      "context": [
        {
          "id": "lgxp16x",
          "author": "Cold_Pressure5351",
          "body": "The worst part for me is when I have not been able to eat all day, so I cook a safe food. But when I go to eat it I lose my appetite and throw the food out.",
          "created_utc": 1723037285.0
        }
      ]
    },
    {
      "id": "lgymxxk",
      "author": "georgecostanzalvr",
      "body": "Same, especially when I have shit I need to do, or want to do, and my body and brain are screaming for food but I cannot even get a bite down.",
      "created_utc": 1723048216.0,
      "score": 10,
      "context": [
        {
          "id": "lgxp16x",
          "author": "Cold_Pressure5351",
          "body": "The worst part for me is when I have not been able to eat all day, so I cook a safe food. But when I go to eat it I lose my appetite and throw the food out.",
          "created_utc": 1723037285.0
        }
      ]
    },
    {
      "id": "lgxpaw0",
      "author": "yeahcxnt",
      "body": "Yeah, it’s this for me too",
      "created_utc": 1723037381.0,
      "score": 7,
      "context": [
        {
          "id": "lgxp16x",
          "author": "Cold_Pressure5351",
          "body": "The worst part for me is when I have not been able to eat all day, so I cook a safe food. But when I go to eat it I lose my appetite and throw the food out.",
          "created_utc": 1723037285.0
        }
      ]
    },
    {
      "id": "lgxqco6",
      "author": "softsapphcsap",
      "body": "makes me feel better to know this happens to other people. for me it’s even worse if i bought the food",
      "created_utc": 1723037765.0,
      "score": 7,
      "context": [
        {
          "id": "lgxp16x",
          "author": "Cold_Pressure5351",
          "body": "The worst part for me is when I have not been able to eat all day, so I cook a safe food. But when I go to eat it I lose my appetite and throw the food out.",
          "created_utc": 1723037285.0
        }
      ]
    },
    {
      "id": "lgyoxly",
      "author": "None",
      "body": "same guilt over wasting food always drives me crazy, so i usually just end up micromanaging my cooking instead to make sure its perfect when its done. Making dinner is usually 2 hours of anxiety minimum",
      "created_utc": 1723048826.0,
      "score": 5,
      "context": [
        {
          "id": "lgxp16x",
          "author": "Cold_Pressure5351",
          "body": "The worst part for me is when I have not been able to eat all day, so I cook a safe food. But when I go to eat it I lose my appetite and throw the food out.",
          "created_utc": 1723037285.0
        }
      ]
    },
    {
      "id": "lh1us8p",
      "author": "gayassjackrabbit",
      "body": "Genuinely makes me want to sob. I’ve got TMJ as well so bonus points for the times when as soon as my ARFID related food disgust subsides enough to eat my jaw locks and physically prevents me from eating\n\nEnsures are really friggin expensive",
      "created_utc": 1723087079.0,
      "score": 3,
      "context": [
        {
          "id": "lgxp16x",
          "author": "Cold_Pressure5351",
          "body": "The worst part for me is when I have not been able to eat all day, so I cook a safe food. But when I go to eat it I lose my appetite and throw the food out.",
          "created_utc": 1723037285.0
        }
      ]
    },
    {
      "id": "lh118r8",
      "author": "Walusqueegee",
      "body": "Are you me",
      "created_utc": 1723075759.0,
      "score": 2,
      "context": [
        {
          "id": "lgxp16x",
          "author": "Cold_Pressure5351",
          "body": "The worst part for me is when I have not been able to eat all day, so I cook a safe food. But when I go to eat it I lose my appetite and throw the food out.",
          "created_utc": 1723037285.0
        }
      ]
    },
    {
      "id": "lgycwlj",
      "author": "LowRhubarb5668",
      "body": "Yeah the health guilt is real bad along with the food pushers. My dad and stepmother are rather annoying with it trying to scare me into eating what they deem as healthy over what I can/do eat. Like no I’m working on myself at my own pace and they can keep their stinky foods. I would rather starve if that was the last food on earth as my brain doesn’t register anything that smells off or just stinks as food. They just can’t get that through their heads and it’s frustrating.",
      "created_utc": 1723045134.0,
      "score": 8,
      "context": [
        {
          "id": "lgxqud1",
          "author": "WildWallFlower97",
          "body": "Worrying about my health is a huge one. My safe foods aren't the best for me and as I'm getting a bit older I'm starting to worry. \nOther than that it's just embarrassing. I've skipped so many social events, I hate when people comment on the fact that I'm not eating. Like just mind your own business and leave me alone. I don't understand why it's such a big deal to everyone else what I do or don't eat.",
          "created_utc": 1723037942.0
        }
      ]
    },
    {
      "id": "lgyprhb",
      "author": "None",
      "body": "the health problems are scary, ive had to go to the doctor a lot for a ton of issues, usually malnutrition, issues around being underweight, anemia (which im already very genetically prone to), etc, and its always so difficult to explain the diet issues",
      "created_utc": 1723049079.0,
      "score": 4,
      "context": [
        {
          "id": "lgxqud1",
          "author": "WildWallFlower97",
          "body": "Worrying about my health is a huge one. My safe foods aren't the best for me and as I'm getting a bit older I'm starting to worry. \nOther than that it's just embarrassing. I've skipped so many social events, I hate when people comment on the fact that I'm not eating. Like just mind your own business and leave me alone. I don't understand why it's such a big deal to everyone else what I do or don't eat.",
          "created_utc": 1723037942.0
        }
      ]
    },
    {
      "id": "lgxvjb2",
      "author": "None",
      "body": "godd those are so real, i relate so hard to all of them but i thought it'd be too much to include\n\npeople commenting on the side effects too, im super underweight (have been since birth) and its so obvious that i have deficiencies, its so difficult to explain to people who are concerned for my health why i cant just eat things that'd help",
      "created_utc": 1723039557.0,
      "score": 2,
      "context": [
        {
          "id": "lgxup5b",
          "author": "honeybin_sugar",
          "body": "Ppl not understanding and just dismissing it a picky eating, making jokes about what you eat or commenting negatively about the choice of food.\n\nAppetite literally not existing, yet still having to think of sth to eat to not starve, even tho not eating anything sounds way better, but yk you can't do that.\n\n\"Side effects\" like a shitty immune system, nutrition deficiencies, unhealthy Weight-loss, such things that come as a by product an affect your health.\n\nNot being able to eat sth even tho it looks so damn good or smells nice bc it includes a texture, food or whatever and therefore ain't an option.",
          "created_utc": 1723039270.0
        }
      ]
    },
    {
      "id": "lgzlno7",
      "author": "None",
      "body": "nothing makes me feel horrible about myself quicker than situations like that. im not having fun either",
      "created_utc": 1723058777.0,
      "score": 4,
      "context": [
        {
          "id": "lgy91jf",
          "author": "39dayou",
          "body": "never really feeling fully satisfied and having to explain to ppl even closest to me that it isn’t just picky eating. having to hear how difficult you are and how they find it annoying/inconvenient to find somewhere to eat when w me then imagine how it is for me to live like this every day for every meal. it really is debilitating",
          "created_utc": 1723043930.0
        }
      ]
    },
    {
      "id": "lh1pr22",
      "author": "Jaceywac3y",
      "body": "Omg I didn’t know acid reflux and arfid were linked??!??!?",
      "created_utc": 1723085010.0,
      "score": 1,
      "context": [
        {
          "id": "lgxv7cr",
          "author": "geekgeek2019",
          "body": "wasting food or when people put efforts to try to make me eat AND ACID FREAKING REFLUX",
          "created_utc": 1723039445.0
        }
      ]
    },
    {
      "id": "lh0s015",
      "author": "Many-Juggernaut-2153",
      "body": "That’s when I find the urge to eat cereal",
      "created_utc": 1723072402.0,
      "score": 3,
      "context": [
        {
          "id": "lgyvuyl",
          "author": "Living-Celebration57",
          "body": "Oh I got one, when you haven’t eaten in a while  so u start to shake and get sleepy it’s like it erases the urge to eat even tho u know u need to but now you’re too tired and u just want to sleep.",
          "created_utc": 1723050923.0
        }
      ]
    },
    {
      "id": "lh002pw",
      "author": "MidnightFox452",
      "body": "Ordering at Subway is like torture for me, which is annoying since I love my typical order there and would probably eat it every day if I could.\n\n\"Can I get a turkey and white-american cheese sub on white bread? Nothing else.\"\n\n\"Toasted?\"\n\n\"No\"\n\n\"Any other meats?\"\n\n\"No\"\n\n\"Any vegetables?\"\n\n\"No...\"\n\n\"Any sauces?\"\n\n\"No 😓\"\n\n\"Are you sure? Is that all?\"\n\n\"Yes 😭\"\n\nI don't blame the employees or anything, it's the script they're supposed to run and it's not every day they encounter an adult ordering a $10 turkey and cheese sandwich. It just makes me feel so childish.",
      "created_utc": 1723063161.0,
      "score": 8,
      "context": [
        {
          "id": "lgzodht",
          "author": "Miserable_Unit_9529",
          "body": "Ordering food and asking for things to not be on it and being looked at as a child 🙁 or being made fun of for ordering “cucumbers” instead of a side salad",
          "created_utc": 1723059607.0
        }
      ]
    },
    {
      "id": "lgzpdug",
      "author": "None",
      "body": "im arab and i get looked at weird every time i go to any shawarma place and ask for chicken with nothing else in it lol, some restaurants get used to it if you keep going to the same place though",
      "created_utc": 1723059912.0,
      "score": 3,
      "context": [
        {
          "id": "lgzodht",
          "author": "Miserable_Unit_9529",
          "body": "Ordering food and asking for things to not be on it and being looked at as a child 🙁 or being made fun of for ordering “cucumbers” instead of a side salad",
          "created_utc": 1723059607.0
        }
      ]
    },
    {
      "id": "lh1olh7",
      "author": "honeynut_queerio",
      "body": "I haven’t found a lot of other people dealing with weight gain instead of loss as a side effect of ARFID, but I believe more of us are out there. My safe foods are all varieties of bread and cheese, and despite ARFID unintentionally restricting my food intake, my body I guess is also preparing for a famine :/",
      "created_utc": 1723084548.0,
      "score": 5,
      "context": [
        {
          "id": "lgykba5",
          "author": "starsandsunandmoon",
          "body": "The constant weight gain, despite trying to be healthier, from my body thinking its going to experience another famine.\n\nI'm 26, and at this point, I believe I'm going to be fat for the rest of my life. Arfid on top of cholinergic urticaria means both food and exercise are extremely limited for me, and that has to be the hardest thing for me to cope with.",
          "created_utc": 1723047415.0
        }
      ]
    },
    {
      "id": "lh1qi3b",
      "author": "Jaceywac3y",
      "body": "this one",
      "created_utc": 1723085310.0,
      "score": 1,
      "context": [
        {
          "id": "lh1o8b2",
          "author": "jintana",
          "body": "Romantic partners resented me for not being interested in sharing food experiences or preparing certain foods.",
          "created_utc": 1723084406.0
        }
      ]
    },
    {
      "id": "lh2z1na",
      "author": "None",
      "body": "I usually appreciate the concern but it quickly gets overwhelming sometimes. I’m as healthy as I can be rn, but i still look very skinny and my skin can very easily start to discolor, so going to school can be really difficult when every teacher thinks my parents aren’t feeding me lol. One teacher for about a month made every conversation we had about why I should eat meat then called my parents to tell them I need to eat meat",
      "created_utc": 1723110155.0,
      "score": 2,
      "context": [
        {
          "id": "lh1ujcc",
          "author": "gayassjackrabbit",
          "body": "Constantly needing to defend my eating habits. My friends all know I have food sensitivities and have all been super great about it, but I’ve had extremely few friends whose families didn’t accuse me of being anorexic the first several times of meeting me. Even if I was, why would you think commenting like that would help?\n\nHad an ex boyfriend whose parents went on a 45 minute lecture about how I didn’t have to worry about looking dainty eating in front of their son and how I was already too thin and just jeez lady let me eat my pocket cheerios in peace your meal looks so wonderful but you are going to be very insulted when I put this into my mouth and immediately vomit",
          "created_utc": 1723086973.0
        }
      ]
    },
    {
      "id": "lh2zjha",
      "author": "None",
      "body": "Oh my god I completely forgot to mention this. In my culture whenever you go to someone’s house you will get offered food and I feel so guilty when I constantly decline everything that’s gets offered. They usually keep pushing because they think I’m declining out of politeness",
      "created_utc": 1723110468.0,
      "score": 2,
      "context": [
        {
          "id": "lh2jmz7",
          "author": "apizzamx",
          "body": "the fact that i really struggle with other people cooking for me, i feel really guilty when people offer to make food and i get disgusted at the thought of it. (the thoughts aren’t as prevalent about eating at restaurants? idk why. the food there just feels like its Safer). \nWhen friends make me food and it has unsafe elements i just feel awful and try to force it down but often doesn’t work. \nfamily made food is less scary because i’ve had it since birth so it’s predictable and safe.",
          "created_utc": 1723100083.0
        }
      ]
    },
    {
      "id": "lgxwffy",
      "author": "honeybin_sugar",
      "body": "It is really annoying when ppl make sth that's not their business their business. I never hear the end of how \"unhealthy\" my diet is since I can't really eat any veggies so I get why it seems unhealthy in that sense. But God, I have a brain too. I know it's not healthy. But unlike those ppl who are noisy like that, I can't change it even if I wanted to. It's really annoying.",
      "created_utc": 1723039859.0,
      "score": 2,
      "context": [
        {
          "id": "lgxup5b",
          "author": "honeybin_sugar",
          "body": "Ppl not understanding and just dismissing it a picky eating, making jokes about what you eat or commenting negatively about the choice of food.\n\nAppetite literally not existing, yet still having to think of sth to eat to not starve, even tho not eating anything sounds way better, but yk you can't do that.\n\n\"Side effects\" like a shitty immune system, nutrition deficiencies, unhealthy Weight-loss, such things that come as a by product an affect your health.\n\nNot being able to eat sth even tho it looks so damn good or smells nice bc it includes a texture, food or whatever and therefore ain't an option.",
          "created_utc": 1723039270.0
        },
        {
          "id": "lgxvjb2",
          "author": "None",
          "body": "godd those are so real, i relate so hard to all of them but i thought it'd be too much to include\n\npeople commenting on the side effects too, im super underweight (have been since birth) and its so obvious that i have deficiencies, its so difficult to explain to people who are concerned for my health why i cant just eat things that'd help",
          "created_utc": 1723039557.0
        }
      ]
    },
    {
      "id": "lh2brwg",
      "author": "geekgeek2019",
      "body": "Yesss not eating on time gave me bad acid reflux. Now I gotta eat something or the other",
      "created_utc": 1723095376.0,
      "score": 1,
      "context": [
        {
          "id": "lgxv7cr",
          "author": "geekgeek2019",
          "body": "wasting food or when people put efforts to try to make me eat AND ACID FREAKING REFLUX",
          "created_utc": 1723039445.0
        },
        {
          "id": "lh1pr22",
          "author": "Jaceywac3y",
          "body": "Omg I didn’t know acid reflux and arfid were linked??!??!?",
          "created_utc": 1723085010.0
        }
      ]
    },
    {
      "id": "lh012de",
      "author": "Miserable_Unit_9529",
      "body": "I literally said “just ham and cheese please” \n\nSauce? \nNah \nVeggies? \nOh no thank you \n\n😭 why is it so embarrassing? 🙈",
      "created_utc": 1723063467.0,
      "score": 5,
      "context": [
        {
          "id": "lgzodht",
          "author": "Miserable_Unit_9529",
          "body": "Ordering food and asking for things to not be on it and being looked at as a child 🙁 or being made fun of for ordering “cucumbers” instead of a side salad",
          "created_utc": 1723059607.0
        },
        {
          "id": "lh002pw",
          "author": "MidnightFox452",
          "body": "Ordering at Subway is like torture for me, which is annoying since I love my typical order there and would probably eat it every day if I could.\n\n\"Can I get a turkey and white-american cheese sub on white bread? Nothing else.\"\n\n\"Toasted?\"\n\n\"No\"\n\n\"Any other meats?\"\n\n\"No\"\n\n\"Any vegetables?\"\n\n\"No...\"\n\n\"Any sauces?\"\n\n\"No 😓\"\n\n\"Are you sure? Is that all?\"\n\n\"Yes 😭\"\n\nI don't blame the employees or anything, it's the script they're supposed to run and it's not every day they encounter an adult ordering a $10 turkey and cheese sandwich. It just makes me feel so childish.",
          "created_utc": 1723063161.0
        }
      ]
    },
    {
      "id": "lh1q7tr",
      "author": "Jaceywac3y",
      "body": "How did u get a transcript from my real life conversations 😭 (we have the same subway order btw 💪)",
      "created_utc": 1723085196.0,
      "score": 3,
      "context": [
        {
          "id": "lgzodht",
          "author": "Miserable_Unit_9529",
          "body": "Ordering food and asking for things to not be on it and being looked at as a child 🙁 or being made fun of for ordering “cucumbers” instead of a side salad",
          "created_utc": 1723059607.0
        },
        {
          "id": "lh002pw",
          "author": "MidnightFox452",
          "body": "Ordering at Subway is like torture for me, which is annoying since I love my typical order there and would probably eat it every day if I could.\n\n\"Can I get a turkey and white-american cheese sub on white bread? Nothing else.\"\n\n\"Toasted?\"\n\n\"No\"\n\n\"Any other meats?\"\n\n\"No\"\n\n\"Any vegetables?\"\n\n\"No...\"\n\n\"Any sauces?\"\n\n\"No 😓\"\n\n\"Are you sure? Is that all?\"\n\n\"Yes 😭\"\n\nI don't blame the employees or anything, it's the script they're supposed to run and it's not every day they encounter an adult ordering a $10 turkey and cheese sandwich. It just makes me feel so childish.",
          "created_utc": 1723063161.0
        }
      ]
    },
    {
      "id": "lgzpnco",
      "author": "Miserable_Unit_9529",
      "body": "Oh 100% I have safe places now but the anxiety I get going new places or with new people is AWFUL haha",
      "created_utc": 1723059991.0,
      "score": 3,
      "context": [
        {
          "id": "lgzodht",
          "author": "Miserable_Unit_9529",
          "body": "Ordering food and asking for things to not be on it and being looked at as a child 🙁 or being made fun of for ordering “cucumbers” instead of a side salad",
          "created_utc": 1723059607.0
        },
        {
          "id": "lgzpdug",
          "author": "None",
          "body": "im arab and i get looked at weird every time i go to any shawarma place and ask for chicken with nothing else in it lol, some restaurants get used to it if you keep going to the same place though",
          "created_utc": 1723059912.0
        }
      ]
    },
    {
      "id": "lh1pdiq",
      "author": "starsandsunandmoon",
      "body": "It's a relief to finally find someone else who also has the same side effect, I don't feel so alone now. I'm sorry to hear you are also struggling, though. My diet is unintentionally very carb based, so I'm constantly piling on weight. We'll get there one day, I'm wishing you all the best 🧡",
      "created_utc": 1723084859.0,
      "score": 5,
      "context": [
        {
          "id": "lgykba5",
          "author": "starsandsunandmoon",
          "body": "The constant weight gain, despite trying to be healthier, from my body thinking its going to experience another famine.\n\nI'm 26, and at this point, I believe I'm going to be fat for the rest of my life. Arfid on top of cholinergic urticaria means both food and exercise are extremely limited for me, and that has to be the hardest thing for me to cope with.",
          "created_utc": 1723047415.0
        },
        {
          "id": "lh1olh7",
          "author": "honeynut_queerio",
          "body": "I haven’t found a lot of other people dealing with weight gain instead of loss as a side effect of ARFID, but I believe more of us are out there. My safe foods are all varieties of bread and cheese, and despite ARFID unintentionally restricting my food intake, my body I guess is also preparing for a famine :/",
          "created_utc": 1723084548.0
        }
      ]
    },
    {
      "id": "lh1pw7k",
      "author": "Jaceywac3y",
      "body": "Omg I’ve found my ppl 🥹",
      "created_utc": 1723085067.0,
      "score": 2,
      "context": [
        {
          "id": "lgykba5",
          "author": "starsandsunandmoon",
          "body": "The constant weight gain, despite trying to be healthier, from my body thinking its going to experience another famine.\n\nI'm 26, and at this point, I believe I'm going to be fat for the rest of my life. Arfid on top of cholinergic urticaria means both food and exercise are extremely limited for me, and that has to be the hardest thing for me to cope with.",
          "created_utc": 1723047415.0
        },
        {
          "id": "lh1olh7",
          "author": "honeynut_queerio",
          "body": "I haven’t found a lot of other people dealing with weight gain instead of loss as a side effect of ARFID, but I believe more of us are out there. My safe foods are all varieties of bread and cheese, and despite ARFID unintentionally restricting my food intake, my body I guess is also preparing for a famine :/",
          "created_utc": 1723084548.0
        }
      ]
    },
    {
      "id": "lgztgwn",
      "author": "None",
      "body": "actually the thing i get anxious about the most is if they remember me specifically, which they probably do lol. The chillis closest to my house is in a food court at a mall, they told my dad they remember me as the girl who keeps ordering garlic bread with no cheese and nothing else, either that or i come in to ask for lemon slices and leave (i need lemon to eat almost anything)",
      "created_utc": 1723061157.0,
      "score": 3,
      "context": [
        {
          "id": "lgzodht",
          "author": "Miserable_Unit_9529",
          "body": "Ordering food and asking for things to not be on it and being looked at as a child 🙁 or being made fun of for ordering “cucumbers” instead of a side salad",
          "created_utc": 1723059607.0
        },
        {
          "id": "lgzpdug",
          "author": "None",
          "body": "im arab and i get looked at weird every time i go to any shawarma place and ask for chicken with nothing else in it lol, some restaurants get used to it if you keep going to the same place though",
          "created_utc": 1723059912.0
        },
        {
          "id": "lgzpnco",
          "author": "Miserable_Unit_9529",
          "body": "Oh 100% I have safe places now but the anxiety I get going new places or with new people is AWFUL haha",
          "created_utc": 1723059991.0
        }
      ]
    },
    {
      "id": "lh1pki7",
      "author": "honeynut_queerio",
      "body": "Aww thank you. You too 💜 you’re not alone",
      "created_utc": 1723084937.0,
      "score": 2,
      "context": [
        {
          "id": "lgykba5",
          "author": "starsandsunandmoon",
          "body": "The constant weight gain, despite trying to be healthier, from my body thinking its going to experience another famine.\n\nI'm 26, and at this point, I believe I'm going to be fat for the rest of my life. Arfid on top of cholinergic urticaria means both food and exercise are extremely limited for me, and that has to be the hardest thing for me to cope with.",
          "created_utc": 1723047415.0
        },
        {
          "id": "lh1olh7",
          "author": "honeynut_queerio",
          "body": "I haven’t found a lot of other people dealing with weight gain instead of loss as a side effect of ARFID, but I believe more of us are out there. My safe foods are all varieties of bread and cheese, and despite ARFID unintentionally restricting my food intake, my body I guess is also preparing for a famine :/",
          "created_utc": 1723084548.0
        },
        {
          "id": "lh1pdiq",
          "author": "starsandsunandmoon",
          "body": "It's a relief to finally find someone else who also has the same side effect, I don't feel so alone now. I'm sorry to hear you are also struggling, though. My diet is unintentionally very carb based, so I'm constantly piling on weight. We'll get there one day, I'm wishing you all the best 🧡",
          "created_utc": 1723084859.0
        }
      ]
    },
    {
      "id": "lgztpqv",
      "author": "Miserable_Unit_9529",
      "body": "I find comfort in the familiarity 😭 because they already judged me once so it’s out of the way haha",
      "created_utc": 1723061232.0,
      "score": 3,
      "context": [
        {
          "id": "lgzodht",
          "author": "Miserable_Unit_9529",
          "body": "Ordering food and asking for things to not be on it and being looked at as a child 🙁 or being made fun of for ordering “cucumbers” instead of a side salad",
          "created_utc": 1723059607.0
        },
        {
          "id": "lgzpdug",
          "author": "None",
          "body": "im arab and i get looked at weird every time i go to any shawarma place and ask for chicken with nothing else in it lol, some restaurants get used to it if you keep going to the same place though",
          "created_utc": 1723059912.0
        },
        {
          "id": "lgzpnco",
          "author": "Miserable_Unit_9529",
          "body": "Oh 100% I have safe places now but the anxiety I get going new places or with new people is AWFUL haha",
          "created_utc": 1723059991.0
        },
        {
          "id": "lgztgwn",
          "author": "None",
          "body": "actually the thing i get anxious about the most is if they remember me specifically, which they probably do lol. The chillis closest to my house is in a food court at a mall, they told my dad they remember me as the girl who keeps ordering garlic bread with no cheese and nothing else, either that or i come in to ask for lemon slices and leave (i need lemon to eat almost anything)",
          "created_utc": 1723061157.0
        }
      ]
    }
  ]
}