{
  "id": "1er1hc9",
  "subreddit": "ARFID",
  "author": "Glittering-Care-5638",
  "created_utc": 1723533034.0,
  "title": "I almost starved to death in a wilderness program as a kid, and I’ve had severe ARFID for 20 years because of it",
  "selftext": "When I was 16, I was sent to a wilderness program where we got stranded in a blizzard, ran out of food, and I fully EXPECTED to die from either the hypothermia or the starvation every second of every day.\n\nThe full story is here for anyone who is curious. HUGEEE TRIGGER WARNING THOUGH!!!! In addition to the physical and nutritional neglect, and being forced to survive severe weather conditions in one of the most isolated areas of the world as a kid, this also includes kidnapping and hints at CSA, as well as a few, more “tame” but still TW worthy themes\n\nhttps://open.substack.com/pub/survivingthetroubledteenindustry/p/whiteout-in-the-west-desert?r=2mh2r2&utm_medium=ios\n\nFor the three years after that experience, I was forced to live on just enough caloric intake to stay alive.\n\nEver since, I have had severely debilitating ARFID symptoms. At the moment, I’m dry heaving from the intense and painful nausea I get instead of hunger pangs, I haven’t been able to eat for 2 days straight, and the food we have available in the house makes me want to vomit at the thought of even putting half a bite of any of it into my mouth, let alone actually chewing and swallowing it.\n\nI hate this. I hate living like this. I hate that my kids don’t know what a “family meal” is at ages 10 and 14 because it’s so bad that I can’t even force myself to eat in front of my own kids so they can experience a normal family dynamic around food. I can rarely cook without getting too disgusted to finish preparing a meal. I have a severe aversion to kitchen spaces in general. That carries over to grocery stores as well.\n\nWhy am I so physically, mentally, and emotionally incapable of doing one simple thing that is necessary to the survival of every single living thing and needs to be done multiple times a day without feeling like I’d rather rip my own skin off than put food into my own mouth??\n\nI’m just venting now, and I don’t even remember the original purpose of this post. \n\nI just wish I could have one day where the fact that food exists and that I need it to live doesn’t trigger a panic attack or meltdown.\n\n",
  "url": "https://www.reddit.com/r/ARFID/comments/1er1hc9/i_almost_starved_to_death_in_a_wilderness_program/",
  "score": 115,
  "num_comments": 11,
  "comments": [
    {
      "id": "lhvor8k",
      "author": "racheltheangel222",
      "body": "i also went through a forced in patient program. i’m so sorry to hear about your experience. wilderness programs and “troubled teen” places should be illegal.",
      "created_utc": 1723537326.0,
      "score": 37,
      "context": []
    },
    {
      "id": "lhy0xqy",
      "author": "phinneas-gage",
      "body": "i’m so sorry you had to experience this. at the same time, i’m so beyond relieved to find someone else you had had a similar experience. i was already extremely selective before being forced into the TTI, but it has gotten so incredibly bad as time has gone on. in addition to my regular ARFID triggers, i have PTSD symptoms with certain foods, like quinoa, lentils, and beans. you are not alone.",
      "created_utc": 1723571541.0,
      "score": 8,
      "context": []
    },
    {
      "id": "lhyjurx",
      "author": "samit2heck",
      "body": "Wow I'm so sorry this happened to you. I had no idea you could develop ARFID this way. Thank you for sharing.",
      "created_utc": 1723577554.0,
      "score": 5,
      "context": []
    },
    {
      "id": "li037qv",
      "author": "Impossible-Amoeba846",
      "body": "I truly cannot imagine what you went through. I also suffer from ARFID, for as long as I can remember—around 18 months old, according to my parents—but apparently an illness with a terrible-tasting medicine (or something along those lines) was the impetus to my “picky” eating. \n\nI wish I could hand you a cure, but I’m still searching for one. But I really do hope you open up (to your own comfort level) to your kids about your experiences because you don’t deserve to feel shame and I don’t believe you need to suffer from isolation at mealtimes as long as you can sit with others as they eat. I’m not always hungry, but I’m happy to sit and eat with others!! (As long as it doesn’t smell HORRIFICALLY strong. That can def influence my mood tbh.)\n\nI can’t say I know exactly how you feel—because I’m not you—but I absolutely know what it’s like to feel ashamed and embarrassed and wildly anxious at mealtimes. I know the depression and shame that follows anyone’s unnecessary comments on my eating habits. I can’t be there in person for you to give you a hug. But I am rooting for you and wishing you all the best 🩷🩷🩷",
      "created_utc": 1723597781.0,
      "score": 5,
      "context": []
    },
    {
      "id": "li0gqoe",
      "author": "huntresswizard_",
      "body": "Oh dear friend…. Like you, my Arfid is trauma based. Addressing and healing the source of trauma, in my experience, has lessened the Arfid symptoms. My heart truly goes out to you because I lived with that intense aversion to food you describe, in almost all the same ways. I feel guilt not being able to eat meals with my kids too most days, or cook regularly for them. I’d rather sit in the grocery store parking lot for an hour than go in and just get the physical action of buying food done. I had to unfollow recipe accounts on social media because I’d be gagging and throwing up just scrolling through social media. It was horrible. Ensure plus was the only thing that got me through 1 entire year. \nI’ve been healing since then though, healing what apparently caused the dysfunction and while I still deal with Arfid, I can at least tolerate the sight and smell of food now which in turn makes it easier for me to eat when I know I have to, but just don’t feel the cue (it’s been over a decade of not feeling the feeling most people know as hunger - I used to only know I hadn’t eaten when it had gone too far and I got headaches, weakness, and lethargic) I still regularly forget to eat, but I’m not vomiting to the point I can’t when I try to rectify that now. \nI hope you find peace one day friend, I hope you get all the help you have available to you, and I hope it changes your life for the better.",
      "created_utc": 1723602938.0,
      "score": 3,
      "context": []
    },
    {
      "id": "li0qre8",
      "author": "TTI_Gremlin",
      "body": "It sounds like you might need a nutrient enema. Send in the butt-food!",
      "created_utc": 1723607163.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lm25wwl",
      "author": "sophielikesfrogs",
      "body": "wait … kinda me too … i experienced forced starvation on a troubled teen program when i was 16 and it made my picky food habits blossom into full blown arfid. i also have a fear of contaminated water. this is v validating to know im not the only one.",
      "created_utc": 1725766355.0,
      "score": 2,
      "context": []
    },
    {
      "id": "li0wpe3",
      "author": "Glittering-Care-5638",
      "body": "🫶🏻🫶🏻🫶🏻",
      "created_utc": 1723610015.0,
      "score": 2,
      "context": [
        {
          "id": "lhy0xqy",
          "author": "phinneas-gage",
          "body": "i’m so sorry you had to experience this. at the same time, i’m so beyond relieved to find someone else you had had a similar experience. i was already extremely selective before being forced into the TTI, but it has gotten so incredibly bad as time has gone on. in addition to my regular ARFID triggers, i have PTSD symptoms with certain foods, like quinoa, lentils, and beans. you are not alone.",
          "created_utc": 1723571541.0
        }
      ]
    },
    {
      "id": "li0wo4o",
      "author": "Glittering-Care-5638",
      "body": "I have been working extensively for a few years on healing the trauma that caused it in the first place. It wouldn’t surprise me if THAT is part of what’s triggered me into more frequent and intense episodes over that time period. At this point, it’s more infuriatingly annoying than anything. I’ve also had to be mindful of the social accounts I follow that involve food in any way on a regular basis. I have told FB to stop showing me restaurant ads 😅",
      "created_utc": 1723609997.0,
      "score": 1,
      "context": [
        {
          "id": "li0gqoe",
          "author": "huntresswizard_",
          "body": "Oh dear friend…. Like you, my Arfid is trauma based. Addressing and healing the source of trauma, in my experience, has lessened the Arfid symptoms. My heart truly goes out to you because I lived with that intense aversion to food you describe, in almost all the same ways. I feel guilt not being able to eat meals with my kids too most days, or cook regularly for them. I’d rather sit in the grocery store parking lot for an hour than go in and just get the physical action of buying food done. I had to unfollow recipe accounts on social media because I’d be gagging and throwing up just scrolling through social media. It was horrible. Ensure plus was the only thing that got me through 1 entire year. \nI’ve been healing since then though, healing what apparently caused the dysfunction and while I still deal with Arfid, I can at least tolerate the sight and smell of food now which in turn makes it easier for me to eat when I know I have to, but just don’t feel the cue (it’s been over a decade of not feeling the feeling most people know as hunger - I used to only know I hadn’t eaten when it had gone too far and I got headaches, weakness, and lethargic) I still regularly forget to eat, but I’m not vomiting to the point I can’t when I try to rectify that now. \nI hope you find peace one day friend, I hope you get all the help you have available to you, and I hope it changes your life for the better.",
          "created_utc": 1723602938.0
        }
      ]
    },
    {
      "id": "lmeb3e2",
      "author": "Glittering-Care-5638",
      "body": "I see you survivor 🫶🏻🫶🏻",
      "created_utc": 1725946302.0,
      "score": 1,
      "context": [
        {
          "id": "lm25wwl",
          "author": "sophielikesfrogs",
          "body": "wait … kinda me too … i experienced forced starvation on a troubled teen program when i was 16 and it made my picky food habits blossom into full blown arfid. i also have a fear of contaminated water. this is v validating to know im not the only one.",
          "created_utc": 1725766355.0
        }
      ]
    },
    {
      "id": "li2fy9e",
      "author": "huntresswizard_",
      "body": "Omg yes, the act of trying to heal is in and of itself a sort of trigger. You gotta feel it to heal it, and that’s so hard for survivors of trauma like you experienced. That’s why having a professional to help you process those feelings is so critical and I hope you found one you can trust. It sounds like you’re well on the road to recovery so I don’t want to come across preachy. You’re definitely doing your part (and then some) ❤️ it’s a healing journey, and I don’t really think it ever ends, it just gets better and more manageable. I hope you see that green grass sooner rather than later 🤗",
      "created_utc": 1723640656.0,
      "score": 2,
      "context": [
        {
          "id": "li0gqoe",
          "author": "huntresswizard_",
          "body": "Oh dear friend…. Like you, my Arfid is trauma based. Addressing and healing the source of trauma, in my experience, has lessened the Arfid symptoms. My heart truly goes out to you because I lived with that intense aversion to food you describe, in almost all the same ways. I feel guilt not being able to eat meals with my kids too most days, or cook regularly for them. I’d rather sit in the grocery store parking lot for an hour than go in and just get the physical action of buying food done. I had to unfollow recipe accounts on social media because I’d be gagging and throwing up just scrolling through social media. It was horrible. Ensure plus was the only thing that got me through 1 entire year. \nI’ve been healing since then though, healing what apparently caused the dysfunction and while I still deal with Arfid, I can at least tolerate the sight and smell of food now which in turn makes it easier for me to eat when I know I have to, but just don’t feel the cue (it’s been over a decade of not feeling the feeling most people know as hunger - I used to only know I hadn’t eaten when it had gone too far and I got headaches, weakness, and lethargic) I still regularly forget to eat, but I’m not vomiting to the point I can’t when I try to rectify that now. \nI hope you find peace one day friend, I hope you get all the help you have available to you, and I hope it changes your life for the better.",
          "created_utc": 1723602938.0
        },
        {
          "id": "li0wo4o",
          "author": "Glittering-Care-5638",
          "body": "I have been working extensively for a few years on healing the trauma that caused it in the first place. It wouldn’t surprise me if THAT is part of what’s triggered me into more frequent and intense episodes over that time period. At this point, it’s more infuriatingly annoying than anything. I’ve also had to be mindful of the social accounts I follow that involve food in any way on a regular basis. I have told FB to stop showing me restaurant ads 😅",
          "created_utc": 1723609997.0
        }
      ]
    }
  ]
}