{
  "id": "1es6hk3",
  "subreddit": "ARFID",
  "author": "None",
  "created_utc": 1723653851.0,
  "title": "I feel like crying after reading Dailymail comments about ARFID",
  "selftext": "I know I shouldn’t of done it but I did. I clicked an article about a boy with ARFID refusing foods and I couldn’t help myself and clicked to read the comments and oh boy. It honestly hit me harder then I thought. Maybe I’m just overly sensitive but I felt like crying reading through hundreds of comments with people saying ‘Back in the 70s you ate what you were given’ and ‘He won’t starve stop giving in to this!’ ‘You wouldn’t hear this in a 3rd world country’, ‘Just starve him and he’ll eat!’. ‘It’s funny how they’ll eat McDonalds and fast foods’. \n\nDo they realise that people with ARFID WILL starve possibly to death if not given safe foods? That McDonalds he is getting is literally keeping his heart beating. I feel like crying and I’m so angry about this. :( ",
  "url": "https://www.reddit.com/r/ARFID/comments/1es6hk3/i_feel_like_crying_after_reading_dailymail/",
  "score": 416,
  "num_comments": 53,
  "comments": [
    {
      "id": "li3vouv",
      "author": "lavendermenacing",
      "body": "My grandpa had arfid in the 40s. The school tried to make him eat a ham and cheese sandwich for lunch and he refused. They told him that if he didn't eat he wouldn't be able to go back to class, he spent three days sitting in the lunchroom all day until the school started making him a sandwich with just ham. People who say that arfid didn't exist in the past have no idea what they're talking about.",
      "created_utc": 1723657521.0,
      "score": 365,
      "context": []
    },
    {
      "id": "li3mgkl",
      "author": "thrivingsad",
      "body": "No, they don’t realize it. It doesn’t impact them and they know nothing about it, that’s how they’re able to make those comments without a second thought\n\nMy dad had that mindset, lo and behold at 8 y/o I had to be put on a feeding tube because I wouldn’t eat anything put in front of me. Until people get a real experience like that, they will continue to say any harmful nonsense that makes them feel better than those who struggle more than them\n\nDon’t pay it mind. They’re ignorant, and can’t even recognize it, which is something for them to be embarrassed of\n\nSimilarly; don’t let ignorance & stupidity get to you. View it like a 5 year old saying it— seriously. That’s what the weight of their words amounts to, if even\n\nBest of luck",
      "created_utc": 1723654658.0,
      "score": 245,
      "context": []
    },
    {
      "id": "li3voy6",
      "author": "tenth",
      "body": "There are people in this world that will leave nasty comments on a picture of a puppy smiling. Just know that. ",
      "created_utc": 1723657521.0,
      "score": 88,
      "context": []
    },
    {
      "id": "li3m47k",
      "author": "Tallem00",
      "body": "Dailymail is a conservative tabloid that should honestly just be avoided at all costs. Everything it says and everyone who comments under it is speaking in incredibly bad faith",
      "created_utc": 1723654553.0,
      "score": 166,
      "context": []
    },
    {
      "id": "li3pye5",
      "author": "KenMixtape",
      "body": "None of those fools pay my bills and I'm probably living a better life than most of them, so fuck 'em",
      "created_utc": 1723655751.0,
      "score": 44,
      "context": []
    },
    {
      "id": "li3vbsv",
      "author": "biscottiapricot",
      "body": "i did an assessment in uni about media literacy and we had to criticise and rewrite an article and the lecturer suggested we use a daily mail one",
      "created_utc": 1723657410.0,
      "score": 43,
      "context": []
    },
    {
      "id": "li3nt4i",
      "author": "First-Butterscotch-3",
      "body": "Daily heil is a rag which exists to spread hate and encourage ignorance \n\nIgnore it like any normal person should",
      "created_utc": 1723655084.0,
      "score": 55,
      "context": []
    },
    {
      "id": "li3xcyn",
      "author": "FiveLargeFries",
      "body": "People who either don’t have arfid or have no one they care about with arfid will never understand how comments like this can hurt\n\nYou’ll go through life hearing these types of comments a lot, eventually the sting won’t be there anymore",
      "created_utc": 1723658034.0,
      "score": 20,
      "context": []
    },
    {
      "id": "li4rhb1",
      "author": "Mountain-Classroom61",
      "body": "The way I always describe arfid to people is to say “you know how some parents say if kids are hungry enough they will eat what they are given… I wouldn’t.” So it always makes me sad to remember there are people out there who would starve their children  to try and make them eat (regardless of if that child has arfid or not)",
      "created_utc": 1723667603.0,
      "score": 19,
      "context": []
    },
    {
      "id": "li3zb4y",
      "author": "samk488",
      "body": "Dailymail is trash, I lose brain cells every time I see one of their headlines. So don’t mind the readers/commenters too much because they have to be a little sus to enjoy reading Dailymail.",
      "created_utc": 1723658643.0,
      "score": 13,
      "context": []
    },
    {
      "id": "li49d2s",
      "author": "Scorpiodancer123",
      "body": "Don't even bother with the Daily Fail. It's literal scum of the Earth and top of the pile for \"if it doesn't affect me then no-one else could possibly be telling the truth\" bollocks.",
      "created_utc": 1723661786.0,
      "score": 12,
      "context": []
    },
    {
      "id": "li4vj4y",
      "author": "bubble-buddy2",
      "body": "Think of it like depression. There are people who say \"back in my day you'd get a whooping and that would be it\" or \"kids are so dramatic these days\" despite the evidence that depression is very much real and needs treatment. \nThese people are not interested in learning. They can't keep up with changes in culture and society so they stick to what they know. They get defensive to further their own comfort. \nTake a breath, put down the phone, and look around. The real people around you and in your life are open and accepting. Thats what matters.",
      "created_utc": 1723668883.0,
      "score": 11,
      "context": []
    },
    {
      "id": "li4d9uu",
      "author": "amh8011",
      "body": "No they actually don’t realize any of that. Many people don’t seem to understand that their experiences are not universal so they try to project their own feelings and experiences onto others without even bothering to consider that maybe other people have other experiences than their own let alone trying to see things from another’s perspective. It’s frustrating as hell.",
      "created_utc": 1723663036.0,
      "score": 11,
      "context": []
    },
    {
      "id": "li465qy",
      "author": "Zealousideal_Mall223",
      "body": "It’s a relatively new diagnosis the term ARFID is only a couple years old! My son is finally able to put a name to this horrible condition that very few people could differentiate from picky eating.  When these people finally realize that, oh! My grandson or niece or step-child has this and go through the frustration and see the misery that the child is in they will get it. It’s gonna take time but it will happen!",
      "created_utc": 1723660791.0,
      "score": 19,
      "context": []
    },
    {
      "id": "li43948",
      "author": "8eyond",
      "body": "Daily mail comments are pretty degenerate most of the time, they will be weird no matter what the article is about. ",
      "created_utc": 1723659880.0,
      "score": 10,
      "context": []
    },
    {
      "id": "li51l2w",
      "author": "NoAstronomer3244",
      "body": "ARFID truly is a hard ED to have because it's not well known, there is still much research being done, and people generally refuse to acknowledge it exists.",
      "created_utc": 1723670825.0,
      "score": 10,
      "context": []
    },
    {
      "id": "li47uiq",
      "author": "fengari4",
      "body": "This brings back so many memories 😭\nThe best thing to do is to just ignore what they say, they have no idea what it's like to suffer from this and they never will, their opinions don't mean anything!",
      "created_utc": 1723661315.0,
      "score": 6,
      "context": []
    },
    {
      "id": "li4k50g",
      "author": "iamabummblebee",
      "body": "My grandma had it… lol also 40s. It’s genetic in my family. We will literally starve ourselves",
      "created_utc": 1723665347.0,
      "score": 7,
      "context": []
    },
    {
      "id": "li51qq1",
      "author": "Bunny_Hunny4",
      "body": "I recently watched a news report about that poor girl who was served cows milk in her hot chocolate at Costa coffee and died - the comments were all saying that it was her and her mothers fault for going into a cafe and ordering anything except a bottle of water. People will be cruel and unreasonable about any and everything and they are not worth listening to.",
      "created_utc": 1723670875.0,
      "score": 7,
      "context": []
    },
    {
      "id": "li59x2d",
      "author": "pixelpusheen",
      "body": "They genuinely don't think any disorder is real because quote \"BacK IN MY DAY THIS DIDNT EXIST\" or \"THIS GENERATION CALLS EVERYTHING A DISORDER!!\" . I've seen these people claim chronically ill and disabled people are always lying for attention. So I can't say I'm that surprised with their comments about arfid :( \n\n\nThey'll ignore literal proof of it existing since forever until they experience it.",
      "created_utc": 1723673615.0,
      "score": 4,
      "context": []
    },
    {
      "id": "li4vd6q",
      "author": "orange_ones",
      "body": "People will say that stuff right to our faces, too.  That’s just going to have to be too bad that they feel that way.  Their perspective is myopic, inaccurate, and unempathetic, and they will have to just die mad about what I’m not eating.  They will never live a single day as me.",
      "created_utc": 1723668831.0,
      "score": 5,
      "context": []
    },
    {
      "id": "li3pbhh",
      "author": "None",
      "body": "I had a conversation with a friend recently about this type of commenter... Essentially, not everything we think needs to be shared. Especially not shared as fact or as a firm statement. Just because we think it, doesn't make it true. Ya know? People are ignorant. We only know what we now, and what we don't know scares us. With the ability to comment on anything, we wind up with a sea of crappy and unkind thoughts from people all over the world mashing up their personal experiences and knowledge with what little information has been shared in whatever the content was. It's just messy, and a newish part of social engagement that has yet to be refined. Remember that we're still in the extremely early age of online communities and honing in on what is respectful and appropriate is a bit of a game right now. Maybe things will change overtime, but it's a lawless land on the web. Practice boundaries in online spaces and just know that these people are commenting out of ignorance and a fear of what they don't know. Feel secure knowing that YOU know what's true.",
      "created_utc": 1723655554.0,
      "score": 8,
      "context": []
    },
    {
      "id": "li6u80g",
      "author": "FenderMartingale",
      "body": "The first time I heard of ARFID was in a news article about a British young man who went blind after eating only French fries/chips.\n\nLearning about ARFID was a real lightbulb moment that led to a diagnosis for my son (and later, for a friend who had that same lightbulb moment from me chatting about my son).\n\nMy son ended up in the ER at Xmas from malnutrition/anemia.  ARFID is a very serious illness.\n\n  \nThose commenters are shriveled, bitter, hateful, ignorant people.  It would cost them only minutes to bother to learn about this illness.",
      "created_utc": 1723695403.0,
      "score": 5,
      "context": []
    },
    {
      "id": "li645vs",
      "author": "warthog_jake",
      "body": "“He won’t starve” is what my parents tried. I think after a whole two days of sitting staring at them not eating they got the idea pretty quick",
      "created_utc": 1723684542.0,
      "score": 3,
      "context": []
    },
    {
      "id": "li6kn2u",
      "author": "1veseenbetter",
      "body": "In my experience existing on the internet, I've found that people will generally use any topic to make themselves feel like they're \"better\" than someone else. It could be anything. It can be the way you brush your hair, the variety of colors in your wardrobe, or the brand of toothpaste you use. So many people are desperate to feel superior. Then with the added anonymity and fast paced nature of the internet, they'll judge things at face value and walk away feeling justified in their assessment. All we can do is strive to educate others on these topics and ignore those who get mean and condescending about them. After all, it's easy to shit on someone's problems when you've never had to deal with the realities of those hardships yourself.",
      "created_utc": 1723691045.0,
      "score": 3,
      "context": []
    },
    {
      "id": "li6zwav",
      "author": "HolisticHealingCo",
      "body": "Yeah my husband isn't even supportive and I haven't had a period in 15 years and my nails have lines in then due to malnourishment. I'm starting to realize we may be more alone in this than we think but at least we have each other",
      "created_utc": 1723698357.0,
      "score": 3,
      "context": []
    },
    {
      "id": "li7oufz",
      "author": "joecoops14",
      "body": "People like this are bound by their sheer ignorance and arrogance as they couldn't possibly even begin to realise they could be wrong. We have access to most if not all of human knowledge available to us on rectangles we keep in our pockets and yet people like this would rather spew constant vile drivel than even begin to consider if what they're saying is truthful or not.",
      "created_utc": 1723714029.0,
      "score": 3,
      "context": []
    },
    {
      "id": "li4h25q",
      "author": "Substantial_Chest395",
      "body": "Maybe it didn’t exist back in the day cause they used to make plain stuff. Now yall want to put cheese in a can, im sorry that Im not with it 🤣",
      "created_utc": 1723664330.0,
      "score": 4,
      "context": []
    },
    {
      "id": "li50pzq",
      "author": "SadisticGoose",
      "body": "Some people get their knickers in such a twist over other people’s eating, weight, size, whatever. It’s none of their damn business frankly. I’ve had both ARFID and atypical anorexia (anorexia without being underweight), and people have straight up mocked me for having eating disorders because they didn’t like what I ate or that I was fat. Those kind of people are cruel and heartless and aren’t worth the time of day, including the people at Daily Mail.",
      "created_utc": 1723670543.0,
      "score": 2,
      "context": []
    },
    {
      "id": "li5r09w",
      "author": "SachiKaM",
      "body": "I mean.. I do wish it worked that way. The simplest way I’ve ever been able to describe it is Gordon Ramsey can show up and cater in my kitchen and I’m not going to eat until my body says so. Failure to thrive isn’t combatted by starving the infant who is already starving themselves. Still, there is no use trying to educate a willingly ignorant being. I’d rather be “picky” than dense.",
      "created_utc": 1723679672.0,
      "score": 2,
      "context": []
    },
    {
      "id": "li6dt1x",
      "author": "None",
      "body": "\"Back in the 70s you ate what you were given\" yeah and how did that turn out for yall lol",
      "created_utc": 1723688260.0,
      "score": 2,
      "context": []
    },
    {
      "id": "li7ouqa",
      "author": "sterdeff",
      "body": "Ummm i'm in a 3rd world country and I know many people with AFRID. I completely understand your anger and it makes me angry too. Just remember that there will always be idiots who are so far from reality, but there will also always be understanding people who listen and see reality. The latter are the people you should listen to. I understand the curiosity but it's better to protect yourself from harmful unnecessary opinions. Take care <3",
      "created_utc": 1723714035.0,
      "score": 2,
      "context": []
    },
    {
      "id": "li4lp37",
      "author": "Fizzabl",
      "body": "This is also the newspaper that when brexit happened, made an article comparing Theresa May and Nicola Sturgeon's legs\n\n\nThe people who actively read that newspaper are pro old white man and anti literally everything that doesn't benefit them. Whether you're a woman, black, disabled, have an eating disorder.. they hate you\n\n\nThe people who make an account to actually comment? Have no life. Legit my local newspaper wrote about the local uni building a new building to start teaching medicine. The comments were just complaining about the city being overrun with students and this wouldn't help\n\n\nEveryone who wrote a comment has already forgotten they do so. Not to sound like one of the comments, but get over it, because otherwise they've won",
      "created_utc": 1723665833.0,
      "score": 4,
      "context": []
    },
    {
      "id": "li9caec",
      "author": "luteyla",
      "body": "That's why we have to spread that MJ most probably died from arfid",
      "created_utc": 1723738003.0,
      "score": 1,
      "context": []
    },
    {
      "id": "li9gtdw",
      "author": "DustierAndRustier",
      "body": "I feel like crying reading Daily Mail comments about anything.",
      "created_utc": 1723739428.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lia1vho",
      "author": "thatsnuckinfutz",
      "body": "i had ARFID in the early 90s and used to pass out in elementary school and am now hypoglycemic (plus other goodies) so it definitely can be life threatening especially for those with the subtype of just not wanting to eat in general/don't have hunger sensations. also people absolutely have these issues in other countries and long before now they just werent diagnosed. \n\nthey tried that whole trope with autism and adhd.",
      "created_utc": 1723746000.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lif2s1f",
      "author": "APairOfRaggedQuarks",
      "body": "If Dailymail readers are furious about my existence, then I’m in good company 🤷‍♀️\n\nThese are the same type of people who think people with depression just need to “cheer up” or that people with ADHD just need to “stop fidgeting”. I wouldn’t take advice from these idiots, so I’m not taking their criticism either.",
      "created_utc": 1723821578.0,
      "score": 1,
      "context": []
    },
    {
      "id": "limda9q",
      "author": "Lovely_Bug9833",
      "body": "These comments are all out of pure ignorance! It’s always the ignorant fools that love to run their mouths, isn’t it?  One time I had an old man come up to me and lecture me in a restaurant about allowing my child (who has has ADHD, SPD, ARFID and anxiety) to play on my phone while waiting for our food to arrive. He has no idea that playing on the phone before our food arrives keeps my child from completely melting down in the restaurant and reduces his eating anxiety. This guy was so ignorant and so happy to spout off his clueless, harmful opinions. I ignored him. \n\nAs a MAMA bear I’m particularly defensive with this crap But I’m also Christian so it can be challenging for me to respond in kindness… when I just wanna knock em to the moon. 😂\n\nThere’s an old proverb that says ,\n\n“Don’t bother talking sense to fools; they’ll only poke fun at your words. Speak not in the ears of a fool: For he will despise the wisdom of thy words”. -Proverbs 23:9\n\nI just feel so bad for their kids and grandkids. My mother-in-law is one of these old school types that no matter what I say, she doesn’t get it . So I keep my son away from her most of the time and I protect him. My husband does the defending with his mother. He’s too young to stand up for himself.",
      "created_utc": 1723928655.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lis98tz",
      "author": "MultiFandomShipperr",
      "body": "Hate the whole \"They'll eat when they're hungry.” argument. Like, no, we won't. Once went two days without eating because the dinner (and leftovers from dinner) weren't a safe food",
      "created_utc": 1724019307.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ma27upk",
      "author": "1-800-REDDIT-USER",
      "body": "anytime i see anything more “mainstream” about ARFID online i literally have to scroll immediately because the comments are always so bad",
      "created_utc": 1738264728.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mmqxj0i",
      "author": "WeirdUnion5605",
      "body": "I live in a third world country, I did starve till I passed out and I unwilling throw up everything I eat without underlying cause, I also don't eat McDonald's and the like. Those people don't know shit. My family forced me to eat and said \"you'll eat what we have\" and so on but I \"\"choose\"\" to starve and passed out instead because I had no choice, throwing up just hurt too much, even though I did throw up for not eating it was still better than eating, eating is a sensory nightmare.",
      "created_utc": 1744472312.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mv2mrbf",
      "author": "ewe_kim",
      "body": "My mom has struggled with me not eating enough or not eating at all for most of the days and she’s sees me struggle through a lot of meals. I don’t know if it’s ARFID or not (I just found out about it and have most symptoms) but one thing I remember her telling me is “if you don’t eat, you’re gonna end up at the mental hospital and they don’t feed you there”. I would stare at a plate of simple food that I should eat and I cry looking at it for about an hour. I don’t blame my mom for not knowing any better but that also like fucked me up a lot. I still love my mom tho.",
      "created_utc": 1748614927.0,
      "score": 1,
      "context": []
    },
    {
      "id": "li6t7mp",
      "author": "LinnyLo",
      "body": "This argument infuriates me...not yours, but the one you stated about how people say it \"didn't exist in the past.\" This can be said about so many diagnoses, but is so untrue. Maybe the criteria wasn't clear enough in the past or the emotional intelligence to understand the impact didn't exist in the past. But the issue itself absolutely existed we just weren't as aware or didn't have the capability to explain or understand it or the patience to help them. \n\nUsing food as a punishment or reward is absolutely not okay and leads to serious health concerns or at the very least an unhealthy relationship with food/eating. This is why I left my previous profession, because I just could not reconcile using foods in that way. And lo and behold, years later, I have a child with ARFID. My gut was telling me then that it's not right or okay, and my eventual reality confirmed it. \n\nMy child experienced things that exacerbated his issues by someone in his life and I unfortunately had no way to prevent it at the time, and I will never stop trying to reverse that by being as understanding and encouraging as I possibly can, and giving him as much time and grace as he needs while also tirelessly trying to come up with safe foods and ideas to help him gain the healthy relationship with food that he needs and deserves. My current belief is that his issues are sensory, and it makes complete sense to me (not from a personal perspective bc I LOVE almost all foods, but bc I know and understand my child).\n\nI hope your grandpa was able to move past his experiences and advocate for others in similar situations 💜",
      "created_utc": 1723694906.0,
      "score": 40,
      "context": [
        {
          "id": "li3vouv",
          "author": "lavendermenacing",
          "body": "My grandpa had arfid in the 40s. The school tried to make him eat a ham and cheese sandwich for lunch and he refused. They told him that if he didn't eat he wouldn't be able to go back to class, he spent three days sitting in the lunchroom all day until the school started making him a sandwich with just ham. People who say that arfid didn't exist in the past have no idea what they're talking about.",
          "created_utc": 1723657521.0
        }
      ]
    },
    {
      "id": "mktxpsu",
      "author": "None",
      "body": "Yes!\n\nI have older relatives who were diagnosed with “failure to thrive” or just left to die. Some ended up on feeding tubes and then doctors accused the parents of neglect when the child just wouldn’t eat what everyone else was eating and doctors were telling parents that, if they don’t have safe foods, then they’ll eat. \n\nIt definitely existed, but people just died or were treated as if it was defiance.",
      "created_utc": 1743501251.0,
      "score": 1,
      "context": [
        {
          "id": "li3vouv",
          "author": "lavendermenacing",
          "body": "My grandpa had arfid in the 40s. The school tried to make him eat a ham and cheese sandwich for lunch and he refused. They told him that if he didn't eat he wouldn't be able to go back to class, he spent three days sitting in the lunchroom all day until the school started making him a sandwich with just ham. People who say that arfid didn't exist in the past have no idea what they're talking about.",
          "created_utc": 1723657521.0
        }
      ]
    },
    {
      "id": "li4qd07",
      "author": "Big-Formal408",
      "body": "Not to mention almost every single one of their articles has typos",
      "created_utc": 1723667261.0,
      "score": 18,
      "context": [
        {
          "id": "li3vbsv",
          "author": "biscottiapricot",
          "body": "i did an assessment in uni about media literacy and we had to criticise and rewrite an article and the lecturer suggested we use a daily mail one",
          "created_utc": 1723657410.0
        }
      ]
    },
    {
      "id": "mquviuu",
      "author": "Possible_Priority584",
      "body": "Well said",
      "created_utc": 1746524307.0,
      "score": 1,
      "context": [
        {
          "id": "li3nt4i",
          "author": "First-Butterscotch-3",
          "body": "Daily heil is a rag which exists to spread hate and encourage ignorance \n\nIgnore it like any normal person should",
          "created_utc": 1723655084.0
        }
      ]
    },
    {
      "id": "li4s1ol",
      "author": "Big-Formal408",
      "body": "Sadly most people will experience their frustration without seeing the misery of the other person. Their own feelings of discomfort often override the person who’s actually suffering because they see it as a bigger inconvenience to them than the person with ARFID. I’ve had ARFID my whole life and my extended family have seen the sheer panic and misery it causes me but they still choose to not educate themselves and try to understand. I’d really like to imagine and hope that this attitude will change and that personal experience with someone with ARFID could change their mind but there’s so much engrained in society about “eat what you’re given and don’t complain,” “kids these days are just picky but if we force them long enough they wont have any other choice,” “parents just coddle their kids and they won’t be able to survive in the big world,” etc and I don’t see that changing for a long time, unfortunately.",
      "created_utc": 1723667776.0,
      "score": 14,
      "context": [
        {
          "id": "li465qy",
          "author": "Zealousideal_Mall223",
          "body": "It’s a relatively new diagnosis the term ARFID is only a couple years old! My son is finally able to put a name to this horrible condition that very few people could differentiate from picky eating.  When these people finally realize that, oh! My grandson or niece or step-child has this and go through the frustration and see the misery that the child is in they will get it. It’s gonna take time but it will happen!",
          "created_utc": 1723660791.0
        }
      ]
    },
    {
      "id": "li5g3sg",
      "author": "SatisfactionSalt441",
      "body": "we also really need to let go of the idea that ARFID nly affects children. No \"grandson, niece or step-child\" but also \"mother, uncle or colleague\" being an adult with ARFID is hard enough as it is.",
      "created_utc": 1723675787.0,
      "score": 12,
      "context": [
        {
          "id": "li465qy",
          "author": "Zealousideal_Mall223",
          "body": "It’s a relatively new diagnosis the term ARFID is only a couple years old! My son is finally able to put a name to this horrible condition that very few people could differentiate from picky eating.  When these people finally realize that, oh! My grandson or niece or step-child has this and go through the frustration and see the misery that the child is in they will get it. It’s gonna take time but it will happen!",
          "created_utc": 1723660791.0
        }
      ]
    },
    {
      "id": "li7j6vq",
      "author": "Familiar_Ostrich52",
      "body": "True. I have always been picky and now my doughter is even more. We have very few safe foods. But ARFID doesn't exist in my country so it IS sooooo Hard to explain it to others, including my husband or parents.",
      "created_utc": 1723710241.0,
      "score": 2,
      "context": [
        {
          "id": "li51l2w",
          "author": "NoAstronomer3244",
          "body": "ARFID truly is a hard ED to have because it's not well known, there is still much research being done, and people generally refuse to acknowledge it exists.",
          "created_utc": 1723670825.0
        }
      ]
    },
    {
      "id": "li9d0ji",
      "author": "None",
      "body": "Wasn’t it drugs? Propofol overdose..",
      "created_utc": 1723738235.0,
      "score": 1,
      "context": [
        {
          "id": "li9caec",
          "author": "luteyla",
          "body": "That's why we have to spread that MJ most probably died from arfid",
          "created_utc": 1723738003.0
        }
      ]
    },
    {
      "id": "lie26dw",
      "author": "Ace_C7",
      "body": "You know!!!! Tall people didn't exist before 1800!!!! If they did, where's the photo evidence??? Don't have it? Yeah! That's because it's all these fuckin' liberals and their milk additives! They WANT you to think that everyone wasn't 5'5!\n\nBut in all seriousness, my parents had talked to my doctor about ARFID when I was a kid and my parents just didn't understand what it meant. I would refuse to eat dinner for days if it wasn't the right food. Eventually, I learned how to just throw away food without anyone noticing so I didn't have to eat the things that I couldn't. To this day, I still get very nervous when eating with other people nearby. It's gotten to the point where I have to hide in an empty office to eat lunch at work because of my relationship with food. I was also severely underweight back before I started making meals myself. I'm still underweight, but I'm proud to say that I'm now about 120.\n\nA lot of my memories of dinner time were me, stuck sitting at the dinner table, refusing to eat until like 10 PM when my parents finally sent me to bed. They think the idea of ARFID is ridiculous and that, as an adult, I should be over the whole thing. I made the choice to become pescatarian recently and because of that, I never have to eat the same dinner as them.  It's been the only thing that's saved me from having to deal with the same situation I did as a kid. Now, all I get is the classic \"we hate vegans\" schtick from them.\n\nI just think it's very stupid that they knew the entire time that it was a medical problem (if you can call it that) but still acted like I was a petulant child causing problems to be a little shit.",
      "created_utc": 1723808196.0,
      "score": 6,
      "context": [
        {
          "id": "li3vouv",
          "author": "lavendermenacing",
          "body": "My grandpa had arfid in the 40s. The school tried to make him eat a ham and cheese sandwich for lunch and he refused. They told him that if he didn't eat he wouldn't be able to go back to class, he spent three days sitting in the lunchroom all day until the school started making him a sandwich with just ham. People who say that arfid didn't exist in the past have no idea what they're talking about.",
          "created_utc": 1723657521.0
        },
        {
          "id": "li6t7mp",
          "author": "LinnyLo",
          "body": "This argument infuriates me...not yours, but the one you stated about how people say it \"didn't exist in the past.\" This can be said about so many diagnoses, but is so untrue. Maybe the criteria wasn't clear enough in the past or the emotional intelligence to understand the impact didn't exist in the past. But the issue itself absolutely existed we just weren't as aware or didn't have the capability to explain or understand it or the patience to help them. \n\nUsing food as a punishment or reward is absolutely not okay and leads to serious health concerns or at the very least an unhealthy relationship with food/eating. This is why I left my previous profession, because I just could not reconcile using foods in that way. And lo and behold, years later, I have a child with ARFID. My gut was telling me then that it's not right or okay, and my eventual reality confirmed it. \n\nMy child experienced things that exacerbated his issues by someone in his life and I unfortunately had no way to prevent it at the time, and I will never stop trying to reverse that by being as understanding and encouraging as I possibly can, and giving him as much time and grace as he needs while also tirelessly trying to come up with safe foods and ideas to help him gain the healthy relationship with food that he needs and deserves. My current belief is that his issues are sensory, and it makes complete sense to me (not from a personal perspective bc I LOVE almost all foods, but bc I know and understand my child).\n\nI hope your grandpa was able to move past his experiences and advocate for others in similar situations 💜",
          "created_utc": 1723694906.0
        }
      ]
    },
    {
      "id": "liaazd1",
      "author": "luteyla",
      "body": "I'm not knowledgeable so much but because he was not eating anything, his body couldn't cope with his medications. I remember something like that.",
      "created_utc": 1723748871.0,
      "score": 1,
      "context": [
        {
          "id": "li9caec",
          "author": "luteyla",
          "body": "That's why we have to spread that MJ most probably died from arfid",
          "created_utc": 1723738003.0
        },
        {
          "id": "li9d0ji",
          "author": "None",
          "body": "Wasn’t it drugs? Propofol overdose..",
          "created_utc": 1723738235.0
        }
      ]
    },
    {
      "id": "mktyxhh",
      "author": "None",
      "body": "This.\n\nI’ve never been underweight, but it was due to almost overeating when a safe food was cooked knowing that I wouldn’t have it again for a while and filling up on dry foods like bread and crackers. My family now ignores it all and keeps trying to serve me huge plates filled to the brim with unsafe foods and look completely baffled every time when I say that I don’t want it. Once, they even said “well, haven’t you grown out of that now?”",
      "created_utc": 1743502017.0,
      "score": 2,
      "context": [
        {
          "id": "li3vouv",
          "author": "lavendermenacing",
          "body": "My grandpa had arfid in the 40s. The school tried to make him eat a ham and cheese sandwich for lunch and he refused. They told him that if he didn't eat he wouldn't be able to go back to class, he spent three days sitting in the lunchroom all day until the school started making him a sandwich with just ham. People who say that arfid didn't exist in the past have no idea what they're talking about.",
          "created_utc": 1723657521.0
        },
        {
          "id": "li6t7mp",
          "author": "LinnyLo",
          "body": "This argument infuriates me...not yours, but the one you stated about how people say it \"didn't exist in the past.\" This can be said about so many diagnoses, but is so untrue. Maybe the criteria wasn't clear enough in the past or the emotional intelligence to understand the impact didn't exist in the past. But the issue itself absolutely existed we just weren't as aware or didn't have the capability to explain or understand it or the patience to help them. \n\nUsing food as a punishment or reward is absolutely not okay and leads to serious health concerns or at the very least an unhealthy relationship with food/eating. This is why I left my previous profession, because I just could not reconcile using foods in that way. And lo and behold, years later, I have a child with ARFID. My gut was telling me then that it's not right or okay, and my eventual reality confirmed it. \n\nMy child experienced things that exacerbated his issues by someone in his life and I unfortunately had no way to prevent it at the time, and I will never stop trying to reverse that by being as understanding and encouraging as I possibly can, and giving him as much time and grace as he needs while also tirelessly trying to come up with safe foods and ideas to help him gain the healthy relationship with food that he needs and deserves. My current belief is that his issues are sensory, and it makes complete sense to me (not from a personal perspective bc I LOVE almost all foods, but bc I know and understand my child).\n\nI hope your grandpa was able to move past his experiences and advocate for others in similar situations 💜",
          "created_utc": 1723694906.0
        },
        {
          "id": "lie26dw",
          "author": "Ace_C7",
          "body": "You know!!!! Tall people didn't exist before 1800!!!! If they did, where's the photo evidence??? Don't have it? Yeah! That's because it's all these fuckin' liberals and their milk additives! They WANT you to think that everyone wasn't 5'5!\n\nBut in all seriousness, my parents had talked to my doctor about ARFID when I was a kid and my parents just didn't understand what it meant. I would refuse to eat dinner for days if it wasn't the right food. Eventually, I learned how to just throw away food without anyone noticing so I didn't have to eat the things that I couldn't. To this day, I still get very nervous when eating with other people nearby. It's gotten to the point where I have to hide in an empty office to eat lunch at work because of my relationship with food. I was also severely underweight back before I started making meals myself. I'm still underweight, but I'm proud to say that I'm now about 120.\n\nA lot of my memories of dinner time were me, stuck sitting at the dinner table, refusing to eat until like 10 PM when my parents finally sent me to bed. They think the idea of ARFID is ridiculous and that, as an adult, I should be over the whole thing. I made the choice to become pescatarian recently and because of that, I never have to eat the same dinner as them.  It's been the only thing that's saved me from having to deal with the same situation I did as a kid. Now, all I get is the classic \"we hate vegans\" schtick from them.\n\nI just think it's very stupid that they knew the entire time that it was a medical problem (if you can call it that) but still acted like I was a petulant child causing problems to be a little shit.",
          "created_utc": 1723808196.0
        }
      ]
    }
  ]
}