{
  "id": "1et0snq",
  "subreddit": "ARFID",
  "author": "Solanumm",
  "created_utc": 1723742262.0,
  "title": "Why do people hate picky eaters so much?",
  "selftext": "I don't know if I have ARFID, but I am extremely selective about foods tastes and textures. I also have other sensory issues such as misophonia. I came across an AITAH post about breaking up with someone because they were picky, and it was justified cause the guy was also being a massive jerk. However all of the comments were proclaiming how much they hated picky eaters and how they should \"grow up\" etc. I commented how hurtful these thing were and just got hurled downvotes and rude comments. I'm feeling really shit right now and just don't understand why people can't accept others differences without being so hateful and snide about it? Honestly its the same with misophonia. It's not like we choose this!!! There are so many things I love the look and smell of and wish I could eat but I just physically cannot!!",
  "url": "https://www.reddit.com/r/ARFID/comments/1et0snq/why_do_people_hate_picky_eaters_so_much/",
  "score": 547,
  "num_comments": 131,
  "comments": [
    {
      "id": "li9x6k7",
      "author": "giraffemoo",
      "body": "I think they think we are faking, like they are sitting there feeling like they wish they could just eat pizza and French fries all the time instead of the varieties of healthy food that most people usually eat. \n\nThat has been said to me, anyway. Someone said \"I wish I had an eating disorder like yours so I could just eat whatever I want all the time\". This was during a time when I had a special meal that was more appealing than what everyone else was eating. \n\nThey just don't understand.",
      "created_utc": 1723744529.0,
      "score": 371,
      "context": []
    },
    {
      "id": "li9w1uc",
      "author": "Mother_Goat1541",
      "body": "Yep, I don’t engage with any “picky eater” posts because it always ends with people going rabid.",
      "created_utc": 1723744180.0,
      "score": 217,
      "context": []
    },
    {
      "id": "li9zy95",
      "author": "WillingTone193",
      "body": "For the same reasons they hate the neurodivergent and people with disabilities. They don’t understand it and they refuse to understand it.",
      "created_utc": 1723745398.0,
      "score": 136,
      "context": []
    },
    {
      "id": "li9tet0",
      "author": "peppasauz",
      "body": "I think it goes back to \"ego\". A parent makes you food, you refuse it, they internalize it as a them problem but turn it into a you problem. \n\nI had a friend at lunch one day look at me and say \"don't make me feel like such a fata$$ for eating this pizza\" when I ordered a salad. They are self-conscious about their food choices and hoping that you'll reflect back to them that it's not a poor decision by getting something equally unhealthy for yourself.",
      "created_utc": 1723743358.0,
      "score": 171,
      "context": []
    },
    {
      "id": "li9ywu9",
      "author": "bruh_respectfully",
      "body": "In my experience, a lot of people who hate picky eaters have the \"I suffer(ed) so you should too\" mentality. They were forced to eat things they hated as children by their parents for various reasons ranging from ego to poor living conditions and they carried that attitude over into adulthood. A lot of them see your refusal to eat something as entitlement because they couldn't do the same in the past or can't do so presently.\n\nRegardless, judging people for what they eat has always been incomprehensible to me.",
      "created_utc": 1723745069.0,
      "score": 139,
      "context": []
    },
    {
      "id": "lia3v6u",
      "author": "Hot_Razzmatazz316",
      "body": "Hey, sorry people are jerks. Hugs\n\nI think a lot of it is how we're socialized. From a biological viewpoint, we need food to survive. So getting food is a biological imperative and impetus. Anthropologically speaking, food is a resource, and by offering to share a resource with someone else, that person will have less, which will affect their survival. Acceptance of the resource (ie, eating the food) is honoring the sacrifice (both the food itself as well as the time it took to prepare the food and the fact that the person giving you the food now has less for themself.)\n\n All over the world, food is tied to cultural, social, and religious traditions. Some people view not eating certain foods (regardless of the reason) as a rejection of these practices, and thereby the people themselves. This is especially true in countries and cultures where food preparation involves things like hunting harvesting and preparing the basic ingredients for recipes.\n\nIn a lot of developed nations, I think people view so-called \"picky eating\" as a privilege. Having enough to eat has always been a sign of success (both in an anthropological sense and a capitalistic sense), whereas not having enough food to eat has always been an indicator of not having enough money or status (so that people would feel inclined to share their food with you). The prevailing thought in many societies has typically been, if you're hungry enough, you'll eat whatever is available, and you can only turn your nose up at food if you're wealthy enough to afford something else. This kind of thinking looks at eating from a purely biological necessity without any of the psychological or even physiological elements (like allergies) that are associated with food. It's also classist: wealthy people get to choose food, beggars can't be choosers. It could be thought of as ableist, depending on the context: if someone else is preparing the food for you and doing the work, you get no say.\n\nAnd I mean, those are just some of the basic, global ideas about food. That doesn't even take into account people's individual family histories and experiences with eating and meals, which are all highly subjective. If one grew up in a household where the family was food insecure, the parents might not have had a lot of choices about what foods they could afford. Or perhaps someone had parents who were very mindful about wasting food, or it was tied to culture or religion and alternatives weren't an option. \n\nI say all this because in my experience food is such a subjective issue that people really, really take personally. I find it fascinating that even in this day and age when so much of the world is becoming more tolerant and educated, deviation from food normative behavior is still one thing that people have a hard time accepting. And maybe it's because it goes back to it being a biological need, and something that uses up resources, I don't know. It's weird that we'll accept that people from other cultures eat differently, but not people from our own, even if they're friends or family.",
      "created_utc": 1723746626.0,
      "score": 64,
      "context": []
    },
    {
      "id": "lia89ki",
      "author": "0pyrophosphate0",
      "body": "It's kind of weird, because Reddit as a whole seems pretty sympathetic toward depression, anxiety, and mental health *in general*, but specifically when it comes to \"picky eating\", then you're a toddler and an asshole and how could you possibly have any friends. \n\nFor some of those people, it seems the picky eaters in their lives may have had bad attitudes about it, and they're associating the bad attitudes with the eating habits. Many of them just seem personally offended that other people don't eat a wide variety of foods.\n\nAnd it's not just the AITH-type posts, look for any post on any sub about deal breakers in dating. Picky eating is usually near the top, complete with a long thread of people lamenting that picky eaters exist as adults.",
      "created_utc": 1723748013.0,
      "score": 54,
      "context": []
    },
    {
      "id": "li9z47e",
      "author": "dehydratedbisexual",
      "body": "It's such a bummer that they don't realize that it's harder for US than it is for them! It's not like we want to be picky. I would love to be able to eat whatever I wanted. It would make my life soooo much easier.",
      "created_utc": 1723745134.0,
      "score": 43,
      "context": []
    },
    {
      "id": "liajep2",
      "author": "madommouselfefe",
      "body": "I don’t have ARFID but my husband does. I have gotten a lot of hate because I apparently “enable” his bad eating. Mainly because I won’t force him to eat food he doesn’t like, or hide things in safe foods. \n\nI think most people look at it as a choice, or a moral failing. I have ADHD and honestly how I have been treated because of that is VERY similar to how my husband has been treated for his ARFID. The idea that he should just Do eat, or get over it, that he is being difficult or picky. He isn’t he truly does struggle, and treating him like he is the problem doesn't help.\n\nI think A LOT of people just straight to anger, frustration, and judgment. When if they would stop take a breath and look at it through compassion, and empathy things would go so much better. My husband spent most of his life being treated like SHIT for his ARFID. Guess what it didn’t help, it made it worse. You want to know what has helped, love, compassion understanding, and therapy. \n\nI will beat the ever living shit out of anyone who tries to force food on my husband, or who shame him. I got in my own aunts face and screamed at her, for trying to hide a very NONE safe food of my husbands in a safe meal! IDGAF who gets mad at me! \n\nI have taken it app on myself to do most of the cooking with family and friends. Except for a very few trusted individuals. I love cooking so I don’t mind. I just want my husband to feel safe when he eats.",
      "created_utc": 1723751594.0,
      "score": 35,
      "context": []
    },
    {
      "id": "li9v0j9",
      "author": "None",
      "body": "Oh yes I saw that post earlier and yeah, most of the comments were so biased against the picky eater and the poster was like they don't have ARFID but they described someone that has ARFID. (I have misophonia too.)",
      "created_utc": 1723743858.0,
      "score": 51,
      "context": []
    },
    {
      "id": "li9sjon",
      "author": "everythingnerdcatboy",
      "body": "People are at this point not just ignorant but intentionally ableist. I think it's the very capitalist idea of \"you should be happy that you have food to eat at all\"",
      "created_utc": 1723743091.0,
      "score": 93,
      "context": []
    },
    {
      "id": "liat316",
      "author": "shadow_victor_",
      "body": "What I can never understand is why other fully grown adults have a problem with what I eat like seriously there’s worse things in the world than to be concerning yourself with another man’s food intake. \n\nSome people are becoming more accepting and understanding but there’s always one who thinks they know best.",
      "created_utc": 1723754647.0,
      "score": 17,
      "context": []
    },
    {
      "id": "li9sl5z",
      "author": "biscottiapricot",
      "body": "they think that it's something we can control and that we do it for attention for some reason",
      "created_utc": 1723743103.0,
      "score": 37,
      "context": []
    },
    {
      "id": "lib6rah",
      "author": "why_kitten_why",
      "body": "They think that if someone just \"stopped putting up with your bs,\" and made you eat what everyone else ate, then you would be just fine, instead of vomiting, feel stressed, or generally harassed or hungry.\n\nSo no understanding. At all.",
      "created_utc": 1723759077.0,
      "score": 15,
      "context": []
    },
    {
      "id": "liarlyy",
      "author": "None",
      "body": "I think that it can be difficult to date or travel with a \"picky eater\". That's where some of the negative stereotypes come from.\n\nCooking, eating together, dining out at restaurants etc can often be a big part of being in a relationship with someone. If one half of the relationship has no interest in this or has restrictions that make this difficult then it can be frustrating for the other half. Many people see going to restaurants and cafes as a bonding experience. And it can be awkward if someone won't eat anything, can't choose a single thing from the menu or had to spend 10 minutes altering everything on a simple dish.\n\nSame with travelling. For many people food is one of the highlights of travelling. Especially when going overseas, experiencing a new culture, new cities and often new food. But if someone in your party doesn't want to try anything new, go out of their comfort zone or experience the more unique restaurants then it can really affect the whole trip. And can definitely kill the experience for those who do want to experience all they can while travelling.\n\nI think it's definitely unfair to judge someone on their eating but those are just a few situations where eating habits can affect people's relationships with others. And probably how the negative stereotypes come up for \"picky eaters\". Having a very limited palate is also usually associated with young children. Obviously ARFID is more than just \"limited palate\" as it's a genuine physiological condition. But to people who have no clue about ARFID if they see an adult being \"picky\" often people associate that adult with bring child-like which also doesn't help the negative associations.",
      "created_utc": 1723754188.0,
      "score": 15,
      "context": []
    },
    {
      "id": "lia8bxy",
      "author": "PeachOnAWarmBeach",
      "body": "Yeah,  I knew what to expect and still only made it through one or two comments 😆  Reddit loves to hate others who don't fit their narrow-minded mold.  A flaming dumpster should be the logo.  \n\n\n| \"Different is EVIL and WRONG  and doesn't deserve to exist!\" (Sarcasm, obv)",
      "created_utc": 1723748033.0,
      "score": 11,
      "context": []
    },
    {
      "id": "lia9im1",
      "author": "Fizzabl",
      "body": "Most people think we're lying. Most little kids say they're fussy and won't eat veg but it's usually just.. idk toddler stubbornness. So people see picky eating as something for babies, and we all need to grow up\n\n\nMy mom's favourite singer has a song called \"I Hate\" and it's what it sounds like, a song about things he hates, mostly trivial, but the line \"I hate fussy eaters, you cook them fajitas, they only eat pizza and chips\" has ALWAYS rubbed me up the wrong way. Probably a light joke but I can't stand it!",
      "created_utc": 1723748405.0,
      "score": 8,
      "context": []
    },
    {
      "id": "liae1gq",
      "author": "shitz_brickz",
      "body": "The problem is that eating is obviously something everyone does, so it has historically also been something of a social affair. It's unfortunate, but I sort of equate it to breaking up with someone if they dont drink alcohol. For some people that might not be an issue, it might even be a perk, you always have a DD, you dont have to worry about wasting extra money at a restaurant or god forbid developing an addiction. For others, that will impact what you choose to do for activities, you cant go spend time at bars or go to a wine tasting or brewery etc without making that person feel awkward. So I sort of get it if people have a dating preference AND they are respectful about it. \n\nThat said, there are foodies just like there are functional alcoholics who literally cannot fathom you not wanting to try every dish on a menu and have no shame telling you they think it's weird. They wake up thinking about breakfast and as soon as they are done they are thinking about lunch. \n\nSometimes I like to remind people that more people in the US die from obesity related diseases than undereating.",
      "created_utc": 1723749869.0,
      "score": 8,
      "context": []
    },
    {
      "id": "lia268o",
      "author": "Substantial_Chest395",
      "body": "People who live to eat not eat to live. Lol",
      "created_utc": 1723746093.0,
      "score": 11,
      "context": []
    },
    {
      "id": "liald7o",
      "author": "Arathrax",
      "body": " I simply say to someone if they make a face “if you think being a picky eater is what I have you’re 100% wrong. Picky implies choice. I don’t have a choice. And it sucks.”",
      "created_utc": 1723752212.0,
      "score": 5,
      "context": []
    },
    {
      "id": "liaqe3i",
      "author": "kurai01",
      "body": "What helps me is I think about what their fears are, let's say it's spiders. I'd just say, \"ok well why can't you get over spiders? Oh it's not that easy to get over your.....ah I see you understand now\"",
      "created_utc": 1723753807.0,
      "score": 5,
      "context": []
    },
    {
      "id": "li9zby3",
      "author": "Wellslapmesilly",
      "body": "I don't have ARFID but I'm close to someone who does. From my observations I would say that most people do not know about or understand the condition so they react badly sometimes. On the other side, I think that folks with ARFID don't fully understand or relate to, the extent that positive emotions are involved with food for those without ARFID, so out the gate, most people are not on common ground. In general, many people love food and all the rituals surrounding it. So because of the lack of understanding about ARFID, people often say dumb stuff. I have also noticed that because of this, it creates a bit of a reverse hyperarousal about food when around other people. I've seen this with my loved one. They are so ready for people to pick on them about what they are eating that the smallest comment can send them spinning. Often I've noticed that people were not trying to be a jerk they just end up in a bit of a minefield due to being unaware of the situation. Outside of family dynamics, it's pretty rare to have someone say \"grow up\" etc. I will say though that most people who say ignorant things or push the issue about someone eating in a way that is unusual to them, often can be redirected pretty easily once you realize that and learn to just be nonchalant about it, own your choices and shut them down. It's not easy but once you master it, it can reduce a ton of anxiety about eating around others.",
      "created_utc": 1723745202.0,
      "score": 17,
      "context": []
    },
    {
      "id": "li9rzv1",
      "author": "ilovemydograchel",
      "body": "I was thinking the same thing :(",
      "created_utc": 1723742921.0,
      "score": 14,
      "context": []
    },
    {
      "id": "liavdv9",
      "author": "Fun_Intention_5371",
      "body": "EVERYONE understands ARFID \n\nThey just like to pretend it doesn't exist, because to them it's maybe 1 or 2 foods they won't go nearabd if they do they have the exact same response as an ARFID person. \n\nWhat they don't seem to get,  is that it's basically all food that makes us feel that way. \n\n\nWhy they hate on everyone idk. I also don't ask people to make special accommodations for me. I was a kid in the 80s. They didn't do that in those days.",
      "created_utc": 1723755364.0,
      "score": 10,
      "context": []
    },
    {
      "id": "li9yv76",
      "author": "Nova-Prospekt",
      "body": "I think it has to do with their personal experiences dealing with *inconsiderate* picky eaters. As r/ARFID users, we realize that in order to live with the disorder and be considerate, we have to notify people of our dietary restrictions and find our own ways to eat the foods that we can. I personally always try to make sure that I can secure a source of safe food if I am to go out with friends. However, there are picky eaters who inconvenience others by forcing friends and family to (often unexpectedly) accommodate their food preferences at the expense of others' enjoyment. Those picky eaters can often be lumped together with people who have genuine disorders. When you don't know that there is a disorder involved, it is just seen as being rude.",
      "created_utc": 1723745054.0,
      "score": 15,
      "context": []
    },
    {
      "id": "liabse1",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1723749133.0,
      "score": 6,
      "context": []
    },
    {
      "id": "liae2td",
      "author": "OG1999x",
      "body": "People want to ACT tolerant to people who are different from them, but only the socially acceptable labels that virtue signal or make them seem like a good person to others. They like to cling on to the IDEA of inclusion.\n\nHowever, the truth is humans are still judgmental pieces of shit they've always been. They're just doing what their screens tell them.",
      "created_utc": 1723749880.0,
      "score": 7,
      "context": []
    },
    {
      "id": "lial9ol",
      "author": "Kauuori",
      "body": "Sorry if I overstep, but sensory issues, manifested as many ways, some of which can revolve around food \"being picky\" or sensitivity around sounds, can be a sign of autism or ADHD. I'd advise for you to look that out If you haven't already. I'm not saying you must have it but I argue it's great to at least keep it in mind.",
      "created_utc": 1723752181.0,
      "score": 3,
      "context": []
    },
    {
      "id": "libyc2m",
      "author": "jennybean2442",
      "body": "They assume we're difficult and high maintenance. It's about how they presume we affect their lives",
      "created_utc": 1723768964.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lic5194",
      "author": "SachiKaM",
      "body": "So one time I got home late and my house was being robbed. It was a very traumatic experience.. anytime I told my peers it was met with how everyone would have morphed into captain badass and done things differently than myself. I got my dog and gtfo. It hurt, I was already hurt, I knew it was bull shit. \n\nUntil you have first hand experience, everyone has a say about how they would handle a situation. Let these people have a child with ARFID. One of two things will happen. One, they gain empathy and help their fucking child. Two, they maintain this rigidity and eventually lose their fucking once child. Until you’ve been there though, your “badass” personification is shit. There are more options than starving and force feeding. Try living in their shoes and see just how terrifying this shit can get.",
      "created_utc": 1723771493.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lidkegh",
      "author": "None",
      "body": "political birds ad hoc vanish bake ring disgusted unique jar elderly\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
      "created_utc": 1723797841.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lie3k4e",
      "author": "Rinny-ThePooh",
      "body": "My ex best friend said I reminded her of her younger sister who threw tantrums about food to get her way. She then proceeded to describe Arfid. Her reasons for her sister not having it? More symptoms of Arfid. I ended up breaking off the friendship that day, if she was calling her sister a faker and comparing her to me, and complaining about why I can’t “just eat” I knew she would eventually start being blatant",
      "created_utc": 1723808828.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lianjy2",
      "author": "CozmicOwl16",
      "body": "I’m extremely old to still be a picky eater so I can field this one pretty well.  Most people don’t really care about picky eating/ eaters.  Only some people have a strong visceral negative reaction.  Let me explain those ones.  \n\n\nThe Existence of picky eaters and our patterns, draw attention to certain problems out there. \n\n\nSome people are terrible at cooking and their family lies to them and eats it anyways. A picky eater cannot continue that lie.  They can’t force themselves to pretend and shovel it down.  And it hurts the cooks feelings. \n\nAnd makes them choose between these realities. 1.  They aren’t good as something they thought they were or 2. The people they love, lie to them often.   Which is pretty fucking rough.  Those people should not lie to them and tell them that their food is good when it’s not.  It’s sooo common I can’t leave it out. \n\n\nAnd Some people enjoy eating really low quality food.  One of my pets is a golden and the other is a blue heeler. The blue heeler would be one of those people who greatly enjoyed eating terrible food.  Any food-all food.  just shovel it down. Gimme gimme gimme.  And the picky eater exposes their gluttony. And that embarrasses them. \n\nSo you see most emotionally, mature people are unbothered by how other people eat.  You run into questions like “why would I care?”  And when someone shows that they have a real negative reaction to picky eaters the question is really what’s their dysfunction",
      "created_utc": 1723752915.0,
      "score": 4,
      "context": []
    },
    {
      "id": "liaqfkt",
      "author": "TechieGottaSoundByte",
      "body": "I think it's because feeding people is expensive, in terms of time and money and mental energy. It's one of the most exhausting parts of caring for others, and people who feed others are prone to burnout. One of the symptoms of burnout is a decrease in empathy. \n\nAnd also, feeding others can be rewarding, and many people build their ability to feed others well into their identity. When someone like that makes food and someone with a medical need rejects it, they can feel like they, the person who made the food, is being rejected. Or they may feel frustrated that their work, performed with the expectation of being able to feed someone, is now wasted or not valued. That they aren't getting their expected \"reward\".\n\nA mature adult who isn't tired and who feels psychologically safe will recognize that this is their problem, and won't project their feelings onto the person managing a health issue. But people aren't always mature and are often tired and often feel defensive. \n\nBasically, it's the adult equivalent of a toddler throwing a tantrum because they need a nap. Psychologically, it's just easier for them to blame a sick person than to deal with reality at the moment. It's targeted _at_ you, but it doesn't really have anything to do _with_ you. Sometimes the emotional stress of grieving for a person with a health issue can even, ironically, manifest this way - in which case, they will probably improve with time. \n\nFor some folks, over-identifying with their role as someone who feeds others or defensiveness or burnout are chronic conditions and they may take a very long time to come around (if ever).",
      "created_utc": 1723753820.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lia9280",
      "author": "Fanny_packs",
      "body": "I don’t have ARFID, but my sister does. I recognize that it’s real and I huge struggle for her that she wishes she didn’t have to deal with. She is always kind and considerate and doesn’t expect everyone to bend and adapt to her food needs. That being said it is hard sometimes. We just got back from Disney World where I ate a lot of pizza so that we could all eat together. If we wanted to go to a nice restaurant or somewhere that didn’t have something she could eat she would 100% push us to go, but at the end of the day I’d rather spend time and eat together. People can definitely be assholes about “picky eaters” and I’m not discrediting that and it’s not okay, but loving someone with AFRID can be really challenging too. They should still be treated with respect and not belittled for something they can’t control, but I do understand how it could be a deal breaker in romantic relationships. For a lot of people it doesn’t matter, but if it does for some people I think they’re justified in that based on my experiences.",
      "created_utc": 1723748262.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lic5ysa",
      "author": "unicorn_in-training",
      "body": "People in general care WAY too much about what other people eat (or don’t eat). I don’t get it either.",
      "created_utc": 1723771860.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lic7mp8",
      "author": "king-of-the-sea",
      "body": "Hello, I am a Certified Normal Peopleologist. I say this without malice and with so much sympathy, because I am and have been where you are. \n\nIt’s because people love food. Food is important to them - it’s their hobby, their love language, their culture, their passion, etc etc etc etc etc. When someone wants to share their life with someone or show love, they share their hobbies, culture, passion, etc with them. If someone is dismissive and shitty about your hobbies, culture, or passions, it’s confusing and miserable.\n\nI read the same story you did. I don’t think the guy’s flaw was being picky, it was the way he did it. If he said, “I am very picky and have a restricted palate that makes it difficult to find food I like and share foods others like,” it would be different. Maybe they still wouldn’t end up together, but at least they wouldn’t be frustrated with one another. As a side note, the guy made other mistakes with how he handled the situation, but the initial mistake was his approach to the problem.\n\nIf you approach the problem openly and honestly, you might get hurt. If you hide the problem, you will probably get hurt and also hurt the other person’s feelings and confuse them. If you press the issue, like that guy did (“you threw away something that could have been beautiful just because you’re shallow”), it’s offputting at best and pushy/dickish at medium.\n\nFinding a happy medium IS POSSIBLE. Finding someone who is willing to work with you to find things you can both enjoy, or workarounds (i.e. cooking different things to eat together) IS POSSIBLE and, in my experience, quite easy if you break it off early with people you’re incompatible with. \n\nFor example, if I had a restrictive diet because of allergens, and they only wanted food with those allergens in them, then we would be incompatible. Thank you, I had a lovely time, but I just don’t see this working out. If I was vegan and my date was shitty about it or tried to sneak meat into my food or pressured me into eating it, they would be an asshole. No thanks, I had a shit time, don’t fucking date vegans.\n\nHowever, most people don’t have the information they need to be considerate towards everyone’s limitations all the time, especially if they’re not stated outright. A boundary cannot be respected if it is not stated. A rule cannot be followed if it is known only to you.\n\nOpen, honest communication may have saved that man a world of hurt. It may not have saved that relationship, but at least they could discuss it like adults and see if it’s something they can work around. At the very least, if she was truly dead set on being a shithead about it, then he could see the bullet he dodged. Instead, he didn’t tell her, insulted her coworkers’ cooking (whether he meant it that way or not, it was insulting), and made her feel weird and shitty for reasons she couldn’t know.  He could have said, “hey, this food is challenging for me, I don’t think I can eat it so I’m going to go for food I can eat. Can you please cover for me for a second?” Anything other than just acting grossed out about it for no reason. If someone did that to me, I would feel bad.\n\nMy brother (no ARFID that I know of) fucking hates beans and onions. His wife knows he hates beans and onions, so she doesn’t make dishes with them. I have a much wibblier set of Food Laws, mostly concerning texture. My beautiful wonderful partner works with me to accommodate my tastes and makes sure I’m fed even on a bad day, because I told him what’s going on early in the relationship. He’s a chef, he loves to cook, he loves other cultures’ cuisines, and he loves a lot of shit I fucking hate.\n\nAgain, if someone is dismissive or shitty about your food preferences, that’s one thing. If you don’t tell them and instead just shit all over every little thing they try to feed you for (seemingly) no reason, that’s another. If my beautiful wonderful partner who can do no wrong made me feel shitty about what I can and cannot eat, we’d be done just as surely as if he tried to feed me things I’m allergic to because he didn’t believe me. But he can’t know I have food allergies if I don’t tell him, and he can’t know why I won’t eat a dish if I don’t tell him why.\n\nI understand. I really, really do. It’s frustrating and shitty and weird and hard and bad. It sucks so fucking bad. But this guy was not blameless, and he wasn’t you. Do better than that guy. Stand upright, be honest, and be stalwart on your course. Cut em out if they’re an asshole. But give em the chance to accommodate you.",
      "created_utc": 1723772527.0,
      "score": 2,
      "context": []
    },
    {
      "id": "licc36j",
      "author": "badbatch",
      "body": "I don't understand either. \n\nMy ex boyfriend told me that he was afraid we'd be at dinner with his friends and I'd say \"EEEWW!\" and embarrass him.  He said that if he took me with him to see his friends in Taiwan I'd embarrass him because not eating is offensive there.\n\nIt makes me afraid to date again like there are too many things about me someone would have to accept and it's impossible.",
      "created_utc": 1723774290.0,
      "score": 2,
      "context": []
    },
    {
      "id": "licgcez",
      "author": "Bigdecisions7979",
      "body": "People have trouble understanding anything different than them and the reaction we’ve taught in society is they should automatically hate it",
      "created_utc": 1723776006.0,
      "score": 2,
      "context": []
    },
    {
      "id": "licrkm2",
      "author": "i_enjoy_music_n_stuf",
      "body": "It’s ridiculous, and I’m tired of this shit too",
      "created_utc": 1723780929.0,
      "score": 2,
      "context": []
    },
    {
      "id": "licrpl3",
      "author": "Akavinceblack",
      "body": " The ARFID not so much, but living with someone with misophonia can really suck.    \n\nI barely ever eat with my husband anymore because the slightest eating sound grates on him and it’s zero fun (and impossible)to try to eat completely silently lest he lose his appetite over ”slurping” and ”smacking”.",
      "created_utc": 1723780995.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lict95v",
      "author": "Aposematicpebble",
      "body": "Because it makes people's lives more difficult if you don't have a grip on it. You're always the one people need to cater to when choosing a new place to eat. You can't just randomly go somewhere new and just order something without all the questions about ingredients and alterations. You won't try dishes your friend makes for the whole group. And so on and so on.\n\nIt sucks sometimes. Being picky is hard, but we need to be concious that it also sucks for the people close to us. Some people have food as love language and it hurts them that we won't eat what they make. I hate not being able to go to town on the dishes my friend from work brings to us. Everybody says her dad is an awesome cook and everything is delicious, but I don't know because I can't eat most of what she brings. And I hate I can't honor her and her dad in this manner.",
      "created_utc": 1723781735.0,
      "score": 2,
      "context": []
    },
    {
      "id": "licvp7c",
      "author": "Knarz97",
      "body": "People in general view it as being childish and/or resistant to change. \n\nMy girlfriend is picky. But she’s always willing to try new things. She ends up not liking them most of the time, but the willingness to try is what’s appreciated.",
      "created_utc": 1723782932.0,
      "score": 2,
      "context": []
    },
    {
      "id": "licz7pl",
      "author": "mayovegan",
      "body": "I didn't develop ARFID until later in life and used to say I couldn't stand picky eaters. It was mostly because the ones I knew seemed to want to make things difficult for me and others and were ungrateful/unappreciative when I tried to accommodate them. Now I understand how hard it is, and have a lot more sympathy, since a lot more of those problems were attributed to those people specifically than to picky eating",
      "created_utc": 1723784740.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lide25u",
      "author": "Only-Maintenance1701",
      "body": "As someone who knows plenty of people with ARDID, as well as hates picky eaters I’ll explain my difference in the two. There are plenty of picky eaters out there that have absolutely nothing wrong with their relationship with food. I have met many, many, many people who simply refuse to expand their pallet because it seems unnecessary. Those are the same people who comment on what you order, gag when you open your lunch, and act like they’re the best cooks in the world, while you can’t seem to make a decent meal. On the other hand, there’s people with sensory, texture, and all around unhealthy relationships with food. I don’t have a great one myself but I try to push myself to try new things. I read this sub to learn how to better support my friends with this condition or similar experiences. However, I don’t believe in or support adults that not only ignore their relationship with food, but criticize yours because of their own. Someone with an ED or any sort of food-related issue isn’t a picky eater to me. Someone with no issue and a lot of judgement is.",
      "created_utc": 1723793604.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lidqsiv",
      "author": "Nientjie83",
      "body": "As someone without ARFID and who loves almost all food, I think it might be because they do not understand it. Food is something we need and its natural for humans to like it and want to have it, so I think if you are not a picky eater yourself its difficult to grasp. I think its similar to how people do not understand how others can be ace.  That and maybe a bit of jealousy, as crazy as that sounds, bc maybe they struggle with their weight bc they love food too much. Regardless, its not okay for them to hate picky eaters, and also in poor taste to comment on others' eating habits.",
      "created_utc": 1723802041.0,
      "score": 2,
      "context": []
    },
    {
      "id": "libgwyi",
      "author": "kwaqiswhack",
      "body": "Oooof, yeah, I just don’t engage in those conversations online or in person, depending on the crowd.\n\nI saw a post on some parenting type sub about their child being picky, and lots of people were like “just give them whatever, if they’re *really* hungry, they’ll eat it.” Umm, nah we actually will just starve. It’s like they’ve never met a stubborn kid … I sat at my grandfather’s dinner table all damn night because I refused to eat ham and boiled carrots!! Like another commenter said, I think it’s a mentality of “I suffered, so you must too.” Sad.",
      "created_utc": 1723762628.0,
      "score": 2,
      "context": []
    },
    {
      "id": "libqt96",
      "author": "None",
      "body": "one of the WORST insults imo is \"you have the palette of a toddler\". okay? do you experience no whimsy in your life? has diet culture gotten to you so much that you can't enjoy a chicken nugget? you must experience no childhood wonder, so you take it out on everyone else....sad! \n\nslightly joking, of course, but i feel like these people have their own issues to work out before commenting on people's food.",
      "created_utc": 1723766186.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lieel3l",
      "author": "StrangeClouds_",
      "body": "I hate picky eaters because I dated and was abused by one. We ate only his safe foods as my wants were deemed unnecessary and a waste of money since he wasn’t going to eat them. We never went out to eat. Anytime I did manage to eat food I was craving, he would sit beside me and make disgusting faces and gag into my plate… like why? Leave the room. Stop fixating on what I’m eating and eat your cheese pizza. I left him and married a chef. \n\nI understand that you probably didn’t want an honest answer, this place is kind of like an echo chamber. \nI joined this sub to try and understand, the posts are sometimes funny and sometimes infuriating. At least you all have each other.",
      "created_utc": 1723813387.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lieoy84",
      "author": "FunkyJellyfishBones",
      "body": "Personally i think because eating together is something a lot of people do for fun, trying new things and having new experiences together. It's cool to go to a restaurant and everyone order something different so we can all try. It's a bonding experience over a shared interest.\n\nOr with cooking, i love to be experimental with my recipes and am always looking for something new and fun to try, and i cook from the heart and it makes me so happy when my partner tells me the food i've spent hours making us is delicious. \n\nYou just can't enjoy these things the same with picky eaters, they kind of suck the fun out of everything food related for people who love food, nothing can be spontaneous, everything has to be safe or 'beige' for lack of a better term and void of anything that makes it interesting in regards to flavoring, texture etc. There's no sense of adventure, it makes anything involving food more stressful for the people who aren't picky, when it should be something relaxing that you can enjoy.\n\nI don't mean to offend anyone, and no one should be hateful to you because of it, but i wouldn't choose to be friends with someone who was a picky eater in all honesty. I would just rather be around people who are similar to me when it comes to food, very easy going.",
      "created_utc": 1723817099.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lieyz11",
      "author": "Demented-Turtle",
      "body": "2/3rds of America is overweight or obese, so it makes sense that food is an unhealthy obsession/interest for the average person. Think about all the ways food is deeply ingrained in human culture. Building a relationship with someone new? Take them to dinner. Getting to know someone professionally? Talk over brunch/lunch. Family or team outing? Dining will be a large part of the event.\n\nWhen you tell someone you don't like all these different foods they LOVE, which brings them happiness as they shove mountain of it down their throat, you're in essence offending them by implying there's something wrong with what they enjoy, even if you take care to explain it's a disorder. I think it's more of a subconscious reaction. For example, you might like someone a little less if you find out they hate something you *really* enjoy/love.",
      "created_utc": 1723820375.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lifz9he",
      "author": "Miller0700",
      "body": "An incapability to empathize with neurodivergent people (or people in *general*). We love to be \"melodramatic\" who \"make things complicated.\"",
      "created_utc": 1723831800.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lig6wkb",
      "author": "TheBackyardigirl",
      "body": "In my experience it’s a mentality of “I don’t understand it so therefore I don’t like it”",
      "created_utc": 1723834233.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ligo4p7",
      "author": "None",
      "body": "I see I’m not the only one who has been called an asshole a few times for ARFID :/",
      "created_utc": 1723839843.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ligpe48",
      "author": "starrysky555",
      "body": "I know right? People should eat what they like without being judged.",
      "created_utc": 1723840252.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ligrvwa",
      "author": "gir1_from_the_sea",
      "body": "THIS! (I know for sure I have ARFID, but can relate to simply being just called a picky eater )",
      "created_utc": 1723841058.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lihi555",
      "author": "mitthrawnuruodo86",
      "body": "They thinking picky eating is childish, and thus something people should grow out of",
      "created_utc": 1723850437.0,
      "score": 1,
      "context": []
    },
    {
      "id": "liia3qi",
      "author": "Significant-Sea-6839",
      "body": "I don’t mind picky eaters in my home. I can usually ask before them and prepare. Fine, unless they don’t tell me until they’re already there and the food is cooking.\n\n\nWorking as a chef, it’s very annoying. Most kitchens I can’t see your face or talk to you, so it takes the human element out of it too. It’s usually just printed on a docket:\n\n\nHAWAIIAN PIZZA\n-no ham\n-no pineapple\n-NOT CHEESE PIZZA\n\n\nOr a strange interpretation from the waiter forwarding your requests (for example, in the above I might assume you want me to pick all that stuff off a pre-made pizza, at the very least I’d have to go and talk to you, pulling me out of the kitchen delaying everyone else’s food).\n\nIt’s not just annoying to think about or prepare when I’m making 20 other dishes, it’s that the restaurant sometimes doesn’t have what you want (the pizzas might be pre-made up, unlikely, but just an example. If I pick those things off your pizza, am I throwing it into the already prepared ham and pineapple bits in a container for later, or am I throwing it away? It’s got sauce on it now and it’s been handled and taken out. Safety risk?)\n\nThen there’s to consider that I’ll be working 60 hours a week, earning $11 p/h, and slowing down the food orders will get me in trouble at work.\n\nI did have a guy once who handed me a business card with clear English all the things he wanted me to do with his food (about 20 on the list). It was still annoying but I really appreciated it.",
      "created_utc": 1723861673.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lij83f4",
      "author": "LeakyFountainPen",
      "body": "I always love when those people have a thing they don't like. \n\nThat \"will eat anything\" fiend/family member who ragged on you for years will say \"Ugh, pineapple on pizza? Disgusting!\" and I get to look at them like \"Oh yeah????\" And then hit them with one of the things they've said to me for years.\n\nGlorious.\n\nBut in all seriousness, I've actually found that most people have a completely different view of \"picky\" than we do. Like, I can eat cucumbers and broccoli, but I don't particularly *like* them. They're just some of the few veggies that didn't set off my gag reflex. So I would have them all the time for dinner growing up. \n\nOne day, I remember talking to my mom and I mentioned that I didn't really like the taste of broccoli and she said something like \"Noo, what happened? You lost a veggie?\" (I've lost safe foods before) And I was like \"What? No, I never liked broccoli.\" And it took several minutes of discussion for us to figure out that \"safe food\" didn't actually mean \"yummy food\" but rather \"doesn't automatically trigger my gag reflex\"\n\nShe was shocked when she learned how many of my \"safe foods\" were foods I didn't particularly like, but ate because I *could*. And *I* was shocked to find out that when most people heard \"I don't like that food\" they thought I was making a fuss over *that* level of mild dislike, rather than the reality.\n\nSo people view picky eaters as people who will only eat things that are absolutely perfect and align exactly to their personal preference. Like a diva who throws a tantrum if her clothes aren't designer brand. But in reality, they just have *no idea* what's going on in our heads. \n\nRealizing that has really changed the wording I use to talk about picky eating with people.",
      "created_utc": 1723880216.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lilet6m",
      "author": "Lovely_Bug9833",
      "body": "It’s pure ignorance and a lack of love in their hearts . Honestly I feel bad for people who are this toxic who lack empathy and compassion for others because most if not all of their relationships will end badly including the relationship they have with themselves. We can’t have healthy relationships with others without love and compassion. Always remember there’s nothing wrong with you, but there is something very wrong with people like this. Never let someone’s darkness creep in. That’s exactly what the devil\nwants. After all, he uses people with cruel and unkind lies just to hurt you. Don’t give the devil a foothold and avoid these people like the plague. Stay within the community thats supportive as you’re in a vulnerable position having ARFID you need to block out all the discouraging words.",
      "created_utc": 1723916479.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lj0j9tj",
      "author": "finchieg",
      "body": "The comment I hate the most is when they say “just starve them they will soon start eating” the problem is WE WONT we will just starve ✨ I am still on the waiting list to be diagnosed with autism (it’s been 4 years) and since being a kid I can remember having problems with food and I was called a picky eater - I have only just discovered arfid is a thing and it sometimes comes with other diagnosis like autism or adhd and I have a feeling I may have it slightly (my boyf is helping me try new foods - I tried peppers a few weeks back and I like them :) ) but it’s just so insane to me how people treat others who have issues with food? Like I’m a fully grown woman, you’re a fully grown adult. Why do you care so much about what I eat 🤩",
      "created_utc": 1724145777.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ljaj0ig",
      "author": "Radiant-Date3039",
      "body": "To bring a little positivity into this post because its a sad reality for all of us. When i was younger I went to an event where we (a group of young girls) were taught to cook by a professional chef. I did cook my meal perfectly but when it came time to eat I couldnt eat it because of my condition. Particularly because this meal had tomatoes and my body can't stand them when they are the main flavor. \nMy family had convinced me that the world hated me for not eating anything and everything. One of the teachers who brought us asked why i wasn't eating and was about to berate me for wasting food, but the chef stopped everything and cooked an alternative version of the dish without tomatoes for me. \nObviously I remember this to this day, and it's something that warms my heart whenever I remember it. \nI wish that everyone was as kind and understanding about eating disorders as that person was. ",
      "created_utc": 1724282075.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lwl7xuq",
      "author": "xRyozuo",
      "body": "I think several different reasons\n\n- if they made the food, they get sad you don’t eat it or don’t like it (understandable)\n   — add the potential waste of food / forcing them to eat another portion\n \n- when they were growing up, their own parents forced them to lick the plate clean before leaving, so they have negative emotions associated to pickiness and it comes out in rude comments, hurt people hurt people kind of thing. (Annoys me but IF I understand their context, I can brush it off easily)\n\n- they’re just rude and unable to grasp other people experience stimuli different (no point to really engage with these)",
      "created_utc": 1731337700.0,
      "score": 1,
      "context": []
    },
    {
      "id": "liav40e",
      "author": "Culvingg",
      "body": "Foodie propaganda",
      "created_utc": 1723755278.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lib7dp5",
      "author": "GravityDefining",
      "body": "It's ablism. It always comes back to ablism. Picky eating is a sign of mental, physical or gastrointestinal issues. It's why people still give people gluten when they can't digest it. Why parents complain about not being able to give their kids peanut butter when there's one kid that's allergic. Why grandparents try to force their grandkids to eat things they don't like. Picky eating is a sign of something being wrong and therefore it makes someone different and other. And for some reason that's a fate worse than death for some people.",
      "created_utc": 1723759288.0,
      "score": 1,
      "context": []
    },
    {
      "id": "libkutq",
      "author": "siburyo",
      "body": "I think people take offense if someone doesn't eat something they provided. If you're not eating anything, even if you say it's fine, and you're not hungry, or if you bring your own food, they still feel like a criticism is implied. They feel like you're \"making\" them go to extra trouble to provide special food that you can eat. Even if you never asked for it and in fact don't want it. Because for them, us sitting there eating nothing while everyone else is eating makes them so uncomfortable that they feel like they do have to. Even if we don't say a word of criticism, to them criticism of their hospitality is automatically implied by us not eating anything. \n\nAlso, most people love food so much that the idea of someone finding it a bother is just so foreign to them. Food and music are supposed to be the universal things that \"everyone\" likes. So the idea that you could go to a restaurant and just sit there and talk while everyone eats and be happy with that (I'd actually prefer it, personally... eating in public is stressful) is inconceivable to them. They feel like you *must* be unhappy about it, you're just pretending it's okay.",
      "created_utc": 1723764036.0,
      "score": 1,
      "context": []
    },
    {
      "id": "libox3q",
      "author": "kilroy-was-here-2543",
      "body": "Adding to all the people mentioning how a lot of people wish they could eat poorly all the time, I think they forget how impactful it is on your life and overall health if your not able to get proper nutrition. Just because we have an excuse doesn’t make it healthy to eat the same fast food or carbs every day",
      "created_utc": 1723765495.0,
      "score": 0,
      "context": []
    },
    {
      "id": "lij06aa",
      "author": "blissfulboo",
      "body": "because people can’t comprehend that things like autism, ARFID, etc exist and think it’s just a character flaw or something easily fixable or some shit. people who feel this way typically lack critical thinking skills. people hate what they can’t understand.",
      "created_utc": 1723875081.0,
      "score": 0,
      "context": []
    },
    {
      "id": "lia88a8",
      "author": "AlucardsAssistant",
      "body": "I find “I wish I had an eating disorder like yours so I could just eat what I want all the time” so ironic because I WISH I could actually eat whatever I want at any given moment instead of having such a restrictive diet.",
      "created_utc": 1723748002.0,
      "score": 251,
      "context": [
        {
          "id": "li9x6k7",
          "author": "giraffemoo",
          "body": "I think they think we are faking, like they are sitting there feeling like they wish they could just eat pizza and French fries all the time instead of the varieties of healthy food that most people usually eat. \n\nThat has been said to me, anyway. Someone said \"I wish I had an eating disorder like yours so I could just eat whatever I want all the time\". This was during a time when I had a special meal that was more appealing than what everyone else was eating. \n\nThey just don't understand.",
          "created_utc": 1723744529.0
        }
      ]
    },
    {
      "id": "liaf0ah",
      "author": "Manospondylus_gigas",
      "body": "That's so mental to me because every day I wish I could eat normally so I could actually have a healthy diet",
      "created_utc": 1723750181.0,
      "score": 56,
      "context": [
        {
          "id": "li9x6k7",
          "author": "giraffemoo",
          "body": "I think they think we are faking, like they are sitting there feeling like they wish they could just eat pizza and French fries all the time instead of the varieties of healthy food that most people usually eat. \n\nThat has been said to me, anyway. Someone said \"I wish I had an eating disorder like yours so I could just eat whatever I want all the time\". This was during a time when I had a special meal that was more appealing than what everyone else was eating. \n\nThey just don't understand.",
          "created_utc": 1723744529.0
        }
      ]
    },
    {
      "id": "liaowtj",
      "author": "texaspretzel",
      "body": "I had one moment in my life where I was understood by a group of people! I was in culinary school for baking and our class won a contest. Our reward was a meal from the culinary students and we were asked dietary restrictions beforehand. There was one girl in class who was vegetarian. A table of twenty ish twenty-something girls got served veal and EVERYONE asked if we could have the vegetarian option instead, although the outcome was the same and our chefs tsked us and told us to be grateful for what we were served. Veal is extra gross.",
      "created_utc": 1723753346.0,
      "score": 27,
      "context": [
        {
          "id": "li9x6k7",
          "author": "giraffemoo",
          "body": "I think they think we are faking, like they are sitting there feeling like they wish they could just eat pizza and French fries all the time instead of the varieties of healthy food that most people usually eat. \n\nThat has been said to me, anyway. Someone said \"I wish I had an eating disorder like yours so I could just eat whatever I want all the time\". This was during a time when I had a special meal that was more appealing than what everyone else was eating. \n\nThey just don't understand.",
          "created_utc": 1723744529.0
        }
      ]
    },
    {
      "id": "lib513w",
      "author": "okamiokamii",
      "body": "Definitely the faking. I told my grandma that I didn't like something because the texture makes me gag and she said \"I think your just being difficult\"",
      "created_utc": 1723758496.0,
      "score": 27,
      "context": [
        {
          "id": "li9x6k7",
          "author": "giraffemoo",
          "body": "I think they think we are faking, like they are sitting there feeling like they wish they could just eat pizza and French fries all the time instead of the varieties of healthy food that most people usually eat. \n\nThat has been said to me, anyway. Someone said \"I wish I had an eating disorder like yours so I could just eat whatever I want all the time\". This was during a time when I had a special meal that was more appealing than what everyone else was eating. \n\nThey just don't understand.",
          "created_utc": 1723744529.0
        }
      ]
    },
    {
      "id": "lic5vxb",
      "author": "SachiKaM",
      "body": "People mistake my “I’m not hungry” with “I’m choosing to starve myself”. Family, friends, doctors. Even on an appetite stimulant, only the verbiage changes. I’m hungry, I’m not going to eat that.",
      "created_utc": 1723771828.0,
      "score": 15,
      "context": [
        {
          "id": "li9x6k7",
          "author": "giraffemoo",
          "body": "I think they think we are faking, like they are sitting there feeling like they wish they could just eat pizza and French fries all the time instead of the varieties of healthy food that most people usually eat. \n\nThat has been said to me, anyway. Someone said \"I wish I had an eating disorder like yours so I could just eat whatever I want all the time\". This was during a time when I had a special meal that was more appealing than what everyone else was eating. \n\nThey just don't understand.",
          "created_utc": 1723744529.0
        }
      ]
    },
    {
      "id": "licg4u3",
      "author": "LowRhubarb5668",
      "body": "I’ve been told that “you just have to do it for your health”. It’s like easier said than done when your brain is literally fighting it.",
      "created_utc": 1723775920.0,
      "score": 11,
      "context": [
        {
          "id": "li9x6k7",
          "author": "giraffemoo",
          "body": "I think they think we are faking, like they are sitting there feeling like they wish they could just eat pizza and French fries all the time instead of the varieties of healthy food that most people usually eat. \n\nThat has been said to me, anyway. Someone said \"I wish I had an eating disorder like yours so I could just eat whatever I want all the time\". This was during a time when I had a special meal that was more appealing than what everyone else was eating. \n\nThey just don't understand.",
          "created_utc": 1723744529.0
        }
      ]
    },
    {
      "id": "liclvli",
      "author": "knowledgelover94",
      "body": "Yea, this is it. They just don’t understand what it’s like. It’s a pretty rare condition so I’m not surprised most people are ignorant about it. \n\nThis makes me think, I feel like we should be pushing for ARFID awareness. If there was some kind of awareness campaign about it, maybe people would be more compassionate about it.",
      "created_utc": 1723778347.0,
      "score": 11,
      "context": [
        {
          "id": "li9x6k7",
          "author": "giraffemoo",
          "body": "I think they think we are faking, like they are sitting there feeling like they wish they could just eat pizza and French fries all the time instead of the varieties of healthy food that most people usually eat. \n\nThat has been said to me, anyway. Someone said \"I wish I had an eating disorder like yours so I could just eat whatever I want all the time\". This was during a time when I had a special meal that was more appealing than what everyone else was eating. \n\nThey just don't understand.",
          "created_utc": 1723744529.0
        }
      ]
    },
    {
      "id": "lig6nuk",
      "author": "TheBackyardigirl",
      "body": "I think people with eating disorders of any kind should be legally allowed to punch anyone who says “i wish I had one too” because *no you don’t*",
      "created_utc": 1723834155.0,
      "score": 5,
      "context": [
        {
          "id": "li9x6k7",
          "author": "giraffemoo",
          "body": "I think they think we are faking, like they are sitting there feeling like they wish they could just eat pizza and French fries all the time instead of the varieties of healthy food that most people usually eat. \n\nThat has been said to me, anyway. Someone said \"I wish I had an eating disorder like yours so I could just eat whatever I want all the time\". This was during a time when I had a special meal that was more appealing than what everyone else was eating. \n\nThey just don't understand.",
          "created_utc": 1723744529.0
        }
      ]
    },
    {
      "id": "liabqe4",
      "author": "None",
      "body": "It sure does get wild in those posts, such intense anger and hate over just not wanting to eat the same food.",
      "created_utc": 1723749115.0,
      "score": 76,
      "context": [
        {
          "id": "li9w1uc",
          "author": "Mother_Goat1541",
          "body": "Yep, I don’t engage with any “picky eater” posts because it always ends with people going rabid.",
          "created_utc": 1723744180.0
        }
      ]
    },
    {
      "id": "lic64sb",
      "author": "unicorn_in-training",
      "body": "Yep, I had to stop listening to one of my favorite podcasts a couple years ago because of how vile the hosts were towards “picky eaters”.",
      "created_utc": 1723771926.0,
      "score": 20,
      "context": [
        {
          "id": "li9w1uc",
          "author": "Mother_Goat1541",
          "body": "Yep, I don’t engage with any “picky eater” posts because it always ends with people going rabid.",
          "created_utc": 1723744180.0
        }
      ]
    },
    {
      "id": "lic8ov6",
      "author": "Mother_Goat1541",
      "body": "True, my kids with ARFID and autism are faced with the “they are just spoiled”, “it’s bad parenting,” “give them a week at my house and they’d be eating everything I serve “ type comments. People are so offended by what other people eat, it’s ridiculous.",
      "created_utc": 1723772949.0,
      "score": 45,
      "context": [
        {
          "id": "li9zy95",
          "author": "WillingTone193",
          "body": "For the same reasons they hate the neurodivergent and people with disabilities. They don’t understand it and they refuse to understand it.",
          "created_utc": 1723745398.0
        }
      ]
    },
    {
      "id": "li9tuai",
      "author": "Solanumm",
      "body": "I see that kind of thing everywhere. People insecure about their own decisions so when they see someone else do something different they see it as an attack or moral judgement.",
      "created_utc": 1723743493.0,
      "score": 67,
      "context": [
        {
          "id": "li9tet0",
          "author": "peppasauz",
          "body": "I think it goes back to \"ego\". A parent makes you food, you refuse it, they internalize it as a them problem but turn it into a you problem. \n\nI had a friend at lunch one day look at me and say \"don't make me feel like such a fata$$ for eating this pizza\" when I ordered a salad. They are self-conscious about their food choices and hoping that you'll reflect back to them that it's not a poor decision by getting something equally unhealthy for yourself.",
          "created_utc": 1723743358.0
        }
      ]
    },
    {
      "id": "lib7i14",
      "author": "_EmeraldEye_",
      "body": "It's so wild cause being forced to eat things didn't make me less picky/sensory sensitive",
      "created_utc": 1723759328.0,
      "score": 62,
      "context": [
        {
          "id": "li9ywu9",
          "author": "bruh_respectfully",
          "body": "In my experience, a lot of people who hate picky eaters have the \"I suffer(ed) so you should too\" mentality. They were forced to eat things they hated as children by their parents for various reasons ranging from ego to poor living conditions and they carried that attitude over into adulthood. A lot of them see your refusal to eat something as entitlement because they couldn't do the same in the past or can't do so presently.\n\nRegardless, judging people for what they eat has always been incomprehensible to me.",
          "created_utc": 1723745069.0
        }
      ]
    },
    {
      "id": "lif61bp",
      "author": "the_YellowRanger",
      "body": "100% in the first sentence.",
      "created_utc": 1723822610.0,
      "score": 3,
      "context": [
        {
          "id": "li9ywu9",
          "author": "bruh_respectfully",
          "body": "In my experience, a lot of people who hate picky eaters have the \"I suffer(ed) so you should too\" mentality. They were forced to eat things they hated as children by their parents for various reasons ranging from ego to poor living conditions and they carried that attitude over into adulthood. A lot of them see your refusal to eat something as entitlement because they couldn't do the same in the past or can't do so presently.\n\nRegardless, judging people for what they eat has always been incomprehensible to me.",
          "created_utc": 1723745069.0
        }
      ]
    },
    {
      "id": "liabf8u",
      "author": "lemurificspeckle",
      "body": "I LOVE this!!!!!! So so so interesting!! A couple of times I’ve said to folks that having ARFID makes you so acutely aware of how important food is, not just biologically but socially and culturally. Just like how it’s hard to see exactly what your culture is until you’re outside of it, because being steeped in it all your life you kind of go blind to it! Us ARFIDers aren’t quite cultural natives to food, so we (or at least I) notice just how much of our life revolves around/involves food!! \n\nIf you have any good sources to learn about culinary anthropology I’d love to see em!! Just graduated with my degree in ethnomusicology and psychology so I love all that stuff haha",
      "created_utc": 1723749014.0,
      "score": 26,
      "context": [
        {
          "id": "lia3v6u",
          "author": "Hot_Razzmatazz316",
          "body": "Hey, sorry people are jerks. Hugs\n\nI think a lot of it is how we're socialized. From a biological viewpoint, we need food to survive. So getting food is a biological imperative and impetus. Anthropologically speaking, food is a resource, and by offering to share a resource with someone else, that person will have less, which will affect their survival. Acceptance of the resource (ie, eating the food) is honoring the sacrifice (both the food itself as well as the time it took to prepare the food and the fact that the person giving you the food now has less for themself.)\n\n All over the world, food is tied to cultural, social, and religious traditions. Some people view not eating certain foods (regardless of the reason) as a rejection of these practices, and thereby the people themselves. This is especially true in countries and cultures where food preparation involves things like hunting harvesting and preparing the basic ingredients for recipes.\n\nIn a lot of developed nations, I think people view so-called \"picky eating\" as a privilege. Having enough to eat has always been a sign of success (both in an anthropological sense and a capitalistic sense), whereas not having enough food to eat has always been an indicator of not having enough money or status (so that people would feel inclined to share their food with you). The prevailing thought in many societies has typically been, if you're hungry enough, you'll eat whatever is available, and you can only turn your nose up at food if you're wealthy enough to afford something else. This kind of thinking looks at eating from a purely biological necessity without any of the psychological or even physiological elements (like allergies) that are associated with food. It's also classist: wealthy people get to choose food, beggars can't be choosers. It could be thought of as ableist, depending on the context: if someone else is preparing the food for you and doing the work, you get no say.\n\nAnd I mean, those are just some of the basic, global ideas about food. That doesn't even take into account people's individual family histories and experiences with eating and meals, which are all highly subjective. If one grew up in a household where the family was food insecure, the parents might not have had a lot of choices about what foods they could afford. Or perhaps someone had parents who were very mindful about wasting food, or it was tied to culture or religion and alternatives weren't an option. \n\nI say all this because in my experience food is such a subjective issue that people really, really take personally. I find it fascinating that even in this day and age when so much of the world is becoming more tolerant and educated, deviation from food normative behavior is still one thing that people have a hard time accepting. And maybe it's because it goes back to it being a biological need, and something that uses up resources, I don't know. It's weird that we'll accept that people from other cultures eat differently, but not people from our own, even if they're friends or family.",
          "created_utc": 1723746626.0
        }
      ]
    },
    {
      "id": "lia4kvw",
      "author": "Solanumm",
      "body": "Really interesting to read!",
      "created_utc": 1723746854.0,
      "score": 3,
      "context": [
        {
          "id": "lia3v6u",
          "author": "Hot_Razzmatazz316",
          "body": "Hey, sorry people are jerks. Hugs\n\nI think a lot of it is how we're socialized. From a biological viewpoint, we need food to survive. So getting food is a biological imperative and impetus. Anthropologically speaking, food is a resource, and by offering to share a resource with someone else, that person will have less, which will affect their survival. Acceptance of the resource (ie, eating the food) is honoring the sacrifice (both the food itself as well as the time it took to prepare the food and the fact that the person giving you the food now has less for themself.)\n\n All over the world, food is tied to cultural, social, and religious traditions. Some people view not eating certain foods (regardless of the reason) as a rejection of these practices, and thereby the people themselves. This is especially true in countries and cultures where food preparation involves things like hunting harvesting and preparing the basic ingredients for recipes.\n\nIn a lot of developed nations, I think people view so-called \"picky eating\" as a privilege. Having enough to eat has always been a sign of success (both in an anthropological sense and a capitalistic sense), whereas not having enough food to eat has always been an indicator of not having enough money or status (so that people would feel inclined to share their food with you). The prevailing thought in many societies has typically been, if you're hungry enough, you'll eat whatever is available, and you can only turn your nose up at food if you're wealthy enough to afford something else. This kind of thinking looks at eating from a purely biological necessity without any of the psychological or even physiological elements (like allergies) that are associated with food. It's also classist: wealthy people get to choose food, beggars can't be choosers. It could be thought of as ableist, depending on the context: if someone else is preparing the food for you and doing the work, you get no say.\n\nAnd I mean, those are just some of the basic, global ideas about food. That doesn't even take into account people's individual family histories and experiences with eating and meals, which are all highly subjective. If one grew up in a household where the family was food insecure, the parents might not have had a lot of choices about what foods they could afford. Or perhaps someone had parents who were very mindful about wasting food, or it was tied to culture or religion and alternatives weren't an option. \n\nI say all this because in my experience food is such a subjective issue that people really, really take personally. I find it fascinating that even in this day and age when so much of the world is becoming more tolerant and educated, deviation from food normative behavior is still one thing that people have a hard time accepting. And maybe it's because it goes back to it being a biological need, and something that uses up resources, I don't know. It's weird that we'll accept that people from other cultures eat differently, but not people from our own, even if they're friends or family.",
          "created_utc": 1723746626.0
        }
      ]
    },
    {
      "id": "lif2s23",
      "author": "Neat-Pineapple9063",
      "body": "\"you'll eat if you're hungry enough\" was something my parents lived by too.\n I did, in fact, not eat.\n\nI was underweight and BEGGING my school mates for any shares of their meals :/",
      "created_utc": 1723821578.0,
      "score": 3,
      "context": [
        {
          "id": "lia3v6u",
          "author": "Hot_Razzmatazz316",
          "body": "Hey, sorry people are jerks. Hugs\n\nI think a lot of it is how we're socialized. From a biological viewpoint, we need food to survive. So getting food is a biological imperative and impetus. Anthropologically speaking, food is a resource, and by offering to share a resource with someone else, that person will have less, which will affect their survival. Acceptance of the resource (ie, eating the food) is honoring the sacrifice (both the food itself as well as the time it took to prepare the food and the fact that the person giving you the food now has less for themself.)\n\n All over the world, food is tied to cultural, social, and religious traditions. Some people view not eating certain foods (regardless of the reason) as a rejection of these practices, and thereby the people themselves. This is especially true in countries and cultures where food preparation involves things like hunting harvesting and preparing the basic ingredients for recipes.\n\nIn a lot of developed nations, I think people view so-called \"picky eating\" as a privilege. Having enough to eat has always been a sign of success (both in an anthropological sense and a capitalistic sense), whereas not having enough food to eat has always been an indicator of not having enough money or status (so that people would feel inclined to share their food with you). The prevailing thought in many societies has typically been, if you're hungry enough, you'll eat whatever is available, and you can only turn your nose up at food if you're wealthy enough to afford something else. This kind of thinking looks at eating from a purely biological necessity without any of the psychological or even physiological elements (like allergies) that are associated with food. It's also classist: wealthy people get to choose food, beggars can't be choosers. It could be thought of as ableist, depending on the context: if someone else is preparing the food for you and doing the work, you get no say.\n\nAnd I mean, those are just some of the basic, global ideas about food. That doesn't even take into account people's individual family histories and experiences with eating and meals, which are all highly subjective. If one grew up in a household where the family was food insecure, the parents might not have had a lot of choices about what foods they could afford. Or perhaps someone had parents who were very mindful about wasting food, or it was tied to culture or religion and alternatives weren't an option. \n\nI say all this because in my experience food is such a subjective issue that people really, really take personally. I find it fascinating that even in this day and age when so much of the world is becoming more tolerant and educated, deviation from food normative behavior is still one thing that people have a hard time accepting. And maybe it's because it goes back to it being a biological need, and something that uses up resources, I don't know. It's weird that we'll accept that people from other cultures eat differently, but not people from our own, even if they're friends or family.",
          "created_utc": 1723746626.0
        }
      ]
    },
    {
      "id": "lia9hww",
      "author": "Solanumm",
      "body": "For real. Once I was getting along really well with someone and we were settling on a first date when I let slip that I was not the best with food (but explictly mentioned I wasn't close minded or anything it was an actual issue). She immediately got super distant and then blocked me. Just kind of sucks that such a small thing is a dealbreaker for so many.",
      "created_utc": 1723748399.0,
      "score": 27,
      "context": [
        {
          "id": "lia89ki",
          "author": "0pyrophosphate0",
          "body": "It's kind of weird, because Reddit as a whole seems pretty sympathetic toward depression, anxiety, and mental health *in general*, but specifically when it comes to \"picky eating\", then you're a toddler and an asshole and how could you possibly have any friends. \n\nFor some of those people, it seems the picky eaters in their lives may have had bad attitudes about it, and they're associating the bad attitudes with the eating habits. Many of them just seem personally offended that other people don't eat a wide variety of foods.\n\nAnd it's not just the AITH-type posts, look for any post on any sub about deal breakers in dating. Picky eating is usually near the top, complete with a long thread of people lamenting that picky eaters exist as adults.",
          "created_utc": 1723748013.0
        }
      ]
    },
    {
      "id": "liczt9j",
      "author": "ohhyouknow",
      "body": "I am 33 years old and have never ever had an issue with dating and ARFID. I’m recently divorced but I have a very strong relationship with a partner who loves my cooking. \n\nI have a fairly varied diet now but it’s still extremely restrictive comparatively. I’m very proud of myself for going from two food items to so many I can’t even count them, but I’ll never have a neurotypical diet. \n\n\nEven when I was very restrictive I didn’t find issue with dating. Reddit is seriously over dramatic about stuff like this.\n\nI couldn’t imagine entering a relationship with a person without them accepting who I am fully off the bat. I can understand just being embarrassed by it and not wanting to scare them off by it bc anxiety but if you are seriously interested in a person you should expect them to be up front and honest with you and vice versa. A long lasting relationship with anyone, even friends, requires full acceptance no matter what. If you cannot fully accept someone or they cannot fully accept you it isn’t meant to be.\n\nSaves a lot of time and I’ve anecdotally never ever had it as a dealbreaker. I have dated sewious chefs even who were fully understanding.",
      "created_utc": 1723785060.0,
      "score": 7,
      "context": [
        {
          "id": "lia89ki",
          "author": "0pyrophosphate0",
          "body": "It's kind of weird, because Reddit as a whole seems pretty sympathetic toward depression, anxiety, and mental health *in general*, but specifically when it comes to \"picky eating\", then you're a toddler and an asshole and how could you possibly have any friends. \n\nFor some of those people, it seems the picky eaters in their lives may have had bad attitudes about it, and they're associating the bad attitudes with the eating habits. Many of them just seem personally offended that other people don't eat a wide variety of foods.\n\nAnd it's not just the AITH-type posts, look for any post on any sub about deal breakers in dating. Picky eating is usually near the top, complete with a long thread of people lamenting that picky eaters exist as adults.",
          "created_utc": 1723748013.0
        }
      ]
    },
    {
      "id": "lie29ae",
      "author": "hadtointerject",
      "body": "Thank you for being such a wonderful ally :)",
      "created_utc": 1723808234.0,
      "score": 3,
      "context": [
        {
          "id": "liajep2",
          "author": "madommouselfefe",
          "body": "I don’t have ARFID but my husband does. I have gotten a lot of hate because I apparently “enable” his bad eating. Mainly because I won’t force him to eat food he doesn’t like, or hide things in safe foods. \n\nI think most people look at it as a choice, or a moral failing. I have ADHD and honestly how I have been treated because of that is VERY similar to how my husband has been treated for his ARFID. The idea that he should just Do eat, or get over it, that he is being difficult or picky. He isn’t he truly does struggle, and treating him like he is the problem doesn't help.\n\nI think A LOT of people just straight to anger, frustration, and judgment. When if they would stop take a breath and look at it through compassion, and empathy things would go so much better. My husband spent most of his life being treated like SHIT for his ARFID. Guess what it didn’t help, it made it worse. You want to know what has helped, love, compassion understanding, and therapy. \n\nI will beat the ever living shit out of anyone who tries to force food on my husband, or who shame him. I got in my own aunts face and screamed at her, for trying to hide a very NONE safe food of my husbands in a safe meal! IDGAF who gets mad at me! \n\nI have taken it app on myself to do most of the cooking with family and friends. Except for a very few trusted individuals. I love cooking so I don’t mind. I just want my husband to feel safe when he eats.",
          "created_utc": 1723751594.0
        }
      ]
    },
    {
      "id": "lia34s4",
      "author": "Commercial-Medium-85",
      "body": "I saw the post too. It kinda got under my skin as well and I almost commented. I’ve realized it’s pointless to argue with the herd though. Unfortunately we’re just a very misunderstood group I think. I feel like that severely ADHD person in class when the teacher scolds them and says “pay attention.” \n\nIf it were truly as simple as just ‘trying a new food’ don’t they think we would’ve done that already? Lol",
      "created_utc": 1723746394.0,
      "score": 40,
      "context": [
        {
          "id": "li9v0j9",
          "author": "None",
          "body": "Oh yes I saw that post earlier and yeah, most of the comments were so biased against the picky eater and the poster was like they don't have ARFID but they described someone that has ARFID. (I have misophonia too.)",
          "created_utc": 1723743858.0
        }
      ]
    },
    {
      "id": "liakx98",
      "author": "shitz_brickz",
      "body": "One thing that is annoying for me, especially when trying to date people who have previously dated other picky eaters is some people with this issue don't make it any easier on themselves or the people they are with. There was a post here a few weeks ago about someone who went to a course tasting event and felt embarrassed. This AITAH post had the target going to a pot luck dinner and getting weirded out. As an adult you have to recognize your issues and be able to make do with them. You cant accept an invitation to a large shared culinary event and then show up and make faces and comments and leave early, like wtf did you think was going to happen? You either decline the invite or you show up and act polite. \n\nThat post then gives people so much ammo to be like \"its not the eating its the attitude\" when really it's a little of both.",
      "created_utc": 1723752072.0,
      "score": 16,
      "context": [
        {
          "id": "li9v0j9",
          "author": "None",
          "body": "Oh yes I saw that post earlier and yeah, most of the comments were so biased against the picky eater and the poster was like they don't have ARFID but they described someone that has ARFID. (I have misophonia too.)",
          "created_utc": 1723743858.0
        }
      ]
    },
    {
      "id": "liafqf2",
      "author": "FizzyBunch",
      "body": "How is that capitalistic?",
      "created_utc": 1723750418.0,
      "score": 10,
      "context": [
        {
          "id": "li9sjon",
          "author": "everythingnerdcatboy",
          "body": "People are at this point not just ignorant but intentionally ableist. I think it's the very capitalist idea of \"you should be happy that you have food to eat at all\"",
          "created_utc": 1723743091.0
        }
      ]
    },
    {
      "id": "liea0i0",
      "author": "Runtelldat1",
      "body": "I never considered a label for my eating habits. I did get side-eyed for ordering stuff without ____ and ____ and ____, but hey, it’s MY food. I want to enjoy what I’m eating. I think that’s why I cook my food more than eat out nowadays. It’s so much easier than having to be so specific that it annoys the other person and then they get it wrong anyway. \n\nI’d love to eat cheese like everyone else does apparently (it’s seems to be included in and on everything regardless of how many lactose intolerant people actually exist…). I could go on and on but I’m among friends. \n\nI don’t think people realize how hard this makes our lives. It’s not something that is chosen. It just IS. Periodically I try to include those foods but it always ends the same. In disappointment. I eat to live not live to eat.\n\nLive and let live.",
      "created_utc": 1723811593.0,
      "score": 4,
      "context": [
        {
          "id": "li9sl5z",
          "author": "biscottiapricot",
          "body": "they think that it's something we can control and that we do it for attention for some reason",
          "created_utc": 1723743103.0
        }
      ]
    },
    {
      "id": "lia90s1",
      "author": "Solanumm",
      "body": "Yeah especially on a subreddit where the entire purpose is to judge people (in 90% fake stories I might add). Might quit the site again, last time I did it did wonders for my mental health lol.",
      "created_utc": 1723748249.0,
      "score": 7,
      "context": [
        {
          "id": "lia8bxy",
          "author": "PeachOnAWarmBeach",
          "body": "Yeah,  I knew what to expect and still only made it through one or two comments 😆  Reddit loves to hate others who don't fit their narrow-minded mold.  A flaming dumpster should be the logo.  \n\n\n| \"Different is EVIL and WRONG  and doesn't deserve to exist!\" (Sarcasm, obv)",
          "created_utc": 1723748033.0
        }
      ]
    },
    {
      "id": "liaa3m0",
      "author": "Solanumm",
      "body": "The funniest thing is I cannot eat pizza at all, which is like the stereotype for it all.",
      "created_utc": 1723748589.0,
      "score": 5,
      "context": [
        {
          "id": "lia9im1",
          "author": "Fizzabl",
          "body": "Most people think we're lying. Most little kids say they're fussy and won't eat veg but it's usually just.. idk toddler stubbornness. So people see picky eating as something for babies, and we all need to grow up\n\n\nMy mom's favourite singer has a song called \"I Hate\" and it's what it sounds like, a song about things he hates, mostly trivial, but the line \"I hate fussy eaters, you cook them fajitas, they only eat pizza and chips\" has ALWAYS rubbed me up the wrong way. Probably a light joke but I can't stand it!",
          "created_utc": 1723748405.0
        }
      ]
    },
    {
      "id": "liacnqn",
      "author": "None",
      "body": "They mean well, I'm sure, but people try to strike up conversations about your eating disorder nonchalantly like it's a hobby of yours and it's gets grating as hell. Then everyone at the table starts sharing their opinions on your diet and your meal like its just so fucking interesting and it's like surely we can think of something else to talk about.",
      "created_utc": 1723749415.0,
      "score": 11,
      "context": [
        {
          "id": "li9zby3",
          "author": "Wellslapmesilly",
          "body": "I don't have ARFID but I'm close to someone who does. From my observations I would say that most people do not know about or understand the condition so they react badly sometimes. On the other side, I think that folks with ARFID don't fully understand or relate to, the extent that positive emotions are involved with food for those without ARFID, so out the gate, most people are not on common ground. In general, many people love food and all the rituals surrounding it. So because of the lack of understanding about ARFID, people often say dumb stuff. I have also noticed that because of this, it creates a bit of a reverse hyperarousal about food when around other people. I've seen this with my loved one. They are so ready for people to pick on them about what they are eating that the smallest comment can send them spinning. Often I've noticed that people were not trying to be a jerk they just end up in a bit of a minefield due to being unaware of the situation. Outside of family dynamics, it's pretty rare to have someone say \"grow up\" etc. I will say though that most people who say ignorant things or push the issue about someone eating in a way that is unusual to them, often can be redirected pretty easily once you realize that and learn to just be nonchalant about it, own your choices and shut them down. It's not easy but once you master it, it can reduce a ton of anxiety about eating around others.",
          "created_utc": 1723745202.0
        }
      ]
    },
    {
      "id": "lia282f",
      "author": "Pothperhaps",
      "body": "Thank you for supporting your person<3 we need more of you in this world",
      "created_utc": 1723746109.0,
      "score": 5,
      "context": [
        {
          "id": "li9zby3",
          "author": "Wellslapmesilly",
          "body": "I don't have ARFID but I'm close to someone who does. From my observations I would say that most people do not know about or understand the condition so they react badly sometimes. On the other side, I think that folks with ARFID don't fully understand or relate to, the extent that positive emotions are involved with food for those without ARFID, so out the gate, most people are not on common ground. In general, many people love food and all the rituals surrounding it. So because of the lack of understanding about ARFID, people often say dumb stuff. I have also noticed that because of this, it creates a bit of a reverse hyperarousal about food when around other people. I've seen this with my loved one. They are so ready for people to pick on them about what they are eating that the smallest comment can send them spinning. Often I've noticed that people were not trying to be a jerk they just end up in a bit of a minefield due to being unaware of the situation. Outside of family dynamics, it's pretty rare to have someone say \"grow up\" etc. I will say though that most people who say ignorant things or push the issue about someone eating in a way that is unusual to them, often can be redirected pretty easily once you realize that and learn to just be nonchalant about it, own your choices and shut them down. It's not easy but once you master it, it can reduce a ton of anxiety about eating around others.",
          "created_utc": 1723745202.0
        }
      ]
    },
    {
      "id": "liaqmxy",
      "author": "shitz_brickz",
      "body": ">They are so ready for people to pick on them about what they are eating that the smallest comment can send them spinning.\n\nI have to remind myself about this often, that as much as you expect other people to have patience and be understanding, I need to do the same. I will always start with a polite \"no thank you, it looks delicious but it wont agree with my stomach\" and that almost always does fine. Some people push it, especially like family who I know, they know I will not be eating, to where I will occasionally lash out with \"AM I NOT SPEAKING ENGLISH? NO. THANK. YOU. FEED THE ANAPHYLAXIS KID PEANUTS IF YOU ARE LOOKING FOR A CHALLENGE.\"",
      "created_utc": 1723753883.0,
      "score": 6,
      "context": [
        {
          "id": "li9zby3",
          "author": "Wellslapmesilly",
          "body": "I don't have ARFID but I'm close to someone who does. From my observations I would say that most people do not know about or understand the condition so they react badly sometimes. On the other side, I think that folks with ARFID don't fully understand or relate to, the extent that positive emotions are involved with food for those without ARFID, so out the gate, most people are not on common ground. In general, many people love food and all the rituals surrounding it. So because of the lack of understanding about ARFID, people often say dumb stuff. I have also noticed that because of this, it creates a bit of a reverse hyperarousal about food when around other people. I've seen this with my loved one. They are so ready for people to pick on them about what they are eating that the smallest comment can send them spinning. Often I've noticed that people were not trying to be a jerk they just end up in a bit of a minefield due to being unaware of the situation. Outside of family dynamics, it's pretty rare to have someone say \"grow up\" etc. I will say though that most people who say ignorant things or push the issue about someone eating in a way that is unusual to them, often can be redirected pretty easily once you realize that and learn to just be nonchalant about it, own your choices and shut them down. It's not easy but once you master it, it can reduce a ton of anxiety about eating around others.",
          "created_utc": 1723745202.0
        }
      ]
    },
    {
      "id": "lia71u7",
      "author": "In_The_Play",
      "body": "I think that is at least part of it, but tbh I think that part of the time that is just an excuse. The irritation and hatred does seem to go a lot deeper than that, and some people are really bothered by even considerate 'picky' eaters. I think it just comes down to not having the ability to see things from other people's perspectives and at times a lack of empathy.",
      "created_utc": 1723747633.0,
      "score": 11,
      "context": [
        {
          "id": "li9yv76",
          "author": "Nova-Prospekt",
          "body": "I think it has to do with their personal experiences dealing with *inconsiderate* picky eaters. As r/ARFID users, we realize that in order to live with the disorder and be considerate, we have to notify people of our dietary restrictions and find our own ways to eat the foods that we can. I personally always try to make sure that I can secure a source of safe food if I am to go out with friends. However, there are picky eaters who inconvenience others by forcing friends and family to (often unexpectedly) accommodate their food preferences at the expense of others' enjoyment. Those picky eaters can often be lumped together with people who have genuine disorders. When you don't know that there is a disorder involved, it is just seen as being rude.",
          "created_utc": 1723745054.0
        }
      ]
    },
    {
      "id": "li9zekg",
      "author": "Solanumm",
      "body": "This does make sense. The person everyone hated in the post was being very rude and dismissive and I can see how everyone would then translate that rudeness onto others. A lot of the comments I saw were all just preconceived notions like \"if you are picky you are boring in other areas too\"",
      "created_utc": 1723745225.0,
      "score": 6,
      "context": [
        {
          "id": "li9yv76",
          "author": "Nova-Prospekt",
          "body": "I think it has to do with their personal experiences dealing with *inconsiderate* picky eaters. As r/ARFID users, we realize that in order to live with the disorder and be considerate, we have to notify people of our dietary restrictions and find our own ways to eat the foods that we can. I personally always try to make sure that I can secure a source of safe food if I am to go out with friends. However, there are picky eaters who inconvenience others by forcing friends and family to (often unexpectedly) accommodate their food preferences at the expense of others' enjoyment. Those picky eaters can often be lumped together with people who have genuine disorders. When you don't know that there is a disorder involved, it is just seen as being rude.",
          "created_utc": 1723745054.0
        }
      ]
    },
    {
      "id": "lige5kz",
      "author": "Impossible_Girl_23",
      "body": "How many inconsiderate omnivores/vegetarians/vegans/gluten-free/etc etc people does *everyone* have to deal with? Plenty! ;) I'm 51 and I'm not cutting anyone any slack for their unkindness to particular eaters. So many people have restrictions of one kind or another at this point, people need to just mind their own plates!",
      "created_utc": 1723836596.0,
      "score": 1,
      "context": [
        {
          "id": "li9yv76",
          "author": "Nova-Prospekt",
          "body": "I think it has to do with their personal experiences dealing with *inconsiderate* picky eaters. As r/ARFID users, we realize that in order to live with the disorder and be considerate, we have to notify people of our dietary restrictions and find our own ways to eat the foods that we can. I personally always try to make sure that I can secure a source of safe food if I am to go out with friends. However, there are picky eaters who inconvenience others by forcing friends and family to (often unexpectedly) accommodate their food preferences at the expense of others' enjoyment. Those picky eaters can often be lumped together with people who have genuine disorders. When you don't know that there is a disorder involved, it is just seen as being rude.",
          "created_utc": 1723745054.0
        }
      ]
    },
    {
      "id": "liacyw0",
      "author": "Solanumm",
      "body": "You seem like a really good parent for learning and understanding your kids condition! I had a similar thing with my mum. As a child she would always make me sit with everyone for meals and it was torture for me, mostly with the misophonia and not being able to bear hearing people eat. But once I found a name for it and showed her she immediately read up on it and started being so much more accomodating! With more research and understanding of these conditions I hope people become far more accepting and understanding",
      "created_utc": 1723749516.0,
      "score": 2,
      "context": [
        {
          "id": "liabse1",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1723749133.0
        }
      ]
    },
    {
      "id": "liamijo",
      "author": "Solanumm",
      "body": "You're not overstepping at all! I've wondered a lot of times if I have some sort of neurodivergence. Ultimately I haven't seeked out any diagnoses as I don't really see what they will help with as an adult.",
      "created_utc": 1723752577.0,
      "score": 3,
      "context": [
        {
          "id": "lial9ol",
          "author": "Kauuori",
          "body": "Sorry if I overstep, but sensory issues, manifested as many ways, some of which can revolve around food \"being picky\" or sensitivity around sounds, can be a sign of autism or ADHD. I'd advise for you to look that out If you haven't already. I'm not saying you must have it but I argue it's great to at least keep it in mind.",
          "created_utc": 1723752181.0
        }
      ]
    },
    {
      "id": "liaafer",
      "author": "Solanumm",
      "body": "Yeah I understand that! I think if food is really important to someone then its understandable that they might not want to date someone who cannot deal with most foods. Its just so often theres such a horrible attitude about it",
      "created_utc": 1723748694.0,
      "score": 5,
      "context": [
        {
          "id": "lia9280",
          "author": "Fanny_packs",
          "body": "I don’t have ARFID, but my sister does. I recognize that it’s real and I huge struggle for her that she wishes she didn’t have to deal with. She is always kind and considerate and doesn’t expect everyone to bend and adapt to her food needs. That being said it is hard sometimes. We just got back from Disney World where I ate a lot of pizza so that we could all eat together. If we wanted to go to a nice restaurant or somewhere that didn’t have something she could eat she would 100% push us to go, but at the end of the day I’d rather spend time and eat together. People can definitely be assholes about “picky eaters” and I’m not discrediting that and it’s not okay, but loving someone with AFRID can be really challenging too. They should still be treated with respect and not belittled for something they can’t control, but I do understand how it could be a deal breaker in romantic relationships. For a lot of people it doesn’t matter, but if it does for some people I think they’re justified in that based on my experiences.",
          "created_utc": 1723748262.0
        }
      ]
    },
    {
      "id": "lidztfn",
      "author": "Solanumm",
      "body": "I can definitely understand! Sorry that you two have to deal with that :( Misophonia definitely hurts whoever has it as well as those closest to them. I cannot eat with my family and it really does suck. I just wish that people who aren't affected by it/close to someone with it wouldn't be so judgemental towards people who have it / afrid etc.",
      "created_utc": 1723807073.0,
      "score": 1,
      "context": [
        {
          "id": "licrpl3",
          "author": "Akavinceblack",
          "body": " The ARFID not so much, but living with someone with misophonia can really suck.    \n\nI barely ever eat with my husband anymore because the slightest eating sound grates on him and it’s zero fun (and impossible)to try to eat completely silently lest he lose his appetite over ”slurping” and ”smacking”.",
          "created_utc": 1723780995.0
        }
      ]
    },
    {
      "id": "lieiob3",
      "author": "Solanumm",
      "body": "I'm sorry you had that experience! And I'm sorry you judge all of us by it. Personally I try and be as respectful of others as I can. I would never dream of forcing my partner to eat what I'm limited to, and making the disgusting faces wtf?? He sounds like a dick and that is not at all representative of most of us.",
      "created_utc": 1723814896.0,
      "score": 2,
      "context": [
        {
          "id": "lieel3l",
          "author": "StrangeClouds_",
          "body": "I hate picky eaters because I dated and was abused by one. We ate only his safe foods as my wants were deemed unnecessary and a waste of money since he wasn’t going to eat them. We never went out to eat. Anytime I did manage to eat food I was craving, he would sit beside me and make disgusting faces and gag into my plate… like why? Leave the room. Stop fixating on what I’m eating and eat your cheese pizza. I left him and married a chef. \n\nI understand that you probably didn’t want an honest answer, this place is kind of like an echo chamber. \nI joined this sub to try and understand, the posts are sometimes funny and sometimes infuriating. At least you all have each other.",
          "created_utc": 1723813387.0
        }
      ]
    },
    {
      "id": "liaejor",
      "author": "Armayra",
      "body": "THIS!!! Whenever I hear this I always take it as 'tell me you know nothing about having an ED without telling me you nothing about having an ED'. No one should WANT an ED, and this mentality is just so insane to me. I wouldn't wish it on my worst enemy.",
      "created_utc": 1723750032.0,
      "score": 79,
      "context": [
        {
          "id": "li9x6k7",
          "author": "giraffemoo",
          "body": "I think they think we are faking, like they are sitting there feeling like they wish they could just eat pizza and French fries all the time instead of the varieties of healthy food that most people usually eat. \n\nThat has been said to me, anyway. Someone said \"I wish I had an eating disorder like yours so I could just eat whatever I want all the time\". This was during a time when I had a special meal that was more appealing than what everyone else was eating. \n\nThey just don't understand.",
          "created_utc": 1723744529.0
        },
        {
          "id": "lia88a8",
          "author": "AlucardsAssistant",
          "body": "I find “I wish I had an eating disorder like yours so I could just eat what I want all the time” so ironic because I WISH I could actually eat whatever I want at any given moment instead of having such a restrictive diet.",
          "created_utc": 1723748002.0
        }
      ]
    },
    {
      "id": "lidkmhl",
      "author": "sxkuba",
      "body": "this exactly.. actually THEY are the ones that can just eat what they want all the time.",
      "created_utc": 1723797989.0,
      "score": 24,
      "context": [
        {
          "id": "li9x6k7",
          "author": "giraffemoo",
          "body": "I think they think we are faking, like they are sitting there feeling like they wish they could just eat pizza and French fries all the time instead of the varieties of healthy food that most people usually eat. \n\nThat has been said to me, anyway. Someone said \"I wish I had an eating disorder like yours so I could just eat whatever I want all the time\". This was during a time when I had a special meal that was more appealing than what everyone else was eating. \n\nThey just don't understand.",
          "created_utc": 1723744529.0
        },
        {
          "id": "lia88a8",
          "author": "AlucardsAssistant",
          "body": "I find “I wish I had an eating disorder like yours so I could just eat what I want all the time” so ironic because I WISH I could actually eat whatever I want at any given moment instead of having such a restrictive diet.",
          "created_utc": 1723748002.0
        }
      ]
    },
    {
      "id": "lie58qy",
      "author": "Bman10119",
      "body": "I know. I so badly wish i could eat thai food because i love spicy but just the idea of all the different things mixed together and touching and the potential of one of the ingredients being one that sets me off is just a nightmare. God i wish i could eat more foods without skyrocketing anxiety",
      "created_utc": 1723809573.0,
      "score": 11,
      "context": [
        {
          "id": "li9x6k7",
          "author": "giraffemoo",
          "body": "I think they think we are faking, like they are sitting there feeling like they wish they could just eat pizza and French fries all the time instead of the varieties of healthy food that most people usually eat. \n\nThat has been said to me, anyway. Someone said \"I wish I had an eating disorder like yours so I could just eat whatever I want all the time\". This was during a time when I had a special meal that was more appealing than what everyone else was eating. \n\nThey just don't understand.",
          "created_utc": 1723744529.0
        },
        {
          "id": "lia88a8",
          "author": "AlucardsAssistant",
          "body": "I find “I wish I had an eating disorder like yours so I could just eat what I want all the time” so ironic because I WISH I could actually eat whatever I want at any given moment instead of having such a restrictive diet.",
          "created_utc": 1723748002.0
        }
      ]
    },
    {
      "id": "liiymi4",
      "author": "None",
      "body": "It’s sad because no one raises awareness and, when someone does, it HAS to be followed by showing the person trying different foods in therapy and vomiting, but claiming that the therapy is working.\n\nIt’s like we’re not allowed to just exist with the disorder unless we are actively trying to get rid of it, but who wants to vomit daily just to show others that they are trying to get rid of ARFID?",
      "created_utc": 1723874141.0,
      "score": 2,
      "context": [
        {
          "id": "li9x6k7",
          "author": "giraffemoo",
          "body": "I think they think we are faking, like they are sitting there feeling like they wish they could just eat pizza and French fries all the time instead of the varieties of healthy food that most people usually eat. \n\nThat has been said to me, anyway. Someone said \"I wish I had an eating disorder like yours so I could just eat whatever I want all the time\". This was during a time when I had a special meal that was more appealing than what everyone else was eating. \n\nThey just don't understand.",
          "created_utc": 1723744529.0
        },
        {
          "id": "liclvli",
          "author": "knowledgelover94",
          "body": "Yea, this is it. They just don’t understand what it’s like. It’s a pretty rare condition so I’m not surprised most people are ignorant about it. \n\nThis makes me think, I feel like we should be pushing for ARFID awareness. If there was some kind of awareness campaign about it, maybe people would be more compassionate about it.",
          "created_utc": 1723778347.0
        }
      ]
    },
    {
      "id": "lidkpvq",
      "author": "None",
      "body": "sulky disagreeable snatch placid coherent aloof foolish depend wild ludicrous\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
      "created_utc": 1723798051.0,
      "score": 9,
      "context": [
        {
          "id": "li9w1uc",
          "author": "Mother_Goat1541",
          "body": "Yep, I don’t engage with any “picky eater” posts because it always ends with people going rabid.",
          "created_utc": 1723744180.0
        },
        {
          "id": "liabqe4",
          "author": "None",
          "body": "It sure does get wild in those posts, such intense anger and hate over just not wanting to eat the same food.",
          "created_utc": 1723749115.0
        }
      ]
    },
    {
      "id": "liiyykg",
      "author": "None",
      "body": "People also think that if THEY like something, then you HAVE to like it. I have ordered salad when everyone else did and had someone to get upset that I didn’t want salad dressing.",
      "created_utc": 1723874344.0,
      "score": 2,
      "context": [
        {
          "id": "li9tet0",
          "author": "peppasauz",
          "body": "I think it goes back to \"ego\". A parent makes you food, you refuse it, they internalize it as a them problem but turn it into a you problem. \n\nI had a friend at lunch one day look at me and say \"don't make me feel like such a fata$$ for eating this pizza\" when I ordered a salad. They are self-conscious about their food choices and hoping that you'll reflect back to them that it's not a poor decision by getting something equally unhealthy for yourself.",
          "created_utc": 1723743358.0
        },
        {
          "id": "li9tuai",
          "author": "Solanumm",
          "body": "I see that kind of thing everywhere. People insecure about their own decisions so when they see someone else do something different they see it as an attack or moral judgement.",
          "created_utc": 1723743493.0
        }
      ]
    },
    {
      "id": "libcgcj",
      "author": "siburyo",
      "body": "Yeah, I think it actually made it worse. Foods I disliked but wasn't forced to eat I can tolerate much better. But foods I was forced to eat still make me throw up.",
      "created_utc": 1723761056.0,
      "score": 41,
      "context": [
        {
          "id": "li9ywu9",
          "author": "bruh_respectfully",
          "body": "In my experience, a lot of people who hate picky eaters have the \"I suffer(ed) so you should too\" mentality. They were forced to eat things they hated as children by their parents for various reasons ranging from ego to poor living conditions and they carried that attitude over into adulthood. A lot of them see your refusal to eat something as entitlement because they couldn't do the same in the past or can't do so presently.\n\nRegardless, judging people for what they eat has always been incomprehensible to me.",
          "created_utc": 1723745069.0
        },
        {
          "id": "lib7i14",
          "author": "_EmeraldEye_",
          "body": "It's so wild cause being forced to eat things didn't make me less picky/sensory sensitive",
          "created_utc": 1723759328.0
        }
      ]
    },
    {
      "id": "lidtc3s",
      "author": "bruh_respectfully",
      "body": "Growing up, I heard a lot of \"eat it or go hungry\" and at some point I just decided I'd rather go hungry. I'd just feel sick after eating some things, so it wasn't worth it in my eyes. A lot of parents don't count on their child actually refusing food. My own changed their tune quickly after I started skipping entire meals.\n\nIt's honestly sad how stressful mealtime is for a lot of children. I remember dreading having to eat. It was a time for weird powerplays in my household.",
      "created_utc": 1723803597.0,
      "score": 16,
      "context": [
        {
          "id": "li9ywu9",
          "author": "bruh_respectfully",
          "body": "In my experience, a lot of people who hate picky eaters have the \"I suffer(ed) so you should too\" mentality. They were forced to eat things they hated as children by their parents for various reasons ranging from ego to poor living conditions and they carried that attitude over into adulthood. A lot of them see your refusal to eat something as entitlement because they couldn't do the same in the past or can't do so presently.\n\nRegardless, judging people for what they eat has always been incomprehensible to me.",
          "created_utc": 1723745069.0
        },
        {
          "id": "lib7i14",
          "author": "_EmeraldEye_",
          "body": "It's so wild cause being forced to eat things didn't make me less picky/sensory sensitive",
          "created_utc": 1723759328.0
        }
      ]
    },
    {
      "id": "lidcwei",
      "author": "bunchedupwalrus",
      "body": "Just made me go into fight or flight mode once I was out of my home and someone would offer me food I didn’t want \n\nHonestly I do wonder if being forced to eat the foods contributes to the disorder. It used to be that if I even looked at a hamburger I used to mildly disassociate because of the times I’d had it shoved towards my face when I wouldn’t eat. \n\nI have an ADHD diagnosis as well, and definitely some oppositional defiance aspects of it. Most of my early memories of someone trying to insist I eat something I remember digging in even deeper getting furious, scared, etc. How could that not worsen a negative association",
      "created_utc": 1723792837.0,
      "score": 9,
      "context": [
        {
          "id": "li9ywu9",
          "author": "bruh_respectfully",
          "body": "In my experience, a lot of people who hate picky eaters have the \"I suffer(ed) so you should too\" mentality. They were forced to eat things they hated as children by their parents for various reasons ranging from ego to poor living conditions and they carried that attitude over into adulthood. A lot of them see your refusal to eat something as entitlement because they couldn't do the same in the past or can't do so presently.\n\nRegardless, judging people for what they eat has always been incomprehensible to me.",
          "created_utc": 1723745069.0
        },
        {
          "id": "lib7i14",
          "author": "_EmeraldEye_",
          "body": "It's so wild cause being forced to eat things didn't make me less picky/sensory sensitive",
          "created_utc": 1723759328.0
        }
      ]
    },
    {
      "id": "liaevoq",
      "author": "Hot_Razzmatazz316",
      "body": "Ooh, I like ethnomusicology too! I teach voice and acting, so it all ties together. I also have a background in psychology, funny enough). \n\nThere are so many facets to culinary anthropology that it really depends on what you want to focus on. Broadly this [text book](https://www.cambridge.org/core/books/social-archaeology-of-food/4F91FAA734ED57D07C641B9A25049203) has a good overview, but there are so many books out there that focus on specific cultures, countries, and even foods themselves. I can't think of the name of the author, but I know there's a book out there that discusses like the evolution of bread in society and how it came to be cultivated and integrated into religious ceremonies (I'll have to look for that title, because it was really interesting). \n\nI've also found it interesting to just read old cookbooks, magazines and etiquette guides.",
      "created_utc": 1723750139.0,
      "score": 11,
      "context": [
        {
          "id": "lia3v6u",
          "author": "Hot_Razzmatazz316",
          "body": "Hey, sorry people are jerks. Hugs\n\nI think a lot of it is how we're socialized. From a biological viewpoint, we need food to survive. So getting food is a biological imperative and impetus. Anthropologically speaking, food is a resource, and by offering to share a resource with someone else, that person will have less, which will affect their survival. Acceptance of the resource (ie, eating the food) is honoring the sacrifice (both the food itself as well as the time it took to prepare the food and the fact that the person giving you the food now has less for themself.)\n\n All over the world, food is tied to cultural, social, and religious traditions. Some people view not eating certain foods (regardless of the reason) as a rejection of these practices, and thereby the people themselves. This is especially true in countries and cultures where food preparation involves things like hunting harvesting and preparing the basic ingredients for recipes.\n\nIn a lot of developed nations, I think people view so-called \"picky eating\" as a privilege. Having enough to eat has always been a sign of success (both in an anthropological sense and a capitalistic sense), whereas not having enough food to eat has always been an indicator of not having enough money or status (so that people would feel inclined to share their food with you). The prevailing thought in many societies has typically been, if you're hungry enough, you'll eat whatever is available, and you can only turn your nose up at food if you're wealthy enough to afford something else. This kind of thinking looks at eating from a purely biological necessity without any of the psychological or even physiological elements (like allergies) that are associated with food. It's also classist: wealthy people get to choose food, beggars can't be choosers. It could be thought of as ableist, depending on the context: if someone else is preparing the food for you and doing the work, you get no say.\n\nAnd I mean, those are just some of the basic, global ideas about food. That doesn't even take into account people's individual family histories and experiences with eating and meals, which are all highly subjective. If one grew up in a household where the family was food insecure, the parents might not have had a lot of choices about what foods they could afford. Or perhaps someone had parents who were very mindful about wasting food, or it was tied to culture or religion and alternatives weren't an option. \n\nI say all this because in my experience food is such a subjective issue that people really, really take personally. I find it fascinating that even in this day and age when so much of the world is becoming more tolerant and educated, deviation from food normative behavior is still one thing that people have a hard time accepting. And maybe it's because it goes back to it being a biological need, and something that uses up resources, I don't know. It's weird that we'll accept that people from other cultures eat differently, but not people from our own, even if they're friends or family.",
          "created_utc": 1723746626.0
        },
        {
          "id": "liabf8u",
          "author": "lemurificspeckle",
          "body": "I LOVE this!!!!!! So so so interesting!! A couple of times I’ve said to folks that having ARFID makes you so acutely aware of how important food is, not just biologically but socially and culturally. Just like how it’s hard to see exactly what your culture is until you’re outside of it, because being steeped in it all your life you kind of go blind to it! Us ARFIDers aren’t quite cultural natives to food, so we (or at least I) notice just how much of our life revolves around/involves food!! \n\nIf you have any good sources to learn about culinary anthropology I’d love to see em!! Just graduated with my degree in ethnomusicology and psychology so I love all that stuff haha",
          "created_utc": 1723749014.0
        }
      ]
    },
    {
      "id": "lia5qvo",
      "author": "Hot_Razzmatazz316",
      "body": "Thanks! Culinary anthropology is one of my random niche interests",
      "created_utc": 1723747221.0,
      "score": 4,
      "context": [
        {
          "id": "lia3v6u",
          "author": "Hot_Razzmatazz316",
          "body": "Hey, sorry people are jerks. Hugs\n\nI think a lot of it is how we're socialized. From a biological viewpoint, we need food to survive. So getting food is a biological imperative and impetus. Anthropologically speaking, food is a resource, and by offering to share a resource with someone else, that person will have less, which will affect their survival. Acceptance of the resource (ie, eating the food) is honoring the sacrifice (both the food itself as well as the time it took to prepare the food and the fact that the person giving you the food now has less for themself.)\n\n All over the world, food is tied to cultural, social, and religious traditions. Some people view not eating certain foods (regardless of the reason) as a rejection of these practices, and thereby the people themselves. This is especially true in countries and cultures where food preparation involves things like hunting harvesting and preparing the basic ingredients for recipes.\n\nIn a lot of developed nations, I think people view so-called \"picky eating\" as a privilege. Having enough to eat has always been a sign of success (both in an anthropological sense and a capitalistic sense), whereas not having enough food to eat has always been an indicator of not having enough money or status (so that people would feel inclined to share their food with you). The prevailing thought in many societies has typically been, if you're hungry enough, you'll eat whatever is available, and you can only turn your nose up at food if you're wealthy enough to afford something else. This kind of thinking looks at eating from a purely biological necessity without any of the psychological or even physiological elements (like allergies) that are associated with food. It's also classist: wealthy people get to choose food, beggars can't be choosers. It could be thought of as ableist, depending on the context: if someone else is preparing the food for you and doing the work, you get no say.\n\nAnd I mean, those are just some of the basic, global ideas about food. That doesn't even take into account people's individual family histories and experiences with eating and meals, which are all highly subjective. If one grew up in a household where the family was food insecure, the parents might not have had a lot of choices about what foods they could afford. Or perhaps someone had parents who were very mindful about wasting food, or it was tied to culture or religion and alternatives weren't an option. \n\nI say all this because in my experience food is such a subjective issue that people really, really take personally. I find it fascinating that even in this day and age when so much of the world is becoming more tolerant and educated, deviation from food normative behavior is still one thing that people have a hard time accepting. And maybe it's because it goes back to it being a biological need, and something that uses up resources, I don't know. It's weird that we'll accept that people from other cultures eat differently, but not people from our own, even if they're friends or family.",
          "created_utc": 1723746626.0
        },
        {
          "id": "lia4kvw",
          "author": "Solanumm",
          "body": "Really interesting to read!",
          "created_utc": 1723746854.0
        }
      ]
    },
    {
      "id": "lic6p5c",
      "author": "unicorn_in-training",
      "body": "It really does make dating hard, but on the other hand it’s an easy way to weed out people who aren’t going to be a good match for you. It doesn’t feel great to get rejected because of how we eat, but in the long run it saves us the pain of finding out that person’s true colors far later in the dating process. \n\nFor anyone reading this who is dating or wants to date but is scared to, know that there ARE good people out there who will love you for who you are ❤️",
      "created_utc": 1723772155.0,
      "score": 13,
      "context": [
        {
          "id": "lia89ki",
          "author": "0pyrophosphate0",
          "body": "It's kind of weird, because Reddit as a whole seems pretty sympathetic toward depression, anxiety, and mental health *in general*, but specifically when it comes to \"picky eating\", then you're a toddler and an asshole and how could you possibly have any friends. \n\nFor some of those people, it seems the picky eaters in their lives may have had bad attitudes about it, and they're associating the bad attitudes with the eating habits. Many of them just seem personally offended that other people don't eat a wide variety of foods.\n\nAnd it's not just the AITH-type posts, look for any post on any sub about deal breakers in dating. Picky eating is usually near the top, complete with a long thread of people lamenting that picky eaters exist as adults.",
          "created_utc": 1723748013.0
        },
        {
          "id": "lia9hww",
          "author": "Solanumm",
          "body": "For real. Once I was getting along really well with someone and we were settling on a first date when I let slip that I was not the best with food (but explictly mentioned I wasn't close minded or anything it was an actual issue). She immediately got super distant and then blocked me. Just kind of sucks that such a small thing is a dealbreaker for so many.",
          "created_utc": 1723748399.0
        }
      ]
    },
    {
      "id": "lib768r",
      "author": "puppyhugtime",
      "body": "Because poverty and food scarcity are conditions that exist because of capitalism",
      "created_utc": 1723759217.0,
      "score": 16,
      "context": [
        {
          "id": "li9sjon",
          "author": "everythingnerdcatboy",
          "body": "People are at this point not just ignorant but intentionally ableist. I think it's the very capitalist idea of \"you should be happy that you have food to eat at all\"",
          "created_utc": 1723743091.0
        },
        {
          "id": "liafqf2",
          "author": "FizzyBunch",
          "body": "How is that capitalistic?",
          "created_utc": 1723750418.0
        }
      ]
    },
    {
      "id": "lieop35",
      "author": "biscottiapricot",
      "body": "i also can't eat cheese (both mildly lactose intolerant and i just hate the taste and texture) but i really want to!! a cheese toastie seems so so good and i want to have cheese and crackers or add cheese to my pasta but alas..",
      "created_utc": 1723817011.0,
      "score": 3,
      "context": [
        {
          "id": "li9sl5z",
          "author": "biscottiapricot",
          "body": "they think that it's something we can control and that we do it for attention for some reason",
          "created_utc": 1723743103.0
        },
        {
          "id": "liea0i0",
          "author": "Runtelldat1",
          "body": "I never considered a label for my eating habits. I did get side-eyed for ordering stuff without ____ and ____ and ____, but hey, it’s MY food. I want to enjoy what I’m eating. I think that’s why I cook my food more than eat out nowadays. It’s so much easier than having to be so specific that it annoys the other person and then they get it wrong anyway. \n\nI’d love to eat cheese like everyone else does apparently (it’s seems to be included in and on everything regardless of how many lactose intolerant people actually exist…). I could go on and on but I’m among friends. \n\nI don’t think people realize how hard this makes our lives. It’s not something that is chosen. It just IS. Periodically I try to include those foods but it always ends the same. In disappointment. I eat to live not live to eat.\n\nLive and let live.",
          "created_utc": 1723811593.0
        }
      ]
    },
    {
      "id": "liafn03",
      "author": "Wellslapmesilly",
      "body": "I get it. The issue is that yes, talking about food and eating is indeed unfortunately, a hobby for others and it is considered a\"light\" subject to them even if it is definitely not for you. Truly, just distracting and redirecting people onto another subject with a laugh really does work. I know talking about eating habits is super triggering but it's often not affecting other people at the same level as it is you. So it's actually kind of easy to change the subject and distract f you can muster some lightheartedness doing so, even though I know it does suck, and in a perfect world you wouldn't have to deal with it at all, It is effective. It takes time though and is a learned skill.",
      "created_utc": 1723750386.0,
      "score": 6,
      "context": [
        {
          "id": "li9zby3",
          "author": "Wellslapmesilly",
          "body": "I don't have ARFID but I'm close to someone who does. From my observations I would say that most people do not know about or understand the condition so they react badly sometimes. On the other side, I think that folks with ARFID don't fully understand or relate to, the extent that positive emotions are involved with food for those without ARFID, so out the gate, most people are not on common ground. In general, many people love food and all the rituals surrounding it. So because of the lack of understanding about ARFID, people often say dumb stuff. I have also noticed that because of this, it creates a bit of a reverse hyperarousal about food when around other people. I've seen this with my loved one. They are so ready for people to pick on them about what they are eating that the smallest comment can send them spinning. Often I've noticed that people were not trying to be a jerk they just end up in a bit of a minefield due to being unaware of the situation. Outside of family dynamics, it's pretty rare to have someone say \"grow up\" etc. I will say though that most people who say ignorant things or push the issue about someone eating in a way that is unusual to them, often can be redirected pretty easily once you realize that and learn to just be nonchalant about it, own your choices and shut them down. It's not easy but once you master it, it can reduce a ton of anxiety about eating around others.",
          "created_utc": 1723745202.0
        },
        {
          "id": "liacnqn",
          "author": "None",
          "body": "They mean well, I'm sure, but people try to strike up conversations about your eating disorder nonchalantly like it's a hobby of yours and it's gets grating as hell. Then everyone at the table starts sharing their opinions on your diet and your meal like its just so fucking interesting and it's like surely we can think of something else to talk about.",
          "created_utc": 1723749415.0
        }
      ]
    },
    {
      "id": "lia3gu7",
      "author": "Wellslapmesilly",
      "body": "Thanks <3 It's been quite the journey and I've learned so much. I have tried super hard to be a safe person for them about all things food related.",
      "created_utc": 1723746498.0,
      "score": 5,
      "context": [
        {
          "id": "li9zby3",
          "author": "Wellslapmesilly",
          "body": "I don't have ARFID but I'm close to someone who does. From my observations I would say that most people do not know about or understand the condition so they react badly sometimes. On the other side, I think that folks with ARFID don't fully understand or relate to, the extent that positive emotions are involved with food for those without ARFID, so out the gate, most people are not on common ground. In general, many people love food and all the rituals surrounding it. So because of the lack of understanding about ARFID, people often say dumb stuff. I have also noticed that because of this, it creates a bit of a reverse hyperarousal about food when around other people. I've seen this with my loved one. They are so ready for people to pick on them about what they are eating that the smallest comment can send them spinning. Often I've noticed that people were not trying to be a jerk they just end up in a bit of a minefield due to being unaware of the situation. Outside of family dynamics, it's pretty rare to have someone say \"grow up\" etc. I will say though that most people who say ignorant things or push the issue about someone eating in a way that is unusual to them, often can be redirected pretty easily once you realize that and learn to just be nonchalant about it, own your choices and shut them down. It's not easy but once you master it, it can reduce a ton of anxiety about eating around others.",
          "created_utc": 1723745202.0
        },
        {
          "id": "lia282f",
          "author": "Pothperhaps",
          "body": "Thank you for supporting your person<3 we need more of you in this world",
          "created_utc": 1723746109.0
        }
      ]
    },
    {
      "id": "liabvwn",
      "author": "Fanny_packs",
      "body": "I totally agree and I think that’s BS! Growing up with someone with ARFID I’ve seen what a struggle it’s been for her her whole life. Crying at the dinner table, struggles with school lunch and bullying, difficulties dating, or planning dinners with friends and family. If she could change anything about her life I think it would be   ARFID, and when people don’t treat her, or others with similar issues, with compassion it makes me really angry, and I wish people could find more empathy for something they don’t understand just because they haven’t experienced it.",
      "created_utc": 1723749165.0,
      "score": 3,
      "context": [
        {
          "id": "lia9280",
          "author": "Fanny_packs",
          "body": "I don’t have ARFID, but my sister does. I recognize that it’s real and I huge struggle for her that she wishes she didn’t have to deal with. She is always kind and considerate and doesn’t expect everyone to bend and adapt to her food needs. That being said it is hard sometimes. We just got back from Disney World where I ate a lot of pizza so that we could all eat together. If we wanted to go to a nice restaurant or somewhere that didn’t have something she could eat she would 100% push us to go, but at the end of the day I’d rather spend time and eat together. People can definitely be assholes about “picky eaters” and I’m not discrediting that and it’s not okay, but loving someone with AFRID can be really challenging too. They should still be treated with respect and not belittled for something they can’t control, but I do understand how it could be a deal breaker in romantic relationships. For a lot of people it doesn’t matter, but if it does for some people I think they’re justified in that based on my experiences.",
          "created_utc": 1723748262.0
        },
        {
          "id": "liaafer",
          "author": "Solanumm",
          "body": "Yeah I understand that! I think if food is really important to someone then its understandable that they might not want to date someone who cannot deal with most foods. Its just so often theres such a horrible attitude about it",
          "created_utc": 1723748694.0
        }
      ]
    },
    {
      "id": "lieem6g",
      "author": "giraffemoo",
      "body": "There's SO MANY foods that I'd love to be able to even try, but my arfid makes that very difficult. Steak actually smells really good to me, and barbecue sauce, but I can't stand the texture or taste.\n\nAnd yeah, I also wish they were right, I wish I could just eat whatever I want whenever I want. The act of chewing and swallowing is actually really hard sometimes!",
      "created_utc": 1723813398.0,
      "score": 9,
      "context": [
        {
          "id": "li9x6k7",
          "author": "giraffemoo",
          "body": "I think they think we are faking, like they are sitting there feeling like they wish they could just eat pizza and French fries all the time instead of the varieties of healthy food that most people usually eat. \n\nThat has been said to me, anyway. Someone said \"I wish I had an eating disorder like yours so I could just eat whatever I want all the time\". This was during a time when I had a special meal that was more appealing than what everyone else was eating. \n\nThey just don't understand.",
          "created_utc": 1723744529.0
        },
        {
          "id": "lia88a8",
          "author": "AlucardsAssistant",
          "body": "I find “I wish I had an eating disorder like yours so I could just eat what I want all the time” so ironic because I WISH I could actually eat whatever I want at any given moment instead of having such a restrictive diet.",
          "created_utc": 1723748002.0
        },
        {
          "id": "lie58qy",
          "author": "Bman10119",
          "body": "I know. I so badly wish i could eat thai food because i love spicy but just the idea of all the different things mixed together and touching and the potential of one of the ingredients being one that sets me off is just a nightmare. God i wish i could eat more foods without skyrocketing anxiety",
          "created_utc": 1723809573.0
        }
      ]
    },
    {
      "id": "liem98k",
      "author": "AlienRobotTrex",
      "body": "I’m always amazed how people just casually try new foods, or eat (non-potato) vegetables and actually like them.",
      "created_utc": 1723816167.0,
      "score": 7,
      "context": [
        {
          "id": "li9x6k7",
          "author": "giraffemoo",
          "body": "I think they think we are faking, like they are sitting there feeling like they wish they could just eat pizza and French fries all the time instead of the varieties of healthy food that most people usually eat. \n\nThat has been said to me, anyway. Someone said \"I wish I had an eating disorder like yours so I could just eat whatever I want all the time\". This was during a time when I had a special meal that was more appealing than what everyone else was eating. \n\nThey just don't understand.",
          "created_utc": 1723744529.0
        },
        {
          "id": "lia88a8",
          "author": "AlucardsAssistant",
          "body": "I find “I wish I had an eating disorder like yours so I could just eat what I want all the time” so ironic because I WISH I could actually eat whatever I want at any given moment instead of having such a restrictive diet.",
          "created_utc": 1723748002.0
        },
        {
          "id": "lie58qy",
          "author": "Bman10119",
          "body": "I know. I so badly wish i could eat thai food because i love spicy but just the idea of all the different things mixed together and touching and the potential of one of the ingredients being one that sets me off is just a nightmare. God i wish i could eat more foods without skyrocketing anxiety",
          "created_utc": 1723809573.0
        }
      ]
    },
    {
      "id": "lig2dkx",
      "author": "_EmeraldEye_",
      "body": "Could've wrote this myself! Weird power plays indeed and sadly I still go thru this with people as an adult sometimes, people take not wanting food extremely personally and don't understand that yes I'd rather go hungry than fucking throw up. It's not hard to respect something that has literally nothing to do with you, but folks are unhealed, immature and project like crazy",
      "created_utc": 1723832794.0,
      "score": 6,
      "context": [
        {
          "id": "li9ywu9",
          "author": "bruh_respectfully",
          "body": "In my experience, a lot of people who hate picky eaters have the \"I suffer(ed) so you should too\" mentality. They were forced to eat things they hated as children by their parents for various reasons ranging from ego to poor living conditions and they carried that attitude over into adulthood. A lot of them see your refusal to eat something as entitlement because they couldn't do the same in the past or can't do so presently.\n\nRegardless, judging people for what they eat has always been incomprehensible to me.",
          "created_utc": 1723745069.0
        },
        {
          "id": "lib7i14",
          "author": "_EmeraldEye_",
          "body": "It's so wild cause being forced to eat things didn't make me less picky/sensory sensitive",
          "created_utc": 1723759328.0
        },
        {
          "id": "lidtc3s",
          "author": "bruh_respectfully",
          "body": "Growing up, I heard a lot of \"eat it or go hungry\" and at some point I just decided I'd rather go hungry. I'd just feel sick after eating some things, so it wasn't worth it in my eyes. A lot of parents don't count on their child actually refusing food. My own changed their tune quickly after I started skipping entire meals.\n\nIt's honestly sad how stressful mealtime is for a lot of children. I remember dreading having to eat. It was a time for weird powerplays in my household.",
          "created_utc": 1723803597.0
        }
      ]
    },
    {
      "id": "liizeum",
      "author": "None",
      "body": "Yes. No one speaks about the games and power plays that happen around children with ARFID, such as cooking foods that they hate on purpose just to make a point or taking something that they like and covering it in something that they don’t like, requiring that they eat something that they don’t like every day, etc.",
      "created_utc": 1723874618.0,
      "score": 5,
      "context": [
        {
          "id": "li9ywu9",
          "author": "bruh_respectfully",
          "body": "In my experience, a lot of people who hate picky eaters have the \"I suffer(ed) so you should too\" mentality. They were forced to eat things they hated as children by their parents for various reasons ranging from ego to poor living conditions and they carried that attitude over into adulthood. A lot of them see your refusal to eat something as entitlement because they couldn't do the same in the past or can't do so presently.\n\nRegardless, judging people for what they eat has always been incomprehensible to me.",
          "created_utc": 1723745069.0
        },
        {
          "id": "lib7i14",
          "author": "_EmeraldEye_",
          "body": "It's so wild cause being forced to eat things didn't make me less picky/sensory sensitive",
          "created_utc": 1723759328.0
        },
        {
          "id": "lidtc3s",
          "author": "bruh_respectfully",
          "body": "Growing up, I heard a lot of \"eat it or go hungry\" and at some point I just decided I'd rather go hungry. I'd just feel sick after eating some things, so it wasn't worth it in my eyes. A lot of parents don't count on their child actually refusing food. My own changed their tune quickly after I started skipping entire meals.\n\nIt's honestly sad how stressful mealtime is for a lot of children. I remember dreading having to eat. It was a time for weird powerplays in my household.",
          "created_utc": 1723803597.0
        }
      ]
    },
    {
      "id": "libk3qp",
      "author": "lemurificspeckle",
      "body": "Ahhhhh awesome!!!! I love running into fellow culture nerds in the wild!!! 🥰 Thank you, I’ll check it out!!",
      "created_utc": 1723763762.0,
      "score": 4,
      "context": [
        {
          "id": "lia3v6u",
          "author": "Hot_Razzmatazz316",
          "body": "Hey, sorry people are jerks. Hugs\n\nI think a lot of it is how we're socialized. From a biological viewpoint, we need food to survive. So getting food is a biological imperative and impetus. Anthropologically speaking, food is a resource, and by offering to share a resource with someone else, that person will have less, which will affect their survival. Acceptance of the resource (ie, eating the food) is honoring the sacrifice (both the food itself as well as the time it took to prepare the food and the fact that the person giving you the food now has less for themself.)\n\n All over the world, food is tied to cultural, social, and religious traditions. Some people view not eating certain foods (regardless of the reason) as a rejection of these practices, and thereby the people themselves. This is especially true in countries and cultures where food preparation involves things like hunting harvesting and preparing the basic ingredients for recipes.\n\nIn a lot of developed nations, I think people view so-called \"picky eating\" as a privilege. Having enough to eat has always been a sign of success (both in an anthropological sense and a capitalistic sense), whereas not having enough food to eat has always been an indicator of not having enough money or status (so that people would feel inclined to share their food with you). The prevailing thought in many societies has typically been, if you're hungry enough, you'll eat whatever is available, and you can only turn your nose up at food if you're wealthy enough to afford something else. This kind of thinking looks at eating from a purely biological necessity without any of the psychological or even physiological elements (like allergies) that are associated with food. It's also classist: wealthy people get to choose food, beggars can't be choosers. It could be thought of as ableist, depending on the context: if someone else is preparing the food for you and doing the work, you get no say.\n\nAnd I mean, those are just some of the basic, global ideas about food. That doesn't even take into account people's individual family histories and experiences with eating and meals, which are all highly subjective. If one grew up in a household where the family was food insecure, the parents might not have had a lot of choices about what foods they could afford. Or perhaps someone had parents who were very mindful about wasting food, or it was tied to culture or religion and alternatives weren't an option. \n\nI say all this because in my experience food is such a subjective issue that people really, really take personally. I find it fascinating that even in this day and age when so much of the world is becoming more tolerant and educated, deviation from food normative behavior is still one thing that people have a hard time accepting. And maybe it's because it goes back to it being a biological need, and something that uses up resources, I don't know. It's weird that we'll accept that people from other cultures eat differently, but not people from our own, even if they're friends or family.",
          "created_utc": 1723746626.0
        },
        {
          "id": "liabf8u",
          "author": "lemurificspeckle",
          "body": "I LOVE this!!!!!! So so so interesting!! A couple of times I’ve said to folks that having ARFID makes you so acutely aware of how important food is, not just biologically but socially and culturally. Just like how it’s hard to see exactly what your culture is until you’re outside of it, because being steeped in it all your life you kind of go blind to it! Us ARFIDers aren’t quite cultural natives to food, so we (or at least I) notice just how much of our life revolves around/involves food!! \n\nIf you have any good sources to learn about culinary anthropology I’d love to see em!! Just graduated with my degree in ethnomusicology and psychology so I love all that stuff haha",
          "created_utc": 1723749014.0
        },
        {
          "id": "liaevoq",
          "author": "Hot_Razzmatazz316",
          "body": "Ooh, I like ethnomusicology too! I teach voice and acting, so it all ties together. I also have a background in psychology, funny enough). \n\nThere are so many facets to culinary anthropology that it really depends on what you want to focus on. Broadly this [text book](https://www.cambridge.org/core/books/social-archaeology-of-food/4F91FAA734ED57D07C641B9A25049203) has a good overview, but there are so many books out there that focus on specific cultures, countries, and even foods themselves. I can't think of the name of the author, but I know there's a book out there that discusses like the evolution of bread in society and how it came to be cultivated and integrated into religious ceremonies (I'll have to look for that title, because it was really interesting). \n\nI've also found it interesting to just read old cookbooks, magazines and etiquette guides.",
          "created_utc": 1723750139.0
        }
      ]
    },
    {
      "id": "libod28",
      "author": "kilroy-was-here-2543",
      "body": "Calling food scarcity a problem of capitalism is hilarious when many communist countries had bread lines, with 5.7 to 8.7 million people dying of starvation in the USSR \n\nAtleast capitalism allows for us to find food that we can tolerate",
      "created_utc": 1723765295.0,
      "score": 7,
      "context": [
        {
          "id": "li9sjon",
          "author": "everythingnerdcatboy",
          "body": "People are at this point not just ignorant but intentionally ableist. I think it's the very capitalist idea of \"you should be happy that you have food to eat at all\"",
          "created_utc": 1723743091.0
        },
        {
          "id": "liafqf2",
          "author": "FizzyBunch",
          "body": "How is that capitalistic?",
          "created_utc": 1723750418.0
        },
        {
          "id": "lib768r",
          "author": "puppyhugtime",
          "body": "Because poverty and food scarcity are conditions that exist because of capitalism",
          "created_utc": 1723759217.0
        }
      ]
    },
    {
      "id": "libpeqt",
      "author": "FizzyBunch",
      "body": "Poverty and food scarcity had existed long needle capitalism. It's better now during capitalism than at any point throughout history.",
      "created_utc": 1723765673.0,
      "score": 4,
      "context": [
        {
          "id": "li9sjon",
          "author": "everythingnerdcatboy",
          "body": "People are at this point not just ignorant but intentionally ableist. I think it's the very capitalist idea of \"you should be happy that you have food to eat at all\"",
          "created_utc": 1723743091.0
        },
        {
          "id": "liafqf2",
          "author": "FizzyBunch",
          "body": "How is that capitalistic?",
          "created_utc": 1723750418.0
        },
        {
          "id": "lib768r",
          "author": "puppyhugtime",
          "body": "Because poverty and food scarcity are conditions that exist because of capitalism",
          "created_utc": 1723759217.0
        }
      ]
    },
    {
      "id": "liahlyn",
      "author": "None",
      "body": "Absolutely agree, thank you for your reply.",
      "created_utc": 1723751022.0,
      "score": 2,
      "context": [
        {
          "id": "li9zby3",
          "author": "Wellslapmesilly",
          "body": "I don't have ARFID but I'm close to someone who does. From my observations I would say that most people do not know about or understand the condition so they react badly sometimes. On the other side, I think that folks with ARFID don't fully understand or relate to, the extent that positive emotions are involved with food for those without ARFID, so out the gate, most people are not on common ground. In general, many people love food and all the rituals surrounding it. So because of the lack of understanding about ARFID, people often say dumb stuff. I have also noticed that because of this, it creates a bit of a reverse hyperarousal about food when around other people. I've seen this with my loved one. They are so ready for people to pick on them about what they are eating that the smallest comment can send them spinning. Often I've noticed that people were not trying to be a jerk they just end up in a bit of a minefield due to being unaware of the situation. Outside of family dynamics, it's pretty rare to have someone say \"grow up\" etc. I will say though that most people who say ignorant things or push the issue about someone eating in a way that is unusual to them, often can be redirected pretty easily once you realize that and learn to just be nonchalant about it, own your choices and shut them down. It's not easy but once you master it, it can reduce a ton of anxiety about eating around others.",
          "created_utc": 1723745202.0
        },
        {
          "id": "liacnqn",
          "author": "None",
          "body": "They mean well, I'm sure, but people try to strike up conversations about your eating disorder nonchalantly like it's a hobby of yours and it's gets grating as hell. Then everyone at the table starts sharing their opinions on your diet and your meal like its just so fucking interesting and it's like surely we can think of something else to talk about.",
          "created_utc": 1723749415.0
        },
        {
          "id": "liafn03",
          "author": "Wellslapmesilly",
          "body": "I get it. The issue is that yes, talking about food and eating is indeed unfortunately, a hobby for others and it is considered a\"light\" subject to them even if it is definitely not for you. Truly, just distracting and redirecting people onto another subject with a laugh really does work. I know talking about eating habits is super triggering but it's often not affecting other people at the same level as it is you. So it's actually kind of easy to change the subject and distract f you can muster some lightheartedness doing so, even though I know it does suck, and in a perfect world you wouldn't have to deal with it at all, It is effective. It takes time though and is a learned skill.",
          "created_utc": 1723750386.0
        }
      ]
    },
    {
      "id": "lif0q42",
      "author": "Bman10119",
      "body": "I know! Like hell my grandma buys a new flavor of chips because they say “spicy” on them and i about have a panic attack when she gets me to try them. Despite logically knowing i should like them that idea of trying new and therefore not safe food is terrible and i hate it.",
      "created_utc": 1723820929.0,
      "score": 3,
      "context": [
        {
          "id": "li9x6k7",
          "author": "giraffemoo",
          "body": "I think they think we are faking, like they are sitting there feeling like they wish they could just eat pizza and French fries all the time instead of the varieties of healthy food that most people usually eat. \n\nThat has been said to me, anyway. Someone said \"I wish I had an eating disorder like yours so I could just eat whatever I want all the time\". This was during a time when I had a special meal that was more appealing than what everyone else was eating. \n\nThey just don't understand.",
          "created_utc": 1723744529.0
        },
        {
          "id": "lia88a8",
          "author": "AlucardsAssistant",
          "body": "I find “I wish I had an eating disorder like yours so I could just eat what I want all the time” so ironic because I WISH I could actually eat whatever I want at any given moment instead of having such a restrictive diet.",
          "created_utc": 1723748002.0
        },
        {
          "id": "lie58qy",
          "author": "Bman10119",
          "body": "I know. I so badly wish i could eat thai food because i love spicy but just the idea of all the different things mixed together and touching and the potential of one of the ingredients being one that sets me off is just a nightmare. God i wish i could eat more foods without skyrocketing anxiety",
          "created_utc": 1723809573.0
        },
        {
          "id": "liem98k",
          "author": "AlienRobotTrex",
          "body": "I’m always amazed how people just casually try new foods, or eat (non-potato) vegetables and actually like them.",
          "created_utc": 1723816167.0
        }
      ]
    }
  ]
}