{
  "id": "1etjuzf",
  "subreddit": "ARFID",
  "author": "Ky3031",
  "created_utc": 1723798354.0,
  "title": "Almost failed health class for refusing to do calorie counting",
  "selftext": "I don’t know if anyone else has this experience, but it still frustrates me a lot\n\nBack in high school we had a required health class. I almost failed it because I refused to do this specific assignment. For an entire week they wanted us to write down EVERYTHING we ate and add up the calories and turn it in. \n\nI understand why we were doing the assignment, but there’s so many issues with it. First of all, I know so many people in my high school who had different eating disorders to the point that this is just a terrible idea. \n\nBut for me, I literally could not complete it. I couldn’t get myself to write down a single thing on that page because of the shame I felt for still eating like a child. I knew I was going to to be judged for it since the teacher already went through the entire chipotle menu and looked at all the calories and told us that if we are eating chipotle but got the chips then we’re eating super unhealthy since the chips are the worst thing on the menu. \n\nSomehow managed to pass with a D, but I never turned in that worksheet. ",
  "url": "https://www.reddit.com/r/ARFID/comments/1etjuzf/almost_failed_health_class_for_refusing_to_do/",
  "score": 149,
  "num_comments": 40,
  "comments": [
    {
      "id": "lidzr6v",
      "author": "LeakyFountainPen",
      "body": "Yikes, someone needs to do something about that teacher fr",
      "created_utc": 1723807042.0,
      "score": 93,
      "context": []
    },
    {
      "id": "liebb4m",
      "author": "two-of-me",
      "body": "That’s a really unhealthy assignment. Counting calories should not be taught in school as a healthy practice, because it’s not and everyone has different caloric needs. The most they should be doing is telling kids to eat their fruits and veggies and not drink more soda than water. One thing that I liked (or found educational) was a visual aid that showed how much sugar was in a can of soda, with several tablespoons of sugar inside a ziplock bag. That’s as far as they went though, otherwise they just said “eat healthy, drink water, and exercise” which is a responsible way to go about teaching kids about nutrition. \n\nI’m really sorry you had to go through something so uncomfortable and triggering. That sounds like it would be really hard for any of us in this sub, as well as all the other students struggling with EDs.",
      "created_utc": 1723812113.0,
      "score": 71,
      "context": []
    },
    {
      "id": "lidtm8x",
      "author": "TashaT50",
      "body": "Horrid. I would have failed too.",
      "created_utc": 1723803768.0,
      "score": 21,
      "context": []
    },
    {
      "id": "lieqtw7",
      "author": "eighteencarps",
      "body": "I had to do the same assignment in high school and I just… lied partially. I hated doing it, it was so humiliating.",
      "created_utc": 1723817733.0,
      "score": 23,
      "context": []
    },
    {
      "id": "lifcs4c",
      "author": "MichaelWhackedHisSon",
      "body": "I had to do this too!!! I lied about what I was eating because I was embarrassed that I was basically eating the same things every day & that they weren’t healthy.",
      "created_utc": 1723824733.0,
      "score": 20,
      "context": []
    },
    {
      "id": "lif31qn",
      "author": "sssstatix",
      "body": "I also had to do this assignment. I almost thought it was a joke at first, but it was a genuine assignment he wanted the whole class to do for a whole month. I'm sure if we had a teacher who was actually passionate about teaching instead of a coach who didn't even get up to teach us the lessons, something probably could've been done about it. I remember not actually counting shit and just writing down random meals and googling the average calories. Which seemed to be fine, as the teacher didn't really care how accurate it was, just that it was turned in completed. Doing the assignment wasn't a problem for me, but it did feel very wrong to do and my heart hurt for the students who struggled with it :(",
      "created_utc": 1723821664.0,
      "score": 16,
      "context": []
    },
    {
      "id": "lidpo7y",
      "author": "Commercial-Maybe-711",
      "body": "That sounds horrible",
      "created_utc": 1723801329.0,
      "score": 10,
      "context": []
    },
    {
      "id": "lifdjgs",
      "author": "inappropriatepeaches",
      "body": "i took a bio class in middle school where this was part of the curriculum. i has a great teacher who told us that she refuses to assign this. she thought it was so unhealthy, especially since we were so young. i love her for this, but it’s so gross to me that they would put that in the curriculum of a middle/high school class.",
      "created_utc": 1723824971.0,
      "score": 11,
      "context": []
    },
    {
      "id": "liff26c",
      "author": "itsokghost",
      "body": "I had to do this too. Our version had us write all the exercise we did throughout the week as well. \nI was somehow able to express my issues with the assignment to my mom, who luckily agreed with me and said it was okay to make things up instead of risking a bad grade (my teacher was definitely grading based on how “good” our food or exercise was instead of whether or not we completed the assignment as instructed).\n\nI’m so sorry you had that experience. It’s definitely okay to lie in this situation.",
      "created_utc": 1723825451.0,
      "score": 11,
      "context": []
    },
    {
      "id": "lifmmye",
      "author": "St4r_5lut",
      "body": "If it were me, I would have rallied up everyone with an eating disorder and force a meeting between the principal and that teacher, then give an in depth reason about why this assignment is harmful. That is absolute bullshit, and it literally only encourages eds.",
      "created_utc": 1723827819.0,
      "score": 11,
      "context": []
    },
    {
      "id": "lifgjrk",
      "author": "hauntedspoon525",
      "body": "I had to do something similar in a college health class. thankfully the professor went over how calories don’t really mean much and spent a whole lesson talking about how we shouldn’t be ashamed, he just wants us to understand the nutrition we’re getting. He focused more on the vitamins and minerals, but unfortunately calories still had to be counted.",
      "created_utc": 1723825917.0,
      "score": 7,
      "context": []
    },
    {
      "id": "lig262o",
      "author": "lllley",
      "body": "wow. thats so appalling. im from uk and i never had to do anything like that. its just disgusting that they make you do that. eating disorders can be developed so easily and having the teacher talk like that??? so sorry you had to do that.",
      "created_utc": 1723832729.0,
      "score": 6,
      "context": []
    },
    {
      "id": "ligkykd",
      "author": "Peachntangy",
      "body": "I would have just made up answers and turned it in. It’s a terrible assignment idea, and assuming you’re a teenager, a terrible time for it too.",
      "created_utc": 1723838810.0,
      "score": 6,
      "context": []
    },
    {
      "id": "liffyn2",
      "author": "quetsies",
      "body": "once my gym teacher in elementary or middle school made us track everything we ate for a week. i just took the F. i wish i could’ve told her to her face what a terrible idea her assignment was",
      "created_utc": 1723825733.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lig8cb8",
      "author": "Salt_Worldliness7976",
      "body": "I always hated that assignment as well. I also had a foods class Freshman year where we learned to make food, but another assignment the teacher gave us was to try all the fruits and vegetable samples she had. In front of the whole class. 😭 and she wasn’t going to let anyone not participate. it was like a pop quiz so there wasn’t time to prepare for it or find a way to get out of it. I was fr almost crying and gagging eating tiny slivers of vegetables in front of the whole class",
      "created_utc": 1723834697.0,
      "score": 6,
      "context": []
    },
    {
      "id": "ligpnmd",
      "author": "Forever_Anxious",
      "body": "I am extremely concerned that so many people are saying they have done versions of this assignment. Does anyone know if certain schools still do this? Because if they do, I really think it’s something that needs to be addressed. Like this can literally be extremely shameful for people like us with ARFID and even exacerbate if not initiate any kind of ED.\n\nDoes anyone know if we can do anything about getting this kind of assignment out of schools? This actually worries me a lot.",
      "created_utc": 1723840338.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ligjsxh",
      "author": "thatbtchshay",
      "body": "I get that these assignments can be triggering and asking people to do them is so misguided by the school and potentially harmful but just lie and hand something in. Write some foods down and get a grade. Your teacher isn't watching you to know what you actually eat. \n\nI TA for a bunch of university classes where students are asked to talk about their families and stuff. They always complain that they don't want to share that stuff and i say I get it and if I was the prof I'd change it but for now just lie. Make it up",
      "created_utc": 1723838427.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lihmnpw",
      "author": "The_Meme-Connoisseur",
      "body": "I had to do this in high school too. They even made us sign up for MyFitnessPal despite it being an 18+ app. The teacher told us to lie about our ages. I lied about what I ate.",
      "created_utc": 1723852158.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lihnb0b",
      "author": "Smoothope",
      "body": "disordered eating is so normalized and encouraged that schools can think teaching calorie counting is a good thing to do. 🙃",
      "created_utc": 1723852408.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lihom6h",
      "author": "Benzodiazeparty",
      "body": "because fuck people with eating disorders i guess. that’s horrible i’m so sorry",
      "created_utc": 1723852918.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lif879d",
      "author": "Traumarama79",
      "body": "I would never, ever allow my child to do this assignment. I don't think that children can consent to counting calories and that, unless the child is morbidly obese, there is no good reason to do so. I would not permit my child's instructor to encourage her to begin an eating disorder.",
      "created_utc": 1723823297.0,
      "score": 6,
      "context": []
    },
    {
      "id": "ligctrs",
      "author": "emily_tangerine",
      "body": "I did it. Showing them the results made my prof freak out and actually believe me.",
      "created_utc": 1723836161.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lim0jgf",
      "author": "lureithleon",
      "body": "Filling out my \"How I plan to eat in University\" sheet for my graduation workbook was so awful. I hate lying, but I literally just found someone else's meal plan, copied it, and dissociated hard when we went over it later and they praised me.\n\nI'm pretty sure I said I'd have beans like 3x a week. I'm allergic to beans.",
      "created_utc": 1723924167.0,
      "score": 3,
      "context": []
    },
    {
      "id": "limb9y6",
      "author": "Opposite-Birthday69",
      "body": "This happened in my health class too. A lot girls disappeared over the summer because they were hospitalized with eating disorders because we were basically taught to. He made us share what we ate and how much. I get shaky thinking about the skit he called on me and one of the guys to do, not related to food but it was messed up.",
      "created_utc": 1723927940.0,
      "score": 3,
      "context": []
    },
    {
      "id": "liq87y2",
      "author": "variares96",
      "body": "Ugh I’m sorry, I get it. I dropped one of my college English classes because I was (un)lucky enough to get the semester long topic about food and calories. I decided to save my sanity.",
      "created_utc": 1723994690.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ligyfmv",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1723843209.0,
      "score": 1,
      "context": []
    },
    {
      "id": "liebhw5",
      "author": "two-of-me",
      "body": "I’m hoping this was a while ago and this is no longer part of the curriculum. Hopefully. 🤞",
      "created_utc": 1723812188.0,
      "score": 31,
      "context": [
        {
          "id": "lidzr6v",
          "author": "LeakyFountainPen",
          "body": "Yikes, someone needs to do something about that teacher fr",
          "created_utc": 1723807042.0
        }
      ]
    },
    {
      "id": "lih9kl0",
      "author": "JustSomeGuyDude55",
      "body": "Hard disagree. Understanding how many calories things are is super important to a healthy diet especially in todays world of very calorie dense foods. Doing this is literally just teaching them science and understanding the thermodynamics of the body.\n\nI wish I would have known about counting calories 10 years before I did... also for the record have ARFID. After recording what I was eating for a while allowed me to fit my odd dietary restrictions into a diet that was sustainable for me. (IE finally understanding how many of my calories I was using with sugary foods etc...)\n\nI don't think they should just ignore teaching how the body processes calories just because it will \"trigger\" a few people. OP should have done the assignment and learned something about their diet. Good or bad.",
      "created_utc": 1723847172.0,
      "score": -1,
      "context": [
        {
          "id": "liebb4m",
          "author": "two-of-me",
          "body": "That’s a really unhealthy assignment. Counting calories should not be taught in school as a healthy practice, because it’s not and everyone has different caloric needs. The most they should be doing is telling kids to eat their fruits and veggies and not drink more soda than water. One thing that I liked (or found educational) was a visual aid that showed how much sugar was in a can of soda, with several tablespoons of sugar inside a ziplock bag. That’s as far as they went though, otherwise they just said “eat healthy, drink water, and exercise” which is a responsible way to go about teaching kids about nutrition. \n\nI’m really sorry you had to go through something so uncomfortable and triggering. That sounds like it would be really hard for any of us in this sub, as well as all the other students struggling with EDs.",
          "created_utc": 1723812113.0
        }
      ]
    },
    {
      "id": "ligwkxj",
      "author": "Ky3031",
      "body": "No I totally agree. But it’s done by saying they’re teaching nutrition but it’s very much just shaming and teaching calorie counting. I did this assignment back in 2015 but I bet they still do it.",
      "created_utc": 1723842579.0,
      "score": 4,
      "context": [
        {
          "id": "ligpnmd",
          "author": "Forever_Anxious",
          "body": "I am extremely concerned that so many people are saying they have done versions of this assignment. Does anyone know if certain schools still do this? Because if they do, I really think it’s something that needs to be addressed. Like this can literally be extremely shameful for people like us with ARFID and even exacerbate if not initiate any kind of ED.\n\nDoes anyone know if we can do anything about getting this kind of assignment out of schools? This actually worries me a lot.",
          "created_utc": 1723840338.0
        }
      ]
    },
    {
      "id": "lipr3ow",
      "author": "None",
      "body": "The high school where I teach still does the week-long food journal. She’s about hitting the macros, not specifically calorie counting, but she still food-shames the kids. It’s so bad, not only for kids with ED but also for low income kids. 14-year-olds aren’t exactly “choosing” 58-cent Walmart mac & cheese rather than organic chicken breast.",
      "created_utc": 1723988504.0,
      "score": 2,
      "context": [
        {
          "id": "ligpnmd",
          "author": "Forever_Anxious",
          "body": "I am extremely concerned that so many people are saying they have done versions of this assignment. Does anyone know if certain schools still do this? Because if they do, I really think it’s something that needs to be addressed. Like this can literally be extremely shameful for people like us with ARFID and even exacerbate if not initiate any kind of ED.\n\nDoes anyone know if we can do anything about getting this kind of assignment out of schools? This actually worries me a lot.",
          "created_utc": 1723840338.0
        }
      ]
    },
    {
      "id": "ligxdh6",
      "author": "Ky3031",
      "body": "Unfortunately this was years before I knew what ARFID was and just thought something was wrong with me 🙃",
      "created_utc": 1723842849.0,
      "score": 4,
      "context": [
        {
          "id": "ligctrs",
          "author": "emily_tangerine",
          "body": "I did it. Showing them the results made my prof freak out and actually believe me.",
          "created_utc": 1723836161.0
        }
      ]
    },
    {
      "id": "liha8kc",
      "author": "JustSomeGuyDude55",
      "body": "> i failed health class ages ago in high school and it's had no bearing on my life in any way.\n\nlol did you even read this before you hit send?",
      "created_utc": 1723847421.0,
      "score": 2,
      "context": [
        {
          "id": "ligyfmv",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1723843209.0
        }
      ]
    },
    {
      "id": "ligwtdh",
      "author": "Ky3031",
      "body": "This was in 2015 so I doubt it. They still have the same teachers. This class is required for freshman.",
      "created_utc": 1723842659.0,
      "score": 14,
      "context": [
        {
          "id": "lidzr6v",
          "author": "LeakyFountainPen",
          "body": "Yikes, someone needs to do something about that teacher fr",
          "created_utc": 1723807042.0
        },
        {
          "id": "liebhw5",
          "author": "two-of-me",
          "body": "I’m hoping this was a while ago and this is no longer part of the curriculum. Hopefully. 🤞",
          "created_utc": 1723812188.0
        }
      ]
    },
    {
      "id": "lih1bsx",
      "author": "softlace",
      "body": "i was a freshman in 2020 and also had to do this assignment",
      "created_utc": 1723844208.0,
      "score": 6,
      "context": [
        {
          "id": "lidzr6v",
          "author": "LeakyFountainPen",
          "body": "Yikes, someone needs to do something about that teacher fr",
          "created_utc": 1723807042.0
        },
        {
          "id": "liebhw5",
          "author": "two-of-me",
          "body": "I’m hoping this was a while ago and this is no longer part of the curriculum. Hopefully. 🤞",
          "created_utc": 1723812188.0
        }
      ]
    },
    {
      "id": "lihc06g",
      "author": "two-of-me",
      "body": "Understanding that different foods have a different amount of calories and how our body uses those calories is important. Telling kids that everyone needs the same amount of calories and that there is a right way and a wrong way to be healthy is the wrong way to go about it. \n\nIs it good to tell kids that fruits and vegetables tend to have fewer calories and that things like bread, pasta, and candy have more calories and less nutrition? Yes. Is it healthy for them to focus solely on the number of calories they’re eating as opposed to the overall balance of vitamins and protein they’re getting in their diet? Absolutely not.",
      "created_utc": 1723848094.0,
      "score": 15,
      "context": [
        {
          "id": "liebb4m",
          "author": "two-of-me",
          "body": "That’s a really unhealthy assignment. Counting calories should not be taught in school as a healthy practice, because it’s not and everyone has different caloric needs. The most they should be doing is telling kids to eat their fruits and veggies and not drink more soda than water. One thing that I liked (or found educational) was a visual aid that showed how much sugar was in a can of soda, with several tablespoons of sugar inside a ziplock bag. That’s as far as they went though, otherwise they just said “eat healthy, drink water, and exercise” which is a responsible way to go about teaching kids about nutrition. \n\nI’m really sorry you had to go through something so uncomfortable and triggering. That sounds like it would be really hard for any of us in this sub, as well as all the other students struggling with EDs.",
          "created_utc": 1723812113.0
        },
        {
          "id": "lih9kl0",
          "author": "JustSomeGuyDude55",
          "body": "Hard disagree. Understanding how many calories things are is super important to a healthy diet especially in todays world of very calorie dense foods. Doing this is literally just teaching them science and understanding the thermodynamics of the body.\n\nI wish I would have known about counting calories 10 years before I did... also for the record have ARFID. After recording what I was eating for a while allowed me to fit my odd dietary restrictions into a diet that was sustainable for me. (IE finally understanding how many of my calories I was using with sugary foods etc...)\n\nI don't think they should just ignore teaching how the body processes calories just because it will \"trigger\" a few people. OP should have done the assignment and learned something about their diet. Good or bad.",
          "created_utc": 1723847172.0
        }
      ]
    },
    {
      "id": "ligz8pq",
      "author": "Forever_Anxious",
      "body": "That’s ridiculous. I bet they still do too. If we’re talking health and nutrition, they should know they can teach about calories without making kids count their own calories because it can be shameful and trigger unhealthy perceptions about foods. Not that they shouldn’t teach about calorie counts, but they should also note heavily that calorie counting can cause or exasperate EDs and should focus on other ways of interpreting nutrition as well. If we want to teach about health, we also need to teach that obsession with health is not healthy, shaming people is not the way to teach them how to eat more balanced, and that mental health is just as important as physical health and sometimes they overlap.\n\nIt’s not bad to look at calories if you don’t have/aren’t prone to EDs, but they should be emphasizing that calories aren’t the only important thing, that not everyone needs the same amount of calories, that counting calories only goes so far, and that calorie counting is linked to EDs and should be avoided if someone has or thinks it may initiate an ED. Plus, there’s no true way to know 100% exactly how many calories are in something anyways (it’s only an estimate), and they should know and be teaching that too.",
      "created_utc": 1723843487.0,
      "score": 3,
      "context": [
        {
          "id": "ligpnmd",
          "author": "Forever_Anxious",
          "body": "I am extremely concerned that so many people are saying they have done versions of this assignment. Does anyone know if certain schools still do this? Because if they do, I really think it’s something that needs to be addressed. Like this can literally be extremely shameful for people like us with ARFID and even exacerbate if not initiate any kind of ED.\n\nDoes anyone know if we can do anything about getting this kind of assignment out of schools? This actually worries me a lot.",
          "created_utc": 1723840338.0
        },
        {
          "id": "ligwkxj",
          "author": "Ky3031",
          "body": "No I totally agree. But it’s done by saying they’re teaching nutrition but it’s very much just shaming and teaching calorie counting. I did this assignment back in 2015 but I bet they still do it.",
          "created_utc": 1723842579.0
        }
      ]
    },
    {
      "id": "litjsxo",
      "author": "Forever_Anxious",
      "body": "That’s such a good point! Income affects so many aspects in life including access to food. It all just feels so shame-based rather than educational.\n\nYou can literally teach the same without attaching specific foods to the calories. Just teach the average amount of calories each sex should have each day (noting that the number is just an average and that how many calories a person needs is a very individualized thing/should be viewed on a case-by-case basis) and the calories-in and calories-out thing. If you want to show a depiction, make up some calorie numbers to show the subtraction, but don’t talk about how many calories are in specific foods and absolutely don’t encourage calorie counting by having kids count their own calories and make them feel shame for the way they eat due to any reason, especially related to EDs and low-income/food insecurity.",
      "created_utc": 1724037941.0,
      "score": 1,
      "context": [
        {
          "id": "ligpnmd",
          "author": "Forever_Anxious",
          "body": "I am extremely concerned that so many people are saying they have done versions of this assignment. Does anyone know if certain schools still do this? Because if they do, I really think it’s something that needs to be addressed. Like this can literally be extremely shameful for people like us with ARFID and even exacerbate if not initiate any kind of ED.\n\nDoes anyone know if we can do anything about getting this kind of assignment out of schools? This actually worries me a lot.",
          "created_utc": 1723840338.0
        },
        {
          "id": "lipr3ow",
          "author": "None",
          "body": "The high school where I teach still does the week-long food journal. She’s about hitting the macros, not specifically calorie counting, but she still food-shames the kids. It’s so bad, not only for kids with ED but also for low income kids. 14-year-olds aren’t exactly “choosing” 58-cent Walmart mac & cheese rather than organic chicken breast.",
          "created_utc": 1723988504.0
        }
      ]
    },
    {
      "id": "ll7xkt4",
      "author": "emily_tangerine",
      "body": "I saw so many doctors and therapists before we figured it out.",
      "created_utc": 1725317728.0,
      "score": 1,
      "context": [
        {
          "id": "ligctrs",
          "author": "emily_tangerine",
          "body": "I did it. Showing them the results made my prof freak out and actually believe me.",
          "created_utc": 1723836161.0
        },
        {
          "id": "ligxdh6",
          "author": "Ky3031",
          "body": "Unfortunately this was years before I knew what ARFID was and just thought something was wrong with me 🙃",
          "created_utc": 1723842849.0
        }
      ]
    },
    {
      "id": "lih0mae",
      "author": "two-of-me",
      "body": "Ugh I am so sorry. The 2000 calorie a day thing is so not for most people. Personally I’m 4’11” and when I was in inpatient for “anorexia” (ARFID but this was 2007 and ARFID wasn’t a thing people knew about yet) they had us on strict calorie diets and the dietitian actually told me that she had never seen someone maintain their weight at such a low calorie count. I have a very slow metabolism so I gain weight really quickly (although with ARFID it’s not easy) and she actually had to restructure my entire scheduled meal plan to accommodate my slow metabolism.",
      "created_utc": 1723843964.0,
      "score": 14,
      "context": [
        {
          "id": "lidzr6v",
          "author": "LeakyFountainPen",
          "body": "Yikes, someone needs to do something about that teacher fr",
          "created_utc": 1723807042.0
        },
        {
          "id": "liebhw5",
          "author": "two-of-me",
          "body": "I’m hoping this was a while ago and this is no longer part of the curriculum. Hopefully. 🤞",
          "created_utc": 1723812188.0
        },
        {
          "id": "ligwtdh",
          "author": "Ky3031",
          "body": "This was in 2015 so I doubt it. They still have the same teachers. This class is required for freshman.",
          "created_utc": 1723842659.0
        }
      ]
    },
    {
      "id": "lih2own",
      "author": "two-of-me",
      "body": "Terrible. I’m so sorry. I would have made everything up just so I didn’t have to embarrass myself and be shamed by my teachers.",
      "created_utc": 1723844685.0,
      "score": 7,
      "context": [
        {
          "id": "lidzr6v",
          "author": "LeakyFountainPen",
          "body": "Yikes, someone needs to do something about that teacher fr",
          "created_utc": 1723807042.0
        },
        {
          "id": "liebhw5",
          "author": "two-of-me",
          "body": "I’m hoping this was a while ago and this is no longer part of the curriculum. Hopefully. 🤞",
          "created_utc": 1723812188.0
        },
        {
          "id": "lih1bsx",
          "author": "softlace",
          "body": "i was a freshman in 2020 and also had to do this assignment",
          "created_utc": 1723844208.0
        }
      ]
    },
    {
      "id": "likh10l",
      "author": "DenseAstronomer3631",
      "body": "I gain weight with less calories than it takes my husband to lose weight, so I feel you 😭😠 I'm 5'7, and he's 6'1 but in general I'm very against calorie counting and try to avoid it so I don't fall into super unhealthy patterns 😬",
      "created_utc": 1723904701.0,
      "score": 2,
      "context": [
        {
          "id": "lidzr6v",
          "author": "LeakyFountainPen",
          "body": "Yikes, someone needs to do something about that teacher fr",
          "created_utc": 1723807042.0
        },
        {
          "id": "liebhw5",
          "author": "two-of-me",
          "body": "I’m hoping this was a while ago and this is no longer part of the curriculum. Hopefully. 🤞",
          "created_utc": 1723812188.0
        },
        {
          "id": "ligwtdh",
          "author": "Ky3031",
          "body": "This was in 2015 so I doubt it. They still have the same teachers. This class is required for freshman.",
          "created_utc": 1723842659.0
        },
        {
          "id": "lih0mae",
          "author": "two-of-me",
          "body": "Ugh I am so sorry. The 2000 calorie a day thing is so not for most people. Personally I’m 4’11” and when I was in inpatient for “anorexia” (ARFID but this was 2007 and ARFID wasn’t a thing people knew about yet) they had us on strict calorie diets and the dietitian actually told me that she had never seen someone maintain their weight at such a low calorie count. I have a very slow metabolism so I gain weight really quickly (although with ARFID it’s not easy) and she actually had to restructure my entire scheduled meal plan to accommodate my slow metabolism.",
          "created_utc": 1723843964.0
        }
      ]
    }
  ]
}