{
  "id": "1f13t27",
  "subreddit": "ARFID",
  "author": "ibelieveinaliens111",
  "created_utc": 1724611984.0,
  "title": "Annie’s changed their recipe.",
  "selftext": "I FUCKING HATE WHEN FUCKING COMPANIES CHANFE THEIR RECIPES WHEN THEYRE LITERALLY FINE THERES NOTHJGN WRONG WITH THEM EVER AND THEY JUST DECIDE NOOOOOO THIS RECIPE THATS BEEN AROUND SINCE FOREVER WND IS CLEARLY SATISFYING PEOPLE JUST HAS TO CHANGE\n\nIVE EATEN ANNIES MAC N CHEESE SINCE FUCKING FIRST GRADE BECAUSE KRAFT CHANGED THEIR RECIPE AND ITS BEEN THE ONLY FOOD I COULD RELY ON TO NOT EVER CHANGE WND NOW I HAVE NOTHING I HAVE FUCKING JOTHING IM NEVER GOING TO EVER FIND SOMETHING THAT CAN JUST STAY THE SAME THERES NO POINT IN EVEN STICKING AROUND IF IM JUST NEVER GOING TO BE HAPPY",
  "url": "https://www.reddit.com/r/ARFID/comments/1f13t27/annies_changed_their_recipe/",
  "score": 349,
  "num_comments": 117,
  "comments": [
    {
      "id": "ljwud1n",
      "author": "shytrait",
      "body": "i feel like no one here is acknowledging how awful this must be for you! i hate when a recipe changes and it’s understandable to “make change a catastrophe” because it is for you. especially if this was your main safe food. i hope you’re able to find a replacement or learn to like the new recipe, but in sorry its different.",
      "created_utc": 1724618153.0,
      "score": 117,
      "context": []
    },
    {
      "id": "ljx0734",
      "author": "knopflerpettydylan",
      "body": "For fucking real though I saw the words \"now cheesier\" on a banner on a box and about fucking lost it in the store man",
      "created_utc": 1724620134.0,
      "score": 112,
      "context": []
    },
    {
      "id": "ljwv1l1",
      "author": "trollcole",
      "body": "My heart is hurting for you.  (No sarcasm.)",
      "created_utc": 1724618383.0,
      "score": 48,
      "context": []
    },
    {
      "id": "ljwe5d9",
      "author": "CouchGoblin269",
      "body": " Corporations are always going to change recipes to save money even if it is selling well as is. \n\nMaybe try to learn to make a homemade version of mac and cheese that you like that way it’s always consistent",
      "created_utc": 1724612661.0,
      "score": 112,
      "context": []
    },
    {
      "id": "ljwszhm",
      "author": "RamblingRose63",
      "body": "Have you tried simple truth yet? Also Panera Mac they have I. Stores if you can handle it. Please know that you're going to be ok that you can be happy eventually with time and planning you can get better. Don't give up keep your head high and know you're worth trying different things to make new safe food available to you",
      "created_utc": 1724617688.0,
      "score": 25,
      "context": []
    },
    {
      "id": "ljx65ak",
      "author": "UnderwaterParadise",
      "body": "Bruhhhhh when Annie’s white cheddar bunnies changed like a decade ago I was so mad. Had to give up Annie’s awhile back due to price. I’m mad on your behalf ughhh\n\nGoodles and “signature select” (Safeway’s store brand if safeway is local to you) spiral shape are great in my opinion if you’re looking to shop around for a new option. Goodles is kind of a thick texture though and on the expensive side, not for everyone. I can’t do Kraft either except the spirals.\n\nI’m sorry Annie’s changed on you, that sucks major bunny butts.",
      "created_utc": 1724622251.0,
      "score": 19,
      "context": []
    },
    {
      "id": "ljwursr",
      "author": "wrathfulradish",
      "body": "I haven't been able to eat mac and cheese since they stopped selling the whole wheat white cheddar and shells :(",
      "created_utc": 1724618291.0,
      "score": 11,
      "context": []
    },
    {
      "id": "ljwhl8f",
      "author": "angelneliel",
      "body": "Nooooooooooo not Annie's!!! Seriously? Ugh, guess I won't be eating mac n cheese ever again 😓",
      "created_utc": 1724613838.0,
      "score": 27,
      "context": []
    },
    {
      "id": "ljx48gh",
      "author": "jeannesloaf",
      "body": "This was my reaction when Jack n the Box changed their chicken strips. 😡",
      "created_utc": 1724621567.0,
      "score": 9,
      "context": []
    },
    {
      "id": "ljx94r5",
      "author": "-Ran",
      "body": "Try adding more butter into the mix. This will cut the extra cheese and make it taste smoother and creamier. You could also add whole milk if you normally use something like 2%.",
      "created_utc": 1724623346.0,
      "score": 11,
      "context": []
    },
    {
      "id": "ljxdzhx",
      "author": "None",
      "body": "yoke impossible act live noxious caption gold shocking oatmeal jellyfish\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
      "created_utc": 1724625184.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ljx00im",
      "author": "LustUnlust",
      "body": "That was me with the frozen stouffers Mac and cheese this past year or so",
      "created_utc": 1724620070.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ljxd54v",
      "author": "sillydogcircus",
      "body": "My safe snack changed to “sunflower and/or canola oil” from sunflower oil and I cried for days. I feel you.",
      "created_utc": 1724624859.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ljyh77y",
      "author": "None",
      "body": "Just outta dumb curiosity, does anybody else have trouble when brands change their scent? Or is this my Autism? I get this post. But recently Dawn changed their original scent and I'm offended for lack of better terms.",
      "created_utc": 1724641003.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ljz4kyj",
      "author": "KingMcB",
      "body": "This may sound crazy but as a mom, I’ve seen the power of social media… a post in my area went viral. This happened to a family with a son who could only eat X bars. The formula changed and son lost his shit. Mom called the company to no avail and ultimately posted on FB for everyone to check their pantries for the OG formulary X bars. All her friends shared it on their FB pages, and the mom crowds came together. Moms around the country stormed their local grocers and bought everything this poor kid could possibly eat.\n\n\nIf you don’t have a FB account, make one. Find your local “buy Nothing” site as well as look for an active “pay it forward” or “people helping people” group. Post exactly what you are looking for. I think you’ll be pleasantly surprised by what strangers will help you accomplish. 🤍",
      "created_utc": 1724653532.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m3385li",
      "author": "Snakewithwings",
      "body": "im so sorry. I am going through the same thing rn and genuinely so devastated. I have been eating this Mac and cheese literally my entire life and I still eat it all the time and I ran out of my stockpile yesterday and had the new one for the first time today without realizing they changed it until I took a bite and knew it was wrong. and then I looked at the box and saw it was different and my heart genuinely sank. I hate that they changed it when it was so good. it just sucks so much and when its one of the main foods you eat its even worse. another of my favorite foods got discontinued a month ago and it really just brings you down. good luck and im sorry you're going through this too.",
      "created_utc": 1734754252.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ljwe038",
      "author": "Nearby-Ad5666",
      "body": "It's usually cost cutting bot to punish you or improve the product",
      "created_utc": 1724612612.0,
      "score": 9,
      "context": []
    },
    {
      "id": "ljylg9g",
      "author": "Ok-Committee-5867",
      "body": "I feel this post so hard. \nIdk whyyyyyyyy companies change things that are fine. I even get upset when they change the packaging, even if the food stays the same. \n\nI’m sorry 😣",
      "created_utc": 1724642879.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ljz81hq",
      "author": "None",
      "body": "Real omfg",
      "created_utc": 1724655845.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lk14j4w",
      "author": "static-prince",
      "body": "Subway changed the recipe for their veggie patties years ago and I have never gotten over it.",
      "created_utc": 1724688131.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lk1t10h",
      "author": "IndividualBonus1442",
      "body": "I couldn’t be more disappointed this was such a safe food",
      "created_utc": 1724695903.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lk2172p",
      "author": "anditwaslove",
      "body": "We will always need to be able to accept change. That will never not be an issue. So the only real solution here is getting the help to learn to tolerate those changes. Also, learning to make homemade versions - then you can make it the exact same every time.",
      "created_utc": 1724698563.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lk2bs0d",
      "author": "womangenius",
      "body": "I feel this rage so well, I’m so sorry",
      "created_utc": 1724701986.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lk516wt",
      "author": "Jazzlike_Elderberry9",
      "body": "ts always pisses me off",
      "created_utc": 1724742712.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lr69vo8",
      "author": "unsure721",
      "body": "ITS SO BAD NOW! I thought something was off the last few months and everyone has been gaslighting me. Idk how people can’t taste it, it’s so different and much worse",
      "created_utc": 1728517635.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lrqmfi4",
      "author": "SlimiSlime",
      "body": "Seriously. What were they thinking? It tastes terrible now!",
      "created_utc": 1728836590.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lrysk9o",
      "author": "Icy_Letter_1427",
      "body": "i feel this so hard it’s my number one safe food 😭😭 RIP",
      "created_utc": 1728952920.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lslf0il",
      "author": "softaspects",
      "body": "Thank you for the insane validation your post gave me, hopefully they change it back if we’re pains in their asses about it!!",
      "created_utc": 1729288073.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lvfl8q0",
      "author": "Strict_Mood_3959",
      "body": "this omg!! literally cried when i saw “now cheesier” on the orange chedder shells 😭",
      "created_utc": 1730762465.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lvfwxsn",
      "author": "ZombiePewp",
      "body": "I found this thread because I just treated myself to a box of Annie's (was my favorite) but it tastes like vomit ☹️",
      "created_utc": 1730766414.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lyrcej2",
      "author": "5tarKld",
      "body": "Cabot mac and cheese has been me replacement! I can find it in Walmart most of the time. It’s very good!",
      "created_utc": 1732465485.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m1fc6gh",
      "author": "skipug",
      "body": "Ughhhh. I have had to stop eating this (also one of like 3 safe foods) and then ordered a bulk order from Amazon of what appeared to be the old version. Just got here and it’s the terrible new one.",
      "created_utc": 1733866967.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m1monsa",
      "author": "medicalmystery19",
      "body": "YES I just made it and literally took two bites and was like “this is gross.” Now I can’t eat Mac and cheese anymore!!!! 😃😃😃",
      "created_utc": 1733969818.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m5pqaeg",
      "author": "beverleyjade",
      "body": "If you guys are in the USA the trader joes white Mac and cheese tastes IDENTICAL to the original Annie’s box!!!",
      "created_utc": 1736179837.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m6547vm",
      "author": "medicalmystery19",
      "body": "I was also soooo upset when Annie’s changed their shells and cheddar recipe and wasn’t able to eat it anymore. I know everyone with ARFID has different tastebuds but I just tried the goodles shella good and thought it tastes good/pretty similar to the original Annie’s white cheddar pasta. Just wanted to throw that out there in case it helps anyone looking for a new safe mac and cheese!",
      "created_utc": 1736381398.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m84vsar",
      "author": "Feni007",
      "body": "Always :( and it sucks sooooo much!! I used to love Spartan macaroni and cheese more than anything(their other products were amazing too), and it was barely $1, but then spartan merged with some other corporation and everything was swapped to 'Our Family'. \n\nEverything 'Our Family' is absolutely horrible. The macaroni and cheese went from a 10 to a 0. Literally a 0. It somehow tastes worse than Valu Time AND they increased the costs lmao. People around here keep buying em though... I really really REALLY don't get it.",
      "created_utc": 1737364598.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m9jew7h",
      "author": "mathematics-gal",
      "body": "I found an older box in my cupboard tonight (does not say “now cheesier!” and it tasted like good old times. 😭\n\nif it ain’t broke, don’t fix it!\n\nI am sorry for you, truly.",
      "created_utc": 1738018742.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ma8ch18",
      "author": "andretheseal47",
      "body": "The new Annie’s recipe blowssss. I’m so sad about it.",
      "created_utc": 1738345817.0,
      "score": 2,
      "context": []
    },
    {
      "id": "maheyg1",
      "author": "Ruby22day",
      "body": "It just tastes like salt now. That's it.",
      "created_utc": 1738462401.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mceyko9",
      "author": "virgomermaidbabe",
      "body": "I just found this out as well 🥺🫠😭 I have two boxes in my pantry left and now I gotta figure out how to make them taste better 🥺 so sad \nMaybe Amazon sells it still in stockpile?",
      "created_utc": 1739387467.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mcez9nc",
      "author": "virgomermaidbabe",
      "body": "I just found this out as well 🥺🫠😭 I have two boxes in my pantry left and now I gotta figure out how to make them taste better 🥺 so sad",
      "created_utc": 1739387659.0,
      "score": 2,
      "context": []
    },
    {
      "id": "me3nncz",
      "author": "Consistent-Set9130",
      "body": "Eating a box now and literally had to google because wth. How is it labeled “now cheesier” and tastes less cheesy 😭",
      "created_utc": 1740193361.0,
      "score": 2,
      "context": []
    },
    {
      "id": "me5v6v4",
      "author": "PsychoticCatnip",
      "body": "I HOPE OP SEES THIS.\nThey have not changed the recipe for their character boxes, like the Spiderman and Mickey Mouse boxes. Just compared an old box of annies to them and they have the same ingredients! I really hope they don't change those though..",
      "created_utc": 1740231895.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mh9nzhb",
      "author": "MusicInTheAir55",
      "body": "Can confirm that the recipe has changed as of February 2025 and regrettably the change is for the worse. I will be returning what I did buy and not buying any more. Really angry that this once tasty product is now just more chemical garbage with the likes of KD.",
      "created_utc": 1741725475.0,
      "score": 2,
      "context": []
    },
    {
      "id": "miqrlz0",
      "author": "bigjuocyfart",
      "body": "the new formula only just caught up with me now despite me eating annies at least once a week and the first time i had it it was so nasty and pasty and wayyy less flavourful :( and i ate it the first time last wednesday bc i wanted to be happy so i was gonna eat my safe food and since last wednesday i have had absolutley zero appetite and have felt so nauseaus and have been (tmi) having the most record breaking poops of my life to the point i have to call off plans if i need to go poop bc i know im gonna need to take a shower afterwards like genuinley what the hell were they thinking changing the formula to be this nasty :( it especially hurts bc im autistic and depressed and already struggle with eating and annies mac n cheese was my favorite food and whenever i ate it i would genuinley feel like all my problems dissapeared and i felt genuinley happy while i ate it and now i have no food to turn to im so sick of relying on things and them changing it makes me wanna die bc i dont see the point if everything i love just keeps getting taken away from me :( but i guess ill have to try the trader joes white cheddar mac n cheese and hope its the same :(",
      "created_utc": 1742443596.0,
      "score": 2,
      "context": []
    },
    {
      "id": "miqrnk5",
      "author": "bigjuocyfart",
      "body": "the new formula only just caught up with me now despite me eating annies at least once a week and the first time i had it it was so nasty and pasty and wayyy less flavourful :( and i ate it the first time last wednesday bc i wanted to be happy so i was gonna eat my safe food and since last wednesday i have had absolutley zero appetite and have felt so nauseaus and have been (tmi) having the most record breaking poops of my life to the point i have to call off plans if i need to go poop bc i know im gonna need to take a shower afterwards like genuinley what the hell were they thinking changing the formula to be this nasty :( it especially hurts bc im autistic and depressed and already struggle with eating and annies mac n cheese was my favorite food and whenever i ate it i would genuinley feel like all my problems dissapeared and i felt genuinley happy while i ate it and now i have no food to turn to im so sick of relying on things and them changing",
      "created_utc": 1742443612.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ml3nllu",
      "author": "ParkAveFandango",
      "body": "I think this change just hit the stores where I live now, I thought the pasta was maybe spoiled somehow because it tasted so wheaty.\n\nI even changed the pans I were using but realized it was the cheese powder after smelling it, I HATE wheat bread and its gross I have to taste it in this now.\n\nMaybe there is another fast alternative like this I can eat for dinner that is somewhat healthy.",
      "created_utc": 1743631777.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ljwfgg2",
      "author": "RunaroundX",
      "body": "You just have to slowly learn to accept small changes like that and not make change a catastrophe. I notice now than I'm 30, I care a little less than I used to. Some of its practice and some of it is just aging. You'll get there <3",
      "created_utc": 1724613106.0,
      "score": 10,
      "context": []
    },
    {
      "id": "lk0shy2",
      "author": "shitz_brickz",
      "body": "I know Krafts changed their ingredients, but they also changed their suggested preparation instructions to suggest 1/3 the butter they normally had on the label. Give Kraft a try with 3 tablespoons of butter see if it helps at all?",
      "created_utc": 1724684237.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lk14b1j",
      "author": "GravityDefining",
      "body": "I went back to this restaurant after years of not being near enough to justify going and I found that they decided to put onion in the meat of their burgers. IN THE MEAT. Who does that??? I can never go back.",
      "created_utc": 1724688057.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lk2a165",
      "author": "melmosaurusrex",
      "body": "I used to live on Annie's Deluxe Mac and Cheese. At some point, they somehow changed how they made the shells, and they became inedible to me. Always too mushy. It feels so wasteful to admit, but for years, I've been making using the cheese packet on different noodles and tossing theirs. I'm sorry to hear they've switched up the cheese formula, that's truly so discouraging.",
      "created_utc": 1724701448.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lk5mgzz",
      "author": "BoubyWinky",
      "body": "I feel you so much !!!\nI'm sorry...\n\nWhen I was a kid I used to LOVE a very specific exotic fruit juice... The day they changed to recipe...\nIt broke my heart! I cried ...",
      "created_utc": 1724756275.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lk793pl",
      "author": "lustylovebird",
      "body": "Gods above thats maddening. Sort of related, happened with my fave hairspray and I had to throw it away. WHY DO THEY DO THIS????",
      "created_utc": 1724777706.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lkdj29y",
      "author": "No-Satisfaction-5207",
      "body": "This is how i felt when i discovered the cheddar chipotle flavor of knorr sidekicks changed from shells to spirals.\n\nMy day is ruined and my disappointment is immeasurable.",
      "created_utc": 1724867064.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lp8ckmv",
      "author": "kittylover3210",
      "body": "their instagram comments are getting blown up right now, hopefully it leads them to change the recipe back! just tried the new recipe last night and was honestly horrified",
      "created_utc": 1727464944.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lq247cl",
      "author": "budbrowni3",
      "body": "LITERALLY. I thought I was crazy, made another box and just KNEW it tasted different. I already had a feeling they changed the recipe when I saw the box change that says “Now Cheesier!” WHYY",
      "created_utc": 1727912703.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lq4xjfv",
      "author": "goldenoi",
      "body": "Recently the Annie’s Mac and cheese has been giving me the most insane explosive diarrhea , like, insane …",
      "created_utc": 1727963539.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lqjrals",
      "author": "_flammenwerfer_",
      "body": "I fucking HATE the new recipe and I am devastated as well",
      "created_utc": 1728176794.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lqulboa",
      "author": "lucianat0r",
      "body": "I will be going on a mac and cheese hunt to see if there is a box of mac that is similar to old annies.\n\nmac is a main food that I eat and I absolutely hate the now cheesier mac. lmk if anyone else finds a good mac and cheese replacement.",
      "created_utc": 1728339630.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lsxmhjo",
      "author": "Angry-Moth-Noises",
      "body": "I feel this. It doesn't taste the same and it taste worst now and I hate it. It taste like shit",
      "created_utc": 1729471733.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lt2yje7",
      "author": "FluffyPumpernickel",
      "body": "I think I am a little confused here.  General Mills bought Annie's years ago and quickly ran their products into the ground.  Not all recipes were changed at once, but as soon as they got the General Mills cost-cutting quality-cutting workover, they were terrible.  I've not had Annie's under the new corporate overlords for years now, but I imagine by now all the flavors and products are garbage.",
      "created_utc": 1729549888.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lt4ui2t",
      "author": "ProfessionalHeron573",
      "body": "Annies please bring back the single serve packets . The cups are gross ",
      "created_utc": 1729578453.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ltrq54x",
      "author": "ikeefner",
      "body": "I honestly think they just put less noodles in there, but there’s still the same amount of cheese. Hence, cheesier.",
      "created_utc": 1729900491.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ly195wl",
      "author": "Aggressive-Mood7814",
      "body": "sorry im late but i felt the need to jump in bc I SOECIFICALLY ORDERED THE REGULAR ONE ONLINE BC IT SHOWED THE REGULAR BOXES IN THE FUCKING PICTURES AND ITS THE NOW CHEESIER ONES AND IM AB TO FUCKING RAGEEEEEE",
      "created_utc": 1732068966.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lyzg7v4",
      "author": "i_monch_on_children",
      "body": "I'm not even joking, I was on call with my dietitian for over our allotted time ranting about how the new White Cheddar Shells recipe tastes like cardboard. I can't even eat it now and it used to be in my top 10 comfort foods that are warm (I have a different list for cold). And now she (my dietitian) wants me to try a new brand, so I spent another hour trying to find one (if anyone has any suggestions PLEASE I'm DESPERATE).",
      "created_utc": 1732575433.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5xancy",
      "author": "Tricky-Lecture-5348",
      "body": "They were bought out by General Mills. Annie’s is no longer independent. Go figure.",
      "created_utc": 1736279142.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ma8ccaw",
      "author": "andretheseal47",
      "body": "Pro tip: I’ve switched to Trader Joe’s version of Annie’s white cheddar and thank god it’s the same exact thing as the old beloved Annie’s recipe",
      "created_utc": 1738345781.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mrbtu91",
      "author": "Proud_Cause7536",
      "body": "When Herseys chocolate dip was discontinued… There goes my miracle topping. 🥺",
      "created_utc": 1746744807.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mzwhdrg",
      "author": "Prize-Ad-5872",
      "body": "I thought I was crazy it's been tasting different for months to the point where it almost makes me feel sick it just isn't the same and I thought it was just me I didn't know there was a recipe change 🙃🥲💔",
      "created_utc": 1750953004.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n234rmr",
      "author": "Indosaurus1",
      "body": "Ive lost one of my biggest comfort foods and no idea how to replace it in canada. Its so frustrating and when I tried to complain they didnt listen and asked which box like no its the fucking recipe. Its not cheesier its disgusting. And i dont want homemwde when i struggle toneat and it eas easier to make 😪",
      "created_utc": 1752020398.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mt46wdf",
      "author": "sickkid29",
      "body": "Dude it's just Mac and cheese. Calm the f down ",
      "created_utc": 1747660202.0,
      "score": 0,
      "context": []
    },
    {
      "id": "mabj75y",
      "author": "Initial_Wait5759",
      "body": "As soon as I saw \"now cheesier\" advertised on the box I shutdown in the middle of the store. I just tried it and literally could not stop the oncoming meltdown, I feel so ridiculous crying over something that feels so trivial to others. And now I'm overwhelmed and hungry and have no other safe foods available at the moment. It's exhausting having a brain like this, thank you for your understanding as a lot of people think that we're just trying to be quirky and special. Sorry for the rambling and bad grammar ",
      "created_utc": 1738381422.0,
      "score": 3,
      "context": [
        {
          "id": "ljwud1n",
          "author": "shytrait",
          "body": "i feel like no one here is acknowledging how awful this must be for you! i hate when a recipe changes and it’s understandable to “make change a catastrophe” because it is for you. especially if this was your main safe food. i hope you’re able to find a replacement or learn to like the new recipe, but in sorry its different.",
          "created_utc": 1724618153.0
        }
      ]
    },
    {
      "id": "ma8buso",
      "author": "andretheseal47",
      "body": "It’s so much LESS cheesy now!! It sucks",
      "created_utc": 1738345646.0,
      "score": 2,
      "context": [
        {
          "id": "ljx0734",
          "author": "knopflerpettydylan",
          "body": "For fucking real though I saw the words \"now cheesier\" on a banner on a box and about fucking lost it in the store man",
          "created_utc": 1724620134.0
        }
      ]
    },
    {
      "id": "mt46tn1",
      "author": "sickkid29",
      "body": "Why?",
      "created_utc": 1747660174.0,
      "score": 1,
      "context": [
        {
          "id": "ljx0734",
          "author": "knopflerpettydylan",
          "body": "For fucking real though I saw the words \"now cheesier\" on a banner on a box and about fucking lost it in the store man",
          "created_utc": 1724620134.0
        }
      ]
    },
    {
      "id": "lk1aqxa",
      "author": "sexmountain",
      "body": "Right? This is so real",
      "created_utc": 1724690135.0,
      "score": 10,
      "context": [
        {
          "id": "ljwv1l1",
          "author": "trollcole",
          "body": "My heart is hurting for you.  (No sarcasm.)",
          "created_utc": 1724618383.0
        }
      ]
    },
    {
      "id": "ljwmshk",
      "author": "Present-Milk-7936",
      "body": "Consultant writes “profit = revenue - cost” on the whiteboard and the boardroom erupts in applause. He demands a list of all the company’s costs. A big stack of papers are brought to the table and he wants all hands looking for cheaper options for every single line item. \n\nCalls are made and it turns out that LogistackSolutions LLC in Long Beach, CA can import cheese powder for $0.03 cheaper per ton than Roberts Feed and Dairy in Fairbury, IL was supplying it. Roberts had been supplying the company since 1923 when Old Man Roberts himself gave that little girl Annie her first dehydrated cheese puck at the county fair. \n\nThe contract with Roberts F&D is torn up, eliminating 600 jobs in a neglected rural community. The consulting firm is paid $35 million for increasing profitability by 0.025% this quarter. Investors cash out. Your mac and cheese now has the consistency of liquified cardboard. Sales drop 15% next quarter, but don’t worry, the next consultant will identify that the company could be more efficient if it didn’t have those pesky benefits for its employees.",
      "created_utc": 1724615609.0,
      "score": 63,
      "context": [
        {
          "id": "ljwe5d9",
          "author": "CouchGoblin269",
          "body": " Corporations are always going to change recipes to save money even if it is selling well as is. \n\nMaybe try to learn to make a homemade version of mac and cheese that you like that way it’s always consistent",
          "created_utc": 1724612661.0
        }
      ]
    },
    {
      "id": "ljymdx7",
      "author": "Desert_Fairy",
      "body": "It isn’t just cost cutting (that is absolutely a driving factor). But also supply chain failures.  Sometimes, ingredients just become too hard to source and there are zero alternatives. \n\nI’m an engineer in manufacturing and I can promise you that parts and components of our designs go obsolete on a daily basis. And finding replacements that need no redesign (drop in replacements) is harder the older the design is. \n\nThe truth is that the recipe probably changes every two to three years but the alternative components were a good enough match that the flavor and texture had no notable variation. \n\nThis time, it was likely that something just couldn’t be sourced and they were faced with redesign the recipe, or shut down the product.",
      "created_utc": 1724643317.0,
      "score": 22,
      "context": [
        {
          "id": "ljwe5d9",
          "author": "CouchGoblin269",
          "body": " Corporations are always going to change recipes to save money even if it is selling well as is. \n\nMaybe try to learn to make a homemade version of mac and cheese that you like that way it’s always consistent",
          "created_utc": 1724612661.0
        }
      ]
    },
    {
      "id": "lk1ap8j",
      "author": "sexmountain",
      "body": "This is hilarious bc my recipes are all overly specific so that they are always the same lol",
      "created_utc": 1724690120.0,
      "score": 2,
      "context": [
        {
          "id": "ljwe5d9",
          "author": "CouchGoblin269",
          "body": " Corporations are always going to change recipes to save money even if it is selling well as is. \n\nMaybe try to learn to make a homemade version of mac and cheese that you like that way it’s always consistent",
          "created_utc": 1724612661.0
        }
      ]
    },
    {
      "id": "ljxs87n",
      "author": "CouchGoblin269",
      "body": "was probably right when General Mills bought them",
      "created_utc": 1724630835.0,
      "score": 5,
      "context": [
        {
          "id": "ljx65ak",
          "author": "UnderwaterParadise",
          "body": "Bruhhhhh when Annie’s white cheddar bunnies changed like a decade ago I was so mad. Had to give up Annie’s awhile back due to price. I’m mad on your behalf ughhh\n\nGoodles and “signature select” (Safeway’s store brand if safeway is local to you) spiral shape are great in my opinion if you’re looking to shop around for a new option. Goodles is kind of a thick texture though and on the expensive side, not for everyone. I can’t do Kraft either except the spirals.\n\nI’m sorry Annie’s changed on you, that sucks major bunny butts.",
          "created_utc": 1724622251.0
        }
      ]
    },
    {
      "id": "ljyaysc",
      "author": "RamblingRose63",
      "body": "There is a whole wheat one in the frozen aisle I think maybe birdseye I see and a veggie one that's bussin",
      "created_utc": 1724638466.0,
      "score": 5,
      "context": [
        {
          "id": "ljwursr",
          "author": "wrathfulradish",
          "body": "I haven't been able to eat mac and cheese since they stopped selling the whole wheat white cheddar and shells :(",
          "created_utc": 1724618291.0
        }
      ]
    },
    {
      "id": "lk1awlb",
      "author": "sexmountain",
      "body": "OMG yes that’s the kind I used to get!!!! Totally forgot",
      "created_utc": 1724690185.0,
      "score": 2,
      "context": [
        {
          "id": "ljwursr",
          "author": "wrathfulradish",
          "body": "I haven't been able to eat mac and cheese since they stopped selling the whole wheat white cheddar and shells :(",
          "created_utc": 1724618291.0
        }
      ]
    },
    {
      "id": "m2monl7",
      "author": "x1049",
      "body": "Would you try whole wheat shells and white cheddar powder? You might be able to replicate it",
      "created_utc": 1734509511.0,
      "score": 1,
      "context": [
        {
          "id": "ljwursr",
          "author": "wrathfulradish",
          "body": "I haven't been able to eat mac and cheese since they stopped selling the whole wheat white cheddar and shells :(",
          "created_utc": 1724618291.0
        }
      ]
    },
    {
      "id": "ljxdcj2",
      "author": "sillydogcircus",
      "body": "I have a homemade recipe if you’d like it",
      "created_utc": 1724624939.0,
      "score": 14,
      "context": [
        {
          "id": "ljwhl8f",
          "author": "angelneliel",
          "body": "Nooooooooooo not Annie's!!! Seriously? Ugh, guess I won't be eating mac n cheese ever again 😓",
          "created_utc": 1724613838.0
        }
      ]
    },
    {
      "id": "ljyb0td",
      "author": "RamblingRose63",
      "body": "Broooooo this was a slap in the face who the hell do they think they are",
      "created_utc": 1724638489.0,
      "score": 5,
      "context": [
        {
          "id": "ljx48gh",
          "author": "jeannesloaf",
          "body": "This was my reaction when Jack n the Box changed their chicken strips. 😡",
          "created_utc": 1724621567.0
        }
      ]
    },
    {
      "id": "ljyb3kz",
      "author": "RamblingRose63",
      "body": "Have you tried raos sauce we are obsessed",
      "created_utc": 1724638519.0,
      "score": 5,
      "context": [
        {
          "id": "ljxdzhx",
          "author": "None",
          "body": "yoke impossible act live noxious caption gold shocking oatmeal jellyfish\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
          "created_utc": 1724625184.0
        }
      ]
    },
    {
      "id": "ljyto3w",
      "author": "creambunny",
      "body": "The new dawn scent is god awful (also noticed swifters wet mops have a stronger scent too? I wanna die if those are used in the house). I’ve heard the large commercial bottles still have the old dawn smell",
      "created_utc": 1724646985.0,
      "score": 1,
      "context": [
        {
          "id": "ljyh77y",
          "author": "None",
          "body": "Just outta dumb curiosity, does anybody else have trouble when brands change their scent? Or is this my Autism? I get this post. But recently Dawn changed their original scent and I'm offended for lack of better terms.",
          "created_utc": 1724641003.0
        }
      ]
    },
    {
      "id": "lkmk8ge",
      "author": "gutterghost",
      "body": "I have used Dawn my entire life and a month ago I couldn't figure out what in our kitchen was irritating my face holes. My partner usually washes the dishes so it took me a while to figure out it was the dish soap, and I was baffled. Dawn? The original scent Dawn that my parents and I have safely used for all 36 years of my existence? That Dawn? Is irritating me now and I can't use it? Dawn I never thought you'd abandon me like this\n\n\nLike my partner was like \"Maybe it's the dish soap?\" And I said \"It CAN'T be the dish soap. We use DAWN.\"",
      "created_utc": 1724994627.0,
      "score": 1,
      "context": [
        {
          "id": "ljyh77y",
          "author": "None",
          "body": "Just outta dumb curiosity, does anybody else have trouble when brands change their scent? Or is this my Autism? I get this post. But recently Dawn changed their original scent and I'm offended for lack of better terms.",
          "created_utc": 1724641003.0
        }
      ]
    },
    {
      "id": "m338a7t",
      "author": "Snakewithwings",
      "body": "also - I hope you feel better now than when you made this post. if you've found any alternatives or have gotten used to the new one and you see this please let me know I am desperate",
      "created_utc": 1734754311.0,
      "score": 3,
      "context": [
        {
          "id": "m3385li",
          "author": "Snakewithwings",
          "body": "im so sorry. I am going through the same thing rn and genuinely so devastated. I have been eating this Mac and cheese literally my entire life and I still eat it all the time and I ran out of my stockpile yesterday and had the new one for the first time today without realizing they changed it until I took a bite and knew it was wrong. and then I looked at the box and saw it was different and my heart genuinely sank. I hate that they changed it when it was so good. it just sucks so much and when its one of the main foods you eat its even worse. another of my favorite foods got discontinued a month ago and it really just brings you down. good luck and im sorry you're going through this too.",
          "created_utc": 1734754252.0
        }
      ]
    },
    {
      "id": "m1fcdpk",
      "author": "ibelieveinaliens111",
      "body": "I had the exact same issue! It looked like the old packaging but it was the new one! It’s so frustrating!",
      "created_utc": 1733867029.0,
      "score": 2,
      "context": [
        {
          "id": "m1fc6gh",
          "author": "skipug",
          "body": "Ughhhh. I have had to stop eating this (also one of like 3 safe foods) and then ordered a bulk order from Amazon of what appeared to be the old version. Just got here and it’s the terrible new one.",
          "created_utc": 1733866967.0
        }
      ]
    },
    {
      "id": "mrmlstu",
      "author": "ibelieveinaliens111",
      "body": "Thank you I HAVE SEEN THAT!!!",
      "created_utc": 1746901780.0,
      "score": 1,
      "context": [
        {
          "id": "me5v6v4",
          "author": "PsychoticCatnip",
          "body": "I HOPE OP SEES THIS.\nThey have not changed the recipe for their character boxes, like the Spiderman and Mickey Mouse boxes. Just compared an old box of annies to them and they have the same ingredients! I really hope they don't change those though..",
          "created_utc": 1740231895.0
        }
      ]
    },
    {
      "id": "mxx84q1",
      "author": "MusicInTheAir55",
      "body": "See this thread [https://www.reddit.com/r/macandcheese/comments/1jbks15/annies\\_white\\_cheddar\\_changed\\_recipe/](https://www.reddit.com/r/macandcheese/comments/1jbks15/annies_white_cheddar_changed_recipe/)",
      "created_utc": 1750001425.0,
      "score": 1,
      "context": [
        {
          "id": "mh9nzhb",
          "author": "MusicInTheAir55",
          "body": "Can confirm that the recipe has changed as of February 2025 and regrettably the change is for the worse. I will be returning what I did buy and not buying any more. Really angry that this once tasty product is now just more chemical garbage with the likes of KD.",
          "created_utc": 1741725475.0
        }
      ]
    },
    {
      "id": "lk2xm9q",
      "author": "ibelieveinaliens111",
      "body": "i can’t accept the fact that everything i love has to change eventually nothing will ever taste good again and i’ll starve and that’s it",
      "created_utc": 1724709239.0,
      "score": 1,
      "context": [
        {
          "id": "ljwfgg2",
          "author": "RunaroundX",
          "body": "You just have to slowly learn to accept small changes like that and not make change a catastrophe. I notice now than I'm 30, I care a little less than I used to. Some of its practice and some of it is just aging. You'll get there <3",
          "created_utc": 1724613106.0
        }
      ]
    },
    {
      "id": "miqquzv",
      "author": "bigjuocyfart",
      "body": "omg this explains so much mac n cheese was my safe food for when i didnt wanna eat and ive had the new stuff twice in the past week despite it being vile because i thought i maybe just got a fluke box but i have been having the worst appetite and feeling so nauseaus and having absolute life changing poops and i bet its because of their new formula",
      "created_utc": 1742443253.0,
      "score": 1,
      "context": [
        {
          "id": "lq4xjfv",
          "author": "goldenoi",
          "body": "Recently the Annie’s Mac and cheese has been giving me the most insane explosive diarrhea , like, insane …",
          "created_utc": 1727963539.0
        }
      ]
    },
    {
      "id": "mdol1sh",
      "author": "BowlHappy3294",
      "body": "I posted a comment, but try Goodies Mac and Cheese! It has filled my Mac and Cheese loving void! They have some different flavors such as Smoky Dokey, Truffle and “Cheesy Mac” I’m eating it now! It’s so delicious!",
      "created_utc": 1739998225.0,
      "score": 1,
      "context": [
        {
          "id": "lqulboa",
          "author": "lucianat0r",
          "body": "I will be going on a mac and cheese hunt to see if there is a box of mac that is similar to old annies.\n\nmac is a main food that I eat and I absolutely hate the now cheesier mac. lmk if anyone else finds a good mac and cheese replacement.",
          "created_utc": 1728339630.0
        }
      ]
    },
    {
      "id": "ltmecj4",
      "author": "Leather-Inflation-77",
      "body": "Good to know. I'll never buy it again. Especially since the price kept going up and the quality down.",
      "created_utc": 1729823778.0,
      "score": 1,
      "context": [
        {
          "id": "lt2yje7",
          "author": "FluffyPumpernickel",
          "body": "I think I am a little confused here.  General Mills bought Annie's years ago and quickly ran their products into the ground.  Not all recipes were changed at once, but as soon as they got the General Mills cost-cutting quality-cutting workover, they were terrible.  I've not had Annie's under the new corporate overlords for years now, but I imagine by now all the flavors and products are garbage.",
          "created_utc": 1729549888.0
        }
      ]
    },
    {
      "id": "ly76do6",
      "author": "ibelieveinaliens111",
      "body": "THE EXACT SAME THING HAPPENED TO ME!!! WHAT THE FUCK!!!!",
      "created_utc": 1732161299.0,
      "score": 1,
      "context": [
        {
          "id": "ly195wl",
          "author": "Aggressive-Mood7814",
          "body": "sorry im late but i felt the need to jump in bc I SOECIFICALLY ORDERED THE REGULAR ONE ONLINE BC IT SHOWED THE REGULAR BOXES IN THE FUCKING PICTURES AND ITS THE NOW CHEESIER ONES AND IM AB TO FUCKING RAGEEEEEE",
          "created_utc": 1732068966.0
        }
      ]
    },
    {
      "id": "mcmlhuf",
      "author": "Both_Perspective1616",
      "body": "This the realest shit I heard all day",
      "created_utc": 1739484153.0,
      "score": 1,
      "context": [
        {
          "id": "ljwud1n",
          "author": "shytrait",
          "body": "i feel like no one here is acknowledging how awful this must be for you! i hate when a recipe changes and it’s understandable to “make change a catastrophe” because it is for you. especially if this was your main safe food. i hope you’re able to find a replacement or learn to like the new recipe, but in sorry its different.",
          "created_utc": 1724618153.0
        },
        {
          "id": "mabj75y",
          "author": "Initial_Wait5759",
          "body": "As soon as I saw \"now cheesier\" advertised on the box I shutdown in the middle of the store. I just tried it and literally could not stop the oncoming meltdown, I feel so ridiculous crying over something that feels so trivial to others. And now I'm overwhelmed and hungry and have no other safe foods available at the moment. It's exhausting having a brain like this, thank you for your understanding as a lot of people think that we're just trying to be quirky and special. Sorry for the rambling and bad grammar ",
          "created_utc": 1738381422.0
        }
      ]
    },
    {
      "id": "mdoj84j",
      "author": "BowlHappy3294",
      "body": "Omg! I suddenly went, “uh oh…” when I saw NOW CHEESER on the box. Remember when it had this thick consistency that always tasted so delicious? Welp, that’s gone! It tastes weird, you know? It has this texture in the cheese that’s really runny and almost made me not want to eat it😂\nYet, if you guys feel sad over the Anne’s, there’s a brand called Goggles that’s SO GOOD! Healther (as it can get) too! Color, texture, it’s really really good!",
      "created_utc": 1739997742.0,
      "score": 1,
      "context": [
        {
          "id": "ljwud1n",
          "author": "shytrait",
          "body": "i feel like no one here is acknowledging how awful this must be for you! i hate when a recipe changes and it’s understandable to “make change a catastrophe” because it is for you. especially if this was your main safe food. i hope you’re able to find a replacement or learn to like the new recipe, but in sorry its different.",
          "created_utc": 1724618153.0
        },
        {
          "id": "mabj75y",
          "author": "Initial_Wait5759",
          "body": "As soon as I saw \"now cheesier\" advertised on the box I shutdown in the middle of the store. I just tried it and literally could not stop the oncoming meltdown, I feel so ridiculous crying over something that feels so trivial to others. And now I'm overwhelmed and hungry and have no other safe foods available at the moment. It's exhausting having a brain like this, thank you for your understanding as a lot of people think that we're just trying to be quirky and special. Sorry for the rambling and bad grammar ",
          "created_utc": 1738381422.0
        }
      ]
    },
    {
      "id": "mgh39dj",
      "author": "LadySunami",
      "body": "No kidding. \nI unfortunately bought a pack of 12 not knowing they changed the recipe. Bleh. ",
      "created_utc": 1741331880.0,
      "score": 1,
      "context": [
        {
          "id": "ljx0734",
          "author": "knopflerpettydylan",
          "body": "For fucking real though I saw the words \"now cheesier\" on a banner on a box and about fucking lost it in the store man",
          "created_utc": 1724620134.0
        },
        {
          "id": "ma8buso",
          "author": "andretheseal47",
          "body": "It’s so much LESS cheesy now!! It sucks",
          "created_utc": 1738345646.0
        }
      ]
    },
    {
      "id": "ll2dn1x",
      "author": "renodear",
      "body": "The new box no longer lists butter. Willing to bet that’s very sourceable. \nBox seemed to have less macaroni, also. Just poured out an old one and a new one into the same pot at the same time and it felt like the new box had barely 2/3s the amount of noodles by comparison. Fewer calories/serving, as well, but same weight. \nWilling to bet they cut the butter, removed a portion of the pasta, and added additional powdered mix to both cover the lost weight from the pasta & to provide the “cheesier” claim.",
      "created_utc": 1725233031.0,
      "score": 2,
      "context": [
        {
          "id": "ljwe5d9",
          "author": "CouchGoblin269",
          "body": " Corporations are always going to change recipes to save money even if it is selling well as is. \n\nMaybe try to learn to make a homemade version of mac and cheese that you like that way it’s always consistent",
          "created_utc": 1724612661.0
        },
        {
          "id": "ljymdx7",
          "author": "Desert_Fairy",
          "body": "It isn’t just cost cutting (that is absolutely a driving factor). But also supply chain failures.  Sometimes, ingredients just become too hard to source and there are zero alternatives. \n\nI’m an engineer in manufacturing and I can promise you that parts and components of our designs go obsolete on a daily basis. And finding replacements that need no redesign (drop in replacements) is harder the older the design is. \n\nThe truth is that the recipe probably changes every two to three years but the alternative components were a good enough match that the flavor and texture had no notable variation. \n\nThis time, it was likely that something just couldn’t be sourced and they were faced with redesign the recipe, or shut down the product.",
          "created_utc": 1724643317.0
        }
      ]
    },
    {
      "id": "ljylwul",
      "author": "sillydogcircus",
      "body": "- 2 C pasta\n- 2.5 C whole milk (yes, whole, that’s important)\n- 2 C shredded cheddar cheese (it melts easier if you shave it off a block versus bagged)\n- 1Tbs butter\n- 1/4 tsp mustard powder\n- 1/4 tsp nutmeg\n- 1/2 tsp pepper\n- 1 bag goldfish crackers (you’ll measure these with your heart)\n- Old Bay if you want it to taste like mine\n\n01. Preheat oven to 350°\n\n02. Combine pinch of salt, milk, mustard powder, pepper, nutmeg, butter in saucepan and bring to boil. \n\n03. Add pasta, reduce heat to low\n\n04. Continue to simmer and stir frequently until pasta is cooked. If liquid runs low, add in more milk 1/4 C at a time.\n\n05. Add 1.5 C shredded cheese and stir until melted. Cover 3 mins. \n\n06. Pour into greased baking dish. \n\n07. Add extra shredded cheese to top evenly. Crumble and add goldfish crackers to top evenly. I always add a little Old Bay at this point. \n\n08. Bake at 350° for 30 mins or until top looks golden and baked. \n\n09. Let rest for 5 minutes and serve. \n\nIf you want it extra creamy, add some heavy cream (base) or cream cheese (stirred in with shredded cheese) to the sauce. This isn’t a healthy food. Don’t try to make it healthy. It’s good for the soul. \n\nWhen reheating, add 1/4 C milk to pasta. It’ll keep it from drying out.",
      "created_utc": 1724643093.0,
      "score": 12,
      "context": [
        {
          "id": "ljwhl8f",
          "author": "angelneliel",
          "body": "Nooooooooooo not Annie's!!! Seriously? Ugh, guess I won't be eating mac n cheese ever again 😓",
          "created_utc": 1724613838.0
        },
        {
          "id": "ljxdcj2",
          "author": "sillydogcircus",
          "body": "I have a homemade recipe if you’d like it",
          "created_utc": 1724624939.0
        }
      ]
    },
    {
      "id": "ljxib06",
      "author": "angelneliel",
      "body": "Yes please",
      "created_utc": 1724626837.0,
      "score": 8,
      "context": [
        {
          "id": "ljwhl8f",
          "author": "angelneliel",
          "body": "Nooooooooooo not Annie's!!! Seriously? Ugh, guess I won't be eating mac n cheese ever again 😓",
          "created_utc": 1724613838.0
        },
        {
          "id": "ljxdcj2",
          "author": "sillydogcircus",
          "body": "I have a homemade recipe if you’d like it",
          "created_utc": 1724624939.0
        }
      ]
    },
    {
      "id": "ljy7tk0",
      "author": "katiecat369",
      "body": "I’d love that recipe!!",
      "created_utc": 1724637232.0,
      "score": 6,
      "context": [
        {
          "id": "ljwhl8f",
          "author": "angelneliel",
          "body": "Nooooooooooo not Annie's!!! Seriously? Ugh, guess I won't be eating mac n cheese ever again 😓",
          "created_utc": 1724613838.0
        },
        {
          "id": "ljxdcj2",
          "author": "sillydogcircus",
          "body": "I have a homemade recipe if you’d like it",
          "created_utc": 1724624939.0
        }
      ]
    },
    {
      "id": "ljzh0mj",
      "author": "None",
      "body": "caption live dinner seemly badge whistle license gold tart racial\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
      "created_utc": 1724662074.0,
      "score": 2,
      "context": [
        {
          "id": "ljxdzhx",
          "author": "None",
          "body": "yoke impossible act live noxious caption gold shocking oatmeal jellyfish\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
          "created_utc": 1724625184.0
        },
        {
          "id": "ljyb3kz",
          "author": "RamblingRose63",
          "body": "Have you tried raos sauce we are obsessed",
          "created_utc": 1724638519.0
        }
      ]
    },
    {
      "id": "m0g93tg",
      "author": "plazacat",
      "body": "Call and complain! my friend did and she received a coupon from them lol",
      "created_utc": 1733354107.0,
      "score": 2,
      "context": [
        {
          "id": "ljyh77y",
          "author": "None",
          "body": "Just outta dumb curiosity, does anybody else have trouble when brands change their scent? Or is this my Autism? I get this post. But recently Dawn changed their original scent and I'm offended for lack of better terms.",
          "created_utc": 1724641003.0
        },
        {
          "id": "lkmk8ge",
          "author": "gutterghost",
          "body": "I have used Dawn my entire life and a month ago I couldn't figure out what in our kitchen was irritating my face holes. My partner usually washes the dishes so it took me a while to figure out it was the dish soap, and I was baffled. Dawn? The original scent Dawn that my parents and I have safely used for all 36 years of my existence? That Dawn? Is irritating me now and I can't use it? Dawn I never thought you'd abandon me like this\n\n\nLike my partner was like \"Maybe it's the dish soap?\" And I said \"It CAN'T be the dish soap. We use DAWN.\"",
          "created_utc": 1724994627.0
        }
      ]
    },
    {
      "id": "m350inu",
      "author": "ibelieveinaliens111",
      "body": "Hi! Thank you so much for your sympathy. I made this a while ago and have found some substitutes. The shaped noodles that annie’s make are a pretty good substitute, though they have slightly less of a taste. I’ve only tried the cheddar ones, and not white cheddar, so I can’t speak for those sadly.",
      "created_utc": 1734791013.0,
      "score": 1,
      "context": [
        {
          "id": "m3385li",
          "author": "Snakewithwings",
          "body": "im so sorry. I am going through the same thing rn and genuinely so devastated. I have been eating this Mac and cheese literally my entire life and I still eat it all the time and I ran out of my stockpile yesterday and had the new one for the first time today without realizing they changed it until I took a bite and knew it was wrong. and then I looked at the box and saw it was different and my heart genuinely sank. I hate that they changed it when it was so good. it just sucks so much and when its one of the main foods you eat its even worse. another of my favorite foods got discontinued a month ago and it really just brings you down. good luck and im sorry you're going through this too.",
          "created_utc": 1734754252.0
        },
        {
          "id": "m338a7t",
          "author": "Snakewithwings",
          "body": "also - I hope you feel better now than when you made this post. if you've found any alternatives or have gotten used to the new one and you see this please let me know I am desperate",
          "created_utc": 1734754311.0
        }
      ]
    },
    {
      "id": "lk32nnu",
      "author": "RunaroundX",
      "body": "Stuff will still taste good even if it's different. That's just your anxiety talking and making everything into a catastrophe. You are capable of adjusting to change. You just need to do it a lot slower than most people do. That's okay too. Just take your time and use your words to trick your mind into being open to small change, mind over matter style.",
      "created_utc": 1724711108.0,
      "score": 3,
      "context": [
        {
          "id": "ljwfgg2",
          "author": "RunaroundX",
          "body": "You just have to slowly learn to accept small changes like that and not make change a catastrophe. I notice now than I'm 30, I care a little less than I used to. Some of its practice and some of it is just aging. You'll get there <3",
          "created_utc": 1724613106.0
        },
        {
          "id": "lk2xm9q",
          "author": "ibelieveinaliens111",
          "body": "i can’t accept the fact that everything i love has to change eventually nothing will ever taste good again and i’ll starve and that’s it",
          "created_utc": 1724709239.0
        }
      ]
    },
    {
      "id": "ljyukem",
      "author": "katiecat369",
      "body": "Love this thank you!",
      "created_utc": 1724647475.0,
      "score": 3,
      "context": [
        {
          "id": "ljwhl8f",
          "author": "angelneliel",
          "body": "Nooooooooooo not Annie's!!! Seriously? Ugh, guess I won't be eating mac n cheese ever again 😓",
          "created_utc": 1724613838.0
        },
        {
          "id": "ljxdcj2",
          "author": "sillydogcircus",
          "body": "I have a homemade recipe if you’d like it",
          "created_utc": 1724624939.0
        },
        {
          "id": "ljylwul",
          "author": "sillydogcircus",
          "body": "- 2 C pasta\n- 2.5 C whole milk (yes, whole, that’s important)\n- 2 C shredded cheddar cheese (it melts easier if you shave it off a block versus bagged)\n- 1Tbs butter\n- 1/4 tsp mustard powder\n- 1/4 tsp nutmeg\n- 1/2 tsp pepper\n- 1 bag goldfish crackers (you’ll measure these with your heart)\n- Old Bay if you want it to taste like mine\n\n01. Preheat oven to 350°\n\n02. Combine pinch of salt, milk, mustard powder, pepper, nutmeg, butter in saucepan and bring to boil. \n\n03. Add pasta, reduce heat to low\n\n04. Continue to simmer and stir frequently until pasta is cooked. If liquid runs low, add in more milk 1/4 C at a time.\n\n05. Add 1.5 C shredded cheese and stir until melted. Cover 3 mins. \n\n06. Pour into greased baking dish. \n\n07. Add extra shredded cheese to top evenly. Crumble and add goldfish crackers to top evenly. I always add a little Old Bay at this point. \n\n08. Bake at 350° for 30 mins or until top looks golden and baked. \n\n09. Let rest for 5 minutes and serve. \n\nIf you want it extra creamy, add some heavy cream (base) or cream cheese (stirred in with shredded cheese) to the sauce. This isn’t a healthy food. Don’t try to make it healthy. It’s good for the soul. \n\nWhen reheating, add 1/4 C milk to pasta. It’ll keep it from drying out.",
          "created_utc": 1724643093.0
        }
      ]
    },
    {
      "id": "los8jxp",
      "author": "No-Language-4676",
      "body": "Thank you, you’re awesome!",
      "created_utc": 1727225867.0,
      "score": 2,
      "context": [
        {
          "id": "ljwhl8f",
          "author": "angelneliel",
          "body": "Nooooooooooo not Annie's!!! Seriously? Ugh, guess I won't be eating mac n cheese ever again 😓",
          "created_utc": 1724613838.0
        },
        {
          "id": "ljxdcj2",
          "author": "sillydogcircus",
          "body": "I have a homemade recipe if you’d like it",
          "created_utc": 1724624939.0
        },
        {
          "id": "ljylwul",
          "author": "sillydogcircus",
          "body": "- 2 C pasta\n- 2.5 C whole milk (yes, whole, that’s important)\n- 2 C shredded cheddar cheese (it melts easier if you shave it off a block versus bagged)\n- 1Tbs butter\n- 1/4 tsp mustard powder\n- 1/4 tsp nutmeg\n- 1/2 tsp pepper\n- 1 bag goldfish crackers (you’ll measure these with your heart)\n- Old Bay if you want it to taste like mine\n\n01. Preheat oven to 350°\n\n02. Combine pinch of salt, milk, mustard powder, pepper, nutmeg, butter in saucepan and bring to boil. \n\n03. Add pasta, reduce heat to low\n\n04. Continue to simmer and stir frequently until pasta is cooked. If liquid runs low, add in more milk 1/4 C at a time.\n\n05. Add 1.5 C shredded cheese and stir until melted. Cover 3 mins. \n\n06. Pour into greased baking dish. \n\n07. Add extra shredded cheese to top evenly. Crumble and add goldfish crackers to top evenly. I always add a little Old Bay at this point. \n\n08. Bake at 350° for 30 mins or until top looks golden and baked. \n\n09. Let rest for 5 minutes and serve. \n\nIf you want it extra creamy, add some heavy cream (base) or cream cheese (stirred in with shredded cheese) to the sauce. This isn’t a healthy food. Don’t try to make it healthy. It’s good for the soul. \n\nWhen reheating, add 1/4 C milk to pasta. It’ll keep it from drying out.",
          "created_utc": 1724643093.0
        }
      ]
    },
    {
      "id": "ljym2eo",
      "author": "sillydogcircus",
      "body": "Replied to my own comment! Can’t have it anymore myself but it makes me happy to share",
      "created_utc": 1724643166.0,
      "score": 3,
      "context": [
        {
          "id": "ljwhl8f",
          "author": "angelneliel",
          "body": "Nooooooooooo not Annie's!!! Seriously? Ugh, guess I won't be eating mac n cheese ever again 😓",
          "created_utc": 1724613838.0
        },
        {
          "id": "ljxdcj2",
          "author": "sillydogcircus",
          "body": "I have a homemade recipe if you’d like it",
          "created_utc": 1724624939.0
        },
        {
          "id": "ljxib06",
          "author": "angelneliel",
          "body": "Yes please",
          "created_utc": 1724626837.0
        }
      ]
    },
    {
      "id": "lk1swiy",
      "author": "Big-Formal408",
      "body": "I have a REALLY simple one that’s pretty much foolproof that I’ve used since I was a kid. I have it memorized but I’ll DM you the recipe! It’s from the Strawberry Shortcake cookbook from 2004 so it’s very basic and easy to make since the cookbook is literally for children lol",
      "created_utc": 1724695863.0,
      "score": 2,
      "context": [
        {
          "id": "ljwhl8f",
          "author": "angelneliel",
          "body": "Nooooooooooo not Annie's!!! Seriously? Ugh, guess I won't be eating mac n cheese ever again 😓",
          "created_utc": 1724613838.0
        },
        {
          "id": "ljxdcj2",
          "author": "sillydogcircus",
          "body": "I have a homemade recipe if you’d like it",
          "created_utc": 1724624939.0
        },
        {
          "id": "ljxib06",
          "author": "angelneliel",
          "body": "Yes please",
          "created_utc": 1724626837.0
        }
      ]
    },
    {
      "id": "ljylyvp",
      "author": "sillydogcircus",
      "body": "Responded to my own comment :) I can’t eat it anymore bc allergies so I’m happy to share",
      "created_utc": 1724643119.0,
      "score": 3,
      "context": [
        {
          "id": "ljwhl8f",
          "author": "angelneliel",
          "body": "Nooooooooooo not Annie's!!! Seriously? Ugh, guess I won't be eating mac n cheese ever again 😓",
          "created_utc": 1724613838.0
        },
        {
          "id": "ljxdcj2",
          "author": "sillydogcircus",
          "body": "I have a homemade recipe if you’d like it",
          "created_utc": 1724624939.0
        },
        {
          "id": "ljy7tk0",
          "author": "katiecat369",
          "body": "I’d love that recipe!!",
          "created_utc": 1724637232.0
        }
      ]
    },
    {
      "id": "lk1t2qy",
      "author": "Big-Formal408",
      "body": "I’ll send you my recipe as well! This is what I copy and pasted to the comment above yours: “I have a REALLY simple one that’s pretty much foolproof that I’ve used since I was a kid. I have it memorized but I’ll DM you the recipe! It’s from the Strawberry Shortcake cookbook from 2004 so it’s very basic and easy to make since the cookbook is literally for children lol”",
      "created_utc": 1724695918.0,
      "score": 2,
      "context": [
        {
          "id": "ljwhl8f",
          "author": "angelneliel",
          "body": "Nooooooooooo not Annie's!!! Seriously? Ugh, guess I won't be eating mac n cheese ever again 😓",
          "created_utc": 1724613838.0
        },
        {
          "id": "ljxdcj2",
          "author": "sillydogcircus",
          "body": "I have a homemade recipe if you’d like it",
          "created_utc": 1724624939.0
        },
        {
          "id": "ljy7tk0",
          "author": "katiecat369",
          "body": "I’d love that recipe!!",
          "created_utc": 1724637232.0
        }
      ]
    },
    {
      "id": "lk0xk55",
      "author": "RamblingRose63",
      "body": "Oh wow awesome!!",
      "created_utc": 1724685902.0,
      "score": 2,
      "context": [
        {
          "id": "ljxdzhx",
          "author": "None",
          "body": "yoke impossible act live noxious caption gold shocking oatmeal jellyfish\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
          "created_utc": 1724625184.0
        },
        {
          "id": "ljyb3kz",
          "author": "RamblingRose63",
          "body": "Have you tried raos sauce we are obsessed",
          "created_utc": 1724638519.0
        },
        {
          "id": "ljzh0mj",
          "author": "None",
          "body": "caption live dinner seemly badge whistle license gold tart racial\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
          "created_utc": 1724662074.0
        }
      ]
    },
    {
      "id": "m367oam",
      "author": "Snakewithwings",
      "body": "thank you! I will try them",
      "created_utc": 1734806498.0,
      "score": 1,
      "context": [
        {
          "id": "m3385li",
          "author": "Snakewithwings",
          "body": "im so sorry. I am going through the same thing rn and genuinely so devastated. I have been eating this Mac and cheese literally my entire life and I still eat it all the time and I ran out of my stockpile yesterday and had the new one for the first time today without realizing they changed it until I took a bite and knew it was wrong. and then I looked at the box and saw it was different and my heart genuinely sank. I hate that they changed it when it was so good. it just sucks so much and when its one of the main foods you eat its even worse. another of my favorite foods got discontinued a month ago and it really just brings you down. good luck and im sorry you're going through this too.",
          "created_utc": 1734754252.0
        },
        {
          "id": "m338a7t",
          "author": "Snakewithwings",
          "body": "also - I hope you feel better now than when you made this post. if you've found any alternatives or have gotten used to the new one and you see this please let me know I am desperate",
          "created_utc": 1734754311.0
        },
        {
          "id": "m350inu",
          "author": "ibelieveinaliens111",
          "body": "Hi! Thank you so much for your sympathy. I made this a while ago and have found some substitutes. The shaped noodles that annie’s make are a pretty good substitute, though they have slightly less of a taste. I’ve only tried the cheddar ones, and not white cheddar, so I can’t speak for those sadly.",
          "created_utc": 1734791013.0
        }
      ]
    },
    {
      "id": "lk4mgjx",
      "author": "ibelieveinaliens111",
      "body": "i don’t want to make me wanting to die your problem sorry that’s good advice for people",
      "created_utc": 1724733576.0,
      "score": 1,
      "context": [
        {
          "id": "ljwfgg2",
          "author": "RunaroundX",
          "body": "You just have to slowly learn to accept small changes like that and not make change a catastrophe. I notice now than I'm 30, I care a little less than I used to. Some of its practice and some of it is just aging. You'll get there <3",
          "created_utc": 1724613106.0
        },
        {
          "id": "lk2xm9q",
          "author": "ibelieveinaliens111",
          "body": "i can’t accept the fact that everything i love has to change eventually nothing will ever taste good again and i’ll starve and that’s it",
          "created_utc": 1724709239.0
        },
        {
          "id": "lk32nnu",
          "author": "RunaroundX",
          "body": "Stuff will still taste good even if it's different. That's just your anxiety talking and making everything into a catastrophe. You are capable of adjusting to change. You just need to do it a lot slower than most people do. That's okay too. Just take your time and use your words to trick your mind into being open to small change, mind over matter style.",
          "created_utc": 1724711108.0
        }
      ]
    },
    {
      "id": "lose56o",
      "author": "sillydogcircus",
      "body": "I hope it serves you well!!!",
      "created_utc": 1727228012.0,
      "score": 1,
      "context": [
        {
          "id": "ljwhl8f",
          "author": "angelneliel",
          "body": "Nooooooooooo not Annie's!!! Seriously? Ugh, guess I won't be eating mac n cheese ever again 😓",
          "created_utc": 1724613838.0
        },
        {
          "id": "ljxdcj2",
          "author": "sillydogcircus",
          "body": "I have a homemade recipe if you’d like it",
          "created_utc": 1724624939.0
        },
        {
          "id": "ljylwul",
          "author": "sillydogcircus",
          "body": "- 2 C pasta\n- 2.5 C whole milk (yes, whole, that’s important)\n- 2 C shredded cheddar cheese (it melts easier if you shave it off a block versus bagged)\n- 1Tbs butter\n- 1/4 tsp mustard powder\n- 1/4 tsp nutmeg\n- 1/2 tsp pepper\n- 1 bag goldfish crackers (you’ll measure these with your heart)\n- Old Bay if you want it to taste like mine\n\n01. Preheat oven to 350°\n\n02. Combine pinch of salt, milk, mustard powder, pepper, nutmeg, butter in saucepan and bring to boil. \n\n03. Add pasta, reduce heat to low\n\n04. Continue to simmer and stir frequently until pasta is cooked. If liquid runs low, add in more milk 1/4 C at a time.\n\n05. Add 1.5 C shredded cheese and stir until melted. Cover 3 mins. \n\n06. Pour into greased baking dish. \n\n07. Add extra shredded cheese to top evenly. Crumble and add goldfish crackers to top evenly. I always add a little Old Bay at this point. \n\n08. Bake at 350° for 30 mins or until top looks golden and baked. \n\n09. Let rest for 5 minutes and serve. \n\nIf you want it extra creamy, add some heavy cream (base) or cream cheese (stirred in with shredded cheese) to the sauce. This isn’t a healthy food. Don’t try to make it healthy. It’s good for the soul. \n\nWhen reheating, add 1/4 C milk to pasta. It’ll keep it from drying out.",
          "created_utc": 1724643093.0
        },
        {
          "id": "los8jxp",
          "author": "No-Language-4676",
          "body": "Thank you, you’re awesome!",
          "created_utc": 1727225867.0
        }
      ]
    }
  ]
}