{
  "id": "1f47t5t",
  "subreddit": "ARFID",
  "author": "pinche_diabetica",
  "created_utc": 1724951453.0,
  "title": "Anyone else absolutely despise soup?",
  "selftext": "I just recently found this thread. I’ve struggled with ARFID my whole life and most foods/textures make me puke. I also have a double whammy in the sense that I’m type one diabetic as well, which I feel may have also impacted my issues with eating. Anyways, I’ve been really trying to get more varieties of food into my diet. However, one thing that will always be a no-go for me is soup. Something about it just makes me nauseas. Even just looking at it. Something about the way everything is mushy in one big pot, while all tasting the same, it just completely shuts off my hunger. Where I work there is a soup bar and I despise customers who come through my line with soup dripping all over the containers. Anyone else like this with soup? And stew !! I just hate it. Even thinking about it now I’m getting all icky feeling ",
  "url": "https://www.reddit.com/r/ARFID/comments/1f47t5t/anyone_else_absolutely_despise_soup/",
  "score": 87,
  "num_comments": 44,
  "comments": [
    {
      "id": "lkjatod",
      "author": "madnessdoesntplay",
      "body": "YES!! I hate soup and even call many things that aren’t soup “soup” because it’ll have all of the same qualities about soup that I just cannot do. You’re not alone!",
      "created_utc": 1724952577.0,
      "score": 24,
      "context": []
    },
    {
      "id": "lkjc0jr",
      "author": "SleepwalkerWei",
      "body": "Yeah I don’t get the appeal of soup at all. Mushy food, too many flavours, too strong flavours, too many textures, not really that filling, not appetising or enjoyable. Even if the soup has nothing in it (ie store bought tomato soup), I still don’t understand soup. I am a soup hater!!!!!",
      "created_utc": 1724952937.0,
      "score": 19,
      "context": []
    },
    {
      "id": "lkjeega",
      "author": "Kittencab00dles",
      "body": "Funny, I can do soup cause I can just drink it fast, it’s the “surprise crunch” that puts me off.  we can split our soup and sandwich specials ♥️",
      "created_utc": 1724953656.0,
      "score": 13,
      "context": []
    },
    {
      "id": "lkjoibp",
      "author": "Bluemookie",
      "body": "All soups are triggering to me. If the goal is to eat some food and drink some water, I'll do that on my own terms.",
      "created_utc": 1724956756.0,
      "score": 12,
      "context": []
    },
    {
      "id": "lkjfz46",
      "author": "Hanhula",
      "body": "I like one soup. Heinz tomato soup. It's cheap, it's completely smooth, and it's close to my other safe foods. I like it with naan especially, because naan doesn't leave bits in the soup.",
      "created_utc": 1724954131.0,
      "score": 10,
      "context": []
    },
    {
      "id": "lkjikcx",
      "author": "PeachOnAWarmBeach",
      "body": "I can eat chicken vnoodle broth, but only if it has only noodles and broth.  No chicken chunks or veggies.  \n\n\nI might be able to do tomato soup,  no chunks or adds.  Make it like tomato sauce... plain and thick.",
      "created_utc": 1724954916.0,
      "score": 8,
      "context": []
    },
    {
      "id": "lkjmkv4",
      "author": "Fizzabl",
      "body": "Hot thick liquid, not normal 🤢",
      "created_utc": 1724956153.0,
      "score": 8,
      "context": []
    },
    {
      "id": "lkjkand",
      "author": "weinthenolababy",
      "body": "I will never eat soup. Like it's not food to me?? If I'm eating, I want to EAT something. Soup is like... drinking or slurping. It's not eating lmfao. Probably irrational but that's the reason I won't eat it.",
      "created_utc": 1724955447.0,
      "score": 7,
      "context": []
    },
    {
      "id": "lkjnmtm",
      "author": "umadhatter_",
      "body": "I like some really brothy soups and certain kinds of chili. But I eat it differently because I hate soggy mushy food. For broth soups I dip crackers in it so I get the soup flavor and a crunch that I love. For chili I spoon the chili onto a cracker and quickly eat it. I never let my crackers get soggy and the blandness of the cracker helps calm the flavor. This way I get the flavor I want with the crunchy texture I love.",
      "created_utc": 1724956480.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lkjptvk",
      "author": "Evening-Fan1752",
      "body": "HATE!",
      "created_utc": 1724957166.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lkjyvjs",
      "author": "eowynsamwise",
      "body": "YES!! Soup haters rise up! The only soup I’ve ever even tried is tomato soup and that’s only because it’s actually pretty good to dip grilled cheese in, but I absolutely despise broth with bits in it",
      "created_utc": 1724960010.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lkjt8j3",
      "author": "victorious-turnip",
      "body": "I can tolerate like two types of soup (ramen & pho) but only because the noodles don’t get squishy. \n\nWhen anyone asks me why I don’t like soup (which isn’t often) I say that I don’t eat wet food. It gets a laugh and if people ask further I lean in and say it’s weird that they prefer their food pre-wet.",
      "created_utc": 1724958221.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lkjzacm",
      "author": "pendigedig",
      "body": "Hot puke!",
      "created_utc": 1724960142.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lkke8we",
      "author": "Huge-Operation5542",
      "body": "Soup is the one thing I can pretty much always eat. I could literally eat it for every meal, soup I love you ❤️ (as someone who finds liquidy foods easier to eat and has no food texture issues except pears 🤢)",
      "created_utc": 1724964707.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lkmnnka",
      "author": "thatkidhouska",
      "body": "Honestly? Soup is very mid in my opinion, but I think the concept is good. Like a variety of proteins and vegetables in one dish? Nutritionally, it makes sense. I think we should start blending/immersion blending more soups so that it's just one texture to eat/drink. I think that way soup would be way more filling since we could fit more nutrients into what we eat.",
      "created_utc": 1724996561.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lkjoqbf",
      "author": "rvlry13",
      "body": "It’s gross. I hate it. If I really have to, I’ll take the chicken broth with noodles only (like someone else mentioned).",
      "created_utc": 1724956826.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lkjzcni",
      "author": "lizardassbitch",
      "body": "i don't like most soups. the only soup i thoroughly enjoy is broccoli cheddar soup. it's very consistent in its texture and there's no weird shit mixed in. just broccoli and cheese.",
      "created_utc": 1724960162.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lkk09ij",
      "author": "TashaT50",
      "body": "It depends on a number of factors for me but I’m not big on soup too many texture issues as well as ingredients I have issues with. The biggest is mood for the few soups I like. I have to be in the right mood which only happens a few times of year for all combined. \n\nI love French onion soup with a large piece of bread and melted cheese is optional. I eat the bread and cheese and sip on a little bit of the broth. I never eat the onions. I give them to whoever I’m dining with. It’s a texture thing.\n\nI like some tomato soups - imagine, pacific, and sometimes condensed but I have to be in the right mood. I take slightly toasted garlic bread and dip it in the soup. But I’m rarely in the mood. \n\nChicken noodle occasionally. I only eat the noodles not veggies. I used to make this twice a year for Passover and Sukkot (Jewish holidays).\n\nWonton soup I eat the wontons and a little bit of the broth only at a few Chinese restaurants.\n\nA few years ago I got into cold fruit soups in the summer. I haven’t had them in years. I should look for my recipes.\n\nOther than those keep soup away from me.",
      "created_utc": 1724960444.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lkk3vjb",
      "author": "violenturge",
      "body": "I can't stand chilli of any kind the soupy kind or the chunky kind. The weird thing is, I can cook it. I make it every season for my spouse, I don't even taste it to make sure it's edible, I just throw the ingredients in and trust it doesn't kill him lmao",
      "created_utc": 1724961546.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lkkchu5",
      "author": "KaleidoscopeShot1869",
      "body": "I like broccoli cheddar soups but only if I eat it by dipping bread in it and eating it that way",
      "created_utc": 1724964172.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lkkiw8z",
      "author": "peanutbutternmtn",
      "body": "I would never eat soup. Never ever.",
      "created_utc": 1724966159.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lkklh6k",
      "author": "jorwyn",
      "body": "I seem to be the opposite. There are so many times soup is the only thing I can eat. but i totally understand you on this one.",
      "created_utc": 1724966984.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lkl9juu",
      "author": "kiochikaeke",
      "body": "I'm fine with soup (not all of them mind you) but I also have my super no-go food, citrics, I just can't, the sole smell or image makes me nauseus, I can't even touch them without feeling uncomfortable, I've tried easing into them a few times to at least not hate them completely but nope, I already accepted that I'm leaving this world without liking them and I'm completely and perfectly fine with it, I can eat some stuff with citric acid as long as they don't look, taste or feel that way so at least my diet is safe.",
      "created_utc": 1724975342.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lkle8hm",
      "author": "Big-Formal408",
      "body": "The *only* soup I like is miso soup with soba or ramen noodles and I can usually only tolerate eating that once a year. All the other soups belong in the trash",
      "created_utc": 1724977068.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lkn0ng3",
      "author": "FunnelCakeGoblin",
      "body": "I hate broth based soup, like chicken noodle. But I like a couple of thick soups, like tomato or potato soup. But, I don’t really like to have them alone, and like to have a sandwich or crackers or something I can chew with them.",
      "created_utc": 1725004701.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lkklife",
      "author": "anonmarmot17",
      "body": "lol I’m the opposite\n\n\nthe only things I like to eat are mushy, soup like, liquid, ice cream, smoothie, mashed, etc. an exception is cereal and baked goods",
      "created_utc": 1724966994.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lkkne6g",
      "author": "kitkat1224666",
      "body": "I’m the opposite, I love soup and it’s always guaranteed to be a safe food.",
      "created_utc": 1724967601.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lkkp9m7",
      "author": "giovannijoestar",
      "body": "The only soup I like is ramen, other than that I never eat it.",
      "created_utc": 1724968214.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lkkr4bj",
      "author": "ControlOk8832",
      "body": "Yes",
      "created_utc": 1724968826.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lkkrwpi",
      "author": "soft_seraphim",
      "body": "I like some soups but not everyday. I like chicken broth with egg, ukha, okroshka, mushroom soup, some cream soups and my favourite miso soup. I don't eat soups with meat unless it's meat that doesn't taste like meat (so just to be safe I don't eat soups with meat)\n\nEvery now and then I have this big fixation on dry miso soup packs that you can dilute with water and have somewhat decent miso soup very fast. It's so salty and rich, similar to chips to me.",
      "created_utc": 1724969092.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lkl3qae",
      "author": "ArcherFawkes",
      "body": "When I was younger I refused to drink soup. I would only eat the contents in the soup/stew with a fork. My suspicion is it's because there are different bits that float around in it (crumbs of vegetables and meats that fall of the main pieces while stirring/boiling/simmering) and I hated the little crumbs floating in my morning cereal as well. I'm better about it now but I don't prefer soup if I have a choice.",
      "created_utc": 1724973229.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lkl8p30",
      "author": "LetMeInYourWindowH",
      "body": "I went through a phase of trying to get myself to like soup but I couldn't do it. It's okay to dip toast/bread in, but when you've finished the bread, there's no reason to finish the rest of the soup because soup by itself is not good.",
      "created_utc": 1724975028.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lkln53u",
      "author": "starrysky555",
      "body": "Yes, I hate it's, it's a lot years I don't eat soup, i also don't like the texture",
      "created_utc": 1724980314.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lkmppse",
      "author": "YourSexyLawyer",
      "body": "Homemade soup was my safe food for many years until I was 14 and one day it tasted oddly bit too much like cereal with milk…and then I spent a good ten minutes on my knees in my toilet realizing I lost another safe food to my emetophobia induced ARFID. I can only handle Lipton Ring-O’s from now on as a result.",
      "created_utc": 1724997751.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lkmwi2u",
      "author": "midnightfoliage",
      "body": "never had it bc too afraid 🥲",
      "created_utc": 1725001970.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lkncvy7",
      "author": "Jazzlike_Elderberry9",
      "body": "won't touch it",
      "created_utc": 1725012671.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lkngt5y",
      "author": "mykeuk",
      "body": "The only soup I can handle is cream of tomato, if I'm dipping bread into it. I can't do that stuff with vegetables in our anything. It looks like sick",
      "created_utc": 1725014924.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lknthb9",
      "author": "Ok_Dig_7316",
      "body": "I need to try more soup I think that’s the food I’m gonna test out next",
      "created_utc": 1725020739.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lkp9v2i",
      "author": "Gmschaafs",
      "body": "No soup is really easy for me to eat actually lol",
      "created_utc": 1725038038.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lksubx0",
      "author": "mayxlyn",
      "body": "I can eat one specific soup in one specific way. Campbell's canned chicken noodle soup. Procedure: add a ton of black pepper for some reason, eat only the noodles, drink the remaining broth, throw the rest away. I like to think that some of the nutrients from the vegetables and chicken end up dissolved in the liquid and I'm getting them that way, but I'm not sure if that's actually true.",
      "created_utc": 1725089975.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lkltxkg",
      "author": "jessicajelliott",
      "body": "Lipton makes a fantastic noodle soup. It’s just broth and tiny little thin noodles. It comes in a box and you just add water and dump the packet in it and then microwave or make it on the stove",
      "created_utc": 1724982889.0,
      "score": 4,
      "context": [
        {
          "id": "lkjikcx",
          "author": "PeachOnAWarmBeach",
          "body": "I can eat chicken vnoodle broth, but only if it has only noodles and broth.  No chicken chunks or veggies.  \n\n\nI might be able to do tomato soup,  no chunks or adds.  Make it like tomato sauce... plain and thick.",
          "created_utc": 1724954916.0
        }
      ]
    },
    {
      "id": "lkkfwh3",
      "author": "texaspretzel",
      "body": "I love chicken and stars but I have to sit and pick all the veggies and chicken out before I eat it.",
      "created_utc": 1724965215.0,
      "score": 3,
      "context": [
        {
          "id": "lkjikcx",
          "author": "PeachOnAWarmBeach",
          "body": "I can eat chicken vnoodle broth, but only if it has only noodles and broth.  No chicken chunks or veggies.  \n\n\nI might be able to do tomato soup,  no chunks or adds.  Make it like tomato sauce... plain and thick.",
          "created_utc": 1724954916.0
        }
      ]
    },
    {
      "id": "lkmnynp",
      "author": "pinche_diabetica",
      "body": "I have to blend veggies into my pasta sauce to get more nutrients without textural differences",
      "created_utc": 1724996736.0,
      "score": 1,
      "context": [
        {
          "id": "lkmnnka",
          "author": "thatkidhouska",
          "body": "Honestly? Soup is very mid in my opinion, but I think the concept is good. Like a variety of proteins and vegetables in one dish? Nutritionally, it makes sense. I think we should start blending/immersion blending more soups so that it's just one texture to eat/drink. I think that way soup would be way more filling since we could fit more nutrients into what we eat.",
          "created_utc": 1724996561.0
        }
      ]
    },
    {
      "id": "lkmhxvj",
      "author": "PeachOnAWarmBeach",
      "body": "Perfect!  That's it!",
      "created_utc": 1724993393.0,
      "score": 1,
      "context": [
        {
          "id": "lkjikcx",
          "author": "PeachOnAWarmBeach",
          "body": "I can eat chicken vnoodle broth, but only if it has only noodles and broth.  No chicken chunks or veggies.  \n\n\nI might be able to do tomato soup,  no chunks or adds.  Make it like tomato sauce... plain and thick.",
          "created_utc": 1724954916.0
        },
        {
          "id": "lkltxkg",
          "author": "jessicajelliott",
          "body": "Lipton makes a fantastic noodle soup. It’s just broth and tiny little thin noodles. It comes in a box and you just add water and dump the packet in it and then microwave or make it on the stove",
          "created_utc": 1724982889.0
        }
      ]
    }
  ]
}