{
  "id": "1f6vzu9",
  "subreddit": "ARFID",
  "author": "None",
  "created_utc": 1725244530.0,
  "title": "“People claim to have ARFID just so they can justify their picky eating” Their assumptions on people with ARFID disgust me",
  "selftext": "",
  "url": "https://www.reddit.com/gallery/1f6vzu9",
  "score": 378,
  "num_comments": 172,
  "comments": [
    {
      "id": "ll37sij",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1725245102.0,
      "score": 312,
      "context": []
    },
    {
      "id": "ll383u1",
      "author": "Defiant_Grab_5364",
      "body": "This is why I never tell people I have ARFID",
      "created_utc": 1725245239.0,
      "score": 207,
      "context": []
    },
    {
      "id": "ll39g88",
      "author": "coinlockercorndog",
      "body": "Genuinely how does it even effect them 😑",
      "created_utc": 1725245818.0,
      "score": 143,
      "context": []
    },
    {
      "id": "ll3iwb4",
      "author": "None",
      "body": "Wtf is wrong with these people? Do they realise there’s different types of ARFID too? Like I have no issue with smell or texture of food but a fear of choking/aspirating like yeah I’m totally avoiding every single food and living on ensures and milkshakes just for the fun of it. It’s completely destroyed my quality of life. \n\nI LOVED food. I still do but I’m terrified to eat it. Even as a baby I used to eat Brussel sprouts and broccoli! These people are ignorant and haven’t even researched ARFID.\n\nI remember reading an article on ARFID vs Picky Eating and the author said ‘Even a picky eater will find something to eat eventually but an ARFID suffer will STARVE themselves possibly to death if their safe foods aren’t available’ that’s the difference.",
      "created_utc": 1725250175.0,
      "score": 106,
      "context": []
    },
    {
      "id": "ll3htni",
      "author": "Archinaught",
      "body": "\"I don't understand how they're going to make it in the dating world\" - surprisingly, not everyone bases their life partner off the food they eat... Like wtf? Is food the only way you know how to meet a person? Bowling, skating, dancing, MOVIES - you don't have to eat at a fancy AF gastro pub to go on a date.",
      "created_utc": 1725249640.0,
      "score": 185,
      "context": []
    },
    {
      "id": "ll39iwr",
      "author": "ControlOk8832",
      "body": "How boring must their lives be that they spend their free time whining about us (for something we can’t even control)",
      "created_utc": 1725245850.0,
      "score": 72,
      "context": []
    },
    {
      "id": "ll38dzx",
      "author": "crypticcos",
      "body": "Imagine hating on an entire mental disorder. \n\nARFID or not why does it genuinely infuriate these people what others feed their flesh prisons? Just mind your business",
      "created_utc": 1725245361.0,
      "score": 187,
      "context": []
    },
    {
      "id": "ll3k0zb",
      "author": "None",
      "body": "this is sickening behavior that is reminiscent of middle school type bullying. you CANNOT assume what is going on in people's lives. claiming people who have a serious mental illness are \"faking\" it does more harm than good, especially to people who ACTUALLY have it. also, why the hell is the first person's main concern dating? dating isn't the first priority for a lot of us. and if my partner judges me for the way I EAT and don't force upon them... lol bye.",
      "created_utc": 1725250741.0,
      "score": 57,
      "context": []
    },
    {
      "id": "ll3d4lk",
      "author": "knowledgelover94",
      "body": "It truly fascinates me how unsympathetic people are towards ARFID. It has got to be one of the most unsympathized condition (how do I reword this sentence properly?).\n\nCan you imagine if people accused by sensitive to sound as fakers? Like, yo, I’m autistic; **literally all my senses are sensitive but you think I’m faking with one of my senses?** You think we grow out of our senses eventually?!\n\nWhy would someone want to eat a limited diet that doesn’t have ARFID? If you don’t have ARFID you’re gonna get tired of chicken and fries. \n\nPeople just really have some weird emotional attachment to what other people eat, and can’t wrap their mind around others having a sensory processing disorder for taste.  \n\nI wanna be part of some sort of ARFID awareness campaign.",
      "created_utc": 1725247423.0,
      "score": 102,
      "context": []
    },
    {
      "id": "ll3bv1j",
      "author": "CSMom74",
      "body": "I'd give anything to have not lived with this for close to 50 years, I promise you that! People are stupid.",
      "created_utc": 1725246862.0,
      "score": 34,
      "context": []
    },
    {
      "id": "ll3gs9l",
      "author": "lizardassbitch",
      "body": "i was only diagnosed with ARFID when i was 16 because i got checked into a mental hospital for losing so much weight. i had it since i was 5. the signs and symptoms go so unnoticed because of uneducated takes like this. it makes recovery so difficult if you're just criticized for being \"picky\"",
      "created_utc": 1725249140.0,
      "score": 35,
      "context": []
    },
    {
      "id": "ll3mnfx",
      "author": "kiochikaeke",
      "body": "I don't know man, I've known several persons who consider themselves very picky eaters, I've not known anyone else irl who cried in front of her gf while trying to eat the dinner she made or takes months of time and exposure therapy for them to eat a new food that's just an slightly modified version of a food they already like, or that had puked so many times that they control their gag reflex, or that had cried in the bathroom while trying to eat food when they were 10 y/o because they don't want to make their parents expend and work more because of them. I think it *may* be slightly more serious than just a case of being picky.\n\nI don't know if anyone reading this reads manga or watches anime, I don't do so that much but the first few chapters of Tokyo Ghoul the protagonist had to struggle with the fact that, due to him becoming a ghoul, all food had become disgusting except for raw meat, there was a scene when he just scrambled around his kitchen eating everything and puking everytime something entered his mouth, the fact that I related so much with that scene and later when he cried once he discovered he could also drink coffee taught me a bit about myself.",
      "created_utc": 1725252099.0,
      "score": 40,
      "context": []
    },
    {
      "id": "ll3m1zo",
      "author": "roputsarina",
      "body": "As if dating is everyone's most important goal, some of us are fighting the spectre of death at every fucking meal.",
      "created_utc": 1725251784.0,
      "score": 34,
      "context": []
    },
    {
      "id": "ll3n3qd",
      "author": "anilucy",
      "body": "As someone who is genuinely terrified to date men bc of this topic and how negatively society views “picky eaters” I absolutely hate this. I wish nothing but the worst for people who make fun of others with this ED and I hope they never reproduce and become parents.",
      "created_utc": 1725252337.0,
      "score": 26,
      "context": []
    },
    {
      "id": "ll3pvoz",
      "author": "Ok-Committee-5867",
      "body": "“Why don’t you talk about your disorder?” OH idk cause there’s people like this out there who even after seeing so much testimony and learning about the struggles we have (scrolling through the dedicated ARFID subreddit) , will STILL judge us and question the legitimacy of our issues. \nIt is absolutely absurd and I feel so angry at posts like that. \nI do not get how you can just brush off a whole group of people because you “overcame picky eating”. \n\nNot to mention how creepy it sounds for someone to scroll through a subreddit such as /ARFID and just be reading posts and thinking, “this is such bs”. Why put so much effort into hating on us? I do not understand.",
      "created_utc": 1725253826.0,
      "score": 28,
      "context": []
    },
    {
      "id": "ll3qxko",
      "author": "IhavefiveKidneys",
      "body": "Buddy if I could eat all the healthy foods that would ensure I would live past the age of fifty without vomiting I would",
      "created_utc": 1725254413.0,
      "score": 26,
      "context": []
    },
    {
      "id": "ll41nzl",
      "author": "egoistmp3",
      "body": "i saw redscarepod and stopped reading lol. please don't worry about what nasty racist losers who make being edgy a lifestyle have to say about you everyone 🙏🏻",
      "created_utc": 1725260828.0,
      "score": 27,
      "context": []
    },
    {
      "id": "ll3bjl4",
      "author": "Walusqueegee",
      "body": "Why focus on people who either aren’t smart enough or don’t give enough of a shit to understand our eating disorder? Interacting and paying attention to idiots only drains you. You know you’re right, you know they’re wrong, and that’s it.",
      "created_utc": 1725246727.0,
      "score": 24,
      "context": []
    },
    {
      "id": "ll3lkwc",
      "author": "sappy__",
      "body": "One time I wanted to try a new food, made it and I had a literal panic attack over a peanut butter and marshmallow fluff because the combination didn’t look right in my head, I kept repeating myself “is this the right thing to eat?” never gave it a try again (the same food).\n\nThen I go to the phase where  I’m scared to eat some types of food because I’m afraid that I will get sick.\n\nThen I go to another phase where  I don’t like when food it’s touching itself because it contaminated.\n\nThen most of the time I don’t like some combination of food.\n\nOn rare occasions I think that I might literally choke if I eat something.\n\n\nit’s not easy at it seems, ARFID is much more then “avoiding some types food”, being a picky eater, safe foods or eating the same thing over and over, it deeper then that and more complex.\n\nPeople need to really think that any kind of disorder doesn’t go by the book, people need to educate themselves before speaking up about a topic, that is absolutely how misinformation spreads like in this case scenario.",
      "created_utc": 1725251537.0,
      "score": 20,
      "context": []
    },
    {
      "id": "ll3sewh",
      "author": "milkywaywishes420",
      "body": "People never seem to know how to respond to me when I tell them that my ARFID makes me straight-up vomit if I eat an unsafe food. Not gag, not feel nauseous, I will outright throw up before I can even swallow the food. Sometimes, on days where I’m struggling more with texture, it even can happen with safe foods. This even happens when the food tastes good to me; it’s entirely texture-based, and my reaction is physical and extreme. I’ve tried many foods I’ve LOVED the flavour of, but threw up trying to eat. I know it isn’t this way for everyone, but it sure shuts people up for me.\n\nIn any case, it’s bizarre to me that people are this bothered by what’s already a humiliating and debilitating condition, especially considering the fact that it’s more recently-recognized and so some treatments are still in the earlier stages. Food is a staple of life, necessary for our survival, and also has a huge social aspect to it; why would anybody choose to live like this on purpose? I’ve never in my life met anyone else with ARFID who wouldn’t rather be able to eat normally.",
      "created_utc": 1725255243.0,
      "score": 19,
      "context": []
    },
    {
      "id": "ll3bkdx",
      "author": "thereaintshitcaptain",
      "body": "Yepp I told two people IRL about it and they reacted very negatively (similar to these commenters).",
      "created_utc": 1725246737.0,
      "score": 18,
      "context": []
    },
    {
      "id": "ll3o8jk",
      "author": "xxx-angie",
      "body": "that part about the little girl really bugs me-\n\nim 18 and have been actively suffering from ARFID for at least 8 years and potentially up to 12. when i was younger, i liked a lot more foods and tried things a lot more, but yknow after a DECADE of repeatedly not liking the majority of foods you try, ya, you start to assume you are not going to like it, especially if it has something that stands out in a negative way to you (strange smell or odd texture for example), because experience has taught you you aren't going to like it!\n\nthe last time i tried a new food was grilled cheese recently, and while the cheese taste is just low enough with one slice to edge on safe food, it makes me nauseous and unfortunately is going to be very hard for me to eat. i was going to try and make myself one today, but i though the bread smelled weird so i didn't trust it",
      "created_utc": 1725252936.0,
      "score": 16,
      "context": []
    },
    {
      "id": "ll3y5sc",
      "author": "two-of-me",
      "body": "“Snap out of it” seriously? r/thanksimcured",
      "created_utc": 1725258642.0,
      "score": 13,
      "context": []
    },
    {
      "id": "ll3yqey",
      "author": "midnightfoliage",
      "body": "ill never understand getting personally offended or upset by what other people like/dont like to eat. it does not affect you. \n\nbullying people with preferences just makes things worse. im afraid of eating around people because of that kind of judgement. \n\nbeing picky is not bad. being scared of trying things is not a choice. \n\nfood discourse is so so ridiculous and sometimes triggering how people attack each other over it.",
      "created_utc": 1725258994.0,
      "score": 12,
      "context": []
    },
    {
      "id": "ll4txrq",
      "author": "arachnids-bakery",
      "body": "\"Grown adults with an *EATING DISORDER* are such an interesting breed of people\" ffs, this is straight up r/fakedisordercringe shit",
      "created_utc": 1725278632.0,
      "score": 13,
      "context": []
    },
    {
      "id": "ll3eqal",
      "author": "flordemaga",
      "body": "I’ve never been diagnosed with ARFID, but I know my struggle aligns with it. And just, honestly, I can’t imagine the concept of trying new foods you know nothing about to Not be scary. Even trying foods I like is scary sometimes when my brain decides to act up. \n\nI don’t know. It doesn’t really matter to me if someone’s a picky eater or has ARFID. Eat what you eat just don’t make me eat it and vice versa.",
      "created_utc": 1725248166.0,
      "score": 25,
      "context": []
    },
    {
      "id": "ll4akoj",
      "author": "rin-dragon",
      "body": "why do ppl think we want to have this? there are all kinds of disorders ppl can fake for attention, money, or sympathy. arfid is not one of them 💀 most ppl dont know what it is and those who do equate it with childish picky eating. theres rly no benefit to having arfid lmao",
      "created_utc": 1725266812.0,
      "score": 9,
      "context": []
    },
    {
      "id": "ll3ujnh",
      "author": "Neocactus",
      "body": "If they only knew what I'd do to be a normal eating person LMAO",
      "created_utc": 1725256473.0,
      "score": 10,
      "context": []
    },
    {
      "id": "ll44qsz",
      "author": "Desert_Fairy",
      "body": "Sadly, I think that like most mental disorders, it is a spectrum. \n\nI think everyone has food fears to a certain extent. They just consider them preferences. \n\nBut you don’t see a lot of people willing to eat crickets in the US for instance. \n\nThe disorder is that it applies to so many foods that it affects your daily life. \n\nPeople who say “wanting to be organized isn’t OCD” don’t really understand that hyper focus on managing anything is an OCD Behavior, but because it is a useful display of it, it can’t be a disorder.  Then just ignoring the suffering of someone who spends so much time worrying that something isn’t perfect that they can’t sleep for the anxiety. \n\nGatekeeping mental disorders really bugs me.",
      "created_utc": 1725262851.0,
      "score": 9,
      "context": []
    },
    {
      "id": "ll46oi9",
      "author": "UmJammerSully",
      "body": "Just straight up ableism for real. The denial of it is hilarious.",
      "created_utc": 1725264167.0,
      "score": 9,
      "context": []
    },
    {
      "id": "ll4a5pa",
      "author": "GamingJCD",
      "body": "bro wtf this is the equivalent of telling a suicidal person to just get over it like wtf is wrong with u",
      "created_utc": 1725266533.0,
      "score": 9,
      "context": []
    },
    {
      "id": "ll4bfii",
      "author": "alicyjka",
      "body": "Having ARFID was always such a struggle socially. People always pushed me to „trying” new things and meanwhile I was holding down vomit with tears in my eyes. It makes me feel hopeless, It’s not a choice. I want to eat fun things so bad but each time I try, the disappointment grows stronger.  I want to be healthy and I worry about dying young because of it. Sorry for the vent, but this post just made me remember all the people who humiliated me because of ARFID.",
      "created_utc": 1725267391.0,
      "score": 10,
      "context": []
    },
    {
      "id": "ll3ixoc",
      "author": "Chagdoo",
      "body": "Who cares what these morons think?",
      "created_utc": 1725250193.0,
      "score": 9,
      "context": []
    },
    {
      "id": "ll3uip1",
      "author": "Quantum_Aurora",
      "body": "It's really funny to me since I have ARFID and chicken (including chicken nuggets) isn't a food I like or am willing to eat at the moment.\n\nI'll eat a ton of other things tho with all sorts of veggies. It's just meat that gives me the most trouble.",
      "created_utc": 1725256458.0,
      "score": 8,
      "context": []
    },
    {
      "id": "ll40r1d",
      "author": "AndreaValentine",
      "body": "My bestfriend/roommate know i have ARFID and is very supportive and understanding but was still surprised on how stongly i reacted to eating something that triggered my arfid. Like it was a tiny bit of white dragonfruit and i was violently retching. Man, i wish i was just picky. \nI try new things often in hopes to find new things i can eat, but it’s hard when you have a limited availability in groceries, compared to America and even neighbouring countries. (I live in the nordics and we are creatures of habit and keep with brands/things we know so hard to introduce new products/chains/brands in grocery stores, is what i’ve been told)\n\nAnd it’s embarrasing as a 26 y/o to have to check menus before we can decide on a place to eat, or not wanting to eat dinners at other peoples placed incase they make something i can’t eat.",
      "created_utc": 1725260262.0,
      "score": 8,
      "context": []
    },
    {
      "id": "ll4q2a6",
      "author": "CaptainGigsy",
      "body": "I'll never understand why ARFID makes people so genuinely furious. It's an entirely personal disorder and us having it does not affect them in any way.",
      "created_utc": 1725276704.0,
      "score": 7,
      "context": []
    },
    {
      "id": "ll3kxkh",
      "author": "sayorihanginaround",
      "body": "brother eugh",
      "created_utc": 1725251202.0,
      "score": 7,
      "context": []
    },
    {
      "id": "ll4ehes",
      "author": "None",
      "body": "fucking hell the IGNORANCE makes me so mad\n\nat the height of my ARFID, I genuinely thought any of my non-safe foods would kill me. I wasn't a picky eater - there were so many foods I WISHED I could eat, but I didn't dare touch them bc I was convinced I'd die...\n\nbut yea I guess me not wanting to die is being waaaaay too fussy",
      "created_utc": 1725269488.0,
      "score": 8,
      "context": []
    },
    {
      "id": "ll4uw6g",
      "author": "thecxsmonaut",
      "body": "Red Scare listeners try not to be the most insufferable terminally online shit scum you've ever met challenge",
      "created_utc": 1725279086.0,
      "score": 9,
      "context": []
    },
    {
      "id": "ll41qfb",
      "author": "Splatfan1",
      "body": "even if it was just being picky. whats to hate? like bro whats YOUR problem",
      "created_utc": 1725260870.0,
      "score": 7,
      "context": []
    },
    {
      "id": "ll4b90v",
      "author": "DrKreatiF230",
      "body": "Those people could have minded their own business but here they are, writing long rants on the internet about strangers' food taste. Their life must be so easy",
      "created_utc": 1725267272.0,
      "score": 7,
      "context": []
    },
    {
      "id": "ll4pbti",
      "author": "tikasaba",
      "body": "This is so fucking gross. Jesus Christ. And people wonder why those with ED’s rarely speak out to others or get help…yeah, this is why. Fuck this world.",
      "created_utc": 1725276315.0,
      "score": 6,
      "context": []
    },
    {
      "id": "ll5z7zh",
      "author": "KennaLikesPizza",
      "body": "I'm more likely to snap OOP's neck than \"snap out of\" ARFID",
      "created_utc": 1725293762.0,
      "score": 6,
      "context": []
    },
    {
      "id": "ll6chu1",
      "author": "New_Bridge3428",
      "body": "Yes, I make the conscious choice to embarrass myself and gag at food in front of ppl. My bad",
      "created_utc": 1725298114.0,
      "score": 7,
      "context": []
    },
    {
      "id": "ll6mpgv",
      "author": "Prometheus-is-vulcan",
      "body": "As far as I saw here, there are two somewhat distinct categories of ppl with ARFID. \n\n1. Problem with eating at all, disgusted by any food, throws up because of eating, underweight, some barely alive. \n\n2. Health appetite, wants to eat, is limited to certain foods. Throws up because of imagining eating certain foods. Some are overweight, as they can only eat non-filling, high calorie food.\n\n\nBoth suffer. Both deserve our sympathy. \n\nBut as soon as its about \"I can eat it, I just don't like it\", its not ARFID. \n\nI am group 2, and I dont like 75% of the food I eat, but I need that variety (also important to not loose safe foods).",
      "created_utc": 1725301501.0,
      "score": 7,
      "context": []
    },
    {
      "id": "ll6r6z8",
      "author": "queijinhos",
      "body": "But I don’t have to justify anything to anyone. If I want to be a picky eater, if I am a picky eater, that’s my problem. I pay for my own food. \n\nBut I DO have ARFID. ARFID exists regardless of people’s opinions.  Not only do we suffer, we also have to listen to the opinions of idiots.",
      "created_utc": 1725303010.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ll3i6aa",
      "author": "None",
      "body": "Luckily, these people are chronically online, so we won't have to worry about people like this in the real world. It makes me upset, but also is funny hearing people who haven't struggled a day in their life ramble about how other peoples problems are fake because they don't understand it. So childish.",
      "created_utc": 1725249814.0,
      "score": 11,
      "context": []
    },
    {
      "id": "ll4yk6y",
      "author": "knlight",
      "body": "This kind of thing used to upset me but now I really don't care. It's almost funny that it bothers people so much that some people have a limited diet.",
      "created_utc": 1725280744.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ll5bjcd",
      "author": "redcrossbow_",
      "body": "God I hate that sub... they're part of the so called \"dirtbag left\" aka edgelords but..\"leftist\"",
      "created_utc": 1725285794.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ll5g3k5",
      "author": "TheTaintPainter2",
      "body": "Do these people think we want to have a restricted diet and have foods that make us feel violently ill?",
      "created_utc": 1725287408.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ll626mf",
      "author": "whitefuton",
      "body": "The comment that’s most frustrating to me is the one that’s criticizing the girl on instagram who’s trying new foods but has “junk food” safe foods. It’s upsetting bc like shes trying to take steps towards recovery and doing better with it but it’s apparently still not good enough for them. \n\nPeople suck.",
      "created_utc": 1725294732.0,
      "score": 6,
      "context": []
    },
    {
      "id": "ll65vvc",
      "author": "Zoemsv",
      "body": "I am autistic and have pretty severe chronic GI issues so my ARFID is a complex response to relentless illness combined with sensory issues - I'm not being a picky eater.  People with no compassion or the desire to understand the humans around them aren't generally the happiest people and I suspect a lot of this vitriol is misguided to avoid facing their own issues.  Quite honestly, I spend all the energy I have navigating GI and food issues, I don't have the bandwidth to help others understand it.  If someone treats me poorly because of how I'm able to stay alive, they can find other people to interact with.",
      "created_utc": 1725295944.0,
      "score": 7,
      "context": []
    },
    {
      "id": "ll6gmt2",
      "author": "Little_Mog",
      "body": "I genuinely feel bad for people who veiw others like that. Rather than taking 0.2 seconds to think about it or empathise they just give straight to attacking them. It's a really sad way to live your life. Closed off in your own little bubble, unable or unwilling to understand the world around you.\n\nI used to get annoyed at them but now I just pity them.",
      "created_utc": 1725299478.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ll8hav4",
      "author": "heartoffiction",
      "body": "Crying in the bathroom at a restaurant because the menu doesn’t have anything you can eat and you do desperately want to be normal…. Yeah sure but I just love being picky",
      "created_utc": 1725325218.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ll416wf",
      "author": "soft_seraphim",
      "body": "This fucking person thinks that they understand ARFID because they experienced something similar and now they know ALL about it and therefore have the right to judge people left and right with their 😎BaSeD😎 takes  \n\nI'm not diagnosed with ARFID, but I have very similar problems and had them all my life starting from infancy, that's why I'm on this subreddit, people here have the closest experiences to mine. I wish I were able to eat like a normal person, but it seems I would rather starve and damage my health than eat something I can't eat. It's not just picky eating, Karen",
      "created_utc": 1725260536.0,
      "score": 8,
      "context": []
    },
    {
      "id": "ll4v6xx",
      "author": "DifferentIsPossble",
      "body": "So what? So what??? Let them be picky eaters",
      "created_utc": 1725279225.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ll51tnb",
      "author": "biscottiapricot",
      "body": "yeah im so content with the eating disorder that makes something you need to do to literally stay alive extremely hard... \nalso why is their explanation of being a picky eater trying a taco at 11? i had one for the first time at 20 because it's not a super popular food in my country and so i only saw one in a restaurant when i moved into a city",
      "created_utc": 1725282097.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ll52e57",
      "author": "Version_Present",
      "body": "If they don't want people to hurl the word ableist at them maybe maybe they shouldn't be ableist.....a lot (not all) of people with ARFID tend to also have ADHD or autism. Also making fun of people with an eating disorder is so funny. :/",
      "created_utc": 1725282324.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ll5azhb",
      "author": "ScaryBoyRobots",
      "body": "One of the things I have always wanted most in my life is the ability to eat anything and try new foods. Going into a produce section fascinates me because all the colorful fruits and veggies look so beautiful to me — but my brain doesn’t even register them as real food. Trying to eat any of them gives me the same reaction as someone scooping lawn clippings, holly berries and poison ivy into a bowl and telling me to wolf it down. Would any of these people eat that? No, of course not, and they would have a panic response even trying to do so, because every instinct they have would be screaming that it’s not safe and those are not edible. That it’s dangerous and they’ll be sick, if not die. Except my brain does that with 98% of foods. And it makes me miserable. I don’t want to have a panic attack when facing down non-safe foods. I don’t like gagging and choking and throwing up. I wish foods smelled and tasted good to me, that they didn’t process in my head the same way dog shit does. I’ve just learned to live with it, because I can’t get another brain that works right, I’m stuck with this broken one for my whole life. And frankly, it’s not their business what groceries or meals I buy with the money I earn at my job. It’s not theirs to have an opinion on.",
      "created_utc": 1725285593.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ll5bg8y",
      "author": "ADHDRatBoy",
      "body": "These comments are just plain hurtful. Like, no wonder it's rarely talked about irl. \n\nAlso do they not realise that there's like... no help for adults with ARFID unless they wanna pay thousands of pounds to go private? So much more help for kids - which is great, don't get me wrong - but then we're all stuck by the wayside. It sucks. \n\nAnd unfortunately guys I've dated have cut me off or even become abusive due to my eating habits. Thankfully I can now stand up for myself and know how to self-advocate.",
      "created_utc": 1725285763.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ll5q6z1",
      "author": "patrickbateperson",
      "body": "what people like this don’t understand is that this isn’t a new observation. we have been hearing the same shaming, stigma, and deliberate misunderstanding since childhood. this shit breaks you as a person. i grew up believing something was fundamentally wrong with me because *every fucking day* i heard shit like this. i already feel pathetic and stupid for having this eating disorder, it isn’t a novel observation to go “wow this person is pathetic and stupid for having this eating disorder” when i’ve already heard the same “jokes” and “concerns” for as long as i’ve been alive.",
      "created_utc": 1725290801.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ll5uoq2",
      "author": "throwawaycatfinder",
      "body": "One thing I REALLY don't understand is how people are so mad about what OTHER people are eating. Like how does it affect you that somebody else is eating simple, palatable food? Why are you going ape shit because your friend decided to order fries at a restaurant? I absolutely do NOT understand one thing about what they're so mad about",
      "created_utc": 1725292272.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ll5x3ja",
      "author": "Dull-Touch283",
      "body": "This is so frustrating. I legitimately have had this disorder since I started eating solid food as a baby. Eating something other than the same few things I’ve eaten since I was a toddler brings me such intense anxiety to the point of tears and vomiting, like an actual phobia. If I had to eat something outside of my safe food range to survive, I would starve. I don’t understand how you can hear experiences like that and doubt the legitimacy of the disorder. Not to mention, with any disorder there will be varying ranges of severity, those who are farther along in recovery are probably more comfortable talking about their stories publicly.",
      "created_utc": 1725293063.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ll64zmg",
      "author": "beomint",
      "body": "Note: This comment is mostly expressing my feelings about these types of anti-science people, and is hopefully meant to give insight to those who genuinely think ARFID isn't real. TW for speaking about vomiting  \n  \nI think it's funny they literally explained it perfectly themselves then somehow got turned around and forgot their own explanation.\n\nIt's literally just what they said. Kids who are \"picky eaters\" eventually snap out of it. If we could snap out of it, we 100% would. Not a single person who has ARFID has it on their own free will. If someone is genuinely just a \"picky eater\", they eventually get bored and move on JUST like this person said. So if it's still going on into adulthood, certainly there's a fucking issue, no?\n\nI feel like people have this idea that people with ARFID just sit around all day content with their diet and counting down the days until we get scurvy so we can throw a party or something. That's not how it works at all, and many of us actively work with doctors and therapists to fight these issues and try to adjust our diet in a way that ensures we get all of our dietary needs. Just because we're not comfortable going out of our comfort zone at any given moment on your whim doesn't mean we aren't going out of our comfort zone regularly on our own time. Not recognizing that is the equivalent of shoving somebody who can't swim into a pool and saying \"eh, they have to learn somehow\". Instead of helping them step out of that comfort zone, you violently shoved them out and broke their trust and then get mad when it somehow didn't work.\n\nPeople act like I haven't actively tried new foods and haven't actively gagged and vomited on the texture/taste, they act like it's some childish tantrum instead of a real physical response to a food the mind deems unacceptable. I've almost choked on my own vomit trying to force down new foods. And the whole time my brain is screaming \"It's good! It's fine!! It's good food stop being like this!!\" but I can't stop my body's response.\n\nI went years not knowing what the hell was wrong with me, breaking down and crying over my body's stupid inability to just eat certain foods that everybody knows are good and safe. It broke me before I even had the word to describe what was happening and how to fix it. (I had been TRYING to fix it for years, but nothing I did allowed me to \"snap out of it\")\n\nSurprise surprise, being diagnosed with ARFID and doing therapy specific to ARFID ACTUALLY HELPED ME OPEN UP MY PALETTE MORE THAN JUST \"TRYING TO GET OVER IT\" MYSELF. I swear, these people don't actually want anyone to heal. They just want to make people feel bad so they can make fun of them while they watch us fail. It's a cruel sick joke. They take away our support so we get worse then get confused why we aren't getting any better.",
      "created_utc": 1725295653.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ll6oi35",
      "author": "pixelpusheen",
      "body": "Do they think we want to have ARFID or issues eating?",
      "created_utc": 1725302106.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ll4d7jn",
      "author": "Gullible_Educator122",
      "body": "Don’t be shy, drop the usernames :)",
      "created_utc": 1725268607.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ll5uxa5",
      "author": "imdestroylonely",
      "body": "don’t be shy bro post the names uncovered😇😇😇please im begging u to at least send em to me",
      "created_utc": 1725292350.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ll67rej",
      "author": "Mikaay99",
      "body": "Some people don't understand that others simply experience stuff diferently. There's a lot of stuff that makes me think \"huh, I don't really get that\", but I either inform myself on the topic or just let it go. It's not my business anyway.",
      "created_utc": 1725296555.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ll75fyl",
      "author": "Lillybx222",
      "body": "These people scream \"I post about being kind and share mental health posts but I truly don't understand a single thing about any of it\"",
      "created_utc": 1725307850.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ll7b8bw",
      "author": "spooky-ufo",
      "body": "ya i’m totally content eating a total of 8 foods! so happy and fun! it’s so cool whenever i try to eat something and it grosses me out so much that my body physically will not let me swallow. my throat just goes shut. it is physical and psychological, both of which i can’t control",
      "created_utc": 1725309789.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ll8r2o5",
      "author": "mrsatnt",
      "body": "“How are they going to make it in the daring world?” I don’t know, I’ve been married for 17 years!",
      "created_utc": 1725328992.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ll94qyx",
      "author": "RusticMothMan",
      "body": "\"Just get over it and try new things,\" I'm TRYING. Do they really think that people with ARFID are opposed to wanting to try new foods? Because I sure as hell am not. FUCK what I would give to enjoy foods that other people can, but I just can't. My mind tells me that It shouldn't be eating anything that isn't the same three things every day. If I try something else, then alarm bells go off in my brain, and I have a bodily reaction to it. No matter how good it tastes, it just isn't doable to me. Do they know how badly I want a really nice steak or burger? How much I CRAVE a seafood boil? What I would I give to enjoy a banana split sundae without thinking that it was going to kill me in some way. I really wish these people would at least TRY to understand, but they won't, unfortunately.\n\nAlso, they act like every person with ARFID just eats junk food. They'll completely ignore people like myself, who can't get themselves to eat sweets, and only eat cans of vegetables or fruits.",
      "created_utc": 1725334732.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lliqzag",
      "author": "pivy1023",
      "body": "They were just \"browsing\" r/ARFID? Sounds like they just wanted to pick on people. But it doesn't matter because this brave, taco eater can kindly eat my ass too lol",
      "created_utc": 1725480560.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ll5uqfi",
      "author": "Alkemian",
      "body": "I ***fucking wish*** I could eat like a normal person!!!!! 🤬🤬🤬",
      "created_utc": 1725292287.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ll5vuy9",
      "author": "pinche_diabetica",
      "body": "food literally makes me puke but ok",
      "created_utc": 1725292659.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ll7d5ur",
      "author": "Pet_Taco",
      "body": "i eat plain pad thai with the peanuts and masago sushi. i don’t just eat chicken nuggets. i just have trouble with eating fruits and vegetables because the smell and texture makes me physically ill.",
      "created_utc": 1725310438.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ll7mw9t",
      "author": "luminousfloret",
      "body": "This makes me really sad to see. \n\nTell me you’ve never met anyone with ARFID without telling me. \n\nHow does someone’s eating affect YOU?! \nHow does my dating life worry you? Why is this dude worried so much of how other people are living their lives. Time to focus on your own issues instead of constantly rushing to pointing fingers to you don’t have to sit and contemplate yourself. \n\nWho cares if someone is picky and just plain doesn’t want new foods. Who. Cares. It does not affect you. \nI get so wildly upset with people like this, who decide it’s their job to fix picky eaters. How about you all shut up and eat your salad and leave me to my “crackers”.",
      "created_utc": 1725313788.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ll89e46",
      "author": "Gracecar03",
      "body": "I would LOVE to be able to eat like a normal person.",
      "created_utc": 1725322214.0,
      "score": 2,
      "context": []
    },
    {
      "id": "llb459d",
      "author": "Rinny-ThePooh",
      "body": "All I’m seeing is a bunch of non doctors talking about how they don’t believe a medical diagnosis",
      "created_utc": 1725372843.0,
      "score": 2,
      "context": []
    },
    {
      "id": "llnzcb4",
      "author": "honeybin_sugar",
      "body": "I wish we could change body and mind for a day so they can expirience first hand how shitty life is with arfid. They surely wouldn't run their mouths like that if they knew the real burden of this disorder. It annoys me to shreds how ignorant some ppl can be. Besides why do they even make it their business what other ppl eat? If they can eat fine then great but leave me the hell alone",
      "created_utc": 1725559795.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m1kb4mb",
      "author": "Sailing-Guru",
      "body": "I understand aversions but I feel like at some point this has to go back to childhood and having parents who didn't support trying new foods. That being said even adults who have aversions have to make the conscious decision to try. \n\nMy biggest fear growing up was snakes. I never liked the idea of living my life in fear so I got myself a snake and forced repeated exposures on myself to get over my fear. \n\nI think ultimately it does come down to how much you would rather control your life vs how much you're willing to allow something to control you. \n\n\nAlso I just want to point out the irony in commentary of disgusting, slimy, sticky etc surely reinforces your beliefs about food and doesn't help anyone. Meanwhile many of you here with ARFID are happily calling other people's food disgusting while lamenting that you don't eat in front of others because you're scared people will do the exact same to you.",
      "created_utc": 1733942085.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m6cd7bw",
      "author": "Next-Heart-8376",
      "body": "Ahhh i see so it is bullshit. I knew it as soon as i read: i want to but my brain says no.  Oh my brain 🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕",
      "created_utc": 1736479014.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m8cmxj7",
      "author": "Lll_Rascal",
      "body": "You people are such pussys",
      "created_utc": 1737469002.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n34r3d9",
      "author": "Alfombra_",
      "body": "to the first person: fuck you. just, fuck you dude.",
      "created_utc": 1752521619.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ll43hql",
      "author": "mermaidreefer",
      "body": "they act like we don't WANT to like other foods",
      "created_utc": 1725262014.0,
      "score": 127,
      "context": [
        {
          "id": "ll37sij",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1725245102.0
        }
      ]
    },
    {
      "id": "ll3bohn",
      "author": "None",
      "body": "I don’t blame you one bit. They really make me sick as well.",
      "created_utc": 1725246786.0,
      "score": 36,
      "context": [
        {
          "id": "ll37sij",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1725245102.0
        }
      ]
    },
    {
      "id": "ll4fidx",
      "author": "SuperVancouverBC",
      "body": "The most recent edition of the DSM5 lists ARFID as it's own eating disorder. Prior editions included it with \"Eating disorder not specified\".",
      "created_utc": 1725270203.0,
      "score": 36,
      "context": [
        {
          "id": "ll37sij",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1725245102.0
        }
      ]
    },
    {
      "id": "ll43o0d",
      "author": "None",
      "body": "Exactly. Also, some people know that they have it, but are undiagnosed simply because a lot of doctors don’t know about it.\n\nIt can also be masked. A lot of textures make me sick, but there are lots of foods available in the textures that I can eat, so I am never malnourished.",
      "created_utc": 1725262130.0,
      "score": 27,
      "context": [
        {
          "id": "ll37sij",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1725245102.0
        }
      ]
    },
    {
      "id": "lxjup8l",
      "author": "finaldogma",
      "body": "I've always wondered why junk food is considered mild...junk food by its very definition is junk quality. How does it so often manifest as a \"safe food\"?",
      "created_utc": 1731820667.0,
      "score": 1,
      "context": [
        {
          "id": "ll37sij",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1725245102.0
        }
      ]
    },
    {
      "id": "ll3ufzb",
      "author": "notceitn",
      "body": "💯 I even try not to eat in front of people because I'm afraid I'll get comments like this because my food is \"too plain\"... seriously fuck people like those in the post",
      "created_utc": 1725256414.0,
      "score": 105,
      "context": [
        {
          "id": "ll383u1",
          "author": "Defiant_Grab_5364",
          "body": "This is why I never tell people I have ARFID",
          "created_utc": 1725245239.0
        }
      ]
    },
    {
      "id": "ll44578",
      "author": "None",
      "body": "Yes! People make what someone else eats their business unnecessarily.",
      "created_utc": 1725262448.0,
      "score": 37,
      "context": [
        {
          "id": "ll39g88",
          "author": "coinlockercorndog",
          "body": "Genuinely how does it even effect them 😑",
          "created_utc": 1725245818.0
        }
      ]
    },
    {
      "id": "ll462bb",
      "author": "Old-Display-6796",
      "body": "This.  \nAs a kid someone once told me that the pioneers had to sometimes eat grasshoppers to survive. (No idea if that was true,lol) \nI remember knowing for a fact that if that were to ever happen again, I would be one of the first to die of starvation because there is no way I could ever eat a grasshopper, even if it meant death. \nI still feel just as certain of that. \n\nI also could never eat 95% of foods with sauce, or something slimy, or….a pickle or a chicken wing, or non-Kraft Mac and cheese. I get that sounds absurd to many people, but that is how my brain is wired.",
      "created_utc": 1725263748.0,
      "score": 36,
      "context": [
        {
          "id": "ll3iwb4",
          "author": "None",
          "body": "Wtf is wrong with these people? Do they realise there’s different types of ARFID too? Like I have no issue with smell or texture of food but a fear of choking/aspirating like yeah I’m totally avoiding every single food and living on ensures and milkshakes just for the fun of it. It’s completely destroyed my quality of life. \n\nI LOVED food. I still do but I’m terrified to eat it. Even as a baby I used to eat Brussel sprouts and broccoli! These people are ignorant and haven’t even researched ARFID.\n\nI remember reading an article on ARFID vs Picky Eating and the author said ‘Even a picky eater will find something to eat eventually but an ARFID suffer will STARVE themselves possibly to death if their safe foods aren’t available’ that’s the difference.",
          "created_utc": 1725250175.0
        }
      ]
    },
    {
      "id": "ll523hp",
      "author": "biscottiapricot",
      "body": "no they can't even be bothered to google arfid and read the most basic things about it.. like you said fear of choking or of food poisoning could be the reason behind it as well as texture issues",
      "created_utc": 1725282205.0,
      "score": 17,
      "context": [
        {
          "id": "ll3iwb4",
          "author": "None",
          "body": "Wtf is wrong with these people? Do they realise there’s different types of ARFID too? Like I have no issue with smell or texture of food but a fear of choking/aspirating like yeah I’m totally avoiding every single food and living on ensures and milkshakes just for the fun of it. It’s completely destroyed my quality of life. \n\nI LOVED food. I still do but I’m terrified to eat it. Even as a baby I used to eat Brussel sprouts and broccoli! These people are ignorant and haven’t even researched ARFID.\n\nI remember reading an article on ARFID vs Picky Eating and the author said ‘Even a picky eater will find something to eat eventually but an ARFID suffer will STARVE themselves possibly to death if their safe foods aren’t available’ that’s the difference.",
          "created_utc": 1725250175.0
        }
      ]
    },
    {
      "id": "ll55ypr",
      "author": "None",
      "body": "I used to eat peas as a baby but I threw them up constantly after. My mom pretends that’s normal and nothing happened.",
      "created_utc": 1725283719.0,
      "score": 9,
      "context": [
        {
          "id": "ll3iwb4",
          "author": "None",
          "body": "Wtf is wrong with these people? Do they realise there’s different types of ARFID too? Like I have no issue with smell or texture of food but a fear of choking/aspirating like yeah I’m totally avoiding every single food and living on ensures and milkshakes just for the fun of it. It’s completely destroyed my quality of life. \n\nI LOVED food. I still do but I’m terrified to eat it. Even as a baby I used to eat Brussel sprouts and broccoli! These people are ignorant and haven’t even researched ARFID.\n\nI remember reading an article on ARFID vs Picky Eating and the author said ‘Even a picky eater will find something to eat eventually but an ARFID suffer will STARVE themselves possibly to death if their safe foods aren’t available’ that’s the difference.",
          "created_utc": 1725250175.0
        }
      ]
    },
    {
      "id": "ll3nk8f",
      "author": "anilucy",
      "body": "THIS THIS THIS! Surprisingly some partners aren’t absolute fucking assholes like that poster and are supportive of their partners with ARFID",
      "created_utc": 1725252581.0,
      "score": 68,
      "context": [
        {
          "id": "ll3htni",
          "author": "Archinaught",
          "body": "\"I don't understand how they're going to make it in the dating world\" - surprisingly, not everyone bases their life partner off the food they eat... Like wtf? Is food the only way you know how to meet a person? Bowling, skating, dancing, MOVIES - you don't have to eat at a fancy AF gastro pub to go on a date.",
          "created_utc": 1725249640.0
        }
      ]
    },
    {
      "id": "ll3o3o6",
      "author": "sarazbeth",
      "body": "I have 7+ severe food allergies and if someone refuses to date me because I can’t eat at most restaurants… their loss",
      "created_utc": 1725252865.0,
      "score": 64,
      "context": [
        {
          "id": "ll3htni",
          "author": "Archinaught",
          "body": "\"I don't understand how they're going to make it in the dating world\" - surprisingly, not everyone bases their life partner off the food they eat... Like wtf? Is food the only way you know how to meet a person? Bowling, skating, dancing, MOVIES - you don't have to eat at a fancy AF gastro pub to go on a date.",
          "created_utc": 1725249640.0
        }
      ]
    },
    {
      "id": "ll442ra",
      "author": "None",
      "body": "Yes. People like to make every activity about food and then get mad when people can’t eat it.",
      "created_utc": 1725262405.0,
      "score": 19,
      "context": [
        {
          "id": "ll3htni",
          "author": "Archinaught",
          "body": "\"I don't understand how they're going to make it in the dating world\" - surprisingly, not everyone bases their life partner off the food they eat... Like wtf? Is food the only way you know how to meet a person? Bowling, skating, dancing, MOVIES - you don't have to eat at a fancy AF gastro pub to go on a date.",
          "created_utc": 1725249640.0
        }
      ]
    },
    {
      "id": "ll5278v",
      "author": "1986toyotacorolla2",
      "body": "Lol right? Like I'm married so clearly I made it.",
      "created_utc": 1725282247.0,
      "score": 14,
      "context": [
        {
          "id": "ll3htni",
          "author": "Archinaught",
          "body": "\"I don't understand how they're going to make it in the dating world\" - surprisingly, not everyone bases their life partner off the food they eat... Like wtf? Is food the only way you know how to meet a person? Bowling, skating, dancing, MOVIES - you don't have to eat at a fancy AF gastro pub to go on a date.",
          "created_utc": 1725249640.0
        }
      ]
    },
    {
      "id": "ll6hbez",
      "author": "two-of-me",
      "body": "Not quite sure why they think one has to do with another. I’m married, coming up on 13 years together, and my husband is nothing but supportive. He will cook something plain for me and then add his own spices or whatever to his portion. He’s the opposite of me. He loves spices, spicy food, onions, all the stuff most of us can’t handle, and it doesn’t bother him at all. He loves me and doesn’t judge me at all. \n\nThe people judging and calling us childish are the ones with the issue. Most of us know to mind our own business.",
      "created_utc": 1725299705.0,
      "score": 12,
      "context": [
        {
          "id": "ll3htni",
          "author": "Archinaught",
          "body": "\"I don't understand how they're going to make it in the dating world\" - surprisingly, not everyone bases their life partner off the food they eat... Like wtf? Is food the only way you know how to meet a person? Bowling, skating, dancing, MOVIES - you don't have to eat at a fancy AF gastro pub to go on a date.",
          "created_utc": 1725249640.0
        }
      ]
    },
    {
      "id": "ll4fquw",
      "author": "Jen__44",
      "body": "Yep, people who say that are just telling on themselves lol",
      "created_utc": 1725270366.0,
      "score": 7,
      "context": [
        {
          "id": "ll3htni",
          "author": "Archinaught",
          "body": "\"I don't understand how they're going to make it in the dating world\" - surprisingly, not everyone bases their life partner off the food they eat... Like wtf? Is food the only way you know how to meet a person? Bowling, skating, dancing, MOVIES - you don't have to eat at a fancy AF gastro pub to go on a date.",
          "created_utc": 1725249640.0
        }
      ]
    },
    {
      "id": "ll43zgj",
      "author": "None",
      "body": "They don’t realize that obsessing over someone’s food choices likely means that they have a mental illness.",
      "created_utc": 1725262343.0,
      "score": 49,
      "context": [
        {
          "id": "ll38dzx",
          "author": "crypticcos",
          "body": "Imagine hating on an entire mental disorder. \n\nARFID or not why does it genuinely infuriate these people what others feed their flesh prisons? Just mind your business",
          "created_utc": 1725245361.0
        }
      ]
    },
    {
      "id": "ll4qow4",
      "author": "tikasaba",
      "body": "Holy shit this is the best analogy I’ve seen - this is PURE middle school bullying. No wonder I hated this shit so much, those bullies were fucking ruthless in school.",
      "created_utc": 1725277031.0,
      "score": 21,
      "context": [
        {
          "id": "ll3k0zb",
          "author": "None",
          "body": "this is sickening behavior that is reminiscent of middle school type bullying. you CANNOT assume what is going on in people's lives. claiming people who have a serious mental illness are \"faking\" it does more harm than good, especially to people who ACTUALLY have it. also, why the hell is the first person's main concern dating? dating isn't the first priority for a lot of us. and if my partner judges me for the way I EAT and don't force upon them... lol bye.",
          "created_utc": 1725250741.0
        }
      ]
    },
    {
      "id": "ll56ad7",
      "author": "None",
      "body": "For how they act, I wouldn’t be surprised if these people were actually in middle school",
      "created_utc": 1725283843.0,
      "score": 6,
      "context": [
        {
          "id": "ll3k0zb",
          "author": "None",
          "body": "this is sickening behavior that is reminiscent of middle school type bullying. you CANNOT assume what is going on in people's lives. claiming people who have a serious mental illness are \"faking\" it does more harm than good, especially to people who ACTUALLY have it. also, why the hell is the first person's main concern dating? dating isn't the first priority for a lot of us. and if my partner judges me for the way I EAT and don't force upon them... lol bye.",
          "created_utc": 1725250741.0
        }
      ]
    },
    {
      "id": "ll44d49",
      "author": "None",
      "body": "Exactly. Just the fact that someone can eat the same things over and over should be a sign that they are not making it up.",
      "created_utc": 1725262596.0,
      "score": 19,
      "context": [
        {
          "id": "ll3d4lk",
          "author": "knowledgelover94",
          "body": "It truly fascinates me how unsympathetic people are towards ARFID. It has got to be one of the most unsympathized condition (how do I reword this sentence properly?).\n\nCan you imagine if people accused by sensitive to sound as fakers? Like, yo, I’m autistic; **literally all my senses are sensitive but you think I’m faking with one of my senses?** You think we grow out of our senses eventually?!\n\nWhy would someone want to eat a limited diet that doesn’t have ARFID? If you don’t have ARFID you’re gonna get tired of chicken and fries. \n\nPeople just really have some weird emotional attachment to what other people eat, and can’t wrap their mind around others having a sensory processing disorder for taste.  \n\nI wanna be part of some sort of ARFID awareness campaign.",
          "created_utc": 1725247423.0
        }
      ]
    },
    {
      "id": "ll4e7v9",
      "author": "x_vuko",
      "body": "I literally started watching the anime Tokyo Ghoul a few days ago and when that scene happened I was genuinely thinking to myself \"same\". Didn't think I would see it being referenced here.",
      "created_utc": 1725269308.0,
      "score": 14,
      "context": [
        {
          "id": "ll3mnfx",
          "author": "kiochikaeke",
          "body": "I don't know man, I've known several persons who consider themselves very picky eaters, I've not known anyone else irl who cried in front of her gf while trying to eat the dinner she made or takes months of time and exposure therapy for them to eat a new food that's just an slightly modified version of a food they already like, or that had puked so many times that they control their gag reflex, or that had cried in the bathroom while trying to eat food when they were 10 y/o because they don't want to make their parents expend and work more because of them. I think it *may* be slightly more serious than just a case of being picky.\n\nI don't know if anyone reading this reads manga or watches anime, I don't do so that much but the first few chapters of Tokyo Ghoul the protagonist had to struggle with the fact that, due to him becoming a ghoul, all food had become disgusting except for raw meat, there was a scene when he just scrambled around his kitchen eating everything and puking everytime something entered his mouth, the fact that I related so much with that scene and later when he cried once he discovered he could also drink coffee taught me a bit about myself.",
          "created_utc": 1725252099.0
        }
      ]
    },
    {
      "id": "mi7b7za",
      "author": "Expensive-Ad5780",
      "body": "Thank you for this sometimes I belittle myself and i become my own bully, probably because we've all heard one or more version of the comments shown here.",
      "created_utc": 1742181651.0,
      "score": 1,
      "context": [
        {
          "id": "ll3mnfx",
          "author": "kiochikaeke",
          "body": "I don't know man, I've known several persons who consider themselves very picky eaters, I've not known anyone else irl who cried in front of her gf while trying to eat the dinner she made or takes months of time and exposure therapy for them to eat a new food that's just an slightly modified version of a food they already like, or that had puked so many times that they control their gag reflex, or that had cried in the bathroom while trying to eat food when they were 10 y/o because they don't want to make their parents expend and work more because of them. I think it *may* be slightly more serious than just a case of being picky.\n\nI don't know if anyone reading this reads manga or watches anime, I don't do so that much but the first few chapters of Tokyo Ghoul the protagonist had to struggle with the fact that, due to him becoming a ghoul, all food had become disgusting except for raw meat, there was a scene when he just scrambled around his kitchen eating everything and puking everytime something entered his mouth, the fact that I related so much with that scene and later when he cried once he discovered he could also drink coffee taught me a bit about myself.",
          "created_utc": 1725252099.0
        }
      ]
    },
    {
      "id": "ll6klfi",
      "author": "cunt_tree",
      "body": "On this sub because my partner has ARFID. I used to say “I would never date a picky eater” because food has always been a big part of my life (and continues to be because I’m vegan now). Then I met my partner and what do you know, it actually doesn’t matter that he’s a “picky eater” (obviously ik it’s more than that now) because I love him! So don’t give up hope. Some of us are raised to believe food is a major connection point and it takes meeting someone who you can’t connect with in that way to realize it isn’t as big of a deal as so many people think. Now, if they’re mean about it fuck them. But I’m sure you’ll find someone supportive of you one day!",
      "created_utc": 1725300791.0,
      "score": 5,
      "context": [
        {
          "id": "ll3n3qd",
          "author": "anilucy",
          "body": "As someone who is genuinely terrified to date men bc of this topic and how negatively society views “picky eaters” I absolutely hate this. I wish nothing but the worst for people who make fun of others with this ED and I hope they never reproduce and become parents.",
          "created_utc": 1725252337.0
        }
      ]
    },
    {
      "id": "llc01yj",
      "author": "ControlOk8832",
      "body": "Same. My parents keep telling me girls won’t like me cuz of my ARFID",
      "created_utc": 1725383273.0,
      "score": 1,
      "context": [
        {
          "id": "ll3n3qd",
          "author": "anilucy",
          "body": "As someone who is genuinely terrified to date men bc of this topic and how negatively society views “picky eaters” I absolutely hate this. I wish nothing but the worst for people who make fun of others with this ED and I hope they never reproduce and become parents.",
          "created_utc": 1725252337.0
        }
      ]
    },
    {
      "id": "ll57sfl",
      "author": "None",
      "body": "Yep. Their behavior was so sickening, I had to expose them. It’s like they seem to get enjoyment out of hating us.",
      "created_utc": 1725284411.0,
      "score": 5,
      "context": [
        {
          "id": "ll3pvoz",
          "author": "Ok-Committee-5867",
          "body": "“Why don’t you talk about your disorder?” OH idk cause there’s people like this out there who even after seeing so much testimony and learning about the struggles we have (scrolling through the dedicated ARFID subreddit) , will STILL judge us and question the legitimacy of our issues. \nIt is absolutely absurd and I feel so angry at posts like that. \nI do not get how you can just brush off a whole group of people because you “overcame picky eating”. \n\nNot to mention how creepy it sounds for someone to scroll through a subreddit such as /ARFID and just be reading posts and thinking, “this is such bs”. Why put so much effort into hating on us? I do not understand.",
          "created_utc": 1725253826.0
        }
      ]
    },
    {
      "id": "ll45bax",
      "author": "None",
      "body": "This is my situation exactly. It is strictly texture (although strong, clashing flavors can have the same effect). I have an extreme, physical reaction that I can’t hide and people think that I am putting on a show to make them feel badly about their food. My mother even threatened to spank me for frowning, vomiting in my mouth, and having to catch my breath with tears and sweat running down my face as she screamed “Lord have mercy! How dare you pretend my food is that bad. You are nothing but the Devil!”",
      "created_utc": 1725263236.0,
      "score": 7,
      "context": [
        {
          "id": "ll3sewh",
          "author": "milkywaywishes420",
          "body": "People never seem to know how to respond to me when I tell them that my ARFID makes me straight-up vomit if I eat an unsafe food. Not gag, not feel nauseous, I will outright throw up before I can even swallow the food. Sometimes, on days where I’m struggling more with texture, it even can happen with safe foods. This even happens when the food tastes good to me; it’s entirely texture-based, and my reaction is physical and extreme. I’ve tried many foods I’ve LOVED the flavour of, but threw up trying to eat. I know it isn’t this way for everyone, but it sure shuts people up for me.\n\nIn any case, it’s bizarre to me that people are this bothered by what’s already a humiliating and debilitating condition, especially considering the fact that it’s more recently-recognized and so some treatments are still in the earlier stages. Food is a staple of life, necessary for our survival, and also has a huge social aspect to it; why would anybody choose to live like this on purpose? I’ve never in my life met anyone else with ARFID who wouldn’t rather be able to eat normally.",
          "created_utc": 1725255243.0
        }
      ]
    },
    {
      "id": "ll5cio7",
      "author": "None",
      "body": "Agreed. I fucking hate fakedisordercringe with a passion. Like can’t they just mind their own fucking business instead of jumping to conclusions all the time?!",
      "created_utc": 1725286147.0,
      "score": 5,
      "context": [
        {
          "id": "ll4txrq",
          "author": "arachnids-bakery",
          "body": "\"Grown adults with an *EATING DISORDER* are such an interesting breed of people\" ffs, this is straight up r/fakedisordercringe shit",
          "created_utc": 1725278632.0
        }
      ]
    },
    {
      "id": "ll5bs94",
      "author": "None",
      "body": "I wouldn’t necessarily say we “fake” other disorders for attention or any of that shit. We’ll just get the same negative reaction because we are weird to them.\n\nPersonally I find it impossible to fake a disorder without giving it away at one point.",
      "created_utc": 1725285883.0,
      "score": 2,
      "context": [
        {
          "id": "ll4akoj",
          "author": "rin-dragon",
          "body": "why do ppl think we want to have this? there are all kinds of disorders ppl can fake for attention, money, or sympathy. arfid is not one of them 💀 most ppl dont know what it is and those who do equate it with childish picky eating. theres rly no benefit to having arfid lmao",
          "created_utc": 1725266812.0
        }
      ]
    },
    {
      "id": "ll5a8je",
      "author": "None",
      "body": "Exactly. That’s why I hate when people talk poorly of self diagnosis, because most of them don’t have a fucking clue what our lives are like. Some of us are poor so we can’t afford proper diagnosis, some of us take a far longer time to actually get diagnosed because we’re not white cis men. The list goes on.",
      "created_utc": 1725285321.0,
      "score": 3,
      "context": [
        {
          "id": "ll44qsz",
          "author": "Desert_Fairy",
          "body": "Sadly, I think that like most mental disorders, it is a spectrum. \n\nI think everyone has food fears to a certain extent. They just consider them preferences. \n\nBut you don’t see a lot of people willing to eat crickets in the US for instance. \n\nThe disorder is that it applies to so many foods that it affects your daily life. \n\nPeople who say “wanting to be organized isn’t OCD” don’t really understand that hyper focus on managing anything is an OCD Behavior, but because it is a useful display of it, it can’t be a disorder.  Then just ignoring the suffering of someone who spends so much time worrying that something isn’t perfect that they can’t sleep for the anxiety. \n\nGatekeeping mental disorders really bugs me.",
          "created_utc": 1725262851.0
        }
      ]
    },
    {
      "id": "ll5bcgl",
      "author": "Strange_Warning_8338",
      "body": "meat gives me the most issues too. the other day someone told me to be careful not eating meat because their sister had a lot of medical issues from being vegetarian. sir im struggling to eat in general, this aint a humble choice to save the animals",
      "created_utc": 1725285725.0,
      "score": 3,
      "context": [
        {
          "id": "ll3uip1",
          "author": "Quantum_Aurora",
          "body": "It's really funny to me since I have ARFID and chicken (including chicken nuggets) isn't a food I like or am willing to eat at the moment.\n\nI'll eat a ton of other things tho with all sorts of veggies. It's just meat that gives me the most trouble.",
          "created_utc": 1725256458.0
        }
      ]
    },
    {
      "id": "ll7gi0o",
      "author": "None",
      "body": "I think that it is because society is ridiculous and they deem certain foods as “children’s foods” and others as “adult foods” and we don’t really place ourselves in those categories. Eating slimy foods or foods with weird textures has been unfairly deemed as an “adult” thing and anyone who is not eating this is called immature.",
      "created_utc": 1725311574.0,
      "score": 2,
      "context": [
        {
          "id": "ll4q2a6",
          "author": "CaptainGigsy",
          "body": "I'll never understand why ARFID makes people so genuinely furious. It's an entirely personal disorder and us having it does not affect them in any way.",
          "created_utc": 1725276704.0
        }
      ]
    },
    {
      "id": "ll5cuv0",
      "author": "None",
      "body": "Spoilers: they lost big time",
      "created_utc": 1725286268.0,
      "score": 3,
      "context": [
        {
          "id": "ll4uw6g",
          "author": "thecxsmonaut",
          "body": "Red Scare listeners try not to be the most insufferable terminally online shit scum you've ever met challenge",
          "created_utc": 1725279086.0
        }
      ]
    },
    {
      "id": "ll677o8",
      "author": "None",
      "body": "Same",
      "created_utc": 1725296375.0,
      "score": 2,
      "context": [
        {
          "id": "ll5z7zh",
          "author": "KennaLikesPizza",
          "body": "I'm more likely to snap OOP's neck than \"snap out of\" ARFID",
          "created_utc": 1725293762.0
        }
      ]
    },
    {
      "id": "ll7cuer",
      "author": "AlethWrites",
      "body": "I think there's a weird middle ground between the two groups, people who have little interest in eating and only eat a limited group of foods. \n\nTo me it's a whole thing to convince myself to eat some days, even if I can feel the actual hunger. I can eat so, I am not underweight (also my metabolism sucks lmao) but, it is hard still. \n\nI hope this makes sense though, I have been dealing with a new flare up of ARFID and I am still figuring things out. It's not like it disappeared, but I was doing pretty well, having a balanced diet mostly, and boom. So, even myself I am confused af.",
      "created_utc": 1725310331.0,
      "score": 3,
      "context": [
        {
          "id": "ll6mpgv",
          "author": "Prometheus-is-vulcan",
          "body": "As far as I saw here, there are two somewhat distinct categories of ppl with ARFID. \n\n1. Problem with eating at all, disgusted by any food, throws up because of eating, underweight, some barely alive. \n\n2. Health appetite, wants to eat, is limited to certain foods. Throws up because of imagining eating certain foods. Some are overweight, as they can only eat non-filling, high calorie food.\n\n\nBoth suffer. Both deserve our sympathy. \n\nBut as soon as its about \"I can eat it, I just don't like it\", its not ARFID. \n\nI am group 2, and I dont like 75% of the food I eat, but I need that variety (also important to not loose safe foods).",
          "created_utc": 1725301501.0
        }
      ]
    },
    {
      "id": "ll76v7i",
      "author": "None",
      "body": "This.\n\nI am in group 2. Getting away from family members, I was able to find out that I do like a lot of fruits and vegetables, but those things just have to be “dry”. I lost a lot of weight after discovering this. Family and friends contribute greatly to ARFID problems by only offering foods the way that they like it and then concluding that, if you don’t like it prepared their way, then you don’t like it at all.",
      "created_utc": 1725308326.0,
      "score": 1,
      "context": [
        {
          "id": "ll6mpgv",
          "author": "Prometheus-is-vulcan",
          "body": "As far as I saw here, there are two somewhat distinct categories of ppl with ARFID. \n\n1. Problem with eating at all, disgusted by any food, throws up because of eating, underweight, some barely alive. \n\n2. Health appetite, wants to eat, is limited to certain foods. Throws up because of imagining eating certain foods. Some are overweight, as they can only eat non-filling, high calorie food.\n\n\nBoth suffer. Both deserve our sympathy. \n\nBut as soon as its about \"I can eat it, I just don't like it\", its not ARFID. \n\nI am group 2, and I dont like 75% of the food I eat, but I need that variety (also important to not loose safe foods).",
          "created_utc": 1725301501.0
        }
      ]
    },
    {
      "id": "lqqnhp0",
      "author": "Rainyli",
      "body": "There are three recognized categories of ARFID: sensory sensitivity, fear of adverse consequences, and lack of interest. You can have any combination of the three or just one 💕 /info /nm",
      "created_utc": 1728282095.0,
      "score": 1,
      "context": [
        {
          "id": "ll6mpgv",
          "author": "Prometheus-is-vulcan",
          "body": "As far as I saw here, there are two somewhat distinct categories of ppl with ARFID. \n\n1. Problem with eating at all, disgusted by any food, throws up because of eating, underweight, some barely alive. \n\n2. Health appetite, wants to eat, is limited to certain foods. Throws up because of imagining eating certain foods. Some are overweight, as they can only eat non-filling, high calorie food.\n\n\nBoth suffer. Both deserve our sympathy. \n\nBut as soon as its about \"I can eat it, I just don't like it\", its not ARFID. \n\nI am group 2, and I dont like 75% of the food I eat, but I need that variety (also important to not loose safe foods).",
          "created_utc": 1725301501.0
        }
      ]
    },
    {
      "id": "ll3srni",
      "author": "Galaxy_Kiddo",
      "body": "What are you talking about? In the outside world is worst. My whole family is like that, my teachers were like that, everyone except my friends act like that... They think that I choose to be like this and struggle with food, that I don't need medical help and that I'm just a brat picky eater that don't put any effort in eat variations of food. My cousin even have blocked my access to the wifi as a punishment for don't eat anything else (even when I'm a freelance artist and I need internet to work)",
      "created_utc": 1725255442.0,
      "score": 15,
      "context": [
        {
          "id": "ll3i6aa",
          "author": "None",
          "body": "Luckily, these people are chronically online, so we won't have to worry about people like this in the real world. It makes me upset, but also is funny hearing people who haven't struggled a day in their life ramble about how other peoples problems are fake because they don't understand it. So childish.",
          "created_utc": 1725249814.0
        }
      ]
    },
    {
      "id": "ll3vq4p",
      "author": "ControlOk8832",
      "body": "It’s worse in the outside world. We gotta deal with coworkers AND family members who don’t know what they’re talking about but still decide to talk anyway. At least with the internet you can block people",
      "created_utc": 1725257178.0,
      "score": 6,
      "context": [
        {
          "id": "ll3i6aa",
          "author": "None",
          "body": "Luckily, these people are chronically online, so we won't have to worry about people like this in the real world. It makes me upset, but also is funny hearing people who haven't struggled a day in their life ramble about how other peoples problems are fake because they don't understand it. So childish.",
          "created_utc": 1725249814.0
        }
      ]
    },
    {
      "id": "ll5d4d9",
      "author": "None",
      "body": "Yeah, especially when it’s “junk food”",
      "created_utc": 1725286364.0,
      "score": 3,
      "context": [
        {
          "id": "ll4yk6y",
          "author": "knlight",
          "body": "This kind of thing used to upset me but now I really don't care. It's almost funny that it bothers people so much that some people have a limited diet.",
          "created_utc": 1725280744.0
        }
      ]
    },
    {
      "id": "ll7b3c6",
      "author": "None",
      "body": "Yes and they refuse to see the obvious: most “junk foods” have a consistent texture. People who prepare vegetables constantly get hung up on “making it just the way that Granny did” with all kinds of sauces, cooked at varying temperatures, etc. and then get mad when the person can’t eat it. I have always liked corn, but the moment that I said I liked it, people started pouring sauces on it, making creamed corn, and refused to actually just cook corn because “that’s dry”.",
      "created_utc": 1725309743.0,
      "score": 2,
      "context": [
        {
          "id": "ll626mf",
          "author": "whitefuton",
          "body": "The comment that’s most frustrating to me is the one that’s criticizing the girl on instagram who’s trying new foods but has “junk food” safe foods. It’s upsetting bc like shes trying to take steps towards recovery and doing better with it but it’s apparently still not good enough for them. \n\nPeople suck.",
          "created_utc": 1725294732.0
        }
      ]
    },
    {
      "id": "ll5e5ka",
      "author": "None",
      "body": "That’s how I feel. I wouldn’t touch most veggies because they make me gag and they smell awful. The people who question how I behave assume I’m only eating “junk” food.\n\nSo what if I am? Just because you don’t like it doesn’t make it “junk”, food is still food, no matter how “unhealthy” you think it is.",
      "created_utc": 1725286736.0,
      "score": 2,
      "context": [
        {
          "id": "ll5azhb",
          "author": "ScaryBoyRobots",
          "body": "One of the things I have always wanted most in my life is the ability to eat anything and try new foods. Going into a produce section fascinates me because all the colorful fruits and veggies look so beautiful to me — but my brain doesn’t even register them as real food. Trying to eat any of them gives me the same reaction as someone scooping lawn clippings, holly berries and poison ivy into a bowl and telling me to wolf it down. Would any of these people eat that? No, of course not, and they would have a panic response even trying to do so, because every instinct they have would be screaming that it’s not safe and those are not edible. That it’s dangerous and they’ll be sick, if not die. Except my brain does that with 98% of foods. And it makes me miserable. I don’t want to have a panic attack when facing down non-safe foods. I don’t like gagging and choking and throwing up. I wish foods smelled and tasted good to me, that they didn’t process in my head the same way dog shit does. I’ve just learned to live with it, because I can’t get another brain that works right, I’m stuck with this broken one for my whole life. And frankly, it’s not their business what groceries or meals I buy with the money I earn at my job. It’s not theirs to have an opinion on.",
          "created_utc": 1725285593.0
        }
      ]
    },
    {
      "id": "ll7d0mu",
      "author": "None",
      "body": "This.\n\nThis is what happens to be with textures. A salad with lettuce, broccoli, and maybe a little parmesan cheese sounds great, but the moment that someone adds a certain amount of dressing and cucumbers, it is no longer a food. If I try to eat it, I might as well have tried to eat a plastic fork.",
      "created_utc": 1725310390.0,
      "score": 2,
      "context": [
        {
          "id": "ll5azhb",
          "author": "ScaryBoyRobots",
          "body": "One of the things I have always wanted most in my life is the ability to eat anything and try new foods. Going into a produce section fascinates me because all the colorful fruits and veggies look so beautiful to me — but my brain doesn’t even register them as real food. Trying to eat any of them gives me the same reaction as someone scooping lawn clippings, holly berries and poison ivy into a bowl and telling me to wolf it down. Would any of these people eat that? No, of course not, and they would have a panic response even trying to do so, because every instinct they have would be screaming that it’s not safe and those are not edible. That it’s dangerous and they’ll be sick, if not die. Except my brain does that with 98% of foods. And it makes me miserable. I don’t want to have a panic attack when facing down non-safe foods. I don’t like gagging and choking and throwing up. I wish foods smelled and tasted good to me, that they didn’t process in my head the same way dog shit does. I’ve just learned to live with it, because I can’t get another brain that works right, I’m stuck with this broken one for my whole life. And frankly, it’s not their business what groceries or meals I buy with the money I earn at my job. It’s not theirs to have an opinion on.",
          "created_utc": 1725285593.0
        }
      ]
    },
    {
      "id": "ll7clos",
      "author": "None",
      "body": "Yes. Also, some of us are already too traumatized from foods being forced as kids, so we want to just enjoy life as an adult eating our simple foods.",
      "created_utc": 1725310249.0,
      "score": 1,
      "context": [
        {
          "id": "ll5bg8y",
          "author": "ADHDRatBoy",
          "body": "These comments are just plain hurtful. Like, no wonder it's rarely talked about irl. \n\nAlso do they not realise that there's like... no help for adults with ARFID unless they wanna pay thousands of pounds to go private? So much more help for kids - which is great, don't get me wrong - but then we're all stuck by the wayside. It sucks. \n\nAnd unfortunately guys I've dated have cut me off or even become abusive due to my eating habits. Thankfully I can now stand up for myself and know how to self-advocate.",
          "created_utc": 1725285763.0
        }
      ]
    },
    {
      "id": "ll7c7t7",
      "author": "None",
      "body": "Yes! Why is simple food bad? I have ordered a simple salad and people were mad that I ate it without dressing. Why does every food have to be complex or someone has a problem with it?",
      "created_utc": 1725310121.0,
      "score": 1,
      "context": [
        {
          "id": "ll5uoq2",
          "author": "throwawaycatfinder",
          "body": "One thing I REALLY don't understand is how people are so mad about what OTHER people are eating. Like how does it affect you that somebody else is eating simple, palatable food? Why are you going ape shit because your friend decided to order fries at a restaurant? I absolutely do NOT understand one thing about what they're so mad about",
          "created_utc": 1725292272.0
        }
      ]
    },
    {
      "id": "ll7buv6",
      "author": "None",
      "body": "I am creative and because I have been subjected to so much emotional abuse regarding my eating, if I was forced to cook and eat a non-safe food, I would probably burn it so that the texture changed and was solid or place it between two big pieces of bread so that I don’t experience the texture, etc. But my question is that why are we expected to go through so many extremes to eat what other people want us to eat while they are permitted to enjoy foods and we are not?",
      "created_utc": 1725310001.0,
      "score": 1,
      "context": [
        {
          "id": "ll5x3ja",
          "author": "Dull-Touch283",
          "body": "This is so frustrating. I legitimately have had this disorder since I started eating solid food as a baby. Eating something other than the same few things I’ve eaten since I was a toddler brings me such intense anxiety to the point of tears and vomiting, like an actual phobia. If I had to eat something outside of my safe food range to survive, I would starve. I don’t understand how you can hear experiences like that and doubt the legitimacy of the disorder. Not to mention, with any disorder there will be varying ranges of severity, those who are farther along in recovery are probably more comfortable talking about their stories publicly.",
          "created_utc": 1725293063.0
        }
      ]
    },
    {
      "id": "ll7a9qh",
      "author": "None",
      "body": "Exactly. There is also a hatred toward those of us who don’t want therapy for it. I grew up in a family in which my family tied a lot of their self-worth to how much someone liked their food and also a family in which a lot of people didn’t eat well as toddlers but developed a voracious appetite as school-aged children and ate everything in sight.\n\nThe fact that a lot of slimy foods and inconsistent textures are staples in my culture made eating a nightmare for me. I feared every meal and was forced to eat something that nearly made me gag at every meal. A few times, I vomited in my mouth and was forced to swallow it. There were times when my mother was in a good mood and she would let me have my safe foods, but other times, she was intent on making me eat what she wanted until I was sick. She would even sabotage my safe foods by covering it in something that she knew I didn’t like or lie to me and tell me that she cooked a safe food (if it had a similar smell) and them suddenly push a plate of revolting food in front of me and say “see, X is almost like Y (safe food)” and immediately yell and threaten to spank me if I couldn’t eat it.\n\nEven as an adult, I was subjected to her games with foods and she kept sabotaging any chance that I had to move out. She also took it personally and said “you act like I can’t cook because you won’t eat anything” while still ignoring that she mostly cooked slimy foods or foods with inconsistent textures.\n\nAfter years, I was able to move out and found that I do like more foods that I thought, but she was constantly covering everything with sauces and making it unreasonably slimy. If she didn’t have a sauce, she would put ketchup and water on something just to make it slimy. I still have to avoid quite a few foods, but there are enough that I can eat to remain healthy.\n\nI feel like my whole life was constantly introducing foods and being forced in the same way that therapy would be and it didn’t help. I would now rather be left alone and not judged for not wanting to gag in therapy for the rest of my life.",
      "created_utc": 1725309469.0,
      "score": 1,
      "context": [
        {
          "id": "ll64zmg",
          "author": "beomint",
          "body": "Note: This comment is mostly expressing my feelings about these types of anti-science people, and is hopefully meant to give insight to those who genuinely think ARFID isn't real. TW for speaking about vomiting  \n  \nI think it's funny they literally explained it perfectly themselves then somehow got turned around and forgot their own explanation.\n\nIt's literally just what they said. Kids who are \"picky eaters\" eventually snap out of it. If we could snap out of it, we 100% would. Not a single person who has ARFID has it on their own free will. If someone is genuinely just a \"picky eater\", they eventually get bored and move on JUST like this person said. So if it's still going on into adulthood, certainly there's a fucking issue, no?\n\nI feel like people have this idea that people with ARFID just sit around all day content with their diet and counting down the days until we get scurvy so we can throw a party or something. That's not how it works at all, and many of us actively work with doctors and therapists to fight these issues and try to adjust our diet in a way that ensures we get all of our dietary needs. Just because we're not comfortable going out of our comfort zone at any given moment on your whim doesn't mean we aren't going out of our comfort zone regularly on our own time. Not recognizing that is the equivalent of shoving somebody who can't swim into a pool and saying \"eh, they have to learn somehow\". Instead of helping them step out of that comfort zone, you violently shoved them out and broke their trust and then get mad when it somehow didn't work.\n\nPeople act like I haven't actively tried new foods and haven't actively gagged and vomited on the texture/taste, they act like it's some childish tantrum instead of a real physical response to a food the mind deems unacceptable. I've almost choked on my own vomit trying to force down new foods. And the whole time my brain is screaming \"It's good! It's fine!! It's good food stop being like this!!\" but I can't stop my body's response.\n\nI went years not knowing what the hell was wrong with me, breaking down and crying over my body's stupid inability to just eat certain foods that everybody knows are good and safe. It broke me before I even had the word to describe what was happening and how to fix it. (I had been TRYING to fix it for years, but nothing I did allowed me to \"snap out of it\")\n\nSurprise surprise, being diagnosed with ARFID and doing therapy specific to ARFID ACTUALLY HELPED ME OPEN UP MY PALETTE MORE THAN JUST \"TRYING TO GET OVER IT\" MYSELF. I swear, these people don't actually want anyone to heal. They just want to make people feel bad so they can make fun of them while they watch us fail. It's a cruel sick joke. They take away our support so we get worse then get confused why we aren't getting any better.",
          "created_utc": 1725295653.0
        }
      ]
    },
    {
      "id": "ll5b3pr",
      "author": "None",
      "body": "I wanted to censor them out because I didn’t want unnecessary trolls to come here and go “how dare you attack my friend, I will make fun of you in redscarepod again”.",
      "created_utc": 1725285637.0,
      "score": 3,
      "context": [
        {
          "id": "ll4d7jn",
          "author": "Gullible_Educator122",
          "body": "Don’t be shy, drop the usernames :)",
          "created_utc": 1725268607.0
        }
      ]
    },
    {
      "id": "ll66v2s",
      "author": "None",
      "body": "Why do you want to know their usernames? I just don’t want any trolls. And I’m not a bro either.",
      "created_utc": 1725296261.0,
      "score": 1,
      "context": [
        {
          "id": "ll5uxa5",
          "author": "imdestroylonely",
          "body": "don’t be shy bro post the names uncovered😇😇😇please im begging u to at least send em to me",
          "created_utc": 1725292350.0
        }
      ]
    },
    {
      "id": "llde9eu",
      "author": "unoriginalname127",
      "body": "pretty much. it's basically the \"everything is a disorder now\" shit, which is just people not liking the fact their hatred towards some groups of people might now be opposed and is in fact irrational. they want to hate people who don't fit their standard of \"normal\". they want to tell them they should change (to be \"normal\") when change that deep might not be easy to do. couple that with the fact modern psychology is very young and changing rapidly (similar to how copernicus was persecuted for his discoveries about space, which some consider the start of modern astronomy), anti-intellectualism and the whole \"old was better, new is bad\" mentality",
      "created_utc": 1725399310.0,
      "score": 2,
      "context": [
        {
          "id": "llb459d",
          "author": "Rinny-ThePooh",
          "body": "All I’m seeing is a bunch of non doctors talking about how they don’t believe a medical diagnosis",
          "created_utc": 1725372843.0
        }
      ]
    },
    {
      "id": "n3qmort",
      "author": "diegoasecas",
      "body": "big words from someone who gets anxiety from eating other than their SaFe FoOdS",
      "created_utc": 1752802067.0,
      "score": 1,
      "context": [
        {
          "id": "n34r3d9",
          "author": "Alfombra_",
          "body": "to the first person: fuck you. just, fuck you dude.",
          "created_utc": 1752521619.0
        }
      ]
    },
    {
      "id": "ll5hzbr",
      "author": "goldfishmuncher",
      "body": "ive cried before because every time i work up the courage to try a new food my brain convinces me it tastes bad, i'll legit be there like \"do i actually hate this? or does my brain just want me to hate this?\" and to avoid it i just go back to my safe foods.",
      "created_utc": 1725288054.0,
      "score": 52,
      "context": [
        {
          "id": "ll37sij",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1725245102.0
        },
        {
          "id": "ll43hql",
          "author": "mermaidreefer",
          "body": "they act like we don't WANT to like other foods",
          "created_utc": 1725262014.0
        }
      ]
    },
    {
      "id": "ll6tlej",
      "author": "HezaLeNormandy",
      "body": "Seriously. What I wouldn’t give to be able to choke down a healthy meal and not gag",
      "created_utc": 1725303825.0,
      "score": 18,
      "context": [
        {
          "id": "ll37sij",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1725245102.0
        },
        {
          "id": "ll43hql",
          "author": "mermaidreefer",
          "body": "they act like we don't WANT to like other foods",
          "created_utc": 1725262014.0
        }
      ]
    },
    {
      "id": "ll9gzsq",
      "author": "Canned-strawberries",
      "body": "yeah. I don’t choose to silently cry in a restaurant trying to avoid attention because something i can’t eat wasn’t listen on the menu for the item i got. I don’t choose to not eat for days at a time because i don’t have access to anything that sounds good!!!!",
      "created_utc": 1725341074.0,
      "score": 7,
      "context": [
        {
          "id": "ll37sij",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1725245102.0
        },
        {
          "id": "ll43hql",
          "author": "mermaidreefer",
          "body": "they act like we don't WANT to like other foods",
          "created_utc": 1725262014.0
        }
      ]
    },
    {
      "id": "ll4bjcw",
      "author": "alicyjka",
      "body": "This. I have such anxiety when it comes to eating in front of others. It’s like I’m always anticipating the humiliation.",
      "created_utc": 1725267463.0,
      "score": 39,
      "context": [
        {
          "id": "ll383u1",
          "author": "Defiant_Grab_5364",
          "body": "This is why I never tell people I have ARFID",
          "created_utc": 1725245239.0
        },
        {
          "id": "ll3ufzb",
          "author": "notceitn",
          "body": "💯 I even try not to eat in front of people because I'm afraid I'll get comments like this because my food is \"too plain\"... seriously fuck people like those in the post",
          "created_utc": 1725256414.0
        }
      ]
    },
    {
      "id": "ll43wlp",
      "author": "None",
      "body": "I never understood calling something plain just because it is not covered in something that is slimy, gummy, or sticky.",
      "created_utc": 1725262289.0,
      "score": 36,
      "context": [
        {
          "id": "ll383u1",
          "author": "Defiant_Grab_5364",
          "body": "This is why I never tell people I have ARFID",
          "created_utc": 1725245239.0
        },
        {
          "id": "ll3ufzb",
          "author": "notceitn",
          "body": "💯 I even try not to eat in front of people because I'm afraid I'll get comments like this because my food is \"too plain\"... seriously fuck people like those in the post",
          "created_utc": 1725256414.0
        }
      ]
    },
    {
      "id": "ll523pn",
      "author": "1986toyotacorolla2",
      "body": "Yes this. I currently have a very safe partner at work and he's really chill about my food habits but the one guy keeps saying things about my plain bagels ugh. It's not that I don't like cream cheese though in this case. It's just that I don't trust it to stay cold on my lunch box in the 90 degree heat.",
      "created_utc": 1725282207.0,
      "score": 11,
      "context": [
        {
          "id": "ll383u1",
          "author": "Defiant_Grab_5364",
          "body": "This is why I never tell people I have ARFID",
          "created_utc": 1725245239.0
        },
        {
          "id": "ll3ufzb",
          "author": "notceitn",
          "body": "💯 I even try not to eat in front of people because I'm afraid I'll get comments like this because my food is \"too plain\"... seriously fuck people like those in the post",
          "created_utc": 1725256414.0
        }
      ]
    },
    {
      "id": "ll8nwam",
      "author": "Big-Formal408",
      "body": "I voluntarily chose to have lunch detention everyday in middle school because there were always less people in there than the cafeteria and even sometimes no one else so it felt like the only safe place I could eat in peace. I’m in my mid 20s now and I still don’t eat in front of anyone or go out to eat unless it’s with my family or very close friends who know I have ARFID",
      "created_utc": 1725327772.0,
      "score": 3,
      "context": [
        {
          "id": "ll383u1",
          "author": "Defiant_Grab_5364",
          "body": "This is why I never tell people I have ARFID",
          "created_utc": 1725245239.0
        },
        {
          "id": "ll3ufzb",
          "author": "notceitn",
          "body": "💯 I even try not to eat in front of people because I'm afraid I'll get comments like this because my food is \"too plain\"... seriously fuck people like those in the post",
          "created_utc": 1725256414.0
        }
      ]
    },
    {
      "id": "ll4dmcu",
      "author": "Gullible_Educator122",
      "body": "As a kid I refused to eat pizza, hot dogs with the bun, hamburgers with the bun, the coating on chicken nuggets, any fizzy sodas and alot of foods that kids generally enjoy and that’s something that really stands out now. But I wasn’t a picky eater as a really little kid either! I ate lots of fruits, meat and fish, etc. \n\nAs an adult, I now love pizza, burgers and hot dogs but the ARFID kind of worsened with age with other foods. I guess we are just born with sensory processing issues sometimes.",
      "created_utc": 1725268895.0,
      "score": 16,
      "context": [
        {
          "id": "ll3iwb4",
          "author": "None",
          "body": "Wtf is wrong with these people? Do they realise there’s different types of ARFID too? Like I have no issue with smell or texture of food but a fear of choking/aspirating like yeah I’m totally avoiding every single food and living on ensures and milkshakes just for the fun of it. It’s completely destroyed my quality of life. \n\nI LOVED food. I still do but I’m terrified to eat it. Even as a baby I used to eat Brussel sprouts and broccoli! These people are ignorant and haven’t even researched ARFID.\n\nI remember reading an article on ARFID vs Picky Eating and the author said ‘Even a picky eater will find something to eat eventually but an ARFID suffer will STARVE themselves possibly to death if their safe foods aren’t available’ that’s the difference.",
          "created_utc": 1725250175.0
        },
        {
          "id": "ll462bb",
          "author": "Old-Display-6796",
          "body": "This.  \nAs a kid someone once told me that the pioneers had to sometimes eat grasshoppers to survive. (No idea if that was true,lol) \nI remember knowing for a fact that if that were to ever happen again, I would be one of the first to die of starvation because there is no way I could ever eat a grasshopper, even if it meant death. \nI still feel just as certain of that. \n\nI also could never eat 95% of foods with sauce, or something slimy, or….a pickle or a chicken wing, or non-Kraft Mac and cheese. I get that sounds absurd to many people, but that is how my brain is wired.",
          "created_utc": 1725263748.0
        }
      ]
    },
    {
      "id": "ll4sa5j",
      "author": "BobbiPinstripes",
      "body": "Ding ding ding! The mental and emotional immaturity on full display with those haters. Stop complaining that other people have an eating disorder which you haven’t even attempted to research and get some therapy!! Is what I would say to those kind of people if I ever wanted to engage. But I don’t because they’re rude and stunted and unhealthy to be around.",
      "created_utc": 1725277833.0,
      "score": 30,
      "context": [
        {
          "id": "ll38dzx",
          "author": "crypticcos",
          "body": "Imagine hating on an entire mental disorder. \n\nARFID or not why does it genuinely infuriate these people what others feed their flesh prisons? Just mind your business",
          "created_utc": 1725245361.0
        },
        {
          "id": "ll43zgj",
          "author": "None",
          "body": "They don’t realize that obsessing over someone’s food choices likely means that they have a mental illness.",
          "created_utc": 1725262343.0
        }
      ]
    },
    {
      "id": "ll6ksxl",
      "author": "am9qb3JlZmVyZW5jZQ",
      "body": "Worse, they're just assholes. Can't cure that!",
      "created_utc": 1725300860.0,
      "score": 3,
      "context": [
        {
          "id": "ll38dzx",
          "author": "crypticcos",
          "body": "Imagine hating on an entire mental disorder. \n\nARFID or not why does it genuinely infuriate these people what others feed their flesh prisons? Just mind your business",
          "created_utc": 1725245361.0
        },
        {
          "id": "ll43zgj",
          "author": "None",
          "body": "They don’t realize that obsessing over someone’s food choices likely means that they have a mental illness.",
          "created_utc": 1725262343.0
        }
      ]
    },
    {
      "id": "ll5vr0t",
      "author": "arachnids-bakery",
      "body": "EXACTLY!! They love to say that people they find \"\"\"cringy\"\"\" are faking disorders, as if reddit gives them a full phd in psychology",
      "created_utc": 1725292623.0,
      "score": 4,
      "context": [
        {
          "id": "ll4txrq",
          "author": "arachnids-bakery",
          "body": "\"Grown adults with an *EATING DISORDER* are such an interesting breed of people\" ffs, this is straight up r/fakedisordercringe shit",
          "created_utc": 1725278632.0
        },
        {
          "id": "ll5cio7",
          "author": "None",
          "body": "Agreed. I fucking hate fakedisordercringe with a passion. Like can’t they just mind their own fucking business instead of jumping to conclusions all the time?!",
          "created_utc": 1725286147.0
        }
      ]
    },
    {
      "id": "ll67czo",
      "author": "rin-dragon",
      "body": "i think i was misunderstood, im not accusing anyone of faking disorders in general, as i dont rly buy into that mindset. but just going by their insane logic to say that even if we were (as they claim we are) then why on earth would we chose arfid of all things and not smt that could at least be \"beneficial\" to fake. like if someone were to fake cancer they could falsely generate sympathy and scam gofundme donations. so im just not sure what these ppl think the supposed benefit of us \"faking\" arfid is, since theyre so insistent that we're just whiny picky eaters.",
      "created_utc": 1725296425.0,
      "score": 3,
      "context": [
        {
          "id": "ll4akoj",
          "author": "rin-dragon",
          "body": "why do ppl think we want to have this? there are all kinds of disorders ppl can fake for attention, money, or sympathy. arfid is not one of them 💀 most ppl dont know what it is and those who do equate it with childish picky eating. theres rly no benefit to having arfid lmao",
          "created_utc": 1725266812.0
        },
        {
          "id": "ll5bs94",
          "author": "None",
          "body": "I wouldn’t necessarily say we “fake” other disorders for attention or any of that shit. We’ll just get the same negative reaction because we are weird to them.\n\nPersonally I find it impossible to fake a disorder without giving it away at one point.",
          "created_utc": 1725285883.0
        }
      ]
    },
    {
      "id": "ll5hu9m",
      "author": "thecxsmonaut",
      "body": "Have you ever noticed that for a \"left wing\" community they sound suspiciously like your conservative uncle?",
      "created_utc": 1725288005.0,
      "score": 4,
      "context": [
        {
          "id": "ll4uw6g",
          "author": "thecxsmonaut",
          "body": "Red Scare listeners try not to be the most insufferable terminally online shit scum you've ever met challenge",
          "created_utc": 1725279086.0
        },
        {
          "id": "ll5cuv0",
          "author": "None",
          "body": "Spoilers: they lost big time",
          "created_utc": 1725286268.0
        }
      ]
    },
    {
      "id": "ll7eas5",
      "author": "Prometheus-is-vulcan",
      "body": "That both groups have a spectrum (this phrase is overused af) is clear for me. Not everyone is extreme, but not being extreme, does not mean not suffering from it.\n\nIf you make a venn diagram, most of group 1 would be inside of group 2, as they, if they eat, also eat very few kinds of food. \n\nMy focus was on the primary struggle.",
      "created_utc": 1725310822.0,
      "score": 2,
      "context": [
        {
          "id": "ll6mpgv",
          "author": "Prometheus-is-vulcan",
          "body": "As far as I saw here, there are two somewhat distinct categories of ppl with ARFID. \n\n1. Problem with eating at all, disgusted by any food, throws up because of eating, underweight, some barely alive. \n\n2. Health appetite, wants to eat, is limited to certain foods. Throws up because of imagining eating certain foods. Some are overweight, as they can only eat non-filling, high calorie food.\n\n\nBoth suffer. Both deserve our sympathy. \n\nBut as soon as its about \"I can eat it, I just don't like it\", its not ARFID. \n\nI am group 2, and I dont like 75% of the food I eat, but I need that variety (also important to not loose safe foods).",
          "created_utc": 1725301501.0
        },
        {
          "id": "ll7cuer",
          "author": "AlethWrites",
          "body": "I think there's a weird middle ground between the two groups, people who have little interest in eating and only eat a limited group of foods. \n\nTo me it's a whole thing to convince myself to eat some days, even if I can feel the actual hunger. I can eat so, I am not underweight (also my metabolism sucks lmao) but, it is hard still. \n\nI hope this makes sense though, I have been dealing with a new flare up of ARFID and I am still figuring things out. It's not like it disappeared, but I was doing pretty well, having a balanced diet mostly, and boom. So, even myself I am confused af.",
          "created_utc": 1725310331.0
        }
      ]
    },
    {
      "id": "ll785o7",
      "author": "Prometheus-is-vulcan",
      "body": "May i ask you what you mean by \"dry\" and what about them triggers it for you?\n\n\n>if you don’t like it prepared their way, then you don’t like it at all.\n\nMy family accepts that I dont eat certain things, but was never really interested in finding out why. Until 2 years ago, I didn't realize I have an ED, and only later found out that ARFID existed. \n\nBut I know your feeling. Just mentioning once that a safe food tastes bad (overcooked, wrong spices, etc) could mean that i will never see it again. The constant thoughts about what can I say about food.",
      "created_utc": 1725308760.0,
      "score": 2,
      "context": [
        {
          "id": "ll6mpgv",
          "author": "Prometheus-is-vulcan",
          "body": "As far as I saw here, there are two somewhat distinct categories of ppl with ARFID. \n\n1. Problem with eating at all, disgusted by any food, throws up because of eating, underweight, some barely alive. \n\n2. Health appetite, wants to eat, is limited to certain foods. Throws up because of imagining eating certain foods. Some are overweight, as they can only eat non-filling, high calorie food.\n\n\nBoth suffer. Both deserve our sympathy. \n\nBut as soon as its about \"I can eat it, I just don't like it\", its not ARFID. \n\nI am group 2, and I dont like 75% of the food I eat, but I need that variety (also important to not loose safe foods).",
          "created_utc": 1725301501.0
        },
        {
          "id": "ll76v7i",
          "author": "None",
          "body": "This.\n\nI am in group 2. Getting away from family members, I was able to find out that I do like a lot of fruits and vegetables, but those things just have to be “dry”. I lost a lot of weight after discovering this. Family and friends contribute greatly to ARFID problems by only offering foods the way that they like it and then concluding that, if you don’t like it prepared their way, then you don’t like it at all.",
          "created_utc": 1725308326.0
        }
      ]
    },
    {
      "id": "ll44ps4",
      "author": "None",
      "body": "Yes. I had two supervisors who basically had a food addiction and made everything about food and then they kept focusing on me NOT eating the slimy, sticky, gummy foods that they liked. Their obsession with watching me during every lunch turned into hatred and they tried to have me fired.",
      "created_utc": 1725262832.0,
      "score": 2,
      "context": [
        {
          "id": "ll3i6aa",
          "author": "None",
          "body": "Luckily, these people are chronically online, so we won't have to worry about people like this in the real world. It makes me upset, but also is funny hearing people who haven't struggled a day in their life ramble about how other peoples problems are fake because they don't understand it. So childish.",
          "created_utc": 1725249814.0
        },
        {
          "id": "ll3srni",
          "author": "Galaxy_Kiddo",
          "body": "What are you talking about? In the outside world is worst. My whole family is like that, my teachers were like that, everyone except my friends act like that... They think that I choose to be like this and struggle with food, that I don't need medical help and that I'm just a brat picky eater that don't put any effort in eat variations of food. My cousin even have blocked my access to the wifi as a punishment for don't eat anything else (even when I'm a freelance artist and I need internet to work)",
          "created_utc": 1725255442.0
        }
      ]
    },
    {
      "id": "llbuube",
      "author": "None",
      "body": "I'm sorry you have to go through that. I'm talking about the weirdos in the image of the post, I know that ARFID isn't understood by most people, and I've had a lot of trauma surrounding people not understanding me as well.",
      "created_utc": 1725381606.0,
      "score": 2,
      "context": [
        {
          "id": "ll3i6aa",
          "author": "None",
          "body": "Luckily, these people are chronically online, so we won't have to worry about people like this in the real world. It makes me upset, but also is funny hearing people who haven't struggled a day in their life ramble about how other peoples problems are fake because they don't understand it. So childish.",
          "created_utc": 1725249814.0
        },
        {
          "id": "ll3srni",
          "author": "Galaxy_Kiddo",
          "body": "What are you talking about? In the outside world is worst. My whole family is like that, my teachers were like that, everyone except my friends act like that... They think that I choose to be like this and struggle with food, that I don't need medical help and that I'm just a brat picky eater that don't put any effort in eat variations of food. My cousin even have blocked my access to the wifi as a punishment for don't eat anything else (even when I'm a freelance artist and I need internet to work)",
          "created_utc": 1725255442.0
        }
      ]
    },
    {
      "id": "llbv6ft",
      "author": "None",
      "body": "Yeah, I know. I've dealt with people not understanding me my whole life as well, and it has led me to some really dark places. I'm just talking about the people in the post.",
      "created_utc": 1725381715.0,
      "score": 2,
      "context": [
        {
          "id": "ll3i6aa",
          "author": "None",
          "body": "Luckily, these people are chronically online, so we won't have to worry about people like this in the real world. It makes me upset, but also is funny hearing people who haven't struggled a day in their life ramble about how other peoples problems are fake because they don't understand it. So childish.",
          "created_utc": 1725249814.0
        },
        {
          "id": "ll3vq4p",
          "author": "ControlOk8832",
          "body": "It’s worse in the outside world. We gotta deal with coworkers AND family members who don’t know what they’re talking about but still decide to talk anyway. At least with the internet you can block people",
          "created_utc": 1725257178.0
        }
      ]
    },
    {
      "id": "ll7edtr",
      "author": "None",
      "body": "I think that these people are just being mean altogether because I have made certain vegetables safe foods and then they cooked it in weird ways on purpose to make it not a safe food or just banned it and said “I need you to eat more vegetables than just these, so we won’t be buying it”. They really just have an obsession with sameness and if you won’t eat things their way, then you can’t have it at all. It’s weird.",
      "created_utc": 1725310851.0,
      "score": 3,
      "context": [
        {
          "id": "ll5azhb",
          "author": "ScaryBoyRobots",
          "body": "One of the things I have always wanted most in my life is the ability to eat anything and try new foods. Going into a produce section fascinates me because all the colorful fruits and veggies look so beautiful to me — but my brain doesn’t even register them as real food. Trying to eat any of them gives me the same reaction as someone scooping lawn clippings, holly berries and poison ivy into a bowl and telling me to wolf it down. Would any of these people eat that? No, of course not, and they would have a panic response even trying to do so, because every instinct they have would be screaming that it’s not safe and those are not edible. That it’s dangerous and they’ll be sick, if not die. Except my brain does that with 98% of foods. And it makes me miserable. I don’t want to have a panic attack when facing down non-safe foods. I don’t like gagging and choking and throwing up. I wish foods smelled and tasted good to me, that they didn’t process in my head the same way dog shit does. I’ve just learned to live with it, because I can’t get another brain that works right, I’m stuck with this broken one for my whole life. And frankly, it’s not their business what groceries or meals I buy with the money I earn at my job. It’s not theirs to have an opinion on.",
          "created_utc": 1725285593.0
        },
        {
          "id": "ll5e5ka",
          "author": "None",
          "body": "That’s how I feel. I wouldn’t touch most veggies because they make me gag and they smell awful. The people who question how I behave assume I’m only eating “junk” food.\n\nSo what if I am? Just because you don’t like it doesn’t make it “junk”, food is still food, no matter how “unhealthy” you think it is.",
          "created_utc": 1725286736.0
        }
      ]
    },
    {
      "id": "ll66fbn",
      "author": "beomint",
      "body": "That's fine, we'll mass report them and they'll be perma-banned from the subreddit. I'd genuinely like to know the username so I can per-emptively block them and save myself from ever seeing their posts.",
      "created_utc": 1725296117.0,
      "score": 3,
      "context": [
        {
          "id": "ll4d7jn",
          "author": "Gullible_Educator122",
          "body": "Don’t be shy, drop the usernames :)",
          "created_utc": 1725268607.0
        },
        {
          "id": "ll5b3pr",
          "author": "None",
          "body": "I wanted to censor them out because I didn’t want unnecessary trolls to come here and go “how dare you attack my friend, I will make fun of you in redscarepod again”.",
          "created_utc": 1725285637.0
        }
      ]
    },
    {
      "id": "ll5bn3w",
      "author": "Gullible_Educator122",
      "body": "We’ll take care of the friends too 🥰",
      "created_utc": 1725285832.0,
      "score": 1,
      "context": [
        {
          "id": "ll4d7jn",
          "author": "Gullible_Educator122",
          "body": "Don’t be shy, drop the usernames :)",
          "created_utc": 1725268607.0
        },
        {
          "id": "ll5b3pr",
          "author": "None",
          "body": "I wanted to censor them out because I didn’t want unnecessary trolls to come here and go “how dare you attack my friend, I will make fun of you in redscarepod again”.",
          "created_utc": 1725285637.0
        }
      ]
    },
    {
      "id": "lnks8jj",
      "author": "imdestroylonely",
      "body": "you literally ruined all my fun. you seem the type to say “mmm, im not a guy” when i say, “guys”😭i wouldn’t have assumed you were a guy, bro doesn’t always\nmean, “brother” and i didnt think people were shallow enough to give a shit about being called that, my own mom calls me bro and i’m a girl. i don’t care what you are bro🫡. and that’s a ridiculous reason. whatever they’d get from said “trolls” they would’ve deserved and brought upon themselves.",
      "created_utc": 1726583958.0,
      "score": 2,
      "context": [
        {
          "id": "ll5uxa5",
          "author": "imdestroylonely",
          "body": "don’t be shy bro post the names uncovered😇😇😇please im begging u to at least send em to me",
          "created_utc": 1725292350.0
        },
        {
          "id": "ll66v2s",
          "author": "None",
          "body": "Why do you want to know their usernames? I just don’t want any trolls. And I’m not a bro either.",
          "created_utc": 1725296261.0
        }
      ]
    },
    {
      "id": "ll6ym2u",
      "author": "mermaidreefer",
      "body": "Nobody should be made to feel guilty about consenting or not consenting to what is put in their body - food or anything else. I know that sounds extreme, but I seriously believe that food is actually a very personal thing for how communal it can be. The world should be more understanding of different palates and allergies and not take the rejection or preferences of foods personally OR as an excuse to judge and berate someone.",
      "created_utc": 1725305556.0,
      "score": 12,
      "context": [
        {
          "id": "ll37sij",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1725245102.0
        },
        {
          "id": "ll43hql",
          "author": "mermaidreefer",
          "body": "they act like we don't WANT to like other foods",
          "created_utc": 1725262014.0
        },
        {
          "id": "ll5hzbr",
          "author": "goldfishmuncher",
          "body": "ive cried before because every time i work up the courage to try a new food my brain convinces me it tastes bad, i'll legit be there like \"do i actually hate this? or does my brain just want me to hate this?\" and to avoid it i just go back to my safe foods.",
          "created_utc": 1725288054.0
        }
      ]
    },
    {
      "id": "ll7wahj",
      "author": "TheBackyardigirl",
      "body": "Saaame, ive had entire breakdowns over just wanting something and brain telling me im not allowed :,)",
      "created_utc": 1725317240.0,
      "score": 4,
      "context": [
        {
          "id": "ll37sij",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1725245102.0
        },
        {
          "id": "ll43hql",
          "author": "mermaidreefer",
          "body": "they act like we don't WANT to like other foods",
          "created_utc": 1725262014.0
        },
        {
          "id": "ll5hzbr",
          "author": "goldfishmuncher",
          "body": "ive cried before because every time i work up the courage to try a new food my brain convinces me it tastes bad, i'll legit be there like \"do i actually hate this? or does my brain just want me to hate this?\" and to avoid it i just go back to my safe foods.",
          "created_utc": 1725288054.0
        }
      ]
    },
    {
      "id": "ll8c4j4",
      "author": "BulkyComfortable3040",
      "body": "I totally get that 😭",
      "created_utc": 1725323245.0,
      "score": 3,
      "context": [
        {
          "id": "ll37sij",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1725245102.0
        },
        {
          "id": "ll43hql",
          "author": "mermaidreefer",
          "body": "they act like we don't WANT to like other foods",
          "created_utc": 1725262014.0
        },
        {
          "id": "ll5hzbr",
          "author": "goldfishmuncher",
          "body": "ive cried before because every time i work up the courage to try a new food my brain convinces me it tastes bad, i'll legit be there like \"do i actually hate this? or does my brain just want me to hate this?\" and to avoid it i just go back to my safe foods.",
          "created_utc": 1725288054.0
        }
      ]
    },
    {
      "id": "ll53olw",
      "author": "notceitn",
      "body": "Yupppp \"what, where's the veggies/sauce/spices/etc??\" On your food not mine bitch leave me the fuck alone!!!! Drives me insane because literally who the fuck cares it's so stupid",
      "created_utc": 1725282833.0,
      "score": 27,
      "context": [
        {
          "id": "ll383u1",
          "author": "Defiant_Grab_5364",
          "body": "This is why I never tell people I have ARFID",
          "created_utc": 1725245239.0
        },
        {
          "id": "ll3ufzb",
          "author": "notceitn",
          "body": "💯 I even try not to eat in front of people because I'm afraid I'll get comments like this because my food is \"too plain\"... seriously fuck people like those in the post",
          "created_utc": 1725256414.0
        },
        {
          "id": "ll4bjcw",
          "author": "alicyjka",
          "body": "This. I have such anxiety when it comes to eating in front of others. It’s like I’m always anticipating the humiliation.",
          "created_utc": 1725267463.0
        }
      ]
    },
    {
      "id": "ll670zp",
      "author": "None",
      "body": "Or TikTok, or Facebook, or literally any other social media platform",
      "created_utc": 1725296314.0,
      "score": 2,
      "context": [
        {
          "id": "ll4txrq",
          "author": "arachnids-bakery",
          "body": "\"Grown adults with an *EATING DISORDER* are such an interesting breed of people\" ffs, this is straight up r/fakedisordercringe shit",
          "created_utc": 1725278632.0
        },
        {
          "id": "ll5cio7",
          "author": "None",
          "body": "Agreed. I fucking hate fakedisordercringe with a passion. Like can’t they just mind their own fucking business instead of jumping to conclusions all the time?!",
          "created_utc": 1725286147.0
        },
        {
          "id": "ll5vr0t",
          "author": "arachnids-bakery",
          "body": "EXACTLY!! They love to say that people they find \"\"\"cringy\"\"\" are faking disorders, as if reddit gives them a full phd in psychology",
          "created_utc": 1725292623.0
        }
      ]
    },
    {
      "id": "ll68i07",
      "author": "None",
      "body": "Well there certainly are no benefits to other disorders either, just saying.",
      "created_utc": 1725296798.0,
      "score": 1,
      "context": [
        {
          "id": "ll4akoj",
          "author": "rin-dragon",
          "body": "why do ppl think we want to have this? there are all kinds of disorders ppl can fake for attention, money, or sympathy. arfid is not one of them 💀 most ppl dont know what it is and those who do equate it with childish picky eating. theres rly no benefit to having arfid lmao",
          "created_utc": 1725266812.0
        },
        {
          "id": "ll5bs94",
          "author": "None",
          "body": "I wouldn’t necessarily say we “fake” other disorders for attention or any of that shit. We’ll just get the same negative reaction because we are weird to them.\n\nPersonally I find it impossible to fake a disorder without giving it away at one point.",
          "created_utc": 1725285883.0
        },
        {
          "id": "ll67czo",
          "author": "rin-dragon",
          "body": "i think i was misunderstood, im not accusing anyone of faking disorders in general, as i dont rly buy into that mindset. but just going by their insane logic to say that even if we were (as they claim we are) then why on earth would we chose arfid of all things and not smt that could at least be \"beneficial\" to fake. like if someone were to fake cancer they could falsely generate sympathy and scam gofundme donations. so im just not sure what these ppl think the supposed benefit of us \"faking\" arfid is, since theyre so insistent that we're just whiny picky eaters.",
          "created_utc": 1725296425.0
        }
      ]
    },
    {
      "id": "ll5q5pu",
      "author": "None",
      "body": "Yes I did. I doubt they were left wing at all.",
      "created_utc": 1725290790.0,
      "score": 3,
      "context": [
        {
          "id": "ll4uw6g",
          "author": "thecxsmonaut",
          "body": "Red Scare listeners try not to be the most insufferable terminally online shit scum you've ever met challenge",
          "created_utc": 1725279086.0
        },
        {
          "id": "ll5cuv0",
          "author": "None",
          "body": "Spoilers: they lost big time",
          "created_utc": 1725286268.0
        },
        {
          "id": "ll5hu9m",
          "author": "thecxsmonaut",
          "body": "Have you ever noticed that for a \"left wing\" community they sound suspiciously like your conservative uncle?",
          "created_utc": 1725288005.0
        }
      ]
    },
    {
      "id": "ll7g0jr",
      "author": "AlethWrites",
      "body": "That makes a lot of sense actually! Thanks for the clarification, you're very kind.",
      "created_utc": 1725311409.0,
      "score": 1,
      "context": [
        {
          "id": "ll6mpgv",
          "author": "Prometheus-is-vulcan",
          "body": "As far as I saw here, there are two somewhat distinct categories of ppl with ARFID. \n\n1. Problem with eating at all, disgusted by any food, throws up because of eating, underweight, some barely alive. \n\n2. Health appetite, wants to eat, is limited to certain foods. Throws up because of imagining eating certain foods. Some are overweight, as they can only eat non-filling, high calorie food.\n\n\nBoth suffer. Both deserve our sympathy. \n\nBut as soon as its about \"I can eat it, I just don't like it\", its not ARFID. \n\nI am group 2, and I dont like 75% of the food I eat, but I need that variety (also important to not loose safe foods).",
          "created_utc": 1725301501.0
        },
        {
          "id": "ll7cuer",
          "author": "AlethWrites",
          "body": "I think there's a weird middle ground between the two groups, people who have little interest in eating and only eat a limited group of foods. \n\nTo me it's a whole thing to convince myself to eat some days, even if I can feel the actual hunger. I can eat so, I am not underweight (also my metabolism sucks lmao) but, it is hard still. \n\nI hope this makes sense though, I have been dealing with a new flare up of ARFID and I am still figuring things out. It's not like it disappeared, but I was doing pretty well, having a balanced diet mostly, and boom. So, even myself I am confused af.",
          "created_utc": 1725310331.0
        },
        {
          "id": "ll7eas5",
          "author": "Prometheus-is-vulcan",
          "body": "That both groups have a spectrum (this phrase is overused af) is clear for me. Not everyone is extreme, but not being extreme, does not mean not suffering from it.\n\nIf you make a venn diagram, most of group 1 would be inside of group 2, as they, if they eat, also eat very few kinds of food. \n\nMy focus was on the primary struggle.",
          "created_utc": 1725310822.0
        }
      ]
    },
    {
      "id": "ll7lnub",
      "author": "None",
      "body": "It really is unfair",
      "created_utc": 1725313354.0,
      "score": 1,
      "context": [
        {
          "id": "ll5azhb",
          "author": "ScaryBoyRobots",
          "body": "One of the things I have always wanted most in my life is the ability to eat anything and try new foods. Going into a produce section fascinates me because all the colorful fruits and veggies look so beautiful to me — but my brain doesn’t even register them as real food. Trying to eat any of them gives me the same reaction as someone scooping lawn clippings, holly berries and poison ivy into a bowl and telling me to wolf it down. Would any of these people eat that? No, of course not, and they would have a panic response even trying to do so, because every instinct they have would be screaming that it’s not safe and those are not edible. That it’s dangerous and they’ll be sick, if not die. Except my brain does that with 98% of foods. And it makes me miserable. I don’t want to have a panic attack when facing down non-safe foods. I don’t like gagging and choking and throwing up. I wish foods smelled and tasted good to me, that they didn’t process in my head the same way dog shit does. I’ve just learned to live with it, because I can’t get another brain that works right, I’m stuck with this broken one for my whole life. And frankly, it’s not their business what groceries or meals I buy with the money I earn at my job. It’s not theirs to have an opinion on.",
          "created_utc": 1725285593.0
        },
        {
          "id": "ll5e5ka",
          "author": "None",
          "body": "That’s how I feel. I wouldn’t touch most veggies because they make me gag and they smell awful. The people who question how I behave assume I’m only eating “junk” food.\n\nSo what if I am? Just because you don’t like it doesn’t make it “junk”, food is still food, no matter how “unhealthy” you think it is.",
          "created_utc": 1725286736.0
        },
        {
          "id": "ll7edtr",
          "author": "None",
          "body": "I think that these people are just being mean altogether because I have made certain vegetables safe foods and then they cooked it in weird ways on purpose to make it not a safe food or just banned it and said “I need you to eat more vegetables than just these, so we won’t be buying it”. They really just have an obsession with sameness and if you won’t eat things their way, then you can’t have it at all. It’s weird.",
          "created_utc": 1725310851.0
        }
      ]
    },
    {
      "id": "ll686dw",
      "author": "None",
      "body": "I honestly don’t want to know their usernames anyway, and you shouldn’t either. Besides I’m not going back and re-edit the photos again. Besides I already deleted them from my cloud storage.\n\nCan’t do anything about it. Sorry.",
      "created_utc": 1725296691.0,
      "score": 1,
      "context": [
        {
          "id": "ll4d7jn",
          "author": "Gullible_Educator122",
          "body": "Don’t be shy, drop the usernames :)",
          "created_utc": 1725268607.0
        },
        {
          "id": "ll5b3pr",
          "author": "None",
          "body": "I wanted to censor them out because I didn’t want unnecessary trolls to come here and go “how dare you attack my friend, I will make fun of you in redscarepod again”.",
          "created_utc": 1725285637.0
        },
        {
          "id": "ll66fbn",
          "author": "beomint",
          "body": "That's fine, we'll mass report them and they'll be perma-banned from the subreddit. I'd genuinely like to know the username so I can per-emptively block them and save myself from ever seeing their posts.",
          "created_utc": 1725296117.0
        }
      ]
    },
    {
      "id": "lnlgu8h",
      "author": "None",
      "body": "I’m not ruining your fun. You brought it upon yourself. You were the one who wanted to harass a bunch of people which is going to escalate the conflict even further.\n\nSo leave me alone and stop trolling me.",
      "created_utc": 1726591847.0,
      "score": 1,
      "context": [
        {
          "id": "ll5uxa5",
          "author": "imdestroylonely",
          "body": "don’t be shy bro post the names uncovered😇😇😇please im begging u to at least send em to me",
          "created_utc": 1725292350.0
        },
        {
          "id": "ll66v2s",
          "author": "None",
          "body": "Why do you want to know their usernames? I just don’t want any trolls. And I’m not a bro either.",
          "created_utc": 1725296261.0
        },
        {
          "id": "lnks8jj",
          "author": "imdestroylonely",
          "body": "you literally ruined all my fun. you seem the type to say “mmm, im not a guy” when i say, “guys”😭i wouldn’t have assumed you were a guy, bro doesn’t always\nmean, “brother” and i didnt think people were shallow enough to give a shit about being called that, my own mom calls me bro and i’m a girl. i don’t care what you are bro🫡. and that’s a ridiculous reason. whatever they’d get from said “trolls” they would’ve deserved and brought upon themselves.",
          "created_utc": 1726583958.0
        }
      ]
    },
    {
      "id": "mk28qwa",
      "author": "Best_Track_3066",
      "body": "Fr. Like I want to know what mustard is all about but it looks like paint and smells weird. I wish I could eat beans, that would put a lot of non meat protein in my diet and save some cash. But those are not options. I can put it in my mouth I might be able to even chew it but my throat says nope and I'll either gag or sit there with it in my mouth trying desperately to get it down until I spit it out. This leads to not liking to eat and in turn not eating for most of the day or at all until I'm so hungry even my autistic ass can tell. Then there is a high calorie eating binge of tasty safe food then I feel disgusting and the cycle starts again. Somehow afraid and binge eating disorder blur together.  The restricting and binging all  stem from flavor/texture sensitivities.",
      "created_utc": 1743103646.0,
      "score": 2,
      "context": [
        {
          "id": "ll37sij",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1725245102.0
        },
        {
          "id": "ll43hql",
          "author": "mermaidreefer",
          "body": "they act like we don't WANT to like other foods",
          "created_utc": 1725262014.0
        },
        {
          "id": "ll5hzbr",
          "author": "goldfishmuncher",
          "body": "ive cried before because every time i work up the courage to try a new food my brain convinces me it tastes bad, i'll legit be there like \"do i actually hate this? or does my brain just want me to hate this?\" and to avoid it i just go back to my safe foods.",
          "created_utc": 1725288054.0
        },
        {
          "id": "ll6ym2u",
          "author": "mermaidreefer",
          "body": "Nobody should be made to feel guilty about consenting or not consenting to what is put in their body - food or anything else. I know that sounds extreme, but I seriously believe that food is actually a very personal thing for how communal it can be. The world should be more understanding of different palates and allergies and not take the rejection or preferences of foods personally OR as an excuse to judge and berate someone.",
          "created_utc": 1725305556.0
        }
      ]
    },
    {
      "id": "mlkxmn8",
      "author": "None",
      "body": "I know that this is old, but the way that people act when a group of people want to eat something and one person modifies if definitely reminds me of consent issues.",
      "created_utc": 1743879085.0,
      "score": 2,
      "context": [
        {
          "id": "ll37sij",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1725245102.0
        },
        {
          "id": "ll43hql",
          "author": "mermaidreefer",
          "body": "they act like we don't WANT to like other foods",
          "created_utc": 1725262014.0
        },
        {
          "id": "ll5hzbr",
          "author": "goldfishmuncher",
          "body": "ive cried before because every time i work up the courage to try a new food my brain convinces me it tastes bad, i'll legit be there like \"do i actually hate this? or does my brain just want me to hate this?\" and to avoid it i just go back to my safe foods.",
          "created_utc": 1725288054.0
        },
        {
          "id": "ll6ym2u",
          "author": "mermaidreefer",
          "body": "Nobody should be made to feel guilty about consenting or not consenting to what is put in their body - food or anything else. I know that sounds extreme, but I seriously believe that food is actually a very personal thing for how communal it can be. The world should be more understanding of different palates and allergies and not take the rejection or preferences of foods personally OR as an excuse to judge and berate someone.",
          "created_utc": 1725305556.0
        }
      ]
    },
    {
      "id": "ll69pyp",
      "author": "rin-dragon",
      "body": "i dont think u get what im trying to say, have a nice day.",
      "created_utc": 1725297200.0,
      "score": 1,
      "context": [
        {
          "id": "ll4akoj",
          "author": "rin-dragon",
          "body": "why do ppl think we want to have this? there are all kinds of disorders ppl can fake for attention, money, or sympathy. arfid is not one of them 💀 most ppl dont know what it is and those who do equate it with childish picky eating. theres rly no benefit to having arfid lmao",
          "created_utc": 1725266812.0
        },
        {
          "id": "ll5bs94",
          "author": "None",
          "body": "I wouldn’t necessarily say we “fake” other disorders for attention or any of that shit. We’ll just get the same negative reaction because we are weird to them.\n\nPersonally I find it impossible to fake a disorder without giving it away at one point.",
          "created_utc": 1725285883.0
        },
        {
          "id": "ll67czo",
          "author": "rin-dragon",
          "body": "i think i was misunderstood, im not accusing anyone of faking disorders in general, as i dont rly buy into that mindset. but just going by their insane logic to say that even if we were (as they claim we are) then why on earth would we chose arfid of all things and not smt that could at least be \"beneficial\" to fake. like if someone were to fake cancer they could falsely generate sympathy and scam gofundme donations. so im just not sure what these ppl think the supposed benefit of us \"faking\" arfid is, since theyre so insistent that we're just whiny picky eaters.",
          "created_utc": 1725296425.0
        },
        {
          "id": "ll68i07",
          "author": "None",
          "body": "Well there certainly are no benefits to other disorders either, just saying.",
          "created_utc": 1725296798.0
        }
      ]
    },
    {
      "id": "mk2g5c9",
      "author": "mermaidreefer",
      "body": "I would do anything to like beans and broccoli and cauliflower. I’m making some progress with cauliflower rice but it’s slow going",
      "created_utc": 1743107510.0,
      "score": 1,
      "context": [
        {
          "id": "ll37sij",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1725245102.0
        },
        {
          "id": "ll43hql",
          "author": "mermaidreefer",
          "body": "they act like we don't WANT to like other foods",
          "created_utc": 1725262014.0
        },
        {
          "id": "ll5hzbr",
          "author": "goldfishmuncher",
          "body": "ive cried before because every time i work up the courage to try a new food my brain convinces me it tastes bad, i'll legit be there like \"do i actually hate this? or does my brain just want me to hate this?\" and to avoid it i just go back to my safe foods.",
          "created_utc": 1725288054.0
        },
        {
          "id": "ll6ym2u",
          "author": "mermaidreefer",
          "body": "Nobody should be made to feel guilty about consenting or not consenting to what is put in their body - food or anything else. I know that sounds extreme, but I seriously believe that food is actually a very personal thing for how communal it can be. The world should be more understanding of different palates and allergies and not take the rejection or preferences of foods personally OR as an excuse to judge and berate someone.",
          "created_utc": 1725305556.0
        },
        {
          "id": "mk28qwa",
          "author": "Best_Track_3066",
          "body": "Fr. Like I want to know what mustard is all about but it looks like paint and smells weird. I wish I could eat beans, that would put a lot of non meat protein in my diet and save some cash. But those are not options. I can put it in my mouth I might be able to even chew it but my throat says nope and I'll either gag or sit there with it in my mouth trying desperately to get it down until I spit it out. This leads to not liking to eat and in turn not eating for most of the day or at all until I'm so hungry even my autistic ass can tell. Then there is a high calorie eating binge of tasty safe food then I feel disgusting and the cycle starts again. Somehow afraid and binge eating disorder blur together.  The restricting and binging all  stem from flavor/texture sensitivities.",
          "created_utc": 1743103646.0
        }
      ]
    },
    {
      "id": "ll6l9ro",
      "author": "None",
      "body": "You certainly don’t either, so I’m just going to go ahead and block you.",
      "created_utc": 1725301018.0,
      "score": 1,
      "context": [
        {
          "id": "ll4akoj",
          "author": "rin-dragon",
          "body": "why do ppl think we want to have this? there are all kinds of disorders ppl can fake for attention, money, or sympathy. arfid is not one of them 💀 most ppl dont know what it is and those who do equate it with childish picky eating. theres rly no benefit to having arfid lmao",
          "created_utc": 1725266812.0
        },
        {
          "id": "ll5bs94",
          "author": "None",
          "body": "I wouldn’t necessarily say we “fake” other disorders for attention or any of that shit. We’ll just get the same negative reaction because we are weird to them.\n\nPersonally I find it impossible to fake a disorder without giving it away at one point.",
          "created_utc": 1725285883.0
        },
        {
          "id": "ll67czo",
          "author": "rin-dragon",
          "body": "i think i was misunderstood, im not accusing anyone of faking disorders in general, as i dont rly buy into that mindset. but just going by their insane logic to say that even if we were (as they claim we are) then why on earth would we chose arfid of all things and not smt that could at least be \"beneficial\" to fake. like if someone were to fake cancer they could falsely generate sympathy and scam gofundme donations. so im just not sure what these ppl think the supposed benefit of us \"faking\" arfid is, since theyre so insistent that we're just whiny picky eaters.",
          "created_utc": 1725296425.0
        },
        {
          "id": "ll68i07",
          "author": "None",
          "body": "Well there certainly are no benefits to other disorders either, just saying.",
          "created_utc": 1725296798.0
        },
        {
          "id": "ll69pyp",
          "author": "rin-dragon",
          "body": "i dont think u get what im trying to say, have a nice day.",
          "created_utc": 1725297200.0
        }
      ]
    }
  ]
}