{
  "id": "1fagy3i",
  "subreddit": "ARFID",
  "author": "angelneliel",
  "created_utc": 1725633906.0,
  "title": "Feeling really uneasy since the troll was exposed– Discussion",
  "selftext": "I've been feeling really uneasy and uncomfortable about the posts and comments made on this sub ever since the post regarding the troll was made yesterday. Now, every post and comment I see made by people of low account age/karma, I am skeptical. I don't like having to double check or doubt the validity of stories/comments shared. I don't like the idea of someone making hurtful comments toward people who struggle how I do, about an already difficult topic for us to discuss.\n\nTheir post on confessions was saying how because of their past with food insecurity, they have since started to hate and attack people with ARFID. It took me a while to understand the connection, probably because of my autism. But what I've concluded is I think what the troll believes is– it's almost as people with ARFID are *choosing* to \"waste\" food and be \"ungrateful\" for the food given to us. Essentially, blaming his past with food insecurity on those with this eating disorder. I know this is already a very common sentiment we often receive from outside sources whenever our disordered eating is noticed by ignorant people. I find it's especially disheartening that this has come to enter our safe space. \n\nIt's like when people blame the customer for not tipping the employee, when the bad guy is actually the company not paying the employee a livable wage. It's like when people blame global scale pollution on individuals, instead of realizing it's the businesses who are most responsible. People with ARFID are not responsible for food shortages, food scarcity/insecurity, world hunger or wasted food on a global scale. The businesses who are choosing to throw away massive amounts of food instead of giving them to those in need are responsible. The governments not funding infrastructures to alleviate world hunger are responsible. \n\nI messaged the mods to hopefully try and apply some things to deter trolls from entering this community any longer, although it might not work. If you have any ideas, I'd recommend sending it to the mods team. It's just exhausting seeing that our safe space is being tarnished by someone who thinks we're responsible for the disorder we have no control over. The mods responded to me saying they are discussing it as they are also concerned about the trolling.\n\nAnyway, I guess I wanted to start a conversation about it with you all, since I'm not sure what to do with these feelings of unease, or how we can move forward without this troll getting what they want. ",
  "url": "https://www.reddit.com/r/ARFID/comments/1fagy3i/feeling_really_uneasy_since_the_troll_was_exposed/",
  "score": 87,
  "num_comments": 24,
  "comments": [
    {
      "id": "llt8aas",
      "author": "booksncatsn",
      "body": "Fortunately it should be easy to spot a troll. Everyone here is supportive and caring, the rare exception will be easy to spot and give the boot to.",
      "created_utc": 1725637777.0,
      "score": 95,
      "context": []
    },
    {
      "id": "lltk69y",
      "author": "himydandelion",
      "body": "(Mod here) and I wanna echo OP that if you have any ideas, PLEASE send them to us!! We are absolutely open to suggestions. We are also active on the Discord group if you’d like to discuss/brainstorm there. \n\nWell put, OP— all of this. And hugs to you. I’m feeling it too. You’re not alone.",
      "created_utc": 1725641577.0,
      "score": 38,
      "context": []
    },
    {
      "id": "llt5ryb",
      "author": "Desert_Fairy",
      "body": "*big internet hug*\n\nPeople suck sometimes.  And it is hard to be open and vulnerable when those people decide that they want to spew their pain on innocent people. \n\nWhat amazes me is that people living with food scarcity experience so many of the same things we do. \n\nWe’ve felt starvation, we have been ostracized because our feelings about food are not normal. \n\nWe have so much in common. \n\nBut when people choose to spew hate, communication fails.  Please, keep hoping for good talks and being supportive to everyone.",
      "created_utc": 1725636985.0,
      "score": 30,
      "context": []
    },
    {
      "id": "llt8j07",
      "author": "DyingLies",
      "body": "I also share this feeling. But we should know that none of this is our fault. We have a disability that is diagnosed by professionals. People who act rude towards us don't understand what we're going through. Hopefully this disorder will soon be more well-known.",
      "created_utc": 1725637853.0,
      "score": 14,
      "context": []
    },
    {
      "id": "lltn8mb",
      "author": "A_Very_Living_Me",
      "body": "Creating a new account to get around a ban is against reddit policy and can result in a site wide ban  for the users device, IP, or one of the other more powerful tools reddit has to prevent users from ban evasion.\n\nReport the original post on confession to Reddit. \n\nThere are of course ways to get around all that but at least we can make it a bit annoying for the troll",
      "created_utc": 1725642552.0,
      "score": 13,
      "context": []
    },
    {
      "id": "lltgka2",
      "author": "Volcanogrove",
      "body": "Oh dang, despite my frequent use of Reddit I missed this. I’ve personally also dealt with food insecurity and honestly it probably exacerbated my ARFID. For as long as I can remember I’ve dealt with ARFID including before my family dealt with food insecurity so when having food was an issue it was essential that the food getting bought was food I was 100% going to eat. Also meant less food in general but bc I had ARFID I didn’t like to eat much anyway. I didn’t even realize the amount I was eating was much less than other kids my age until I had dinner at a friend’s house (which was mostly food I couldn’t eat anyway). \n\nIt’s awful that there are people who have also dealt with food insecurity who now take it out on people with ARFID or other eating disorders. Like I would not be this way by choice! I really wish I could eat a normal variety of foods, I wish I had a normal appetite too. So much bonding is done through sharing meals and I often can’t take part or if I do I will stand out due to what I choose to eat or how much. Sometimes coworkers bring something to share and I feel bad for saying no thank you bc sometimes it does disappoint the coworker sharing. At least they don’t attack me for declining by calling me ungrateful or wasteful",
      "created_utc": 1725640415.0,
      "score": 9,
      "context": []
    },
    {
      "id": "lltobto",
      "author": "Jawahhh",
      "body": "Yeah I feel like most people who are aware of this disorder and are on this sub are filled with compassion for those who suffer. I am personally a “picky eater” and I identify with some of the symptoms of ARFID.\n\nSome totally normal and common foods literally give me a *do not eat this will kill you* response, and it used to severely impede my social life and I was filled with shame. My diet is not nearly as restrictive as ARFID..\n\nI’m on here because of my brother who has it. He’s in his early 20s and honestly ARFID just nerfed his social life. Not Arfid actually… just jerk “friends” who think it’s funny to shame him and make fun of him for not eating most foods.\n\nIt fills me with rage. People shouldn’t be in control of what other people choose to eat. Why does anybody even care other than to be a bully and feel superior.",
      "created_utc": 1725642902.0,
      "score": 8,
      "context": []
    },
    {
      "id": "llt5g4g",
      "author": "emarston23",
      "body": "Yeah I felt that too, it's unfortunate we don't eat. But it's not people with ARFID wasting anything.",
      "created_utc": 1725636880.0,
      "score": 9,
      "context": []
    },
    {
      "id": "llts955",
      "author": "zephalephadingong",
      "body": "Trolls like that are part of the problem with having supportive communities online.  The only thing that helps is to have mods who are on top of it(and the mods here are).\n\nYou guys are ill, and do not deserve abuse of any kind",
      "created_utc": 1725644159.0,
      "score": 8,
      "context": []
    },
    {
      "id": "lltrm1b",
      "author": "MaleficentSwan0223",
      "body": "I don’t know about you guys but I only buy my safe foods and have cried before if the food has gone off before I’m able to eat it. \n\nIt’s yet again someone who doesn’t get it and we’ve all met plenty of people like that before. ",
      "created_utc": 1725643952.0,
      "score": 7,
      "context": []
    },
    {
      "id": "lltis9x",
      "author": "ScaryBoyRobots",
      "body": "Honestly, it just made me very angry, because even the logic of coming *here* to bother people doesn't add up with what they claimed \"rustled their jimmies\".\n\nFor a bunch of spoiled affluenza kids who are just being picky assholes, there sure are a lot of posts here with people begging for help and tips to... stop being that way. So where is the logic of trolling that?\n\nIf \"food insecurity\" made them so angry to see people have issues with food, then shouldn't they be happy? People with ARFID eat *less* than people without it. That means more food for everyone else, lessening said insecurity. So what is there to be upset about? Why doesn't that anger extend to anorexics and bulimics? So it's okay to refuse to eat as long as it's based only on fear of gaining weight? It's okay to binge eat huge amounts of food and then purge it? *That's* less offensive than someone saying \"I have a sensory issue that negatively impacts my diet\"? Where's the logic?\n\nAnd if they really suffered food insecurity and get upset when other people... don't suffer? Eat but fail to meet the troll's specific approved diet that they never clued anyone into? I don't even know. But if that's their problem, maybe they should be much more invested in corporate food waste and the capitalists who encourage things like dumping bleach on top of one-day-expired food in a dumpster, so no one else can have it. That's a logical response to being passionate about ending food insecurity.\n\nThat person is a liar who's so ashamed of their own trolling that they feel the need to make up a story about food scarcity to justify what they're doing on an anonymous forum. They can't just admit that they enjoy being a bully and an asshole who's randomly chosen a small population of people with a clinical disorder -- they *have* to spin a yarn to make themselves look better, even though no one knows who they are and there aren't real repercussions to their shitty behavior, because their own guilt gnaws at them when they admit they don't actually have a reason to be such a bad person.\n\nKarma's a relaxing thought\\~",
      "created_utc": 1725641134.0,
      "score": 12,
      "context": []
    },
    {
      "id": "lltdf1a",
      "author": "lemurificspeckle",
      "body": "Completely understandable, OP! It shook me up a good bit to see someone being so rude and bitter. Please know that all of the lovely normal denizens of r/ARFID are still here and will drown out their hate with love for every transgression they commit!",
      "created_utc": 1725639401.0,
      "score": 5,
      "context": []
    },
    {
      "id": "llvr6wl",
      "author": "pupbarkz",
      "body": "i find it quite interesting that they seem to think that a lot of us haven’t dealt with food insecurity ourselves. i’ve dealt with it my entire life, yet i still have ARFID and always have. i feel immense guilt every time i “waste” food because of it. \n\ntheir internalised issues are showing and it’s quite sad to be honest.",
      "created_utc": 1725668190.0,
      "score": 6,
      "context": []
    },
    {
      "id": "llvrkze",
      "author": "dhcirkekcheia",
      "body": "It upset me as someone with ARFID and who has suffered with food insecurity. I get being bitter, I get feeling bad about wasting food when I try something new, but ultimately all food ends up being disposed of whether that’s via digestion of being throw out.\n\nI’d say that my ARFID has been made worse by food scarcity - and exacerbated by obsessive and compulsive behaviours around contamination - I can’t eat safe foods in certain circumstances now. If an older loaf of bread has mould, I’m not eating any bread that day even if it’s a fresh loaf, since I’m never eating food that’s past its expiry again in my life as long as I can help it.",
      "created_utc": 1725668338.0,
      "score": 6,
      "context": []
    },
    {
      "id": "llt9lgb",
      "author": "pasghetti_n_meatbals",
      "body": "As a mom of a child who has ARFID, incidents like that troll, frankly scare me. But, alot out there in the world scares me. I know when I go to the store later today not everybody else there may live by the same moral values that I do, somebody may be shoplifting. The store has \"security\", but that doesn't necessarily mean that they're going to catch that.  My best friend lives in a great neighborhood, she wasn't safe in her own home because her husband was an abuser who only showed his true colors after marriage. Sometimes bad folks can get into very secure places. It's always good to try to have a lot of things in place that make your home or your neighborhood, your relationships, or even where you go online safer. And it's good to check to see if there's something more that can be done when something happens. Seeing trolling online is hard because it reminds us of the real life intolerance in this world, the ignorance, and the hate. It may take a little while for that feeling of unease to go away, for me a little bit of self care helps. Doing something fun with people I love, especially if it involves nature, can remind me of the beauty in this world. Knowing that there's other people out there in this community that feel deeply and want the world to be better helps me personally. Hopefully hearing from this mama, helps you to know you're not alone and helps with that uneasy feeling a bit. Treat yourself well today! 😊",
      "created_utc": 1725638185.0,
      "score": 9,
      "context": []
    },
    {
      "id": "llugs55",
      "author": "TashaT50",
      "body": "As long as we continue to support each other the troll loses. If you see a suspicious post report it to the mods.",
      "created_utc": 1725652051.0,
      "score": 5,
      "context": []
    },
    {
      "id": "llwebzz",
      "author": "Forever_Anxious",
      "body": "I also felt that way when I found out. It’s just another person who doesn’t understand and takes it out on us. And it’s even worse because they are using their trauma to hurt others. It makes me feel very uncomfortable and disgusted that someone could actively come here with the sole purpose of reading our posts or comments (including my own) where we are being extremely vulnerable with our struggles and they get happy over it and then actively enjoy to bullying us, especially someone who keeps getting banned and making new accounts to continue to enjoy laughing at our struggles and bully us.\n\nThey just don’t get that even in times when there is food insecurity or people are starving, that doesn’t change our disorder. I know I would be very ill, put on a feeding tube, or die if I was experiencing food insecurity or in an area with starvation. And people who have this disorder, including people in this sub, actually are or have previously been food insecure which sometimes even exacerbates the disorder. There are also people with this disorder in areas that have starvation. The disorder doesn’t just go away because of lack of food.\n\nBut what’s the most upsetting for me is that I literally hate food waste and I always feel so bad when I throw food away (and I also know a lot of others who have this disorder do as well). I’ve always felt that way, but I try to remind myself that food insecurity is way bigger than me, not that I can’t help or advocate to fix it, but changing the entire system isn’t something I can do. It’s also been something I struggled with since I’ve started exposure therapy. In order to try new foods, there becomes a lot of stuff that you put to your lips/bite that you don’t like at all or that take many, many tries to eventually be able to eat, and that means throwing out a lot of food. My food therapist tells me that it’s not wasted if it helps me to treat my ARFID, and I try to remember that too.\n\nIt’s like I’m sorry you went through that trauma, but I didn’t cause your food insecurity because I don’t eat enough or sometimes throw parts of food out that I don’t like and didn’t eat (sometimes even food that I feel forced into “eating” because people can’t take no for an answer), so don’t take it out on me and somehow feel justified and vindicated when you really just actively enjoy stalking, harassing, and bullying people with eating disorders. Take it up with the government and/or entities that can actually make a significant change, donate to and/or join causes and movements, buy products that are sustainable (just one example are those companies that sell “ugly” foods that are usually tossed instead of being put in stores) or products that use parts of foods that don’t usually get used, advocate, lobby, use food products you buy in the most ways you possibly can, use apps that let you order the leftovers at food establishments at a reduced price, start a movement of your own, volunteer and/or donate at a food kitchen and/or food pantry, (if possible) try to get food establishments in your area connected to food kitchens and/or food pantries so they can give away their leftover food, (if possible) get a job at a place that helps the food insecure, (if possible) learn how to cook sustainably and teach others, (if possible) grow food yourself and sell it at an affordable price or donate it. Do literally anything else other than enjoy bullying strangers struggling with an eating disorder who literally did nothing to you and which literally does nothing to actually address or fix the problem and only hurts people in the process. But no, all that other stuff is too hard and takes time and effort, it’s much easier to just sit behind a screen, on an anonymous website no less, and bully people.\n\nIt’s just hurtful to feel shamed for something I already feel shameful about, which is a constant battle we endure with so many aspects of this disorder and people who feel justified to ridicule us. It’s just another example in the millions of others, but it always hurts the same.",
      "created_utc": 1725677223.0,
      "score": 3,
      "context": []
    },
    {
      "id": "llsy483",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1725634555.0,
      "score": -1,
      "context": []
    },
    {
      "id": "lltbv71",
      "author": "Benzodiazeparty",
      "body": "exactly, they’re not common and they know how to out themselves pretty quickly, and the mods here are on top of their shit (a rare treasure on this site).",
      "created_utc": 1725638904.0,
      "score": 38,
      "context": [
        {
          "id": "llt8aas",
          "author": "booksncatsn",
          "body": "Fortunately it should be easy to spot a troll. Everyone here is supportive and caring, the rare exception will be easy to spot and give the boot to.",
          "created_utc": 1725637777.0
        }
      ]
    },
    {
      "id": "lltnc80",
      "author": "himydandelion",
      "body": "Oh, and take comfort in the fact that the confession post we found was met with judgement and “wow you suck” from people OTHER THAN US! \n\nI went through the comments on that confession and not a single person supported the poster. In fact, everyone was calling the troll a “loser,” “weird,” etc. I looked and only saw evidence of maybe 1-2 commenters that came from here. Everyone else was likely neutral and *still* saw that behavior as wrong. \n\nI’ve been modding this community for awhile and usually I’m terrified to see us mentioned anywhere else. So it was refreshing to see that total strangers agree that the trolling behavior directed at people with a medical condition is reprehensible. That gives me some hope.",
      "created_utc": 1725642584.0,
      "score": 37,
      "context": [
        {
          "id": "lltk69y",
          "author": "himydandelion",
          "body": "(Mod here) and I wanna echo OP that if you have any ideas, PLEASE send them to us!! We are absolutely open to suggestions. We are also active on the Discord group if you’d like to discuss/brainstorm there. \n\nWell put, OP— all of this. And hugs to you. I’m feeling it too. You’re not alone.",
          "created_utc": 1725641577.0
        }
      ]
    },
    {
      "id": "llugz96",
      "author": "TashaT50",
      "body": "Thanks for the work you do. It’s greatly appreciated. I’ve modded on other platforms and know how difficult it can be.",
      "created_utc": 1725652114.0,
      "score": 10,
      "context": [
        {
          "id": "lltk69y",
          "author": "himydandelion",
          "body": "(Mod here) and I wanna echo OP that if you have any ideas, PLEASE send them to us!! We are absolutely open to suggestions. We are also active on the Discord group if you’d like to discuss/brainstorm there. \n\nWell put, OP— all of this. And hugs to you. I’m feeling it too. You’re not alone.",
          "created_utc": 1725641577.0
        }
      ]
    },
    {
      "id": "llszewv",
      "author": "ARFID-ModTeam",
      "body": "Your post or comment was removed due to being rude to the ARFID community. ARFID is a diagnosable eating disorder, a diagnosis backed up by doctors and psychiatrists. Comments or responses that bully or harass sufferers of the condition are not acceptable.",
      "created_utc": 1725634966.0,
      "score": 16,
      "context": [
        {
          "id": "llsy483",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1725634555.0
        }
      ]
    },
    {
      "id": "lluc6t7",
      "author": "umadhatter_",
      "body": "Sometimes I see a post and am truly surprised by the comments. That post was one of them. I’m really happy all those Redditors were so supportive of our us and called him out on his bs.",
      "created_utc": 1725650560.0,
      "score": 12,
      "context": [
        {
          "id": "lltk69y",
          "author": "himydandelion",
          "body": "(Mod here) and I wanna echo OP that if you have any ideas, PLEASE send them to us!! We are absolutely open to suggestions. We are also active on the Discord group if you’d like to discuss/brainstorm there. \n\nWell put, OP— all of this. And hugs to you. I’m feeling it too. You’re not alone.",
          "created_utc": 1725641577.0
        },
        {
          "id": "lltnc80",
          "author": "himydandelion",
          "body": "Oh, and take comfort in the fact that the confession post we found was met with judgement and “wow you suck” from people OTHER THAN US! \n\nI went through the comments on that confession and not a single person supported the poster. In fact, everyone was calling the troll a “loser,” “weird,” etc. I looked and only saw evidence of maybe 1-2 commenters that came from here. Everyone else was likely neutral and *still* saw that behavior as wrong. \n\nI’ve been modding this community for awhile and usually I’m terrified to see us mentioned anywhere else. So it was refreshing to see that total strangers agree that the trolling behavior directed at people with a medical condition is reprehensible. That gives me some hope.",
          "created_utc": 1725642584.0
        }
      ]
    },
    {
      "id": "llw9miy",
      "author": "SprintsAC",
      "body": "Current mod here of Reddit chats & ex IPB mod, want to just back this up. I don't check this subreddit much now, but it's a great use to do many people.\n\n\nVaguely did see about this person's posts & it's really just 1 loser. Can't let it affect any of us really.",
      "created_utc": 1725675298.0,
      "score": 7,
      "context": [
        {
          "id": "lltk69y",
          "author": "himydandelion",
          "body": "(Mod here) and I wanna echo OP that if you have any ideas, PLEASE send them to us!! We are absolutely open to suggestions. We are also active on the Discord group if you’d like to discuss/brainstorm there. \n\nWell put, OP— all of this. And hugs to you. I’m feeling it too. You’re not alone.",
          "created_utc": 1725641577.0
        },
        {
          "id": "llugz96",
          "author": "TashaT50",
          "body": "Thanks for the work you do. It’s greatly appreciated. I’ve modded on other platforms and know how difficult it can be.",
          "created_utc": 1725652114.0
        }
      ]
    }
  ]
}