{
  "id": "1fcdbbh",
  "subreddit": "ARFID",
  "author": "None",
  "created_utc": 1725843712.0,
  "title": "Does anyone else here have the lack of interest subtype and just feel bad about it? ",
  "selftext": "ive lived with the lack of interest subtype my whole life and tbh it seems to be pretty uncommon in people with arfid. i feel like even though im in a community with people who understand its also not the same experience you know?? i don't fear contamination or choking or vomiting or any of that. i just don't like food and it makes me feel lazy or like im just finding reasons to complain. \n\nim physically never hungry, and i can go without eating until i start to physically shake. i hate eating. it feels like a chore to me. ill eat the foods i like where i can because at least then it's halfway of an enjoyable experience. there's more foods i CAN eat but usually don't bc i just... don't want them and im not interested in them. \n\nim also willing to try SOME things, but if i don't like it immediately then im out. some foods still make me gag though. can't stand smelling or seeing them or being around them. i feel like the only foods i actually WANT all the time and would like to try are sweets, bc candy is usually always safe for me. it sucks!! i know trying food won't kill me, but im afraid of wasting money or having a bad experience or hating food even more. but i feel like if i don't expand my diet, it makes me lazy. after all, im not AFRAID of dying or anything...ugh :(",
  "url": "https://www.reddit.com/r/ARFID/comments/1fcdbbh/does_anyone_else_here_have_the_lack_of_interest/",
  "score": 150,
  "num_comments": 40,
  "comments": [
    {
      "id": "lm7jork",
      "author": "None",
      "body": "Eating is so exhausting for me, I’m hardly ever hungry so each time it’s like forcing myself to eat and it’s just a bloody unpleasant experience. I wish we could just take some pills or get nutrition through an IV at this point lmao.",
      "created_utc": 1725844231.0,
      "score": 79,
      "context": []
    },
    {
      "id": "lm7mqkb",
      "author": "retropillow",
      "body": "I sometimes feel so unreasonably upset that I have to eat to survive.\n\nI hate eating. It's not fun, it's boring, and it makes the process of making it so much harder.",
      "created_utc": 1725845426.0,
      "score": 36,
      "context": []
    },
    {
      "id": "lm7j2ze",
      "author": "prettyandright",
      "body": "Totally align with all of this. I just find eating to be unpleasant and a chore.",
      "created_utc": 1725843993.0,
      "score": 28,
      "context": []
    },
    {
      "id": "lm7ljwd",
      "author": "AcanthaceaePlayful16",
      "body": "Same. It wasn’t that way when I was a kid, but I think extreme stress affected my appetite and it never really came back. Now, I have very little interest in eating outside of foods I enjoy. I do however still have some contamination fear. But really I just wish I could feel appetite and not just the physiological “YOU NEED TO EAT RIGHT NOW OR YOU’LL PASS OUT”. Don’t even get me started on those folks who say “I wish I had that problem”. No…no you don’t. The mental effects of not eating is horrific. At the worst of it I thought I had a brain tumor because of my symptoms. If I could take a daily pill that covered all my bases and just eat when I feel like it, I’d take it in a heartbeat.\nETA: the stomach issues are something else too. If you don’t use it…you start to lose it:/",
      "created_utc": 1725844961.0,
      "score": 29,
      "context": []
    },
    {
      "id": "lm7q52y",
      "author": "angelneliel",
      "body": "Totally relate. \n\nLack of interest and sensory sensitivity subtype combined are actually hell lol but at least hunger isn't something I feel much/often. I only really hate feeling hungry when I'm out and need to go somewhere but don't have the energy. Like I'm afraid I'll collapse on the street lol. And I hate the migraines that come with hunger. But hunger alone I find is more of an annoyance than something I find is \"painful\", as most people seem to describe it as.\n\nI eat one meal a day, but most days no meals, just a few snacks. Making food is the most irritating chore on the planet, in my opinion. Constantly spending all day in the kitchen, wasting money on food that goes bad, needing to plan meals ahead of time, planning to make sure food doesn't go bad, cleaning the dishes, drying the dishes, putting away the dishes, touching dirty dishes, smelling rotten food, seeing rotten food, chopping up food, washing food, calculating nutrition to make sure you get all that the nutrients you need. Just food and everything that comes with it, I hate it. I'm chronically malnourished and this will definitely be my cause of death/fatal illness.\n\nI remember once seeing a screenshot of someone say \"I'm a foodie\" on a dating site, and all the comments were like \"we're all foodies, that's what it means to be alive, you're not special\" and I could not disagree more. \n\nI hate food so much. Food is the bane of my existence. There are so few foods I can actually tolerate and they're not always affordable or accessible and it's so boring eating the same thing until I get sick of it and don't even get me started on the effort and energy needed for actually cooking and preparing food. OMG. \n\nAnyway. I relate. But you're right, it's not something I see often discussed on this subreddit, but it does exist. Glad you posted about it today.",
      "created_utc": 1725846767.0,
      "score": 16,
      "context": []
    },
    {
      "id": "lm890u9",
      "author": "NayanaGor",
      "body": "It feels like this post was written by me, word for word. I'm sorry you're struggling, but know you're not alone.\n\nI survive on candy, McDonald's and ramen at this point.",
      "created_utc": 1725854804.0,
      "score": 8,
      "context": []
    },
    {
      "id": "lm7ljfm",
      "author": "TashaT50",
      "body": "I take an hour break after breakfast because eating is exhausting. Dinner doesn’t require the same kind of down time but it’s a chore to sit for meals. I do ok if I snack while reading or playing games but just eating to eat is not my thing unless I’m out at a favorite restaurant. \n\nThis week I’ve skipped dinner as we’ve run out of safe food in the house and grocery shopping hasn’t been doable. My housemate has had a few things they can eat. If I ignore my hunger cues after an hour they disappear.\n\nI’m lucky that while there are a number of foods I won’t eat the ones I will can be prepared a bunch of different ways.",
      "created_utc": 1725844956.0,
      "score": 7,
      "context": []
    },
    {
      "id": "lm954zt",
      "author": "SB_Wife",
      "body": "I definitely am in that lack of interest category and I feel awful sometimes. My safe foods are highly processed and calorie dense, being mostly ready to eat stuff, so I'm fat too. It feels like a huge paradox and when I tell people I'm uninterested in food, or wish I could have an equivalent to kibble or something, people don't believe me because, well, I'm fat.",
      "created_utc": 1725875719.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lm7lvnc",
      "author": "Kittencab00dles",
      "body": "Yep ♥️ I used to feel hungry more too… now it’s like why do I feel like I want to burn my house down oh I haven’t eaten today. And then it doesn’t feel good to eat, if I can convince myself it’s worth the effort to probably have to start the process by doing neglected dishes and grocery shop first.",
      "created_utc": 1725845090.0,
      "score": 6,
      "context": []
    },
    {
      "id": "lm837bw",
      "author": "bewarethelemurs",
      "body": "My main issue is sensory, but my lack of appetite/interest in food definitely doesn't help. Eating is so much work.",
      "created_utc": 1725852137.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lm7l4x1",
      "author": "overduedevil",
      "body": "you sound like my brain. i hate it here.",
      "created_utc": 1725844795.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lm7plky",
      "author": "SachiKaM",
      "body": "Once my therapist really took the time to understand this concept, it became easier to combat. I’m not just not in the mood for X, I’m not hungry, therefore Y nor Z are spoiling any interest.",
      "created_utc": 1725846554.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lmdgolh",
      "author": "Markus_314",
      "body": "I also have a lack of interest subtype, and I feel bad about too. I feel guilty that a lot of the times I don’t finish my food are just because I “just don’t want to.” I feel like it makes me look immature and lazy. I do get hungry and I enjoy the tastes of foods, but I don’t really like the process of eating, it feels like a chore for me too. So I usually stop eating after I’ve had a few bites.",
      "created_utc": 1725932437.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lm7l2oz",
      "author": "nanatella22",
      "body": "I thought I was lazy about food too but my nutritionist explained is from that lack of interest in food.  Im eating more regularly but I still need to set alarms and just do it bc I need to",
      "created_utc": 1725844771.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lm7llsy",
      "author": "bio_coop",
      "body": "I only eat if I have to, ie if I'm starving.",
      "created_utc": 1725844982.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lma64rv",
      "author": "Miserable-Coffee",
      "body": "Me. I’m living off a feeding tube now and I’m honestly so happy that I don’t have to eat 3 big meals a day everyday for the rest of my life",
      "created_utc": 1725892465.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lm7rp2k",
      "author": "None",
      "body": "fade escape foolish divide middle towering clumsy literate axiomatic pie\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
      "created_utc": 1725847379.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lm92wbl",
      "author": "Alarow",
      "body": "I don't know if my lack of interest for different foods comes from the fact that I've had arfid for almost my entire life, or if it is the cause of said arfid",
      "created_utc": 1725874169.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lman7ag",
      "author": "GravityDefining",
      "body": "I do experience the lack of interest for sure. Honestly if I had the choice I would just never eat again lol",
      "created_utc": 1725898267.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lmbs02v",
      "author": "SomeTraits",
      "body": "Well, it's almost 10 PM here, I haven't eaten yet, and I'll probably just have a glass of milk before going to bed so that I don't go to sleep with the anxiety of fainting due to hypoglycemia like it happened many times before.\n\nYou're not the only one who finds eating a chore; I'd say it's even more of a hassle when you only eat almost exclusively 2 different meals.\n\nI wish I was kidding.",
      "created_utc": 1725911588.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lmc36q6",
      "author": "unicorn_in-training",
      "body": "My ARFID is definitely anxiety/sensory/texture-based but I recently went through a phase where I had little interest in eating and it felt like such a chore! I really feel for those of you who experience that always.\n\nSending love to all of you as this disorder is so difficult to live with!",
      "created_utc": 1725915056.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lmcu61m",
      "author": "Traumarama79",
      "body": "Nah. This was my subtype in active addiction. I had overcome the sensory subtype (my childhood subtype) but was too drunk and high to develop the aversive outcomes subtype (my current subtype). I didn't want to eat at all. Just couldn't be bothered. It was boring. I wanted food to just be in pill form.",
      "created_utc": 1725924257.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lorjzrm",
      "author": "None",
      "body": "Yah, I find it annoying how much of my time, money, and energy is forcefully bent on eating. No one is ever sympathetic though to my struggles with food, instead saying they’re “jealous” and how I’m “lucky.” As if I’m lucky to have never surpassed a bmi of 16, or lucky to have genuinely feared starving to death, or am lucky to deal with the complications associated with being chronically underweight. -_-\n\nI have the personal trifecta of\nneurodivergence (AuDHD) steering me towards arfid, neglectful/abusive upbringing that taught me that neither food nor my health was a priority or even a necessity, and wonkiness/bleh genetics that make me predisposed to having difficulty with weight gain (marfanoid hypermobility syndrome is the closest descriptor I found (I check virtually every box) though its unfortunately extremely little researched).\n\nYou might find some camaraderie on r/underweight as many of us on there deal with the problem of lack of interest in food.",
      "created_utc": 1727216876.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lmafe1r",
      "author": "smil3-22",
      "body": "Yes 🙋🏼‍♀️ This is me!!",
      "created_utc": 1725895570.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lmbrygj",
      "author": "Icy-Coffee-7452",
      "body": "I've always been like this. If it wasn't snacks or food I loved - I would want to eat. I still always snack or only want to eat pasta and chicken nuggets. It's hard especially when my boyfriend makes food and I just am repulsed by it but I eat it anyway because he made it. I found out I love chicken dumplings and  anytime he makes those I devour them and he always gives me an extra even after I say I only want a few because he knows I love them and will eat the extra one. We had noodles, mushrooms, and chicken pasta the other day - I am repulsed by it now. It sucks. I just want to eat but it's so tiring and annoying. If my safe foods aren't in the house - I don't want anything. If my safe foods are in the house - I'll try something. I can go without eating but even then that's not very enjoyable.",
      "created_utc": 1725911574.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lmgd0c1",
      "author": "SPowerfit",
      "body": "I AM THE SAME WAY",
      "created_utc": 1725983223.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lmghx43",
      "author": "Safe_Conclusion_88",
      "body": "I completely relate. Sending love 💕💕💕 I believe in us",
      "created_utc": 1725984785.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lmiqsuq",
      "author": "PotThosPlants",
      "body": "I can relate soo deeply to this. Im not thin for it but unless it’s easily palatable, I couldn’t be less interested in eating. And I rarely feel like eating. So I end up eating empty carbs, sugar and fat primarily. It is NOT fun and I have been weak and shaky from not getting enough nutrients.",
      "created_utc": 1726010999.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lm7jz4a",
      "author": "None",
      "body": "omg RIGHT... i eat one meal a day and i make sure to make it as big as possible so i don't have to eat again. it's the same every day... get up, cook a meal at around the same hour, eat it, rinse and repeat. it feels so damn robotic!!!",
      "created_utc": 1725844344.0,
      "score": 22,
      "context": [
        {
          "id": "lm7jork",
          "author": "None",
          "body": "Eating is so exhausting for me, I’m hardly ever hungry so each time it’s like forcing myself to eat and it’s just a bloody unpleasant experience. I wish we could just take some pills or get nutrition through an IV at this point lmao.",
          "created_utc": 1725844231.0
        }
      ]
    },
    {
      "id": "lm7mnbc",
      "author": "None",
      "body": "it's so interesting that some people develop arfid later in life - this is all I've ever known. im very sorry to hear that this has happened to you and i totally agree! i wish i could take a magic supplement that covers all my bases instead of having to think about what to eat, if it'll give me enough nutrition, how much time it'll take to cook, if i even want it... it feels entirely like a chore. i also have autism, so ive fixated on things so STRONGLY for the entire day that i completely forget to eat and i feel like im about to pass out. it feels TERRIBLE",
      "created_utc": 1725845390.0,
      "score": 8,
      "context": [
        {
          "id": "lm7ljwd",
          "author": "AcanthaceaePlayful16",
          "body": "Same. It wasn’t that way when I was a kid, but I think extreme stress affected my appetite and it never really came back. Now, I have very little interest in eating outside of foods I enjoy. I do however still have some contamination fear. But really I just wish I could feel appetite and not just the physiological “YOU NEED TO EAT RIGHT NOW OR YOU’LL PASS OUT”. Don’t even get me started on those folks who say “I wish I had that problem”. No…no you don’t. The mental effects of not eating is horrific. At the worst of it I thought I had a brain tumor because of my symptoms. If I could take a daily pill that covered all my bases and just eat when I feel like it, I’d take it in a heartbeat.\nETA: the stomach issues are something else too. If you don’t use it…you start to lose it:/",
          "created_utc": 1725844961.0
        }
      ]
    },
    {
      "id": "lmdhj9w",
      "author": "Fatcat30062",
      "body": "You have literally put my thoughts into words! \nFood is the absolute worst! Grabbing chocolate or something small is doable and takes away a lot of the preparation, cleaning, organising, worry, etc about dishes and food, but it is far from nutritious! \nThank you for articulating my brain with such precision! I appreciate it a lot!",
      "created_utc": 1725932757.0,
      "score": 6,
      "context": [
        {
          "id": "lm7q52y",
          "author": "angelneliel",
          "body": "Totally relate. \n\nLack of interest and sensory sensitivity subtype combined are actually hell lol but at least hunger isn't something I feel much/often. I only really hate feeling hungry when I'm out and need to go somewhere but don't have the energy. Like I'm afraid I'll collapse on the street lol. And I hate the migraines that come with hunger. But hunger alone I find is more of an annoyance than something I find is \"painful\", as most people seem to describe it as.\n\nI eat one meal a day, but most days no meals, just a few snacks. Making food is the most irritating chore on the planet, in my opinion. Constantly spending all day in the kitchen, wasting money on food that goes bad, needing to plan meals ahead of time, planning to make sure food doesn't go bad, cleaning the dishes, drying the dishes, putting away the dishes, touching dirty dishes, smelling rotten food, seeing rotten food, chopping up food, washing food, calculating nutrition to make sure you get all that the nutrients you need. Just food and everything that comes with it, I hate it. I'm chronically malnourished and this will definitely be my cause of death/fatal illness.\n\nI remember once seeing a screenshot of someone say \"I'm a foodie\" on a dating site, and all the comments were like \"we're all foodies, that's what it means to be alive, you're not special\" and I could not disagree more. \n\nI hate food so much. Food is the bane of my existence. There are so few foods I can actually tolerate and they're not always affordable or accessible and it's so boring eating the same thing until I get sick of it and don't even get me started on the effort and energy needed for actually cooking and preparing food. OMG. \n\nAnyway. I relate. But you're right, it's not something I see often discussed on this subreddit, but it does exist. Glad you posted about it today.",
          "created_utc": 1725846767.0
        }
      ]
    },
    {
      "id": "ln1z7lr",
      "author": "Upbeat_Tutor5332",
      "body": "i have to screenshot you comment it's so perfect",
      "created_utc": 1726300680.0,
      "score": 3,
      "context": [
        {
          "id": "lm7q52y",
          "author": "angelneliel",
          "body": "Totally relate. \n\nLack of interest and sensory sensitivity subtype combined are actually hell lol but at least hunger isn't something I feel much/often. I only really hate feeling hungry when I'm out and need to go somewhere but don't have the energy. Like I'm afraid I'll collapse on the street lol. And I hate the migraines that come with hunger. But hunger alone I find is more of an annoyance than something I find is \"painful\", as most people seem to describe it as.\n\nI eat one meal a day, but most days no meals, just a few snacks. Making food is the most irritating chore on the planet, in my opinion. Constantly spending all day in the kitchen, wasting money on food that goes bad, needing to plan meals ahead of time, planning to make sure food doesn't go bad, cleaning the dishes, drying the dishes, putting away the dishes, touching dirty dishes, smelling rotten food, seeing rotten food, chopping up food, washing food, calculating nutrition to make sure you get all that the nutrients you need. Just food and everything that comes with it, I hate it. I'm chronically malnourished and this will definitely be my cause of death/fatal illness.\n\nI remember once seeing a screenshot of someone say \"I'm a foodie\" on a dating site, and all the comments were like \"we're all foodies, that's what it means to be alive, you're not special\" and I could not disagree more. \n\nI hate food so much. Food is the bane of my existence. There are so few foods I can actually tolerate and they're not always affordable or accessible and it's so boring eating the same thing until I get sick of it and don't even get me started on the effort and energy needed for actually cooking and preparing food. OMG. \n\nAnyway. I relate. But you're right, it's not something I see often discussed on this subreddit, but it does exist. Glad you posted about it today.",
          "created_utc": 1725846767.0
        }
      ]
    },
    {
      "id": "ln1zn67",
      "author": "Upbeat_Tutor5332",
      "body": "i'm also riding the no money no safe foods train. always.. but right now, much worse than usual. it blows. i feel your pain.\n\n\nand like, the less i eat, the less i can work, the less money i can make, the less food i can buy, the less i can eat.... how are we supposed to get out of this cycle",
      "created_utc": 1726300985.0,
      "score": 3,
      "context": [
        {
          "id": "lm7ljfm",
          "author": "TashaT50",
          "body": "I take an hour break after breakfast because eating is exhausting. Dinner doesn’t require the same kind of down time but it’s a chore to sit for meals. I do ok if I snack while reading or playing games but just eating to eat is not my thing unless I’m out at a favorite restaurant. \n\nThis week I’ve skipped dinner as we’ve run out of safe food in the house and grocery shopping hasn’t been doable. My housemate has had a few things they can eat. If I ignore my hunger cues after an hour they disappear.\n\nI’m lucky that while there are a number of foods I won’t eat the ones I will can be prepared a bunch of different ways.",
          "created_utc": 1725844956.0
        }
      ]
    },
    {
      "id": "lmb8gcp",
      "author": "None",
      "body": "i am SO sorry!!! my heart goes out to overweight ppl with arfid. you shouldn't have to struggle like that and still have nobody believe you :( i wish you the best of luck",
      "created_utc": 1725905333.0,
      "score": 3,
      "context": [
        {
          "id": "lm954zt",
          "author": "SB_Wife",
          "body": "I definitely am in that lack of interest category and I feel awful sometimes. My safe foods are highly processed and calorie dense, being mostly ready to eat stuff, so I'm fat too. It feels like a huge paradox and when I tell people I'm uninterested in food, or wish I could have an equivalent to kibble or something, people don't believe me because, well, I'm fat.",
          "created_utc": 1725875719.0
        }
      ]
    },
    {
      "id": "lm7kkkq",
      "author": "None",
      "body": "That’s really good that you’re able to eat the full big meal! My appetite is so low I nibble at the same plate of food for hours. I usually have half then leave it and come back to it in an hour. Smaller meals seem to work for me but then again because of this eating takes up a good portion of my time…",
      "created_utc": 1725844578.0,
      "score": 16,
      "context": [
        {
          "id": "lm7jork",
          "author": "None",
          "body": "Eating is so exhausting for me, I’m hardly ever hungry so each time it’s like forcing myself to eat and it’s just a bloody unpleasant experience. I wish we could just take some pills or get nutrition through an IV at this point lmao.",
          "created_utc": 1725844231.0
        },
        {
          "id": "lm7jz4a",
          "author": "None",
          "body": "omg RIGHT... i eat one meal a day and i make sure to make it as big as possible so i don't have to eat again. it's the same every day... get up, cook a meal at around the same hour, eat it, rinse and repeat. it feels so damn robotic!!!",
          "created_utc": 1725844344.0
        }
      ]
    },
    {
      "id": "lm7n35r",
      "author": "Nearby-Ad5666",
      "body": "I have to eat 2 meals and supplement with protein drinks and hydration stuff to not pass out. But it's always a chore I do choke, my esophagus is hosed but I also have very little sense of smell and taste.\n\nI lowered my standards, I no longer expect stuff to taste good, it's purpose is just to keep me functioning. It's still a huge chore",
      "created_utc": 1725845567.0,
      "score": 4,
      "context": [
        {
          "id": "lm7jork",
          "author": "None",
          "body": "Eating is so exhausting for me, I’m hardly ever hungry so each time it’s like forcing myself to eat and it’s just a bloody unpleasant experience. I wish we could just take some pills or get nutrition through an IV at this point lmao.",
          "created_utc": 1725844231.0
        },
        {
          "id": "lm7jz4a",
          "author": "None",
          "body": "omg RIGHT... i eat one meal a day and i make sure to make it as big as possible so i don't have to eat again. it's the same every day... get up, cook a meal at around the same hour, eat it, rinse and repeat. it feels so damn robotic!!!",
          "created_utc": 1725844344.0
        }
      ]
    },
    {
      "id": "lm7xfea",
      "author": "lizardgal10",
      "body": "I think I’ve always had pieces of it, but it’s definitely been more of an issue the past few years. Eating is such a chore, especially if I’m not home. I’m pretty busy so some weeks I basically live on the one restaurant I can consistently eat.",
      "created_utc": 1725849702.0,
      "score": 5,
      "context": [
        {
          "id": "lm7ljwd",
          "author": "AcanthaceaePlayful16",
          "body": "Same. It wasn’t that way when I was a kid, but I think extreme stress affected my appetite and it never really came back. Now, I have very little interest in eating outside of foods I enjoy. I do however still have some contamination fear. But really I just wish I could feel appetite and not just the physiological “YOU NEED TO EAT RIGHT NOW OR YOU’LL PASS OUT”. Don’t even get me started on those folks who say “I wish I had that problem”. No…no you don’t. The mental effects of not eating is horrific. At the worst of it I thought I had a brain tumor because of my symptoms. If I could take a daily pill that covered all my bases and just eat when I feel like it, I’d take it in a heartbeat.\nETA: the stomach issues are something else too. If you don’t use it…you start to lose it:/",
          "created_utc": 1725844961.0
        },
        {
          "id": "lm7mnbc",
          "author": "None",
          "body": "it's so interesting that some people develop arfid later in life - this is all I've ever known. im very sorry to hear that this has happened to you and i totally agree! i wish i could take a magic supplement that covers all my bases instead of having to think about what to eat, if it'll give me enough nutrition, how much time it'll take to cook, if i even want it... it feels entirely like a chore. i also have autism, so ive fixated on things so STRONGLY for the entire day that i completely forget to eat and i feel like im about to pass out. it feels TERRIBLE",
          "created_utc": 1725845390.0
        }
      ]
    },
    {
      "id": "lm7lzxs",
      "author": "None",
      "body": "ohh i can definitely relate to this especially for some food more than others haha. i tend to overeat for that single meal and keep going even if my body is yelling at me that im full. i eat so minimally from day to day that i convince myself i just NEED the nutrition and get it over with. \n\ni have a trick though that i haven't seen anyone use. my parents think im bizarre for eating a bit of sugary food/candy on an empty stomach before eating, but it actually stimulates hunger for me! i have no idea why.",
      "created_utc": 1725845138.0,
      "score": 13,
      "context": [
        {
          "id": "lm7jork",
          "author": "None",
          "body": "Eating is so exhausting for me, I’m hardly ever hungry so each time it’s like forcing myself to eat and it’s just a bloody unpleasant experience. I wish we could just take some pills or get nutrition through an IV at this point lmao.",
          "created_utc": 1725844231.0
        },
        {
          "id": "lm7jz4a",
          "author": "None",
          "body": "omg RIGHT... i eat one meal a day and i make sure to make it as big as possible so i don't have to eat again. it's the same every day... get up, cook a meal at around the same hour, eat it, rinse and repeat. it feels so damn robotic!!!",
          "created_utc": 1725844344.0
        },
        {
          "id": "lm7kkkq",
          "author": "None",
          "body": "That’s really good that you’re able to eat the full big meal! My appetite is so low I nibble at the same plate of food for hours. I usually have half then leave it and come back to it in an hour. Smaller meals seem to work for me but then again because of this eating takes up a good portion of my time…",
          "created_utc": 1725844578.0
        }
      ]
    },
    {
      "id": "lm7n6en",
      "author": "Nearby-Ad5666",
      "body": "It gets your pancreas and gallbladder going",
      "created_utc": 1725845604.0,
      "score": 5,
      "context": [
        {
          "id": "lm7jork",
          "author": "None",
          "body": "Eating is so exhausting for me, I’m hardly ever hungry so each time it’s like forcing myself to eat and it’s just a bloody unpleasant experience. I wish we could just take some pills or get nutrition through an IV at this point lmao.",
          "created_utc": 1725844231.0
        },
        {
          "id": "lm7jz4a",
          "author": "None",
          "body": "omg RIGHT... i eat one meal a day and i make sure to make it as big as possible so i don't have to eat again. it's the same every day... get up, cook a meal at around the same hour, eat it, rinse and repeat. it feels so damn robotic!!!",
          "created_utc": 1725844344.0
        },
        {
          "id": "lm7kkkq",
          "author": "None",
          "body": "That’s really good that you’re able to eat the full big meal! My appetite is so low I nibble at the same plate of food for hours. I usually have half then leave it and come back to it in an hour. Smaller meals seem to work for me but then again because of this eating takes up a good portion of my time…",
          "created_utc": 1725844578.0
        },
        {
          "id": "lm7lzxs",
          "author": "None",
          "body": "ohh i can definitely relate to this especially for some food more than others haha. i tend to overeat for that single meal and keep going even if my body is yelling at me that im full. i eat so minimally from day to day that i convince myself i just NEED the nutrition and get it over with. \n\ni have a trick though that i haven't seen anyone use. my parents think im bizarre for eating a bit of sugary food/candy on an empty stomach before eating, but it actually stimulates hunger for me! i have no idea why.",
          "created_utc": 1725845138.0
        }
      ]
    },
    {
      "id": "ln1yug4",
      "author": "Upbeat_Tutor5332",
      "body": "i use this trick! :) it also helps stave off nausea. i often eat a bit of candy or milk before trying more food, and also first thing in the morning like while still in bed. skittles for the win. keep that morning vom at bay.",
      "created_utc": 1726300418.0,
      "score": 3,
      "context": [
        {
          "id": "lm7jork",
          "author": "None",
          "body": "Eating is so exhausting for me, I’m hardly ever hungry so each time it’s like forcing myself to eat and it’s just a bloody unpleasant experience. I wish we could just take some pills or get nutrition through an IV at this point lmao.",
          "created_utc": 1725844231.0
        },
        {
          "id": "lm7jz4a",
          "author": "None",
          "body": "omg RIGHT... i eat one meal a day and i make sure to make it as big as possible so i don't have to eat again. it's the same every day... get up, cook a meal at around the same hour, eat it, rinse and repeat. it feels so damn robotic!!!",
          "created_utc": 1725844344.0
        },
        {
          "id": "lm7kkkq",
          "author": "None",
          "body": "That’s really good that you’re able to eat the full big meal! My appetite is so low I nibble at the same plate of food for hours. I usually have half then leave it and come back to it in an hour. Smaller meals seem to work for me but then again because of this eating takes up a good portion of my time…",
          "created_utc": 1725844578.0
        },
        {
          "id": "lm7lzxs",
          "author": "None",
          "body": "ohh i can definitely relate to this especially for some food more than others haha. i tend to overeat for that single meal and keep going even if my body is yelling at me that im full. i eat so minimally from day to day that i convince myself i just NEED the nutrition and get it over with. \n\ni have a trick though that i haven't seen anyone use. my parents think im bizarre for eating a bit of sugary food/candy on an empty stomach before eating, but it actually stimulates hunger for me! i have no idea why.",
          "created_utc": 1725845138.0
        }
      ]
    }
  ]
}