{
  "id": "1febzrj",
  "subreddit": "ARFID",
  "author": "Sufficient_Row4394",
  "created_utc": 1726066124.0,
  "title": "what eating habits do you have that only people in this sub would understand?",
  "selftext": "for me:\n\n- cannot eat foods that are expiring / going out of date within 2 days or less.\n\n- cannot eat / drink anything that has been opened. like, if i open a carton of oat milk, i can only drink from it for that day; the next day, it's off limits. luckily i have a fiance who finishes everything i open so nothing goes to waste.\n\n- if the cooking time says 15 mins, you bet i'm cooking it for 25 mins just to make sure it's cooked (and consequently burnt to a crisp).\n\n- upon any attempt to eat the last bit of food on my plate, it will instantly be spat back out onto my plate. so we just leave that bit alone.",
  "url": "https://www.reddit.com/r/ARFID/comments/1febzrj/what_eating_habits_do_you_have_that_only_people/",
  "score": 149,
  "num_comments": 129,
  "comments": [
    {
      "id": "lmm2mdf",
      "author": "None",
      "body": "A pack of saltines is more satisfying than a 3 course meal.",
      "created_utc": 1726066464.0,
      "score": 115,
      "context": []
    },
    {
      "id": "lmm4vtn",
      "author": "crashnebulaa_a",
      "body": "The blander the better (except salt I love salt)",
      "created_utc": 1726067199.0,
      "score": 93,
      "context": []
    },
    {
      "id": "lmmufp8",
      "author": "Affectionate_Fly8319",
      "body": "Eating the same thing over and over again until one day I am absolutely disgusted by it",
      "created_utc": 1726075347.0,
      "score": 69,
      "context": []
    },
    {
      "id": "lmma38n",
      "author": "FawnTi",
      "body": "Moldy food isn’t safe to eat just because you cut off the part that had visible blue mold. There is still invisible mold still in anything that’s been around it.",
      "created_utc": 1726068860.0,
      "score": 47,
      "context": []
    },
    {
      "id": "lmm5mk8",
      "author": "Pinkandpurpleleaves",
      "body": "I relate to the first 2 so much! Here are a few of mine!\n\nIf I want to take another plate of the food that is made that evening I can only eat it if it was covered up right after the first servings. \n\nSome foods are not allowed to touch and will get their own plate/bowl. \n\nIf something is rotting in the fridge, everything surrounding it that might be contaminated needs to go too.\n\nHeating up food that was in the fridge and prepped on another day (like soup, pasta..) are a absolute no go!\n\nPutting things in the microwave to heat up after somebody used it for food with a strong smell is a no go (like salmon or other fish).\n\nI eat better when I watch a show or movie (distracts me from the food).\n\nI can never use the same serving spoon for two dishes, because then one gets all over the other and changes the taste of it. \n\nIf I get a new drink it needs to be in a new glass.",
      "created_utc": 1726067438.0,
      "score": 41,
      "context": []
    },
    {
      "id": "lmme6l1",
      "author": "Maleficent_Bridge_46",
      "body": "I won’t eat in front of others. I don’t know why but I just can’t. I need to be alone to eat",
      "created_utc": 1726070162.0,
      "score": 36,
      "context": []
    },
    {
      "id": "lmmrqxa",
      "author": "caliharls",
      "body": "Randomly realizing the bite of food I was chewing is indeed disgusting and I need it out of my mouth NOW, but instead of spitting it out (maybe we’re in public), just having to take a huge swig of my drink and then swallowing the food like a pill. 🙃",
      "created_utc": 1726074496.0,
      "score": 33,
      "context": []
    },
    {
      "id": "lmm5lnk",
      "author": "blackmetalwarlock",
      "body": "Can’t eat unless I’m home or in a place I am comfortable.",
      "created_utc": 1726067430.0,
      "score": 27,
      "context": []
    },
    {
      "id": "lmmgv50",
      "author": "follow_illumination",
      "body": "Most foods, I can't stand reheated. It changes the texture too much.",
      "created_utc": 1726071024.0,
      "score": 26,
      "context": []
    },
    {
      "id": "lmmsxtd",
      "author": "JustbyLlama",
      "body": "I am own worst enemy when it comes to food, if a single thought crosses my mind that the food may not be good - nothing on this earth will cause me to eat it. \n\nI can’t wait too long on eating or my system will decide it no longer eats food, thanks so much.",
      "created_utc": 1726074875.0,
      "score": 28,
      "context": []
    },
    {
      "id": "lmm7bl9",
      "author": "communistsayori",
      "body": "I won't eat if one of my family members is eating soup. I cannot stand the smell of it, I just leave the kitchen and wait until they're done.",
      "created_utc": 1726067983.0,
      "score": 11,
      "context": []
    },
    {
      "id": "lmmxtvz",
      "author": "giraffemoo",
      "body": "Eating the exact same dinner for most nights over the last 25 years",
      "created_utc": 1726076415.0,
      "score": 12,
      "context": []
    },
    {
      "id": "lmmmucz",
      "author": "UnicornStar1988",
      "body": "Struggle to eat food that I haven’t eaten in a while, only continuous food I can eat.",
      "created_utc": 1726072938.0,
      "score": 10,
      "context": []
    },
    {
      "id": "lmmcs0w",
      "author": "dainty_dryad",
      "body": "I love kielbasa, bit it HAS to be from this one polish place around the corner, and I cannot get it myself,  ( \nI'll \"do it wrong\", thank gods for my fiance) and it *HAS* to be cut into rectangles, not circles, and then cooked till it is crispy (basically burnt as fuck). But omg when it's good it's GOOD! 🤤 \n\nDamn...now I want crispy rectangles of kielbasa from around the corner...",
      "created_utc": 1726069714.0,
      "score": 8,
      "context": []
    },
    {
      "id": "lmn7egm",
      "author": "jeannesloaf",
      "body": "I eat raw pasta as a snack.",
      "created_utc": 1726079453.0,
      "score": 8,
      "context": []
    },
    {
      "id": "lmmngpb",
      "author": "Armayra",
      "body": "The first one for sure! The closer to the exp date it gets the more it feels like I'm playing Russian roulette. \n\nI'm similar to the second one, although mine is a 3 day limit (except for cheese and oat/rice milk. Those can go until a week before they expire). Although if I get leftovers from one of the two restaurants I'll eat at, those leftovers have to be eaten later that day or they become a no go. Doesn't matter if I went straight home and immediately put it in the fridge. If it's been in there over night it becomes a big nope.\n\nI have to keep a frozen thing of water with a penny on top in the freezer or I won't trust that it didn't thaw everything out/refreeze and not tell me?\n\nI have to cook for myself, because \"how do I know you didn't use expired food and/or one of my unsafe foods?\" (I blame my dad for this one - he's the poster child of ignoring exp dates on food)",
      "created_utc": 1726073136.0,
      "score": 7,
      "context": []
    },
    {
      "id": "lmpuc20",
      "author": "Whjoy",
      "body": "I hate cooking!! I hate making food! I have no motivation to do anything like that and will go without meals because I just don’t want to cook but I don’t have money to spend",
      "created_utc": 1726114379.0,
      "score": 8,
      "context": []
    },
    {
      "id": "lmm6gfc",
      "author": "None",
      "body": "Pizza should absolutely have some black on it. If it's not at least a little burned, it's not done yet.",
      "created_utc": 1726067706.0,
      "score": 13,
      "context": []
    },
    {
      "id": "lmmp13s",
      "author": "IHaveNoUsernameSorry",
      "body": "I can’t eat food on (or after) it’s sell by date, I can only drink milk that’s fresh. If it’s the day after, it’s off limits to me. I also have to cook everything for a long time. If something says 8 minutes to cook, I’m cooking it for 30 minutes.",
      "created_utc": 1726073631.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lmn9t3j",
      "author": "meladey",
      "body": "We're basically the same person, thank goodness my time on opened things has expanded to 3-5 days depending on the item!!! It took so much ERP therapy and a lot of meltdowns and panic but I can eat things the next day with no thought and up to 3 days with minimal thoughts :) 4 and 5 still push me, and I don't think I'll ever go past 5, but, I'm happy with it.",
      "created_utc": 1726080224.0,
      "score": 6,
      "context": []
    },
    {
      "id": "lmosc4a",
      "author": "fairyinthedark",
      "body": "cannot eat any thing someone else bought or touched (i have to buy the food myself and decide if its the \"right\" one) \n\npackaging changes in foods i like \n\nweird shapes or changes in the color/appearance \n\nthe vibes are \"off\" (idk if anyone will understand this one)",
      "created_utc": 1726098760.0,
      "score": 6,
      "context": []
    },
    {
      "id": "lmnd3c1",
      "author": "littleghool",
      "body": "Food cannot simply touch other food.",
      "created_utc": 1726081277.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lmokdo1",
      "author": "BillyYumYumTwo-byTwo",
      "body": "On a podcast I was listening to today (hey riddle riddle), the guest said “I don’t eat cheese or anything that looks like it could be cheese. Like mayo could be cheese, so I don’t eat mayo”. And it was the most I’ve related to anyone, even though I like cheese, because that just makes absolute sense to me.",
      "created_utc": 1726095753.0,
      "score": 6,
      "context": []
    },
    {
      "id": "lmmvu5c",
      "author": "biscottiapricot",
      "body": "when eating a full meal i need to eat vegetables first and then everything else i take turns eating so i finish everything at the same time\n\nand i have to offer my boyfriend a bit of whatever im eating even when we're eating the same thing",
      "created_utc": 1726075787.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lmnbpqd",
      "author": "SeeminglyUselessCups",
      "body": "Food the first day it’s made is for eating\nFood that was made yesterday is for eating\nFood that was made 2 days ago is for contemplating if I wanna eat that(I never do)\nFood that was made 3 days ago is for side eyeing\nFood that was made 4 days ago… I’M SO FUCKING SCARED",
      "created_utc": 1726080834.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lmnor31",
      "author": "None",
      "body": "I can’t eat the ends of French fries and sometimes breadsticks.\n\nI take all the cheese off my pizza…and then sprinkle Parmesan on instead.\n\nHamburgers are ketchup only, always. And I specifically ask at every restaurant that they don’t put a pickle on the bun. No, I can’t just take it off. I will taste it. \n\nFood can’t touch. I have plates with dividers that my family now calls “arfid plates.”\n\nI also am very sensitive to smells, so I won’t eat around others who are eating smelly foods that don’t match mine. For example, I can’t have pancakes if someone is having a burger and fries next to me. And I can never eat near someone who is eating Doritos 🤣",
      "created_utc": 1726084993.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lmo56kb",
      "author": "TheBackyardigirl",
      "body": "If it was bad/made me feel bad once I will never touch it again I don’t care if it’s one of my favorites\n\n\nIf it’s the day of or any time beyond the experation date I will NOT eat it you cannot make me\n\n\nI’ll only eat green guacamole. I know when it turns brown after being opened that part is still perfectly safe but it *looks* horrific\n\n\nPizza, burritos, enchiladas, and grilled cheese have to be cold leftovers. Hot gooey cheese sets off all the bad food alarms",
      "created_utc": 1726090309.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lmod8ge",
      "author": "Stygimolochh",
      "body": "Popcorn for dinner pretty regularly",
      "created_utc": 1726093114.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lmoj8ix",
      "author": "TayVirus",
      "body": "1. Can't do leftovers. The fridge changes the texture\n2. Things I need to eat together I won't eat on their own (ex. Pasta and meatballs. I have to have pasta and a portion of the meatball on the fork for every bite. If I run out of meatballs and there are still noodles I won't eat the rest of the noodles. Same thing for meat and mashed potatoes, I won't finish the potatoes If I run out of meat)\n3. If sauce is sticking out on pizza and I have no topping to cover it, I won't eat that part\n4. I won't freeze and unthaw meat like ground beef to use. It it was frozen I won't use it\n5. If something I don't like touches a part of my food, I need to cut off that section that it touched",
      "created_utc": 1726095327.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lmmtxs9",
      "author": "Pessimisticblue",
      "body": "If something is slightly overcooked i have to hide the overcooked part to be able to eat it.\nI love ranch with chicken, but only certain types of chicken- i won't eat any type of non-breaded chicken with ranch, but i also won't eat fried chicken with it. If I'm eating popcorn chicken or any kind of unbranded breaded chicken i have to mix ranch with ketchup for a little more sweetness. Putting cheese on a chicken sandwich is awful, but only if it's me or family doing it. It's great if it's a restaurant doing it.\nI refuse to cook with oil, and prefer to use butter, unless I'm deep frying something for obvious reasons. This one is moreso because I'm too short to reach than an eating habit.\nIf I'm wearing something nice, I'll eat something 'fancier' so to speak to keep feeling nice.",
      "created_utc": 1726075191.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lmn9iyp",
      "author": "Spud-81",
      "body": "I could be starving but if someone puts vinegar on my takeaway order it's going in the bin.",
      "created_utc": 1726080133.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lmnlrs3",
      "author": "Cronchy_Baking_Soda",
      "body": "Everyone in my family has to put the date on everything that goes into the fridge\n\nI can’t stand eating the same amount of butter as most people, and usually use the smallest sliver of it\n\nIf what I’m eating doesn’t have salt I have to put salt on it or it will sometimes make me nauseous \n\nI leave the room right away if someone is cooking eggs. I will stay in my room until the smell is gone.\n\nIf someone has made rice or pasta I will only eat it if it has just been cooked. I hated it when people leave it to cool on the stove and then put it in the fridge. It’s not going to hurt the fridge\n\nI have to smell the bag of shredded cheese whenever I use it to check if it’s still good, I don’t trust the sell by or best by date. I don’t want to smell the bag, but I and so scared of eating anything that has gone even a little bad\n\nThere’s probably more but this is all I can think of right now",
      "created_utc": 1726084057.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lmoh0wn",
      "author": "aydnic",
      "body": "I need to deconstruct many foods before eating them because I can’t handle more than one consistency at a time.",
      "created_utc": 1726094513.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lmoqhre",
      "author": "diaryofserluna",
      "body": "seasoning salt goes on EVERYTHING that’s warm,\n\nr/slash’s videos make food taste better\n\nif a ant even looks at my drink, then i can no longer drink it as it doesn’t taste right anymore\n\nif something taste good but the texture is too much then i have to spit it out\n\ni can only drink tea, but it has to be Pure Leaf extra sweet\n\nand if a food looks oily/greasy/slimey then i can’t eat it (like seafood, pizza, & bone-in chicken)\n\nall candy is gross except kitkats & ferrero rocher (but i can only eat the chocolate bar one since losing my teeth)\n\nif it smells/taste like fish i cannot eat it\n\nif im in public and my drink has been sitting unattended i cant drink it as it might be poisoned now \n\nand if i leave a drink out for more than 8 hours (at home) i cant drink it as now it tastes days old",
      "created_utc": 1726098062.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lmpc7wi",
      "author": "86CleverUsername",
      "body": "Sometimes I buy food forgetting about mental issues with certain foods (usually meats).\n\nAlso, once I know something gross about a food, there is a 90% I won’t be able to eat it in the short term and a 50% chance that the memory of the grossness will stick with that food forever.\n\nShoutout to that girl in elementary school who seemed to revel in telling me things I did not want to know about my food.\n\nAlso, the halloween season increases my ARFID symptoms dramatically. I actually love macabre things but something about Halloween (the smell of the latex masks, the intentionally gross food) makes it almost impossible for me to eat until Nov 1st.",
      "created_utc": 1726106432.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lmpslhd",
      "author": "None",
      "body": "Leftovers just cannot happen for me. Meal prep is out of the question because I'm not eating anything that wasn't freshly made that day, with one exception - if it's takeout, I can eat it the next day. Beyond that, it's going on the trash. So when I cook, I either cook enough for one meal, or I cook around lunch time enough to eat for lunch and dinner. If there's anything left over after dinner, it's not going in the fridge. It's going in the trash. ",
      "created_utc": 1726113508.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lmpsu91",
      "author": "frenchynerd",
      "body": "-I don't like to eat with other people, I prefer to eat alone and in front of the TV.\n\n-I write down the dates on containers I open (broth, soy milk)\n\n-I'm very strict about expiry dates.\n\n-I put leftovers instantly in the freezer.\n\n-When I bring my lunch to work, I also put it in the freezer in case the fridge is not cold enough.\n\n-I have a fridge alarm that will start if the fridge doesn't stay at the right temperature \n\n-I also prefer to overcook stuff than to risk to undercook it.\n\n-If I have any doubt, to the garbage it goes.",
      "created_utc": 1726113629.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lmq5ce2",
      "author": "Ok-Committee-5867",
      "body": "Struggling to reintroduce foods/losing safe foods. Like yeah I was eating it happily everyday 3 months ago, but now I don’t want anything to do with it!",
      "created_utc": 1726120529.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lmqglab",
      "author": "Queenofwands1212",
      "body": "Can’t really open my eating window until late late night. I eat the same list of about 4-5 things everyday. I eat things that make my colitis flare up and can’t stop. I consume tons of sugar free pudding, it’s one of the only things that feels truly safe anymore. I consume a lot of weird things. Concoctions. Gelatin. Sugar free jello. Idk anymore.",
      "created_utc": 1726128111.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lmqh247",
      "author": "NationalNecessary120",
      "body": "Yeah :/\n\nI once bought food that was discounted. It didn’t SAY on it that it was past expiration.\n\nI didn’t think it was either. Because most stores here have discounted food BEFORE expiration date, but like 1-2 days before, because they want to sell it BEFORE it expires.\n\nSo then I stood by the cashier and checked expiration date and was like ”umm… excuse me this is expired?🤢”\n\nand they said ”yeah?🤷‍♀️ That’s why it is discounted”.",
      "created_utc": 1726128449.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lmqkb76",
      "author": "sphericalcreature",
      "body": "Gotta love giving the no no food to your partner. \n\nI love fries (one of my safe foods) but if the texture of the potato on the inside is wrong, he gets those fries XD\n\nwhen we're at home ill cook some, i look like i have a massive portion compaired to his but i then go through each fries (the squeeze test) and he ends up with a bigger portion than me XD\n\nMy arfid intesity seems to amplify or lessen based on my anxiety , when im extremely anxious i can't eat warm food at all , i have to put chicken nuggets in the fridge for the day and eat them cold XD",
      "created_utc": 1726130812.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lmqo0yu",
      "author": "Ard4i",
      "body": "i cannot eat anything that has more than 2 main textures and 2 main flavors (like sweet and sour) and then i go crazy when i look up \"PLAIN vegan recipes\" because THATS NOT PLAIN THAT HAS LIKE 67 TEXTURES AT ONCE",
      "created_utc": 1726133469.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lmqq9mh",
      "author": "MazeRoom1704",
      "body": "-It makes total sense to eat almost the same stuff every day until one day either sonething screws your routine or you get sick of it. \n\n-  TEXTURE is more important, or at least as important as taste. Tasty food but bad texture: I'm outta here. But bland food with the perfect texture: 🤌🤌🤌\n\n- also craving the sensation of texture tather than flavour\n\n- I like making (playing wirh) food more than eating it. (Perfect conditions for working in a kitchen).\n\n-there is that ONE spoon, that one glass, that one fork ect for certain foods/drinks.\n\n-same food(veggies/ftuit) cut in different shapes = huuuge difference. \n\n- If someone presents me a new food I try it but on my own I 95% stick to the stuff I know and don't try new products or recipes. \n(Only reason I haven't had risotto as a 30+ y/o is simply because it was never presented to me. Same with a lot of other things. I really wanna try risotto actually but you won't catch me buying it for myself because then it's not *~*special*~* 🤣)",
      "created_utc": 1726135013.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lmqw9e8",
      "author": "None",
      "body": "Thank you for posting I can resonate so much with your post especially point one and three. I thought it was just me!",
      "created_utc": 1726138675.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lmunqxj",
      "author": "IndividualBonus1442",
      "body": "I do each and every single one of these things",
      "created_utc": 1726186004.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lmvf4rx",
      "author": "JadeVampyre",
      "body": "Oof, the last bite one. I never understood why I couldn't eat that last bite on many foods until I found out that I had ARFID",
      "created_utc": 1726196463.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ln08754",
      "author": "ChaoticMornings",
      "body": "Sometimes when something like applesauce that I always put in the fridge because I like it cold, has been unopened in the fridge for too long, even tho it doesn't expire for at least another 4 months, will end up in the trash because I really have trust issues.\n\nI know that it has been stored long before I bought it and it should be fine. But, no. I once experienced food poisening, even tho, that most likely was from yoghurt and fish, I'm not going to go through that ever again and for the life of me, that apple sauce can't be trusted.",
      "created_utc": 1726269289.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lmnwrfq",
      "author": "sayorihanginaround",
      "body": "i only eat things if they're room temperature or cold",
      "created_utc": 1726087536.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lmobi9z",
      "author": "Interesting-Cow8131",
      "body": "The setting has to be perfect. I like my hot food to be HOT ! My drink has to be ready, the right tv show on, I have to pee before I eat so my bladder isn't distracting me while I eat, hot sauce next to my plate just in case the seasonings are spicy enough.",
      "created_utc": 1726092495.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lmoygzy",
      "author": "Riot502",
      "body": "Many days all I can handle is liquid. I’ll be starving but food on a plate might as well be a shoe or something. It’s just not edible for me",
      "created_utc": 1726101101.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lmph3pp",
      "author": "dankfm",
      "body": "I tend to only eat one meal a day and it's usually because I have to do caloric maintenance.",
      "created_utc": 1726108386.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lmphyiv",
      "author": "booknerd155",
      "body": "Meat can’t be sweet, pasta is the enemy, no fruit in desserts, only the thin sandwich bread for sandwiches, etc. my food rules are weird",
      "created_utc": 1726108742.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lmpju3o",
      "author": "crash----",
      "body": "If something changes their packaging, they must have changed their recipe too. It’s now a no-go and can no longer be trusted.",
      "created_utc": 1726109535.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lmpp546",
      "author": "SubstantialHorse6732",
      "body": "Everything either has to have a familiar flavour or a really bland flavour",
      "created_utc": 1726111868.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lmpt03f",
      "author": "squiiidattack",
      "body": "Every time I eat, my brain convinces me I’ll die from choking or get food poisoning 💅🏻\nMy brain also convinces me that if I swallow water at the same time as my food (like how you’d take a pill), then I’ll be fine and I’m safe. 😍",
      "created_utc": 1726113708.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lmq27op",
      "author": "lizardassbitch",
      "body": "having a bad experience with a food and you never eat it again",
      "created_utc": 1726118670.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lmq52ht",
      "author": "calmingthechaos",
      "body": "None of my food can touch (unless it's very specific foods), and I only eat one food at a time. I'm a weirdo tho and eat my protein first (steak, burger, etc) and then my sides. Unless I get fast food. Then it's fries first.",
      "created_utc": 1726120360.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lmqxzni",
      "author": "Academic_Juice8265",
      "body": "Oh my god the vibes! 😂 \n\nIt just doesn’t look right.",
      "created_utc": 1726139599.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lmqycsc",
      "author": "JJnightdevil",
      "body": "None of the food can touch, I have those baby plates with compartments.\n\nI’ll only drink out of like the same 4 bottles (as in 4 copies of the same bottle).\n\nI can’t be around anyone eating fish, oranges, tuna (I know that’s fish but it gets it’s own category).\n\nI can’t stand hearing other people eat, I have to wear headphones.",
      "created_utc": 1726139789.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lmqysy2",
      "author": "Academic_Juice8265",
      "body": "I can’t use canned foods if they look weird. In saying that I don’t really know what constitutes “looks weird”  \n\nAll meat must be well done and not a scrap of grissle.   \n\nCan’t eat food on best before date.   \n\nIt takes ages for me to like eating out at one place and I have the same meal/drink every time. If someone different makes said meal/drink I say thank you, walk away and throw it out.   \n\nEverything must be packaged. I can’t do bulk bins or pot lucks .  If I bring a pot luck I only eat my own cooking and ignore everyone else’s food like the little weirdo I am.",
      "created_utc": 1726140021.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lmr95yd",
      "author": "Manospondylus_gigas",
      "body": "Can't ever reheat foods or have them cold, chucking away the noodle flavour packet, the incredibly specific textures chips have to be, eating the same thing every day",
      "created_utc": 1726144763.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lmuhoqi",
      "author": "dandylion04",
      "body": "i can’t drink anything that’s cloudy. gatorade (except rain berry flavor) lemonade, orange juice. drinks that are cloudy/opaque because there’s milk in it are completely fine LOL",
      "created_utc": 1726183697.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lmzfqbk",
      "author": "None",
      "body": "putting salt on anything i consider bland and overdoing it (doesn’t taste like it though)",
      "created_utc": 1726259091.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lna1d47",
      "author": "dovekitten",
      "body": "there’s a sauce at a restaurant that i like. when i was younger, my dad learned the recipe and made it at home. i refused to eat it because once i learned the ingredients, it became disgusting. but i still like it from the restaurant. such a mindfuck.",
      "created_utc": 1726421464.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lmm46u1",
      "author": "Sufficient_Row4394",
      "body": "heck yeah",
      "created_utc": 1726066972.0,
      "score": 14,
      "context": [
        {
          "id": "lmm2mdf",
          "author": "None",
          "body": "A pack of saltines is more satisfying than a 3 course meal.",
          "created_utc": 1726066464.0
        }
      ]
    },
    {
      "id": "lmonban",
      "author": "MyMindIsAHellscape",
      "body": "I can only eat saltines the first day I open the package or they taste stale. But they are great- especially with just butter",
      "created_utc": 1726096858.0,
      "score": 12,
      "context": [
        {
          "id": "lmm2mdf",
          "author": "None",
          "body": "A pack of saltines is more satisfying than a 3 course meal.",
          "created_utc": 1726066464.0
        }
      ]
    },
    {
      "id": "lmmdt3a",
      "author": "dainty_dryad",
      "body": "I go through a Himalayan salt grinder a month. Am I using it to season my food? Who said anything about food? It's just good. My sodium levels are probably fine. It's fine. Everything is fine.",
      "created_utc": 1726070042.0,
      "score": 20,
      "context": [
        {
          "id": "lmm4vtn",
          "author": "crashnebulaa_a",
          "body": "The blander the better (except salt I love salt)",
          "created_utc": 1726067199.0
        }
      ]
    },
    {
      "id": "lmm6afy",
      "author": "Eleadorea",
      "body": "This, so simple but apparently so complicated.",
      "created_utc": 1726067652.0,
      "score": 18,
      "context": [
        {
          "id": "lmm4vtn",
          "author": "crashnebulaa_a",
          "body": "The blander the better (except salt I love salt)",
          "created_utc": 1726067199.0
        }
      ]
    },
    {
      "id": "lmnphd0",
      "author": "Vlad0420",
      "body": "Nothing tastes better than when I have Covid 🥲",
      "created_utc": 1726085225.0,
      "score": 6,
      "context": [
        {
          "id": "lmm4vtn",
          "author": "crashnebulaa_a",
          "body": "The blander the better (except salt I love salt)",
          "created_utc": 1726067199.0
        }
      ]
    },
    {
      "id": "lmoaxs8",
      "author": "Interesting-Cow8131",
      "body": "I'm the opposite. Load up the seasonings and spice !",
      "created_utc": 1726092289.0,
      "score": 3,
      "context": [
        {
          "id": "lmm4vtn",
          "author": "crashnebulaa_a",
          "body": "The blander the better (except salt I love salt)",
          "created_utc": 1726067199.0
        }
      ]
    },
    {
      "id": "lmqqei8",
      "author": "MazeRoom1704",
      "body": "Mashed potatoes that have been cooked to death with a bit of salt 🤌",
      "created_utc": 1726135103.0,
      "score": 3,
      "context": [
        {
          "id": "lmm4vtn",
          "author": "crashnebulaa_a",
          "body": "The blander the better (except salt I love salt)",
          "created_utc": 1726067199.0
        }
      ]
    },
    {
      "id": "lmmlkqj",
      "author": "Automatic_Sun8354",
      "body": "You are me💀💀",
      "created_utc": 1726072536.0,
      "score": 2,
      "context": [
        {
          "id": "lmm4vtn",
          "author": "crashnebulaa_a",
          "body": "The blander the better (except salt I love salt)",
          "created_utc": 1726067199.0
        }
      ]
    },
    {
      "id": "lmndkex",
      "author": "applesandpebbles",
      "body": "same! garlic and onion are my nemeses",
      "created_utc": 1726081432.0,
      "score": 2,
      "context": [
        {
          "id": "lmm4vtn",
          "author": "crashnebulaa_a",
          "body": "The blander the better (except salt I love salt)",
          "created_utc": 1726067199.0
        }
      ]
    },
    {
      "id": "lmq9obk",
      "author": "Sufficient_Row4394",
      "body": "oh yes. people always call me weird for only liking pancakes that have no toppings on, but to me they are \\*chefs kiss\\*",
      "created_utc": 1726123313.0,
      "score": 1,
      "context": [
        {
          "id": "lmm4vtn",
          "author": "crashnebulaa_a",
          "body": "The blander the better (except salt I love salt)",
          "created_utc": 1726067199.0
        }
      ]
    },
    {
      "id": "lmq9sqn",
      "author": "Sufficient_Row4394",
      "body": "love when i find a new food i like, then only to be hit with the sudden dread of knowing dooms day will soon come where i'll suddenly despise it...",
      "created_utc": 1726123394.0,
      "score": 2,
      "context": [
        {
          "id": "lmmufp8",
          "author": "Affectionate_Fly8319",
          "body": "Eating the same thing over and over again until one day I am absolutely disgusted by it",
          "created_utc": 1726075347.0
        }
      ]
    },
    {
      "id": "lmmeel1",
      "author": "dainty_dryad",
      "body": "I'm sorry, HWHAT??? Are people really out here just scooping off the mold and calling it edible!?!?!",
      "created_utc": 1726070232.0,
      "score": 19,
      "context": [
        {
          "id": "lmma38n",
          "author": "FawnTi",
          "body": "Moldy food isn’t safe to eat just because you cut off the part that had visible blue mold. There is still invisible mold still in anything that’s been around it.",
          "created_utc": 1726068860.0
        }
      ]
    },
    {
      "id": "lmqxwob",
      "author": "JJnightdevil",
      "body": "This isn’t an ARFID thing it’s just food safety, mould is growing about an inch under anything visible, sometimes more",
      "created_utc": 1726139556.0,
      "score": 5,
      "context": [
        {
          "id": "lmma38n",
          "author": "FawnTi",
          "body": "Moldy food isn’t safe to eat just because you cut off the part that had visible blue mold. There is still invisible mold still in anything that’s been around it.",
          "created_utc": 1726068860.0
        }
      ]
    },
    {
      "id": "lmm7nek",
      "author": "communistsayori",
      "body": "The not letting foods touch thing is so real. Segmented plates are my best friend.",
      "created_utc": 1726068088.0,
      "score": 18,
      "context": [
        {
          "id": "lmm5mk8",
          "author": "Pinkandpurpleleaves",
          "body": "I relate to the first 2 so much! Here are a few of mine!\n\nIf I want to take another plate of the food that is made that evening I can only eat it if it was covered up right after the first servings. \n\nSome foods are not allowed to touch and will get their own plate/bowl. \n\nIf something is rotting in the fridge, everything surrounding it that might be contaminated needs to go too.\n\nHeating up food that was in the fridge and prepped on another day (like soup, pasta..) are a absolute no go!\n\nPutting things in the microwave to heat up after somebody used it for food with a strong smell is a no go (like salmon or other fish).\n\nI eat better when I watch a show or movie (distracts me from the food).\n\nI can never use the same serving spoon for two dishes, because then one gets all over the other and changes the taste of it. \n\nIf I get a new drink it needs to be in a new glass.",
          "created_utc": 1726067438.0
        }
      ]
    },
    {
      "id": "lmnmvy4",
      "author": "Teartaye",
      "body": ">I eat better when I watch a show or movie when eating (distracts me from the food).\n\n  \nI *have* to read while I eat. Looking at my food is too much of a sensory overwhelm, as is watching any kind of video. (Same idea though)",
      "created_utc": 1726084407.0,
      "score": 7,
      "context": [
        {
          "id": "lmm5mk8",
          "author": "Pinkandpurpleleaves",
          "body": "I relate to the first 2 so much! Here are a few of mine!\n\nIf I want to take another plate of the food that is made that evening I can only eat it if it was covered up right after the first servings. \n\nSome foods are not allowed to touch and will get their own plate/bowl. \n\nIf something is rotting in the fridge, everything surrounding it that might be contaminated needs to go too.\n\nHeating up food that was in the fridge and prepped on another day (like soup, pasta..) are a absolute no go!\n\nPutting things in the microwave to heat up after somebody used it for food with a strong smell is a no go (like salmon or other fish).\n\nI eat better when I watch a show or movie (distracts me from the food).\n\nI can never use the same serving spoon for two dishes, because then one gets all over the other and changes the taste of it. \n\nIf I get a new drink it needs to be in a new glass.",
          "created_utc": 1726067438.0
        }
      ]
    },
    {
      "id": "lmmbtpe",
      "author": "JudgmentSensitive999",
      "body": "The last 3 are so me. However I’m trying to not watch when eating nowadays.",
      "created_utc": 1726069413.0,
      "score": 1,
      "context": [
        {
          "id": "lmm5mk8",
          "author": "Pinkandpurpleleaves",
          "body": "I relate to the first 2 so much! Here are a few of mine!\n\nIf I want to take another plate of the food that is made that evening I can only eat it if it was covered up right after the first servings. \n\nSome foods are not allowed to touch and will get their own plate/bowl. \n\nIf something is rotting in the fridge, everything surrounding it that might be contaminated needs to go too.\n\nHeating up food that was in the fridge and prepped on another day (like soup, pasta..) are a absolute no go!\n\nPutting things in the microwave to heat up after somebody used it for food with a strong smell is a no go (like salmon or other fish).\n\nI eat better when I watch a show or movie (distracts me from the food).\n\nI can never use the same serving spoon for two dishes, because then one gets all over the other and changes the taste of it. \n\nIf I get a new drink it needs to be in a new glass.",
          "created_utc": 1726067438.0
        }
      ]
    },
    {
      "id": "lmme2gw",
      "author": "dainty_dryad",
      "body": "The watching a show is so real 😭😭😭",
      "created_utc": 1726070126.0,
      "score": 1,
      "context": [
        {
          "id": "lmm5mk8",
          "author": "Pinkandpurpleleaves",
          "body": "I relate to the first 2 so much! Here are a few of mine!\n\nIf I want to take another plate of the food that is made that evening I can only eat it if it was covered up right after the first servings. \n\nSome foods are not allowed to touch and will get their own plate/bowl. \n\nIf something is rotting in the fridge, everything surrounding it that might be contaminated needs to go too.\n\nHeating up food that was in the fridge and prepped on another day (like soup, pasta..) are a absolute no go!\n\nPutting things in the microwave to heat up after somebody used it for food with a strong smell is a no go (like salmon or other fish).\n\nI eat better when I watch a show or movie (distracts me from the food).\n\nI can never use the same serving spoon for two dishes, because then one gets all over the other and changes the taste of it. \n\nIf I get a new drink it needs to be in a new glass.",
          "created_utc": 1726067438.0
        }
      ]
    },
    {
      "id": "lmnk477",
      "author": "Key_Bluejay_6117",
      "body": "All of those apply to me too!",
      "created_utc": 1726083534.0,
      "score": 1,
      "context": [
        {
          "id": "lmm5mk8",
          "author": "Pinkandpurpleleaves",
          "body": "I relate to the first 2 so much! Here are a few of mine!\n\nIf I want to take another plate of the food that is made that evening I can only eat it if it was covered up right after the first servings. \n\nSome foods are not allowed to touch and will get their own plate/bowl. \n\nIf something is rotting in the fridge, everything surrounding it that might be contaminated needs to go too.\n\nHeating up food that was in the fridge and prepped on another day (like soup, pasta..) are a absolute no go!\n\nPutting things in the microwave to heat up after somebody used it for food with a strong smell is a no go (like salmon or other fish).\n\nI eat better when I watch a show or movie (distracts me from the food).\n\nI can never use the same serving spoon for two dishes, because then one gets all over the other and changes the taste of it. \n\nIf I get a new drink it needs to be in a new glass.",
          "created_utc": 1726067438.0
        }
      ]
    },
    {
      "id": "lmq9xhn",
      "author": "Sufficient_Row4394",
      "body": "oh bestie i'm with you. if something is rotting in the fridge, i'd throw the actual fridge out lmaoooo.",
      "created_utc": 1726123482.0,
      "score": 1,
      "context": [
        {
          "id": "lmm5mk8",
          "author": "Pinkandpurpleleaves",
          "body": "I relate to the first 2 so much! Here are a few of mine!\n\nIf I want to take another plate of the food that is made that evening I can only eat it if it was covered up right after the first servings. \n\nSome foods are not allowed to touch and will get their own plate/bowl. \n\nIf something is rotting in the fridge, everything surrounding it that might be contaminated needs to go too.\n\nHeating up food that was in the fridge and prepped on another day (like soup, pasta..) are a absolute no go!\n\nPutting things in the microwave to heat up after somebody used it for food with a strong smell is a no go (like salmon or other fish).\n\nI eat better when I watch a show or movie (distracts me from the food).\n\nI can never use the same serving spoon for two dishes, because then one gets all over the other and changes the taste of it. \n\nIf I get a new drink it needs to be in a new glass.",
          "created_utc": 1726067438.0
        }
      ]
    },
    {
      "id": "lmmg22f",
      "author": "FewCommunication7855",
      "body": "I barely can either. It depends on what im eating sometimes/the situation but more often than not i am eating alone/ in hiding/secret. The worst part is if i leave to go get food and try to drive somewhere to be alone and eat in my car and someone walks by/drives by/parks next to me, i will stop eating instantly and leave to go find another spot to be alone because of it.",
      "created_utc": 1726070762.0,
      "score": 12,
      "context": [
        {
          "id": "lmme6l1",
          "author": "Maleficent_Bridge_46",
          "body": "I won’t eat in front of others. I don’t know why but I just can’t. I need to be alone to eat",
          "created_utc": 1726070162.0
        }
      ]
    },
    {
      "id": "lmoyegs",
      "author": "dextrocardiaaa",
      "body": "this. I also hate being around others while they are eating. if someone talks with their mouth full, I will gag.",
      "created_utc": 1726101074.0,
      "score": 2,
      "context": [
        {
          "id": "lmme6l1",
          "author": "Maleficent_Bridge_46",
          "body": "I won’t eat in front of others. I don’t know why but I just can’t. I need to be alone to eat",
          "created_utc": 1726070162.0
        }
      ]
    },
    {
      "id": "lmolfgn",
      "author": "ae4ther4",
      "body": "Me too! Just too much stress.",
      "created_utc": 1726096149.0,
      "score": 1,
      "context": [
        {
          "id": "lmme6l1",
          "author": "Maleficent_Bridge_46",
          "body": "I won’t eat in front of others. I don’t know why but I just can’t. I need to be alone to eat",
          "created_utc": 1726070162.0
        }
      ]
    },
    {
      "id": "lmqaa9v",
      "author": "Sufficient_Row4394",
      "body": "oh i wish i had as much grace as you. i've shamefully spat it out into a napkin one too many times...",
      "created_utc": 1726123715.0,
      "score": 6,
      "context": [
        {
          "id": "lmmrqxa",
          "author": "caliharls",
          "body": "Randomly realizing the bite of food I was chewing is indeed disgusting and I need it out of my mouth NOW, but instead of spitting it out (maybe we’re in public), just having to take a huge swig of my drink and then swallowing the food like a pill. 🙃",
          "created_utc": 1726074496.0
        }
      ]
    },
    {
      "id": "lmnz32z",
      "author": "Shrieking_ghost",
      "body": "Me too. I can’t eat leftovers for this reason",
      "created_utc": 1726088281.0,
      "score": 5,
      "context": [
        {
          "id": "lmmgv50",
          "author": "follow_illumination",
          "body": "Most foods, I can't stand reheated. It changes the texture too much.",
          "created_utc": 1726071024.0
        }
      ]
    },
    {
      "id": "lmqaby6",
      "author": "Sufficient_Row4394",
      "body": "leftovers should be illegal",
      "created_utc": 1726123746.0,
      "score": 6,
      "context": [
        {
          "id": "lmmgv50",
          "author": "follow_illumination",
          "body": "Most foods, I can't stand reheated. It changes the texture too much.",
          "created_utc": 1726071024.0
        }
      ]
    },
    {
      "id": "lmm7vxg",
      "author": "communistsayori",
      "body": "I'd also never eat mac n cheese with a spoon as a kid, it had to be a fork. Something about it repulsed me. I don't eat mac n cheese at all anymore though, so that problem's solved.",
      "created_utc": 1726068163.0,
      "score": 6,
      "context": [
        {
          "id": "lmm7bl9",
          "author": "communistsayori",
          "body": "I won't eat if one of my family members is eating soup. I cannot stand the smell of it, I just leave the kitchen and wait until they're done.",
          "created_utc": 1726067983.0
        }
      ]
    },
    {
      "id": "lmndrnn",
      "author": "GreentownManager883",
      "body": "yeah, like an example last night for me was yams. That smell is horrible to me and I couldn't eat around that.",
      "created_utc": 1726081498.0,
      "score": 3,
      "context": [
        {
          "id": "lmm7bl9",
          "author": "communistsayori",
          "body": "I won't eat if one of my family members is eating soup. I cannot stand the smell of it, I just leave the kitchen and wait until they're done.",
          "created_utc": 1726067983.0
        }
      ]
    },
    {
      "id": "lmnj1ok",
      "author": "Cronchy_Baking_Soda",
      "body": "I’m like this with eggs. If anyone is cooking eggs on the stovetop, I have to leave. Sometimes I will wait in my room until after my food is cooked because the smell of the other foods while being cooked makes me nauseous",
      "created_utc": 1726083192.0,
      "score": 3,
      "context": [
        {
          "id": "lmm7bl9",
          "author": "communistsayori",
          "body": "I won't eat if one of my family members is eating soup. I cannot stand the smell of it, I just leave the kitchen and wait until they're done.",
          "created_utc": 1726067983.0
        }
      ]
    },
    {
      "id": "lmnzbi4",
      "author": "Shrieking_ghost",
      "body": "Ooh for me, my parents used to make Turkey and sauerkraut and I can’t stand the smell of either of those now 😪",
      "created_utc": 1726088358.0,
      "score": 3,
      "context": [
        {
          "id": "lmm7bl9",
          "author": "communistsayori",
          "body": "I won't eat if one of my family members is eating soup. I cannot stand the smell of it, I just leave the kitchen and wait until they're done.",
          "created_utc": 1726067983.0
        }
      ]
    },
    {
      "id": "lmqafl6",
      "author": "Sufficient_Row4394",
      "body": "until it suddenly becomes repulsive for no reason \\*internal screaming\\*",
      "created_utc": 1726123812.0,
      "score": 3,
      "context": [
        {
          "id": "lmmxtvz",
          "author": "giraffemoo",
          "body": "Eating the exact same dinner for most nights over the last 25 years",
          "created_utc": 1726076415.0
        }
      ]
    },
    {
      "id": "lmqahac",
      "author": "Sufficient_Row4394",
      "body": "me with raw noodles",
      "created_utc": 1726123843.0,
      "score": 2,
      "context": [
        {
          "id": "lmn7egm",
          "author": "jeannesloaf",
          "body": "I eat raw pasta as a snack.",
          "created_utc": 1726079453.0
        }
      ]
    },
    {
      "id": "lmnpc75",
      "author": "None",
      "body": "I’m the opposite. I always have to order my pizza light baked. My husband calls it “medium rare” 🤣",
      "created_utc": 1726085180.0,
      "score": 5,
      "context": [
        {
          "id": "lmm6gfc",
          "author": "None",
          "body": "Pizza should absolutely have some black on it. If it's not at least a little burned, it's not done yet.",
          "created_utc": 1726067706.0
        }
      ]
    },
    {
      "id": "lmqaram",
      "author": "Sufficient_Row4394",
      "body": "omg yes packaging is everything",
      "created_utc": 1726124027.0,
      "score": 1,
      "context": [
        {
          "id": "lmosc4a",
          "author": "fairyinthedark",
          "body": "cannot eat any thing someone else bought or touched (i have to buy the food myself and decide if its the \"right\" one) \n\npackaging changes in foods i like \n\nweird shapes or changes in the color/appearance \n\nthe vibes are \"off\" (idk if anyone will understand this one)",
          "created_utc": 1726098760.0
        }
      ]
    },
    {
      "id": "lmqan0y",
      "author": "Sufficient_Row4394",
      "body": "omg me too, i have to get him to try it before i eat it pahahah",
      "created_utc": 1726123949.0,
      "score": 1,
      "context": [
        {
          "id": "lmmvu5c",
          "author": "biscottiapricot",
          "body": "when eating a full meal i need to eat vegetables first and then everything else i take turns eating so i finish everything at the same time\n\nand i have to offer my boyfriend a bit of whatever im eating even when we're eating the same thing",
          "created_utc": 1726075787.0
        }
      ]
    },
    {
      "id": "lmqydsr",
      "author": "Academic_Juice8265",
      "body": "Yes the date on everything or I put a little squiggle on things to know I’ve opened them and no one else",
      "created_utc": 1726139803.0,
      "score": 2,
      "context": [
        {
          "id": "lmnlrs3",
          "author": "Cronchy_Baking_Soda",
          "body": "Everyone in my family has to put the date on everything that goes into the fridge\n\nI can’t stand eating the same amount of butter as most people, and usually use the smallest sliver of it\n\nIf what I’m eating doesn’t have salt I have to put salt on it or it will sometimes make me nauseous \n\nI leave the room right away if someone is cooking eggs. I will stay in my room until the smell is gone.\n\nIf someone has made rice or pasta I will only eat it if it has just been cooked. I hated it when people leave it to cool on the stove and then put it in the fridge. It’s not going to hurt the fridge\n\nI have to smell the bag of shredded cheese whenever I use it to check if it’s still good, I don’t trust the sell by or best by date. I don’t want to smell the bag, but I and so scared of eating anything that has gone even a little bad\n\nThere’s probably more but this is all I can think of right now",
          "created_utc": 1726084057.0
        }
      ]
    },
    {
      "id": "lmqt4o4",
      "author": "Sufficient_Row4394",
      "body": "'idk anymore' is such a mood. i feel that.",
      "created_utc": 1726136852.0,
      "score": 2,
      "context": [
        {
          "id": "lmqglab",
          "author": "Queenofwands1212",
          "body": "Can’t really open my eating window until late late night. I eat the same list of about 4-5 things everyday. I eat things that make my colitis flare up and can’t stop. I consume tons of sugar free pudding, it’s one of the only things that feels truly safe anymore. I consume a lot of weird things. Concoctions. Gelatin. Sugar free jello. Idk anymore.",
          "created_utc": 1726128111.0
        }
      ]
    },
    {
      "id": "lmqt83q",
      "author": "Sufficient_Row4394",
      "body": "wtf they can't do that hahahaha that's gross. they're only supposed to discount things that are expiring soon - in the uk at least, idk where you're from. that's so grim though!",
      "created_utc": 1726136910.0,
      "score": 2,
      "context": [
        {
          "id": "lmqh247",
          "author": "NationalNecessary120",
          "body": "Yeah :/\n\nI once bought food that was discounted. It didn’t SAY on it that it was past expiration.\n\nI didn’t think it was either. Because most stores here have discounted food BEFORE expiration date, but like 1-2 days before, because they want to sell it BEFORE it expires.\n\nSo then I stood by the cashier and checked expiration date and was like ”umm… excuse me this is expired?🤢”\n\nand they said ”yeah?🤷‍♀️ That’s why it is discounted”.",
          "created_utc": 1726128449.0
        }
      ]
    },
    {
      "id": "lmqtdw7",
      "author": "Sufficient_Row4394",
      "body": "omg i felt that. when you google \"vegan recipes for picky eaters\" and it dares to suggest an aubergine curry, GET AWAAAAY FROM ME.",
      "created_utc": 1726137010.0,
      "score": 2,
      "context": [
        {
          "id": "lmqo0yu",
          "author": "Ard4i",
          "body": "i cannot eat anything that has more than 2 main textures and 2 main flavors (like sweet and sour) and then i go crazy when i look up \"PLAIN vegan recipes\" because THATS NOT PLAIN THAT HAS LIKE 67 TEXTURES AT ONCE",
          "created_utc": 1726133469.0
        }
      ]
    },
    {
      "id": "lmqtjpi",
      "author": "Sufficient_Row4394",
      "body": "ooo i actually rlly like risotto, you should try it! if you cook it yourself, you can make it quite plain. in restaurants they fill it with crazy things like every single seafood known to man, but it's lush if you make it plain!!!",
      "created_utc": 1726137110.0,
      "score": 2,
      "context": [
        {
          "id": "lmqq9mh",
          "author": "MazeRoom1704",
          "body": "-It makes total sense to eat almost the same stuff every day until one day either sonething screws your routine or you get sick of it. \n\n-  TEXTURE is more important, or at least as important as taste. Tasty food but bad texture: I'm outta here. But bland food with the perfect texture: 🤌🤌🤌\n\n- also craving the sensation of texture tather than flavour\n\n- I like making (playing wirh) food more than eating it. (Perfect conditions for working in a kitchen).\n\n-there is that ONE spoon, that one glass, that one fork ect for certain foods/drinks.\n\n-same food(veggies/ftuit) cut in different shapes = huuuge difference. \n\n- If someone presents me a new food I try it but on my own I 95% stick to the stuff I know and don't try new products or recipes. \n(Only reason I haven't had risotto as a 30+ y/o is simply because it was never presented to me. Same with a lot of other things. I really wanna try risotto actually but you won't catch me buying it for myself because then it's not *~*special*~* 🤣)",
          "created_utc": 1726135013.0
        }
      ]
    },
    {
      "id": "lmz4mnw",
      "author": "Sufficient_Row4394",
      "body": "twinnies unite",
      "created_utc": 1726255421.0,
      "score": 2,
      "context": [
        {
          "id": "lmunqxj",
          "author": "IndividualBonus1442",
          "body": "I do each and every single one of these things",
          "created_utc": 1726186004.0
        }
      ]
    },
    {
      "id": "lmoo691",
      "author": "None",
      "body": "My go to is hot sauce. It’s such a good combo!!!",
      "created_utc": 1726097184.0,
      "score": 2,
      "context": [
        {
          "id": "lmm2mdf",
          "author": "None",
          "body": "A pack of saltines is more satisfying than a 3 course meal.",
          "created_utc": 1726066464.0
        },
        {
          "id": "lmonban",
          "author": "MyMindIsAHellscape",
          "body": "I can only eat saltines the first day I open the package or they taste stale. But they are great- especially with just butter",
          "created_utc": 1726096858.0
        }
      ]
    },
    {
      "id": "lmme6bw",
      "author": "crashnebulaa_a",
      "body": "Why am I eating fries just for the salt when I could simply do this genius trick",
      "created_utc": 1726070159.0,
      "score": 4,
      "context": [
        {
          "id": "lmm4vtn",
          "author": "crashnebulaa_a",
          "body": "The blander the better (except salt I love salt)",
          "created_utc": 1726067199.0
        },
        {
          "id": "lmmdt3a",
          "author": "dainty_dryad",
          "body": "I go through a Himalayan salt grinder a month. Am I using it to season my food? Who said anything about food? It's just good. My sodium levels are probably fine. It's fine. Everything is fine.",
          "created_utc": 1726070042.0
        }
      ]
    },
    {
      "id": "lmr8yw4",
      "author": "Manospondylus_gigas",
      "body": "Ikr, there's so many places where I order just chips (fries) and they put this horrid spicy seasoning for NO REASON because they just assume I want it, I hate it",
      "created_utc": 1726144683.0,
      "score": 2,
      "context": [
        {
          "id": "lmm4vtn",
          "author": "crashnebulaa_a",
          "body": "The blander the better (except salt I love salt)",
          "created_utc": 1726067199.0
        },
        {
          "id": "lmm6afy",
          "author": "Eleadorea",
          "body": "This, so simple but apparently so complicated.",
          "created_utc": 1726067652.0
        }
      ]
    },
    {
      "id": "lmnt4b3",
      "author": "crashnebulaa_a",
      "body": "Ngl when I saw the whole “you lose your sense of taste” thing for Covid I was secretly hoping I’d get it forever so I could eat normally (did not happen 😔)",
      "created_utc": 1726086376.0,
      "score": 13,
      "context": [
        {
          "id": "lmm4vtn",
          "author": "crashnebulaa_a",
          "body": "The blander the better (except salt I love salt)",
          "created_utc": 1726067199.0
        },
        {
          "id": "lmnphd0",
          "author": "Vlad0420",
          "body": "Nothing tastes better than when I have Covid 🥲",
          "created_utc": 1726085225.0
        }
      ]
    },
    {
      "id": "lmoz9ja",
      "author": "crashnebulaa_a",
      "body": "I like a little old bay if there’s cheese to cut down the spice!",
      "created_utc": 1726101399.0,
      "score": 1,
      "context": [
        {
          "id": "lmm4vtn",
          "author": "crashnebulaa_a",
          "body": "The blander the better (except salt I love salt)",
          "created_utc": 1726067199.0
        },
        {
          "id": "lmoaxs8",
          "author": "Interesting-Cow8131",
          "body": "I'm the opposite. Load up the seasonings and spice !",
          "created_utc": 1726092289.0
        }
      ]
    },
    {
      "id": "ln1w3a7",
      "author": "Upbeat_Tutor5332",
      "body": "you'd think it would be impossible to undercook mashed potatoes but I SWEAR people do. and then i'm the crazy one cuz i think the 'smooth' food is like sand-filled mayo",
      "created_utc": 1726298497.0,
      "score": 2,
      "context": [
        {
          "id": "lmm4vtn",
          "author": "crashnebulaa_a",
          "body": "The blander the better (except salt I love salt)",
          "created_utc": 1726067199.0
        },
        {
          "id": "lmqqei8",
          "author": "MazeRoom1704",
          "body": "Mashed potatoes that have been cooked to death with a bit of salt 🤌",
          "created_utc": 1726135103.0
        }
      ]
    },
    {
      "id": "lmnfpu0",
      "author": "crashnebulaa_a",
      "body": "Oh I love garlic but w you on onion nemesis!!!",
      "created_utc": 1726082125.0,
      "score": 3,
      "context": [
        {
          "id": "lmm4vtn",
          "author": "crashnebulaa_a",
          "body": "The blander the better (except salt I love salt)",
          "created_utc": 1726067199.0
        },
        {
          "id": "lmndkex",
          "author": "applesandpebbles",
          "body": "same! garlic and onion are my nemeses",
          "created_utc": 1726081432.0
        }
      ]
    },
    {
      "id": "lmmp0q8",
      "author": "Armayra",
      "body": "Unfortunately yes. The amount of times I've heard my dad say \"it's fine if you remove the moldy part\" is insane 💀",
      "created_utc": 1726073628.0,
      "score": 16,
      "context": [
        {
          "id": "lmma38n",
          "author": "FawnTi",
          "body": "Moldy food isn’t safe to eat just because you cut off the part that had visible blue mold. There is still invisible mold still in anything that’s been around it.",
          "created_utc": 1726068860.0
        },
        {
          "id": "lmmeel1",
          "author": "dainty_dryad",
          "body": "I'm sorry, HWHAT??? Are people really out here just scooping off the mold and calling it edible!?!?!",
          "created_utc": 1726070232.0
        }
      ]
    },
    {
      "id": "lmmeydu",
      "author": "amdaly10",
      "body": "Absolutely.   My mother and grandmother both do that.",
      "created_utc": 1726070406.0,
      "score": 9,
      "context": [
        {
          "id": "lmma38n",
          "author": "FawnTi",
          "body": "Moldy food isn’t safe to eat just because you cut off the part that had visible blue mold. There is still invisible mold still in anything that’s been around it.",
          "created_utc": 1726068860.0
        },
        {
          "id": "lmmeel1",
          "author": "dainty_dryad",
          "body": "I'm sorry, HWHAT??? Are people really out here just scooping off the mold and calling it edible!?!?!",
          "created_utc": 1726070232.0
        }
      ]
    },
    {
      "id": "lmqa1xt",
      "author": "Sufficient_Row4394",
      "body": "yeah my fiance does this with bread, it sends me into chaos every time. he'll just pick it off and eat it. i'm like ARE YOU OKAY WE CAN JUST BUY MORE BREAD??!!",
      "created_utc": 1726123562.0,
      "score": 6,
      "context": [
        {
          "id": "lmma38n",
          "author": "FawnTi",
          "body": "Moldy food isn’t safe to eat just because you cut off the part that had visible blue mold. There is still invisible mold still in anything that’s been around it.",
          "created_utc": 1726068860.0
        },
        {
          "id": "lmmeel1",
          "author": "dainty_dryad",
          "body": "I'm sorry, HWHAT??? Are people really out here just scooping off the mold and calling it edible!?!?!",
          "created_utc": 1726070232.0
        }
      ]
    },
    {
      "id": "lmqj1j9",
      "author": "being-weird",
      "body": "One of my friends did this when she worked in a restaurant. Luckily that restaurant has now closed down",
      "created_utc": 1726129889.0,
      "score": 2,
      "context": [
        {
          "id": "lmma38n",
          "author": "FawnTi",
          "body": "Moldy food isn’t safe to eat just because you cut off the part that had visible blue mold. There is still invisible mold still in anything that’s been around it.",
          "created_utc": 1726068860.0
        },
        {
          "id": "lmmeel1",
          "author": "dainty_dryad",
          "body": "I'm sorry, HWHAT??? Are people really out here just scooping off the mold and calling it edible!?!?!",
          "created_utc": 1726070232.0
        }
      ]
    },
    {
      "id": "lmnz83b",
      "author": "FawnTi",
      "body": "Yep. My mum does it to this day. She’ll find a moldy piece of bread in a packet and just remove the blue bits and then she complains when I say I’m not going to eat that.",
      "created_utc": 1726088327.0,
      "score": 1,
      "context": [
        {
          "id": "lmma38n",
          "author": "FawnTi",
          "body": "Moldy food isn’t safe to eat just because you cut off the part that had visible blue mold. There is still invisible mold still in anything that’s been around it.",
          "created_utc": 1726068860.0
        },
        {
          "id": "lmmeel1",
          "author": "dainty_dryad",
          "body": "I'm sorry, HWHAT??? Are people really out here just scooping off the mold and calling it edible!?!?!",
          "created_utc": 1726070232.0
        }
      ]
    },
    {
      "id": "lmodn7y",
      "author": "borderline_cat",
      "body": "My boyfriends grandfather would. 💀💀\n\nMade me lose any appetite I’d had whenever I saw him do it",
      "created_utc": 1726093263.0,
      "score": 1,
      "context": [
        {
          "id": "lmma38n",
          "author": "FawnTi",
          "body": "Moldy food isn’t safe to eat just because you cut off the part that had visible blue mold. There is still invisible mold still in anything that’s been around it.",
          "created_utc": 1726068860.0
        },
        {
          "id": "lmmeel1",
          "author": "dainty_dryad",
          "body": "I'm sorry, HWHAT??? Are people really out here just scooping off the mold and calling it edible!?!?!",
          "created_utc": 1726070232.0
        }
      ]
    },
    {
      "id": "lmqwq2y",
      "author": "Academic_Juice8265",
      "body": "Yep I went to a friends house that used mould cabbage in the salad. They finely cut off the mouldy part not even an inch. \n\nI had to pretend eati that salad",
      "created_utc": 1726138929.0,
      "score": 1,
      "context": [
        {
          "id": "lmma38n",
          "author": "FawnTi",
          "body": "Moldy food isn’t safe to eat just because you cut off the part that had visible blue mold. There is still invisible mold still in anything that’s been around it.",
          "created_utc": 1726068860.0
        },
        {
          "id": "lmmeel1",
          "author": "dainty_dryad",
          "body": "I'm sorry, HWHAT??? Are people really out here just scooping off the mold and calling it edible!?!?!",
          "created_utc": 1726070232.0
        }
      ]
    },
    {
      "id": "lmz5120",
      "author": "Sufficient_Row4394",
      "body": "facts",
      "created_utc": 1726255555.0,
      "score": 1,
      "context": [
        {
          "id": "lmma38n",
          "author": "FawnTi",
          "body": "Moldy food isn’t safe to eat just because you cut off the part that had visible blue mold. There is still invisible mold still in anything that’s been around it.",
          "created_utc": 1726068860.0
        },
        {
          "id": "lmqxwob",
          "author": "JJnightdevil",
          "body": "This isn’t an ARFID thing it’s just food safety, mould is growing about an inch under anything visible, sometimes more",
          "created_utc": 1726139556.0
        }
      ]
    },
    {
      "id": "lmwm6np",
      "author": "SomeTraits",
      "body": "Same! I used to read books as a kid, then comics as a teen, now it's videos. I'm becoming worse at this, am I?\n\nLuckily, if I'm eating with friends, they're enough of a distraction from food for me.",
      "created_utc": 1726222243.0,
      "score": 2,
      "context": [
        {
          "id": "lmm5mk8",
          "author": "Pinkandpurpleleaves",
          "body": "I relate to the first 2 so much! Here are a few of mine!\n\nIf I want to take another plate of the food that is made that evening I can only eat it if it was covered up right after the first servings. \n\nSome foods are not allowed to touch and will get their own plate/bowl. \n\nIf something is rotting in the fridge, everything surrounding it that might be contaminated needs to go too.\n\nHeating up food that was in the fridge and prepped on another day (like soup, pasta..) are a absolute no go!\n\nPutting things in the microwave to heat up after somebody used it for food with a strong smell is a no go (like salmon or other fish).\n\nI eat better when I watch a show or movie (distracts me from the food).\n\nI can never use the same serving spoon for two dishes, because then one gets all over the other and changes the taste of it. \n\nIf I get a new drink it needs to be in a new glass.",
          "created_utc": 1726067438.0
        },
        {
          "id": "lmnmvy4",
          "author": "Teartaye",
          "body": ">I eat better when I watch a show or movie when eating (distracts me from the food).\n\n  \nI *have* to read while I eat. Looking at my food is too much of a sensory overwhelm, as is watching any kind of video. (Same idea though)",
          "created_utc": 1726084407.0
        }
      ]
    },
    {
      "id": "lmq1pdd",
      "author": "Far-Chapter-2465",
      "body": "I also have to leave the room when people cook eggs! (and when they eat them. and like 10 minutes after. that sulfur smell does not like to go away)",
      "created_utc": 1726118377.0,
      "score": 2,
      "context": [
        {
          "id": "lmm7bl9",
          "author": "communistsayori",
          "body": "I won't eat if one of my family members is eating soup. I cannot stand the smell of it, I just leave the kitchen and wait until they're done.",
          "created_utc": 1726067983.0
        },
        {
          "id": "lmnj1ok",
          "author": "Cronchy_Baking_Soda",
          "body": "I’m like this with eggs. If anyone is cooking eggs on the stovetop, I have to leave. Sometimes I will wait in my room until after my food is cooked because the smell of the other foods while being cooked makes me nauseous",
          "created_utc": 1726083192.0
        }
      ]
    },
    {
      "id": "lmqf49h",
      "author": "jeannesloaf",
      "body": "Ooo yes those too. I used to put raw top ramen in a ziplock baggie with the flavor powder and break up the noodles & just shake it up and eat it as a shack like that.",
      "created_utc": 1726127061.0,
      "score": 2,
      "context": [
        {
          "id": "lmn7egm",
          "author": "jeannesloaf",
          "body": "I eat raw pasta as a snack.",
          "created_utc": 1726079453.0
        },
        {
          "id": "lmqahac",
          "author": "Sufficient_Row4394",
          "body": "me with raw noodles",
          "created_utc": 1726123843.0
        }
      ]
    },
    {
      "id": "lmqad2m",
      "author": "Sufficient_Row4394",
      "body": "medium rare hahahahah",
      "created_utc": 1726123766.0,
      "score": 1,
      "context": [
        {
          "id": "lmm6gfc",
          "author": "None",
          "body": "Pizza should absolutely have some black on it. If it's not at least a little burned, it's not done yet.",
          "created_utc": 1726067706.0
        },
        {
          "id": "lmnpc75",
          "author": "None",
          "body": "I’m the opposite. I always have to order my pizza light baked. My husband calls it “medium rare” 🤣",
          "created_utc": 1726085180.0
        }
      ]
    },
    {
      "id": "lmqy4g1",
      "author": "Academic_Juice8265",
      "body": "Yes! What is this?",
      "created_utc": 1726139668.0,
      "score": 1,
      "context": [
        {
          "id": "lmmvu5c",
          "author": "biscottiapricot",
          "body": "when eating a full meal i need to eat vegetables first and then everything else i take turns eating so i finish everything at the same time\n\nand i have to offer my boyfriend a bit of whatever im eating even when we're eating the same thing",
          "created_utc": 1726075787.0
        },
        {
          "id": "lmqan0y",
          "author": "Sufficient_Row4394",
          "body": "omg me too, i have to get him to try it before i eat it pahahah",
          "created_utc": 1726123949.0
        }
      ]
    },
    {
      "id": "lmqvdjx",
      "author": "Queenofwands1212",
      "body": "Yeah… it really is. This disorder is exhausting and sometimes I just have to embrace my fucking insanity and the fact that I’ll never be normal with food",
      "created_utc": 1726138183.0,
      "score": 1,
      "context": [
        {
          "id": "lmqglab",
          "author": "Queenofwands1212",
          "body": "Can’t really open my eating window until late late night. I eat the same list of about 4-5 things everyday. I eat things that make my colitis flare up and can’t stop. I consume tons of sugar free pudding, it’s one of the only things that feels truly safe anymore. I consume a lot of weird things. Concoctions. Gelatin. Sugar free jello. Idk anymore.",
          "created_utc": 1726128111.0
        },
        {
          "id": "lmqt4o4",
          "author": "Sufficient_Row4394",
          "body": "'idk anymore' is such a mood. i feel that.",
          "created_utc": 1726136852.0
        }
      ]
    },
    {
      "id": "ln1vrun",
      "author": "Upbeat_Tutor5332",
      "body": "i carry a larger (like golf ball ish) himalayan pink salt rock in my pocket to suck on (unsanitary? idc) also have one stashed in the car, on various tables, etc. i eat normal salts too but the big salt rock..... aaaaaah",
      "created_utc": 1726298278.0,
      "score": 1,
      "context": [
        {
          "id": "lmm4vtn",
          "author": "crashnebulaa_a",
          "body": "The blander the better (except salt I love salt)",
          "created_utc": 1726067199.0
        },
        {
          "id": "lmmdt3a",
          "author": "dainty_dryad",
          "body": "I go through a Himalayan salt grinder a month. Am I using it to season my food? Who said anything about food? It's just good. My sodium levels are probably fine. It's fine. Everything is fine.",
          "created_utc": 1726070042.0
        },
        {
          "id": "lmme6bw",
          "author": "crashnebulaa_a",
          "body": "Why am I eating fries just for the salt when I could simply do this genius trick",
          "created_utc": 1726070159.0
        }
      ]
    },
    {
      "id": "lmmtr5m",
      "author": "dainty_dryad",
      "body": "Vile. Unhinged behavior. Straight to jail.",
      "created_utc": 1726075132.0,
      "score": 10,
      "context": [
        {
          "id": "lmma38n",
          "author": "FawnTi",
          "body": "Moldy food isn’t safe to eat just because you cut off the part that had visible blue mold. There is still invisible mold still in anything that’s been around it.",
          "created_utc": 1726068860.0
        },
        {
          "id": "lmmeel1",
          "author": "dainty_dryad",
          "body": "I'm sorry, HWHAT??? Are people really out here just scooping off the mold and calling it edible!?!?!",
          "created_utc": 1726070232.0
        },
        {
          "id": "lmmeydu",
          "author": "amdaly10",
          "body": "Absolutely.   My mother and grandmother both do that.",
          "created_utc": 1726070406.0
        }
      ]
    },
    {
      "id": "lmomtvh",
      "author": "dainty_dryad",
      "body": "I am sorry, but your mother wasn't raised right. I'll die on that hill.",
      "created_utc": 1726096676.0,
      "score": 2,
      "context": [
        {
          "id": "lmma38n",
          "author": "FawnTi",
          "body": "Moldy food isn’t safe to eat just because you cut off the part that had visible blue mold. There is still invisible mold still in anything that’s been around it.",
          "created_utc": 1726068860.0
        },
        {
          "id": "lmmeel1",
          "author": "dainty_dryad",
          "body": "I'm sorry, HWHAT??? Are people really out here just scooping off the mold and calling it edible!?!?!",
          "created_utc": 1726070232.0
        },
        {
          "id": "lmnz83b",
          "author": "FawnTi",
          "body": "Yep. My mum does it to this day. She’ll find a moldy piece of bread in a packet and just remove the blue bits and then she complains when I say I’m not going to eat that.",
          "created_utc": 1726088327.0
        }
      ]
    },
    {
      "id": "lmqa6oz",
      "author": "Sufficient_Row4394",
      "body": "in full agreement, this is a justified consequence.",
      "created_utc": 1726123650.0,
      "score": 1,
      "context": [
        {
          "id": "lmma38n",
          "author": "FawnTi",
          "body": "Moldy food isn’t safe to eat just because you cut off the part that had visible blue mold. There is still invisible mold still in anything that’s been around it.",
          "created_utc": 1726068860.0
        },
        {
          "id": "lmmeel1",
          "author": "dainty_dryad",
          "body": "I'm sorry, HWHAT??? Are people really out here just scooping off the mold and calling it edible!?!?!",
          "created_utc": 1726070232.0
        },
        {
          "id": "lmmeydu",
          "author": "amdaly10",
          "body": "Absolutely.   My mother and grandmother both do that.",
          "created_utc": 1726070406.0
        },
        {
          "id": "lmmtr5m",
          "author": "dainty_dryad",
          "body": "Vile. Unhinged behavior. Straight to jail.",
          "created_utc": 1726075132.0
        }
      ]
    }
  ]
}