{
  "id": "1ff95f6",
  "subreddit": "ARFID",
  "author": "fifibunkin",
  "created_utc": 1726164398.0,
  "title": "It’s not fair that it is so difficult for people with ARFID to get feeding tubes (an opinion from someone with a feeding tube)",
  "selftext": "I have a feeding tube that is partially in to treat my ARFID. But I didn’t originally get it for that. It’s just one of the reasons it’s stayed in for over 4 years now. I have a surgical Gtube. \n\nI wish I had advice to give people so they can get one too. I am a strong believer that feeding tubes can save the life of people with ARFID. Especially people whose autism is the main source of the problem. Doctors and therapists think that therapies and treatments will fix it, if that were true no one would have autism. There is no cure for autism so I don’t understand why doctors and therapists think therapies and treatments will cure ARFID in patients with autism. \n\nI wish there was a way I could advocate for people with autism related ARFID to get feeding tubes. If cancer patients can get feeding tubes to survive why do people who can no longer function due to ARFID related malnutrition not deserve proper nutrition too. Everyone should deserve the right to health and proper nutrition. \n\nAlso I think that even getting a temporary tube could be so helpful. Having a temporary tube would allow the patient to receive proper nutrition which could ease the pressure of completing treatments and therapies and possibly make recovery more likely by knowing that they don’t have the pressure to force themselves to eat so they can take their time to recover. \n\nI really wish there was a way I could talk to doctors or even speak at a conference or something so that doctors can understand the benefits of people with ARFID getting feeding tubes. So often I read posts here from people who say they feel like they are dying, they are starving, and no longer know what to do. Many have tried a number of therapies and treatments to recover but many have found little or no success at all. I think that even patients that do not have autism could benefit from getting a temporary tube. I feel like recovery could be so much more successful if the stress of getting proper nutrition was eliminated so they can focus all their energy on recovery. \n\nFor my personal story. I was given a feeding tube after a failed surgery left me unable to eat, speak, or drink due to my surgeon accidentally paralyzing my vocal cords during my surgery. That put me on the fast track to get a feeding tube. And the timeline is kind of confusing but at the same time I was diagnosed with ARFID and told I would start feeds as well since at that time lab work showed that I was malnourished. For a few months after getting it I took speech therapy to regain my ability to speak and swallow but I also started seeing a cognitive behavioral therapist and an occupational therapist to help treat my ARFID. However, I was extremely lucky that those people understood that autism is not curable so because of that and another reason my gtube has stayed in. Unfortunately it took a failed surgery for me to get proper nutrition for the first time in 26 years. It should not take a failed surgery to get the proper help that I needed. \n\nNow at 30 I am doing so much better and finally living the life I’ve always wanted. I went from sleeping 16 to 18 hours a day, no social life, dropped out of college for two semesters, and living in my parents basement to working almost full time, having lots of friends and being able to live alone. But why did it take a failed surgery to get here? And why is it so hard for people with ARFID to get feeding tubes to save their life? It’s not fair. We like everyone else deserve life, health, and proper nutrition. \n\nTLDR: if autism is not curable why are doctors and therapists convinced people with autism related ARFID can recover with treatments and therapies? And if people with autism cannot recover why is it so hard for them to get feeding tubes to save their life even when there is documented proof that therapies have not helped? And why is it so hard for people with non autism related ARFID to get temporary tubes that could help make recovery and therapies more successful? I wish I could do something to change this as a feeding tube has saved my life. ",
  "url": "https://www.reddit.com/r/ARFID/comments/1ff95f6/its_not_fair_that_it_is_so_difficult_for_people/",
  "score": 98,
  "num_comments": 32,
  "comments": [
    {
      "id": "lmtnx0b",
      "author": "agirlfromgeorgia",
      "body": "I also have a G-tube due to Crohn's Disease and ARFID. I've gained 30 pounds and I am healthy again. It's been life changing. It definitely shouldn't be the last resort that it is now. I shouldn't have had to almost die to get this tube.",
      "created_utc": 1726173359.0,
      "score": 41,
      "context": []
    },
    {
      "id": "lmtaznu",
      "author": "NationalNecessary120",
      "body": "so true. Because arfid is not curable as ”just eat more stuff?🤷‍♀️”. (yeah some people gain SOME new safe foods, but I would still argue that the solution to malnutrition is not as simple as ”just learning to eat more).\n\nI fortunatly don’t have as severe arfid that I am starving. (i am underweight and often get light-headed, but I don’t need to be hospilatized for it). But I do like your point (even if it wouldn’t directly affect me)",
      "created_utc": 1726169220.0,
      "score": 32,
      "context": []
    },
    {
      "id": "lmt6wod",
      "author": "JonathanKuminga",
      "body": "The tube has been a lifesaver for my kid, who is very young. He was in such bad shape, and nothing was working. When he abandoned his Pediasure, it was an emergency and we had switch to a tube because he does not eat more than 50 calories a day of food (not on the spectrum that we know of, and not physically unable to eat). He was so small before, and is so much better now in every way. It was very hard to do but it has truly changed and saved his life",
      "created_utc": 1726167889.0,
      "score": 46,
      "context": []
    },
    {
      "id": "lmwhrub",
      "author": "follow_illumination",
      "body": "I’ve had to use feeding tubes about half a dozen times in my life because of cancer treatments, and as convenient as it sounds in theory, I would never voluntarily use one instead of just sticking to my safe foods. I’ve ended up with scarring in my throat from feeding tubes, which now makes it hard to swallow sometimes, and contributes further to my ARFID. As a temporary measure for someone who’s in a life or death situation due to malnutrition, that’s understandable - but I think as a long-term solution it’s very risky.",
      "created_utc": 1726219270.0,
      "score": 11,
      "context": []
    },
    {
      "id": "lmt2rdu",
      "author": "SharpestBanana",
      "body": "Having surgery to implant a tube into your stomach is a very drastic solution as opposed to therapies or other treatments and should be used as a last resort imo",
      "created_utc": 1726166543.0,
      "score": 48,
      "context": []
    },
    {
      "id": "lmto1ri",
      "author": "DecorativeGeode",
      "body": "A feeding tube is a really intense intervention that comes with risks. It should be reserved for those who are at a point where no other intervention will keep the person getting appropriate caloric intake. I think someone in the thread said their child abandoned even Pediasure…imo, that is when you need a feeding tube. I’ll keep on with my mashed potatoes and supplements, personally. \n\nIMO, TikTok medical culture has had this tendency to downplay how intense this kind of intervention is and romanticizes and casualizes very intense treatments sometimes it makes me uncomfortable.  A feeding tube should be a last resort when the quality of life without one is lower than with.",
      "created_utc": 1726173400.0,
      "score": 17,
      "context": []
    },
    {
      "id": "lmtkde0",
      "author": "angelneliel",
      "body": "Man I wish I could get a feeding tube. My eating problems would be non-existent. Obviously there is lots of care needed for having a feeding tube operation, but at least nutrition would no longer be an issue. Is there anywhere online I can learn more about it?",
      "created_utc": 1726172235.0,
      "score": 10,
      "context": []
    },
    {
      "id": "lmxp55q",
      "author": "sarah_kaya_comezin",
      "body": "I asked my doctor for a tube a few years ago when my Arfid was at its absolute worst and she said that no GI doctor would give me one unless it was medically necessary but that she could refer me to GI and I could plead my case. I didn’t go because I didn’t have the fight in me when I knew they’d say no.",
      "created_utc": 1726238686.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lmzf4kg",
      "author": "Big-Formal408",
      "body": "I had a feeding tube almost four years ago and it truly saved my life. I was 79lbs while in my 20s and my organs were failing and I couldn’t even walk more than 20 feet unassisted. I’ve tried outpatient, PHP, residential inpatient, and full hospitalization over eight years and nothing has worked. I’ve had ARFID my whole life so it’s all I’ve ever known but it doesn’t make it any easier. I have gastroparesis now and would give anything to have a feeding tube again and be able to get adequate nutrition while not being in pain 24/7. It could very likely be on the table again down the road but I don’t want to have to decline as badly as I originally did for it to be an option.",
      "created_utc": 1726258892.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mbdqsiw",
      "author": "Practical-Diver2843",
      "body": "I want to say I really appreciate your post. My son (7) has ARFID & it has been a struggle this last two years just getting him to maintain his current weight. When he was losing weight, I started freaking out! It’s really difficult to get him to eat anything…. My research on ARFID has led me to determine his is mostly the anxiety variety (not really textures etc. Anyway, I have another kid who had to get a g tube when she was 4 (and really she should have had it placed a few years prior) — she was extremely malnourished & never learned to eat properly. However now she eats many puréed foods by mouth.\n\nFor those saying that g-tube is a drastic, unnecessary, risky, complicated surgery— no, it’s not. The surgery was intense and there was a learning curve figuring out how to feed our daughter and change out her mic-key buttons, but once we learned it — her life and ours changed for the better.\n\n(Every surgery has risks, etc., but with a g-tube surgery, it is reversible! If you decide to, you can choose to let the stoma close.)",
      "created_utc": 1738883135.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lmt1y6z",
      "author": "foenixxfyre",
      "body": "I don't have any insight but I appreciate your stance so much! There has to be a way to start advocacy for this kind of thing. Hopefully someone with experience in that comes through this thread bc I am wildly curious how.",
      "created_utc": 1726166279.0,
      "score": 6,
      "context": []
    },
    {
      "id": "lmymztl",
      "author": "Rinny-ThePooh",
      "body": "I think parts of my arfid got worse over time, but some of it is genuinely basic things that I will never get over. I try to measure it as what gives me anxiety, vs what gives me sensory issues.",
      "created_utc": 1726249616.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m24qdlf",
      "author": "throw0OO0away",
      "body": "Late comment.\n\n\"Also I think that even getting a temporary tube could be so helpful. Having a temporary tube would allow the patient to receive proper nutrition which could ease the pressure of completing treatments and therapies and possibly make recovery more likely by knowing that they don’t have the pressure to force themselves to eat so they can take their time to recover.\"\n\nI'm in this position right now. I currently have a temporary (NG) for both undiagnosed GI issues and ARFID. It's been so nice for me. I'm not stressed out about nutrition and can find new safe foods that are friendly on my GI tract. Yes, I miss some of my old safe foods. However, I've found new ones and it's so freeing!\n\nMy mental health surrounding food is *so much better*. I'm not dying of malnutrition and feeling like shit. I don't have to flare up my GI symptoms just to stay alive. I don't feel an immense amount of pressure during meals. I can finally just enjoy food again. \n\nThe only thing I'm nervous about is that my team will prematurely pull the tube when they hear that I've been able to enjoy and eat food again. I'm enjoying food because of the tube-not the other way around. My GI issues still exist. I have the freedom to eat how and when I want without compromising nutrition and flaring GI symptoms.",
      "created_utc": 1734242238.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lmtd27o",
      "author": "OkReflection8263",
      "body": "I agree",
      "created_utc": 1726169892.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lmtkyet",
      "author": "retropillow",
      "body": "I often thought about it, how that would make my life so much easier. It's not severe enough for me to go through an operation for it, but man would it be nice",
      "created_utc": 1726172422.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lmvk02h",
      "author": "bbywermboi",
      "body": "I completely agree. I have an NG tube currently, almost a year, and ive been fighting for a gtube. my sinuses are degrading. it shouldn’t be this hard. all my doctors and my therapist and psychiatrist agree its needed, but nobody locally wants to place it.",
      "created_utc": 1726198601.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lmxreb4",
      "author": "Panic-King-Hard",
      "body": "Genuine question: Are there temporary IV treatments that would accomplish the same nutritional benefits with a lower risk of complications?",
      "created_utc": 1726239414.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lmzw9ke",
      "author": "Personal-Opinion-982",
      "body": "I honestly think a temporary tube would fix so many issues for me. Im stuck in a paradox of chronic fatigue where i get bad sleep because i dont eat enough but im too tired to force myself to eat enough calories to give me energy and its so difficult.\n\nId never ask for one though, ive yet to meet a doctor that isnt obsessively convinced that im just anorexic and in denial (despite the fact that im literally telling them i want to gain weight)",
      "created_utc": 1726264768.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lmtsbvu",
      "author": "pendigedig",
      "body": "I just found out that I'm only getting 500-900 calories a day by complete accident, but probably also because of my ARFID. I'm sure I wouldn't be a candidate for a feeding tube but what an interesting idea.",
      "created_utc": 1726174745.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lmwd59w",
      "author": "oddistrange",
      "body": "Tubes and stuff weird me out, I couldn't even bare the idea of the nexplanon for birth control where they implant it in your arm. Now if they created human kibble with all types of flavors, maybe texture options I would be all about it.",
      "created_utc": 1726215960.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lmuaphk",
      "author": "Internal_Screaming_8",
      "body": "An NG tube is not surgical and lasts 4-6 weeks",
      "created_utc": 1726181073.0,
      "score": 20,
      "context": [
        {
          "id": "lmt2rdu",
          "author": "SharpestBanana",
          "body": "Having surgery to implant a tube into your stomach is a very drastic solution as opposed to therapies or other treatments and should be used as a last resort imo",
          "created_utc": 1726166543.0
        }
      ]
    },
    {
      "id": "lmt523h",
      "author": "fifibunkin",
      "body": "No I understand that and agree but I think that after a while it should be understood that the therapies are not working. I do feel like therapies can improve things sometimes but there is a point where the autism is preventing full recovery and at that point I think it should be easier for people to get feeding tubes. I don’t believe someone should just be able to walk into their PCPs office and claim therapy is not working. But my other point is that getting a temporary tube which would be a nasal gastric tube and not a surgical tube could be so beneficial too. It’s not as permanent and can ease the stress of getting proper nutrition and make recovery more likely.",
      "created_utc": 1726167287.0,
      "score": 27,
      "context": [
        {
          "id": "lmt2rdu",
          "author": "SharpestBanana",
          "body": "Having surgery to implant a tube into your stomach is a very drastic solution as opposed to therapies or other treatments and should be used as a last resort imo",
          "created_utc": 1726166543.0
        }
      ]
    },
    {
      "id": "lmttnw7",
      "author": "fifibunkin",
      "body": "And that is exactly what I’m saying. I don’t think a feeding tube should come with the diagnosis of ARFID. But I do think that a temporary nasal gastric tube should be more accessible to aid in recovery.",
      "created_utc": 1726175166.0,
      "score": 22,
      "context": [
        {
          "id": "lmto1ri",
          "author": "DecorativeGeode",
          "body": "A feeding tube is a really intense intervention that comes with risks. It should be reserved for those who are at a point where no other intervention will keep the person getting appropriate caloric intake. I think someone in the thread said their child abandoned even Pediasure…imo, that is when you need a feeding tube. I’ll keep on with my mashed potatoes and supplements, personally. \n\nIMO, TikTok medical culture has had this tendency to downplay how intense this kind of intervention is and romanticizes and casualizes very intense treatments sometimes it makes me uncomfortable.  A feeding tube should be a last resort when the quality of life without one is lower than with.",
          "created_utc": 1726173400.0
        }
      ]
    },
    {
      "id": "lmub8nc",
      "author": "fifibunkin",
      "body": "I don’t really have much more information other than my own opinion. Unfortunately this isn’t a widely accepted treatment for ARFID and beyond that ARFID is a rather new diagnosis so it’s often challenging to find a lot of research about it. What I know is mainly from my own experience.",
      "created_utc": 1726181273.0,
      "score": 6,
      "context": [
        {
          "id": "lmtkde0",
          "author": "angelneliel",
          "body": "Man I wish I could get a feeding tube. My eating problems would be non-existent. Obviously there is lots of care needed for having a feeding tube operation, but at least nutrition would no longer be an issue. Is there anywhere online I can learn more about it?",
          "created_utc": 1726172235.0
        }
      ]
    },
    {
      "id": "lmuafdy",
      "author": "fifibunkin",
      "body": "Imagine being able to think better, sleep better, focus better, and over all feel better while in therapy and recovery all because you have access to proper nutrition. I really feel like there is an argument to be made that temporary nasal gastric tubes could increase the rates of long term success and recovery.",
      "created_utc": 1726180968.0,
      "score": 8,
      "context": [
        {
          "id": "lmt1y6z",
          "author": "foenixxfyre",
          "body": "I don't have any insight but I appreciate your stance so much! There has to be a way to start advocacy for this kind of thing. Hopefully someone with experience in that comes through this thread bc I am wildly curious how.",
          "created_utc": 1726166279.0
        }
      ]
    },
    {
      "id": "lmy9y88",
      "author": "JonathanKuminga",
      "body": "Unfortunately, nutrition and calories can’t really happen via IV. Would need to be a tube that goes to the stomach",
      "created_utc": 1726245405.0,
      "score": 3,
      "context": [
        {
          "id": "lmxreb4",
          "author": "Panic-King-Hard",
          "body": "Genuine question: Are there temporary IV treatments that would accomplish the same nutritional benefits with a lower risk of complications?",
          "created_utc": 1726239414.0
        }
      ]
    },
    {
      "id": "lmuleu4",
      "author": "SharpestBanana",
      "body": "This person is more specifically referencing permanent tubes",
      "created_utc": 1726185098.0,
      "score": 6,
      "context": [
        {
          "id": "lmt2rdu",
          "author": "SharpestBanana",
          "body": "Having surgery to implant a tube into your stomach is a very drastic solution as opposed to therapies or other treatments and should be used as a last resort imo",
          "created_utc": 1726166543.0
        },
        {
          "id": "lmuaphk",
          "author": "Internal_Screaming_8",
          "body": "An NG tube is not surgical and lasts 4-6 weeks",
          "created_utc": 1726181073.0
        }
      ]
    },
    {
      "id": "lmvzdak",
      "author": "Autismsaurus",
      "body": "I was in feeding therapy for five years and made precisely zero progress.  I’ve worked with an eating disorder specialist, and still see a nutritionist, and it has taken four years for me to gain six pounds.  I’m over it. Just give me the bloody tube already.",
      "created_utc": 1726206699.0,
      "score": 13,
      "context": [
        {
          "id": "lmt2rdu",
          "author": "SharpestBanana",
          "body": "Having surgery to implant a tube into your stomach is a very drastic solution as opposed to therapies or other treatments and should be used as a last resort imo",
          "created_utc": 1726166543.0
        },
        {
          "id": "lmt523h",
          "author": "fifibunkin",
          "body": "No I understand that and agree but I think that after a while it should be understood that the therapies are not working. I do feel like therapies can improve things sometimes but there is a point where the autism is preventing full recovery and at that point I think it should be easier for people to get feeding tubes. I don’t believe someone should just be able to walk into their PCPs office and claim therapy is not working. But my other point is that getting a temporary tube which would be a nasal gastric tube and not a surgical tube could be so beneficial too. It’s not as permanent and can ease the stress of getting proper nutrition and make recovery more likely.",
          "created_utc": 1726167287.0
        }
      ]
    },
    {
      "id": "lmzfbbf",
      "author": "Big-Formal408",
      "body": "IV nutrition does exist and it’s called TPN but it’s reserved for very severe cases of chronic and GI conditions. It’s incredibly risky so they don’t just hand it out but it does exist.",
      "created_utc": 1726258953.0,
      "score": 4,
      "context": [
        {
          "id": "lmxreb4",
          "author": "Panic-King-Hard",
          "body": "Genuine question: Are there temporary IV treatments that would accomplish the same nutritional benefits with a lower risk of complications?",
          "created_utc": 1726239414.0
        },
        {
          "id": "lmy9y88",
          "author": "JonathanKuminga",
          "body": "Unfortunately, nutrition and calories can’t really happen via IV. Would need to be a tube that goes to the stomach",
          "created_utc": 1726245405.0
        }
      ]
    },
    {
      "id": "lmulpjg",
      "author": "Internal_Screaming_8",
      "body": "They said “should be more accessible as a TEMPORARY OPTION during feeding therapy to reduce pressure “ \n\nTemporary tubes used during feeding therapy for ANY reason are usually NG as they have much less complications and are not life altering.",
      "created_utc": 1726185213.0,
      "score": 27,
      "context": [
        {
          "id": "lmt2rdu",
          "author": "SharpestBanana",
          "body": "Having surgery to implant a tube into your stomach is a very drastic solution as opposed to therapies or other treatments and should be used as a last resort imo",
          "created_utc": 1726166543.0
        },
        {
          "id": "lmuaphk",
          "author": "Internal_Screaming_8",
          "body": "An NG tube is not surgical and lasts 4-6 weeks",
          "created_utc": 1726181073.0
        },
        {
          "id": "lmuleu4",
          "author": "SharpestBanana",
          "body": "This person is more specifically referencing permanent tubes",
          "created_utc": 1726185098.0
        }
      ]
    },
    {
      "id": "ln2dkt9",
      "author": "JonathanKuminga",
      "body": "Interesting thanks for the info. Will look it up",
      "created_utc": 1726310910.0,
      "score": 2,
      "context": [
        {
          "id": "lmxreb4",
          "author": "Panic-King-Hard",
          "body": "Genuine question: Are there temporary IV treatments that would accomplish the same nutritional benefits with a lower risk of complications?",
          "created_utc": 1726239414.0
        },
        {
          "id": "lmy9y88",
          "author": "JonathanKuminga",
          "body": "Unfortunately, nutrition and calories can’t really happen via IV. Would need to be a tube that goes to the stomach",
          "created_utc": 1726245405.0
        },
        {
          "id": "lmzfbbf",
          "author": "Big-Formal408",
          "body": "IV nutrition does exist and it’s called TPN but it’s reserved for very severe cases of chronic and GI conditions. It’s incredibly risky so they don’t just hand it out but it does exist.",
          "created_utc": 1726258953.0
        }
      ]
    },
    {
      "id": "lmuot55",
      "author": "fifibunkin",
      "body": "Yes I am referencing temporary tubes, nasal gastric tubes, to help reduce anxiety about maintaining proper nutrition during therapies and recovery to help increase chances of long term success and recovery. Having a nasal gastric tube can help the patient maintain nutrition which not only would reduce anxiety about proper nutrition but also getting proper nutrition would increase brain function, concentration, stabilize mood, and improve sleep which would also increase rates of long term success.",
      "created_utc": 1726186417.0,
      "score": 20,
      "context": [
        {
          "id": "lmt2rdu",
          "author": "SharpestBanana",
          "body": "Having surgery to implant a tube into your stomach is a very drastic solution as opposed to therapies or other treatments and should be used as a last resort imo",
          "created_utc": 1726166543.0
        },
        {
          "id": "lmuaphk",
          "author": "Internal_Screaming_8",
          "body": "An NG tube is not surgical and lasts 4-6 weeks",
          "created_utc": 1726181073.0
        },
        {
          "id": "lmuleu4",
          "author": "SharpestBanana",
          "body": "This person is more specifically referencing permanent tubes",
          "created_utc": 1726185098.0
        },
        {
          "id": "lmulpjg",
          "author": "Internal_Screaming_8",
          "body": "They said “should be more accessible as a TEMPORARY OPTION during feeding therapy to reduce pressure “ \n\nTemporary tubes used during feeding therapy for ANY reason are usually NG as they have much less complications and are not life altering.",
          "created_utc": 1726185213.0
        }
      ]
    }
  ]
}