{
  "id": "1fg3eat",
  "subreddit": "ARFID",
  "author": "finalnoms",
  "created_utc": 1726256076.0,
  "title": "I am a grown adult woman staring down Mac and cheese and chicken tenders rn, going “I can do this” over and over in my head ",
  "selftext": "Just wanted to share 😭😭",
  "url": "https://www.reddit.com/r/ARFID/comments/1fg3eat/i_am_a_grown_adult_woman_staring_down_mac_and/",
  "score": 242,
  "num_comments": 19,
  "comments": [
    {
      "id": "lmzautb",
      "author": "ArcherFawkes",
      "body": "Your experiences are so relatable. Sometimes the concept of chewing is the most disgusting thing to me and I can barely put down water.",
      "created_utc": 1726257485.0,
      "score": 79,
      "context": []
    },
    {
      "id": "lmz9a00",
      "author": "Sufficient_Row4394",
      "body": "if i had a penny for every time id been in this situation, id be rich enough to buy a new frickin brain that works and doesnt hate all food lmaooo",
      "created_utc": 1726256970.0,
      "score": 59,
      "context": []
    },
    {
      "id": "lmzcsnr",
      "author": "LunaMax1214",
      "body": "43.75 year old mom of two here. (One kid has ARFID, and so do I.)\n\nThe fact that you're even trying as hard as you are is amazing, so take it for the win that it is. 💚\n\nEDT: I managed to have (and keep down) scrambled eggs with cheese today so that both kids could have all the pancakes they wanted before school. (Pretty sure they're both about to hit a growth spurt, and the hubs did not take that into account when he was making breakfast.) So, I feel you, hon.",
      "created_utc": 1726258125.0,
      "score": 35,
      "context": []
    },
    {
      "id": "lmza0fo",
      "author": "Fun_Willingness_5698",
      "body": "Me but today's Subway 😵",
      "created_utc": 1726257209.0,
      "score": 9,
      "context": []
    },
    {
      "id": "lmzgcp1",
      "author": "Maleficent_Bridge_46",
      "body": "You CAN do it, friend! Don’t let your age discourage you from recovery. Plenty of grown adults have mental health issues and eating disorders, your situation is no different! I wish you all the luck, I hope you enjoyed those tenders & Mac and cheese!",
      "created_utc": 1726259297.0,
      "score": 6,
      "context": []
    },
    {
      "id": "lmzltjp",
      "author": "snail6925",
      "body": "literally me a week ago, took a pic for another autistic friend who gets it. I'm almost 40. you can do it",
      "created_utc": 1726261102.0,
      "score": 6,
      "context": []
    },
    {
      "id": "ln03wve",
      "author": "ma-doodles",
      "body": "me but with a cutie orange!",
      "created_utc": 1726267651.0,
      "score": 7,
      "context": []
    },
    {
      "id": "lmztvxi",
      "author": "1986toyotacorolla2",
      "body": "I know we've all tried a million things to feel better about trying new food so please don't take this as a \"just do this and you'll be cured!\" Type of thing lol. My experience trying things I'm not sure if I'm going to like always go better when I do the following things, \n\n- Have a backup safe food ready to go if I'm hungry\n- Be kind and gentle with myself\n- Parent myself in the moment the way I would parent a child if they had ARFID (It's ok you don't have to eat it all, trying things is good but if you don't like it, that's ok too, I'm still going to love you either way and you learned something new about yourself today etc.)\n- Have someone to talk to or a journal to put my feelings in so I can experience my feelings, feel my feelings, and actually express them so I can destress and be less upset if there's another food I can't eat. \n\nI'm so proud of you OP for trying new foods. If you like them, I'm so happy for you! If you don't, you learned something new about yourself, you're still an amazing person, you're still worthy of love, and you can keep trying things in the future no pressure! ♥️♥️\n\nEdit to add, you've inspired me to FINALLY try the spaghetti sauce my friend made me. Now I just need to plan it for tomorrow so I can come at it from a good mental place so I don't cry too much if I'm not a fan lol.",
      "created_utc": 1726263916.0,
      "score": 7,
      "context": []
    },
    {
      "id": "ln0p9t7",
      "author": "robitrobot",
      "body": "you got this!!! i hope you ate❤️",
      "created_utc": 1726276063.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ln0ovz8",
      "author": "Skvllix",
      "body": "YOU CAN DO THIS!! 🎉🎉",
      "created_utc": 1726275902.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ln1vdnb",
      "author": "RamblingRose63",
      "body": "Same was staring at mashed potatoes green beans and country fried steak a safe meal and can't so I got a smoothie and waiting to feel better and microwave it again 🤦‍♀️",
      "created_utc": 1726298014.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ln1g76j",
      "author": "Professional_Ear9795",
      "body": "Me too, babes. But with a cheeseburger ✊🏽",
      "created_utc": 1726288538.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ln1q2k2",
      "author": "Fantastic_Sector_282",
      "body": "You got this.\n\nAnd even if you don't, I'm happy that you're trying",
      "created_utc": 1726294498.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ln2b4lp",
      "author": "invisible-bug",
      "body": "Just make sure you're taking vitamins, drinking some sort of protein drink, and drinking water. As long as you're taking care of those things, your body will have an easier time with these sensory spells\n\nBe kind to yourself please\n\n\nEdit: fyi I always recommend the slimfast advanced nutrition 100%. I put the chocolate powder in a blender with ice and peanut butter. It hid what powderyness it had pretty well. Oh, I also used almond milk or oat milk personally. Whatever works for you is fine\n\nAlso I did 1.5 times powder or less milk and ice. I liked it to be a bit more chocolatey but if you want you can add chocolate syrup to make it palatable. I found I only needed like half a tbsp of peanut butter",
      "created_utc": 1726309269.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ln31mea",
      "author": "starrysky555",
      "body": "I can relate. You can do it! 💪",
      "created_utc": 1726322425.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ln084l4",
      "author": "black_flame919",
      "body": "NO BUT THIS IS ME FR 😭😭😭😭",
      "created_utc": 1726269262.0,
      "score": 5,
      "context": [
        {
          "id": "lmz9a00",
          "author": "Sufficient_Row4394",
          "body": "if i had a penny for every time id been in this situation, id be rich enough to buy a new frickin brain that works and doesnt hate all food lmaooo",
          "created_utc": 1726256970.0
        }
      ]
    },
    {
      "id": "ln1h34a",
      "author": "finalnoms",
      "body": "Cuties are one of my best safe foods, I’m lucky that most fruit is super safe for me (shoutout to my parents who always made me eat my fruit and veggies as a kid because some of them have become cemented as safe foods)",
      "created_utc": 1726289032.0,
      "score": 2,
      "context": [
        {
          "id": "ln03wve",
          "author": "ma-doodles",
          "body": "me but with a cutie orange!",
          "created_utc": 1726267651.0
        }
      ]
    },
    {
      "id": "ln1gz9h",
      "author": "finalnoms",
      "body": "Aghhhh I managed to eat it all! And I had so much energy and felt good! Normalmaxxing!",
      "created_utc": 1726288972.0,
      "score": 5,
      "context": [
        {
          "id": "ln0p9t7",
          "author": "robitrobot",
          "body": "you got this!!! i hope you ate❤️",
          "created_utc": 1726276063.0
        }
      ]
    }
  ]
}