{
  "id": "1fhmdfm",
  "subreddit": "ARFID",
  "author": "blaiiiiir",
  "created_utc": 1726432213.0,
  "title": "I feel like my arfid isn’t valid because I’m not thin",
  "selftext": "it really makes me hate myself sometimes. I feel so guilty whenever I have no appetite and the only food I want is fast food. I wish I could have safe foods that are “healthy”. I’ve been trying to avoid eating what I want because I should be skinnier and trying to force myself to eat different but I’m sick. I feel so sick. Everything makes me want to throw up ",
  "url": "https://www.reddit.com/r/ARFID/comments/1fhmdfm/i_feel_like_my_arfid_isnt_valid_because_im_not/",
  "score": 126,
  "num_comments": 32,
  "comments": [
    {
      "id": "lnb7512",
      "author": "None",
      "body": "Arfid has absolutely 0 correlation with a specific weight/shape/or size. It doesn’t discriminate. Same goes for EDs like anorexia and bulimia. No everyone with an ed is thin or even an “ideal” weight. Weight is one of the least relevant factors. \n\nNot that your feelings aren’t valid. But not being thin doesn’t make your experience any less real",
      "created_utc": 1726434259.0,
      "score": 77,
      "context": []
    },
    {
      "id": "lnb6caj",
      "author": "theatregirl1987",
      "body": "You are valid! I'm overweight with ARFID as well. All of my safe foods are terrible for me, very fatty and sugary. Also, you can be overweight and still malnourished. I know I am because I don't get most vitamins (yay gummy multi-vitamin!)",
      "created_utc": 1726434001.0,
      "score": 25,
      "context": []
    },
    {
      "id": "lnb3vtu",
      "author": "extraqueerestrial",
      "body": "your weight doesn't define you or having arfid.  I'm overweight according to my BMI (I know its outdated but so many doctors still go by it) and I have arfid. You can have any kind of body type and still have arfid. The best thing you can do is try showing yourself some grace and being kinder, there's no need to be putting such added strain and pressure on yourself <3",
      "created_utc": 1726433209.0,
      "score": 6,
      "context": []
    },
    {
      "id": "lnbbrg8",
      "author": "Striking_Dentist_562",
      "body": "Hey my safe foods contain carbs and sugar, and I’m an emotional eater of additional carbs and sugar. I’m not thin either. I don’t feel invalidated because the restriction is real.",
      "created_utc": 1726435804.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lncai7t",
      "author": "n7shepart",
      "body": "My teen was UW as a kid because of ARFID but as they became a teen became overweight and theyve struggled with their weight since. Dietitians have said to me that, they've seen this happen a lot. If youre not getting all the nutrients from your food because of being restrictive due to ARFID, your body will make you hungrier. Taking supplements helped my teen a fair bit.  \nIm getting assessed for ARFID next week, and Im UW, but its because I also have another ED on top which is why im only being assessed now. It's only very recently here, like in the last couple of years, that they will even diagnose both, so theres a lot of people like me, with one diagnosis, when they may have another ED and its just not been diagnosed, and also because you know it affects everyone differently.",
      "created_utc": 1726448632.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lncsxqi",
      "author": "sgQt2Xm9HbiV7d",
      "body": "Don't shame yourself about your body and don't shame yourself about the type of food you eat! All food is good food. You need to eat. You might want to check if you're being exposed to any messages about some foods being \"bad\" and get away from that instagram influencer account/person/whatever it is. These are the things I tell myself.",
      "created_utc": 1726455986.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lndyjyk",
      "author": "mykeuk",
      "body": "I have ARFID. All my safe foods are high carb, fat, sugar etc. I was morbidly obese last year before I put myself on a diet. But because I don't eat any healthy foods it's been a restrictive diet rather than a supplemented one. Tough slog, but I'm getting there!",
      "created_utc": 1726481724.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lnbbr5u",
      "author": "None",
      "body": "ARFID is a disorder that seems to have a pretty broad range of how it can affect people with it. \n\nPlus, there's more to food than calories/weight.  A person can be what's considered a healthy weight, and still be malnourished since this disorder can make it hard to get all of the right nutrients, and fast food is pretty devoid of that. \n\nYou're still struggling, it's affecting your life and health in a negative way. Your issues are valid.",
      "created_utc": 1726435801.0,
      "score": 7,
      "context": []
    },
    {
      "id": "lnbezei",
      "author": "JustbyLlama",
      "body": "You are 100% valid. I’m considered overweight and I have ARFID. This is partly Because of my arfid and partly because I don’t often move my body. It sucks, but you’re not alone.",
      "created_utc": 1726436893.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lnbvyc9",
      "author": "Minute-Lemon-3650",
      "body": "I have felt the same way about my ARFID for other reasons. I felt like my ARFID wasn’t valid because I am not picky about my foods, my ARFID comes from a fear of being sick. But genuinely, ARFID is unique to every individual that struggles with it. We all have our own list of safe foods, rituals to eat, reasons for our fears surrounding food/ eating food, etc. We all cope differently so we will all look differently! \n\nYou have enough to worry about as someone who struggles with ARFID, you are your first priority. If anyone dares question your experience or diagnosis, that is an ignorant person who does not have your best interest at heart.",
      "created_utc": 1726443009.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lnc7408",
      "author": "WindermerePeaks1",
      "body": "I’ve had disordered eating since I was a child and my weight fluctuates. Sometimes eating less corresponds to me gaining weight! I eat basically nothing right now and am the heaviest I’ve ever been. I don’t move around much, probably only 1000 steps a day. I’d say that contributes more than my eating. Weight is influenced by so many things, even stress can make you gain. You are perfectly valid.",
      "created_utc": 1726447301.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lnccemm",
      "author": "UnicornStar1988",
      "body": "I’m obese as well and I only have appetite for unhealthy food too.",
      "created_utc": 1726449369.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lnbh170",
      "author": "StrawbraryLiberry",
      "body": "Anyone can have ARFID, and it sucks no matter what your size. \n\nIt's a real struggle to eat at all sometimes, and definitely to figure out how to eat healthy with this. I'd say it's healthier to eat something rather than nothing, your body needs nourishment even if you aren't thin. \n\nI'm sorry you're struggling",
      "created_utc": 1726437616.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lnbrfli",
      "author": "janiegun619",
      "body": "I can relate! Im considered obese",
      "created_utc": 1726441368.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lnbvz6c",
      "author": "DustierAndRustier",
      "body": "Who cares if you’re “valid”? Just try to manage your issues without comparing yourself to other people.",
      "created_utc": 1726443017.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lnd2we7",
      "author": "littleghool",
      "body": "You're as valid as any of us. I'm overweight too because 90% of my safe foods are junk foods 🤷‍♀️",
      "created_utc": 1726460514.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lnbbhu4",
      "author": "No-Veterinarian9913",
      "body": "Weight doesn’t always have something to do with your eating. Genetics play a factor. You can only eat once a day and still be overweight. Anyone can have afrid. My weight fluctuates but I’m always malnourished.",
      "created_utc": 1726435716.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lnbln7t",
      "author": "FawnTi",
      "body": "I was recently in an ARFID support group by on official eating disorder organisation. There was a wide range of people there. I’m sort of like at a healthy skinny weight rn, then we had some that were super skinny and some of them were quite larger. There were boys, girls, young, old. It’s such a diverse disorder and we are all valid.",
      "created_utc": 1726439283.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lnbnjbj",
      "author": "TheMelonSystem",
      "body": "ARFID lives in your brain, not in your body ❤️ ANY body shape can have an ED, you’re incredibly valid. Stay strong ❤️",
      "created_utc": 1726439973.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lnbpe2n",
      "author": "SachiKaM",
      "body": "A disorder is what clinicians have to diagnose for the patient to get treatment. That’s the only objective validity. Everything else is a description of symptoms to relay information and hopefully gain an understanding from others. If you are struggling with weight and wanting to eat healthier, you are absolutely valid to reach out for help with those difficult life changes. Putting a name to it doesn’t challenge or change your reality. The same as being diagnosed and then refusing treatment wouldn’t. I hope that came off correctly.. only to say you are completely validated to take the necessary measures to become the person you want to be, just as valid as anybody at any weight who needs help doing that. The name doesn’t matter, it’s actions that influence change.",
      "created_utc": 1726440635.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lncwv2y",
      "author": "BulkyComfortable3040",
      "body": "I get that. I denied that I had it for a while because I am overweight",
      "created_utc": 1726457647.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lnd0yn8",
      "author": "_mnmlst",
      "body": "I have no advice but I empathize. I weighted nearly 350 lbs at my max weight and was consuming zero food regularly. Only vast amounts of milk and soda. I ended up in the hospital for electrolyte imbalances and I started eating again while I was there. I felt like I was being judged by the nursing staff but I was sooooo hungry once I started eating again. It really made my self esteem take a hit. But the ravenous hunger subsided after a couple months and now I’m back in the 200s. Anyone of any size can have ARFID. <3",
      "created_utc": 1726459522.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lnd4s08",
      "author": "Impressive-Lock-673",
      "body": "If you have proper support & can do it safely, I highly recommend the book Sick Enough by Jennifer Gaudiani. I was really struggling with the same thing and my dietitian gave me her copy and had me read it. I already knew most of the content of the book going into it but the way it was written/language helped finally get to me and at least ~start~ to accept it",
      "created_utc": 1726461519.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lndid46",
      "author": "sympathizings",
      "body": "My ARFID is the most severe it’s ever been and I’ve gained over 100lbs in less than a year.",
      "created_utc": 1726469933.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lneh2lu",
      "author": "None",
      "body": "you’re still valid, im underweight with ARFID but also latch onto unhealthy foods and lose weight due to me not getting enough nutrients needed. everyone’s different.",
      "created_utc": 1726491062.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lngyxj2",
      "author": "TJElm87",
      "body": "I feel the exact same way. People don’t realize the impact of ARFID when you’re not seen as thin enough. I’m 180lbs at 5’4” but I am losing my hair and feeling constantly weak and tired from not eating enough or eating well because so many foods make me feel physically ill to even think about. People I know shame me for eating “processed garbage” and they make me feel like so childish for still needing grilled cheese and pizza and hot dogs as huge staples of my diet at almost 30. They see what I eat as unhealthy but because I’m not skinny (and because I study every restaurant menu ahead of time to avoid a public panic attack whenever we go out) they don’t realize that my physical aversion to food (nausea, despair, actual disgust at the idea of chewing) is severe enough that even eating my safe foods is a huge victory some days.",
      "created_utc": 1726520941.0,
      "score": 0,
      "context": []
    },
    {
      "id": "lnejhux",
      "author": "Fantastic-Leopard131",
      "body": "This is true on paper, in real life tho ppl are gonna treat you like youre faking the ED. When i was in treatment i saw this quite frequently with the ppl who were overweight. A lot of ppl already dont have a good understanding of eds and a lot of ppl absolutely do think you have to be skinny to have an ed (besides binging) so theres a high chance OP feels this way bc its how ppl are treating her.",
      "created_utc": 1726492058.0,
      "score": 8,
      "context": [
        {
          "id": "lnb7512",
          "author": "None",
          "body": "Arfid has absolutely 0 correlation with a specific weight/shape/or size. It doesn’t discriminate. Same goes for EDs like anorexia and bulimia. No everyone with an ed is thin or even an “ideal” weight. Weight is one of the least relevant factors. \n\nNot that your feelings aren’t valid. But not being thin doesn’t make your experience any less real",
          "created_utc": 1726434259.0
        }
      ]
    },
    {
      "id": "lv5n27f",
      "author": "None",
      "body": "I've had people tell me my anorexia didn't count because I was never underweight. My body doesn't lose weight due to stupid hormone issues.",
      "created_utc": 1730628239.0,
      "score": 1,
      "context": [
        {
          "id": "lnb7512",
          "author": "None",
          "body": "Arfid has absolutely 0 correlation with a specific weight/shape/or size. It doesn’t discriminate. Same goes for EDs like anorexia and bulimia. No everyone with an ed is thin or even an “ideal” weight. Weight is one of the least relevant factors. \n\nNot that your feelings aren’t valid. But not being thin doesn’t make your experience any less real",
          "created_utc": 1726434259.0
        }
      ]
    },
    {
      "id": "lnhdn8x",
      "author": "eliseofnohr",
      "body": "Similar situation here. I was underweight as a kid and in my teens, but started gaining weight in my 20s. Metabolisms!",
      "created_utc": 1726526031.0,
      "score": 1,
      "context": [
        {
          "id": "lncai7t",
          "author": "n7shepart",
          "body": "My teen was UW as a kid because of ARFID but as they became a teen became overweight and theyve struggled with their weight since. Dietitians have said to me that, they've seen this happen a lot. If youre not getting all the nutrients from your food because of being restrictive due to ARFID, your body will make you hungrier. Taking supplements helped my teen a fair bit.  \nIm getting assessed for ARFID next week, and Im UW, but its because I also have another ED on top which is why im only being assessed now. It's only very recently here, like in the last couple of years, that they will even diagnose both, so theres a lot of people like me, with one diagnosis, when they may have another ED and its just not been diagnosed, and also because you know it affects everyone differently.",
          "created_utc": 1726448632.0
        }
      ]
    },
    {
      "id": "lnd5gu5",
      "author": "blaiiiiir",
      "body": "thank you, I’m downloading the audiobook right now",
      "created_utc": 1726461889.0,
      "score": 1,
      "context": [
        {
          "id": "lnd4s08",
          "author": "Impressive-Lock-673",
          "body": "If you have proper support & can do it safely, I highly recommend the book Sick Enough by Jennifer Gaudiani. I was really struggling with the same thing and my dietitian gave me her copy and had me read it. I already knew most of the content of the book going into it but the way it was written/language helped finally get to me and at least ~start~ to accept it",
          "created_utc": 1726461519.0
        }
      ]
    },
    {
      "id": "lnf5cou",
      "author": "None",
      "body": "Yea that’s why I said there feelings are still valid and their experience is no less real than anyone else’s while also spreading the correct information so one more person knows. The more people know this, the less people will be made to feel this way.",
      "created_utc": 1726499883.0,
      "score": 2,
      "context": [
        {
          "id": "lnb7512",
          "author": "None",
          "body": "Arfid has absolutely 0 correlation with a specific weight/shape/or size. It doesn’t discriminate. Same goes for EDs like anorexia and bulimia. No everyone with an ed is thin or even an “ideal” weight. Weight is one of the least relevant factors. \n\nNot that your feelings aren’t valid. But not being thin doesn’t make your experience any less real",
          "created_utc": 1726434259.0
        },
        {
          "id": "lnejhux",
          "author": "Fantastic-Leopard131",
          "body": "This is true on paper, in real life tho ppl are gonna treat you like youre faking the ED. When i was in treatment i saw this quite frequently with the ppl who were overweight. A lot of ppl already dont have a good understanding of eds and a lot of ppl absolutely do think you have to be skinny to have an ed (besides binging) so theres a high chance OP feels this way bc its how ppl are treating her.",
          "created_utc": 1726492058.0
        }
      ]
    },
    {
      "id": "lngpow6",
      "author": "Impressive-Lock-673",
      "body": "Hope it helps at least a little bit like it did for me & wish you the best going forward:)",
      "created_utc": 1726517965.0,
      "score": 1,
      "context": [
        {
          "id": "lnd4s08",
          "author": "Impressive-Lock-673",
          "body": "If you have proper support & can do it safely, I highly recommend the book Sick Enough by Jennifer Gaudiani. I was really struggling with the same thing and my dietitian gave me her copy and had me read it. I already knew most of the content of the book going into it but the way it was written/language helped finally get to me and at least ~start~ to accept it",
          "created_utc": 1726461519.0
        },
        {
          "id": "lnd5gu5",
          "author": "blaiiiiir",
          "body": "thank you, I’m downloading the audiobook right now",
          "created_utc": 1726461889.0
        }
      ]
    }
  ]
}