{
  "id": "1fjrqzs",
  "subreddit": "ARFID",
  "author": "Inner_Arm9482",
  "created_utc": 1726663065.0,
  "title": "Why does everyone hate my ARFID?",
  "selftext": "I have been picked on for having ARFID more than anything else. Even my parents, who are aware of my situation, would get frustrated and yell at me for ordering plain meals at restaurants, making myself something to eat that they didn’t think was appetizing, and just for my general food choices. My ex boyfriend used to give me the silent treatment when I didn’t want to eat something, and told me that he hated my ARFID so much because he loved food and he didn’t understand why I didn’t. It turned into him actually considering breaking up with me over it- not because it ever caused him any inconvenience- just because it personally offended him. I was talking to a friend yesterday about foods I wished I could like and she gave me some advice, but ended it with “if you ever get the courage to try that, as pathetic as it sounds.” ?? 😭. I have never seen people get so upset in my life, ever. Like they take my pickiness SO PERSONALLY, even in situations where it doesn’t effect them in the slightest. Has anybody else experienced this, or am I just particularly unlucky?",
  "url": "https://www.reddit.com/r/ARFID/comments/1fjrqzs/why_does_everyone_hate_my_arfid/",
  "score": 241,
  "num_comments": 59,
  "comments": [
    {
      "id": "lnqe1xw",
      "author": "Mother_Goat1541",
      "body": "I’m a 40 year old mom, and people think they can “fix” me if I just *tried the food the way they make it* and get mad if I decline.",
      "created_utc": 1726667190.0,
      "score": 134,
      "context": []
    },
    {
      "id": "lnqjrx1",
      "author": "giraffemoo",
      "body": "I think they think we are faking it. I honestly don't know, but that's what I think. They see us eating pizza and French fries when they are eating more healthy and diverse meals. What people like that don't know or understand is that I really wish I could eat like they do, I wish I could just eat food without inspecting it or knowing in advance what the taste and texture is. \n\nThey see us eating the food they wish they could let themselves eat all the time. I've had people even say that to me, \"I wish I could have pizza for dinner every day\" like they think I'm just being indulgent or giving into cravings.",
      "created_utc": 1726669180.0,
      "score": 97,
      "context": []
    },
    {
      "id": "lnq4ew2",
      "author": "EddoWagt",
      "body": "This is really common and I honestly don't know why, but it does suck",
      "created_utc": 1726663521.0,
      "score": 80,
      "context": []
    },
    {
      "id": "lnq508a",
      "author": "None",
      "body": "People are super emotional when it comes to food. They act like you just called their Grandma a sex worker if you don't like their favorite food or don't try it. For some, their social life and get togethers completely revolve around food, and they can't even imagine how we function. Sadly, your experience is far from abnormal for people with Arfid.",
      "created_utc": 1726663759.0,
      "score": 92,
      "context": []
    },
    {
      "id": "lnq9nbq",
      "author": "KirbysLeftBigToe",
      "body": "I had an ex girlfriend who literally had ARFID as well treat me poorly about it. She’d get really angry and offended when I’d get anxious about being served food by her because I’m anxious about being served food by ANYONE. \n\nIt’s not even really about understanding I think it’s just about empathy. Which a lot of people don’t seem to have for us.",
      "created_utc": 1726665559.0,
      "score": 26,
      "context": []
    },
    {
      "id": "lnqemhq",
      "author": "First-Butterscotch-3",
      "body": "It's different and people dislike what is different - add in this weird social thing of getting offended over people's dietary choices \n\nAfter 44 years I'm over it",
      "created_utc": 1726667393.0,
      "score": 19,
      "context": []
    },
    {
      "id": "lnqx0vy",
      "author": "Old-Aide7943",
      "body": "Second hand embarrassment? Most people see arfid as just childish picky eating and seeing you eat makes them feel ashamed for you. It’s like they’re imagining themselves with it and projecting any feelings they’d have about it onto you. There’s also probably those who feel frustrated because they think that if they were in your shoes that they’d be able to just magically cure themselves through the power of “getting over it”, so they think you’re pathetic for not doing what they’d do. Either way, its good to treat them like they’re being the embarrassing one (which they are) and keep reminding yourself that you have a legitimate eating disorder (which you do) that no one should be complaining about except you.",
      "created_utc": 1726673458.0,
      "score": 17,
      "context": []
    },
    {
      "id": "lnqoo29",
      "author": "MaleficentSwan0223",
      "body": "I attempted to kill myself because my arfid offended my family so much. I eat plain things, I don’t eat at all, I never take their food nor eat in front of them or with them - nothing I did made them happy. I live with love you husband now and his mantra is “as long as I don’t have to eat what you eat I don’t care” and I’ve just learnt to surround myself with people like him. ",
      "created_utc": 1726670798.0,
      "score": 13,
      "context": []
    },
    {
      "id": "lnq8if4",
      "author": "gothpriest",
      "body": "i have been extremely lucky that Most* people in my life have been accommodating and understanding. im glad that guy is your EX now. you deserve to be surrounded by supportive and compassionate people.\n\nit's my personal belief that those who cannot understand the struggles of others are just unevolved (for lack of a better term.) anyone who is mature, smart, and compassionate will try to understand you even if they cannot relate in anyway. my closest friends and parters have all been this way so there are definitely people out there like that. and those are the people you need in your corner because they will help you more than any nasty judgemental comment will. my boyfriend will bend over backwards to make sure i eat and i eat enough of the right thing. now you may not need the level of support that i need from others but you have to remember that this is a disability and the way people treat you over it  is indicative of what kind of person they are.",
      "created_utc": 1726665125.0,
      "score": 18,
      "context": []
    },
    {
      "id": "lnqo5xh",
      "author": "shadyprincess",
      "body": "it's the most difficult part about having arfid for me\n\nmy therapist once said that food is very connected to a sense of love and connection, so people probably take it personally due to that attachment\n\neither way they're fucking weirdos and I've learned to make them feel ashamed instead. if they make comments, i usually say like \"well, there's this eating disorder.....\" \n\nit informs people and also makes them feel bad for making fun of an ED lol",
      "created_utc": 1726670635.0,
      "score": 16,
      "context": []
    },
    {
      "id": "lnrt74g",
      "author": "alyssaleska",
      "body": "Literally it’s so weird. My ARFID doesn’t really bother me that much like it’s my normal bUT IT SURE BOTHERS OTHER PEOPLE FOR SOME REAOSN",
      "created_utc": 1726683569.0,
      "score": 6,
      "context": []
    },
    {
      "id": "lns0ubt",
      "author": "TheBackyardigirl",
      "body": "As an autistic person who also gets shit for that, a lot of people just do not like the concept of adapting and changing to meet someone’s needs. If you don’t fit the ‘norm’, YOU are the one in the wrong, not them for refusing to help you",
      "created_utc": 1726685978.0,
      "score": 6,
      "context": []
    },
    {
      "id": "lnqi9lt",
      "author": "St4r_5lut",
      "body": "Food is such an important aspect of life for most people no one can understand it not being that important to someone. I actually have a similar sentiment- I am an autistic maladaptive daydreamer with a special interest in my ocs and worldbuilding. For the first 10-12 years of my life I was genuinely convinced that everyone had as detailed of a world inside their head, and when people would tell me they didn’t I simply wouldn’t believe them. Because what do you mean there aren’t thousands of people in your head and countries and politics and a place for you to be safe in inside your head? It took me a long time to realize no, in fact I’m actually the odd one out. \n\nThat’s not to say that their reactions aren’t painful, rude, and quite frankly unnecessary. It’s bullshit that it’s normalized to react this way to us. But at least we can sit in a semblance of comfort knowing they just fundamentally don’t understand us. That there is an opportunity for them to understand us one day.",
      "created_utc": 1726668667.0,
      "score": 12,
      "context": []
    },
    {
      "id": "lnqq9v0",
      "author": "Professional_Ear9795",
      "body": "EATING IS MORALLY NEUTRAL. WHAT YOU EAT IS MORALLY NEUTRAL. HOW PLAIN YOU EAT YOUR FOOD IS MORALLY NEUTRAL. 🫶🏽\n\nWhen I was a kid I got yelled at a lot. I wasn't until I was 29 that I learned that there's no reason for anyone to yell at you. I can't wait until you're adult and can set your own boundaries 🫶🏽 you are allowed to say \"you can't yell at me\".\n\nMy parents treated me that way as a kid. Now my partners don't. Ever. Because I don't allow it. \n\nI've eaten the same plain burger EVERY NIGHT for the past 3-4 weeks and my partner has never complained once or remarked at all, other than \"that's ok :)\". Even though it means that he has eaten the same thing for 3 weeks too (he def doesn't have ARFID).\n\nYou deserve to be accommodated and treated as a whole human, no matter what you eat.",
      "created_utc": 1726671309.0,
      "score": 11,
      "context": []
    },
    {
      "id": "lnr8rcg",
      "author": "APairOfRaggedQuarks",
      "body": "This is why I don’t explain my ARFID to people. I’ve vaguely mentioned to some friends that I’m “in recovery for an ed” and everyone immediately assumes I mean AN without asking further questions.\n\nI’d correct their assumptions if it ever came up directly, but for now I’m happy to let them jump to conclusions. Some people truly don’t comprehend that eating disorders can be more varied and complex than the “skinny teenage girl with anorexia/bulimia” stereotype, and I’m too tired to fight them about it 😵‍💫",
      "created_utc": 1726677167.0,
      "score": 10,
      "context": []
    },
    {
      "id": "lnsf52a",
      "author": "Playful-Flatworm501",
      "body": "Personally I don’t have arfid and I find it very interesting. There are lots of foods I can’t bear to eat so is it like that on a greater scale?",
      "created_utc": 1726690431.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lnt7yq5",
      "author": "Ashenlynn",
      "body": "I've found a lot of comfort in my fellow Gen Z peeps. All I have to tell them is that I have an eating disorder (I don't care to explain food intake vs eating disorder) or autism and food is just hard for me as a result. They tend to just take it at face value. Older people are fucking awful about it though, especially when I was growing up\n\nHave you tried explaining that you also wish you weren't a picky eater either? Sometimes I'm able to get people \"on my side\" almost against the disorder instead of me",
      "created_utc": 1726700039.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lnsqytg",
      "author": "TemperanceL",
      "body": "Don't have much to add to what everyone else already said, but can totally agree to this.\n\nEating a wide variety of meals is so ingrained in the human experience that when we deviate from it, even if it's due to something specific, many folks just don't bother even comprehending.\n\nBig hug from a random internet lady <3",
      "created_utc": 1726694113.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lnsr6rp",
      "author": "I_use_the_word_shall",
      "body": "Personally, one of the only things I used to get ‘bullied’ for was my choice of foods to eat. And tbh I just don’t tell people I’ve got ARFID, and I just say I’m incredibly picky, and still sometimes my friends will accidentally make rude comments, but mainly I get ‘ohh, you’re so lucky because you get to just eat certain things! I wish I was a picky eater!’ No. No you don’t.",
      "created_utc": 1726694183.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lnvnuv6",
      "author": "Lasagan",
      "body": "People with poor emotional regulation skills and/or low empathy get angry and lash out about stuff they don't understand.",
      "created_utc": 1726744374.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lnyn5mv",
      "author": "CharleneParlene",
      "body": "I was this parent. Until I was diagnosed with ARFID never hearing of such thing before. Then I realised my 12 year old son has struggled with it for years and years and I've always moaned about it.\n\nOnce I understood exactly what was going on with me I knew this is what my son has but so much worse than me.\nFor example he will only have a plain cheese sandwich from school, one day he couldn't get this sandwich so starved himself instead and from that day he went on packed lunches which consists of the same 4 items daily which I allowed him to choose.\n\nA cheese sandwich\nA yogurt with NO BITS \nA Bag of crisp\nAn apple\n\nEvery single day the same, but now I'd rather feed him what I know he will eat because its better than nothing at all and the constant waste of food if he doesn't like something (which he probably has about 10 safe foods).\nI also now feel guilty for years of having a go :(",
      "created_utc": 1726784934.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lo3h0v8",
      "author": "jintana",
      "body": "Culture around food is insane. People feel personally rejected because someone who has their own shit to deal with (us with ARFID) does not want to eat identical food, or receive a gift of food. I get that preparation of food at home by a parent is tough, but we find ways to work around it. Everyone has an opinion, though!\n\nI’ve built my own culture around food and most people feel perfectly comfortable rejecting it, or rejecting the other alternative styles and cultures of food. They never mean it as personally as they take it, and would fault me for overreacting if I were to take it that way anyway, even though they’re like that. \n\nSo I just eat what I like, and don’t spend time around people who are assholes about it. \n\nI managed to have kids, and they’re generally like me, but I make sure they have access to what they like and don’t make it hard for them. They showed signs of it within their first year of life.",
      "created_utc": 1726859276.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mgcs3jk",
      "author": "CarpeVesper",
      "body": "Many people think ARFID stems from parents feeding their kids less healthy food from a young age that became a long-term habit and preference - a preference for the salt and sugar and fat found in common safe foods like chicken nuggets, french fries, and snack foods. They think people with ARFID are just so used to the taste of those specific foods, that's what they crave, but have it within their control to try and get used to other foods and more healthy options. They hear the argument that a chicken nugget is always the same but a blueberry is not, yet look at the consistency found in other healthy foods and that argument falls apart for them. Where I live, people in Facebook groups and such are constantly asking for charity to buy their safe foods like pizza, McDonald's, etc.,stating that either they or their kid(s) have ARFID. People seem to commonly react poorly to these frequent requests, responding that nobody NEEDS junk food and they'd only be ok contributing towards healthy food options/groceries, as take-out is a luxury to them, not a need, no matter the food.",
      "created_utc": 1741279464.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lnsuzkp",
      "author": "_FirstOfHerName_",
      "body": "I'm in recovery and the feelings I felt when I ate nothing are so alien to me now. If I, who experienced ARFID full force for 29 years, can't even connect with my previous approach, feelings, fear, and repulsion to food, you've got to appreciate how others can't.\n\nEven now I'm like... \"why didn't I just put it in my mouth and chew?\" - it's like a switch flipped and I could just do it all of a sudden.",
      "created_utc": 1726695443.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lnuf1l0",
      "author": "calmingthechaos",
      "body": "I admit that I'm lucky and come from a \"picky\" family. While not everyone in my family is picky, there are enough of us that are that accommodating everyone has never been a big deal. My family is on the neuro spicy side, and it's very common that ARFID/picky eating is one of the expansion packs we didn't ask for. I also have some friends who are very accommodating and understanding. HOWEVER. The reason I stopped talking to one of my exes (we weren't together but trying something out) because he made me feel like absolute trash for not being able to eat most things. My food issues somehow became about him. I'm fairly certain I am allergic to seafood, and he didn't believe me because I've never been tested. So, okay, let's test it by having me eat something that could kill me? Cool, cool. Seems legit. And the worst part is that I literally told him that the best way to help if that's what he wanted to do was to, I dunno, *not* make my anxiety worse by shaming me. Yet he did the complete fucking opposite. I even explained that I have a friend I can try new foods with because I feel *safe* doing so. It's so fucking weird how people get personally offended by something that doesn't even affect them. Also, shoutout to my friend for making me block that ex when he came back around because my friend heard all about the way I was treated, and he hated that for me.\n\nI hope you find a good support system, OP. You don't deserve to be treated badly because of your ARFID. You don't deserve to be treated badly at all, for any reason. It's already enough of a struggle dealing with ARFID.",
      "created_utc": 1726716822.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lnuoz0g",
      "author": "That_izzy",
      "body": "People think that I'm faking it and laugh nine times out of 10. They'll just look at me and go ha ha what's the point every single day? I ask the people to be chill about it and only one person I know is chill about it and the only reason that they chill about it is because they've gone through it themselves and they said I don't wish it on my best friend or my worst enemy or even you that's pretty not. It's pretty not cool and also to add even people in my own personal life. Don't know what to do. I'll sit there and be like oh we could you could try this? You could try that and then I'll try it and I'll gag. I'll try it or I'll be like the smell is off or I'll try it and I'll be like there's too many chunks and blend it to bits and blitz it and I'll try no blankets off. There's bits in it like if I want it fine and smooth. I don't want bits in it. It's not cool they say ha ha you're wasting food when I'm not trying to waste food. I'm just trying to live and survive and get something in me whether it's ribena whether it's a lunch meal. Whether it's a breakfast meal, I just want to be able to eat and not feel guilty about what I eat. I don't want to be able to know if I can eat without being scared and without fear of food and the texture and the crunch and the sensory profile side of it is crazy due to my autism. It's not cool. It's not funny. I actually would highly recommend y'all who don't understand ARFID please educate yourself on The condition because I had to educate my folks on it and now they are actually actively trying to help. And thanks to my mum's work, she's getting educated everyday and it's great cuz now she's slowly understanding what Alfred is and she's like. Oh you gave it a try. You did the three bite challenge. The first bite bite of food is the initial overwhelm in the second bite? Is the textual bite and getting used to it? And the third byte is the overall? Do I like it or not? If I don't want a third bite, I don't have to have a third bite where it used to be. You eat the whole meal end the story.",
      "created_utc": 1726721808.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lnxi1lr",
      "author": "None",
      "body": "When I go out to eat, especially with coworkers, I order for example a pizza and they get some crazy salad with all sorts of veggies and toppings. They'll say \"you always just have pizza, a sandwich or other boring food.\" \n\nI'm sorry my eating choices have affected you so much, that you have to say something or you will implode. Wtf?\n\nEdit: over the years my parents have realized I'm not playing and I met my wife who is the most understanding human about my ARFID.",
      "created_utc": 1726768082.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lognhs0",
      "author": "None",
      "body": "It seems that this is common for us.\n\nI had a boss who wanted to fire me for not eating whatever she decided that the group should eat for lunch and would just watch me the entire lunch hour. Another turned it into a spectacle by constantly asking questions the entire time and making what I ate or didn’t eat a group discussion in our department.\n\nFor some reason, people like to make food choices a maturity issue and if you don’t eat what they eat, then you are immature, incapable, incompetent, etc. They never consider that it could be religion, ARFID, autism, allergies, etc. (and in my case it was ALL of those). ",
      "created_utc": 1727056205.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lwgna1e",
      "author": "Esteban9018",
      "body": "I am 34 years old and the worst feeling is planning a vacation, an outing with friends, a dinner at work, all these things in a short amount of time fill you with good energy until you put food into the equation and feel the weight on your shoulders. Social pressure and teasing.",
      "created_utc": 1731268262.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lxlz7ru",
      "author": "Dogdigmine",
      "body": "I don't think people realize how seriously it can effect someone. They see it as something you can ultimately choose to deal with if you just 'push a little bit more' without realizing the insane effort it can take. Typically when I focus on expanding my food list it's like a month or two time period of me learning and practicing with cooking (actually making it can it feel safer we found) and giving myself a ton of exposure therapy—typically during this I dont have the mental energy or capacity to improve or work on anything else.\n\nIt's kinda like the way mental health is looked at as a whole, a lot of people look at disabilities and disorders and go only by what they see. (Like when a karen gets mad at someone in disabled parking because they don't have a wheelchair without taking into consideration that the person could have a disablity that's just not visible.)\nTypically when someone sees ARFID, it genuinely just looks like picky eating.\n\nHowever, on a good note, it doesn't mean that no one will understand. My gf and bestfriend understand as we've talked to them about what it actually feels like, we've vented about not being able to eat, and celebrated the fact i finally enjoyed strawberries after months of trying to adjust to them—she saw me go from gagging and spitting it out to enjoying it over the course of months, so it's safe to say she gets that this is a genuine disorder.",
      "created_utc": 1731860251.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mnbmwq7",
      "author": "This_Giraffe_2250",
      "body": "I mean.  It's irritating.  Do you work on this daily? Do you make yourself eat new foods on a regular basis? Because if not, I can see how people in your life would lose patience.",
      "created_utc": 1744760749.0,
      "score": 0,
      "context": []
    },
    {
      "id": "n4d8m6q",
      "author": "Upstairs-Leave8386",
      "body": "Personally my issue with Arfid   is because my mother had this along with OCD. It was ridiculously difficult growing up with a parent who would not eat many many things and would only eat them prepared in one way. It felt very juvenile and we all ended up having to cow tow to her “ issues” just to keep the peace at home.  It was a never ending battle with her and as such it was super annoying to everyone else because we ALL had to deal with whatever her weird arfid issues were on never ending basis. People just grow tired of the situation where one person can not or will not eat what everyone else just typically eats naturally. It affected our everyday life. We all became very unempathic over time . Between that and the OCD nuttiness it was like we all wanted to just fucking escape and live normal lives with people who are normally and do not have all these rituals and eccentric behaviors and beliefs .",
      "created_utc": 1753115898.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m1tys9o",
      "author": "TheTransAgender",
      "body": "Watching my partner slowly starve herself to death and I can't say anything about it because it's widely* outside her control, is a big part of why I hate this shit,  personally.",
      "created_utc": 1734079004.0,
      "score": 0,
      "context": []
    },
    {
      "id": "lnynhuc",
      "author": "CharleneParlene",
      "body": "Nope, I an 30 years old and am very fussy who I eat from. Things have to be done a certain way",
      "created_utc": 1726785053.0,
      "score": 5,
      "context": [
        {
          "id": "lnqe1xw",
          "author": "Mother_Goat1541",
          "body": "I’m a 40 year old mom, and people think they can “fix” me if I just *tried the food the way they make it* and get mad if I decline.",
          "created_utc": 1726667190.0
        }
      ]
    },
    {
      "id": "lnqz30o",
      "author": "Inner_Arm9482",
      "body": "Exactly. It’s funny they think that we’re deliberately chosing to eat like this and just don’t care, because my inability to enjoy different foods is probably one of the things I hate the most about myself. I mourn all of the fun foods, cultural dishes, weird combinations, etc I will never be able to try. \n\nI hate that they act like they could ever be more upset about it than I am",
      "created_utc": 1726674107.0,
      "score": 37,
      "context": [
        {
          "id": "lnqjrx1",
          "author": "giraffemoo",
          "body": "I think they think we are faking it. I honestly don't know, but that's what I think. They see us eating pizza and French fries when they are eating more healthy and diverse meals. What people like that don't know or understand is that I really wish I could eat like they do, I wish I could just eat food without inspecting it or knowing in advance what the taste and texture is. \n\nThey see us eating the food they wish they could let themselves eat all the time. I've had people even say that to me, \"I wish I could have pizza for dinner every day\" like they think I'm just being indulgent or giving into cravings.",
          "created_utc": 1726669180.0
        }
      ]
    },
    {
      "id": "lnutshf",
      "author": "asmit1241",
      "body": "My partner didn't understand my issues with food until i ordered dumplings at a new restaurant and almost blew chunks everywhere when i took the first bite. Problem solved lmao\n\nDumplings are legit the safest of my safe foods and this man saw me inhaling them everywhere i went, but when he saw that reaction to a dumpling he stopped any and all lines of questioning when it comes to food. I think he realised in the moment how much i actually was playing it down for him to try and help him understand",
      "created_utc": 1726724593.0,
      "score": 9,
      "context": [
        {
          "id": "lnqjrx1",
          "author": "giraffemoo",
          "body": "I think they think we are faking it. I honestly don't know, but that's what I think. They see us eating pizza and French fries when they are eating more healthy and diverse meals. What people like that don't know or understand is that I really wish I could eat like they do, I wish I could just eat food without inspecting it or knowing in advance what the taste and texture is. \n\nThey see us eating the food they wish they could let themselves eat all the time. I've had people even say that to me, \"I wish I could have pizza for dinner every day\" like they think I'm just being indulgent or giving into cravings.",
          "created_utc": 1726669180.0
        }
      ]
    },
    {
      "id": "logo15f",
      "author": "None",
      "body": "They also try to make it a “worried about our health” issue when it is not. I have seen these people eat fatty pork chops, salads with EVERYTHING in it covered in globs of dressing, globs of mayo on everything, globs of ketchup on everything, oil used unnecessarily - definitely not healthy, but they will cry about us being unhealthy for taking vitamins, having a muffin and two apples, with water.",
      "created_utc": 1727056418.0,
      "score": 1,
      "context": [
        {
          "id": "lnqjrx1",
          "author": "giraffemoo",
          "body": "I think they think we are faking it. I honestly don't know, but that's what I think. They see us eating pizza and French fries when they are eating more healthy and diverse meals. What people like that don't know or understand is that I really wish I could eat like they do, I wish I could just eat food without inspecting it or knowing in advance what the taste and texture is. \n\nThey see us eating the food they wish they could let themselves eat all the time. I've had people even say that to me, \"I wish I could have pizza for dinner every day\" like they think I'm just being indulgent or giving into cravings.",
          "created_utc": 1726669180.0
        }
      ]
    },
    {
      "id": "lnrkshz",
      "author": "auner01",
      "body": "Sharing a common meal with a group of people is one of the simplest and oldest ways to form communal bonds. Cooking for a group is a common method to show affection and that bond to the group.\n\n  \nConversely, refusing to partake of the common meal or requiring an entirely different meal can be perceived as a power play or act of disruption against the group.. 'this person is being a bad guest/won't eat my salt, kill the interloper before they can betray us!' sort of thinking. \n\n  \nAnd that's before any considerations such as budgeting (time, money, and effort.. in effect doing the work of two meals to prepare one majority meal and one 'safe foods' meal, the contents of which often shift without warning).\n\n  \nCompassion fatigue might be a factor also, but that's more on a case-by-case basis.",
      "created_utc": 1726680946.0,
      "score": 30,
      "context": [
        {
          "id": "lnq4ew2",
          "author": "EddoWagt",
          "body": "This is really common and I honestly don't know why, but it does suck",
          "created_utc": 1726663521.0
        }
      ]
    },
    {
      "id": "lnq5gjd",
      "author": "Inner_Arm9482",
      "body": "So I’m not crazy lol! I really truly don’t understand why it gets them so worked up. I do try to put myself in their shoes, because a lot of people hate my #1 safe food- but I never find myself getting nearly as upset as they do when someone says it tastes nasty. In fact I couldn’t give less of a shit.",
      "created_utc": 1726663938.0,
      "score": 29,
      "context": [
        {
          "id": "lnq508a",
          "author": "None",
          "body": "People are super emotional when it comes to food. They act like you just called their Grandma a sex worker if you don't like their favorite food or don't try it. For some, their social life and get togethers completely revolve around food, and they can't even imagine how we function. Sadly, your experience is far from abnormal for people with Arfid.",
          "created_utc": 1726663759.0
        }
      ]
    },
    {
      "id": "lnqoe6x",
      "author": "shadyprincess",
      "body": "this dude at my job definitely has arfid and comments about what's on MY plate every time. bitch you need to go to the doctor too",
      "created_utc": 1726670710.0,
      "score": 18,
      "context": [
        {
          "id": "lnq9nbq",
          "author": "KirbysLeftBigToe",
          "body": "I had an ex girlfriend who literally had ARFID as well treat me poorly about it. She’d get really angry and offended when I’d get anxious about being served food by her because I’m anxious about being served food by ANYONE. \n\nIt’s not even really about understanding I think it’s just about empathy. Which a lot of people don’t seem to have for us.",
          "created_utc": 1726665559.0
        }
      ]
    },
    {
      "id": "loaetzr",
      "author": "None",
      "body": "I think a lot of it boils down to empathy. Some people just don't have the emotional intelligence to keep their knee jerk reaction to themselves, let alone offer empathy towards something they don't initially understand. It's painful to endure over and over, but it does weed people out pretty fast. ",
      "created_utc": 1726963303.0,
      "score": 3,
      "context": [
        {
          "id": "lnq9nbq",
          "author": "KirbysLeftBigToe",
          "body": "I had an ex girlfriend who literally had ARFID as well treat me poorly about it. She’d get really angry and offended when I’d get anxious about being served food by her because I’m anxious about being served food by ANYONE. \n\nIt’s not even really about understanding I think it’s just about empathy. Which a lot of people don’t seem to have for us.",
          "created_utc": 1726665559.0
        }
      ]
    },
    {
      "id": "lnsrglq",
      "author": "I_use_the_word_shall",
      "body": "After 18 years I’m over it lol, cannot imagine how horrible it would be for 44\n\noh god",
      "created_utc": 1726694273.0,
      "score": 3,
      "context": [
        {
          "id": "lnqemhq",
          "author": "First-Butterscotch-3",
          "body": "It's different and people dislike what is different - add in this weird social thing of getting offended over people's dietary choices \n\nAfter 44 years I'm over it",
          "created_utc": 1726667393.0
        }
      ]
    },
    {
      "id": "lnvdp5f",
      "author": "Carlulua",
      "body": "My partner is super supportive too! \n\nMy family were mostly fine as my mum and brother are very ARFIDy too. \n\nBut I still had a lot of anxiety over it for years. \n\nMy partner eats anything and likes to offer me foods to try. If I don't wanna he doesn't push it and never has. He likes to suggest foods I might wanna try and eats mine if I don't like it. Never makes a big deal of it. Never gives it a second thought if I request something finely chopped. Laughs with me, not at me, about how context dependent some of my food quirks are. Stresses how proud he is of me for giving foods a go. \n\nHe's an amazing cook too so that helps a lot.",
      "created_utc": 1726738205.0,
      "score": 2,
      "context": [
        {
          "id": "lnqoo29",
          "author": "MaleficentSwan0223",
          "body": "I attempted to kill myself because my arfid offended my family so much. I eat plain things, I don’t eat at all, I never take their food nor eat in front of them or with them - nothing I did made them happy. I live with love you husband now and his mantra is “as long as I don’t have to eat what you eat I don’t care” and I’ve just learnt to surround myself with people like him. ",
          "created_utc": 1726670798.0
        }
      ]
    },
    {
      "id": "lnq8v8n",
      "author": "gothpriest",
      "body": "i also want to add that yes food is a central part of many cultures and just society at large today. this does NOT have to be an issue. anyone who means well will accommodate you  because they value involving you in those cultural moments. not ostracize you. my bf's family will happily serve me a plain meal just so i will sit at the table with them. no judgement. that is what true love and compassion is!",
      "created_utc": 1726665261.0,
      "score": 17,
      "context": [
        {
          "id": "lnq8if4",
          "author": "gothpriest",
          "body": "i have been extremely lucky that Most* people in my life have been accommodating and understanding. im glad that guy is your EX now. you deserve to be surrounded by supportive and compassionate people.\n\nit's my personal belief that those who cannot understand the struggles of others are just unevolved (for lack of a better term.) anyone who is mature, smart, and compassionate will try to understand you even if they cannot relate in anyway. my closest friends and parters have all been this way so there are definitely people out there like that. and those are the people you need in your corner because they will help you more than any nasty judgemental comment will. my boyfriend will bend over backwards to make sure i eat and i eat enough of the right thing. now you may not need the level of support that i need from others but you have to remember that this is a disability and the way people treat you over it  is indicative of what kind of person they are.",
          "created_utc": 1726665125.0
        }
      ]
    },
    {
      "id": "lnqxxex",
      "author": "Inner_Arm9482",
      "body": "Yuppp!! I’ve started using this recently too. I always preface my eating restrictions as being a result of a disorder rather than letting them immediately judge me for something they know nothing about. It helps with the nasty comments a lot",
      "created_utc": 1726673746.0,
      "score": 9,
      "context": [
        {
          "id": "lnqo5xh",
          "author": "shadyprincess",
          "body": "it's the most difficult part about having arfid for me\n\nmy therapist once said that food is very connected to a sense of love and connection, so people probably take it personally due to that attachment\n\neither way they're fucking weirdos and I've learned to make them feel ashamed instead. if they make comments, i usually say like \"well, there's this eating disorder.....\" \n\nit informs people and also makes them feel bad for making fun of an ED lol",
          "created_utc": 1726670635.0
        }
      ]
    },
    {
      "id": "lnqxpox",
      "author": "Inner_Arm9482",
      "body": "It’s interesting you use that example, because I experience the same thing! I have had paracosms since I can remember, and it’s honestly brought me so much joy. I love having inner worlds with dynamic characters and plots, it’s helped me as a safe space during some of the worst times of my life. We’re in this together lol 🫂",
      "created_utc": 1726673678.0,
      "score": 3,
      "context": [
        {
          "id": "lnqi9lt",
          "author": "St4r_5lut",
          "body": "Food is such an important aspect of life for most people no one can understand it not being that important to someone. I actually have a similar sentiment- I am an autistic maladaptive daydreamer with a special interest in my ocs and worldbuilding. For the first 10-12 years of my life I was genuinely convinced that everyone had as detailed of a world inside their head, and when people would tell me they didn’t I simply wouldn’t believe them. Because what do you mean there aren’t thousands of people in your head and countries and politics and a place for you to be safe in inside your head? It took me a long time to realize no, in fact I’m actually the odd one out. \n\nThat’s not to say that their reactions aren’t painful, rude, and quite frankly unnecessary. It’s bullshit that it’s normalized to react this way to us. But at least we can sit in a semblance of comfort knowing they just fundamentally don’t understand us. That there is an opportunity for them to understand us one day.",
          "created_utc": 1726668667.0
        }
      ]
    },
    {
      "id": "lnqy3w7",
      "author": "Inner_Arm9482",
      "body": "Thank you!!!!!!!!! This is such great reassurance to recieve. I wish more people had this mindset 🫶",
      "created_utc": 1726673802.0,
      "score": 4,
      "context": [
        {
          "id": "lnqq9v0",
          "author": "Professional_Ear9795",
          "body": "EATING IS MORALLY NEUTRAL. WHAT YOU EAT IS MORALLY NEUTRAL. HOW PLAIN YOU EAT YOUR FOOD IS MORALLY NEUTRAL. 🫶🏽\n\nWhen I was a kid I got yelled at a lot. I wasn't until I was 29 that I learned that there's no reason for anyone to yell at you. I can't wait until you're adult and can set your own boundaries 🫶🏽 you are allowed to say \"you can't yell at me\".\n\nMy parents treated me that way as a kid. Now my partners don't. Ever. Because I don't allow it. \n\nI've eaten the same plain burger EVERY NIGHT for the past 3-4 weeks and my partner has never complained once or remarked at all, other than \"that's ok :)\". Even though it means that he has eaten the same thing for 3 weeks too (he def doesn't have ARFID).\n\nYou deserve to be accommodated and treated as a whole human, no matter what you eat.",
          "created_utc": 1726671309.0
        }
      ]
    },
    {
      "id": "lnwpwyi",
      "author": "Scorpiodancer123",
      "body": "This is such an important point and good for you for standing up for yourself.\n\nBut God damn people get morally superior about EVERYTHING!!! Listen to cheesy pop music instead of a band that plays their own instruments and writes their own songs? Spend your evenings playing video games instead of reading books? Reading James Patterson instead of War and Peace? Hell some people even get bent out of shape about people reading on a Kindle instead of a \"real\" book!\n\nAnd that's just about \"controllable\" things. I cannot imagine how people can get so upset about someone else's food choices, let alone an eating disorder. Literally no-one would choose this. \n\nI remember watching Aladdin as a kid and my mother asking me what I would wish for. I said to be able to eat like a normal person. I was about 9 years old. Only then did she understand what was happening and that I wasn't being awkward.",
      "created_utc": 1726759145.0,
      "score": 3,
      "context": [
        {
          "id": "lnqq9v0",
          "author": "Professional_Ear9795",
          "body": "EATING IS MORALLY NEUTRAL. WHAT YOU EAT IS MORALLY NEUTRAL. HOW PLAIN YOU EAT YOUR FOOD IS MORALLY NEUTRAL. 🫶🏽\n\nWhen I was a kid I got yelled at a lot. I wasn't until I was 29 that I learned that there's no reason for anyone to yell at you. I can't wait until you're adult and can set your own boundaries 🫶🏽 you are allowed to say \"you can't yell at me\".\n\nMy parents treated me that way as a kid. Now my partners don't. Ever. Because I don't allow it. \n\nI've eaten the same plain burger EVERY NIGHT for the past 3-4 weeks and my partner has never complained once or remarked at all, other than \"that's ok :)\". Even though it means that he has eaten the same thing for 3 weeks too (he def doesn't have ARFID).\n\nYou deserve to be accommodated and treated as a whole human, no matter what you eat.",
          "created_utc": 1726671309.0
        }
      ]
    },
    {
      "id": "lnulwyh",
      "author": "SadisticGoose",
      "body": "I’ve had multiple eating disorders, and people aren’t much kinder about them than ARFID. I had to go to residential because I had anorexia, and fresh out of treatment, I had someone who at the time I considered a close friend and knew all about me going to residential make fun of me for not eating salad AS I was explaining to him why I have so much difficulty with food. He turned out to be a massive asshole, and that was a big red flag for me. \n\nWhen I talk about being in recovery from anorexia, people often make snide comments about how I “recovered quick” because I’m a bigger gal. People are just so fucking mean when it comes to difficulty with food.",
      "created_utc": 1726720185.0,
      "score": 4,
      "context": [
        {
          "id": "lnr8rcg",
          "author": "APairOfRaggedQuarks",
          "body": "This is why I don’t explain my ARFID to people. I’ve vaguely mentioned to some friends that I’m “in recovery for an ed” and everyone immediately assumes I mean AN without asking further questions.\n\nI’d correct their assumptions if it ever came up directly, but for now I’m happy to let them jump to conclusions. Some people truly don’t comprehend that eating disorders can be more varied and complex than the “skinny teenage girl with anorexia/bulimia” stereotype, and I’m too tired to fight them about it 😵‍💫",
          "created_utc": 1726677167.0
        }
      ]
    },
    {
      "id": "lnsgkcm",
      "author": "Inner_Arm9482",
      "body": "Yes!I usually describe it as “chronic picky eating”\n\nIf you’re interested in the details, the way arfid effects me specifically (I don’t know if other people are like this as well) is that I only eat incredibly plain foods. Usually Mono-textured and simple flavors. Whenever I do try to eat more complex foods with lots of textures and tastes, I literally can’t discern the individual flavors, and I just end up tasting a taste that I can only describe as “overwhelmed”. This also makes it so a lot of foods taste the same to me! Like I can’t really taste the difference between say a burger and a salad- they both just have that disgusting “get it out of my mouth” taste I mentioned before. It’s very interesting to me as well and I would love to actually have answers to why my brain does this :P",
      "created_utc": 1726690869.0,
      "score": 2,
      "context": [
        {
          "id": "lnsf52a",
          "author": "Playful-Flatworm501",
          "body": "Personally I don’t have arfid and I find it very interesting. There are lots of foods I can’t bear to eat so is it like that on a greater scale?",
          "created_utc": 1726690431.0
        }
      ]
    },
    {
      "id": "m8139xt",
      "author": "Civil-Usual2565",
      "body": "Wow, could you please explain more of what happened around that switch and if you have an idea of what could have helped you get to that switch ? It seems really interesting",
      "created_utc": 1737314028.0,
      "score": 1,
      "context": [
        {
          "id": "lnsuzkp",
          "author": "_FirstOfHerName_",
          "body": "I'm in recovery and the feelings I felt when I ate nothing are so alien to me now. If I, who experienced ARFID full force for 29 years, can't even connect with my previous approach, feelings, fear, and repulsion to food, you've got to appreciate how others can't.\n\nEven now I'm like... \"why didn't I just put it in my mouth and chew?\" - it's like a switch flipped and I could just do it all of a sudden.",
          "created_utc": 1726695443.0
        }
      ]
    },
    {
      "id": "mnbp2e5",
      "author": "Inner_Arm9482",
      "body": "I do “work on my ARFID” any chance I can get. I try new things regularly. However, at some point it is not about trying to rid myself of it, it’s just about eating what I can finish, what gives me nutrients, and what makes me happy.\n\nBeing yelled at, given the silent treatment, or generally ridiculed for my food choices that affect no one but myself is infinitely more irritating than having to watch me eat a peanut butter and jelly sandwich.",
      "created_utc": 1744761490.0,
      "score": 2,
      "context": [
        {
          "id": "mnbmwq7",
          "author": "This_Giraffe_2250",
          "body": "I mean.  It's irritating.  Do you work on this daily? Do you make yourself eat new foods on a regular basis? Because if not, I can see how people in your life would lose patience.",
          "created_utc": 1744760749.0
        }
      ]
    },
    {
      "id": "lnvqbi6",
      "author": "Tasty_Burger",
      "body": "I don’t think it’s evolutionarily engrained - more a psychological impulse stemming from common childhood experience. Most kids are picky and grow up with parents slowly forcing them to eat more foods. So when people see ‘picky’ adults they make a judgement, conscious or not, that the other person is doing something fundamentally wrong or immature.",
      "created_utc": 1726745589.0,
      "score": 9,
      "context": [
        {
          "id": "lnq4ew2",
          "author": "EddoWagt",
          "body": "This is really common and I honestly don't know why, but it does suck",
          "created_utc": 1726663521.0
        },
        {
          "id": "lnrkshz",
          "author": "auner01",
          "body": "Sharing a common meal with a group of people is one of the simplest and oldest ways to form communal bonds. Cooking for a group is a common method to show affection and that bond to the group.\n\n  \nConversely, refusing to partake of the common meal or requiring an entirely different meal can be perceived as a power play or act of disruption against the group.. 'this person is being a bad guest/won't eat my salt, kill the interloper before they can betray us!' sort of thinking. \n\n  \nAnd that's before any considerations such as budgeting (time, money, and effort.. in effect doing the work of two meals to prepare one majority meal and one 'safe foods' meal, the contents of which often shift without warning).\n\n  \nCompassion fatigue might be a factor also, but that's more on a case-by-case basis.",
          "created_utc": 1726680946.0
        }
      ]
    },
    {
      "id": "lnsi1rg",
      "author": "None",
      "body": ":P",
      "created_utc": 1726691325.0,
      "score": 4,
      "context": [
        {
          "id": "lnq4ew2",
          "author": "EddoWagt",
          "body": "This is really common and I honestly don't know why, but it does suck",
          "created_utc": 1726663521.0
        },
        {
          "id": "lnrkshz",
          "author": "auner01",
          "body": "Sharing a common meal with a group of people is one of the simplest and oldest ways to form communal bonds. Cooking for a group is a common method to show affection and that bond to the group.\n\n  \nConversely, refusing to partake of the common meal or requiring an entirely different meal can be perceived as a power play or act of disruption against the group.. 'this person is being a bad guest/won't eat my salt, kill the interloper before they can betray us!' sort of thinking. \n\n  \nAnd that's before any considerations such as budgeting (time, money, and effort.. in effect doing the work of two meals to prepare one majority meal and one 'safe foods' meal, the contents of which often shift without warning).\n\n  \nCompassion fatigue might be a factor also, but that's more on a case-by-case basis.",
          "created_utc": 1726680946.0
        }
      ]
    },
    {
      "id": "lnqwdp6",
      "author": "Inner_Arm9482",
      "body": "This is so comforting and helpful to read, it gives me a lot more hope about finding acceptance in the future 🫶",
      "created_utc": 1726673257.0,
      "score": 5,
      "context": [
        {
          "id": "lnq8if4",
          "author": "gothpriest",
          "body": "i have been extremely lucky that Most* people in my life have been accommodating and understanding. im glad that guy is your EX now. you deserve to be surrounded by supportive and compassionate people.\n\nit's my personal belief that those who cannot understand the struggles of others are just unevolved (for lack of a better term.) anyone who is mature, smart, and compassionate will try to understand you even if they cannot relate in anyway. my closest friends and parters have all been this way so there are definitely people out there like that. and those are the people you need in your corner because they will help you more than any nasty judgemental comment will. my boyfriend will bend over backwards to make sure i eat and i eat enough of the right thing. now you may not need the level of support that i need from others but you have to remember that this is a disability and the way people treat you over it  is indicative of what kind of person they are.",
          "created_utc": 1726665125.0
        },
        {
          "id": "lnq8v8n",
          "author": "gothpriest",
          "body": "i also want to add that yes food is a central part of many cultures and just society at large today. this does NOT have to be an issue. anyone who means well will accommodate you  because they value involving you in those cultural moments. not ostracize you. my bf's family will happily serve me a plain meal just so i will sit at the table with them. no judgement. that is what true love and compassion is!",
          "created_utc": 1726665261.0
        }
      ]
    },
    {
      "id": "lnr274j",
      "author": "St4r_5lut",
      "body": "Heck yea, paracosm people for life lol",
      "created_utc": 1726675078.0,
      "score": 2,
      "context": [
        {
          "id": "lnqi9lt",
          "author": "St4r_5lut",
          "body": "Food is such an important aspect of life for most people no one can understand it not being that important to someone. I actually have a similar sentiment- I am an autistic maladaptive daydreamer with a special interest in my ocs and worldbuilding. For the first 10-12 years of my life I was genuinely convinced that everyone had as detailed of a world inside their head, and when people would tell me they didn’t I simply wouldn’t believe them. Because what do you mean there aren’t thousands of people in your head and countries and politics and a place for you to be safe in inside your head? It took me a long time to realize no, in fact I’m actually the odd one out. \n\nThat’s not to say that their reactions aren’t painful, rude, and quite frankly unnecessary. It’s bullshit that it’s normalized to react this way to us. But at least we can sit in a semblance of comfort knowing they just fundamentally don’t understand us. That there is an opportunity for them to understand us one day.",
          "created_utc": 1726668667.0
        },
        {
          "id": "lnqxpox",
          "author": "Inner_Arm9482",
          "body": "It’s interesting you use that example, because I experience the same thing! I have had paracosms since I can remember, and it’s honestly brought me so much joy. I love having inner worlds with dynamic characters and plots, it’s helped me as a safe space during some of the worst times of my life. We’re in this together lol 🫂",
          "created_utc": 1726673678.0
        }
      ]
    },
    {
      "id": "m81bcwx",
      "author": "_FirstOfHerName_",
      "body": "I smoked weed for ten years and stopped, which helped improve my relationship with food and I felt hunger instead of it just being the munchies.\n\nI started getting gusto boxes (like hello fresh) and making the meals for my partner. There was no pressure for me to eat it but I did eat most meals after I realised there was nothing too scary involved and what actually went into food. \n\nThe flavours I liked I delved into more and experimented with.\n\nThere was also an acid trip around the same time and idk if that had anything to do with it. First time I'd had any LSD and not had it since.",
      "created_utc": 1737316355.0,
      "score": 2,
      "context": [
        {
          "id": "lnsuzkp",
          "author": "_FirstOfHerName_",
          "body": "I'm in recovery and the feelings I felt when I ate nothing are so alien to me now. If I, who experienced ARFID full force for 29 years, can't even connect with my previous approach, feelings, fear, and repulsion to food, you've got to appreciate how others can't.\n\nEven now I'm like... \"why didn't I just put it in my mouth and chew?\" - it's like a switch flipped and I could just do it all of a sudden.",
          "created_utc": 1726695443.0
        },
        {
          "id": "m8139xt",
          "author": "Civil-Usual2565",
          "body": "Wow, could you please explain more of what happened around that switch and if you have an idea of what could have helped you get to that switch ? It seems really interesting",
          "created_utc": 1737314028.0
        }
      ]
    },
    {
      "id": "m8ip07w",
      "author": "Civil-Usual2565",
      "body": "Thank you a lot !",
      "created_utc": 1737544966.0,
      "score": 2,
      "context": [
        {
          "id": "lnsuzkp",
          "author": "_FirstOfHerName_",
          "body": "I'm in recovery and the feelings I felt when I ate nothing are so alien to me now. If I, who experienced ARFID full force for 29 years, can't even connect with my previous approach, feelings, fear, and repulsion to food, you've got to appreciate how others can't.\n\nEven now I'm like... \"why didn't I just put it in my mouth and chew?\" - it's like a switch flipped and I could just do it all of a sudden.",
          "created_utc": 1726695443.0
        },
        {
          "id": "m8139xt",
          "author": "Civil-Usual2565",
          "body": "Wow, could you please explain more of what happened around that switch and if you have an idea of what could have helped you get to that switch ? It seems really interesting",
          "created_utc": 1737314028.0
        },
        {
          "id": "m81bcwx",
          "author": "_FirstOfHerName_",
          "body": "I smoked weed for ten years and stopped, which helped improve my relationship with food and I felt hunger instead of it just being the munchies.\n\nI started getting gusto boxes (like hello fresh) and making the meals for my partner. There was no pressure for me to eat it but I did eat most meals after I realised there was nothing too scary involved and what actually went into food. \n\nThe flavours I liked I delved into more and experimented with.\n\nThere was also an acid trip around the same time and idk if that had anything to do with it. First time I'd had any LSD and not had it since.",
          "created_utc": 1737316355.0
        }
      ]
    }
  ]
}