{
  "id": "1fmq1e3",
  "subreddit": "ARFID",
  "author": "Flingkt",
  "created_utc": 1727000421.0,
  "title": "About all the hate we get…",
  "selftext": "What’s it about? Are people stunted in terms of empathy? Do they really think this is a choice?\n\nI say this as someone who’s gone out of my way my whole life to blend in. So many times I’ve had to swallow while working actively against my gag reflex. People say food is  important in terms of relating to others - sharing a meal is supposed to be a moment of coming together and bonding with each other. Meanwhile they don’t have to gag each time they get a bite with a different texture. Meanwhile they don’t have to fight, it just comes easy for them… They act like it’s my choice that I’m picky, that I’m purposely being difficult to what… annoy them? I’m fighting here, all day everyday. \n\nI usually eat what I’m served, but it’s usually a fight especially if it contains meat. I always work on widening my palate, reintroducing foods that have gone out of rotation etc. I just don’t feel like it’s my fault at this point, and I’m so sick of seeing all the hate we get when they don’t have any idea how much we have to *work* for something that they don’t even have to think about. ",
  "url": "https://www.reddit.com/r/ARFID/comments/1fmq1e3/about_all_the_hate_we_get/",
  "score": 125,
  "num_comments": 24,
  "comments": [
    {
      "id": "lock32d",
      "author": "MaleficentSwan0223",
      "body": "I think what baffles me is I will go out of my way to accommodate someone and I will happily go without or cause myself sickness and huge amount of anxiety just to make others happy and they’ll still be dicks to me. It’s not like I force anyone to eat the foods I do?! \n\nPeople act like we’re spoilt and get the dream diets but I’d love to be able to share a pizza, snack on food… damn I’d even like to just share foods that are safe with someone. It’s incredibly isolating having an anxiety around food. It’s like being angry with someone with dementia because they’re forgetful. ",
      "created_utc": 1727005600.0,
      "score": 96,
      "context": []
    },
    {
      "id": "lodmn4z",
      "author": "giraffemoo",
      "body": "I've said this before but I really think that people who hate on our condition just think that we are faking. They see someone who is only eating \"indulgent\" food, food that most normal people only allow themselves to eat on occasion and not all the time. They don't understand that people like us really and honestly just want to be able to eat and nourish our bodies just like everyone else, without feeling stressed or scared about it. They literally just don't understand and they can't wrap their heads around it.",
      "created_utc": 1727020541.0,
      "score": 26,
      "context": []
    },
    {
      "id": "locwxi2",
      "author": "SavageDemonDog",
      "body": "People hate what they can’t understand.",
      "created_utc": 1727011564.0,
      "score": 17,
      "context": []
    },
    {
      "id": "loevbdc",
      "author": "calmingthechaos",
      "body": "It's so crazy to me that people get personally offended by my eating habits. I *wish* I could eat like a normal person! I didn't choose the ARFID expansion pack with my ADHD, okay? (I'm not officially diagnosed, but I've done enough research to know that I fit the criteria for both ARFID and ADHD, and there's just limited resources available to me in my area.) I would love to be able to go out to new restaurants and try new recipes. My anxiety makes it worse, for sure, but it's not the root cause.",
      "created_utc": 1727033894.0,
      "score": 8,
      "context": []
    },
    {
      "id": "loe142v",
      "author": "self-lovin",
      "body": "i get it, really. i've had this disorder my whole life, long before it was ever in the DSM. what you have to remember is that this is a new(ish), relatively misunderstood disorder (even by doctors!). prior to the addition of arfid to the DSM, it was called SED and it only applied to children! this also feeds into why people consider our disorder childish or \"spoiled\" \"grow up\" etc. because if people have heard of such a thing, they typically only associate it with children. \n\nits getting better, it really is. i first heard of arfid in 2017 and knew immediately. i didnt get diagnosed until a few years ago. when i first knew in 2017, there were hardly any videos, articles, groups, or helpful information beyond the brief bare-bones description in the DSM. in the last few years i've encountered a couple doctors who had actually heard of it. there are arfid meme pages on instagram, clinicians who specialize in it now. its making progress as the disorder becomes better understood. it absolutely sucks to be the \"guinea pigs\" of arfid. but we are paving the way for future arfiders to not have to suffer in silence, to not have to deal with the judgment and misunderstanding. \n\nwe still have a long way to go. but its changing. people generally understand and have compassion for someone struggling with anorexia. because the diagnosis has been around for decades, it is well-understood. arfid will get there but it will take time. in the meantime we cant internalize the hate. we have to remember the hate is coming from ignorance on their end, not from wrongdoing or shortcoming or deficiency on our end. hope this helps and sheds some light",
      "created_utc": 1727024920.0,
      "score": 6,
      "context": []
    },
    {
      "id": "lod4uy3",
      "author": "angelneliel",
      "body": ">Are people stunted in terms of empathy?\n\nI don't think it's a question of empathy, but a question of compassion. I have very low/no empathy due to my autism, but with a certain level of understanding and educating myself on people's situations (both of which are a conscious choice I make), I have compassion for people's situations. These people refuse to understand that this isn't something we have control over. They refuse to understand it's a diagnosable eating disorder, it's not a choice. Ironic, considering they choose not to practice compassion, but they think we're choosing this disorder.\n\nIf it makes you feel any better, these same people choose to not practice compassion and understanding towards most, if not all mental health conditions/disorders that don't directly affect them.\n\nAt least this is my take on it. I'll be interested what others in the comments have to say about it.",
      "created_utc": 1727014518.0,
      "score": 12,
      "context": []
    },
    {
      "id": "loegn3x",
      "author": "_weedkiller_",
      "body": "They are just looking for people to troll. Or they have specific trauma combined with emotional immaturity. If they weren’t hating on us they’d be hating on some other group instead.",
      "created_utc": 1727029466.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lodp240",
      "author": "ControlOk8832",
      "body": "Those people in question are just stupid, psychotic, uneducated, or dense, or all of the above. I’ve learned to just do my own thing and disregard what people think of me, regardless of how much they complain or mess with me as a result. Life becomes very easy when you just stop caring and only live for yourself and those who truly respect you",
      "created_utc": 1727021294.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lohfxvr",
      "author": "orange_blot",
      "body": "I'm so appreciative of all the contributions here to help me better understand this issue! I have a niece with AFRID and it's been such a struggle for her and her parent! I think the more we know and understand the better we can support and help our loved ones! Thank you again for your candid and honest contributions here.",
      "created_utc": 1727069613.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lopangk",
      "author": "liz-faults",
      "body": "Man I think I'm grateful for my family and my s_o for their understanding I don't think I could do it as well without them, my so is understanding and is slowly leading me into new foods without being upset",
      "created_utc": 1727191059.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lod2m31",
      "author": "Spider_pig448",
      "body": "You can't change people. This is something that gets better over time, but it takes time. The world's understanding of ARFID is very young (it wasn't even called ARFID 10 years ago, it was Selective Eating Disorder). You can't blame people for not understanding. Good friends and a good partner will give you empathy, and when it comes to everyone else, keep your expectations low.",
      "created_utc": 1727013674.0,
      "score": 1,
      "context": []
    },
    {
      "id": "loetwda",
      "author": "kfilks",
      "body": "Some lady was bitching on AITA the other day how horrifically embarrassing it was that her boyfriend didn't eat ALL of a dish that her parents prepared - but was polite and thanked them. She also complained that he would go to all the restaurants she wanted but that was offensive because he did not order food - like this person is going out of their way to accommodate you and you still will just complain?!?!",
      "created_utc": 1727033467.0,
      "score": 15,
      "context": [
        {
          "id": "lock32d",
          "author": "MaleficentSwan0223",
          "body": "I think what baffles me is I will go out of my way to accommodate someone and I will happily go without or cause myself sickness and huge amount of anxiety just to make others happy and they’ll still be dicks to me. It’s not like I force anyone to eat the foods I do?! \n\nPeople act like we’re spoilt and get the dream diets but I’d love to be able to share a pizza, snack on food… damn I’d even like to just share foods that are safe with someone. It’s incredibly isolating having an anxiety around food. It’s like being angry with someone with dementia because they’re forgetful. ",
          "created_utc": 1727005600.0
        }
      ]
    },
    {
      "id": "locub1h",
      "author": "-FrogPotato-",
      "body": "Too bad dementia is well known enough to be taken seriously, while some issues like ours aren't. We would have to wait until society acknowledges it (if that ever happens) but it still seems like there will always be some struggles that are too specific to be widespread that people will never care to understand or empathize with.",
      "created_utc": 1727010467.0,
      "score": 12,
      "context": [
        {
          "id": "lock32d",
          "author": "MaleficentSwan0223",
          "body": "I think what baffles me is I will go out of my way to accommodate someone and I will happily go without or cause myself sickness and huge amount of anxiety just to make others happy and they’ll still be dicks to me. It’s not like I force anyone to eat the foods I do?! \n\nPeople act like we’re spoilt and get the dream diets but I’d love to be able to share a pizza, snack on food… damn I’d even like to just share foods that are safe with someone. It’s incredibly isolating having an anxiety around food. It’s like being angry with someone with dementia because they’re forgetful. ",
          "created_utc": 1727005600.0
        }
      ]
    },
    {
      "id": "logs4o2",
      "author": "Big-Formal408",
      "body": "I’ve had ARFID my entire life, long before it was ever in the DSM too, but got diagnosed in 2017 and the information back then was so minimal. I’d never heard of it until being diagnosed due to how little information was out there but the day I was diagnosed and was given some education it felt like everything finally clicked and made sense. Over seven years later I still feel extreme shame over my eating but it’s nothing like I experienced growing up and my diagnosis helped me to finally shed some of those negative feels I’d always carried about myself. I’d been called a “severe picky eater” for my entire life but I always knew there was much more to it than that. I watched people “outgrow” their picky eating and never knew why I couldn’t just do the same. I’m in my mid 20s now and still only have about ten reliable safe foods but it’s validating to finally have a name to everything I’ve experienced and be able to tell people that it’s a real medical condition and that I’m not just being “difficult.” People struggle to have compassion for things they don’t understand but we’ll never get progress by staying quiet and letting people shame us.",
      "created_utc": 1727058087.0,
      "score": 3,
      "context": [
        {
          "id": "loe142v",
          "author": "self-lovin",
          "body": "i get it, really. i've had this disorder my whole life, long before it was ever in the DSM. what you have to remember is that this is a new(ish), relatively misunderstood disorder (even by doctors!). prior to the addition of arfid to the DSM, it was called SED and it only applied to children! this also feeds into why people consider our disorder childish or \"spoiled\" \"grow up\" etc. because if people have heard of such a thing, they typically only associate it with children. \n\nits getting better, it really is. i first heard of arfid in 2017 and knew immediately. i didnt get diagnosed until a few years ago. when i first knew in 2017, there were hardly any videos, articles, groups, or helpful information beyond the brief bare-bones description in the DSM. in the last few years i've encountered a couple doctors who had actually heard of it. there are arfid meme pages on instagram, clinicians who specialize in it now. its making progress as the disorder becomes better understood. it absolutely sucks to be the \"guinea pigs\" of arfid. but we are paving the way for future arfiders to not have to suffer in silence, to not have to deal with the judgment and misunderstanding. \n\nwe still have a long way to go. but its changing. people generally understand and have compassion for someone struggling with anorexia. because the diagnosis has been around for decades, it is well-understood. arfid will get there but it will take time. in the meantime we cant internalize the hate. we have to remember the hate is coming from ignorance on their end, not from wrongdoing or shortcoming or deficiency on our end. hope this helps and sheds some light",
          "created_utc": 1727024920.0
        }
      ]
    },
    {
      "id": "loe94zj",
      "author": "Flingkt",
      "body": "True. I don’t expect them to understand, I just wish they’d stop talking about it as if they know what it’s about because they know about pickiness/childishness, and they draw a link between the two. It’s just incorrect, and I’m not gonna sit and take criticism that’s not even based on facts. \n\nIf they talk smack about my eating habits the least I expect is that it’s based on some sort of understanding on the matter. If not they can just stop, as far as I’m concerned.",
      "created_utc": 1727027258.0,
      "score": 2,
      "context": [
        {
          "id": "lod2m31",
          "author": "Spider_pig448",
          "body": "You can't change people. This is something that gets better over time, but it takes time. The world's understanding of ARFID is very young (it wasn't even called ARFID 10 years ago, it was Selective Eating Disorder). You can't blame people for not understanding. Good friends and a good partner will give you empathy, and when it comes to everyone else, keep your expectations low.",
          "created_utc": 1727013674.0
        }
      ]
    },
    {
      "id": "lof6tif",
      "author": "Weary-Toast",
      "body": "I saw that post and loved how strong the ARIFD community came out in the comments I saw!",
      "created_utc": 1727037395.0,
      "score": 10,
      "context": [
        {
          "id": "lock32d",
          "author": "MaleficentSwan0223",
          "body": "I think what baffles me is I will go out of my way to accommodate someone and I will happily go without or cause myself sickness and huge amount of anxiety just to make others happy and they’ll still be dicks to me. It’s not like I force anyone to eat the foods I do?! \n\nPeople act like we’re spoilt and get the dream diets but I’d love to be able to share a pizza, snack on food… damn I’d even like to just share foods that are safe with someone. It’s incredibly isolating having an anxiety around food. It’s like being angry with someone with dementia because they’re forgetful. ",
          "created_utc": 1727005600.0
        },
        {
          "id": "loetwda",
          "author": "kfilks",
          "body": "Some lady was bitching on AITA the other day how horrifically embarrassing it was that her boyfriend didn't eat ALL of a dish that her parents prepared - but was polite and thanked them. She also complained that he would go to all the restaurants she wanted but that was offensive because he did not order food - like this person is going out of their way to accommodate you and you still will just complain?!?!",
          "created_utc": 1727033467.0
        }
      ]
    },
    {
      "id": "locuv6i",
      "author": "MaleficentSwan0223",
      "body": "Perfectly said! Tbh, I’m personally just waiting for doctors and medical professionals to acknowledge it never mind society.",
      "created_utc": 1727010705.0,
      "score": 10,
      "context": [
        {
          "id": "lock32d",
          "author": "MaleficentSwan0223",
          "body": "I think what baffles me is I will go out of my way to accommodate someone and I will happily go without or cause myself sickness and huge amount of anxiety just to make others happy and they’ll still be dicks to me. It’s not like I force anyone to eat the foods I do?! \n\nPeople act like we’re spoilt and get the dream diets but I’d love to be able to share a pizza, snack on food… damn I’d even like to just share foods that are safe with someone. It’s incredibly isolating having an anxiety around food. It’s like being angry with someone with dementia because they’re forgetful. ",
          "created_utc": 1727005600.0
        },
        {
          "id": "locub1h",
          "author": "-FrogPotato-",
          "body": "Too bad dementia is well known enough to be taken seriously, while some issues like ours aren't. We would have to wait until society acknowledges it (if that ever happens) but it still seems like there will always be some struggles that are too specific to be widespread that people will never care to understand or empathize with.",
          "created_utc": 1727010467.0
        }
      ]
    },
    {
      "id": "loe6xww",
      "author": "Flingkt",
      "body": "Agreed, I just feel like some people totally misinterpret what our struggles are about. \n\nI think people are likely more familiar with pickiness in children, and see it as a trait of immaturity that most people overcome as they get older. They draw that false link between pickiness/immaturity and ARFID. They project the fact that many children outgrow pickiness onto ARFID - and they think the solution for that is the same - which is an extrapolation that doesn’t really fit with ARFID struggles. \n\nIt seems like people then judge us unfairly, but they *think* they’re being fair because after all they *feel* familiar with similar traits, which in turn makes it so that they think we’re actively making a choice of being difficult; that it’s a matter of simply choosing to eat more diverse foods. \n\nI don’t know why this grinds people’s gears so much though, like why do they care what you and I prefer to eat. What business do they think they have in that matter? \n\nI see a lot of name calling when this is discussed, particularly the post on AITA recently. This tells me that this is a subject matter that they have certain fixed and strong opinions about, as if they think that everybody either chooses to be “adventurous” or “a toddler”. There’s no grey zone, there’s no compromise, it seems like it’s either one or the other.\n\nI just think they miss the part about how taxing this disorder actually is. They miss how isolating it can feel and how much shame we go through by going through the food on our plate. I don’t think anyone wants to suffer from this. That’s why it bothers me  that so much vitriol is being spewed, like how is that supposed to help? Do they really think this amounts to us just going “oh yeah they’re right, I’ll stop letting this bother me”?\n\nUgh sometimes I just can’t… It feels so isolating.",
      "created_utc": 1727026643.0,
      "score": 9,
      "context": [
        {
          "id": "lock32d",
          "author": "MaleficentSwan0223",
          "body": "I think what baffles me is I will go out of my way to accommodate someone and I will happily go without or cause myself sickness and huge amount of anxiety just to make others happy and they’ll still be dicks to me. It’s not like I force anyone to eat the foods I do?! \n\nPeople act like we’re spoilt and get the dream diets but I’d love to be able to share a pizza, snack on food… damn I’d even like to just share foods that are safe with someone. It’s incredibly isolating having an anxiety around food. It’s like being angry with someone with dementia because they’re forgetful. ",
          "created_utc": 1727005600.0
        },
        {
          "id": "locub1h",
          "author": "-FrogPotato-",
          "body": "Too bad dementia is well known enough to be taken seriously, while some issues like ours aren't. We would have to wait until society acknowledges it (if that ever happens) but it still seems like there will always be some struggles that are too specific to be widespread that people will never care to understand or empathize with.",
          "created_utc": 1727010467.0
        }
      ]
    },
    {
      "id": "loemh2d",
      "author": "Spider_pig448",
      "body": "If they're your friends, try and teach them. If they're strangers, don't give them real estate in your mind. Don't live your life on a crusade to educate people that don't care.",
      "created_utc": 1727031244.0,
      "score": 3,
      "context": [
        {
          "id": "lod2m31",
          "author": "Spider_pig448",
          "body": "You can't change people. This is something that gets better over time, but it takes time. The world's understanding of ARFID is very young (it wasn't even called ARFID 10 years ago, it was Selective Eating Disorder). You can't blame people for not understanding. Good friends and a good partner will give you empathy, and when it comes to everyone else, keep your expectations low.",
          "created_utc": 1727013674.0
        },
        {
          "id": "loe94zj",
          "author": "Flingkt",
          "body": "True. I don’t expect them to understand, I just wish they’d stop talking about it as if they know what it’s about because they know about pickiness/childishness, and they draw a link between the two. It’s just incorrect, and I’m not gonna sit and take criticism that’s not even based on facts. \n\nIf they talk smack about my eating habits the least I expect is that it’s based on some sort of understanding on the matter. If not they can just stop, as far as I’m concerned.",
          "created_utc": 1727027258.0
        }
      ]
    },
    {
      "id": "lof7ird",
      "author": "kfilks",
      "body": "If anything, it shows me that there are so many other people who think they have a 'healthy' relationship with food but have their own fucked up relationship in some way. There's no way it's healthy to care that much about second-hand embarrassment over food.\n\n\nI could never think to care about what others are eating (unless it was sooo gross that I couldn't be near it because of my arfid but we'd have to be talking real stanky), or it's something that smells delicious that I would never eat and then I'm just jealous",
      "created_utc": 1727037615.0,
      "score": 10,
      "context": [
        {
          "id": "lock32d",
          "author": "MaleficentSwan0223",
          "body": "I think what baffles me is I will go out of my way to accommodate someone and I will happily go without or cause myself sickness and huge amount of anxiety just to make others happy and they’ll still be dicks to me. It’s not like I force anyone to eat the foods I do?! \n\nPeople act like we’re spoilt and get the dream diets but I’d love to be able to share a pizza, snack on food… damn I’d even like to just share foods that are safe with someone. It’s incredibly isolating having an anxiety around food. It’s like being angry with someone with dementia because they’re forgetful. ",
          "created_utc": 1727005600.0
        },
        {
          "id": "loetwda",
          "author": "kfilks",
          "body": "Some lady was bitching on AITA the other day how horrifically embarrassing it was that her boyfriend didn't eat ALL of a dish that her parents prepared - but was polite and thanked them. She also complained that he would go to all the restaurants she wanted but that was offensive because he did not order food - like this person is going out of their way to accommodate you and you still will just complain?!?!",
          "created_utc": 1727033467.0
        },
        {
          "id": "lof6tif",
          "author": "Weary-Toast",
          "body": "I saw that post and loved how strong the ARIFD community came out in the comments I saw!",
          "created_utc": 1727037395.0
        }
      ]
    },
    {
      "id": "locvitx",
      "author": "-FrogPotato-",
      "body": "If most people learned it exists, it would already be a huge improvement.",
      "created_utc": 1727010980.0,
      "score": 5,
      "context": [
        {
          "id": "lock32d",
          "author": "MaleficentSwan0223",
          "body": "I think what baffles me is I will go out of my way to accommodate someone and I will happily go without or cause myself sickness and huge amount of anxiety just to make others happy and they’ll still be dicks to me. It’s not like I force anyone to eat the foods I do?! \n\nPeople act like we’re spoilt and get the dream diets but I’d love to be able to share a pizza, snack on food… damn I’d even like to just share foods that are safe with someone. It’s incredibly isolating having an anxiety around food. It’s like being angry with someone with dementia because they’re forgetful. ",
          "created_utc": 1727005600.0
        },
        {
          "id": "locub1h",
          "author": "-FrogPotato-",
          "body": "Too bad dementia is well known enough to be taken seriously, while some issues like ours aren't. We would have to wait until society acknowledges it (if that ever happens) but it still seems like there will always be some struggles that are too specific to be widespread that people will never care to understand or empathize with.",
          "created_utc": 1727010467.0
        },
        {
          "id": "locuv6i",
          "author": "MaleficentSwan0223",
          "body": "Perfectly said! Tbh, I’m personally just waiting for doctors and medical professionals to acknowledge it never mind society.",
          "created_utc": 1727010705.0
        }
      ]
    },
    {
      "id": "lofm3sv",
      "author": "Weary-Toast",
      "body": "I didn’t read through all the comments, just checked to make sure people were standing up for that poor man but I’m sure not all were great. \n\nI’m the same about what others are eating unless it’s something that absolutely repulses me. Like meat with bones in it *shudder*",
      "created_utc": 1727042369.0,
      "score": 2,
      "context": [
        {
          "id": "lock32d",
          "author": "MaleficentSwan0223",
          "body": "I think what baffles me is I will go out of my way to accommodate someone and I will happily go without or cause myself sickness and huge amount of anxiety just to make others happy and they’ll still be dicks to me. It’s not like I force anyone to eat the foods I do?! \n\nPeople act like we’re spoilt and get the dream diets but I’d love to be able to share a pizza, snack on food… damn I’d even like to just share foods that are safe with someone. It’s incredibly isolating having an anxiety around food. It’s like being angry with someone with dementia because they’re forgetful. ",
          "created_utc": 1727005600.0
        },
        {
          "id": "loetwda",
          "author": "kfilks",
          "body": "Some lady was bitching on AITA the other day how horrifically embarrassing it was that her boyfriend didn't eat ALL of a dish that her parents prepared - but was polite and thanked them. She also complained that he would go to all the restaurants she wanted but that was offensive because he did not order food - like this person is going out of their way to accommodate you and you still will just complain?!?!",
          "created_utc": 1727033467.0
        },
        {
          "id": "lof6tif",
          "author": "Weary-Toast",
          "body": "I saw that post and loved how strong the ARIFD community came out in the comments I saw!",
          "created_utc": 1727037395.0
        },
        {
          "id": "lof7ird",
          "author": "kfilks",
          "body": "If anything, it shows me that there are so many other people who think they have a 'healthy' relationship with food but have their own fucked up relationship in some way. There's no way it's healthy to care that much about second-hand embarrassment over food.\n\n\nI could never think to care about what others are eating (unless it was sooo gross that I couldn't be near it because of my arfid but we'd have to be talking real stanky), or it's something that smells delicious that I would never eat and then I'm just jealous",
          "created_utc": 1727037615.0
        }
      ]
    },
    {
      "id": "locy3kt",
      "author": "MaleficentSwan0223",
      "body": "It really would! Just having this subreddit is already immensely freeing. Other than my husband and children, I literally can’t speak about it. It’s literally like being an outcast. ",
      "created_utc": 1727012038.0,
      "score": 6,
      "context": [
        {
          "id": "lock32d",
          "author": "MaleficentSwan0223",
          "body": "I think what baffles me is I will go out of my way to accommodate someone and I will happily go without or cause myself sickness and huge amount of anxiety just to make others happy and they’ll still be dicks to me. It’s not like I force anyone to eat the foods I do?! \n\nPeople act like we’re spoilt and get the dream diets but I’d love to be able to share a pizza, snack on food… damn I’d even like to just share foods that are safe with someone. It’s incredibly isolating having an anxiety around food. It’s like being angry with someone with dementia because they’re forgetful. ",
          "created_utc": 1727005600.0
        },
        {
          "id": "locub1h",
          "author": "-FrogPotato-",
          "body": "Too bad dementia is well known enough to be taken seriously, while some issues like ours aren't. We would have to wait until society acknowledges it (if that ever happens) but it still seems like there will always be some struggles that are too specific to be widespread that people will never care to understand or empathize with.",
          "created_utc": 1727010467.0
        },
        {
          "id": "locuv6i",
          "author": "MaleficentSwan0223",
          "body": "Perfectly said! Tbh, I’m personally just waiting for doctors and medical professionals to acknowledge it never mind society.",
          "created_utc": 1727010705.0
        },
        {
          "id": "locvitx",
          "author": "-FrogPotato-",
          "body": "If most people learned it exists, it would already be a huge improvement.",
          "created_utc": 1727010980.0
        }
      ]
    }
  ]
}