{
  "id": "1fn6iun",
  "subreddit": "ARFID",
  "author": "black_flame919",
  "created_utc": 1727047101.0,
  "title": "Anyone else overweight?",
  "selftext": "Anytime u try to read a bit more about this disorder (diagnosis is less than two weeks old so I’m still learning) everything always mentions how it can lead to being underweight/malnourished. But I’m well overweight, despite how much of a struggle it is to eat enough some days and how unbalanced my diet is. I have very few “healthy” safe foods, and seeing all the talk of being underweight is giving me some imposter syndrome. I guess I’m just looking for validation?  ",
  "url": "https://www.reddit.com/r/ARFID/comments/1fn6iun/anyone_else_overweight/",
  "score": 98,
  "num_comments": 43,
  "comments": [
    {
      "id": "log2ggv",
      "author": "Isadum",
      "body": "You can definitely be overweight with ARFID. A lot of safe foods are unhealthy. I tend to go through binging stages when I find a food I finally like after going so long not having an appetite or not liking food or simply not wanting to eat.",
      "created_utc": 1727048150.0,
      "score": 66,
      "context": []
    },
    {
      "id": "log341h",
      "author": "CrazyCatLushie",
      "body": "Yep, I’m a fat person and have been since I was a child. My whole family is the same. Being told I was going to kill myself just by eating when I was very young is probably a big part of why my brain now equates eating with danger. \n\nPeople of all shapes and sizes can deal with disordered eating, ARFID included.",
      "created_utc": 1727048385.0,
      "score": 36,
      "context": []
    },
    {
      "id": "log83ma",
      "author": "Ajishly",
      "body": "I'm fat, and I've had scurvy twice... and currently, my body is throwing out warning signs that I'm giving myself scurvy yet again. You can be fat and struggle with malnutrition.",
      "created_utc": 1727050262.0,
      "score": 17,
      "context": []
    },
    {
      "id": "log7qov",
      "author": "None",
      "body": "Weight is pretty irrelevant for people with ARFID, there’s no one body type that’s the most common, literally anyone could have it big or small. You can also be overweight, even obese while also being malnourished. You can still overeat but lack the vital nutrients you need. It’s the same for bulimia, body type isn’t relevant to having it or not. \nBelieve me people are all over the spectrum and your experience is no less valid than theirs.",
      "created_utc": 1727050124.0,
      "score": 20,
      "context": []
    },
    {
      "id": "log3uzi",
      "author": "Nonbinary-Bones",
      "body": "My weight fluctuates rapidly over time as I struggle to eat or over eat. Right now I sit at over 300lbs and cycle through 20 to 30 pounds I gain and lose. A lot of the foods I eat are sweet or carb heavy and having chrons on top of ARFID makes being able to get adequate nutrients and protein. But yes you can have a higher weight and have ARIFD!",
      "created_utc": 1727048653.0,
      "score": 6,
      "context": []
    },
    {
      "id": "logd617",
      "author": "crochetsweetie",
      "body": "100%. all of my safe foods are bad for you",
      "created_utc": 1727052214.0,
      "score": 6,
      "context": []
    },
    {
      "id": "logdv1g",
      "author": "Staluti",
      "body": "I have the same struggles OP. Sometimes I won’t eat for 12+ hours at a time and then finally cave and order something unhealthy.",
      "created_utc": 1727052481.0,
      "score": 5,
      "context": []
    },
    {
      "id": "logf03m",
      "author": "Jeix9",
      "body": "I’m not overweight, but I could definitely lose some weight. It’s not about how much you eat rather what you’re eating so if all your safe foods are unhealthy then that’s enough to make you gain weight even in smaller quantities, which so something I really struggle with. You’re not an imposter, it’s totally possible that someone ARFID be overweight simply because a lot of our safe foods are so unhealthy",
      "created_utc": 1727052909.0,
      "score": 4,
      "context": []
    },
    {
      "id": "logijt4",
      "author": "_mnmlst",
      "body": "I was 350 lbs and still considered malnourished based on my lab work.",
      "created_utc": 1727054279.0,
      "score": 4,
      "context": []
    },
    {
      "id": "logv96y",
      "author": "calmingthechaos",
      "body": "I was consuming around 3000 calories a day, and over half of that was just in my drinks. I am about 100 lbs overweight and I barely eat anything. It's always been my biggest pet peeve that people assume I overeat. My diet wasn't really geared towards the proper nutrition or macros. I'm slowly working on it the best I can. I haven't been underweight since the week I was born. Lol. I'm also really short, so that doesn't help. Personally, I have way more issues with food than I do drinks, although I have my issues with drinks, too. I can easily go through 5 or more cans of soda a day, plus a Monster Java. I switched out my Monster a day for a protein shake and switched my regular soda for Cherry Coke Zero, at least at home. I just still end up getting regular soda when I go out and while I'm at work, and I'll also get a Monster or an iced coffee. Baby steps.",
      "created_utc": 1727059365.0,
      "score": 4,
      "context": []
    },
    {
      "id": "log3g3a",
      "author": "DisastrousFlower",
      "body": "yes i am now. i haven’t lost the baby weight and my psych meds and poor diet have made me gain more weight.",
      "created_utc": 1727048505.0,
      "score": 3,
      "context": []
    },
    {
      "id": "logaa6i",
      "author": "Fabulous-Chemistry74",
      "body": "I’m not necessarily mega overweight but I’m not skinny. I hate eating and eating is a sensory nightmare, but what I do eat isn’t necessarily the healthiest.",
      "created_utc": 1727051105.0,
      "score": 3,
      "context": []
    },
    {
      "id": "logle6m",
      "author": "Honeydewskyy20",
      "body": "Can I say that I’m overweight and malnourished 😂 could hardly believe when my doctor said that to me.",
      "created_utc": 1727055384.0,
      "score": 3,
      "context": []
    },
    {
      "id": "logcwz4",
      "author": "nanatella22",
      "body": "I'm about 25 to 30 lbs overweight",
      "created_utc": 1727052119.0,
      "score": 4,
      "context": []
    },
    {
      "id": "logjn34",
      "author": "That_izzy",
      "body": "Yes you can be sadly I am / was one cases due to a syndrome I have it easy for me to put on weight and my foods being paster safe foods and some what processed I do put wight on a bit from time to time",
      "created_utc": 1727054698.0,
      "score": 2,
      "context": []
    },
    {
      "id": "logufce",
      "author": "None",
      "body": "Yeah I'm fat. I have arfid and binge eating. Not a good mix",
      "created_utc": 1727059022.0,
      "score": 2,
      "context": []
    },
    {
      "id": "loh00rz",
      "author": "otterpixie",
      "body": "You can definitely be overweight and have ARFID. You can also be overweight and still be malnourished. Being underweight is only one possible indicator for malnutrition; however, it isn't the only indicator. If you're low in nutrients, that's an indicator of malnutrition. I've always been low on iron, B12, and vitamin D, in particular, for most of my life. Or it could mean you're not getting enough fats, carbs, and proteins, which might be impacting your body in other ways (e.g., poor muscle mass/development due to lack of protein, inability to focus, messing with your metabolism, etc.).\n\nA lot of people with ARFID go on to develop other eating disorders or disordered eating, which can include binge eating - which increases ones chances of being overweight.",
      "created_utc": 1727061352.0,
      "score": 2,
      "context": []
    },
    {
      "id": "loh0pqu",
      "author": "samk488",
      "body": "You don’t have to be underweight or experience weight loss for it to be ARFID! At least for me when I was diagnosed I was told I wasn’t getting all the nutrients I needed from food (which made it severe enough to be ARFID), even though I hadn’t lost any weight (because I would eat a lot of ice cream to stay full)",
      "created_utc": 1727061641.0,
      "score": 2,
      "context": []
    },
    {
      "id": "loh3dgd",
      "author": "beastiefever",
      "body": "my weight has fluctuated a LOT over the years (when i say a lot i dont mean fluctuating within a 20lb range, or even a 60lb range) the foods i eat havent changed much if at all, so its not always about what youre eating or even how much youre eating. theres a lot of factors i.e genetics, how physically active you are, how consistently you eat, even stress levels.",
      "created_utc": 1727062851.0,
      "score": 2,
      "context": []
    },
    {
      "id": "loh6rnm",
      "author": "pinche_diabetica",
      "body": "yes Im ~180 w ARFID and its mainly because most of my safe foods are carb & calorie dense",
      "created_utc": 1727064521.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lohgfcc",
      "author": "deadfliesinsummer",
      "body": "my safe foods were junk food, rice, and pasta for the longest time. it took awhile to find healthier alts and im still working on it, but yeah i think it’s definitely easy to happen if you were additionally raised with poor nutrition.",
      "created_utc": 1727069904.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lojso33",
      "author": "lavenderbleudilly",
      "body": "The diagnostic criteria is a nutritional deficiency, not a weight deficiency.",
      "created_utc": 1727109931.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lp56ty8",
      "author": "heartoffiction",
      "body": "I am! Also in camp “all my safe foods are carbs”",
      "created_utc": 1727415924.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lwn681v",
      "author": "power36113",
      "body": "I’m definitely considered fat with the BMI scale. I’m 190 pounds. All of my safe foods are junk food. Doesn’t matter, my ARFID is still real and valid.",
      "created_utc": 1731359389.0,
      "score": 2,
      "context": []
    },
    {
      "id": "log33pw",
      "author": "MyMindIsAHellscape",
      "body": "I’m in a healthy weight range for my height and age so no one cares that I’m struggle a lot with food",
      "created_utc": 1727048382.0,
      "score": 1,
      "context": []
    },
    {
      "id": "loh05c4",
      "author": "Maxusam",
      "body": "Yeah 😔",
      "created_utc": 1727061408.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lohexjt",
      "author": "First-Butterscotch-3",
      "body": "Yep\n\nMost of my safe foods are carbs heavy",
      "created_utc": 1727069011.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lohsr4b",
      "author": "nimpog",
      "body": "I hate the lack of awareness of weight gain in ARFID spaces. For 14 years, I ate chicken dippers and mccains smilies. Thats not exactly healthy so of course I was going to gain wait.\n\nLosing the weight is even harder because most guides will tell you to eat healthily and avoid carbs but my entire diet is basically carbs so it’s exhausting.",
      "created_utc": 1727078161.0,
      "score": 1,
      "context": []
    },
    {
      "id": "loibdvj",
      "author": "SuccessPutrid7349",
      "body": "I was very thin until I hit about 25 and started really trying to expand my palate. Sadly I just found even more unhealthy food which I didn't hate and now I'm classed as obese 😭",
      "created_utc": 1727090435.0,
      "score": 1,
      "context": []
    },
    {
      "id": "loivywp",
      "author": "mattn1t",
      "body": "All my safe foods are unquestionably unhealthy and yet I'm 30-35lbs under weight and slowly falling",
      "created_utc": 1727099137.0,
      "score": 1,
      "context": []
    },
    {
      "id": "loj7zo2",
      "author": "ibelieveinaliens111",
      "body": "I’m really chubby in lots of places. The worst part is that I hate it but have no one to blame but myself- and I can’t help it. I’m certainly lacking lots of nutrients, too. Blood sugar is a big problem.",
      "created_utc": 1727103240.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lojwlan",
      "author": "BulkyComfortable3040",
      "body": "Yup I get you. I’m not diagnosed yet but I’m sure I have it and I’m overweight",
      "created_utc": 1727111162.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lojzfcf",
      "author": "WannabeaWallabe",
      "body": "When I was diagnosed I was (and still\nAm) overweight but was very malnourished due to only eating 2 different things to eat, both not at all nutritious, but took me ages to accept I was actually malnourished xx",
      "created_utc": 1727112043.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lom1oz9",
      "author": "brandielynng29",
      "body": "I’m almost 200 lbs and considered overweight and a type 2 diabetic… I have ARFID and binge eating",
      "created_utc": 1727136137.0,
      "score": 1,
      "context": []
    },
    {
      "id": "logkb71",
      "author": "KingTalis",
      "body": "I have been before, and I am just a tad bit overweight nowadays. Cut your calories and you can lose weight no matter how unhealthy your diet is.",
      "created_utc": 1727054959.0,
      "score": -3,
      "context": []
    },
    {
      "id": "lohb0qk",
      "author": "Sixyn",
      "body": "Do you take any multivitamins, just out of curiosity?\n\nEdit: Not judging here, also have ARFID just wanted to know if it's something I should look out for despite my multivitamin intake.",
      "created_utc": 1727066789.0,
      "score": 6,
      "context": [
        {
          "id": "log83ma",
          "author": "Ajishly",
          "body": "I'm fat, and I've had scurvy twice... and currently, my body is throwing out warning signs that I'm giving myself scurvy yet again. You can be fat and struggle with malnutrition.",
          "created_utc": 1727050262.0
        }
      ]
    },
    {
      "id": "logau5m",
      "author": "KaleidoscopeShot1869",
      "body": "100%\n\nFor a lot of eating disorders you can be overweight or have any kind of body type. Even anorexia.\n\nIt's an eating disorder, not a weight disorder.",
      "created_utc": 1727051322.0,
      "score": 10,
      "context": [
        {
          "id": "log7qov",
          "author": "None",
          "body": "Weight is pretty irrelevant for people with ARFID, there’s no one body type that’s the most common, literally anyone could have it big or small. You can also be overweight, even obese while also being malnourished. You can still overeat but lack the vital nutrients you need. It’s the same for bulimia, body type isn’t relevant to having it or not. \nBelieve me people are all over the spectrum and your experience is no less valid than theirs.",
          "created_utc": 1727050124.0
        }
      ]
    },
    {
      "id": "loglnja",
      "author": "black_flame919",
      "body": "Omg this is so relatable lmao I won't eat even as far as 24+ hours, then my wife will bring home mcdonalds and I'll be fine??",
      "created_utc": 1727055486.0,
      "score": 5,
      "context": [
        {
          "id": "logdv1g",
          "author": "Staluti",
          "body": "I have the same struggles OP. Sometimes I won’t eat for 12+ hours at a time and then finally cave and order something unhealthy.",
          "created_utc": 1727052481.0
        }
      ]
    },
    {
      "id": "logmcde",
      "author": "extraqueerestrial",
      "body": "My dietitian told me the same thing 💀💀 but I’ve always been slightly overweight bc doctors always go by bmi 🤷🏾‍♀️",
      "created_utc": 1727055753.0,
      "score": 4,
      "context": [
        {
          "id": "logle6m",
          "author": "Honeydewskyy20",
          "body": "Can I say that I’m overweight and malnourished 😂 could hardly believe when my doctor said that to me.",
          "created_utc": 1727055384.0
        }
      ]
    },
    {
      "id": "lohaniy",
      "author": "black_flame919",
      "body": "I think that’s probably the minimum I’m overweight by :’)",
      "created_utc": 1727066589.0,
      "score": 4,
      "context": [
        {
          "id": "logcwz4",
          "author": "nanatella22",
          "body": "I'm about 25 to 30 lbs overweight",
          "created_utc": 1727052119.0
        }
      ]
    },
    {
      "id": "loho989",
      "author": "black_flame919",
      "body": "Yk even though my doctor prescribed me ensure to make sure I get the right nutrients but I didn’t think I could possibly be malnourished because I’m overweight. I almost even said in the post I can’t say I’m malnourished because of my weight. These comments have all been incredibly validating 😭",
      "created_utc": 1727074985.0,
      "score": 1,
      "context": [
        {
          "id": "loh00rz",
          "author": "otterpixie",
          "body": "You can definitely be overweight and have ARFID. You can also be overweight and still be malnourished. Being underweight is only one possible indicator for malnutrition; however, it isn't the only indicator. If you're low in nutrients, that's an indicator of malnutrition. I've always been low on iron, B12, and vitamin D, in particular, for most of my life. Or it could mean you're not getting enough fats, carbs, and proteins, which might be impacting your body in other ways (e.g., poor muscle mass/development due to lack of protein, inability to focus, messing with your metabolism, etc.).\n\nA lot of people with ARFID go on to develop other eating disorders or disordered eating, which can include binge eating - which increases ones chances of being overweight.",
          "created_utc": 1727061352.0
        }
      ]
    },
    {
      "id": "loj8byo",
      "author": "black_flame919",
      "body": "Yes this exactly!! It’s my own fault because of how I eat but it’s not my fault because I have an eating disorder. But it’s not like most people would understand it’s an eating disorder",
      "created_utc": 1727103350.0,
      "score": 1,
      "context": [
        {
          "id": "loj7zo2",
          "author": "ibelieveinaliens111",
          "body": "I’m really chubby in lots of places. The worst part is that I hate it but have no one to blame but myself- and I can’t help it. I’m certainly lacking lots of nutrients, too. Blood sugar is a big problem.",
          "created_utc": 1727103240.0
        }
      ]
    },
    {
      "id": "loj8tcg",
      "author": "ibelieveinaliens111",
      "body": "It’s definitely not the kind of eating disorder people expect. If I ever say I have an ED, people look at me so pitifully (and maybe also like ‘you don’t look like it’ >_>) before i have to explain that it’s not about how much I eat, it’s what I eat.",
      "created_utc": 1727103508.0,
      "score": 1,
      "context": [
        {
          "id": "loj7zo2",
          "author": "ibelieveinaliens111",
          "body": "I’m really chubby in lots of places. The worst part is that I hate it but have no one to blame but myself- and I can’t help it. I’m certainly lacking lots of nutrients, too. Blood sugar is a big problem.",
          "created_utc": 1727103240.0
        },
        {
          "id": "loj8byo",
          "author": "black_flame919",
          "body": "Yes this exactly!! It’s my own fault because of how I eat but it’s not my fault because I have an eating disorder. But it’s not like most people would understand it’s an eating disorder",
          "created_utc": 1727103350.0
        }
      ]
    }
  ]
}