{
  "id": "1fn9gl2",
  "subreddit": "ARFID",
  "author": "Ginger_Cat_Ventures",
  "created_utc": 1727056042.0,
  "title": "“You decide where to eat because you have the restrictions.” I’m so tired of this. ",
  "selftext": "I had to bring this up with my boyfriend today after he put me on the spot in front of his friend when we were trying to decide what to eat today. \n\nHe said I should be the one to decide what to eat because of my ARFID. \n\nIdk about you guys but I AM TIRED. It puts so much emotional weight on me to decide where we go to eat EVERY DAMN TIME. And when other people are around I don’t know if they just think I’m being a “picky eater.” \n\nIt’s embarrassing. And it usually makes my ARFID worse to think about an overwhelming amount of places to look through to find food that is safe for me. \n\nI explained to him all of this, but he said that he doesn’t really agree with me that he should be helping me look for places. \n\nI just like having someone help me narrow it down. \n\n*sigh*\n\n",
  "url": "https://www.reddit.com/r/ARFID/comments/1fn9gl2/you_decide_where_to_eat_because_you_have_the/",
  "score": 194,
  "num_comments": 37,
  "comments": [
    {
      "id": "logsu0u",
      "author": "pasghetti_n_meatbals",
      "body": "I keep a list on my phone for restaurants for eating with others. Each name and then where we like to go together. Of course my kiddo with ARFID is on the list, but I'm in my late 40's -- my friends are 40s-60s. We alllllll have eating differences. My bestie is gluten, soy, dairy, and egg free (also allergic to nightshades). I'm low acid reflux, my husband - no seafood, my kid's best friend has EOE, others are diabetic, keto, etc. Any time we travel- everyone googles and researches where we can go eat because we are friends. We treat the search like a quest and sometimes we find winners. I wish I could tell your boyfriend what a loving gift it would be to help you search for options. Hugs dear! ",
      "created_utc": 1727058378.0,
      "score": 104,
      "context": []
    },
    {
      "id": "logzmod",
      "author": "whatdoidonowdamnit",
      "body": "Yep. I don’t like food. Don’t ask me where I want to eat. I want to eat a sandwich in my bed. Like just go eat what makes you happy. I won’t starve. I’ll eat something at some point.",
      "created_utc": 1727061187.0,
      "score": 93,
      "context": []
    },
    {
      "id": "logpm0m",
      "author": "ma-doodles",
      "body": "yeah i feel this too, im always told to pick what to eat because im the one with a more limited diet. its tiring",
      "created_utc": 1727057063.0,
      "score": 30,
      "context": []
    },
    {
      "id": "logqfo4",
      "author": "rilo_cat",
      "body": "so been there. what helps me & my husband move past moments like this is i’ll narrow it down to 3 or 4 places with options for me and make him choose from that. helps take the pressure off both parties.",
      "created_utc": 1727057399.0,
      "score": 37,
      "context": []
    },
    {
      "id": "lohz0rz",
      "author": "axw3555",
      "body": "My friends aren’t quite this bad. They don’t put me on the spot, but there is always the “find somewhere that’s AXW3555 friendly” that makes me feel awkward.",
      "created_utc": 1727082704.0,
      "score": 10,
      "context": []
    },
    {
      "id": "lokocxq",
      "author": "EnderSword",
      "body": "I started to agree with you, but then realized you just don't want to be the one to choose.... but you do still want the group to accommodate you. \n\nI tend to be more of the camp of, don't let my restrictions restrict you other people, so don't put it on me because I'll just go where you all want and I'll figure it out and if I don't eat, I'll live.",
      "created_utc": 1727119758.0,
      "score": 9,
      "context": []
    },
    {
      "id": "logwolp",
      "author": "Armayra",
      "body": "This is so real. My sister (who has only minor, easily avoidable food allergies) has said this on many an occasion. For me along with the tiredness of it all, also comes with the guilt and subsequent depression of thinking \"if it weren't for me and this stupid ed + dairy allergy you could enjoy going wherever you want\" this is why alot of times when asked if I want to go out in just don't go, because there are all of two restaurants in town I'll eat at and I know people will get bored of them and complain 🙃 an off switch for this would be nice",
      "created_utc": 1727059952.0,
      "score": 18,
      "context": []
    },
    {
      "id": "lohnpi7",
      "author": "PsychologicalTea5387",
      "body": "Omg no same I hate this so much",
      "created_utc": 1727074619.0,
      "score": 7,
      "context": []
    },
    {
      "id": "lojzxo0",
      "author": "LolaTigre",
      "body": "I always say my eating disorder is MY problem, not others’. It’s nice when people are understanding and helpful but at the end of the day, it’s up to me to keep myself fed. I also HATE being put on the spot to choose a restaurant and can’t stand the thought of putting others out if I can’t eat something they really want to eat. So I just tell folks to pick what they want, and if there isn’t anything on the menu for me, then it’s up to me to eat before or pick something up on the way home. I don’t mind sitting at a restaurant without eating anything. I don’t want to be the rock in the stream.",
      "created_utc": 1727112199.0,
      "score": 7,
      "context": []
    },
    {
      "id": "lojhi9s",
      "author": "BatFace",
      "body": "It's taken a long time and a lot of conversations, and I still have to remind him, but my husband has learned not to take me eating or not eating personal. I'm not certain why some people really need to feed the people they love, but my husband is one. Eating out, or cooking at home, he wants me to enjoy the food everytime, and I just can't, and the pressure makes everything worse.\n\nI think I finally convinced him once when I made something that has always been a safe food, took one bite, gagged and spit it out. He was like, wtf? I shrugged and said today I dont like this. In a couple weeks it'll go back to being something I always eat, but today my mouth decoded this is no good.\n\nI think he finally realized it really isn't something I have any control over. I went through the effort to make it for myself, and then couldn't eat it even though I had expected that I would. I don't decide what I can tolerate or when, or for how long. He still is a little sad if I don't eat, but that's because to him being hungry is one of the worst feelings, and he doesn't wa t me to feel that way.",
      "created_utc": 1727106342.0,
      "score": 5,
      "context": []
    },
    {
      "id": "loiwi37",
      "author": "latenightsadhours",
      "body": "i agree with the other commenter that you can make a list in your phone of safe restaurants. \n\npersonally, i would rather be the one to pick out the restaurant because I’ve had times where people keep suggesting restaurants and I’ve had to say “no, I can’t eat there” 10+ times. my friends have had to walk away from restaurants they suggested because i can’t eat there and they resent me for it, i can tell. it sucks. i find that a hell of a lot more embarrassing, and maybe he doesn’t want to put you on the spot in front of a friend who doesn’t know/isn’t informed about arfid.",
      "created_utc": 1727099333.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lok04m3",
      "author": "am9qb3JlZmVyZW5jZQ",
      "body": "If it's more of a social gathering with food rather than objective: find sustenance type of situation, then I find it comfortable to just eat something beforehand / grab a burger or such on the way and then let others decide where they want to go while I'm not ordering anything. Maybe not every time, but enough so I don't feel like a burden to them enjoying food adventures from time to time.",
      "created_utc": 1727112259.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lok2qhr",
      "author": "DogTracksJacks",
      "body": "its exhausting and honestly id gotten so used to it being said in a \"you're a pain in the ass! pick somewhere so you can stop being such a nuisance\" kind of way that i feel like im in trouble",
      "created_utc": 1727113061.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lohzyom",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1727083381.0,
      "score": 5,
      "context": []
    },
    {
      "id": "loirq83",
      "author": "SecretNature",
      "body": "This isn’t a food problem\nIt is a relationship problem. Your boyfriend is not an equal partner in your relationship. Any eating disorder or restriction is personality exhausting. A good partner who cares about you wants to support you as much as possible and help with your burden in every way. That’s love. If he understands this but is unwilling to share the load of your burden then it isn’t just a new restaurant you need to be finding.",
      "created_utc": 1727097563.0,
      "score": 5,
      "context": []
    },
    {
      "id": "loj8atd",
      "author": "peanutbutternmtn",
      "body": "Is it possible for you to just give him some options and then let him choose between them? Or is that already what you tried? At the end of the day if you’re both going out to eat, it probably is just easier to have you be the one to narrow it down. Our food stuff is complicated, that’s just the reality.",
      "created_utc": 1727103340.0,
      "score": 6,
      "context": []
    },
    {
      "id": "lolk43r",
      "author": "luminousfloret",
      "body": "Wow that’s so crazy I have the same struggles. You’d think after a couple decades they’d know where I can and can’t eat 😅",
      "created_utc": 1727130030.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lol4kdj",
      "author": "Naejakire",
      "body": "I deal with this at work. Everytime we have a mgmt meeting, they look to me to choose and it's like.. I don't like anything they like. It's too much pressure so I say no, tell them to choose and then just eat later.\n\nMy bf does this too.. But then I'll name 10 places and he says no to every one. So then I tell him to choose and he says no.. It's so annoying.",
      "created_utc": 1727124796.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lolwofe",
      "author": "heartoffiction",
      "body": "I’m very lucky that my bf knows the few safe foods I can get from restaurants and he’ll help pre scan for me, especially if we’re going out with other people.  When we have people visiting he’ll only suggest places I can eat, and he does it ahead of time so the other people don’t start randomly picking 🥹🥹🥹🥹 he does this because I expressed similar frustrations at always having to pick",
      "created_utc": 1727134445.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lom6o2q",
      "author": "rosiegal75",
      "body": "Maybe have a look for a few together one day, when you're not actually planning to go out. Then you've got say 3 or 4 places you can easily go to, then draw them out of a hat when he asks where you want to go. Take the pressure out of it",
      "created_utc": 1727137857.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lpip34f",
      "author": "Scary_Relationship57",
      "body": "ME EVERY DAY!!!!! im like please stop telling me to pick a place for dinner, were not gonna be eating for at least another hour if i have to pick, how about give me some suggestions so i can help narrow down my options and i will try and pick something to eat from one of the places, but like cmon put 100 restaurants infront of me and my brain spirals like?!?!?",
      "created_utc": 1727630313.0,
      "score": 1,
      "context": []
    },
    {
      "id": "loith8q",
      "author": "Nah__me",
      "body": "girl run, he's a red flag.",
      "created_utc": 1727098219.0,
      "score": -5,
      "context": []
    },
    {
      "id": "lolkg93",
      "author": "Ginger_Cat_Ventures",
      "body": "That’s a great suggestion! Thank you for your kindness. The ending of your comment definitely hit me. That it would be nice if he knew what a gift it would be maybe he’d rethink not contributing.",
      "created_utc": 1727130151.0,
      "score": 8,
      "context": [
        {
          "id": "logsu0u",
          "author": "pasghetti_n_meatbals",
          "body": "I keep a list on my phone for restaurants for eating with others. Each name and then where we like to go together. Of course my kiddo with ARFID is on the list, but I'm in my late 40's -- my friends are 40s-60s. We alllllll have eating differences. My bestie is gluten, soy, dairy, and egg free (also allergic to nightshades). I'm low acid reflux, my husband - no seafood, my kid's best friend has EOE, others are diabetic, keto, etc. Any time we travel- everyone googles and researches where we can go eat because we are friends. We treat the search like a quest and sometimes we find winners. I wish I could tell your boyfriend what a loving gift it would be to help you search for options. Hugs dear! ",
          "created_utc": 1727058378.0
        }
      ]
    },
    {
      "id": "loj2ri4",
      "author": "Legitimate-Produce-1",
      "body": "Great strategy!",
      "created_utc": 1727101506.0,
      "score": 7,
      "context": [
        {
          "id": "logsu0u",
          "author": "pasghetti_n_meatbals",
          "body": "I keep a list on my phone for restaurants for eating with others. Each name and then where we like to go together. Of course my kiddo with ARFID is on the list, but I'm in my late 40's -- my friends are 40s-60s. We alllllll have eating differences. My bestie is gluten, soy, dairy, and egg free (also allergic to nightshades). I'm low acid reflux, my husband - no seafood, my kid's best friend has EOE, others are diabetic, keto, etc. Any time we travel- everyone googles and researches where we can go eat because we are friends. We treat the search like a quest and sometimes we find winners. I wish I could tell your boyfriend what a loving gift it would be to help you search for options. Hugs dear! ",
          "created_utc": 1727058378.0
        }
      ]
    },
    {
      "id": "lol12o7",
      "author": "rilo_cat",
      "body": "you’re a wonderful friend",
      "created_utc": 1727123704.0,
      "score": 3,
      "context": [
        {
          "id": "logsu0u",
          "author": "pasghetti_n_meatbals",
          "body": "I keep a list on my phone for restaurants for eating with others. Each name and then where we like to go together. Of course my kiddo with ARFID is on the list, but I'm in my late 40's -- my friends are 40s-60s. We alllllll have eating differences. My bestie is gluten, soy, dairy, and egg free (also allergic to nightshades). I'm low acid reflux, my husband - no seafood, my kid's best friend has EOE, others are diabetic, keto, etc. Any time we travel- everyone googles and researches where we can go eat because we are friends. We treat the search like a quest and sometimes we find winners. I wish I could tell your boyfriend what a loving gift it would be to help you search for options. Hugs dear! ",
          "created_utc": 1727058378.0
        }
      ]
    },
    {
      "id": "loril34",
      "author": "Cheetopuff_226",
      "body": "This is awesome omg",
      "created_utc": 1727216359.0,
      "score": 2,
      "context": [
        {
          "id": "logsu0u",
          "author": "pasghetti_n_meatbals",
          "body": "I keep a list on my phone for restaurants for eating with others. Each name and then where we like to go together. Of course my kiddo with ARFID is on the list, but I'm in my late 40's -- my friends are 40s-60s. We alllllll have eating differences. My bestie is gluten, soy, dairy, and egg free (also allergic to nightshades). I'm low acid reflux, my husband - no seafood, my kid's best friend has EOE, others are diabetic, keto, etc. Any time we travel- everyone googles and researches where we can go eat because we are friends. We treat the search like a quest and sometimes we find winners. I wish I could tell your boyfriend what a loving gift it would be to help you search for options. Hugs dear! ",
          "created_utc": 1727058378.0
        }
      ]
    },
    {
      "id": "lokow6r",
      "author": "EnderSword",
      "body": "That's my opinion too, but I don't think that's what OP is saying.",
      "created_utc": 1727119925.0,
      "score": 7,
      "context": [
        {
          "id": "logzmod",
          "author": "whatdoidonowdamnit",
          "body": "Yep. I don’t like food. Don’t ask me where I want to eat. I want to eat a sandwich in my bed. Like just go eat what makes you happy. I won’t starve. I’ll eat something at some point.",
          "created_utc": 1727061187.0
        }
      ]
    },
    {
      "id": "loh3sr9",
      "author": "beaumega1",
      "body": "I appreciate this input. The struggle for me is finding 3 or 4 places I have options at. Then the next-level struggle is that those are the only 3 or 4 options we'll ever have.",
      "created_utc": 1727063052.0,
      "score": 16,
      "context": [
        {
          "id": "logqfo4",
          "author": "rilo_cat",
          "body": "so been there. what helps me & my husband move past moments like this is i’ll narrow it down to 3 or 4 places with options for me and make him choose from that. helps take the pressure off both parties.",
          "created_utc": 1727057399.0
        }
      ]
    },
    {
      "id": "lol8sb3",
      "author": "Ginger_Cat_Ventures",
      "body": "I want us to decide together. In this situation we were both feeling hungry and he proposed food. I said awesome, and started looking up places expecting him to do the same. But rather than help look he made the statement that I should’ve the one to look and decide because I have the restrictions. \n\nI want us to both decide what we want and talk it out. He wants chicken? I want Japanese food? Cool, let’s go find a restaurant with those two things. \n\nHaving the burden of being the only one deciding is exhausting. And that’s where I have an issue.",
      "created_utc": 1727126166.0,
      "score": 5,
      "context": [
        {
          "id": "lokocxq",
          "author": "EnderSword",
          "body": "I started to agree with you, but then realized you just don't want to be the one to choose.... but you do still want the group to accommodate you. \n\nI tend to be more of the camp of, don't let my restrictions restrict you other people, so don't put it on me because I'll just go where you all want and I'll figure it out and if I don't eat, I'll live.",
          "created_utc": 1727119758.0
        }
      ]
    },
    {
      "id": "lohkj0k",
      "author": "Carina_Nebula89",
      "body": "Yea I can really relate to the guilt. That's why sometimes I just tell my friends to chose and not take me into consideration, especially since sometimes they are in the mood for asian food and there is nothing for me to eat there since I don't even like rice, and don't like the spices that are used in asian food. I don't want them to miss out because of me. So I told them it is ok for me to just sit with them and not eat and get a snack later. It was awkward at first but it is ok now.",
      "created_utc": 1727072492.0,
      "score": 11,
      "context": [
        {
          "id": "logwolp",
          "author": "Armayra",
          "body": "This is so real. My sister (who has only minor, easily avoidable food allergies) has said this on many an occasion. For me along with the tiredness of it all, also comes with the guilt and subsequent depression of thinking \"if it weren't for me and this stupid ed + dairy allergy you could enjoy going wherever you want\" this is why alot of times when asked if I want to go out in just don't go, because there are all of two restaurants in town I'll eat at and I know people will get bored of them and complain 🙃 an off switch for this would be nice",
          "created_utc": 1727059952.0
        }
      ]
    },
    {
      "id": "loip4j6",
      "author": "Wellslapmesilly",
      "body": "Dumping him sounds harsh. But it is so true that couples do need to really assess how they are going to handle their differences. And communicate fully about it. Because ARFID can create a slow burn of resentment on both sides if there is not a plan to deal with these types of situations and lots of mutual respect about each persons perspective.",
      "created_utc": 1727096552.0,
      "score": 6,
      "context": [
        {
          "id": "lohzyom",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1727083381.0
        }
      ]
    },
    {
      "id": "lokrzgz",
      "author": "whatdoidonowdamnit",
      "body": "I think you’re right. It sounds like OP wants help deciding, which is not something I would do. I think my progress plays a part in that. I can eat something at just about any restaurant. I generally don’t, because restaurants are expensive for something I don’t enjoy. But I can always find something to eat. I had a lot more anxiety around different food and eating in public back then. \n \nMy mom used to get mad when we would go out to eat for my birthday and I’d get the same old chicken fingers and French fries that I’d maybe eat half of, and my dad would just ask her what she expected. But that was twenty years ago. I eat significantly better now.",
      "created_utc": 1727120870.0,
      "score": 1,
      "context": [
        {
          "id": "logzmod",
          "author": "whatdoidonowdamnit",
          "body": "Yep. I don’t like food. Don’t ask me where I want to eat. I want to eat a sandwich in my bed. Like just go eat what makes you happy. I won’t starve. I’ll eat something at some point.",
          "created_utc": 1727061187.0
        },
        {
          "id": "lokow6r",
          "author": "EnderSword",
          "body": "That's my opinion too, but I don't think that's what OP is saying.",
          "created_utc": 1727119925.0
        }
      ]
    },
    {
      "id": "lom3m0a",
      "author": "communistsayori",
      "body": "Does he not tell you what he's in the mood for if you ask? If he does then I think that it's acceptable for you to pick the restaurant, since you know what he wants and you can find a compromise based off of that. But if he's avoiding telling you what he wants to eat at all, even when prompted, that's really weird.",
      "created_utc": 1727136804.0,
      "score": 3,
      "context": [
        {
          "id": "lokocxq",
          "author": "EnderSword",
          "body": "I started to agree with you, but then realized you just don't want to be the one to choose.... but you do still want the group to accommodate you. \n\nI tend to be more of the camp of, don't let my restrictions restrict you other people, so don't put it on me because I'll just go where you all want and I'll figure it out and if I don't eat, I'll live.",
          "created_utc": 1727119758.0
        },
        {
          "id": "lol8sb3",
          "author": "Ginger_Cat_Ventures",
          "body": "I want us to decide together. In this situation we were both feeling hungry and he proposed food. I said awesome, and started looking up places expecting him to do the same. But rather than help look he made the statement that I should’ve the one to look and decide because I have the restrictions. \n\nI want us to both decide what we want and talk it out. He wants chicken? I want Japanese food? Cool, let’s go find a restaurant with those two things. \n\nHaving the burden of being the only one deciding is exhausting. And that’s where I have an issue.",
          "created_utc": 1727126166.0
        }
      ]
    },
    {
      "id": "lom8rxq",
      "author": "being-weird",
      "body": "Maybe he's just hungry and doesn't particularly care what he ends up eating. I know it's hard for us to imagine but some people really don't care about food that much",
      "created_utc": 1727138579.0,
      "score": 3,
      "context": [
        {
          "id": "lokocxq",
          "author": "EnderSword",
          "body": "I started to agree with you, but then realized you just don't want to be the one to choose.... but you do still want the group to accommodate you. \n\nI tend to be more of the camp of, don't let my restrictions restrict you other people, so don't put it on me because I'll just go where you all want and I'll figure it out and if I don't eat, I'll live.",
          "created_utc": 1727119758.0
        },
        {
          "id": "lol8sb3",
          "author": "Ginger_Cat_Ventures",
          "body": "I want us to decide together. In this situation we were both feeling hungry and he proposed food. I said awesome, and started looking up places expecting him to do the same. But rather than help look he made the statement that I should’ve the one to look and decide because I have the restrictions. \n\nI want us to both decide what we want and talk it out. He wants chicken? I want Japanese food? Cool, let’s go find a restaurant with those two things. \n\nHaving the burden of being the only one deciding is exhausting. And that’s where I have an issue.",
          "created_utc": 1727126166.0
        }
      ]
    },
    {
      "id": "lonc2k1",
      "author": "Ginger_Cat_Ventures",
      "body": "He didn’t even want to give me a type of food unfortunately. That all I wanted. Not no input whatsoever. It’s hard when the burden is completely on me.",
      "created_utc": 1727155492.0,
      "score": 2,
      "context": [
        {
          "id": "lokocxq",
          "author": "EnderSword",
          "body": "I started to agree with you, but then realized you just don't want to be the one to choose.... but you do still want the group to accommodate you. \n\nI tend to be more of the camp of, don't let my restrictions restrict you other people, so don't put it on me because I'll just go where you all want and I'll figure it out and if I don't eat, I'll live.",
          "created_utc": 1727119758.0
        },
        {
          "id": "lol8sb3",
          "author": "Ginger_Cat_Ventures",
          "body": "I want us to decide together. In this situation we were both feeling hungry and he proposed food. I said awesome, and started looking up places expecting him to do the same. But rather than help look he made the statement that I should’ve the one to look and decide because I have the restrictions. \n\nI want us to both decide what we want and talk it out. He wants chicken? I want Japanese food? Cool, let’s go find a restaurant with those two things. \n\nHaving the burden of being the only one deciding is exhausting. And that’s where I have an issue.",
          "created_utc": 1727126166.0
        },
        {
          "id": "lom3m0a",
          "author": "communistsayori",
          "body": "Does he not tell you what he's in the mood for if you ask? If he does then I think that it's acceptable for you to pick the restaurant, since you know what he wants and you can find a compromise based off of that. But if he's avoiding telling you what he wants to eat at all, even when prompted, that's really weird.",
          "created_utc": 1727136804.0
        }
      ]
    },
    {
      "id": "lp5nure",
      "author": "Used_Platform_3114",
      "body": "This completely. My boyfriend is a human bin. He enjoys pretty much every food going. When he says he doesn’t mind where we go, he really genuinely means it. Some days I can eat chicken. Some days I can’t. I wouldn’t ever expect him to know what I can and can’t eat, and we’ve been together 10 years 😂 It probably would grate on me if I went through 10 restaurant options and he said no to every option, regardless of how much I love him, so I can sympathise with your partner. What I would do is start at the top of google and just go to every place available systematically, create a system to take the pressure off. Even if I can only have chips, I’m not going to die, I can eat later in peace. Wishing you all the best.",
      "created_utc": 1727427274.0,
      "score": 2,
      "context": [
        {
          "id": "lokocxq",
          "author": "EnderSword",
          "body": "I started to agree with you, but then realized you just don't want to be the one to choose.... but you do still want the group to accommodate you. \n\nI tend to be more of the camp of, don't let my restrictions restrict you other people, so don't put it on me because I'll just go where you all want and I'll figure it out and if I don't eat, I'll live.",
          "created_utc": 1727119758.0
        },
        {
          "id": "lol8sb3",
          "author": "Ginger_Cat_Ventures",
          "body": "I want us to decide together. In this situation we were both feeling hungry and he proposed food. I said awesome, and started looking up places expecting him to do the same. But rather than help look he made the statement that I should’ve the one to look and decide because I have the restrictions. \n\nI want us to both decide what we want and talk it out. He wants chicken? I want Japanese food? Cool, let’s go find a restaurant with those two things. \n\nHaving the burden of being the only one deciding is exhausting. And that’s where I have an issue.",
          "created_utc": 1727126166.0
        },
        {
          "id": "lom8rxq",
          "author": "being-weird",
          "body": "Maybe he's just hungry and doesn't particularly care what he ends up eating. I know it's hard for us to imagine but some people really don't care about food that much",
          "created_utc": 1727138579.0
        }
      ]
    },
    {
      "id": "lp5ofiz",
      "author": "Used_Platform_3114",
      "body": "Think of it as less of a burden, but more as a freedom. Pick somewhere at random from google, it’s interesting to experience different restaurants, even without tasting the food. Sometimes I just have an interesting mocktail and some chips. And then I go home and eat in peace. If your boyfriend says he doesn’t mind, he almost definitely doesn’t mind, so don’t imagine that he must mind secretly. My boyfriend will happily eat pretty much anything. I can see how he would think it’s a caring thing to let you choose.",
      "created_utc": 1727427681.0,
      "score": 1,
      "context": [
        {
          "id": "lokocxq",
          "author": "EnderSword",
          "body": "I started to agree with you, but then realized you just don't want to be the one to choose.... but you do still want the group to accommodate you. \n\nI tend to be more of the camp of, don't let my restrictions restrict you other people, so don't put it on me because I'll just go where you all want and I'll figure it out and if I don't eat, I'll live.",
          "created_utc": 1727119758.0
        },
        {
          "id": "lol8sb3",
          "author": "Ginger_Cat_Ventures",
          "body": "I want us to decide together. In this situation we were both feeling hungry and he proposed food. I said awesome, and started looking up places expecting him to do the same. But rather than help look he made the statement that I should’ve the one to look and decide because I have the restrictions. \n\nI want us to both decide what we want and talk it out. He wants chicken? I want Japanese food? Cool, let’s go find a restaurant with those two things. \n\nHaving the burden of being the only one deciding is exhausting. And that’s where I have an issue.",
          "created_utc": 1727126166.0
        },
        {
          "id": "lom3m0a",
          "author": "communistsayori",
          "body": "Does he not tell you what he's in the mood for if you ask? If he does then I think that it's acceptable for you to pick the restaurant, since you know what he wants and you can find a compromise based off of that. But if he's avoiding telling you what he wants to eat at all, even when prompted, that's really weird.",
          "created_utc": 1727136804.0
        },
        {
          "id": "lonc2k1",
          "author": "Ginger_Cat_Ventures",
          "body": "He didn’t even want to give me a type of food unfortunately. That all I wanted. Not no input whatsoever. It’s hard when the burden is completely on me.",
          "created_utc": 1727155492.0
        }
      ]
    }
  ]
}