{
  "id": "1fo2h9w",
  "subreddit": "ARFID",
  "author": "Under-the-oak-trees",
  "created_utc": 1727146006.0,
  "title": "“Liquids don’t have textures” ",
  "selftext": "This was mostly amusing to me, but also in a “the normies think WHAT?!?” sort of way.\n\nI had an appointment with a new gastroenterologist today, which overall went well. He listened pretty well, which is… not as common as one might hope with specialists, especially. \n\nAnyway, we were talking about colonoscopy prep (as one does), and I mentioned that I wasn’t sure whether I’d be able to drink the prep liquid due to my flavour and texture issues. To which he said, “well, it’s a liquid, it doesn’t have a texture”. I was just like… I’m sorry, WHAT? \n\nI explained that water is a different texture from plain milk is a different texture from chocolate milk is a different texture from protein shakes…. He seemed to kind of take my word for it 😅\n\nBut, like. So many things are liquid? Oil is not the same texture as water? Smoothies are still kinda liquid and they’re Very different?? \n\nI am Confused by the normies 😅",
  "url": "https://www.reddit.com/r/ARFID/comments/1fo2h9w/liquids_dont_have_textures/",
  "score": 336,
  "num_comments": 52,
  "comments": [
    {
      "id": "lomvgb8",
      "author": "ArcherFawkes",
      "body": "Liquids absolutely have a texture wtf",
      "created_utc": 1727147222.0,
      "score": 211,
      "context": []
    },
    {
      "id": "lomvrf0",
      "author": "BolognaMountain",
      "body": "Liquids can have texture, and they also have varying viscosity (thickness). Maple syrup is more viscous than oil which is more viscous than water. Texture definitely exists in liquids, too - the grittiness of a protein shake or the sliminess of cow milk. \n\nI’m on your side for this one, liquids can have texture.",
      "created_utc": 1727147350.0,
      "score": 141,
      "context": []
    },
    {
      "id": "lon0qnz",
      "author": "StrawbraryLiberry",
      "body": "I didn't realize that people might not understand when I say I need \"heavier liquids\" than water sometimes! \n\nOf course liquids have textures!",
      "created_utc": 1727149551.0,
      "score": 71,
      "context": []
    },
    {
      "id": "lon1fhw",
      "author": "Cephalophore",
      "body": "Nevermind the fact that liquids absolutely have textures, colonoscopy prep is one of the foulest substances I've ever consumed. Drink it cold and through a straw!",
      "created_utc": 1727149874.0,
      "score": 56,
      "context": []
    },
    {
      "id": "lon2xen",
      "author": "amdaly10",
      "body": "Even plain water has different textures.",
      "created_utc": 1727150595.0,
      "score": 35,
      "context": []
    },
    {
      "id": "lomx00i",
      "author": "pixelpusheen",
      "body": "Liquids have texture! Milk has a different texture than water and tea etc.",
      "created_utc": 1727147874.0,
      "score": 18,
      "context": []
    },
    {
      "id": "lomvtgk",
      "author": "ResurgentClusterfuck",
      "body": "Liquids absolutely have texture",
      "created_utc": 1727147373.0,
      "score": 15,
      "context": []
    },
    {
      "id": "lonbezc",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1727155114.0,
      "score": 11,
      "context": []
    },
    {
      "id": "lonffex",
      "author": "Interesting-Cow8131",
      "body": "I call it mouth feel. I flat out cannot drink anything other than coffee (which has a different mouth feel than water) OR carbonated beverages l.",
      "created_utc": 1727157505.0,
      "score": 9,
      "context": []
    },
    {
      "id": "lon54uh",
      "author": "frankincentss",
      "body": "There are absolutely different textures in liquids, hell even certain air can feel heavier than other air",
      "created_utc": 1727151703.0,
      "score": 8,
      "context": []
    },
    {
      "id": "loo1mcz",
      "author": "AutistaChick",
      "body": "Ok I had to consult Chat GPT because I really couldn’t think of everything:\nSure! Here are some drinks with various textures:\n\n1. **Smooth**:\n   - **Milkshakes**: Creamy and thick, often made with ice cream and milk.\n   - **Coffee**: Regular brewed coffee has a smooth texture, while espresso can be velvety.\n\n2. **Creamy**:\n   - **Creamy cocktails**: Drinks like piña coladas or White Russians.\n   - **Matcha lattes**: Blended with milk, they have a rich, creamy texture.\n\n3. **Fizzy**:\n   - **Soda**: Carbonated drinks like cola or sparkling water.\n   - **Champagne**: Bubbly and effervescent.\n\n4. **Slushy**:\n   - **Frozen cocktails**: Like margaritas or daiquiris made with crushed ice.\n   - **Smoothie bowls**: Thick and spoonable, often topped with fruits and nuts.\n\n5. **Thick**:\n   - **Fruit smoothies**: Blended fruits can create a thick texture.\n   - **Protein shakes**: Can be thick and filling, depending on the ingredients.\n\n6. **Juicy**:\n   - **Fresh fruit juices**: Like orange or watermelon juice, which have a refreshing, watery feel.\n   - **Coconut water**: Light and refreshing with a slight viscosity.\n\n7. **Gritty**:\n   - **Pulpy fruit juices**: Such as orange juice with pulp, which has a textured feel.\n   - **Chia seed drinks**: Chia seeds create a slightly gritty texture when soaked in liquid.\n\n8. **Slimy**:\n   - **Aloe vera juice**: Has a slippery, gel-like texture.\n   - **Okra juice**: Known for its slimy consistency when blended.\n\nThese diverse textures can greatly affect the drinking experience!",
      "created_utc": 1727172702.0,
      "score": 7,
      "context": []
    },
    {
      "id": "londvnh",
      "author": "Warbly-Luxe",
      "body": "Liquid has viscosity. Viscosity literally equates to the basic fundamentals of texture for a liquid. Not to mention average consistency throughout the drink, particulates like pulp, and even the goddamn pH level. Acidic liquids tend to burn at a closer pH to 0 than bases.",
      "created_utc": 1727156562.0,
      "score": 5,
      "context": []
    },
    {
      "id": "loo1uvy",
      "author": "SufficientAirline471",
      "body": "I literally just read your headline and went “EWW WHAAT!?”\n\nBut, then again, my parents don’t understand why I can eat applesauce but not yogurt. 🙃",
      "created_utc": 1727172851.0,
      "score": 4,
      "context": []
    },
    {
      "id": "looxcjh",
      "author": "Backrow6",
      "body": "That's not a normie take, that's a weirdo gastro bad bedside manner take.\n\nDietitians and SLTs spend great amounts of time thinking about the texture of food and drink, working with patients and their families to modify and optimise the texture of what they drink if need be.",
      "created_utc": 1727186703.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lopj4gz",
      "author": "queijinhos",
      "body": "yes they do???",
      "created_utc": 1727193699.0,
      "score": 4,
      "context": []
    },
    {
      "id": "loq7qud",
      "author": "Sea_Lead1753",
      "body": "Bruh different waters have different textures???? How do ppl not notice??",
      "created_utc": 1727201353.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lon5sdo",
      "author": "None",
      "body": "They have textures, especially smoothies and some juice. Strange doctors out there",
      "created_utc": 1727152037.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lonczw9",
      "author": "Peristerophile",
      "body": "I know this isn’t exactly what you’re posting about, but if you’re worried about colonoscopy prep, see if you can get a prescription for sutab (colonoscopy meds in pill form). You’ll probably still have to drink a couple bottles of magnesium citrate, but it doesn’t take as much as the liquid colonoscopy prep, and it might taste marginally better (they come in like, grape flavor; not very convincing and weirdly carbonated, but still probably a step above the regular liquid prep). If you have a diagnosis of ARFID, there’s a good chance you can get insurance to cover it, too (neither the insurance company, nor the pharmacist, nor the doctor, nor you want a cancellation or repeat colonoscopy if you can’t properly down the meds when the time comes).",
      "created_utc": 1727156038.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lonk4n8",
      "author": "LemonfishSoda",
      "body": "That's certainly a take he had there. XD\n\nI wonder if he has ever heard about the Boston Molasses Disaster. \n\nOr about how things will float on some liquids, but not others.\n\nOr, heck, even about oil and water not mixing (why does he think that is?).",
      "created_utc": 1727160501.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lonk5l9",
      "author": "Mx-Helix-pomatia",
      "body": "Raises my eyebrow in dysphagia",
      "created_utc": 1727160518.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lonqszv",
      "author": "neko_mancy",
      "body": "anyone who has had a protein shake will definitely be able to understand liquids have textures lol",
      "created_utc": 1727165141.0,
      "score": 3,
      "context": []
    },
    {
      "id": "loo2qe8",
      "author": "two-of-me",
      "body": "The first time I had Covid and 100% lost my sense of taste and smell, I could tell what I was drinking from the texture alone. Whoever thinks liquids don’t have texture is sorely mistaken.",
      "created_utc": 1727173396.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lool1n9",
      "author": "Nearby-Ad5666",
      "body": "You are not wrong, but to get a decent diagnosis you have to endure the test. There is a low volume prep which I did, they recommended using it very cold, drink with a straw and use Mucinex a few days before to avoid the giant gallons of prep\n\nI was terrified. But it wasn't that horrible. It wasn't as thick as I imagined, the straw made it so I could avoid my tongue mostly and I got through it.\n\nI also had a swallow test that requires you to drink a few sips of a couple of different things and it scared me,\nI told the technician my situation and she talked me through it. It was only a few sips, and then a few pictures, then change the angle of the table, a few more sips, more images.\nYou really CAN do this",
      "created_utc": 1727182187.0,
      "score": 3,
      "context": []
    },
    {
      "id": "looya4g",
      "author": "TechieGottaSoundByte",
      "body": "I have GERD, not ARFID (I'm here for a family member), and liquids absolutely have textures. It comes into play for me because less thick textures worsen my GERD symptoms. \n\nAnd a gastroenterologist should know this, because they treat conditions like GERD where liquid thickness matters.\n\nYou should invite your doctor to look up 'ooblek', a mix of cornstarch and water that behaves like a solid under pressure and a liquid when there is no pressure. Corn starch is routinely used to change the texture of soups.",
      "created_utc": 1727187021.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lopjuqn",
      "author": "lilburblue",
      "body": "I’d consider viscosity a texture?",
      "created_utc": 1727193931.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lopnkai",
      "author": "Fun_Intention_5371",
      "body": "Wren I read the title, I said the fuck they don't! \n\nMillkshake vs OJ vs water",
      "created_utc": 1727195102.0,
      "score": 2,
      "context": []
    },
    {
      "id": "loqfb59",
      "author": "TheRealAanarii",
      "body": "Agreed.",
      "created_utc": 1727203714.0,
      "score": 2,
      "context": []
    },
    {
      "id": "loqh5at",
      "author": "sharkprincefishstick",
      "body": "If there’s no texture to liquids, why do they make so many different pulp levels of orange juice? Checkmate, normies!",
      "created_utc": 1727204285.0,
      "score": 2,
      "context": []
    },
    {
      "id": "losf49k",
      "author": "None",
      "body": "Has this man never heard of pulp lol",
      "created_utc": 1727228385.0,
      "score": 2,
      "context": []
    },
    {
      "id": "loybbrj",
      "author": "CozmicOwl16",
      "body": "We should rank the common beverage and liquid foods so the normies can get it.  \n\nLet’s use water as the baseline 0. From there, the more complex the texture the higher number.  Like a cookies and cream milkshake is 100.",
      "created_utc": 1727314073.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lrzevd8",
      "author": "NerdyYogaGirl",
      "body": "God this is just an absolutely incredible example of how neurotypicals think and how wild it is! As a neurodivergent person I think: \"how can you even say that?!\" but then to them it's just \"oh it's a liquid so they're all liquid texture\"",
      "created_utc": 1728961473.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lwrjmm2",
      "author": "corvusclown",
      "body": "liquids are actually much worse for me sometimes. I've tried the complete meals in a bottle and I physically can't get them down because the texture is so bad to me, whereas I find it a lot easier sometimes to force a food down.",
      "created_utc": 1731427154.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lonx14i",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1727169589.0,
      "score": 0,
      "context": []
    },
    {
      "id": "lookxn7",
      "author": "honeynut_queerio",
      "body": "Had my first colonoscopy earlier this year (after 5+ years of avoiding it). Was so worried about getting the prep down but i did it. I had called the office and had warned them that I had ARFID. I ended up not using the flavor packet they included because it seemed worse to me than the other. Tastes kinda salty and a little gritty. I was given the same advice and it definitely helped — cold temperature, straw, concentrate on something visually in the distance and drink the whole glass at once, and have distractions and chasers of safe clear liquids ready for after. There are other prep options if you can’t do this one though. Wishing you all the best OP 💜",
      "created_utc": 1727182144.0,
      "score": 16,
      "context": [
        {
          "id": "lon1fhw",
          "author": "Cephalophore",
          "body": "Nevermind the fact that liquids absolutely have textures, colonoscopy prep is one of the foulest substances I've ever consumed. Drink it cold and through a straw!",
          "created_utc": 1727149874.0
        }
      ]
    },
    {
      "id": "loon52l",
      "author": "shitz_brickz",
      "body": "Exactly my thought, texture is the least of the issues when you need to drink that second bottle and your body has realized what the first bottle is doing.",
      "created_utc": 1727183002.0,
      "score": 9,
      "context": [
        {
          "id": "lon1fhw",
          "author": "Cephalophore",
          "body": "Nevermind the fact that liquids absolutely have textures, colonoscopy prep is one of the foulest substances I've ever consumed. Drink it cold and through a straw!",
          "created_utc": 1727149874.0
        }
      ]
    },
    {
      "id": "loqfx3c",
      "author": "TheRealAanarii",
      "body": "I haven't ever drank that chalky stuff, but I will say if you go to a Korean acupuncturist and they want to order tea for your specific ailments, BEWARE. I'm sure it was on the up and up, they were super lovely... but the tea I had to drink twice a day tasted like horse pee and fermented grass. It was so unpleasant.  \n\nDef helped, but I never reordered it. It was... too much yuck.",
      "created_utc": 1727203904.0,
      "score": 6,
      "context": [
        {
          "id": "lon1fhw",
          "author": "Cephalophore",
          "body": "Nevermind the fact that liquids absolutely have textures, colonoscopy prep is one of the foulest substances I've ever consumed. Drink it cold and through a straw!",
          "created_utc": 1727149874.0
        }
      ]
    },
    {
      "id": "lopijj8",
      "author": "Stormdude127",
      "body": "Magnesium Citrate? I had to drink Gavilyte-C which is essentially miralax. The flavor wasn’t disgusting but got really old really fast. And I had to drink a gallon. I could barely keep it down",
      "created_utc": 1727193517.0,
      "score": 3,
      "context": [
        {
          "id": "lon1fhw",
          "author": "Cephalophore",
          "body": "Nevermind the fact that liquids absolutely have textures, colonoscopy prep is one of the foulest substances I've ever consumed. Drink it cold and through a straw!",
          "created_utc": 1727149874.0
        }
      ]
    },
    {
      "id": "lopjlf6",
      "author": "AetherDrew43",
      "body": "Can you describe the taste?",
      "created_utc": 1727193849.0,
      "score": 3,
      "context": [
        {
          "id": "lon1fhw",
          "author": "Cephalophore",
          "body": "Nevermind the fact that liquids absolutely have textures, colonoscopy prep is one of the foulest substances I've ever consumed. Drink it cold and through a straw!",
          "created_utc": 1727149874.0
        }
      ]
    },
    {
      "id": "losvz8j",
      "author": "covertchipmunk",
      "body": "When I read the title, I (a non-ARFID but texture-picky eater) immediately thought of colonoscopy prep. I did miralax + gatorade and it was so thick I could've almost chewed it. Very much more viscous than regular Gatorade! And it didn't even work well so I get to do 2 days of a different prep next time.",
      "created_utc": 1727235234.0,
      "score": 2,
      "context": [
        {
          "id": "lon1fhw",
          "author": "Cephalophore",
          "body": "Nevermind the fact that liquids absolutely have textures, colonoscopy prep is one of the foulest substances I've ever consumed. Drink it cold and through a straw!",
          "created_utc": 1727149874.0
        }
      ]
    },
    {
      "id": "lonhpw3",
      "author": "ArcherFawkes",
      "body": "I don't think badly of Dasani fans, but... I do judge them.",
      "created_utc": 1727158944.0,
      "score": 24,
      "context": [
        {
          "id": "lon2xen",
          "author": "amdaly10",
          "body": "Even plain water has different textures.",
          "created_utc": 1727150595.0
        }
      ]
    },
    {
      "id": "lonizox",
      "author": "GaydrianTheRainbow",
      "body": "I had never thought of this, only of the different flavours, but now that you say this, the water in the city I used to live also had a slightly better texture than the region where I grew up and now live again. I miss that water so much. Its texture is slightly better, come to think of it, and its flavour is miles above. I always said when I lived there, I Liked drinking water. As a kid and now again, i struggle with it.",
      "created_utc": 1727159767.0,
      "score": 15,
      "context": [
        {
          "id": "lon2xen",
          "author": "amdaly10",
          "body": "Even plain water has different textures.",
          "created_utc": 1727150595.0
        }
      ]
    },
    {
      "id": "lonimd8",
      "author": "GaydrianTheRainbow",
      "body": "Even tea has a different texture than water! Like, tea from the tea plant has what I would call a texture to go with its astringency. Some herbal teas are slippery! etc.",
      "created_utc": 1727159528.0,
      "score": 14,
      "context": [
        {
          "id": "lomx00i",
          "author": "pixelpusheen",
          "body": "Liquids have texture! Milk has a different texture than water and tea etc.",
          "created_utc": 1727147874.0
        }
      ]
    },
    {
      "id": "loo9jeu",
      "author": "Minion5051",
      "body": "This is what I was going to say. It's people being pedantic about the \"proper\" word.",
      "created_utc": 1727177151.0,
      "score": 7,
      "context": [
        {
          "id": "lonbezc",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1727155114.0
        }
      ]
    },
    {
      "id": "loo344c",
      "author": "two-of-me",
      "body": "Mouth feel is actually a legitimate term used by chefs! My friend used to work as some type of food taster, not quite sure what the nature of her job was, but mouthfeel was actually part of the qualifiers for foods.",
      "created_utc": 1727173629.0,
      "score": 6,
      "context": [
        {
          "id": "lonffex",
          "author": "Interesting-Cow8131",
          "body": "I call it mouth feel. I flat out cannot drink anything other than coffee (which has a different mouth feel than water) OR carbonated beverages l.",
          "created_utc": 1727157505.0
        }
      ]
    },
    {
      "id": "loqvs3f",
      "author": "Under-the-oak-trees",
      "body": "I honestly think he had a brain fart and didn’t really think it through before saying it 😅\n\nAnd/or that he finds the texture of propylene glycol very similar to water. OR thinks of “texture” in liquids as, like. Pulp or sediment or whatever, and was trying to express that this one doesn’t have those? IDK. He was generally thoughtful and good at listening, and he took well to me explaining some of the nuances of liquid texture to him, so I’m not holding it against him. \n\nBut it definitely felt like a WILD assertion to make 😅",
      "created_utc": 1727208848.0,
      "score": 3,
      "context": [
        {
          "id": "looxcjh",
          "author": "Backrow6",
          "body": "That's not a normie take, that's a weirdo gastro bad bedside manner take.\n\nDietitians and SLTs spend great amounts of time thinking about the texture of food and drink, working with patients and their families to modify and optimise the texture of what they drink if need be.",
          "created_utc": 1727186703.0
        }
      ]
    },
    {
      "id": "loplgk7",
      "author": "Under-the-oak-trees",
      "body": "We talked everything through in detail; I’m going to get a sample of one of the prep options in advance and see if I can get that down, then if that doesn’t work they’ll switch my prescription and I’ll try the other one that’s covered by my drug benefit, and if that doesn’t work we’ll go from there. And the one I’m starting with, I only need to drink 2/3 of a cup of the stuff in the evening and the morning, and then at least eight cups of clear fluids in the three hours after each one. Which sounds a LOT easier than two litres (eight cups) of propylene glycol each in the evening and the morning and trying to fit all of that liquid into two hours if possible each time. \n\nHe was quite accommodating in general as I explained my concerns and asked my questions. The one comment about liquids not having textures notwithstanding 😅",
      "created_utc": 1727194438.0,
      "score": 1,
      "context": [
        {
          "id": "lonczw9",
          "author": "Peristerophile",
          "body": "I know this isn’t exactly what you’re posting about, but if you’re worried about colonoscopy prep, see if you can get a prescription for sutab (colonoscopy meds in pill form). You’ll probably still have to drink a couple bottles of magnesium citrate, but it doesn’t take as much as the liquid colonoscopy prep, and it might taste marginally better (they come in like, grape flavor; not very convincing and weirdly carbonated, but still probably a step above the regular liquid prep). If you have a diagnosis of ARFID, there’s a good chance you can get insurance to cover it, too (neither the insurance company, nor the pharmacist, nor the doctor, nor you want a cancellation or repeat colonoscopy if you can’t properly down the meds when the time comes).",
          "created_utc": 1727156038.0
        }
      ]
    },
    {
      "id": "loq9rdm",
      "author": "Under-the-oak-trees",
      "body": "Yeah, I have a Barium Swallow booked as well, which sounds like probably what you’re talking about. I can *usually* choke down one swallow of nearly anything, and I’m highly motivated for that one because I have some upper-GI issues that it could give us really helpful info about. \n\nFor the colonoscopy, I’m going to try out the stuff for the low-volume prep first (like, get some over-the-counter and sample it way in advance), and if I absolutely can’t get that down give the standard high-volume one a try, and if I can’t get THAT down we’ll figure out where to go from there. The doctor and his receptionist have been really open to helping me make this as accessible as possible. \n\nI think it’ll be ok. \n\nBut liquids definitely have textures 😂",
      "created_utc": 1727201982.0,
      "score": 1,
      "context": [
        {
          "id": "lool1n9",
          "author": "Nearby-Ad5666",
          "body": "You are not wrong, but to get a decent diagnosis you have to endure the test. There is a low volume prep which I did, they recommended using it very cold, drink with a straw and use Mucinex a few days before to avoid the giant gallons of prep\n\nI was terrified. But it wasn't that horrible. It wasn't as thick as I imagined, the straw made it so I could avoid my tongue mostly and I got through it.\n\nI also had a swallow test that requires you to drink a few sips of a couple of different things and it scared me,\nI told the technician my situation and she talked me through it. It was only a few sips, and then a few pictures, then change the angle of the table, a few more sips, more images.\nYou really CAN do this",
          "created_utc": 1727182187.0
        }
      ]
    },
    {
      "id": "lop4bee",
      "author": "Used_Platform_3114",
      "body": "Which bit of the definition for liquid proves it cannot have texture? Water is a liquid. Milk is a liquid. Orange juice is a liquid. Golden syrup is a liquid. Ejaculate is a liquid. Viscosity does affect texture, but doesn’t account for everything like grittiness, sliminess, etc. Some liquids even have a dry texture to me!",
      "created_utc": 1727189028.0,
      "score": 3,
      "context": [
        {
          "id": "lonx14i",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1727169589.0
        }
      ]
    },
    {
      "id": "loo2uwj",
      "author": "two-of-me",
      "body": "Have you ever had Nestle brand bottled water? The worst!!!!",
      "created_utc": 1727173472.0,
      "score": 9,
      "context": [
        {
          "id": "lon2xen",
          "author": "amdaly10",
          "body": "Even plain water has different textures.",
          "created_utc": 1727150595.0
        },
        {
          "id": "lonhpw3",
          "author": "ArcherFawkes",
          "body": "I don't think badly of Dasani fans, but... I do judge them.",
          "created_utc": 1727158944.0
        }
      ]
    },
    {
      "id": "looq9hd",
      "author": "transitive_isotoxal",
      "body": "Aquafina drinkers as well",
      "created_utc": 1727184183.0,
      "score": 7,
      "context": [
        {
          "id": "lon2xen",
          "author": "amdaly10",
          "body": "Even plain water has different textures.",
          "created_utc": 1727150595.0
        },
        {
          "id": "lonhpw3",
          "author": "ArcherFawkes",
          "body": "I don't think badly of Dasani fans, but... I do judge them.",
          "created_utc": 1727158944.0
        }
      ]
    },
    {
      "id": "loq9wk0",
      "author": "Interesting-Cow8131",
      "body": "I know, it's 100% a thing. Coffee has a different mouth feel than water and tea, for example, even though coffee and tea are water essentially",
      "created_utc": 1727202028.0,
      "score": 4,
      "context": [
        {
          "id": "lonffex",
          "author": "Interesting-Cow8131",
          "body": "I call it mouth feel. I flat out cannot drink anything other than coffee (which has a different mouth feel than water) OR carbonated beverages l.",
          "created_utc": 1727157505.0
        },
        {
          "id": "loo344c",
          "author": "two-of-me",
          "body": "Mouth feel is actually a legitimate term used by chefs! My friend used to work as some type of food taster, not quite sure what the nature of her job was, but mouthfeel was actually part of the qualifiers for foods.",
          "created_utc": 1727173629.0
        }
      ]
    },
    {
      "id": "loqve2b",
      "author": "Peristerophile",
      "body": "Aww, that’s awesome! Sounds like you’ve got a great doctor <:)",
      "created_utc": 1727208725.0,
      "score": 2,
      "context": [
        {
          "id": "lonczw9",
          "author": "Peristerophile",
          "body": "I know this isn’t exactly what you’re posting about, but if you’re worried about colonoscopy prep, see if you can get a prescription for sutab (colonoscopy meds in pill form). You’ll probably still have to drink a couple bottles of magnesium citrate, but it doesn’t take as much as the liquid colonoscopy prep, and it might taste marginally better (they come in like, grape flavor; not very convincing and weirdly carbonated, but still probably a step above the regular liquid prep). If you have a diagnosis of ARFID, there’s a good chance you can get insurance to cover it, too (neither the insurance company, nor the pharmacist, nor the doctor, nor you want a cancellation or repeat colonoscopy if you can’t properly down the meds when the time comes).",
          "created_utc": 1727156038.0
        },
        {
          "id": "loplgk7",
          "author": "Under-the-oak-trees",
          "body": "We talked everything through in detail; I’m going to get a sample of one of the prep options in advance and see if I can get that down, then if that doesn’t work they’ll switch my prescription and I’ll try the other one that’s covered by my drug benefit, and if that doesn’t work we’ll go from there. And the one I’m starting with, I only need to drink 2/3 of a cup of the stuff in the evening and the morning, and then at least eight cups of clear fluids in the three hours after each one. Which sounds a LOT easier than two litres (eight cups) of propylene glycol each in the evening and the morning and trying to fit all of that liquid into two hours if possible each time. \n\nHe was quite accommodating in general as I explained my concerns and asked my questions. The one comment about liquids not having textures notwithstanding 😅",
          "created_utc": 1727194438.0
        }
      ]
    },
    {
      "id": "loqaduk",
      "author": "Nearby-Ad5666",
      "body": "Absolutely. The low volume is more tolerable.\nThis person thinks all liquids have the same viscosity\nThe barium swallow wasn't bad at all. They give you something with bubbles and don't want  you to burp. That was the hardest thing",
      "created_utc": 1727202176.0,
      "score": 2,
      "context": [
        {
          "id": "lool1n9",
          "author": "Nearby-Ad5666",
          "body": "You are not wrong, but to get a decent diagnosis you have to endure the test. There is a low volume prep which I did, they recommended using it very cold, drink with a straw and use Mucinex a few days before to avoid the giant gallons of prep\n\nI was terrified. But it wasn't that horrible. It wasn't as thick as I imagined, the straw made it so I could avoid my tongue mostly and I got through it.\n\nI also had a swallow test that requires you to drink a few sips of a couple of different things and it scared me,\nI told the technician my situation and she talked me through it. It was only a few sips, and then a few pictures, then change the angle of the table, a few more sips, more images.\nYou really CAN do this",
          "created_utc": 1727182187.0
        },
        {
          "id": "loq9rdm",
          "author": "Under-the-oak-trees",
          "body": "Yeah, I have a Barium Swallow booked as well, which sounds like probably what you’re talking about. I can *usually* choke down one swallow of nearly anything, and I’m highly motivated for that one because I have some upper-GI issues that it could give us really helpful info about. \n\nFor the colonoscopy, I’m going to try out the stuff for the low-volume prep first (like, get some over-the-counter and sample it way in advance), and if I absolutely can’t get that down give the standard high-volume one a try, and if I can’t get THAT down we’ll figure out where to go from there. The doctor and his receptionist have been really open to helping me make this as accessible as possible. \n\nI think it’ll be ok. \n\nBut liquids definitely have textures 😂",
          "created_utc": 1727201982.0
        }
      ]
    },
    {
      "id": "loqk4fr",
      "author": "two-of-me",
      "body": "Totally! And they leave my mouth feeling differently for a while after I drink them too.",
      "created_utc": 1727205220.0,
      "score": 3,
      "context": [
        {
          "id": "lonffex",
          "author": "Interesting-Cow8131",
          "body": "I call it mouth feel. I flat out cannot drink anything other than coffee (which has a different mouth feel than water) OR carbonated beverages l.",
          "created_utc": 1727157505.0
        },
        {
          "id": "loo344c",
          "author": "two-of-me",
          "body": "Mouth feel is actually a legitimate term used by chefs! My friend used to work as some type of food taster, not quite sure what the nature of her job was, but mouthfeel was actually part of the qualifiers for foods.",
          "created_utc": 1727173629.0
        },
        {
          "id": "loq9wk0",
          "author": "Interesting-Cow8131",
          "body": "I know, it's 100% a thing. Coffee has a different mouth feel than water and tea, for example, even though coffee and tea are water essentially",
          "created_utc": 1727202028.0
        }
      ]
    }
  ]
}