{
  "id": "1frmezo",
  "subreddit": "ARFID",
  "author": "Weary_Method_8275",
  "created_utc": 1727552625.0,
  "title": "Friend is trying to cure my Arfid by forcing me to eat fear foods",
  "selftext": "I'm 17, autistic and I've always really struggled with  keeping my weight up due to my extremely restricted diet & sensory aversions. It's been a cycle of being admitted and then losing the weight right when I'm back home because of my severe anxiety around food and general lack of appetite. \n\nI am now Staying at my friend's house until I'm allowed back at home, and he doesn't believe me  about my ARFID. He says that It'll get better if I challenge my fears and eat new things, which is probably true, but  he has been making me eat disgusting things, like  chicken and dog food, and not letting  me eat anything else, even If I were to buy it  myself. It's not that I'm ungrateful or anything, I  just physically can't eat  it. I cried and threw up and I feel so guilty and humiliated. He thought I was being ungrateful, But I don't know how to explain that this is  just how my brain works, and I wish soooo badly  that it wasn't this way.\n\nIt wasn't even the dog food that made me throw up, but the chicken, which makes me feel even worse about this🥲Feels like  there is something Wrong with me. I haven't  eaten since this happened yesterday, and I know that I will have to eat eventually, but  he is  adamant about \"Curing\" my arfid  and won't let me eat anything safe. I already struggle with eating normally, I would rather just not eat at all, but I don't want to lose anymore weight. I feel like it's hopeless no matter what I do in this situation",
  "url": "https://www.reddit.com/r/ARFID/comments/1frmezo/friend_is_trying_to_cure_my_arfid_by_forcing_me/",
  "score": 111,
  "num_comments": 68,
  "comments": [
    {
      "id": "lpdy61a",
      "author": "bearminmum",
      "body": "You need to contact an adult",
      "created_utc": 1727553033.0,
      "score": 198,
      "context": []
    },
    {
      "id": "lpdzlel",
      "author": "vorarefilia",
      "body": "You need to stay away from this person. It's clear they get off on humiliating and abusing you, contact a trusted adult and leave as soon as possible.",
      "created_utc": 1727553531.0,
      "score": 195,
      "context": []
    },
    {
      "id": "lpe0a96",
      "author": "StrawbraryLiberry",
      "body": "This will probably make your ARFID worse, not better. \n\nYou are being abused & should get out of there as soon as you can. /gen\n\n....Or make your friend eat dog food to assert dominance /j",
      "created_utc": 1727553775.0,
      "score": 67,
      "context": []
    },
    {
      "id": "lpdz5xm",
      "author": "NECROM4NCY",
      "body": "youre being abused and like the other commenter stated get in contact with an adult",
      "created_utc": 1727553379.0,
      "score": 108,
      "context": []
    },
    {
      "id": "lpe1afi",
      "author": "SophiaKai",
      "body": "*Why would he make you eat dog food???* that is humiliating, degrading, and completely abusive unless you asked to be fed  dog food. You need to get as far away from this guy as you possibly can.\n\nI know you see him as your friend, but please trust us that he's not. He doesn't have your best interests at heart, he wants to control and degrade you. He would rather see you suffer than actually try to listen to you and help you. He does not respect you. He thinks you're lesser than he is (possibly lesser than human if he's making you eat dog food) bc of your arfid. You're in a dangerous situation and you need to do everything you possibly can to get out of it.",
      "created_utc": 1727554134.0,
      "score": 50,
      "context": []
    },
    {
      "id": "lpe1fmi",
      "author": "KirbysLeftBigToe",
      "body": "This is abuse. Please contact an adult. Or call whatever the emergency or non emergency number is in your country and they will advise and help you. \n\nYou are a vulnerable minor with a history of being admitted who is being abused any mandatory informer who didn’t step in would lose their job.",
      "created_utc": 1727554184.0,
      "score": 42,
      "context": []
    },
    {
      "id": "lpe779w",
      "author": "l0stk1tten",
      "body": "You are being abused. I'm telling you now that no sane person would make anyone do that, this isn't normal.\n\nHow would your parents feel if they heard you were being fed dog food? If they would react appropriately, i.e. be horrified and take you home or at least to stay with someone safe, call them ASAP (yes ASAP, if they are normal they will want to get you out of there immediately).\n\nIf they would not back you up, that is neglect. I swear to you that you are being taken advantage of by this \"friend.\" But anyway, you still need to get out even if this is the case. Contact the police or emergency services. If you are nervous about doing this, try a social worker if you have one, a trusted aunt/uncle, your favourite teacher at school, or the guidance counsellor and they should work with you to get help.\n\nFrom one autistic person to another, unfortunately we are very likely to be victims of abuse, because even high functioning autistic people can be unaware that things are inappropriate or miss red flags, and people with bad intentions also seek us out because we are easier targets. Please take my advice seriously, you have to protect yourself.",
      "created_utc": 1727556228.0,
      "score": 28,
      "context": []
    },
    {
      "id": "lpe4sg9",
      "author": "Under-the-oak-trees",
      "body": "This is the exact opposite of how to make ARFID better. It’s also absolutely unacceptable behaviour on his part, and as everyone else has been saying, you need to find a trusted adult to get you out of there. \n\nThis is 100% worth bothering your mom about, and if she doesn’t agree then that’s neglect or abuse on her part. If I were your parent, I’d be absolutely livid that this person I left my child with was treating them this way. (Honestly I’m livid as it is, and I can only imagine how I’d feel if I trusted someone to care for a person I loved and they treated them this way.)",
      "created_utc": 1727555381.0,
      "score": 15,
      "context": []
    },
    {
      "id": "lpejkho",
      "author": "two-of-me",
      "body": "Dog food? What is your “friend’s” problem? Dog food is for dogs and this is abhorrent behavior from another person. \n\nWhy are you not allowed back at home? You’re a minor and your parents/guardians have a legal obligation to house you until you’re 18. \n\nWhere are your friend’s parents and are they allowing you to be served dog food? I am so sorry this whole situation is happening. This is so awful.",
      "created_utc": 1727560773.0,
      "score": 14,
      "context": []
    },
    {
      "id": "lpea4si",
      "author": "giraffemoo",
      "body": "Not your friend.",
      "created_utc": 1727557264.0,
      "score": 9,
      "context": []
    },
    {
      "id": "lpejkse",
      "author": "anilucy",
      "body": "1- Anyone who makes you eat dog food absolutely hates you. Please cut that person out of your life this is absolutely not ok. My eyes flew out of their sockets when I read this. 2- You need new friends.",
      "created_utc": 1727560776.0,
      "score": 9,
      "context": []
    },
    {
      "id": "lpe08i0",
      "author": "BulkyComfortable3040",
      "body": "As everyone else is saying, you need to tell an adult and get out of there. What they are doing is abuse and no one deserves that",
      "created_utc": 1727553758.0,
      "score": 10,
      "context": []
    },
    {
      "id": "lpe7qu8",
      "author": "None",
      "body": "You’re “friend” is not qualified to probably help someone with an ED. They don’t sound like much of a friend to me. You need to advocate for yourself. You will not be made to do things you aren’t comfortable with or don’t feel safe doing for anyone. You don’t want or need unsolicited advice, and you most definitely need to advocate for yourself boundaries. Either stay away from them or set some firm boundaries with them. This is not okay. Period.",
      "created_utc": 1727556419.0,
      "score": 6,
      "context": []
    },
    {
      "id": "lpeh0mg",
      "author": "younglink164",
      "body": "While exposure therapy is a way to help with arfid it should be done with a therapist to guide you and help you with the process because it is hard and it can be upsetting so it's important to feel supported. Someone forcing food on you like this isn't exposure therapy it's abusive and harmful.",
      "created_utc": 1727559809.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lpe5tfu",
      "author": "Legitimate-Produce-1",
      "body": "Excuse me, dog food??",
      "created_utc": 1727555740.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lpejfqk",
      "author": "Throwaway-ileftthem",
      "body": "DOG FOOD??? You need to get out of there as soon as possible!!! I also struggle with ARFID. It’s probably somewhat true that facing the fear foods might at least HELP, but definitely not like this!",
      "created_utc": 1727560722.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lpeu8dy",
      "author": "Smoothope",
      "body": "feeding you dog food is abuse. forcing you to eat food you don’t want is abuse. please report him to whatever authorities you can.",
      "created_utc": 1727564861.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lpdygvp",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1727553138.0,
      "score": 7,
      "context": []
    },
    {
      "id": "lpf7905",
      "author": "alienprincess111",
      "body": "If someone is making you sat dog food, that is messed up. You need to leave immediately!",
      "created_utc": 1727570030.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lpg40zp",
      "author": "bishyfishyriceball",
      "body": "Oh my god dog food… this is straight up abusive and cruel. Please share this post with a safe adult if you don’t feel comfortable sharing it in words. If you tell a teacher or BT or therapist at bare minimum that an adult was only allowing you to eat those things they are a mandated reporter and will get the reporting process started for you so you can get to safety and get justice. I hope things get better for you.",
      "created_utc": 1727584367.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lpg634f",
      "author": "trollcole",
      "body": "You shouldn’t be around this person. He is not trained in feeding therapy and isn’t doing it correctly. In fact trying to feed your dog food is abusive! Please tell your mom or a teacher or nurse at school! \n\nYou should at least be eating your safe foods. That I know.\n\nPlease feel brave and find help from good adults who can get this person away from you.",
      "created_utc": 1727585477.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lpghfy8",
      "author": "throwawaypatien",
      "body": "Dog food? He's making you eat *dog food*? As in actual food for dogs? \n\nUm.......report him. That's abuse.",
      "created_utc": 1727592351.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lpi5fnl",
      "author": "Enzoid23",
      "body": "If they wanted to help, they'd give you more options, let you keep the safe food, and most of all would NOT force you to eat dog food. Do you have any way to leave early?",
      "created_utc": 1727623977.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lpgugkp",
      "author": "Particular_Shift_840",
      "body": "This is straight up abuse",
      "created_utc": 1727601221.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lphz0e1",
      "author": "patrickbateperson",
      "body": "this is an actual fucking nightmare. DOG FOOD????",
      "created_utc": 1727621736.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lpkttaq",
      "author": "KingTalis",
      "body": "He is abusing you. Plain and simple. Dog food?!?",
      "created_utc": 1727655956.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lpewaug",
      "author": "Scary_Relationship57",
      "body": "girl pls get out of there, dog food?!? what is going on",
      "created_utc": 1727565669.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lpf9vu2",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1727571066.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lper34x",
      "author": "Elegant-Possession62",
      "body": "Lol",
      "created_utc": 1727563654.0,
      "score": -11,
      "context": []
    },
    {
      "id": "lpe1jzi",
      "author": "Weary_Method_8275",
      "body": "Thank you for this 🥲 My mom told him to  make sure I am eating while she is gone, I don't  want to bother my mom and I don't  want to get him in trouble. He  is an adult, and he's providing me with food still and a Place to  stay also, so i feel like I am  making a bigger deal about it because of my own issues",
      "created_utc": 1727554226.0,
      "score": 56,
      "context": [
        {
          "id": "lpdzlel",
          "author": "vorarefilia",
          "body": "You need to stay away from this person. It's clear they get off on humiliating and abusing you, contact a trusted adult and leave as soon as possible.",
          "created_utc": 1727553531.0
        }
      ]
    },
    {
      "id": "lpk7r9h",
      "author": "weamborg",
      "body": "It's even worse that he's an adult.\n\nThis is abuse. Please call your mom.",
      "created_utc": 1727647555.0,
      "score": 3,
      "context": [
        {
          "id": "lpdzlel",
          "author": "vorarefilia",
          "body": "You need to stay away from this person. It's clear they get off on humiliating and abusing you, contact a trusted adult and leave as soon as possible.",
          "created_utc": 1727553531.0
        }
      ]
    },
    {
      "id": "lpejji6",
      "author": "Throwaway-ileftthem",
      "body": "nah bro he SHOULD eat the dog food ,,",
      "created_utc": 1727560762.0,
      "score": 10,
      "context": [
        {
          "id": "lpe0a96",
          "author": "StrawbraryLiberry",
          "body": "This will probably make your ARFID worse, not better. \n\nYou are being abused & should get out of there as soon as you can. /gen\n\n....Or make your friend eat dog food to assert dominance /j",
          "created_utc": 1727553775.0
        }
      ]
    },
    {
      "id": "lpe8jcd",
      "author": "therealganjababe",
      "body": "deserve oil fade familiar foolish makeshift poor dependent mysterious overconfident\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
      "created_utc": 1727556693.0,
      "score": 17,
      "context": [
        {
          "id": "lpe1afi",
          "author": "SophiaKai",
          "body": "*Why would he make you eat dog food???* that is humiliating, degrading, and completely abusive unless you asked to be fed  dog food. You need to get as far away from this guy as you possibly can.\n\nI know you see him as your friend, but please trust us that he's not. He doesn't have your best interests at heart, he wants to control and degrade you. He would rather see you suffer than actually try to listen to you and help you. He does not respect you. He thinks you're lesser than he is (possibly lesser than human if he's making you eat dog food) bc of your arfid. You're in a dangerous situation and you need to do everything you possibly can to get out of it.",
          "created_utc": 1727554134.0
        }
      ]
    },
    {
      "id": "lpepin9",
      "author": "Weary_Method_8275",
      "body": "This is rwally insightful,  thank you for taking the time to write this🤗 I think you are really right about the autism thing, I have always felt like a target And i never know what i am doing wrong!! I texted mg mom, I will see what she says. thank you again for this :)",
      "created_utc": 1727563049.0,
      "score": 13,
      "context": [
        {
          "id": "lpe779w",
          "author": "l0stk1tten",
          "body": "You are being abused. I'm telling you now that no sane person would make anyone do that, this isn't normal.\n\nHow would your parents feel if they heard you were being fed dog food? If they would react appropriately, i.e. be horrified and take you home or at least to stay with someone safe, call them ASAP (yes ASAP, if they are normal they will want to get you out of there immediately).\n\nIf they would not back you up, that is neglect. I swear to you that you are being taken advantage of by this \"friend.\" But anyway, you still need to get out even if this is the case. Contact the police or emergency services. If you are nervous about doing this, try a social worker if you have one, a trusted aunt/uncle, your favourite teacher at school, or the guidance counsellor and they should work with you to get help.\n\nFrom one autistic person to another, unfortunately we are very likely to be victims of abuse, because even high functioning autistic people can be unaware that things are inappropriate or miss red flags, and people with bad intentions also seek us out because we are easier targets. Please take my advice seriously, you have to protect yourself.",
          "created_utc": 1727556228.0
        }
      ]
    },
    {
      "id": "lpeocjy",
      "author": "Weary_Method_8275",
      "body": "Thank you for this nice comment. It means a lot to me😊 To clarify,  my mom isn't  at home for a few weeks, so I'm staying at a family friend's  place. He lives Alone he is an adult, we are only friends because he used to babysit me a lot when we were younger, although  he hasn't always acted platonic towards me , so I realize that this might be strange dynamicf",
      "created_utc": 1727562595.0,
      "score": 7,
      "context": [
        {
          "id": "lpejkho",
          "author": "two-of-me",
          "body": "Dog food? What is your “friend’s” problem? Dog food is for dogs and this is abhorrent behavior from another person. \n\nWhy are you not allowed back at home? You’re a minor and your parents/guardians have a legal obligation to house you until you’re 18. \n\nWhere are your friend’s parents and are they allowing you to be served dog food? I am so sorry this whole situation is happening. This is so awful.",
          "created_utc": 1727560773.0
        }
      ]
    },
    {
      "id": "lpezwbf",
      "author": "pixelpusheen",
      "body": "exactly, no friend who truly cares about you is gonna do that to you.",
      "created_utc": 1727567093.0,
      "score": 7,
      "context": [
        {
          "id": "lpea4si",
          "author": "giraffemoo",
          "body": "Not your friend.",
          "created_utc": 1727557264.0
        }
      ]
    },
    {
      "id": "lpesf95",
      "author": "InterestingTurn5198",
      "body": "It's not a safe environment and yelling could escalate the abuse. This is not good advice. Please tell your mum and other adults and try to get out of there without giving him a clue about what you're up to.",
      "created_utc": 1727564165.0,
      "score": 8,
      "context": [
        {
          "id": "lpdygvp",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1727553138.0
        }
      ]
    },
    {
      "id": "lpgs3t8",
      "author": "CynicismNostalgia",
      "body": "You're a very brave person for thinking a 17 year old girl can scream at an abusive man without negative repercussions",
      "created_utc": 1727599562.0,
      "score": 1,
      "context": [
        {
          "id": "lpdygvp",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1727553138.0
        }
      ]
    },
    {
      "id": "lpiylas",
      "author": "None",
      "body": "Honestly, I thought this, but I am on the fence because there are some people who HATE “picky eaters” and will pretend that something that is disgusting is not disgusting or make something unnecessarily disgusting so that “regular” foods don’t seem so bad. They completely don’t understand ARFID and don’t want to try. They just really do not want to cater to anyone’s needs; it’s a control problem and they want whatever they cook to be eaten at any time.",
      "created_utc": 1727633145.0,
      "score": 1,
      "context": [
        {
          "id": "lpf9vu2",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1727571066.0
        }
      ]
    },
    {
      "id": "lpez7j6",
      "author": "pixelpusheen",
      "body": "What's so funny?",
      "created_utc": 1727566818.0,
      "score": 2,
      "context": [
        {
          "id": "lper34x",
          "author": "Elegant-Possession62",
          "body": "Lol",
          "created_utc": 1727563654.0
        }
      ]
    },
    {
      "id": "lpgs9sk",
      "author": "CynicismNostalgia",
      "body": "Gotta say, I find something ironic about a person who has no clue about ARFID, coming in here to mock. \n\nWhen they themselves are one of those Ozempic basic bitches, that steal diabetic medication from people that need it, because they're too lazy to diet and exercise.\n\n\nAlso: just gonna beat you to the punch here for when you see this and feel offended. \n\n\"Oooh nooo! Did someone misrepresent and mock YOUR condition? What a shame. I wonder if you've ever done that to someone yourself?\"",
      "created_utc": 1727599679.0,
      "score": 2,
      "context": [
        {
          "id": "lper34x",
          "author": "Elegant-Possession62",
          "body": "Lol",
          "created_utc": 1727563654.0
        }
      ]
    },
    {
      "id": "lpe2ntt",
      "author": "vorarefilia",
      "body": "It's absolutely a very big deal! Who the hell gives DOG FOOD to a child?? A sadistic sob, that's who. If you can, tell your mom (possibly via text so that he can't catch onto you telling on him) and avoid confrontation at all cost: I can't even IMAGINE what someone like that is capable of doing. Please be safe, you have every right to be uncomfortable! He doesn't have the right to abuse you because he's providing you with shelter! I'm enraged on your behalf.",
      "created_utc": 1727554618.0,
      "score": 139,
      "context": [
        {
          "id": "lpdzlel",
          "author": "vorarefilia",
          "body": "You need to stay away from this person. It's clear they get off on humiliating and abusing you, contact a trusted adult and leave as soon as possible.",
          "created_utc": 1727553531.0
        },
        {
          "id": "lpe1jzi",
          "author": "Weary_Method_8275",
          "body": "Thank you for this 🥲 My mom told him to  make sure I am eating while she is gone, I don't  want to bother my mom and I don't  want to get him in trouble. He  is an adult, and he's providing me with food still and a Place to  stay also, so i feel like I am  making a bigger deal about it because of my own issues",
          "created_utc": 1727554226.0
        }
      ]
    },
    {
      "id": "lpe6jj6",
      "author": "LadySilverdragon",
      "body": "As a mom, I would absolutely be heartbroken if my kid didn’t tell me they were being abused like this. This is awful. Please alert everyone. This is beyond an emergency. \n\nAlso, as a social worker, this approach will not only NOT help you, but could cause a serious setback in your efforts to keep up a healthy weight. Even if this person meant well, which they do NOT, they are harming you.",
      "created_utc": 1727555995.0,
      "score": 51,
      "context": [
        {
          "id": "lpdzlel",
          "author": "vorarefilia",
          "body": "You need to stay away from this person. It's clear they get off on humiliating and abusing you, contact a trusted adult and leave as soon as possible.",
          "created_utc": 1727553531.0
        },
        {
          "id": "lpe1jzi",
          "author": "Weary_Method_8275",
          "body": "Thank you for this 🥲 My mom told him to  make sure I am eating while she is gone, I don't  want to bother my mom and I don't  want to get him in trouble. He  is an adult, and he's providing me with food still and a Place to  stay also, so i feel like I am  making a bigger deal about it because of my own issues",
          "created_utc": 1727554226.0
        }
      ]
    },
    {
      "id": "lpe439m",
      "author": "meitanteis",
      "body": "you are not making a bigger deal out of it, this IS a big deal. please trust the comments here and speak to a trusted adult about this as they should want to make you the most comfortable and feel safe where you're staying. food is such an integral part of our lives, you shouldn't have to be subject to even more pressure from someone who doesn't understand your feelings. you especially shouldnt be subject to someone with no professional experience or licensing trying to \"cure you,\" that is not ok!\n\nedit: also note that you are not getting him in trouble. if he faces consequences they are for his actions and his actions alone - you do not have to suffer for the sake of others' comfort",
      "created_utc": 1727555130.0,
      "score": 37,
      "context": [
        {
          "id": "lpdzlel",
          "author": "vorarefilia",
          "body": "You need to stay away from this person. It's clear they get off on humiliating and abusing you, contact a trusted adult and leave as soon as possible.",
          "created_utc": 1727553531.0
        },
        {
          "id": "lpe1jzi",
          "author": "Weary_Method_8275",
          "body": "Thank you for this 🥲 My mom told him to  make sure I am eating while she is gone, I don't  want to bother my mom and I don't  want to get him in trouble. He  is an adult, and he's providing me with food still and a Place to  stay also, so i feel like I am  making a bigger deal about it because of my own issues",
          "created_utc": 1727554226.0
        }
      ]
    },
    {
      "id": "lpflsdy",
      "author": "axw3555",
      "body": "Honestly, you’re in the region where it’s outright abuse and you could seriously consider calling the police or social services to get out of there.\n\nDon’t devalue yourself. You’re a person. He says he’s helping you but *he is abusing you*. You may not want to bother your mother, but if she’s a good parent, she’ll see it as more of a problem if you don’t call her.",
      "created_utc": 1727575976.0,
      "score": 13,
      "context": [
        {
          "id": "lpdzlel",
          "author": "vorarefilia",
          "body": "You need to stay away from this person. It's clear they get off on humiliating and abusing you, contact a trusted adult and leave as soon as possible.",
          "created_utc": 1727553531.0
        },
        {
          "id": "lpe1jzi",
          "author": "Weary_Method_8275",
          "body": "Thank you for this 🥲 My mom told him to  make sure I am eating while she is gone, I don't  want to bother my mom and I don't  want to get him in trouble. He  is an adult, and he's providing me with food still and a Place to  stay also, so i feel like I am  making a bigger deal about it because of my own issues",
          "created_utc": 1727554226.0
        }
      ]
    },
    {
      "id": "lpipbtf",
      "author": "None",
      "body": "Yes. There are some people who have a distain for what they think are “picky eaters” and go out of their way to torture them.",
      "created_utc": 1727630389.0,
      "score": 1,
      "context": [
        {
          "id": "lpe1afi",
          "author": "SophiaKai",
          "body": "*Why would he make you eat dog food???* that is humiliating, degrading, and completely abusive unless you asked to be fed  dog food. You need to get as far away from this guy as you possibly can.\n\nI know you see him as your friend, but please trust us that he's not. He doesn't have your best interests at heart, he wants to control and degrade you. He would rather see you suffer than actually try to listen to you and help you. He does not respect you. He thinks you're lesser than he is (possibly lesser than human if he's making you eat dog food) bc of your arfid. You're in a dangerous situation and you need to do everything you possibly can to get out of it.",
          "created_utc": 1727554134.0
        },
        {
          "id": "lpe8jcd",
          "author": "therealganjababe",
          "body": "deserve oil fade familiar foolish makeshift poor dependent mysterious overconfident\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
          "created_utc": 1727556693.0
        }
      ]
    },
    {
      "id": "lpetwz1",
      "author": "Mageaz",
      "body": "Does your mom know about this \"not always acted platonic\" business? And what do you mean by that? How old is he? \nAnd you need to specifically tell your mom that he is feeding you dog food, not just that he won't give you safe foods. She needs to know about the dog food. And if she doesn't know about him not acting platonic towards you, she needs to know that too. This is not a good situation OP. Feeding a person dog food is strange and gross and sounds abusive and fetishy.",
      "created_utc": 1727564739.0,
      "score": 16,
      "context": [
        {
          "id": "lpejkho",
          "author": "two-of-me",
          "body": "Dog food? What is your “friend’s” problem? Dog food is for dogs and this is abhorrent behavior from another person. \n\nWhy are you not allowed back at home? You’re a minor and your parents/guardians have a legal obligation to house you until you’re 18. \n\nWhere are your friend’s parents and are they allowing you to be served dog food? I am so sorry this whole situation is happening. This is so awful.",
          "created_utc": 1727560773.0
        },
        {
          "id": "lpeocjy",
          "author": "Weary_Method_8275",
          "body": "Thank you for this nice comment. It means a lot to me😊 To clarify,  my mom isn't  at home for a few weeks, so I'm staying at a family friend's  place. He lives Alone he is an adult, we are only friends because he used to babysit me a lot when we were younger, although  he hasn't always acted platonic towards me , so I realize that this might be strange dynamicf",
          "created_utc": 1727562595.0
        }
      ]
    },
    {
      "id": "lpep4e3",
      "author": "two-of-me",
      "body": "This is a terrible situation for you to be in. Do you have any other family in the area you can stay with until your mom gets home? Aunts uncles cousins anyone? Family friends? \n\nDoes your mom know this person is trying to feed you dog food?",
      "created_utc": 1727562895.0,
      "score": 5,
      "context": [
        {
          "id": "lpejkho",
          "author": "two-of-me",
          "body": "Dog food? What is your “friend’s” problem? Dog food is for dogs and this is abhorrent behavior from another person. \n\nWhy are you not allowed back at home? You’re a minor and your parents/guardians have a legal obligation to house you until you’re 18. \n\nWhere are your friend’s parents and are they allowing you to be served dog food? I am so sorry this whole situation is happening. This is so awful.",
          "created_utc": 1727560773.0
        },
        {
          "id": "lpeocjy",
          "author": "Weary_Method_8275",
          "body": "Thank you for this nice comment. It means a lot to me😊 To clarify,  my mom isn't  at home for a few weeks, so I'm staying at a family friend's  place. He lives Alone he is an adult, we are only friends because he used to babysit me a lot when we were younger, although  he hasn't always acted platonic towards me , so I realize that this might be strange dynamicf",
          "created_utc": 1727562595.0
        }
      ]
    },
    {
      "id": "lpgjg6s",
      "author": "Elegant-Possession62",
      "body": "“My friend is depriving me of food but i know i should be grateful”\n\n“Dog food is disgusting what is wrong with me”\n\n???",
      "created_utc": 1727593651.0,
      "score": -1,
      "context": [
        {
          "id": "lper34x",
          "author": "Elegant-Possession62",
          "body": "Lol",
          "created_utc": 1727563654.0
        },
        {
          "id": "lpez7j6",
          "author": "pixelpusheen",
          "body": "What's so funny?",
          "created_utc": 1727566818.0
        }
      ]
    },
    {
      "id": "lpgt2dm",
      "author": "Elegant-Possession62",
      "body": "I have arfid, im not stealing medication, and im still dieting and exercising thanks :)",
      "created_utc": 1727600237.0,
      "score": -2,
      "context": [
        {
          "id": "lper34x",
          "author": "Elegant-Possession62",
          "body": "Lol",
          "created_utc": 1727563654.0
        },
        {
          "id": "lpgs9sk",
          "author": "CynicismNostalgia",
          "body": "Gotta say, I find something ironic about a person who has no clue about ARFID, coming in here to mock. \n\nWhen they themselves are one of those Ozempic basic bitches, that steal diabetic medication from people that need it, because they're too lazy to diet and exercise.\n\n\nAlso: just gonna beat you to the punch here for when you see this and feel offended. \n\n\"Oooh nooo! Did someone misrepresent and mock YOUR condition? What a shame. I wonder if you've ever done that to someone yourself?\"",
          "created_utc": 1727599679.0
        }
      ]
    },
    {
      "id": "lpeecuz",
      "author": "Weary_Method_8275",
      "body": "Thank you so much, I think that you're right, I don't feel that  safe here. I'll text my mom and see what she  says. thanks again for your Advice, it is hard to make sense of on my own, but these comments are  helping to put into perspective🤗",
      "created_utc": 1727558808.0,
      "score": 56,
      "context": [
        {
          "id": "lpdzlel",
          "author": "vorarefilia",
          "body": "You need to stay away from this person. It's clear they get off on humiliating and abusing you, contact a trusted adult and leave as soon as possible.",
          "created_utc": 1727553531.0
        },
        {
          "id": "lpe1jzi",
          "author": "Weary_Method_8275",
          "body": "Thank you for this 🥲 My mom told him to  make sure I am eating while she is gone, I don't  want to bother my mom and I don't  want to get him in trouble. He  is an adult, and he's providing me with food still and a Place to  stay also, so i feel like I am  making a bigger deal about it because of my own issues",
          "created_utc": 1727554226.0
        },
        {
          "id": "lpe2ntt",
          "author": "vorarefilia",
          "body": "It's absolutely a very big deal! Who the hell gives DOG FOOD to a child?? A sadistic sob, that's who. If you can, tell your mom (possibly via text so that he can't catch onto you telling on him) and avoid confrontation at all cost: I can't even IMAGINE what someone like that is capable of doing. Please be safe, you have every right to be uncomfortable! He doesn't have the right to abuse you because he's providing you with shelter! I'm enraged on your behalf.",
          "created_utc": 1727554618.0
        }
      ]
    },
    {
      "id": "lpip1hx",
      "author": "None",
      "body": "Exactly. Dog food would make ARFID worse. Traumatic food experiences just worsen ARFID.",
      "created_utc": 1727630299.0,
      "score": 8,
      "context": [
        {
          "id": "lpdzlel",
          "author": "vorarefilia",
          "body": "You need to stay away from this person. It's clear they get off on humiliating and abusing you, contact a trusted adult and leave as soon as possible.",
          "created_utc": 1727553531.0
        },
        {
          "id": "lpe1jzi",
          "author": "Weary_Method_8275",
          "body": "Thank you for this 🥲 My mom told him to  make sure I am eating while she is gone, I don't  want to bother my mom and I don't  want to get him in trouble. He  is an adult, and he's providing me with food still and a Place to  stay also, so i feel like I am  making a bigger deal about it because of my own issues",
          "created_utc": 1727554226.0
        },
        {
          "id": "lpe2ntt",
          "author": "vorarefilia",
          "body": "It's absolutely a very big deal! Who the hell gives DOG FOOD to a child?? A sadistic sob, that's who. If you can, tell your mom (possibly via text so that he can't catch onto you telling on him) and avoid confrontation at all cost: I can't even IMAGINE what someone like that is capable of doing. Please be safe, you have every right to be uncomfortable! He doesn't have the right to abuse you because he's providing you with shelter! I'm enraged on your behalf.",
          "created_utc": 1727554618.0
        }
      ]
    },
    {
      "id": "lpf15g8",
      "author": "Weary_Method_8275",
      "body": "He's 23. I don't know how much i can say  on here,  he  just did inappropriate or violent stuff, but he's gotten  better since then. I texted my mom about the dog food, she hasn't seen it  yet. She didn't know about the weird stuff, but  I'll try to tell her. It's just really Scary for  some reason, It's hard to even vaguely type About in this comment🫠 Thank you for your reply",
      "created_utc": 1727567592.0,
      "score": 10,
      "context": [
        {
          "id": "lpejkho",
          "author": "two-of-me",
          "body": "Dog food? What is your “friend’s” problem? Dog food is for dogs and this is abhorrent behavior from another person. \n\nWhy are you not allowed back at home? You’re a minor and your parents/guardians have a legal obligation to house you until you’re 18. \n\nWhere are your friend’s parents and are they allowing you to be served dog food? I am so sorry this whole situation is happening. This is so awful.",
          "created_utc": 1727560773.0
        },
        {
          "id": "lpeocjy",
          "author": "Weary_Method_8275",
          "body": "Thank you for this nice comment. It means a lot to me😊 To clarify,  my mom isn't  at home for a few weeks, so I'm staying at a family friend's  place. He lives Alone he is an adult, we are only friends because he used to babysit me a lot when we were younger, although  he hasn't always acted platonic towards me , so I realize that this might be strange dynamicf",
          "created_utc": 1727562595.0
        },
        {
          "id": "lpetwz1",
          "author": "Mageaz",
          "body": "Does your mom know about this \"not always acted platonic\" business? And what do you mean by that? How old is he? \nAnd you need to specifically tell your mom that he is feeding you dog food, not just that he won't give you safe foods. She needs to know about the dog food. And if she doesn't know about him not acting platonic towards you, she needs to know that too. This is not a good situation OP. Feeding a person dog food is strange and gross and sounds abusive and fetishy.",
          "created_utc": 1727564739.0
        }
      ]
    },
    {
      "id": "lpexlx5",
      "author": "Weary_Method_8275",
      "body": "I don't know, all of my family lives far away, but I texted my mom. Hopefully she  can help him to understand. Thank you friend",
      "created_utc": 1727566182.0,
      "score": 1,
      "context": [
        {
          "id": "lpejkho",
          "author": "two-of-me",
          "body": "Dog food? What is your “friend’s” problem? Dog food is for dogs and this is abhorrent behavior from another person. \n\nWhy are you not allowed back at home? You’re a minor and your parents/guardians have a legal obligation to house you until you’re 18. \n\nWhere are your friend’s parents and are they allowing you to be served dog food? I am so sorry this whole situation is happening. This is so awful.",
          "created_utc": 1727560773.0
        },
        {
          "id": "lpeocjy",
          "author": "Weary_Method_8275",
          "body": "Thank you for this nice comment. It means a lot to me😊 To clarify,  my mom isn't  at home for a few weeks, so I'm staying at a family friend's  place. He lives Alone he is an adult, we are only friends because he used to babysit me a lot when we were younger, although  he hasn't always acted platonic towards me , so I realize that this might be strange dynamicf",
          "created_utc": 1727562595.0
        },
        {
          "id": "lpep4e3",
          "author": "two-of-me",
          "body": "This is a terrible situation for you to be in. Do you have any other family in the area you can stay with until your mom gets home? Aunts uncles cousins anyone? Family friends? \n\nDoes your mom know this person is trying to feed you dog food?",
          "created_utc": 1727562895.0
        }
      ]
    },
    {
      "id": "lpgtajz",
      "author": "CynicismNostalgia",
      "body": "Jesus that's even worse sorry. If you have ARFID then you'd know the unfortunate dilemma that might come with, say, technically finding dog food more palettable than a human meal. That logic goes out the window and we can't control what does and does not make us gag and heave. \n\nHonestly you were better off as ignorant. Now you're just mean. Have fun with that",
      "created_utc": 1727600395.0,
      "score": 3,
      "context": [
        {
          "id": "lper34x",
          "author": "Elegant-Possession62",
          "body": "Lol",
          "created_utc": 1727563654.0
        },
        {
          "id": "lpgs9sk",
          "author": "CynicismNostalgia",
          "body": "Gotta say, I find something ironic about a person who has no clue about ARFID, coming in here to mock. \n\nWhen they themselves are one of those Ozempic basic bitches, that steal diabetic medication from people that need it, because they're too lazy to diet and exercise.\n\n\nAlso: just gonna beat you to the punch here for when you see this and feel offended. \n\n\"Oooh nooo! Did someone misrepresent and mock YOUR condition? What a shame. I wonder if you've ever done that to someone yourself?\"",
          "created_utc": 1727599679.0
        },
        {
          "id": "lpgt2dm",
          "author": "Elegant-Possession62",
          "body": "I have arfid, im not stealing medication, and im still dieting and exercising thanks :)",
          "created_utc": 1727600237.0
        }
      ]
    },
    {
      "id": "lpef7ou",
      "author": "vorarefilia",
      "body": "Please if you feel OK doing so update us when you're safe 💚",
      "created_utc": 1727559128.0,
      "score": 28,
      "context": [
        {
          "id": "lpdzlel",
          "author": "vorarefilia",
          "body": "You need to stay away from this person. It's clear they get off on humiliating and abusing you, contact a trusted adult and leave as soon as possible.",
          "created_utc": 1727553531.0
        },
        {
          "id": "lpe1jzi",
          "author": "Weary_Method_8275",
          "body": "Thank you for this 🥲 My mom told him to  make sure I am eating while she is gone, I don't  want to bother my mom and I don't  want to get him in trouble. He  is an adult, and he's providing me with food still and a Place to  stay also, so i feel like I am  making a bigger deal about it because of my own issues",
          "created_utc": 1727554226.0
        },
        {
          "id": "lpe2ntt",
          "author": "vorarefilia",
          "body": "It's absolutely a very big deal! Who the hell gives DOG FOOD to a child?? A sadistic sob, that's who. If you can, tell your mom (possibly via text so that he can't catch onto you telling on him) and avoid confrontation at all cost: I can't even IMAGINE what someone like that is capable of doing. Please be safe, you have every right to be uncomfortable! He doesn't have the right to abuse you because he's providing you with shelter! I'm enraged on your behalf.",
          "created_utc": 1727554618.0
        },
        {
          "id": "lpeecuz",
          "author": "Weary_Method_8275",
          "body": "Thank you so much, I think that you're right, I don't feel that  safe here. I'll text my mom and see what she  says. thanks again for your Advice, it is hard to make sense of on my own, but these comments are  helping to put into perspective🤗",
          "created_utc": 1727558808.0
        }
      ]
    },
    {
      "id": "lpeweiw",
      "author": "Scary_Relationship57",
      "body": "yes bestie pls pls tell her",
      "created_utc": 1727565708.0,
      "score": 8,
      "context": [
        {
          "id": "lpdzlel",
          "author": "vorarefilia",
          "body": "You need to stay away from this person. It's clear they get off on humiliating and abusing you, contact a trusted adult and leave as soon as possible.",
          "created_utc": 1727553531.0
        },
        {
          "id": "lpe1jzi",
          "author": "Weary_Method_8275",
          "body": "Thank you for this 🥲 My mom told him to  make sure I am eating while she is gone, I don't  want to bother my mom and I don't  want to get him in trouble. He  is an adult, and he's providing me with food still and a Place to  stay also, so i feel like I am  making a bigger deal about it because of my own issues",
          "created_utc": 1727554226.0
        },
        {
          "id": "lpe2ntt",
          "author": "vorarefilia",
          "body": "It's absolutely a very big deal! Who the hell gives DOG FOOD to a child?? A sadistic sob, that's who. If you can, tell your mom (possibly via text so that he can't catch onto you telling on him) and avoid confrontation at all cost: I can't even IMAGINE what someone like that is capable of doing. Please be safe, you have every right to be uncomfortable! He doesn't have the right to abuse you because he's providing you with shelter! I'm enraged on your behalf.",
          "created_utc": 1727554618.0
        },
        {
          "id": "lpeecuz",
          "author": "Weary_Method_8275",
          "body": "Thank you so much, I think that you're right, I don't feel that  safe here. I'll text my mom and see what she  says. thanks again for your Advice, it is hard to make sense of on my own, but these comments are  helping to put into perspective🤗",
          "created_utc": 1727558808.0
        }
      ]
    },
    {
      "id": "lpfsgot",
      "author": "xthxthaoiw",
      "body": "Are you a girl? Either way, it's not appropriate to leave a 17 year old in the care of a 23 year old over night, but if you're a girl it's such an obviously terrible idea.\n\nIf your mum still hasn't responded, you need to contact another adult, or the police.",
      "created_utc": 1727578853.0,
      "score": 8,
      "context": [
        {
          "id": "lpejkho",
          "author": "two-of-me",
          "body": "Dog food? What is your “friend’s” problem? Dog food is for dogs and this is abhorrent behavior from another person. \n\nWhy are you not allowed back at home? You’re a minor and your parents/guardians have a legal obligation to house you until you’re 18. \n\nWhere are your friend’s parents and are they allowing you to be served dog food? I am so sorry this whole situation is happening. This is so awful.",
          "created_utc": 1727560773.0
        },
        {
          "id": "lpeocjy",
          "author": "Weary_Method_8275",
          "body": "Thank you for this nice comment. It means a lot to me😊 To clarify,  my mom isn't  at home for a few weeks, so I'm staying at a family friend's  place. He lives Alone he is an adult, we are only friends because he used to babysit me a lot when we were younger, although  he hasn't always acted platonic towards me , so I realize that this might be strange dynamicf",
          "created_utc": 1727562595.0
        },
        {
          "id": "lpetwz1",
          "author": "Mageaz",
          "body": "Does your mom know about this \"not always acted platonic\" business? And what do you mean by that? How old is he? \nAnd you need to specifically tell your mom that he is feeding you dog food, not just that he won't give you safe foods. She needs to know about the dog food. And if she doesn't know about him not acting platonic towards you, she needs to know that too. This is not a good situation OP. Feeding a person dog food is strange and gross and sounds abusive and fetishy.",
          "created_utc": 1727564739.0
        },
        {
          "id": "lpf15g8",
          "author": "Weary_Method_8275",
          "body": "He's 23. I don't know how much i can say  on here,  he  just did inappropriate or violent stuff, but he's gotten  better since then. I texted my mom about the dog food, she hasn't seen it  yet. She didn't know about the weird stuff, but  I'll try to tell her. It's just really Scary for  some reason, It's hard to even vaguely type About in this comment🫠 Thank you for your reply",
          "created_utc": 1727567592.0
        }
      ]
    },
    {
      "id": "lpfoplb",
      "author": "PetriMagyk",
      "body": "It sounds like your gut (pun not intended) is telling you something isn’t right and that’s why it’s scary and hard to talk about, and from what you’ve said it sounds like that’s very true! It’s shouldn’t feel ok. And while that makes it hard to tell people about, it also means it’s very important that you do. \n\nEven if you didn’t have ARFID or any food related issues, trying to feed you dog food is not okay. That’s abuse, full stop. And it sounds like this person’s other behavior is not safe for you either. \n\nProud of you for telling your mom & asking for help ❤️. Are you in school? Do you have any friends your age whose family you could possibly stay with? Or any teachers or counselors you can talk to? This should be taken seriously, even if it feels like you’re “causing issues”; the real issue is this person’s treatment of you!\n\nStay safe ❤️",
      "created_utc": 1727577220.0,
      "score": 6,
      "context": [
        {
          "id": "lpejkho",
          "author": "two-of-me",
          "body": "Dog food? What is your “friend’s” problem? Dog food is for dogs and this is abhorrent behavior from another person. \n\nWhy are you not allowed back at home? You’re a minor and your parents/guardians have a legal obligation to house you until you’re 18. \n\nWhere are your friend’s parents and are they allowing you to be served dog food? I am so sorry this whole situation is happening. This is so awful.",
          "created_utc": 1727560773.0
        },
        {
          "id": "lpeocjy",
          "author": "Weary_Method_8275",
          "body": "Thank you for this nice comment. It means a lot to me😊 To clarify,  my mom isn't  at home for a few weeks, so I'm staying at a family friend's  place. He lives Alone he is an adult, we are only friends because he used to babysit me a lot when we were younger, although  he hasn't always acted platonic towards me , so I realize that this might be strange dynamicf",
          "created_utc": 1727562595.0
        },
        {
          "id": "lpetwz1",
          "author": "Mageaz",
          "body": "Does your mom know about this \"not always acted platonic\" business? And what do you mean by that? How old is he? \nAnd you need to specifically tell your mom that he is feeding you dog food, not just that he won't give you safe foods. She needs to know about the dog food. And if she doesn't know about him not acting platonic towards you, she needs to know that too. This is not a good situation OP. Feeding a person dog food is strange and gross and sounds abusive and fetishy.",
          "created_utc": 1727564739.0
        },
        {
          "id": "lpf15g8",
          "author": "Weary_Method_8275",
          "body": "He's 23. I don't know how much i can say  on here,  he  just did inappropriate or violent stuff, but he's gotten  better since then. I texted my mom about the dog food, she hasn't seen it  yet. She didn't know about the weird stuff, but  I'll try to tell her. It's just really Scary for  some reason, It's hard to even vaguely type About in this comment🫠 Thank you for your reply",
          "created_utc": 1727567592.0
        }
      ]
    },
    {
      "id": "lpft198",
      "author": "therealganjababe",
      "body": "No, no no no. No one is protecting you, they are taking advantage of a vulnerable person they can abuse!! You obvs see that you are being mistreated, and maybe you feel you deserve it, or it's the only life you will have because of your issues, but you are **wrong**.\n\n I am devastated by your situation, please, I'm not joking, send me some basic info so I can help you!!! I would legit take you into my home rn, but the best thing to do is immediately call the appropriate people to help you.\n\nPlease idk how to make you understand that there is such a better life for you, plz don't think that because you are different, you don't deserve anything better than these people taking advantage of you. \n\nPlz plz plz message me, let's get you some help friend.",
      "created_utc": 1727579108.0,
      "score": 5,
      "context": [
        {
          "id": "lpejkho",
          "author": "two-of-me",
          "body": "Dog food? What is your “friend’s” problem? Dog food is for dogs and this is abhorrent behavior from another person. \n\nWhy are you not allowed back at home? You’re a minor and your parents/guardians have a legal obligation to house you until you’re 18. \n\nWhere are your friend’s parents and are they allowing you to be served dog food? I am so sorry this whole situation is happening. This is so awful.",
          "created_utc": 1727560773.0
        },
        {
          "id": "lpeocjy",
          "author": "Weary_Method_8275",
          "body": "Thank you for this nice comment. It means a lot to me😊 To clarify,  my mom isn't  at home for a few weeks, so I'm staying at a family friend's  place. He lives Alone he is an adult, we are only friends because he used to babysit me a lot when we were younger, although  he hasn't always acted platonic towards me , so I realize that this might be strange dynamicf",
          "created_utc": 1727562595.0
        },
        {
          "id": "lpetwz1",
          "author": "Mageaz",
          "body": "Does your mom know about this \"not always acted platonic\" business? And what do you mean by that? How old is he? \nAnd you need to specifically tell your mom that he is feeding you dog food, not just that he won't give you safe foods. She needs to know about the dog food. And if she doesn't know about him not acting platonic towards you, she needs to know that too. This is not a good situation OP. Feeding a person dog food is strange and gross and sounds abusive and fetishy.",
          "created_utc": 1727564739.0
        },
        {
          "id": "lpf15g8",
          "author": "Weary_Method_8275",
          "body": "He's 23. I don't know how much i can say  on here,  he  just did inappropriate or violent stuff, but he's gotten  better since then. I texted my mom about the dog food, she hasn't seen it  yet. She didn't know about the weird stuff, but  I'll try to tell her. It's just really Scary for  some reason, It's hard to even vaguely type About in this comment🫠 Thank you for your reply",
          "created_utc": 1727567592.0
        }
      ]
    },
    {
      "id": "lpgs1kz",
      "author": "CynicismNostalgia",
      "body": "Your mum should not be GETTING HIM TO UNDERSTAND. \n\nyou've said in previous comments that he has physically abused you before and was previously your babysitter.\n\n Girl no.\n\n Tell the authorities exactly what happened. Get a RESTRAINING order on that man. I'm sorry to say it but this isn't even about your ARFID anymore. It's far beyond that. \n\nTake it from someone with ARFID who was also abused, Get yourself OUT of that situation, don't rely on family, because it sounds like they minimise your experiences. Go to the authorities, and then find an adult you can really trust and explain what is going on.",
      "created_utc": 1727599517.0,
      "score": 7,
      "context": [
        {
          "id": "lpejkho",
          "author": "two-of-me",
          "body": "Dog food? What is your “friend’s” problem? Dog food is for dogs and this is abhorrent behavior from another person. \n\nWhy are you not allowed back at home? You’re a minor and your parents/guardians have a legal obligation to house you until you’re 18. \n\nWhere are your friend’s parents and are they allowing you to be served dog food? I am so sorry this whole situation is happening. This is so awful.",
          "created_utc": 1727560773.0
        },
        {
          "id": "lpeocjy",
          "author": "Weary_Method_8275",
          "body": "Thank you for this nice comment. It means a lot to me😊 To clarify,  my mom isn't  at home for a few weeks, so I'm staying at a family friend's  place. He lives Alone he is an adult, we are only friends because he used to babysit me a lot when we were younger, although  he hasn't always acted platonic towards me , so I realize that this might be strange dynamicf",
          "created_utc": 1727562595.0
        },
        {
          "id": "lpep4e3",
          "author": "two-of-me",
          "body": "This is a terrible situation for you to be in. Do you have any other family in the area you can stay with until your mom gets home? Aunts uncles cousins anyone? Family friends? \n\nDoes your mom know this person is trying to feed you dog food?",
          "created_utc": 1727562895.0
        },
        {
          "id": "lpexlx5",
          "author": "Weary_Method_8275",
          "body": "I don't know, all of my family lives far away, but I texted my mom. Hopefully she  can help him to understand. Thank you friend",
          "created_utc": 1727566182.0
        }
      ]
    },
    {
      "id": "lpfswlp",
      "author": "xthxthaoiw",
      "body": "Make sure that you have your phone ln you, so that he can't take it. He is abusive and there is a risk that he will harm you for telling on him. Your mother shouldn't try to make him understand – he *knows* that he is abusing you – she should be coming to pick you up. And neither of you should tell him that your mother is coming. You cannot trust that this man isn't capable of, and willing, to harm you in even worse ways. Treat this as what it is: a dangerous, abusive situation that you need to escape from.",
      "created_utc": 1727579050.0,
      "score": 2,
      "context": [
        {
          "id": "lpejkho",
          "author": "two-of-me",
          "body": "Dog food? What is your “friend’s” problem? Dog food is for dogs and this is abhorrent behavior from another person. \n\nWhy are you not allowed back at home? You’re a minor and your parents/guardians have a legal obligation to house you until you’re 18. \n\nWhere are your friend’s parents and are they allowing you to be served dog food? I am so sorry this whole situation is happening. This is so awful.",
          "created_utc": 1727560773.0
        },
        {
          "id": "lpeocjy",
          "author": "Weary_Method_8275",
          "body": "Thank you for this nice comment. It means a lot to me😊 To clarify,  my mom isn't  at home for a few weeks, so I'm staying at a family friend's  place. He lives Alone he is an adult, we are only friends because he used to babysit me a lot when we were younger, although  he hasn't always acted platonic towards me , so I realize that this might be strange dynamicf",
          "created_utc": 1727562595.0
        },
        {
          "id": "lpep4e3",
          "author": "two-of-me",
          "body": "This is a terrible situation for you to be in. Do you have any other family in the area you can stay with until your mom gets home? Aunts uncles cousins anyone? Family friends? \n\nDoes your mom know this person is trying to feed you dog food?",
          "created_utc": 1727562895.0
        },
        {
          "id": "lpexlx5",
          "author": "Weary_Method_8275",
          "body": "I don't know, all of my family lives far away, but I texted my mom. Hopefully she  can help him to understand. Thank you friend",
          "created_utc": 1727566182.0
        }
      ]
    },
    {
      "id": "lpgtj1v",
      "author": "Elegant-Possession62",
      "body": "Clearly reading comprehension isnt your thing, but i never mocked the arfid component and you still havent seemed to grasp that. Is it mean of me to laugh when people stay in comical situations? Maybe.",
      "created_utc": 1727600563.0,
      "score": -2,
      "context": [
        {
          "id": "lper34x",
          "author": "Elegant-Possession62",
          "body": "Lol",
          "created_utc": 1727563654.0
        },
        {
          "id": "lpgs9sk",
          "author": "CynicismNostalgia",
          "body": "Gotta say, I find something ironic about a person who has no clue about ARFID, coming in here to mock. \n\nWhen they themselves are one of those Ozempic basic bitches, that steal diabetic medication from people that need it, because they're too lazy to diet and exercise.\n\n\nAlso: just gonna beat you to the punch here for when you see this and feel offended. \n\n\"Oooh nooo! Did someone misrepresent and mock YOUR condition? What a shame. I wonder if you've ever done that to someone yourself?\"",
          "created_utc": 1727599679.0
        },
        {
          "id": "lpgt2dm",
          "author": "Elegant-Possession62",
          "body": "I have arfid, im not stealing medication, and im still dieting and exercising thanks :)",
          "created_utc": 1727600237.0
        },
        {
          "id": "lpgtajz",
          "author": "CynicismNostalgia",
          "body": "Jesus that's even worse sorry. If you have ARFID then you'd know the unfortunate dilemma that might come with, say, technically finding dog food more palettable than a human meal. That logic goes out the window and we can't control what does and does not make us gag and heave. \n\nHonestly you were better off as ignorant. Now you're just mean. Have fun with that",
          "created_utc": 1727600395.0
        }
      ]
    },
    {
      "id": "lpgtu9c",
      "author": "CynicismNostalgia",
      "body": "Yes. Yes it is mean to laugh at a 17 year old girl trapped with her former abusive babysitter. It's mean to laugh at her degradation when she realised her ARFID is so intense, she could eat dog food but not chicken. \n\nReading comprehension is absolutely fine. I'd bet good money you're not diabetic, that you pay for your meds privately and yes, that DOES take limited resources away from people that will die without it. \n\nJust an all round basic bitch mean girl. Even more ironic, you were likely mocked for your \"unfortunate\" circumstances of not being able to lose weight, just absolutely zero compassion. Introspection. Tracks for someone that thinks they deserve meds they have no real right to but hey. 🤷‍♀️",
      "created_utc": 1727600785.0,
      "score": 3,
      "context": [
        {
          "id": "lper34x",
          "author": "Elegant-Possession62",
          "body": "Lol",
          "created_utc": 1727563654.0
        },
        {
          "id": "lpgs9sk",
          "author": "CynicismNostalgia",
          "body": "Gotta say, I find something ironic about a person who has no clue about ARFID, coming in here to mock. \n\nWhen they themselves are one of those Ozempic basic bitches, that steal diabetic medication from people that need it, because they're too lazy to diet and exercise.\n\n\nAlso: just gonna beat you to the punch here for when you see this and feel offended. \n\n\"Oooh nooo! Did someone misrepresent and mock YOUR condition? What a shame. I wonder if you've ever done that to someone yourself?\"",
          "created_utc": 1727599679.0
        },
        {
          "id": "lpgt2dm",
          "author": "Elegant-Possession62",
          "body": "I have arfid, im not stealing medication, and im still dieting and exercising thanks :)",
          "created_utc": 1727600237.0
        },
        {
          "id": "lpgtajz",
          "author": "CynicismNostalgia",
          "body": "Jesus that's even worse sorry. If you have ARFID then you'd know the unfortunate dilemma that might come with, say, technically finding dog food more palettable than a human meal. That logic goes out the window and we can't control what does and does not make us gag and heave. \n\nHonestly you were better off as ignorant. Now you're just mean. Have fun with that",
          "created_utc": 1727600395.0
        },
        {
          "id": "lpgtj1v",
          "author": "Elegant-Possession62",
          "body": "Clearly reading comprehension isnt your thing, but i never mocked the arfid component and you still havent seemed to grasp that. Is it mean of me to laugh when people stay in comical situations? Maybe.",
          "created_utc": 1727600563.0
        }
      ]
    },
    {
      "id": "lpguzuj",
      "author": "Elegant-Possession62",
      "body": "Yep, looks like reading comprehension is the problem but no worries — I’m not going to waste my time spelling it out for an uncultured clown-faced bitch built like Groot. Have fun with your misinterpretations and assumptions, sounds real promising.",
      "created_utc": 1727601602.0,
      "score": -1,
      "context": [
        {
          "id": "lper34x",
          "author": "Elegant-Possession62",
          "body": "Lol",
          "created_utc": 1727563654.0
        },
        {
          "id": "lpgs9sk",
          "author": "CynicismNostalgia",
          "body": "Gotta say, I find something ironic about a person who has no clue about ARFID, coming in here to mock. \n\nWhen they themselves are one of those Ozempic basic bitches, that steal diabetic medication from people that need it, because they're too lazy to diet and exercise.\n\n\nAlso: just gonna beat you to the punch here for when you see this and feel offended. \n\n\"Oooh nooo! Did someone misrepresent and mock YOUR condition? What a shame. I wonder if you've ever done that to someone yourself?\"",
          "created_utc": 1727599679.0
        },
        {
          "id": "lpgt2dm",
          "author": "Elegant-Possession62",
          "body": "I have arfid, im not stealing medication, and im still dieting and exercising thanks :)",
          "created_utc": 1727600237.0
        },
        {
          "id": "lpgtajz",
          "author": "CynicismNostalgia",
          "body": "Jesus that's even worse sorry. If you have ARFID then you'd know the unfortunate dilemma that might come with, say, technically finding dog food more palettable than a human meal. That logic goes out the window and we can't control what does and does not make us gag and heave. \n\nHonestly you were better off as ignorant. Now you're just mean. Have fun with that",
          "created_utc": 1727600395.0
        },
        {
          "id": "lpgtj1v",
          "author": "Elegant-Possession62",
          "body": "Clearly reading comprehension isnt your thing, but i never mocked the arfid component and you still havent seemed to grasp that. Is it mean of me to laugh when people stay in comical situations? Maybe.",
          "created_utc": 1727600563.0
        },
        {
          "id": "lpgtu9c",
          "author": "CynicismNostalgia",
          "body": "Yes. Yes it is mean to laugh at a 17 year old girl trapped with her former abusive babysitter. It's mean to laugh at her degradation when she realised her ARFID is so intense, she could eat dog food but not chicken. \n\nReading comprehension is absolutely fine. I'd bet good money you're not diabetic, that you pay for your meds privately and yes, that DOES take limited resources away from people that will die without it. \n\nJust an all round basic bitch mean girl. Even more ironic, you were likely mocked for your \"unfortunate\" circumstances of not being able to lose weight, just absolutely zero compassion. Introspection. Tracks for someone that thinks they deserve meds they have no real right to but hey. 🤷‍♀️",
          "created_utc": 1727600785.0
        }
      ]
    },
    {
      "id": "lpgv778",
      "author": "CynicismNostalgia",
      "body": "\"Is it mean of me to mock somone who stays in stupid situations.\"\n\nYes. It is incredibly mean to mock a child who's trapped with her abuser. Yikes my girl. \n\nI'll just end with, my style is my choice so I clearly enjoy it. But nice try ;) just like your choice to take vital meds from people that need it. 😊 Enjoy your day",
      "created_utc": 1727601747.0,
      "score": 2,
      "context": [
        {
          "id": "lper34x",
          "author": "Elegant-Possession62",
          "body": "Lol",
          "created_utc": 1727563654.0
        },
        {
          "id": "lpgs9sk",
          "author": "CynicismNostalgia",
          "body": "Gotta say, I find something ironic about a person who has no clue about ARFID, coming in here to mock. \n\nWhen they themselves are one of those Ozempic basic bitches, that steal diabetic medication from people that need it, because they're too lazy to diet and exercise.\n\n\nAlso: just gonna beat you to the punch here for when you see this and feel offended. \n\n\"Oooh nooo! Did someone misrepresent and mock YOUR condition? What a shame. I wonder if you've ever done that to someone yourself?\"",
          "created_utc": 1727599679.0
        },
        {
          "id": "lpgt2dm",
          "author": "Elegant-Possession62",
          "body": "I have arfid, im not stealing medication, and im still dieting and exercising thanks :)",
          "created_utc": 1727600237.0
        },
        {
          "id": "lpgtajz",
          "author": "CynicismNostalgia",
          "body": "Jesus that's even worse sorry. If you have ARFID then you'd know the unfortunate dilemma that might come with, say, technically finding dog food more palettable than a human meal. That logic goes out the window and we can't control what does and does not make us gag and heave. \n\nHonestly you were better off as ignorant. Now you're just mean. Have fun with that",
          "created_utc": 1727600395.0
        },
        {
          "id": "lpgtj1v",
          "author": "Elegant-Possession62",
          "body": "Clearly reading comprehension isnt your thing, but i never mocked the arfid component and you still havent seemed to grasp that. Is it mean of me to laugh when people stay in comical situations? Maybe.",
          "created_utc": 1727600563.0
        },
        {
          "id": "lpgtu9c",
          "author": "CynicismNostalgia",
          "body": "Yes. Yes it is mean to laugh at a 17 year old girl trapped with her former abusive babysitter. It's mean to laugh at her degradation when she realised her ARFID is so intense, she could eat dog food but not chicken. \n\nReading comprehension is absolutely fine. I'd bet good money you're not diabetic, that you pay for your meds privately and yes, that DOES take limited resources away from people that will die without it. \n\nJust an all round basic bitch mean girl. Even more ironic, you were likely mocked for your \"unfortunate\" circumstances of not being able to lose weight, just absolutely zero compassion. Introspection. Tracks for someone that thinks they deserve meds they have no real right to but hey. 🤷‍♀️",
          "created_utc": 1727600785.0
        },
        {
          "id": "lpguzuj",
          "author": "Elegant-Possession62",
          "body": "Yep, looks like reading comprehension is the problem but no worries — I’m not going to waste my time spelling it out for an uncultured clown-faced bitch built like Groot. Have fun with your misinterpretations and assumptions, sounds real promising.",
          "created_utc": 1727601602.0
        }
      ]
    },
    {
      "id": "lpgwja9",
      "author": "Elegant-Possession62",
      "body": "OP is not trapped but ok lol\n\nI take Ozempic because I was pre-diabetic, insulin-resistant and have PCOS. My doctor prescribes it and my insurance covers it almost completely which I am extremely grateful for. My ARFID and ADHD have not made it easy either. Regardless, no one should have to justify why they are taking a medication that helps them become healthier. I know you struggle with reading comprehension, but I hope this article helps:\n\nhttps://medium.com/@roberttolppi/no-fat-people-arent-stealing-ozempic-from-diabetics-6eb4e280cb2d",
      "created_utc": 1727602707.0,
      "score": 0,
      "context": [
        {
          "id": "lper34x",
          "author": "Elegant-Possession62",
          "body": "Lol",
          "created_utc": 1727563654.0
        },
        {
          "id": "lpgs9sk",
          "author": "CynicismNostalgia",
          "body": "Gotta say, I find something ironic about a person who has no clue about ARFID, coming in here to mock. \n\nWhen they themselves are one of those Ozempic basic bitches, that steal diabetic medication from people that need it, because they're too lazy to diet and exercise.\n\n\nAlso: just gonna beat you to the punch here for when you see this and feel offended. \n\n\"Oooh nooo! Did someone misrepresent and mock YOUR condition? What a shame. I wonder if you've ever done that to someone yourself?\"",
          "created_utc": 1727599679.0
        },
        {
          "id": "lpgt2dm",
          "author": "Elegant-Possession62",
          "body": "I have arfid, im not stealing medication, and im still dieting and exercising thanks :)",
          "created_utc": 1727600237.0
        },
        {
          "id": "lpgtajz",
          "author": "CynicismNostalgia",
          "body": "Jesus that's even worse sorry. If you have ARFID then you'd know the unfortunate dilemma that might come with, say, technically finding dog food more palettable than a human meal. That logic goes out the window and we can't control what does and does not make us gag and heave. \n\nHonestly you were better off as ignorant. Now you're just mean. Have fun with that",
          "created_utc": 1727600395.0
        },
        {
          "id": "lpgtj1v",
          "author": "Elegant-Possession62",
          "body": "Clearly reading comprehension isnt your thing, but i never mocked the arfid component and you still havent seemed to grasp that. Is it mean of me to laugh when people stay in comical situations? Maybe.",
          "created_utc": 1727600563.0
        },
        {
          "id": "lpgtu9c",
          "author": "CynicismNostalgia",
          "body": "Yes. Yes it is mean to laugh at a 17 year old girl trapped with her former abusive babysitter. It's mean to laugh at her degradation when she realised her ARFID is so intense, she could eat dog food but not chicken. \n\nReading comprehension is absolutely fine. I'd bet good money you're not diabetic, that you pay for your meds privately and yes, that DOES take limited resources away from people that will die without it. \n\nJust an all round basic bitch mean girl. Even more ironic, you were likely mocked for your \"unfortunate\" circumstances of not being able to lose weight, just absolutely zero compassion. Introspection. Tracks for someone that thinks they deserve meds they have no real right to but hey. 🤷‍♀️",
          "created_utc": 1727600785.0
        },
        {
          "id": "lpguzuj",
          "author": "Elegant-Possession62",
          "body": "Yep, looks like reading comprehension is the problem but no worries — I’m not going to waste my time spelling it out for an uncultured clown-faced bitch built like Groot. Have fun with your misinterpretations and assumptions, sounds real promising.",
          "created_utc": 1727601602.0
        },
        {
          "id": "lpgv778",
          "author": "CynicismNostalgia",
          "body": "\"Is it mean of me to mock somone who stays in stupid situations.\"\n\nYes. It is incredibly mean to mock a child who's trapped with her abuser. Yikes my girl. \n\nI'll just end with, my style is my choice so I clearly enjoy it. But nice try ;) just like your choice to take vital meds from people that need it. 😊 Enjoy your day",
          "created_utc": 1727601747.0
        }
      ]
    },
    {
      "id": "lq43zhc",
      "author": "CynicismNostalgia",
      "body": "Noticed you still got downvotes, likely due to your general lack of compassion. \n\nAnd realise I was doing that to you,  did you like me judging you without knowing the full story?\n\nI'm assuming not.\n\nEither way, diabetic or not, lazy or not, being as asshole to a teenage girl in an abusive situation is never going to be a good look is it.",
      "created_utc": 1727949969.0,
      "score": 1,
      "context": [
        {
          "id": "lper34x",
          "author": "Elegant-Possession62",
          "body": "Lol",
          "created_utc": 1727563654.0
        },
        {
          "id": "lpgs9sk",
          "author": "CynicismNostalgia",
          "body": "Gotta say, I find something ironic about a person who has no clue about ARFID, coming in here to mock. \n\nWhen they themselves are one of those Ozempic basic bitches, that steal diabetic medication from people that need it, because they're too lazy to diet and exercise.\n\n\nAlso: just gonna beat you to the punch here for when you see this and feel offended. \n\n\"Oooh nooo! Did someone misrepresent and mock YOUR condition? What a shame. I wonder if you've ever done that to someone yourself?\"",
          "created_utc": 1727599679.0
        },
        {
          "id": "lpgt2dm",
          "author": "Elegant-Possession62",
          "body": "I have arfid, im not stealing medication, and im still dieting and exercising thanks :)",
          "created_utc": 1727600237.0
        },
        {
          "id": "lpgtajz",
          "author": "CynicismNostalgia",
          "body": "Jesus that's even worse sorry. If you have ARFID then you'd know the unfortunate dilemma that might come with, say, technically finding dog food more palettable than a human meal. That logic goes out the window and we can't control what does and does not make us gag and heave. \n\nHonestly you were better off as ignorant. Now you're just mean. Have fun with that",
          "created_utc": 1727600395.0
        },
        {
          "id": "lpgtj1v",
          "author": "Elegant-Possession62",
          "body": "Clearly reading comprehension isnt your thing, but i never mocked the arfid component and you still havent seemed to grasp that. Is it mean of me to laugh when people stay in comical situations? Maybe.",
          "created_utc": 1727600563.0
        },
        {
          "id": "lpgtu9c",
          "author": "CynicismNostalgia",
          "body": "Yes. Yes it is mean to laugh at a 17 year old girl trapped with her former abusive babysitter. It's mean to laugh at her degradation when she realised her ARFID is so intense, she could eat dog food but not chicken. \n\nReading comprehension is absolutely fine. I'd bet good money you're not diabetic, that you pay for your meds privately and yes, that DOES take limited resources away from people that will die without it. \n\nJust an all round basic bitch mean girl. Even more ironic, you were likely mocked for your \"unfortunate\" circumstances of not being able to lose weight, just absolutely zero compassion. Introspection. Tracks for someone that thinks they deserve meds they have no real right to but hey. 🤷‍♀️",
          "created_utc": 1727600785.0
        },
        {
          "id": "lpguzuj",
          "author": "Elegant-Possession62",
          "body": "Yep, looks like reading comprehension is the problem but no worries — I’m not going to waste my time spelling it out for an uncultured clown-faced bitch built like Groot. Have fun with your misinterpretations and assumptions, sounds real promising.",
          "created_utc": 1727601602.0
        },
        {
          "id": "lpgv778",
          "author": "CynicismNostalgia",
          "body": "\"Is it mean of me to mock somone who stays in stupid situations.\"\n\nYes. It is incredibly mean to mock a child who's trapped with her abuser. Yikes my girl. \n\nI'll just end with, my style is my choice so I clearly enjoy it. But nice try ;) just like your choice to take vital meds from people that need it. 😊 Enjoy your day",
          "created_utc": 1727601747.0
        },
        {
          "id": "lpgwja9",
          "author": "Elegant-Possession62",
          "body": "OP is not trapped but ok lol\n\nI take Ozempic because I was pre-diabetic, insulin-resistant and have PCOS. My doctor prescribes it and my insurance covers it almost completely which I am extremely grateful for. My ARFID and ADHD have not made it easy either. Regardless, no one should have to justify why they are taking a medication that helps them become healthier. I know you struggle with reading comprehension, but I hope this article helps:\n\nhttps://medium.com/@roberttolppi/no-fat-people-arent-stealing-ozempic-from-diabetics-6eb4e280cb2d",
          "created_utc": 1727602707.0
        }
      ]
    },
    {
      "id": "lq49vxc",
      "author": "Elegant-Possession62",
      "body": "It’s been four days love get over it x",
      "created_utc": 1727953542.0,
      "score": 0,
      "context": [
        {
          "id": "lper34x",
          "author": "Elegant-Possession62",
          "body": "Lol",
          "created_utc": 1727563654.0
        },
        {
          "id": "lpgs9sk",
          "author": "CynicismNostalgia",
          "body": "Gotta say, I find something ironic about a person who has no clue about ARFID, coming in here to mock. \n\nWhen they themselves are one of those Ozempic basic bitches, that steal diabetic medication from people that need it, because they're too lazy to diet and exercise.\n\n\nAlso: just gonna beat you to the punch here for when you see this and feel offended. \n\n\"Oooh nooo! Did someone misrepresent and mock YOUR condition? What a shame. I wonder if you've ever done that to someone yourself?\"",
          "created_utc": 1727599679.0
        },
        {
          "id": "lpgt2dm",
          "author": "Elegant-Possession62",
          "body": "I have arfid, im not stealing medication, and im still dieting and exercising thanks :)",
          "created_utc": 1727600237.0
        },
        {
          "id": "lpgtajz",
          "author": "CynicismNostalgia",
          "body": "Jesus that's even worse sorry. If you have ARFID then you'd know the unfortunate dilemma that might come with, say, technically finding dog food more palettable than a human meal. That logic goes out the window and we can't control what does and does not make us gag and heave. \n\nHonestly you were better off as ignorant. Now you're just mean. Have fun with that",
          "created_utc": 1727600395.0
        },
        {
          "id": "lpgtj1v",
          "author": "Elegant-Possession62",
          "body": "Clearly reading comprehension isnt your thing, but i never mocked the arfid component and you still havent seemed to grasp that. Is it mean of me to laugh when people stay in comical situations? Maybe.",
          "created_utc": 1727600563.0
        },
        {
          "id": "lpgtu9c",
          "author": "CynicismNostalgia",
          "body": "Yes. Yes it is mean to laugh at a 17 year old girl trapped with her former abusive babysitter. It's mean to laugh at her degradation when she realised her ARFID is so intense, she could eat dog food but not chicken. \n\nReading comprehension is absolutely fine. I'd bet good money you're not diabetic, that you pay for your meds privately and yes, that DOES take limited resources away from people that will die without it. \n\nJust an all round basic bitch mean girl. Even more ironic, you were likely mocked for your \"unfortunate\" circumstances of not being able to lose weight, just absolutely zero compassion. Introspection. Tracks for someone that thinks they deserve meds they have no real right to but hey. 🤷‍♀️",
          "created_utc": 1727600785.0
        },
        {
          "id": "lpguzuj",
          "author": "Elegant-Possession62",
          "body": "Yep, looks like reading comprehension is the problem but no worries — I’m not going to waste my time spelling it out for an uncultured clown-faced bitch built like Groot. Have fun with your misinterpretations and assumptions, sounds real promising.",
          "created_utc": 1727601602.0
        },
        {
          "id": "lpgv778",
          "author": "CynicismNostalgia",
          "body": "\"Is it mean of me to mock somone who stays in stupid situations.\"\n\nYes. It is incredibly mean to mock a child who's trapped with her abuser. Yikes my girl. \n\nI'll just end with, my style is my choice so I clearly enjoy it. But nice try ;) just like your choice to take vital meds from people that need it. 😊 Enjoy your day",
          "created_utc": 1727601747.0
        },
        {
          "id": "lpgwja9",
          "author": "Elegant-Possession62",
          "body": "OP is not trapped but ok lol\n\nI take Ozempic because I was pre-diabetic, insulin-resistant and have PCOS. My doctor prescribes it and my insurance covers it almost completely which I am extremely grateful for. My ARFID and ADHD have not made it easy either. Regardless, no one should have to justify why they are taking a medication that helps them become healthier. I know you struggle with reading comprehension, but I hope this article helps:\n\nhttps://medium.com/@roberttolppi/no-fat-people-arent-stealing-ozempic-from-diabetics-6eb4e280cb2d",
          "created_utc": 1727602707.0
        },
        {
          "id": "lq43zhc",
          "author": "CynicismNostalgia",
          "body": "Noticed you still got downvotes, likely due to your general lack of compassion. \n\nAnd realise I was doing that to you,  did you like me judging you without knowing the full story?\n\nI'm assuming not.\n\nEither way, diabetic or not, lazy or not, being as asshole to a teenage girl in an abusive situation is never going to be a good look is it.",
          "created_utc": 1727949969.0
        }
      ]
    }
  ]
}