{
  "id": "1ftvi75",
  "subreddit": "ARFID",
  "author": "qwfmzx",
  "created_utc": 1727807897.0,
  "title": "I’m always the only adult ARFID patient at the ED hospital",
  "selftext": "23F I’ve been in intensive inpatient care for ARFID twice as an adult. I’m currently on stint #2 and it’s such a shit show not having my safe foods which are ethnic foods. I wish there were ARFID specific clinics. I feel hopeless here but I’m trying to modify things best I can with the help of the care team. There are other adolescents here with ARFID but we don’t interact due to the age difference. Has anyone else gone through treatment alone? Without any ARFID counterparts?\n\nHonestly just want to gain weight again and I consume most of my calories via Boost supplements because again my safe foods are ethnic and I only like it the way my mom makes it. \n\nBeen a picky eater my whole life but only got diagnosed when I went to college and realized my mom had been accommodating to my odd dietary choices my whole life. She normalized everything and never made me feel less than for deconstruction of food, not having foods touch each other, or blending/hiding of vegetables. \n\nShoutout to parents who acknowledge kids who have ARFID. You guys do a lot of heavy lifting. Would’ve been diagnosed sooner if my mom didn’t jumps through hoops to keep my weight normal. She always held hope I would outgrow this but here we are. She’s also a first gen immigrant so she gets a lot of flack in our community for not beating me into submission as a child. \n",
  "url": "https://www.reddit.com/r/ARFID/comments/1ftvi75/im_always_the_only_adult_arfid_patient_at_the_ed/",
  "score": 101,
  "num_comments": 7,
  "comments": [
    {
      "id": "lpv8a6a",
      "author": "esor_rose",
      "body": "I hate that there are no arfid specific treatment centers (at least in the US). I’ve been to three different treatment centers and they all treated arfid, but it wasn’t their main disorder they treat. The last one I went to only allowed patients one drink of water at meals. I literally boosted for all meals (even breakfast) because there is no way I could finish a meal without water even if I liked the food. And they never explained to me the reason why were only allowed one drink of water at meals. My dietician at the center told me to literally play with my food (like a child) because I got bored eating. Mind you I was 18 at the time. Part of it is boredom, part of it is literally not being able to eat foods I don’t like without water. And they wondered why I wouldn’t drink enough water. I mostly drink water at meals and snacks. And it’s not like I was purposely restricting, I just didn’t like drinking water outside of meals or snacks.",
      "created_utc": 1727813599.0,
      "score": 40,
      "context": []
    },
    {
      "id": "lpvukun",
      "author": "sadbreadstick",
      "body": "I've been in IOP for almost 3 months now and I'm also the only arfid patient 🥲 It can definitely be a bit lonely and it always feel weird when I'm one of the last at the table not finishing because of texture issues rather than body image concerns. My peers and the staff here have been really supportive though and my program is accomodating to my needs. I wish it was more arfid focused, but unfortunately most treatment centers aren't there yet",
      "created_utc": 1727820779.0,
      "score": 20,
      "context": []
    },
    {
      "id": "lpyug4q",
      "author": "gloomfish",
      "body": "Within health (virtual program) was very accommodating to my ARFID and they even had an ARFID process group.",
      "created_utc": 1727873018.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lpyzlid",
      "author": "qwfmzx",
      "body": "They also told me to “be curious like a child” and channel my “inner child” but that’s a load of BS to me lollll. The dieticians are a hit or miss. Where I’m at they don’t let you use tissues during meals and i have sensory issues. When stuff is on my fingers it’s so hard to continue eating other things due to “contamination”. I also don’t like my food touching. Everyday here is a visual, and olfactory nightmare. The only thing bringing me joy are the other patients who are so supportive and funny. I’m not happy to be here but I’m happy I’m here with them.",
      "created_utc": 1727875054.0,
      "score": 12,
      "context": [
        {
          "id": "lpv8a6a",
          "author": "esor_rose",
          "body": "I hate that there are no arfid specific treatment centers (at least in the US). I’ve been to three different treatment centers and they all treated arfid, but it wasn’t their main disorder they treat. The last one I went to only allowed patients one drink of water at meals. I literally boosted for all meals (even breakfast) because there is no way I could finish a meal without water even if I liked the food. And they never explained to me the reason why were only allowed one drink of water at meals. My dietician at the center told me to literally play with my food (like a child) because I got bored eating. Mind you I was 18 at the time. Part of it is boredom, part of it is literally not being able to eat foods I don’t like without water. And they wondered why I wouldn’t drink enough water. I mostly drink water at meals and snacks. And it’s not like I was purposely restricting, I just didn’t like drinking water outside of meals or snacks.",
          "created_utc": 1727813599.0
        }
      ]
    },
    {
      "id": "lpyzw85",
      "author": "qwfmzx",
      "body": "I’m so happy that your peers are accommodating. I often find myself comparing plates and wondering if they think I’m weird for not eating the same as everyone else or eating the same thing everyday. They’ve been super supportive and assured me that they’re focused on their on plate. It’s hard though when you’ve been ridiculed for odd eating habits. I constantly feel ashamed. I’m going to be doing IOP when I leave. Good luck ❤️",
      "created_utc": 1727875167.0,
      "score": 4,
      "context": [
        {
          "id": "lpvukun",
          "author": "sadbreadstick",
          "body": "I've been in IOP for almost 3 months now and I'm also the only arfid patient 🥲 It can definitely be a bit lonely and it always feel weird when I'm one of the last at the table not finishing because of texture issues rather than body image concerns. My peers and the staff here have been really supportive though and my program is accomodating to my needs. I wish it was more arfid focused, but unfortunately most treatment centers aren't there yet",
          "created_utc": 1727820779.0
        }
      ]
    },
    {
      "id": "lpyzxpc",
      "author": "qwfmzx",
      "body": "I will look into this with my insurance thank you so much.",
      "created_utc": 1727875183.0,
      "score": 2,
      "context": [
        {
          "id": "lpyug4q",
          "author": "gloomfish",
          "body": "Within health (virtual program) was very accommodating to my ARFID and they even had an ARFID process group.",
          "created_utc": 1727873018.0
        }
      ]
    },
    {
      "id": "lpzckro",
      "author": "gloomfish",
      "body": "I have lots of good things to say about them, but he warned they are tough with insurance. A lot of people get dropped because insurance just won't do it. If they accept your insurance though their team will fight for you as much as they can",
      "created_utc": 1727879668.0,
      "score": 2,
      "context": [
        {
          "id": "lpyug4q",
          "author": "gloomfish",
          "body": "Within health (virtual program) was very accommodating to my ARFID and they even had an ARFID process group.",
          "created_utc": 1727873018.0
        },
        {
          "id": "lpyzxpc",
          "author": "qwfmzx",
          "body": "I will look into this with my insurance thank you so much.",
          "created_utc": 1727875183.0
        }
      ]
    }
  ]
}