{
  "id": "1g02qba",
  "subreddit": "ARFID",
  "author": "ihtm1220",
  "created_utc": 1728509438.0,
  "title": "Do you blame your parents? ",
  "selftext": "My daughter is 17. I believe she has ARFID. She hasn’t been diagnosed by a professional so maybe I’m wrong but she is extremely restricted and only eats a handful of foods. She getting enough calories but not particularly nutritious. \n\nShe doesn’t like taking about it but she has shared it causes her anxiety when she’s somewhere without familiar food, like dinner at a friend’s house. I think she beats herself up over it and wishes she wasn’t this way.\n\nFor those of you with ARFID do you blame your parents? You can be honest because I already blame myself. I’m sure there was a moment or maybe several times when she was younger that she didn’t want to eat a food so we gave her something we knew she’d eat and it probably spiraled from there. \n\nEdit: Thank you all for sharing such personal stories with me. I learned a lot that I think will help me help my daughter. ",
  "url": "https://www.reddit.com/r/ARFID/comments/1g02qba/do_you_blame_your_parents/",
  "score": 111,
  "num_comments": 145,
  "comments": [
    {
      "id": "lr5pdro",
      "author": "ollie_rosie",
      "body": "You can’t let her know you blame yourself because all that does is lead to her feeling even worse than she probably already does, Support her but don’t make it about yourself, Arfid isn’t caused by you giving into not making her eat things when she was little, be patient with her it’s no one’s fault and no one’s to blame in this situation",
      "created_utc": 1728510142.0,
      "score": 131,
      "context": []
    },
    {
      "id": "lr5sq86",
      "author": "caldus_x",
      "body": "Definitely not! ARFID is pretty new and very few people know and recognize it. My parents assumed my struggles were just due to pickiness, not a larger underlying problem. I really don’t see my parents giving me a safe food as “enabling behavior” at all. In fact, I think it’s better that they did that as opposed to force feeding bc that would have just made the problem worse. Please do not blame yourself! What’s important is that you are there for her now, listen to her, and give her the support she needs to get better.",
      "created_utc": 1728511282.0,
      "score": 75,
      "context": []
    },
    {
      "id": "lr5rf29",
      "author": "ChaoticMornings",
      "body": "I do, but, my mother forced me to eat. Like, pushed my face in it if I refused, punished me if I didn't. Let me sit for an hour or more untill I had finished my plate. Made things I disliked on purpose and I had to eat it all week, for lunch and dinner. And always accused me of having anorexia/boulimia, to the point that I was not allowed to flush the toilet anymore untill she had checked it. \n\nSo that is the opposite scenario. \n\nI actually am one of the few who doesn't have to worry about safe foods tho. I know my father used to let me try lots of things. Olives, fish, calamaris. My grandmother made me familiar with lots of veggies. \n\nBut my parents seperated when I was 9, and my mother never cooked a decent meal. \n\nIn general, I rarely have a feeling of hunger. I can't eat much, more like a childrens sized portion, I am underweight, I do not enjoy eating, and have many other ARFID symptoms. \n\nYes. I blame my mother for my symptoms, but, I guess even if I had no symptoms at all, I would still blame her for being abusive. \n\nWith my toddler, I encourage her to try. She has to try a tiny bit of a new food, if she does not like it, she doesn't have to eat it. What am I supposed to do? Force it down her throat? Sometimes she likes what she tried, sometimes she doesn't. Next time, we try again. If she throws a fit, we let her \"win\". Better to finish the rest of the plate than to have her crying and refusing all of it because she is upset I guess.",
      "created_utc": 1728510847.0,
      "score": 55,
      "context": []
    },
    {
      "id": "lr5u87d",
      "author": "beomint",
      "body": "No. In fact, plenty of kids END UP with ARFID from being forced to eat when they don't want to. There's a specific type of ARFID that can be caused by trauma, and the most common thing that causes that trauma are things like force feeding. It can also be caused by choking or a particularly traumatic episode of vomiting, but force feeding is absolutely up there.\n\nGiving your kid options is the CORRECT thing to do. (Edit: Just wanna jump back in to really assert this; ARFID is NOT caused by giving your kid options. That is a gross misrepresentation of ARFID and is actively damaging to us to hear you think being a decent parent might have caused your kid to spiral. The only way you could have given your kid ARFID is if you force fed them or did something else heinous with food. Being a normal human who doesn't force feed kids doesn't mean you caused your kid's ARFID and it's important to drop that immediately for the safety of everybody.) You did the right thing. Forcing your child would have made it worse. A lot of uneducated parents around you are going to say stuff like \"If that was my kid, they wouldn't be picky!\" and \"you should have made them eat their vegetables then they'd be fine!\" NO. THEY ARE WRONG. IF THEY HAD A CHILD WITH ARFID, THEY WOULD HAVE KILLED THEM! I'M NOT JOKING. THE PEOPLE WHO SAY THAT, ARE SAYING THEY ARE WILLING TO KILL THEIR CHILD. LET THAT SINK IN.\n\nPeople with ARFID blame their parents for forcing them to eat. Never once have I blamed my parents for NOT forcing me to eat. All of my anxiety came from knowing I'd be ostracized, maybe even outright punished, if I didn't eat what I was given. People all over the world misunderstand this disorder, they misunderstand it so severely that they give their children PTSD and worsen their condition. If you had force fed your child, you would have made their ARFID worse. That is NOT HOW TREATMENT WORKS!\n\nStop blaming yourself. That's not a dig on you, it's emotionally damaging to your child to blame yourself for a condition NEITHER OF YOU CAN CONTROL! Most people with ARFID end up sticking to their safefoods with minor changes to assure we're getting all our essential nutrients and the proper amount of calories- We aren't fixed by being forced to try new foods and we never ever will be. It's traumatic to do so and you did the right thing by not forcing it. If a parent says you should have forced it, you can tell them they sound like a horrible parent and their kid would probably be dead if that happened. A lot of cases of ARFID progress as the person ages- I loved broccoli as a kid then suddenly couldn't handle it anymore, but was that my parent's fault for not force feeding me more broccoli?? NO! And in the cases where I was forced to eat things I couldn't handle, I'd throw up and then be punished for throwing up. Now I have C-PTSD. Remember this the next time someone tries to say shit about your parenting.",
      "created_utc": 1728511785.0,
      "score": 35,
      "context": []
    },
    {
      "id": "lr5q0m7",
      "author": "Swiftrun1",
      "body": "25 m had arfid all my life. I don't blame my parents. They did the best they could. Therapy was never an option due to the cost. The only thing I blame them for is dragging me to stupid Church functions where I'm certain they *knew* I'd be miserable at because it was just a meal with food I didn't eat. They tried to expand my pallet, but I just wouldn't eat it. I easily bested them in the \"you don't leave the dinner table until your plate is clean\" challenge. Sitting doing nothing was indescribably better than trying to choke down the food. They made sure i had something to eat and was healthy.",
      "created_utc": 1728510362.0,
      "score": 23,
      "context": []
    },
    {
      "id": "lr5r5dj",
      "author": "Garden-Gremlins",
      "body": "For me, yes, but I was neglected",
      "created_utc": 1728510755.0,
      "score": 42,
      "context": []
    },
    {
      "id": "lr5w9il",
      "author": "None",
      "body": "I’ve had ARFID for as long as I can remember (30+ years). My parents tell me that it started when I was really young and it was like the flip of a switch. One day I’d eat whatever they put in front of me and the next I would only eat a few things prepared specific ways. \n\nI’ve been fortunate to have really patient  and kind parents who have put up with me. My mom brought it up to my doctor all the time and he kept telling her that I’d grow out of it. I have not. So I definitely don’t think it’s the parents’ fault at all. But I do think there is a smart way to approach it and how you help your kids navigate this disorder is your responsibility. The best way to help your kid is up to you and if you aren’t sure you can try to enlist help from dietitians and/or therapists who specialize in eating disorders. \n\nI wish you and everyone who has ARFID the best of luck finding a strategy that works for them.",
      "created_utc": 1728512531.0,
      "score": 13,
      "context": []
    },
    {
      "id": "lr60qyx",
      "author": "luminousfloret",
      "body": "There are foods I can’t be in the room with because I was force fed them. Like shoved into my mouth and forced to swallow. They would hide things in my safe foods. Belittle me for my eating habits. So, yeah.",
      "created_utc": 1728514212.0,
      "score": 9,
      "context": []
    },
    {
      "id": "lr5p45v",
      "author": "emptyhellebore",
      "body": "I’m way past childhood, so I don’t blame my parents for me ending up with severe eating issues at this point.  I’m autistic, so that is at the root of my food aversions.  That is not their fault.  The cptsd I ended up with because I was punished and mocked for my food aversions is what I think of as a more cause/effect situation.  \n\nIt sounds like you took the opposite approach from what my parents chose, and while I can see you beating yourself up, I think that was the kinder, better option before you knew such a thing as ARFID exists.  This is not your fault.  Please give yourself some grace.",
      "created_utc": 1728510050.0,
      "score": 9,
      "context": []
    },
    {
      "id": "lr5wbdg",
      "author": "Under-the-oak-trees",
      "body": "I’ve always had some food issues (especially around flavour and texture), but they didn’t develop into an intake disorder until the past couple years (I’m in my 30s). I actually credit my parents’ low-pressure approach to food — always allowing me to get something else if I didn’t want what was being served, and approaching new foods with curiosity rather than pressure — with it Not getting worse sooner. \n\nForcing your daughter to eat unfamiliar foods would just increase her anxiety around food. Letting her have something familiar isn’t causing this, and is exactly what you should be doing. \n\nIt’s a tough thing to deal with, but having supportive family who don’t shame you for being picky/anxious about trying new things, and who also don’t make a big deal out of you trying new foods (like, overly celebrating a new food without her initiating it can feel like pressure) makes it less hellish.",
      "created_utc": 1728512550.0,
      "score": 10,
      "context": []
    },
    {
      "id": "lr5vvfx",
      "author": "StrawbraryLiberry",
      "body": "No, I think ARFID is genetic to some degree & certainly tied to anxiety. \n\nForcing her to eat things she didn't want to would have been more damaging. \n\nI'm glad my parents didn't make it too hard on me, because without their support, I would have resorted to starving myself a lot sooner. They didn't make it stressful to try new things, which already will be stressful for me. They presented me with the opportunity to try new things, but never force it. \n\nI was able to sort it out very well in early adulthood, but health problems made it come back worse than ever. \n\nIt's really not their fault at all.",
      "created_utc": 1728512388.0,
      "score": 8,
      "context": []
    },
    {
      "id": "lr5x9vn",
      "author": "i_am_confused00",
      "body": "i don’t blame them for me having ARFID, i blame them for making mine worse. they tried to force food and guilt trip me into eating, which only made my eating disorder get so much worse. \n\ndon’t feel bad for giving her food that you knew that she would eat. you were keeping her fed. you’ll get to know a saying here that “fed is always best.” if your choice was to give her a food she wants or her starving because she didn’t want the original food, having her eat anything was the better choice. \n\nknowledge about ARFID is relatively new. i’m currently 20 and only started treatment when i was 15. she’s perfectly capable of starting treatment now if she wants to, but the key is if she really wants to. it’s hard work, but it will be worth it. a major motivator when i was that age for treatment was i wanted to be able to survive at college.\n\neven if you could have intervened earlier, you can’t change that now. but now you can give her the support she needs and help her find the right treatment for her. personally, i have a dietitian and therapist both trained in ARFID and it has helped tremendously\n\ni wish her the best, i’m sure your help will help her so much",
      "created_utc": 1728512905.0,
      "score": 7,
      "context": []
    },
    {
      "id": "lr61wmj",
      "author": "chunkeymunkeyandrunt",
      "body": "When you said you blamed yourself I definitely thought you were going to end that post with ‘she didn’t want to eat a food so we forced her to’ because that’s the only way I’d say you could possibly be blamed. \n\nContrary to what internet armchair parents will tell you, allowing a kid to not like a food doesn’t make them have ARFID. All kids go through picky phases - it’s a natural part of childhood development. If anything you probably _helped_ by not causing further trauma around food.",
      "created_utc": 1728514646.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lr63l0w",
      "author": "overtly-Grrl",
      "body": "Absolutely. She starved me severely for years. We had an emergency removal at night because of her neglect and abuse. \n\nI have almost no ability to try new foods. It makes my heart hurt(metaphorically) like I’m a child. \n\nMy ARFID is 100% stressed induced and I will starve myself now. On accident of course. But I’m so use to it that I never know until I’m sick. Like now. \n\nBut even then, I do not have hunger pangs. I do not feel hungry. I barely think about food unless I force myself to. So if I’m just living my life I will forget to eat anyways. People always joke about girl dinner and shit but I have a girl meal lifestyle then. \n\nI do not know how to enjoy a meal anymore because I feel like I’m always watched. Every movement of my mouth. My facial expressions. \n\nPeople always say that you are not your past but I absolutely am. I am sick because of how my body was taught. And I have to unlearn that. Because of her.\n\nI absolutely blame her.",
      "created_utc": 1728515285.0,
      "score": 6,
      "context": []
    },
    {
      "id": "lr5z9ct",
      "author": "kissedbyvampires",
      "body": "i think it depends on the root cause of someone’s ARFID and their subtype.\n\npersonally, i do not blame my family. they actually tried very hard to introduce me to different foods, and i ate a video variety of food until i was 3. my ARFID is caused by autism and OCD. it wasn’t until i was 14 that my doctors started to realize it was a sensory issue causing my food aversions. i went to occupational therapy from 14-17. it took most of my family until i was diagnosed with autism at 18 to truly understand my ARFID. my dad was the most doubt until my autism diagnosis, and still believed i was just stubborn like the doctors originally said. he apologized the day after i was diagnosed for never taking it seriously.",
      "created_utc": 1728513653.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lr5zitu",
      "author": "Baring-My-Heart",
      "body": "I definitely don’t! If anything, I’m very thankful for my parents. Growing up, they knew that I struggled with food and eventually they excepted me for as I am and take care of Me, even after I moved out",
      "created_utc": 1728513749.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lr60xgc",
      "author": "Impressive-Lock-673",
      "body": "I experience the opposite, it definitely varies from person to person. My parents made my plates for me growing up (probably until age 10ish) and I sat at the table until they were clear, whether I liked it or not. There were nights where I was sitting there for hours. It has caused a few different issues as I’ve gotten older and my arfid definitely stems from that. I wouldn’t necessarily say I blame them but I do feel angry because I feel like if they didn’t go about it that way, I might not struggle so much now.",
      "created_utc": 1728514281.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lr5tedk",
      "author": "heartoffiction",
      "body": "I do in some ways for sure. When I was a kid I would throw up anything I didn’t like so my parents stopped trying to introduce foods and I only had 5-10 very unhealthy safe foods until my adult life. I don’t blame them for me having it but I am a bit frustrated that they just… gave up on me?? My mom was a stay at home mom and I’m an only child, and they’re relatively well off. It’s not like they didn’t have the time or resources to try to help me, they just threw in the towel and decided I was a permanent picky eater. (And then complained endlessly to anyone with ears about how picky I am). So I don’t think they caused it since it started as a baby for me but I do definitely harbor frustration that they never idk thought it was strange that their child threw up at even the sight or smell of certain foods and thought to take me to a specialist or something?? I know this is a pretty new disorder classification so not sure what resources would’ve been available 20 years ago but even a little more of their patience and understanding to work with me and find out why I was reacting that way and maybe see if there were other things they could add to my diet to help me grow up healthier. Because now I’m chronically ill and my mom blames it all on me only eating bread as a kid 🤨",
      "created_utc": 1728511495.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lr5wm0c",
      "author": "Rupertredloh",
      "body": "As a kid, I started refusing certain food, and my parents took me to their doctor (not to my child doctor, they were already there and what he told them didn't cure it); and he told them to 'give me nothing to eat; and after a week or so i would eat everything they presented me.' Quote: \"Hunger ist the best cook.\" \n\nAfter three days, while I was lying on the sofa, my grandma was furious and told them to finally give me something to eat; what they did. \n\nDon't get me wrong; I love my parents, and i'm not mad at them for listening to the doctor (back then, arfid wasn't a thing yet), but they might be the reason I refuse some foods. \n\nMaybe also grandma is at fault, because maybe what the doctor said would have worked,  and I wouldn't ended up having ARFID, but I also don't blame her; maybe she was saving my fucking life.",
      "created_utc": 1728512660.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lr6290l",
      "author": "medlx",
      "body": "There are some reports that show parents pressuring their child to eat has an influence on their eating Behaviour. You did the exact Opposite. That is a good thing, no need to blame yourself for that. I understand That the situation you and your daughter are in is challenging, and i Am sorry to hear that. But please dont blame yourself for something that you didnt cause and for something that no parent would like to see: a hungry child not being given something to eat that they like. Sometimes, people have ARFID even though there is not a single good explanation for it. I know that then people try looking for one, but offen that does simply give any possible reason as an explanation, but in most cases, you are not on the right track",
      "created_utc": 1728514773.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lr6d6tf",
      "author": "Dull-Touch283",
      "body": "I had food aversions as soon as I started eating solid food as a baby, so I know the cause of it was not from anything my parents did. But I do think the way my parents handled it had a big impact on the severity/it still being this bad at 21 years old. The best thing you can do for your daughter is never show frustration, judgement or pressure, and help her see that foods are not going to hurt her. ARFID gets a lot more difficult to manage and recover from into adulthood I’m finding. You should definitely try to get her as much help as possible while she’s still living at home before she has less of a support system out on her own.",
      "created_utc": 1728518875.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lr6wqr5",
      "author": "brain_dead55503",
      "body": "To be honest, being forced to eat things only made my relationship with food even worse and more restrictive because I associated it with negative emotions. Sometimes because of this I didn't eat at all. You probably did the right thing ... But that's just my perspective and everyone is different",
      "created_utc": 1728526367.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lr8by3y",
      "author": "HorseDivorce17",
      "body": "Honestly for the most part I do not. It’s not their fault I’m like this. In fact, when I was a kid, my parents tried to help. They took me to this food therapy place where they had me try different foods and stuff. (I was 3-4 so I don’t remember much.) my mom cared a lot and at the end of the day wanted to help me, and wanted me to enjoy foods.\n\nWhat I DO blame them for was constantly bringing up how picky I was to others in front of me, which I wouldn’t have minded so much except they’re both picky as hell too, and I’ve worked incredibly hard to make massive strides to open my food horizons. When I was a kid I wouldn’t even eat pizza or chicken nuggets or ice cream or other basic kid foods, and now i can eat some sushi, some fish (which my mom won’t touch and we never had in the house growing up), I’ve tried Indian food (not my fav but proud of myself for trying), and more. Sure maybe I only have one safe food on those menus but I TRIED. Now when they come up to visit me they won’t even try the places I suggest, despite saying they have no preferences and will “go anywhere.” \n\n(Disclaimer: I don’t think all people with ARFID should “just try more foods,” but for me, being able to try just one bite of something from my fiancés plate that he says I might like bc he knows my preferences with no pressure or judgement when *i* asked has helped me massively) \n\nSo idk. I get frustrated by the hypocrisy but I don’t blame them for me being Like This™",
      "created_utc": 1728556076.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lr8eyvz",
      "author": "Prometheus-is-vulcan",
      "body": "To some extent. \n\nI am 25, maybe 30kg overweight because of similar restrictions. (Dm me if you want to chat about them)\n\nMy guess is, if my parents had forced me to eat such things at a very very early stage (and made sure they are high quality), that I wouldn't had developed it.\n\nI would really like to know if there was a moment when it started, or if it was a process. \n\n\nMy advice, even as an adult the number of unsafe foods can grow, some unsafe foods can become safe if the exact triggers are isolated and mitigated",
      "created_utc": 1728557876.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lr8lnd4",
      "author": "Fit-Cauliflower-9229",
      "body": "Please force her to eat a bit\n\nI never met professionals who knew how to help with ARFID, couldn’t eat meat or fish for 6 years and ended up with nerves damages from b12 deficiency. I lost part of my vision. \n\nAfter all that happend to me I was tired and forced myself to eat somes food I was scared of. I would take a bite, keep it in my mouth, then throw it in the trash. I did that for somes days. Then for a week took 1 bite and ate it. On the second week it went to two bites. So on and so on. After 4 months I can eat fishes again. And because I went slow I didn’t feel sick at all.\n\nI went through that process multiples times. Sometimes faster, sometimes slower depending on how scared I was if the food. Fish was the scariest, somes cheeses were easy and only took 3 days to eat a normal amount again.\n\nI never found a doctor or psychologist who could help with this disorder. You have to take the matter into your own hand.",
      "created_utc": 1728561333.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lraqy6h",
      "author": "jeannesloaf",
      "body": "My mom hated dealing with any type of big emotions from me, so she did everything she could to just appease me instead of working through challenges together. She fed me whatever I wanted, which was McDonalds and Diet Coke every single day since I was 5. She didn’t seem to care how it would affect my health, since I was still skinny. She assumed only fat kids were unhealthy. She assumed Diet Coke was healthier than regular Coke. She hated cooking and I hated her cooking so she rarely ever cooked for me. Today I’m 31. Still skinny, but incredibly unhealthy and miserable every day. My ARFID is worse than it’s ever been. If she had just challenged me from an early age to eat things I was afraid of, I’m certain my ARFID wouldn’t be this advanced, or I might not even have it. \n\nYes I blame my mom. Did she intend for this to happen? No, but she should’ve done more. But there’s a difference between blaming yourself and taking accountability. Self-blame will send you spiraling and will help no one.",
      "created_utc": 1728588170.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lrb27i3",
      "author": "yourfascistmommy",
      "body": "My boyfriend blames my parents. I blame them and myself. They allowed me not to try foods I didn’t want to and not to eat things I should (healthy foods, veggies, meat, etc). Now I’m prediabetes cause I only really eat carbs (vegetarian but don’t eat veggies lol) and have a hard time eating at new places. It’s a struggle but I’m seeing an ARFID dietician which helps. \nOnly answering so bluntly because you asked. I hope your daughter gets well",
      "created_utc": 1728591752.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lr5we7u",
      "author": "blackmetalwarlock",
      "body": "Personally, I do, because my parents did not care to feed me nutritious meals and I was never challenged to eat anything besides microwave food alone in my room. There were years where all I ate was one or two small microwave pizzas a day and no one said anything to me about it or cared, because they simply didn’t want to deal with cooking or working with my diet. My mom had anorexia and rarely ate when I was growing up. I would eat a few cookies for breakfast and no one cared. I literally never ate vegetables, fruit, or meat. I also now have a lot of health problems. \n\nWhen I got older I didn’t know how to cook, what proper food safety practices were, and honestly I still don’t know what some foods are supposed to be like, look like, smell like. I had to learn everything from YouTube. I have no emotional connection to food. \n\nAs a parent, I think they fucked up big time. I feed my daughter lots of nutritious meals despite it being difficult and I try to challenge myself to eat those meals with her as well, even when it’s difficult. Because food can be medicine, it’s good for you, it helps you grow. I have always been skinny as a twig, short, and sick. I do not want that for my kid. And I often wonder if I was properly nourished, if my body would be more functional as an adult.",
      "created_utc": 1728512579.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lr60a84",
      "author": "jelhdm",
      "body": "Absolutely.",
      "created_utc": 1728514035.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lr60wx1",
      "author": "WomenOfWonder",
      "body": "No, for me it was due to colic. It’s also why I have asthma ",
      "created_utc": 1728514275.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lr63mtb",
      "author": "littleghool",
      "body": "I do not blame my mom, no. She's always been super supportive of me and my eating habits.",
      "created_utc": 1728515304.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lr644hb",
      "author": "Raderg32",
      "body": "I was beaten and forced to eat whatever my parents gave to me until I puked and then feed me that, so I don't think you caving in and giving her something she liked was the cause of it, because then what caused mine?",
      "created_utc": 1728515491.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lr64jch",
      "author": "lemurificspeckle",
      "body": "Not at all! I’m actually ***SO*** thankful that my parents were accommodating to my weird ARFID diet. Everyone around them was telling them to force food on me with advice like the typical “you eat this or you don’t eat tonight at all” but they stood firm and let me eat my safe foods and found creative ways to try to meet at least *some* of my nutritional needs (so many protein bars). Thank god they never forced me to eat anything, because otherwise I would’ve been straight up traumatized and my relationship with food would be even WORSE. \n\nThe only thing I “blame” anybody for is blaming the DSM for not making ARFID a thing until the latest edition. I kind of blame my doctors for not trying to do anything about it, but same thing: I’m glad I wasn’t ever shamed by a doctor (my parents made sure to find cool  ones) or traumatized by “treatment.” And for what it’s worth, my parents did find a speech pathologist who did exposure therapy for me; I just wasn’t ready for it yet.\n\nYou might ask if your daughter is interested in seeking some form of treatment. I say that because she sounds a bit like me when I was 17 (now 22). I was in my senior year of high school and felt exhausted all the time and like my body was working against me. That frustration led me to seek out a dietician, and the dietician recommended I research ARFID and look into treatment. We found a good IOP/PHP, they took me in for two months or so (summer after graduation haha), and at the end of those two months I was eating pretty well balanced meals for the first time in my life. Now, **big disclaimer:** the key here is she has to want to do it. Don’t force her to do this. The only reason it worked for me is because I was insistent on it and determined to get better. I still very much have ARFID and am still in treatment now (weekly appointments with a dietician who knows about ARFID), but I’m leagues ahead of where I was five years ago. Exposure therapy is hard work, but if you’re willing and able to do the work, **it can change your life!!!!**",
      "created_utc": 1728515649.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lr64rmr",
      "author": "lily_fairy",
      "body": "no not at all. i think they did the best they could with the little resources/knowledge they had.",
      "created_utc": 1728515737.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lr690qe",
      "author": "kilroy-was-here-2543",
      "body": "I have vivid memory of my dad holding me down as a child trying to get me to eat a strawberry and I’m not gonna lie I think that’s what did it. I have autism which made me a bit more of a picky eater at the time and my dad had not yet reconciled with anger issues he had. That led to him not being willing to accept that I might be a bit different, then he forced me to eat the fruit",
      "created_utc": 1728517317.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lr69ky0",
      "author": "Environmental-Cat942",
      "body": "certain foods i can pinpoint to a specific trauma, like ham. i have a vivid memory of having a ham sandwich shoved down my throat until i threw up, so even touching it now my brain gets triggered. that i blame a parent for. most other things, i realised pretty early on weren’t in anyone’s control, mine or my parents.",
      "created_utc": 1728517524.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lr6e7ie",
      "author": "None",
      "body": "no not really. only my mother for not catching a problem sooner but there’s more baggage there. if you’re a good parent in other areas it’s unlikely your daughter blames you.",
      "created_utc": 1728519265.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lr6jwxa",
      "author": "jessi_anne",
      "body": "I only blame my parents for how they reacted, not the fact that I have it at all.\n\nI've had arfid for essentially my entire life (due to autism). However, my parents were the kind of people who simply refused to understand and decided that I was just trying to be a problem. So, they would shove food down my throat that I wouldn't eat rather than try to figure things out. \n\nThis has resulted in far more trauma and a more restricted diet than I would have had otherwise. \n\nYou seem like youre doing the best you can, so I'm sure your daughter appreciates it! If you want her to get more nutrition, maybe you could try changing the foods she won't eat normally and see how it goes (ie blending things into smoothies)",
      "created_utc": 1728521392.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lr6kqck",
      "author": "Illustrious-Radio-53",
      "body": "ARFID mom here…please this is so hard but you can’t blame yourself! This diagnosis is a mindf-ck and would’ve found its way into your child’s life and brain on its own. You, your child, and family have to unite to fight this disease. When you let doubts creep in, that’s when it’s the strongest. \n\nIf you could personify ARFID, it’d sound like a toddler, so you have to treat it like one. No, food isn’t dangerous. Yes, you can and will eat this. Sit together as a family, avoid talking about food, make eating as normal and calm as you can. Be sure your kid fills up a dinner plate with food and eats it. Be sure your kid eats a variety of foods (within reason). Above all, take care of yourself because this disease is so incredibly painful for all of you.",
      "created_utc": 1728521705.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lr6odgp",
      "author": "crowcas",
      "body": "no, I don't blame my parents. it's not their fault.\n\nthat said, i do know that my mom feels the same way you do--she thinks it's her fault for letting me eat  something else instead of forcing me to suck it up and choke it down anyway. she thinks if she had held more firm, I wouldn't be like this.\n\nI strongly urge you to *not* tell your daughter that you feel this way.\n\nI understand that as a parent, you want what's best for your children, and that a disorder like this feels like proof that you somehow failed in raising them. the problem is that there is no way to tell your child that you failed in raising them without inadvertently telling your child that they, in some respect, are a failure.\n\nit felt like my mom was telling me that *i* didn't try hard enough. that through my fear and poor resolve as a child, I had brought this on myself. I know in my brain that's not what she meant, but *I'm* the one who can't do it. I can't force myself to believe it has nothing to do with me.\n\nI think most of us probably wish we didn't have ARFID, and that we all go through low points of beating ourselves up over it, but most of the time? it's pretty neutral. sometimes my mom says something about how I'm \"suffering\"  because of it, and it always surprises me--*I* don't feel like I'm suffering.\n\nhonestly, I think the only times it's ever been an actual major problem (and not just a minor inconvenience) are when, for some reason, I can't be accommodated *at all.*  \n\nso far, this has never happened to me as an adult, and the last time I *can* remember it happening was on a school trip to a foreign country, because i didn't actually *ask* lol. that was one lesson I learned the hard way! \n\nat the end of the way, it's just a Thing that we need to accommodate for, just like how someone who can't walk very far needs to make sure there's somewhere to sit, or someone with IBS needs to make sure there's a bathroom nearby. so long as we have enough agency to be able to accommodate ourselves, I think we're fine, for the most part, and can worry about expanding when we feel like we're ready.\n\ntl;dr: i get the desire to blame yourself, but it was never your fault, and trying to force it probably would have done more harm than good, so you probably made the best choice. offer her your support, and accommodate her needs, and you're doing enough.",
      "created_utc": 1728523109.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lr6oyp8",
      "author": "SylviaIsAFoot",
      "body": "My parents were great parents who learned from their parents that they hated being force-fed food. They never forced me to eat anything I didn’t want to, but they would still encourage me to try new things and I can’t thank them enough for that. They didn’t cause my issues with food, I think I just naturally had sensory issues with certain foods and I was a naturally anxious kid as well, so it wasn’t really trauma-related at all. I say this to emphasize that it might not be your fault at all, because ARFID isn’t always caused by trauma. You might’ve tried everything you could or you might’ve wanted to ensure your daughter didn’t grow an unhealthy relationship with food, which is completely well-intentioned, and, usually, the best course of action. You didn’t force-feed her, so I don’t think you should blame yourself at all.",
      "created_utc": 1728523341.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lr6r3sn",
      "author": "LongtimelurkerWaley",
      "body": "I blame them for making it worse. \nForce feeding\nGuilt trips\nTaking away my savings \nTelling me I was going to die young, not have kids, not find love, not go on dates, and so on.\nMaking me scared of getting help by describing how “awful” it would be.\nForced to drink carrot juice everyday (went on for quite a long time) \nAnd so on.\n\nIf you’re not making it worse, I wouldn’t blame yourself. There are some tiktokers with ARFID that share their exploration of new foods, maybe this is something that could help your daughter. Dinners at friend’s houses can be scary, when I was that age I’d often bring my own food or eat before/after.  I also get anxiety discussing it.",
      "created_utc": 1728524171.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lr6sq6e",
      "author": "sarah_kaya_comezin",
      "body": "I not only have ARFID myself but I’m also a parent to a child with ARFID. When I was little there were lots of times that my parents caused unintentional trauma because of a lack of knowledge. 30 years later and I can still remember exactly how certain moments at a meal felt because of how traumatic it was. However, when I was formally diagnosed with ARFID five years ago my parents did their research, apologized for anything they’ve done that might have made it worse, and now support me however I need. \n\nI forgive them 100% for forcing me to eat 10 bites of rice pilaf because I was 10 years old, or 6 bites of okra because I was 6 years old. They were doing their best with the information they had at the time. That’s all we can do as parents. We try our best to be supportive and give our kids the best we can, but there will always be something that is out of our control. \n\nMy own ARFID comes from a different set of anxieties than my son’s does, and often his food habits will be triggering for me. I struggle with knowing when to gently challenge him on a food and when to let something go, because I over-empathize with him and put myself in his shoes. There are days when I think it’s lucky for him that I have it too and days when I think I make it harder for him. But, just like my parents, I’m doing the best I can with the knowledge I have. I’m sure there will be things that I’ll need to apologize for when he’s grown up, but I’ll tell him this same thing. \n\nI read a while ago that all it takes is one aversive event for a food to become unsafe to the consumer, regardless of whether that event is intentional or not. One time when I was 8 I ate my dinner too fast and puked up tubbouleh everywhere. Haven’t been able to eat it since. Another time, in high school I got drunk, inhaled a can of cold spaghettios, and yarfed it all over the kitchen sink. But for some reason my brain still allows me to eat spaghettios (although now I at least heat them up in a bowl, like a lady!). Those were both aversive events in my childhood but for whatever reason my brain was able to “get over” the spaghettios aversive event. Who knows why? \n\nMy point is, there’s not always a rhyme or reason to this disorder. Sometimes it just happens and there’s not a rational conclusion that can be made. \n\nGive yourself grace, apologize to your daughter if you think it will help her recovery (hers, not yours), and then move on and support her however she needs. ARFID is such an emotional sink hole and a person who has it spends so much time feeling ashamed/anxious/embarrassed/frustrated/hungry. Make sure that your daughter is able to navigate those emotions herself (and hopefully with a therapist!) without having your guilt tossed in there too.",
      "created_utc": 1728524800.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lr6ufx5",
      "author": "brightxeyez",
      "body": "Nope I do not blame them one bit. I’m (37f) the youngest of 4 and every single one of us has a little bit of food aversion. But my mom LOVES to cook and is great at it, she was always cooking big, nutritious meals for us and we just turned our nose up at it (I mean, obviously there was a reason for it that we know now but thinking back it must have made her feel awful). Also, they tried really hard to get me to try new things but I was just very, very stubborn (by the time I came around all my siblings had figured out their own ways of getting away with not eating what she cooked but I did not lol). \n\nSo, all that to say. It’s great that there’s so many new methods of parenting and things to try to work with your kids on this issue, compared to what our parents knew/had available when we were kids. But just because they’re available to us now doesn’t mean that any of them will work for your kiddo. \n\nI hope this didn’t come off mean or dismissive. It sounds to me like you’re a great mother doing all you can to help your daughter. There’s no need to blame anyone.",
      "created_utc": 1728525467.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lr6x3rl",
      "author": "overduedevil",
      "body": "no, my parents literally did everything they could to try and get me to eat “”””normally”””” but child me would just resort to starving until they gave in and let me have what i wanted. i don’t think there was anything else they could have done, it’s purely a me thing.",
      "created_utc": 1728526510.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lr6xgla",
      "author": "MrSeanSir2",
      "body": "No, I have heard horror stories on here but my parents were always kind and loving, that's the main thing.",
      "created_utc": 1728526649.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lr6z75l",
      "author": "kaeveam",
      "body": "not at all. my parents were very accommodating with my food while growing up and i know that if they weren’t, it would have seriously damaged my relationship with them AND seriously harmed me mentally (more than ARFID already does). i have only one memory of them trying the “you don’t leave the table until you finish your plate” schtick and clearly realized that didn’t work. \n\ni suspect ARFID has a strong genetic component, & IMO the way that (north american, which is my experience) societies handle ARFID/pickiness only worsens it",
      "created_utc": 1728527343.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lr708mf",
      "author": "KingTalis",
      "body": "Not at all. My parents did not cause my neurological disorder. Forcing her to eat the foods would not have helped.",
      "created_utc": 1728527769.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lr72hyn",
      "author": "SunMoonEtAl",
      "body": "my poor relationship with food was initiated by my parents, and during my childhood they were the type to force feed me different food in order to \"cure\" me. but i dont take it against them. they simply didnt understand what ARFID was; they were just trying to help me in a way that seemed logical to them. the best thing that you can do is to be a safe space to your daughter. the fact that you're in this subreddit asking for advice already speaks volumes as to your ability to become one :)\n\nyou just have to find the balance between allowing her to explore on her own and you directing her towards good food habits (which is a tricky thing to do as your actions may be perceived as \"forcing\" her to eat).",
      "created_utc": 1728528707.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lr739o9",
      "author": "Striking_Dentist_562",
      "body": "Yes but after a certain point around age 6 I was put on stimulant medications ex: adderall/ ritalin and at that point my parents were desperate for me to eat ANYTHING",
      "created_utc": 1728529033.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lr764om",
      "author": "kuromikillz",
      "body": "i don’t blame my parents. i know they tried their best. at some moments, they tried forcing me to eat, and on many many occasions, they accommodated me and made me feel safe. for me personally, it really seems like my ARFID was there since i was born so i absolutely don’t think my parents caused it in any way.",
      "created_utc": 1728530284.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lr79nls",
      "author": "dittydanni",
      "body": "9 times out of ten we blame ourselves more than anyone else. just be supportive in exploring new foods and  take it step by step",
      "created_utc": 1728531886.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lr79yum",
      "author": "humansnackdispenser",
      "body": "I do but also my parents forced me to eat, didn't see it as a red flag that I routinely didn't finish meals, took away my safe foods because they werent as healthy as my mom wanted them to be, and then snuck supplements into my safe foods when I was malnourished effectively poisoning orange juice forever.  \n\nI think there is a reasonable way to respond to a kid going through ARFID where you help them meet nutritional needs with a dietician/therapist and then there is the way that my parents acted. Like if your kid displays distress over something and your gut instinct is to force them to get over it, maybe it's time for some introspection.",
      "created_utc": 1728532033.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lr7aqz8",
      "author": "dioor",
      "body": "I don’t blame my parents. I am certain I was born wired this way. My sister is a completely normal eater. We are under a year apart and were raised in exactly the same environment. \n\nI do feel some frustration that I spent my whole childhood being doubted and not having this recognized as a legitimate issue and never getting any treatment, but forcing a kid to eat something that makes them recoil is not what I mean by treatment. That’s torture.",
      "created_utc": 1728532409.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lr7bgyn",
      "author": "missserpentine",
      "body": "Yes, that's one of the biggest reasons I won't have kids",
      "created_utc": 1728532760.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lr7boa6",
      "author": "ChrisCube64",
      "body": "I don't blame my parents FOR my ARFID, I blame my early gastroesophageal reflux in my life for that. My developing brain literally told me that most food would cause me pain and suffering. The inner wall of my esophagus was literally deteriorating with open wounds. And even after most of those symptoms went away over time, that deep rooted phycological fear never did. \n\nI will however to this day blame my parents for some of the hardships that came with it, not because I think they were malicious, but werent understanding from my fear and reactions. \n\nStuff like forcing me to stay at the table until I ate all the food I was given that I wasnt going to eat. Which I never did, I would be in phycological pain just praying that I could just go away from it, but I would be scolded at and eventually id take a bite, vomit, and be sent to my room. \n\nThat, or being made fun of literally on a daily basis for my eating preferences. It gets old after 26 years straight. \n\nI was eventually taken to a therapist by my parents, which at the time ARFID wasn't really a known thing to my understanding, but I was taken in, we had a few months of exercises and stuff, and while it perplexed my therapist, she was understanding, and when she was told of my past medical history, she immediately made that connection and, without telling me it was ARFID, she basically explained that the symptoms were ARFID, due to that previous history. So at least in the end, I got some answers, and when I finally was told that those symptoms had an actual diagnosis now, I was absolutely soothed knowing that I wasn't alone, as I thought I was for years.",
      "created_utc": 1728532859.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lr7ciy4",
      "author": "Desert_Fairy",
      "body": "I think it depends on the situations and the behavior of our parents. \n\nMy parents did everything wrong.  \n\nStarted with a complete lack of food safety which lead to me getting sick from eating food a lot. \n\nBullying me when I was afraid of eating. \n\nPressuring me when I was starving and refusing to allow me to eat any safe foods. \n\nI do hold a lot of resentment for my parents. I still love them, but I don’t trust them. And I haven’t for as long as I can remember. \n\nI have known more kind, supportive people in the past ten years than my family ever was.  But it has always been hard letting new people in and I have serious anxiety. \n\nSo it is a lifelong condition, but she can still live a fulfilling life.  It just takes people loving her for who she is and treating her like she isn’t lesser because she is different.",
      "created_utc": 1728533284.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lr7d0ou",
      "author": "alienprincess111",
      "body": "Partially.  Rather than making me eat like everyone else, my mom catered to my meals and made me things she knew i would eat.",
      "created_utc": 1728533529.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lr7fs6c",
      "author": "orange_ones",
      "body": "Not at all.  I think it’s some wrong switch in my brain (not to mention commonly comorbid with other conditions), not my parents’ actions.  I do think it’s messed up that my mom is almost as restrictive as I am, but her restrictions are I guess more socially acceptable/“virtuous”/logical in her mind, and therefore correct, whereas mine are “bad.”  But as far as having the actual disorder, I don’t blame their parenting whatsoever.  My dad pinpointed when he noticed my ARFID to a specific stage of baby food.  They could never have anticipated it and done anything different before that, especially in the 80s.",
      "created_utc": 1728534955.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lr7nwc3",
      "author": "crown-jewel",
      "body": "Not at all! My mom went through a few phases where she tried to convince to try other things (nothing too aggressive but if she had tried harder, it would have backfired and i absolutely would have resented her). She always made sure there was something I’d eat, even if it meant cooking two meals. \n\nConversely: I still v much remember telling her friend I didn’t want to try something AT ALL when I was ~4 and *she* forced me to try it anyways and I ended up throwing it up all over her dining room. Sooo karma? Fortunately her friend also never forced it after that.",
      "created_utc": 1728539559.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lr7ot6k",
      "author": "Darius_Oak",
      "body": "My parents had their fair share of goofs, but nothing they did made my ARFID any worse or better. Accepting that I had a genuine problem and working within my limitations is the best thing they could have done, and that’s exactly what they did.\n\nI blame them for nothing, and I doubt your daughter blames you (beyond being 17 and blaming her parents for everything). ARFID is about fear, not necessarily preference. None of us wants to be this way, but we manage. Having supportive family goes farther than it may seem.",
      "created_utc": 1728540127.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lr7oteb",
      "author": "xXNighteaglexX",
      "body": "Not at all, I never once thought my parents caused it. Dont tell her you think that, it may not do any good. All you can do is support her and maybe seek professional help. Only eating familiar foods is a lot better than nothing at all",
      "created_utc": 1728540130.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lr7r514",
      "author": "laiisquish",
      "body": "Absolutely not! If anything, I blame myself.",
      "created_utc": 1728541613.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lr7sjsm",
      "author": "Ksanral",
      "body": "My parents never forced me to eat food I didn't like and always accommodate my restrictions. They also made sure my friend's parents knew I couldn't eat most things and suggested what to make for me.  \n\nI tried to explain to my mum what ARFID is, but she blames herself for not \"teaching\" me to eat everything when I was little. She doesn't understand it is an ED and (in my case) is linked to my autism. \n\nIf you are not forcing your daughter to eat non-safe food, but you just let her be, I don't think she'll blame you.",
      "created_utc": 1728542538.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lr7tdol",
      "author": "0pyrophosphate0",
      "body": "Depends on how you define \"blame\".\n\nDid they in fact often do things to cultivate an unhealthy relationship with food and meal time? Yes. In a lot of ways, I'd say they did a pretty crappy job overall, but... they were young. *Too* young. And they didn't have a lot to work with. They didn't understand, and didn't know what to do.\n\nDo I blame them? Personally, I don't like the concept of blame, most of the time. I don't think it's useful. I guess you could call that a no. But if I met another person with exactly the same upbringing, I wouldn't think it was unwarranted or surprising if they said yes.",
      "created_utc": 1728543079.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lr7z3tc",
      "author": "Mustard-cutt-r",
      "body": "I think the resentment would only come if the parents forced the kid to eat or punished or shamed or embarrassed them about it. We have completely surrendered to it, and ya know what? Everyone is happy at the dinner table again. AND he’s more willing to take a teanie tiny bite to try something. But it’s a morsel.",
      "created_utc": 1728547127.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lr80nx8",
      "author": "apizzamx",
      "body": "No. My abuser did force me to eat foods that made me gag/cry which impacted the ARFID and made it worse, but overall my mum never could’ve done anything to stop it from being there (as mine likely is just from my autism, which of course could not be helped)",
      "created_utc": 1728548249.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lr88vf6",
      "author": "jpizzahhh",
      "body": "Nope. When I was younger, and probably your daughter too, no one was talking about ARFID. When I went to treatment and had a family session with my parents, my dad brought up how they used to hold me down to give me medicine because I was sick a lot and wanted to know if it was their fault I had ARFID. I was surprised and never even made the connection. Yes that was traumatic, but I still know there are many factors in me having ARFID and I don’t even know that that is one of them. Of course my parents could have supported me more had they known, but I know they’ve always done the best they know how.",
      "created_utc": 1728554068.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lr89naw",
      "author": "IpDipDawg",
      "body": "I grew up in the nineties and my food issues were treated as bad behaviour and not as a condition. As a result my parents handled the situation very badly. On a regular basis my father would scream, threaten and hit me while I sat staring at plates of food, occasionally he would physically restrain and try force feed me, when this would fail he'd rub food all over my face, it was incredibly distressing and traumatic. As a child I dreaded every social gathering and family mealtime because I knew there'd be the routine shaming and humiliation, I'd have to sit there while everyone ate, laughing, ridiculing and berating me, I honestly felt like I deserved it and was a defective person, it was this huge thing in my life and literally every single birthday wish I had as child was to just be \"normal\".\n\nMy mother had (and still does) have a lot of anxiety and would attempt to scare me into eating with various lies, that I would never be able to find a partner and \"what would I eat on my wedding day when everyone I knew was looking at me?\", the worst example of this was telling me I wouldn't survive until I was eighteen. My family played along and I believed this and instead of \"scaring me straight\" it instead caused me to accept it and I grieved my own life at a young age, by the time I was a teenager and realised none of it was true, I had severe depression, anxiety and difficulty forming relationships, I wanted nothing to do with my family and moved to the other side of the world at nineteen to try and start again.\n\nNow in my 30s I've moved home. I've had quite a bit of counsellng over the years and I've had to try and resolve this for the sake of my own family, I'm a father to two young girls now and even though they don't have food issues I just can't imagine doing to them anything like what was done to me for any reason. I needed to try and face it directly though and move on.\n\nI tried to have a frank discussion with each of my parents about what happened. I told my father that it was something I didn't choose and that the physical stuff he did was really damaging. He immediately apologized and acknowledged that it was wrong, he was father to four boys, he had lost baby before us and had to cope with my mother having a breakdown, he was drinking, struggling and his anger and frustration shouldn't have been levelled at me, he said he loved me and he was sorry. I could at least understand this and I now have a good relationship with my Dad.\n\nMy mother on the other hand was more interested in finding out details of the condition so it would absolve her guilt over my eating habits. I tried to explain that the condition itself is nothing in comparison to the psychological damage I suffered because of it, the pressure that I was put under, the shame and guilt I was buried in and the lies I was made to believe. I wanted to explain that the mixture of love, care, disappointment, guilt, shame and fear that she imparted on me did more damage than anything else, I can't trust people, I have difficulty with close relationships because of what people might expect or demand from me that I can't give them and it still profoundly affects me to this day. If it was only the condition to deal with I can just get enough calories and take a multi-vitamin FFS.\n\nMy parents aren't bad people, but they made really bad decisions, they've had plenty of their own traumatic events in life and they were scared, overwhelmed and didn't understand this thing. I'm almost sure now that my Mother has ASD that was never diagnosed, she has visible stims and is just a very textbook case of a female presentation of Autism. She can't or won't understand where I'm coming from and this has caused our relationship to be strained ever since, she'll still comment on my food or bring up stories of my childhood laughing, no matter how many times I make it extremely clear that it's not acceptable. What makes it worse is that my oldest brother openly says to me and other family members that I should be \"lucky to have it as good as I did\" and that I'm being overly-sensitive. While I'm sure there's some truth in that, it doesen't change the issues I've been dealing with ever since and doing my best to get past.\n\nAnyways, in my view you asking this question is enough to show that you care about your daughter's condition, that you recognise it as a condition that she didn't choose and that you want to help her. For me that would've been an amazing parent. Keep trying to help her and aleviate any feelings of shame, guilt and anxiety and I'm sure you'll be okay.\n\nWith the right approach things can and do get better, My ARFID is significantly better than I was as a child / teenager.  \nBest of luck",
      "created_utc": 1728554579.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lr8ewr0",
      "author": "Luthenya",
      "body": "Hi dear, I'm a bit late to the party as I live on a different continent but if you're up for some story time, here we go:\n\nI'd *never ever* blame my parents for anything I struggle with! That said, my parents (especially my mom) have always been very supportive, both regarding food and in general with emotional support. They made me tiny portions of new things to try, but my mom would always make a safe meal for me. So I always had the security of knowing I'll be able to eat something, and try new stuff if I wanted to. No one was upset when I didn't want to. She'd invite me to join her while cooking (also stuff I don't like), so I'd get accustomed to it without having to actually eat it. And now in my 30s, I think that was a great idea!\n\nBased on your comments I believe you're a very supportive parent, too. And I highly doubt you have caused your daughter's ARFID. Do the best you can to support her in her journey, and remember no one is to blame! It's tough enough for her, all you can do is give her options and support her. It's vital to have her blood checked for (micro)nutrients so she may stay healthy, and maybe supplement what she does lack. No pressure to ingest these lacking nutrients through food, though. This can come over time. \n\nFor me personally, my arfid is related to autism, and it does get worse when under pressure. Not having had the opportunity to get therapy but by being content with myself, not making a big deal out of my eating behavior (that is, not pathologizing it, not focusing on it, not thinking about it), I do eat much more stuff nowadays, out of pure curiosity and with patience! \n\nWhenever under pressure though, it does get worse and I lose my appetite. One example: I'm currently staying abroad at my in-laws' house without my spouse's support, and I am constantly being reminded of my ARFID, being asked if I like this or that, and whether I have always had this problem with eating (no, I have never had a problem with it! it was always others who had the problem and couldn't just accept me the way I am!) - \"funny\" jokes being made about hypnotizing me and force-feeding me - I feel restricting myself more and more and losing my appetite completely. Whenever at home or at my mom's though, it's much better. \n\nI believe your daughter is already gifted with a loving, caring environment, and she's very lucky to have you. Please be as kind to yourself as you are to your daughter, you both deserve it :)",
      "created_utc": 1728557843.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lr8he2b",
      "author": "ToukaMareeee",
      "body": "No, I don't.\n\nI have it the most with fruits. Lots of other food items too but a but less noticeable. My parents did make it worse, they never forced but they tried EVERYTHING to get me to eat just a quarter of a grape, till tears were streaming on both sides out of hopelessness. It didn't help my association of fruit = bad. \n\nBut it was also what was the most logical to do without knowing what was actually going on. There emught be many books on parenting, but none of the a re a one size fits all Procedure of Operation. Parenting is also jsut kinda fuck around and find out, so I don't blame them at all. And even if they didn't make it worse, I probably would have the same problems anyway just maybe a but less severe. Fruits are so important in a daily diet I don't blame them at all to find soemthing I did like, or to find ways I would eat them even if it was a bit. It might not have worked. But maybe it would on someone who \"simply\" didn't like it. Just not on me. But how would they know when I was an age where I could barely articulate myself to begin with? \n\nI do agree with the people to not let her know you blame yourself. It already feels so humiliating and like you're a burden in everyone else when it comes to food because alterations have to be available most of the time. If you say you blame yourself, that feeling of being a burden will grow stronger. Maybe when she's older, like adult living on her own for at least a while. But not at 17, when insecurities outside of arfid are also raging wild. \n\nBut also, it's not your fault. There can be many reason for someone to have arfid and not all are rooted in parantage. For me it's autism. Basically all fruits have something overwhelming one way or another. And like I said, there's not a one size fits all manual for parenting. You did what you could and that's what counts. Try to help her cope instead. Make sure there's always safe foods available for the moments it's needed. Be there for her when she tries something new. Be there for her to gain the confidence of saying \"no thanks, I don't like it\", even if it's over and over again, without feeling rude or like a burden. To me, from the other perspective, that's what counts.",
      "created_utc": 1728559194.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lr95u88",
      "author": "None",
      "body": "Yes I do to an extent. However my DNA donors were extremely abusive. I think my ARFID stims from autism and coupled with decades of abuse it just spiraled out of control. \n\n\nYou don't seem to be that type of parent though. I don't think she blames you and you shouldn't blame yourself either. ",
      "created_utc": 1728569496.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lr95v14",
      "author": "blubbelblubbel",
      "body": "I would never, ever blame my parents. imo, my mom did everything right. she never forced me to finish my plate except for a handful of cases where I messed with the food in a way that made it inedible for anyone else or helped myself to more seconds than I could eat, but she wasn‘t cruel about it and no harm was done to me other than being a bit nauseous afterwards haha. she encouraged me to try new foods but never forced me to eat it. she never got mad at me for not liking something.\n\nI‘m convinced that my arfid would be way worse if she had done any of these things and I‘m insanely grateful for how she handled this.",
      "created_utc": 1728569504.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lr96cme",
      "author": "ColorfulPizzas",
      "body": "It's not your fault. Arfid is something that is not under anyone's control. It is like having any other mental health issue. Your daughter might benefit from seeing a therapist. I'm a parent of a kid with arfid. Until we talked to a therapist that knew about arfid we (me and my husband) were so confused about why it happened and blamed ourselves but were quickly assured it wasn't our fault. For my son it was most likely triggered by him having a tongue tie which caused choking when he was an infant. And he might have autism so our next adventure will be figuring that out. Anyway you should check out the list of professionals listed in this subreddit. That's how wee found our therapist! At least give your kid the option to go to therapy in case she is wanting to get strategies for when she is out with friends and can't have her safe foods. My son gets very anxious about this too and therapy helps him to learn techniques to lessen his anxiety about food! It's wonderful.",
      "created_utc": 1728569675.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lr97ivw",
      "author": "canadave_nyc",
      "body": "Yes. My ARFID is 100% caused by my parents (or close to it). \n\nOne of my earliest memories is that my dad would scream at me to eat at the dinner table. To get me to eat different foods, my mom would slip foods I didn't like into things I did like--I vividly remember my revulsion at finding some kind of banana thing in a chocolate malted milkshake she had made me.\n\nIt was traumatizing, and I still haven't gotten over it. I've never told them (and never will at this point, since they're elderly and there's no point devastating them in the last few years of their life), but it's always bothered me.",
      "created_utc": 1728570079.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lr9d6a4",
      "author": "TheGreatManitou",
      "body": "No, I do not blame them. I do not think they are responsible for me having ARFID, that's just how I am. And I got to say, that even while we were not the richest family at all, on the contrary, I had safe foods available most of the time. Not always, there were frustrating days... And they could have been more inclusive, making sure that I will have some safe foods on the holidays and on social gatherings. But I realize only now, how expensive some of what was my safe foods are, and I had them available most of the time, even although of our struggles. And I appreciate that. I gotta add tho, that I doubt my parents even knew and know what ARFID is, and that it has a name. I myself didn't know that until recently, and it is still widely unknown.",
      "created_utc": 1728572003.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lra2osm",
      "author": "MaleficentSwan0223",
      "body": "I’ll be fully honest. I don’t blame my parents for my food issues. I blame them for not showing me what love was, not making me feel safe or secure and for constantly making me feel worthless because of my food issues. ",
      "created_utc": 1728580363.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lra5vws",
      "author": "JoChiCat",
      "body": "Nah, I’m just like this. Doesn’t matter what my parents might have done differently, I always would have been a “picky eater”. My grandma is actually almost exactly the same in her eating habits, much to grandad’s exasperation, so I wouldn’t be surprised if there’s some genetic aspect to it. \n\nFrankly, I’m glad my parents rarely pressured me to eat things I flatly refused, and even then it was usually only a request to try at least one bite. Forcing me to eat things wouldn’t have beaten me into liking them, it would have made me even more anxious and avoidant of eating in front of people or trying new things. I survived childhood reasonably healthy, and that’s all you can really ask for.",
      "created_utc": 1728581384.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lra7ipf",
      "author": "louxxion",
      "body": "I believe anyone with ARFID would blame their parents if they had neglected or abused them BECAUSE of their ARFID. You are a good parent. You care. You are concerned. You are not starving or forced-feeding your child. \n\nUnfortunately, the very nature of ARFID is to be anxious and restrictive around food. I'm 23 and *still* feel that way! You are doing your best and I'm proud of you.",
      "created_utc": 1728581909.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lrabp8y",
      "author": "Fresh-Bodybuilder719",
      "body": "Defenitely not! I completely understand where you come from though.\n\nAnd as a little piece of advice for your daughter; I'm also 17 and defenitely recognize the anxiety part your daughter experiences. The best way that I've learned to deal with it is to just be honest with those friends and fully explain how my Arfid works and how it affects me. My friends have been absolutely supportive and understanding qnd often ask me about what I want to eat if we do end up eating together. It also helps to look up the menu if you're going out to eat anywhere or just bring snacks with you everywhere :)",
      "created_utc": 1728583243.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lrafack",
      "author": "ocean0164",
      "body": "ARFID is caused by many different reasons and it differs for everyone. my ARFID is caused by various factors, from being neurodivergent, having OCD, and from trauma. Partially, I do blame my parents, the reason due that the trauma was caused by my parents forcing me to eat foods that I couldn’t eat. that were not in my safe list, that would trigger my sensory issues. I would be screamed at horribly until I cried, I would be physically held down and not allowed to get up, my dad would get in the way if I tried to get up. my dad is an abusive man, so you can imagine how terrified I, a little girl, was when he would scream at me and block my way. I would be forced to eat certain foods to the point where I would throw up. I first began developing ARFID when I was 3, I was diagnosed with it when I was 15, and now at 18, I’m finally recovering. I didn’t start my recovery process until now. I couldn’t find the proper treatment because my family couldn’t understand my diagnosis and the ED recovery centers I went to weren’t properly trained to treat my ED and it wasn’t until I experienced some freedom away from them that I was able to finally to heal a bit and recover a bit from that aspect from the trauma",
      "created_utc": 1728584408.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lrao714",
      "author": "None",
      "body": "No, I don’t blame anyone. I try and blame myself to have something to cope with how rough this eating disorder can be some times. My parents can be a really supportive avenue when they listen, hear me out, and don’t feel childish for having this disorder. Then again I am a little older than your daughter but even if she’s not appreciative of your support now, she probably will be in the future :)",
      "created_utc": 1728587283.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lrbj987",
      "author": "siburyo",
      "body": "I do blame my parents. I forgive them, but yes, I blame them. Much different situation than yours, though. My father used to force me to eat foods that made me gag. Had to do the whole throw up in my mouth and swallow it rigamarole. I guess he thought that I would eventually get used to it, but quite the opposite, anything I was forced to eat still makes me gag and throw up in my mouth, still, at the age of 36. Foods I disliked but wasn't forced to eat I can manage much better. \n\nMy father would never apologize for anything, but still, I can tell he regrets it, so I forgive him. But I know this is the reason I will never have a healthy relationship with food. \n\nAs for my mother, she was better, and wouldn't force me to eat foods, but still did one thing that greatly contributed to my anxiety around food. I was never allowed to just \"not eat\" a food, even if that food one just one of several things being served. I was only permitted to not eat a food if a replacement was provided. So, the biggest thing we fought over was potatoes, and my dad would want to force me to eat it, but my mom would want to make rice as a replacement. Eating the vegetable and meat (I'm ok with most options in those categories) alone was never, ever an option. So, when we went to a relative's house for the holidays, she would insist on making a replacement so she could talk and not have to sit there and force me to eat my potatoes bite by bite. And then the relatives would talk shit about how I \"forced\" my mom to make this rice. It was really embarrassing and definitely contributed to my anxiety and shame around food. Especially eating around others. Hard to say I blame her because I know she meant well, but it definitely contributed to my antagonistic relationship with food.\n\nI don't think you should blame yourself with your daughter, because you haven't done anything fucked up to her regarding ARFID. You just haven't done anything. There are techniques you could have tried, but forcing someone to eat a food is definitely not it. If you'd didn't know those techniques, it's better to do nothing because at least not she doesn't have trauma surrounding food. Don't beat yourself up over not having looked up those things earlier, there's a lot going on when you're raising a child. But at least now she can try doing some of those things from a position of not already having intense anxiety from being forced to eat foods. If she wants.",
      "created_utc": 1728597411.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lrbmcgy",
      "author": "aroaceautistic",
      "body": "Tbh my range of foods would probably be wider if my parents had made more varieties of food available to me, but I still don’t blame them because even within what they did feed me my eating was restricted. I appreciate that I was never forced to eat. I think that would have been harmful for me. At least now as an adult, it is easier to introduce foods that are unfamiliar than foods that I hate because I’ve eaten them and learned to hate them.",
      "created_utc": 1728598539.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lrck9bf",
      "author": "None",
      "body": "No - my situation is probably too specfic but my parents definitely aren't to blame. I developed trauma around food due to an undiagnosed GI issue, my parents tried to get me medical help but I stumped doctors for a literal decade. Even though I have an answer now and am able to manage my symptoms, my brain rejects food when it's not sure whether or not it will harm my body.\n\nThe best thing you can do is support and accommodate her, praise her for trying new foods without forcing anything. In my own experience, being forced to eat food I didn't want put those meals at the top of my \"disgusting\" list and made it almost certain I wouldn't try them again",
      "created_utc": 1728611303.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lrcyg2q",
      "author": "Calm_Aardvark_6548",
      "body": "I don’t blame my parents! I was very lucky in that growing up they were very accommodating with me being “picky” (lol not picky, traumatized) while still trying to introduce new foods. I wasn’t forced to eat anything or finish my meal, and we would sit down at meals with me being the only one with a different dinner than everyone else. \nI know my issues stem from a choking incident as a child, and were then exacerbated by some jaw mobility problems. While I understand they probably could have tried harder to “make” me eat things I didn’t want to, now in my 30’s, I’m much more open with them about what I’m trying to incorporate and they are very encouraging. There may have been a time when I wished they did something different, but at this point, I know my food issues weren’t more severe because of them.",
      "created_utc": 1728616960.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lrfhimk",
      "author": "HarviMelody",
      "body": "I blame my parents a little, I love them and all but they always gave me and my brother the same foods that were very unhealthy every day. They never made us try anything and me and my brother are now both adults with arfid who have the same comfort foods and all😭",
      "created_utc": 1728662490.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lrhuq6h",
      "author": "Aromatic-Lobster7738",
      "body": "My daughter was recently  diagnosed with ARFID. I also kinda blame myself for not  forcing her to try more foods as a toddler. I did try, but it probably wasn't consistent enough.  After a while, I just gave up thinking she'd grow out of it. Well she didn't and here we are....",
      "created_utc": 1728692344.0,
      "score": 2,
      "context": []
    },
    {
      "id": "n3a6ndr",
      "author": "bbunkii",
      "body": "This describes me so well I thought you were my mum 😭",
      "created_utc": 1752595419.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lr5ovmi",
      "author": "willemlispenard",
      "body": "this is a good question actually. If you’d ask me a year ago, I’d say yes. But I have a valid reason for that. My parents actually would set a timer because I ate too slow and made fun of me for having a physical reaction to certain foods and a whole lot more. \n\nBut tbh? now, I’d say no.  I don’t. It’s something I just struggle with through no fault of theirs. Somwthing I have always struggled with. Did they mess up and make things worse? at times. But I don’t blame them. I was extremely difficult and every meal would be a battle for them as well. They did what they could and nowadays they help me a lot",
      "created_utc": 1728509969.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lr6whrv",
      "author": "DefinitelynotDanger",
      "body": "I think it's my parents fault. But I don't blame them. It must be awful having a child that won't eat healthy food. The frustration of making food that goes to waste. It's hard for us but being a parent is hard too. I know they did their best.",
      "created_utc": 1728526267.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lr7e397",
      "author": "tekrmn",
      "body": "you're asking the wrong question, your focus should be on supporting your daughter and not on how her (possible) eating disorder impacts you. this isn't about you. you should be taking her to a professional for help.",
      "created_utc": 1728534077.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lr5sw2e",
      "author": "heartoffiction",
      "body": "I do in some ways for sure. When I was a kid I would throw up anything I didn’t like so my parents stopped trying to introduce foods and I only had 5-10 very unhealthy safe foods until my adult life. I don’t blame them for me having it but I am a bit frustrated that they just… gave up on me?? My mom was a stay at home mom and I’m an only child, and they’re relatively well off. It’s not like they didn’t have the time or resources to try to help me, they just threw in the towel and decided I was a permanent picky eater. (And then complained endlessly to anyone with ears about how picky I am). So I don’t think they caused it since it started as a baby for me but I do definitely harbor frustration that they never idk thought it was strange that their child threw up at even the sight or smell of certain foods and thought to take me to a specialist or something?? I know this is a pretty new disorder classification so not sure what resources would’ve been available 20 years ago but even a little more of their patience and understanding to work with me and find out why I was reacting that way and maybe see if there were other things they could add to my diet to help me grow up healthier. Because now I’m chronically ill and my mom blames it all on me only eating bread as a kid 🤨",
      "created_utc": 1728511333.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lr5swcr",
      "author": "heartoffiction",
      "body": "I do in some ways for sure. When I was a kid I would throw up anything I didn’t like so my parents stopped trying to introduce foods and I only had 5-10 very unhealthy safe foods until my adult life. I don’t blame them for me having it but I am a bit frustrated that they just… gave up on me?? My mom was a stay at home mom and I’m an only child, and they’re relatively well off. It’s not like they didn’t have the time or resources to try to help me, they just threw in the towel and decided I was a permanent picky eater. (And then complained endlessly to anyone with ears about how picky I am). So I don’t think they caused it since it started as a baby for me but I do definitely harbor frustration that they never idk thought it was strange that their child threw up at even the sight or smell of certain foods and thought to take me to a specialist or something?? I know this is a pretty new disorder classification so not sure what resources would’ve been available 20 years ago but even a little more of their patience and understanding to work with me and find out why I was reacting that way and maybe see if there were other things they could add to my diet to help me grow up healthier. Because now I’m chronically ill and my mom blames it all on me only eating bread as a kid 🤨",
      "created_utc": 1728511333.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lr5te33",
      "author": "heartoffiction",
      "body": "I do in some ways for sure. When I was a kid I would throw up anything I didn’t like so my parents stopped trying to introduce foods and I only had 5-10 very unhealthy safe foods until my adult life. I don’t blame them for me having it but I am a bit frustrated that they just… gave up on me?? My mom was a stay at home mom and I’m an only child, and they’re relatively well off. It’s not like they didn’t have the time or resources to try to help me, they just threw in the towel and decided I was a permanent picky eater. (And then complained endlessly to anyone with ears about how picky I am). So I don’t think they caused it since it started as a baby for me but I do definitely harbor frustration that they never idk thought it was strange that their child threw up at even the sight or smell of certain foods and thought to take me to a specialist or something?? I know this is a pretty new disorder classification so not sure what resources would’ve been available 20 years ago but even a little more of their patience and understanding to work with me and find out why I was reacting that way and maybe see if there were other things they could add to my diet to help me grow up healthier. Because now I’m chronically ill and my mom blames it all on me only eating bread as a kid 🤨",
      "created_utc": 1728511495.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lr5thmd",
      "author": "heartoffiction",
      "body": "I do in some ways for sure. When I was a kid I would throw up anything I didn’t like so my parents stopped trying to introduce foods and I only had 5-10 very unhealthy safe foods until my adult life. I don’t blame them for me having it but I am a bit frustrated that they just… gave up on me?? My mom was a stay at home mom and I’m an only child, and they’re relatively well off. It’s not like they didn’t have the time or resources to try to help me, they just threw in the towel and decided I was a permanent picky eater. (And then complained endlessly to anyone with ears about how picky I am). So I don’t think they caused it since it started as a baby for me but I do definitely harbor frustration that they never idk thought it was strange that their child threw up at even the sight or smell of certain foods and thought to take me to a specialist or something?? I know this is a pretty new disorder classification so not sure what resources would’ve been available 20 years ago but even a little more of their patience and understanding to work with me and find out why I was reacting that way and maybe see if there were other things they could add to my diet to help me grow up healthier. Because now I’m chronically ill and my mom blames it all on me only eating bread as a kid 🤨",
      "created_utc": 1728511527.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lr5vlk0",
      "author": "QueenIgelkotte",
      "body": "Yes very much. But in another way. Giving safe foods is good! \nIts even been confirmed by my therapist that it was made worse by my parents. They forcefed me food I didnt like or punished me if I didnt eat it. Instead of just not putting tomatoes and large pieces of onions in dishes. When I was around 16 they stopped cooking lunch for me and sometimes not dinner either. They just couldnt be bothered. So I just didnt eat most of the time.\n My older brother was very good at cooking and made me my safe foods and slowly introduced new things. One thing at a time and always in tiny tiny pieces so I could get used to it. But then he moved out. Eventually me too and then he held a mini cooking class with me and I made it my mission to learn to like cooked mushroom. It took 2 years but it worked. Now my brother is a chef and invites me over for \"scary new dish\" lunch every other week. But really same concept, safe foods with a twist. But I TRUST him to make good food so after 3 years pretty much all food cooked by him is safe food. My parents still refuse though. They just give me some money and tell me to go buy whatever food I want.",
      "created_utc": 1728512287.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lr5vm5l",
      "author": "Eastern-Occasion801",
      "body": "my parents exposed me to so many foods but i still have arfid. i had it since i was a baby, i wouldn’t even take a bottle and i was always a bad eater. it’s not your dault",
      "created_utc": 1728512293.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lr5x2kc",
      "author": "Chatkathena",
      "body": "I'm that girl (not actually but I'm also 17 and feel like this )\n\nFuck yeah my family's diet ass culture lifestyle was a major factor",
      "created_utc": 1728512830.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lr99gjd",
      "author": "Equivalent_Lettuce55",
      "body": "My dietitian actually wrote my mother a note after my assessment to say it’s not her fault and she did all the right things for me in childhood which was sweet.\n\nI’m not mad at her for it, I think the best was done under the circumstances during a time when ARFID didn’t even “exist” (within the pages of the DSM-5 anyway). She always made sure I had safe foods, didn’t pressure me, didn’t shame me for my eating habits. \n\nYour hypothesis of why you think you’ve done wrong is like the one my sister tried to give me when I told her about my diagnosis: “do you think that’s your mothers fault for only giving you food you liked at meal times?” No, I don’t, and neither do the professionals helping me with it, I was given a safe place to fuel myself with my preferred foods. You have done the same for your daughter. In this scenario, I think you can take the blame off yourself. \n\nI’m 28 now and almost a year into treatment since I was officially given an ARFID diagnosis. Mom is super supportive and happily helps prepare foods I’m working toward on my exposures list with no pressure.\n\nAt her age I was keeping all of those food anxieties to myself, plus everything else, ha. My rare moments of vulnerability are usually a cry for help, so I’d gently capitalize on anything related to food anxiety and say you’re here to support and drive whatever it is she wants to do. If I could have just one thing different in my ARFID journey, it would be to have someone eliminate the burden of driving the process myself: won’t lie, it’s exhausting and mentally draining.",
      "created_utc": 1728570741.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lrae5in",
      "author": "Willing-Dance-7205",
      "body": "Im 17, and sound quite similar to your daughter. i’m not diagnosed but its suspected since ive been so restricted with almost all but a handful of foods since i was about 3/4? I don’t blame my parents at all, in fact ive had a very similar conversation with them as you’ve had with your daughter.  since i was around 12/13 they stopped pressuring me to eat foods i wasn’t comfortable with and started making sure i always had safe foods available. I think before that, like most parents would , they thought i was just a picky eater so would try and make me eat foods i didn’t like (and most of the time failed). it would usually end in tears and me being sat at the table 2 hours later gagging 😂 which definitely wasn’t nice but i again don’t blame my parents for that. They didn’t know much better and only really realised it wasn’t just pickiness and was quite severe sensory issues. i wouldn’t think of them giving me access to safe foods as enabling because quite frankly i would be a lot more malnourished if they hadn’t . I do think that if they hadn’t given me my safe foods it would’ve been the equivalent of starving me. \ni think the best thing to do is make sure your daughter has her safe foods, but also giving her a safe space to try foods with you. i don’t know if your daughters eating is due to textures or fear of sickness/choking etc, but i found cooking with my parents (even if i wasn’t planning on eating it) would help me realise some foods aren’t as bad as i thought . hope everything goes well for the both of you:)",
      "created_utc": 1728584040.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lraj1r2",
      "author": "Letshavemorefun",
      "body": "No absolutely not. My parents did their best with the tools they had. They didn’t know it was a clinically diagnosable eating disorder cause back then.. it wasn’t. But they did their best to accommodate me anyway. \n\nI have another family member (not a sibling, so different parents) who has it too. I think it’s at least partially genetic (and so do their doctors). \n\nThe only time I blame parents of children with Arfid is if they try to force certain foods on their children. You know - the whole “you eat what I’m cooking or you go hungry” thing (which it sounds like you haven’t done but wish you did?). Luckily, my parents never did that. **Do not do that. It backfires. Fed is best.**",
      "created_utc": 1728585621.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lras1g0",
      "author": "Fit_Armadillo_5151",
      "body": "Its not too simple. On the 1 side u should have maken her eat the foods she didnt like so it wouldent be as hard to try new stuff. On the other side you are now a person that can be trusted whit eating and wont make her feel pressured to try new stuff",
      "created_utc": 1728588520.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lrdmg7h",
      "author": "teenytinyfiesty111",
      "body": "It sounds like someone tried to do the whole “I told you, you were too soft” and you’re doubting yourself for doing the absolute right thing. \n\nIt actually is so helpful to me when people are going out of their way to make sure there’s a safe food where we are going. \nPeople who create safe places for me to eat my safe food without judgment are more likely to see me want to come out and try something new.",
      "created_utc": 1728630358.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lreu3n0",
      "author": "CynicismNostalgia",
      "body": "I do inna way but, my mum was very unwell in and out of hospital so not her but my dad was...just not a great parent. I found a way to find food and survive for myself until my mum's health settled but by then it was too late",
      "created_utc": 1728654608.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lrhnieh",
      "author": "StacyGrace97",
      "body": "The only reason why I blame my parents is because they forced me to eat things that weren’t safe to me at all. And when I was physically incapable of tolerating those foods, I was punished and left hungry which was extremely traumatizing and festered into another eating disorder on top of ARFID (which I’m still dealing with as an adult). You allowing her to have something she was able to tolerate vs. what she didn’t like and/or couldn’t tolerate is love. And you’re reaching out to better understand her condition which is amazing. You are not to blame my friend 💕",
      "created_utc": 1728689374.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lruja0s",
      "author": "ThrowRA-82837347",
      "body": "slightly because my mum is a terrible cook, was kinda forceful and hid things in my food, and if I had an amazing cook as a mother I might not have arfid as severe. Also I would've appreciated a healthier variety of what I ate. I was always a beigeivore and my mum could have cooked a healthy beige meal but instead my diet was always things like pot noodle, a homemade variety of noodles and chicken would've been better and encouraged me to slowly add new things to it like veg. However I started showing signs of arfid very young and there is a link to arfid with autism which I am diagnosed with, so it was probably inevitable. I think arifd also makes us more likely to be better cooks because we're extra sensitive to texture and taste so we perfect what we cook",
      "created_utc": 1728894916.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lr5xwwe",
      "author": "ihtm1220",
      "body": "Ok thank you I will keep that to myself",
      "created_utc": 1728513147.0,
      "score": 28,
      "context": [
        {
          "id": "lr5pdro",
          "author": "ollie_rosie",
          "body": "You can’t let her know you blame yourself because all that does is lead to her feeling even worse than she probably already does, Support her but don’t make it about yourself, Arfid isn’t caused by you giving into not making her eat things when she was little, be patient with her it’s no one’s fault and no one’s to blame in this situation",
          "created_utc": 1728510142.0
        }
      ]
    },
    {
      "id": "lr6r8jk",
      "author": "LongtimelurkerWaley",
      "body": "Yes. Having parents share their feelings on this is devastating.",
      "created_utc": 1728524221.0,
      "score": 14,
      "context": [
        {
          "id": "lr5pdro",
          "author": "ollie_rosie",
          "body": "You can’t let her know you blame yourself because all that does is lead to her feeling even worse than she probably already does, Support her but don’t make it about yourself, Arfid isn’t caused by you giving into not making her eat things when she was little, be patient with her it’s no one’s fault and no one’s to blame in this situation",
          "created_utc": 1728510142.0
        }
      ]
    },
    {
      "id": "lrajjgr",
      "author": "Letshavemorefun",
      "body": "Yeah exactly. It sounds like OP regrets not doing the exact wrong thing. \n\nSo again- OP - please please please do not try to force unsafe foods on your child. That is the exact wrong thing to do with Arfid. If you take anything away from this thread, please let it be this.",
      "created_utc": 1728585780.0,
      "score": 11,
      "context": [
        {
          "id": "lr5rf29",
          "author": "ChaoticMornings",
          "body": "I do, but, my mother forced me to eat. Like, pushed my face in it if I refused, punished me if I didn't. Let me sit for an hour or more untill I had finished my plate. Made things I disliked on purpose and I had to eat it all week, for lunch and dinner. And always accused me of having anorexia/boulimia, to the point that I was not allowed to flush the toilet anymore untill she had checked it. \n\nSo that is the opposite scenario. \n\nI actually am one of the few who doesn't have to worry about safe foods tho. I know my father used to let me try lots of things. Olives, fish, calamaris. My grandmother made me familiar with lots of veggies. \n\nBut my parents seperated when I was 9, and my mother never cooked a decent meal. \n\nIn general, I rarely have a feeling of hunger. I can't eat much, more like a childrens sized portion, I am underweight, I do not enjoy eating, and have many other ARFID symptoms. \n\nYes. I blame my mother for my symptoms, but, I guess even if I had no symptoms at all, I would still blame her for being abusive. \n\nWith my toddler, I encourage her to try. She has to try a tiny bit of a new food, if she does not like it, she doesn't have to eat it. What am I supposed to do? Force it down her throat? Sometimes she likes what she tried, sometimes she doesn't. Next time, we try again. If she throws a fit, we let her \"win\". Better to finish the rest of the plate than to have her crying and refusing all of it because she is upset I guess.",
          "created_utc": 1728510847.0
        }
      ]
    },
    {
      "id": "lrhntie",
      "author": "StacyGrace97",
      "body": "We have a very similar childhood story when it comes to this, I’m so sorry 💕",
      "created_utc": 1728689498.0,
      "score": 2,
      "context": [
        {
          "id": "lr5rf29",
          "author": "ChaoticMornings",
          "body": "I do, but, my mother forced me to eat. Like, pushed my face in it if I refused, punished me if I didn't. Let me sit for an hour or more untill I had finished my plate. Made things I disliked on purpose and I had to eat it all week, for lunch and dinner. And always accused me of having anorexia/boulimia, to the point that I was not allowed to flush the toilet anymore untill she had checked it. \n\nSo that is the opposite scenario. \n\nI actually am one of the few who doesn't have to worry about safe foods tho. I know my father used to let me try lots of things. Olives, fish, calamaris. My grandmother made me familiar with lots of veggies. \n\nBut my parents seperated when I was 9, and my mother never cooked a decent meal. \n\nIn general, I rarely have a feeling of hunger. I can't eat much, more like a childrens sized portion, I am underweight, I do not enjoy eating, and have many other ARFID symptoms. \n\nYes. I blame my mother for my symptoms, but, I guess even if I had no symptoms at all, I would still blame her for being abusive. \n\nWith my toddler, I encourage her to try. She has to try a tiny bit of a new food, if she does not like it, she doesn't have to eat it. What am I supposed to do? Force it down her throat? Sometimes she likes what she tried, sometimes she doesn't. Next time, we try again. If she throws a fit, we let her \"win\". Better to finish the rest of the plate than to have her crying and refusing all of it because she is upset I guess.",
          "created_utc": 1728510847.0
        }
      ]
    },
    {
      "id": "lr5wwuf",
      "author": "RedQueenWhiteQueen",
      "body": "\"you don't leave the dinner table until your plate is clean\" challenge.\n\nThankfully, my own parents did not do this, but a friend's mother pulled this on me.  I know ya'll will be happy to hear that even though I did eventually give in and eat the tomatoes, I immediately ran into her kitchen and vomited them right back up into her sink.",
      "created_utc": 1728512772.0,
      "score": 16,
      "context": [
        {
          "id": "lr5q0m7",
          "author": "Swiftrun1",
          "body": "25 m had arfid all my life. I don't blame my parents. They did the best they could. Therapy was never an option due to the cost. The only thing I blame them for is dragging me to stupid Church functions where I'm certain they *knew* I'd be miserable at because it was just a meal with food I didn't eat. They tried to expand my pallet, but I just wouldn't eat it. I easily bested them in the \"you don't leave the dinner table until your plate is clean\" challenge. Sitting doing nothing was indescribably better than trying to choke down the food. They made sure i had something to eat and was healthy.",
          "created_utc": 1728510362.0
        }
      ]
    },
    {
      "id": "lr5xu66",
      "author": "ihtm1220",
      "body": "I’m so sorry. You didn’t deserve that, no one does.",
      "created_utc": 1728513119.0,
      "score": 5,
      "context": [
        {
          "id": "lr5r5dj",
          "author": "Garden-Gremlins",
          "body": "For me, yes, but I was neglected",
          "created_utc": 1728510755.0
        }
      ]
    },
    {
      "id": "lr5wo71",
      "author": "blackmetalwarlock",
      "body": "Me too",
      "created_utc": 1728512682.0,
      "score": 3,
      "context": [
        {
          "id": "lr5r5dj",
          "author": "Garden-Gremlins",
          "body": "For me, yes, but I was neglected",
          "created_utc": 1728510755.0
        }
      ]
    },
    {
      "id": "lr68ler",
      "author": "lemurificspeckle",
      "body": "Off topic, and forgive me if this is overstepping, but have you ever heard of PANDAS or PANS? I only bring it up because there’s a good chance that played a part in my developing/worsening ARFID, and the change at a flip of a switch thing is what PANDAS/PANS is known for. Could be worth some research!",
      "created_utc": 1728517160.0,
      "score": 3,
      "context": [
        {
          "id": "lr5w9il",
          "author": "None",
          "body": "I’ve had ARFID for as long as I can remember (30+ years). My parents tell me that it started when I was really young and it was like the flip of a switch. One day I’d eat whatever they put in front of me and the next I would only eat a few things prepared specific ways. \n\nI’ve been fortunate to have really patient  and kind parents who have put up with me. My mom brought it up to my doctor all the time and he kept telling her that I’d grow out of it. I have not. So I definitely don’t think it’s the parents’ fault at all. But I do think there is a smart way to approach it and how you help your kids navigate this disorder is your responsibility. The best way to help your kid is up to you and if you aren’t sure you can try to enlist help from dietitians and/or therapists who specialize in eating disorders. \n\nI wish you and everyone who has ARFID the best of luck finding a strategy that works for them.",
          "created_utc": 1728512531.0
        }
      ]
    },
    {
      "id": "lr64tyz",
      "author": "ihtm1220",
      "body": "Well you’ve unlocked a new fear that things could get worse for her. Obviously only share what you’re comfortable sharing but did it develop into a disorder due to increased stress or trauma? I didn’t realize eating disorders could develop so far into adulthood.",
      "created_utc": 1728515760.0,
      "score": 1,
      "context": [
        {
          "id": "lr5wbdg",
          "author": "Under-the-oak-trees",
          "body": "I’ve always had some food issues (especially around flavour and texture), but they didn’t develop into an intake disorder until the past couple years (I’m in my 30s). I actually credit my parents’ low-pressure approach to food — always allowing me to get something else if I didn’t want what was being served, and approaching new foods with curiosity rather than pressure — with it Not getting worse sooner. \n\nForcing your daughter to eat unfamiliar foods would just increase her anxiety around food. Letting her have something familiar isn’t causing this, and is exactly what you should be doing. \n\nIt’s a tough thing to deal with, but having supportive family who don’t shame you for being picky/anxious about trying new things, and who also don’t make a big deal out of you trying new foods (like, overly celebrating a new food without her initiating it can feel like pressure) makes it less hellish.",
          "created_utc": 1728512550.0
        }
      ]
    },
    {
      "id": "lr694kq",
      "author": "lemurificspeckle",
      "body": "I was thinking this too — *totally* depends on subtype! I’m like you, ARFID coming from being neurodivergent (and maybe also PANDAS/PANS), and I totally don’t blame them. Maybe their genetics though lol /j\n\nI’m so touched to hear your dad gave you a genuine apology! 😭🩷",
      "created_utc": 1728517356.0,
      "score": 1,
      "context": [
        {
          "id": "lr5z9ct",
          "author": "kissedbyvampires",
          "body": "i think it depends on the root cause of someone’s ARFID and their subtype.\n\npersonally, i do not blame my family. they actually tried very hard to introduce me to different foods, and i ate a video variety of food until i was 3. my ARFID is caused by autism and OCD. it wasn’t until i was 14 that my doctors started to realize it was a sensory issue causing my food aversions. i went to occupational therapy from 14-17. it took most of my family until i was diagnosed with autism at 18 to truly understand my ARFID. my dad was the most doubt until my autism diagnosis, and still believed i was just stubborn like the doctors originally said. he apologized the day after i was diagnosed for never taking it seriously.",
          "created_utc": 1728513653.0
        }
      ]
    },
    {
      "id": "lr74zd4",
      "author": "ihtm1220",
      "body": "I did not realize there are subtypes. I googled it and it seems like there are three — avoidant, restrictive and aversive. I’ll leave it to a professional to diagnose her if she’s willing to meet with one but based on the descriptions she matches avoidant. You said it depends on subtype so if she is avoidant what would that tell you?",
      "created_utc": 1728529777.0,
      "score": 1,
      "context": [
        {
          "id": "lr5z9ct",
          "author": "kissedbyvampires",
          "body": "i think it depends on the root cause of someone’s ARFID and their subtype.\n\npersonally, i do not blame my family. they actually tried very hard to introduce me to different foods, and i ate a video variety of food until i was 3. my ARFID is caused by autism and OCD. it wasn’t until i was 14 that my doctors started to realize it was a sensory issue causing my food aversions. i went to occupational therapy from 14-17. it took most of my family until i was diagnosed with autism at 18 to truly understand my ARFID. my dad was the most doubt until my autism diagnosis, and still believed i was just stubborn like the doctors originally said. he apologized the day after i was diagnosed for never taking it seriously.",
          "created_utc": 1728513653.0
        }
      ]
    },
    {
      "id": "lr5zp2h",
      "author": "ihtm1220",
      "body": ">until my adult life\n\nWhat changed in adulthood?\n\nBtw you posted your comment 5-6 times so maybe delete the duplicates",
      "created_utc": 1728513813.0,
      "score": 1,
      "context": [
        {
          "id": "lr5tedk",
          "author": "heartoffiction",
          "body": "I do in some ways for sure. When I was a kid I would throw up anything I didn’t like so my parents stopped trying to introduce foods and I only had 5-10 very unhealthy safe foods until my adult life. I don’t blame them for me having it but I am a bit frustrated that they just… gave up on me?? My mom was a stay at home mom and I’m an only child, and they’re relatively well off. It’s not like they didn’t have the time or resources to try to help me, they just threw in the towel and decided I was a permanent picky eater. (And then complained endlessly to anyone with ears about how picky I am). So I don’t think they caused it since it started as a baby for me but I do definitely harbor frustration that they never idk thought it was strange that their child threw up at even the sight or smell of certain foods and thought to take me to a specialist or something?? I know this is a pretty new disorder classification so not sure what resources would’ve been available 20 years ago but even a little more of their patience and understanding to work with me and find out why I was reacting that way and maybe see if there were other things they could add to my diet to help me grow up healthier. Because now I’m chronically ill and my mom blames it all on me only eating bread as a kid 🤨",
          "created_utc": 1728511495.0
        }
      ]
    },
    {
      "id": "lr68r2r",
      "author": "lemurificspeckle",
      "body": "Based grandma",
      "created_utc": 1728517218.0,
      "score": 2,
      "context": [
        {
          "id": "lr5wm0c",
          "author": "Rupertredloh",
          "body": "As a kid, I started refusing certain food, and my parents took me to their doctor (not to my child doctor, they were already there and what he told them didn't cure it); and he told them to 'give me nothing to eat; and after a week or so i would eat everything they presented me.' Quote: \"Hunger ist the best cook.\" \n\nAfter three days, while I was lying on the sofa, my grandma was furious and told them to finally give me something to eat; what they did. \n\nDon't get me wrong; I love my parents, and i'm not mad at them for listening to the doctor (back then, arfid wasn't a thing yet), but they might be the reason I refuse some foods. \n\nMaybe also grandma is at fault, because maybe what the doctor said would have worked,  and I wouldn't ended up having ARFID, but I also don't blame her; maybe she was saving my fucking life.",
          "created_utc": 1728512660.0
        }
      ]
    },
    {
      "id": "lr65hl7",
      "author": "ihtm1220",
      "body": "See this is why I’m torn because I want to keep her fed and I keep my mouth shut but it’s hard to watch her eat chips and salsa for dinner when I know she’s not getting enough nutrients. I feel like I’m failing her in so many ways.",
      "created_utc": 1728516005.0,
      "score": 1,
      "context": [
        {
          "id": "lr5we7u",
          "author": "blackmetalwarlock",
          "body": "Personally, I do, because my parents did not care to feed me nutritious meals and I was never challenged to eat anything besides microwave food alone in my room. There were years where all I ate was one or two small microwave pizzas a day and no one said anything to me about it or cared, because they simply didn’t want to deal with cooking or working with my diet. My mom had anorexia and rarely ate when I was growing up. I would eat a few cookies for breakfast and no one cared. I literally never ate vegetables, fruit, or meat. I also now have a lot of health problems. \n\nWhen I got older I didn’t know how to cook, what proper food safety practices were, and honestly I still don’t know what some foods are supposed to be like, look like, smell like. I had to learn everything from YouTube. I have no emotional connection to food. \n\nAs a parent, I think they fucked up big time. I feed my daughter lots of nutritious meals despite it being difficult and I try to challenge myself to eat those meals with her as well, even when it’s difficult. Because food can be medicine, it’s good for you, it helps you grow. I have always been skinny as a twig, short, and sick. I do not want that for my kid. And I often wonder if I was properly nourished, if my body would be more functional as an adult.",
          "created_utc": 1728512579.0
        }
      ]
    },
    {
      "id": "lr91tza",
      "author": "ColorfulPizzas",
      "body": "Thank you for this info! I am the parent of a teen with arfid. I am afraid to send him to the intensive outpatient therapy mostly because I don't think he is willing to change right now. I think he might become motivated on his own when he has more life experiences as he gets older like you did. Or maybe he won't. I have him seeing a therapist that specializes in eating disorders and arfid for an hour every 2 weeks. They do some exposure therapy but I don't see much progress. I am thankful to hear about you having success with the intensive outpatient treatment! I was worried that the program I was checking into was too focused on anorexia/bulimia and I was afraid it wouldn't even work for arfid but at least I know it's possible! So thank you! I am going to ask the therapist about the iop program and get more info and talk to my son more about it so he knows it is an option in case he wants to do more towards helping himself now or in the future. Thank you for sharing your story",
      "created_utc": 1728568048.0,
      "score": 2,
      "context": [
        {
          "id": "lr64jch",
          "author": "lemurificspeckle",
          "body": "Not at all! I’m actually ***SO*** thankful that my parents were accommodating to my weird ARFID diet. Everyone around them was telling them to force food on me with advice like the typical “you eat this or you don’t eat tonight at all” but they stood firm and let me eat my safe foods and found creative ways to try to meet at least *some* of my nutritional needs (so many protein bars). Thank god they never forced me to eat anything, because otherwise I would’ve been straight up traumatized and my relationship with food would be even WORSE. \n\nThe only thing I “blame” anybody for is blaming the DSM for not making ARFID a thing until the latest edition. I kind of blame my doctors for not trying to do anything about it, but same thing: I’m glad I wasn’t ever shamed by a doctor (my parents made sure to find cool  ones) or traumatized by “treatment.” And for what it’s worth, my parents did find a speech pathologist who did exposure therapy for me; I just wasn’t ready for it yet.\n\nYou might ask if your daughter is interested in seeking some form of treatment. I say that because she sounds a bit like me when I was 17 (now 22). I was in my senior year of high school and felt exhausted all the time and like my body was working against me. That frustration led me to seek out a dietician, and the dietician recommended I research ARFID and look into treatment. We found a good IOP/PHP, they took me in for two months or so (summer after graduation haha), and at the end of those two months I was eating pretty well balanced meals for the first time in my life. Now, **big disclaimer:** the key here is she has to want to do it. Don’t force her to do this. The only reason it worked for me is because I was insistent on it and determined to get better. I still very much have ARFID and am still in treatment now (weekly appointments with a dietician who knows about ARFID), but I’m leagues ahead of where I was five years ago. Exposure therapy is hard work, but if you’re willing and able to do the work, **it can change your life!!!!**",
          "created_utc": 1728515649.0
        }
      ]
    },
    {
      "id": "lr6ecjm",
      "author": "None",
      "body": "i honestly don’t even blame her for that specifically i blame her for avoiding getting me therapy for anxiety and depression and similar issues",
      "created_utc": 1728519317.0,
      "score": 2,
      "context": [
        {
          "id": "lr6e7ie",
          "author": "None",
          "body": "no not really. only my mother for not catching a problem sooner but there’s more baggage there. if you’re a good parent in other areas it’s unlikely your daughter blames you.",
          "created_utc": 1728519265.0
        }
      ]
    },
    {
      "id": "lr6vvhl",
      "author": "ihtm1220",
      "body": "I’m a dad, actually! And thank you for sharing.",
      "created_utc": 1728526021.0,
      "score": 2,
      "context": [
        {
          "id": "lr6ufx5",
          "author": "brightxeyez",
          "body": "Nope I do not blame them one bit. I’m (37f) the youngest of 4 and every single one of us has a little bit of food aversion. But my mom LOVES to cook and is great at it, she was always cooking big, nutritious meals for us and we just turned our nose up at it (I mean, obviously there was a reason for it that we know now but thinking back it must have made her feel awful). Also, they tried really hard to get me to try new things but I was just very, very stubborn (by the time I came around all my siblings had figured out their own ways of getting away with not eating what she cooked but I did not lol). \n\nSo, all that to say. It’s great that there’s so many new methods of parenting and things to try to work with your kids on this issue, compared to what our parents knew/had available when we were kids. But just because they’re available to us now doesn’t mean that any of them will work for your kiddo. \n\nI hope this didn’t come off mean or dismissive. It sounds to me like you’re a great mother doing all you can to help your daughter. There’s no need to blame anyone.",
          "created_utc": 1728525467.0
        }
      ]
    },
    {
      "id": "lrajzqq",
      "author": "Letshavemorefun",
      "body": "People with ARFID aren’t only averse to healthy foods. That’s a really harmful misnomer. \n\nA build your own salad is one of my favorite meals (build your own so I can choose the ingredients) but I can’t eat almost all candy bars and potato chips. \n\nLet’s not perpetuate these harmful stereotypes about Arfid. It isn’t about only eating junk food.",
      "created_utc": 1728585926.0,
      "score": 2,
      "context": [
        {
          "id": "lr6whrv",
          "author": "DefinitelynotDanger",
          "body": "I think it's my parents fault. But I don't blame them. It must be awful having a child that won't eat healthy food. The frustration of making food that goes to waste. It's hard for us but being a parent is hard too. I know they did their best.",
          "created_utc": 1728526267.0
        }
      ]
    },
    {
      "id": "lr6z4og",
      "author": "ihtm1220",
      "body": "The hard part is feeling like something I did or didn’t do has made her life worse",
      "created_utc": 1728527316.0,
      "score": 1,
      "context": [
        {
          "id": "lr6whrv",
          "author": "DefinitelynotDanger",
          "body": "I think it's my parents fault. But I don't blame them. It must be awful having a child that won't eat healthy food. The frustration of making food that goes to waste. It's hard for us but being a parent is hard too. I know they did their best.",
          "created_utc": 1728526267.0
        }
      ]
    },
    {
      "id": "lr5x9rb",
      "author": "ihtm1220",
      "body": "What do you wish your parents or someone would do for you now to help?",
      "created_utc": 1728512904.0,
      "score": 2,
      "context": [
        {
          "id": "lr5x2kc",
          "author": "Chatkathena",
          "body": "I'm that girl (not actually but I'm also 17 and feel like this )\n\nFuck yeah my family's diet ass culture lifestyle was a major factor",
          "created_utc": 1728512830.0
        }
      ]
    },
    {
      "id": "lr65roe",
      "author": "lemurificspeckle",
      "body": "^^ They make a very good point!! I’m sure you have a lot of baggage to work through around your experience as an ARFID parent, and that’s valid, but that work should be done in private with your own personal therapist. It’s exhausting to feel like you’re responsible for your parents’ emotions, especially with regard to something she doesn’t have much of a choice in (having an eating disorder).",
      "created_utc": 1728516109.0,
      "score": 34,
      "context": [
        {
          "id": "lr5pdro",
          "author": "ollie_rosie",
          "body": "You can’t let her know you blame yourself because all that does is lead to her feeling even worse than she probably already does, Support her but don’t make it about yourself, Arfid isn’t caused by you giving into not making her eat things when she was little, be patient with her it’s no one’s fault and no one’s to blame in this situation",
          "created_utc": 1728510142.0
        },
        {
          "id": "lr5xwwe",
          "author": "ihtm1220",
          "body": "Ok thank you I will keep that to myself",
          "created_utc": 1728513147.0
        }
      ]
    },
    {
      "id": "lr665z8",
      "author": "lemurificspeckle",
      "body": "Malicious compliance 😎🤝 Oh, I’ll eat your food… *but you’ll pay for it* \n\n* breaks down crying at the dinner table and gags every five seconds *",
      "created_utc": 1728516257.0,
      "score": 10,
      "context": [
        {
          "id": "lr5q0m7",
          "author": "Swiftrun1",
          "body": "25 m had arfid all my life. I don't blame my parents. They did the best they could. Therapy was never an option due to the cost. The only thing I blame them for is dragging me to stupid Church functions where I'm certain they *knew* I'd be miserable at because it was just a meal with food I didn't eat. They tried to expand my pallet, but I just wouldn't eat it. I easily bested them in the \"you don't leave the dinner table until your plate is clean\" challenge. Sitting doing nothing was indescribably better than trying to choke down the food. They made sure i had something to eat and was healthy.",
          "created_utc": 1728510362.0
        },
        {
          "id": "lr5wwuf",
          "author": "RedQueenWhiteQueen",
          "body": "\"you don't leave the dinner table until your plate is clean\" challenge.\n\nThankfully, my own parents did not do this, but a friend's mother pulled this on me.  I know ya'll will be happy to hear that even though I did eventually give in and eat the tomatoes, I immediately ran into her kitchen and vomited them right back up into her sink.",
          "created_utc": 1728512772.0
        }
      ]
    },
    {
      "id": "lr5zcge",
      "author": "Garden-Gremlins",
      "body": "But you sound like a wonderfully caring parent. You didn't do anything wrong. You sound so supportive and that's all we can ask for.",
      "created_utc": 1728513684.0,
      "score": 12,
      "context": [
        {
          "id": "lr5r5dj",
          "author": "Garden-Gremlins",
          "body": "For me, yes, but I was neglected",
          "created_utc": 1728510755.0
        },
        {
          "id": "lr5xu66",
          "author": "ihtm1220",
          "body": "I’m so sorry. You didn’t deserve that, no one does.",
          "created_utc": 1728513119.0
        }
      ]
    },
    {
      "id": "lr693i0",
      "author": "None",
      "body": "I have not! I appreciate you asking! I will definitely have to look into this. If you have any references and are able to share please feel free to do so.",
      "created_utc": 1728517345.0,
      "score": 2,
      "context": [
        {
          "id": "lr5w9il",
          "author": "None",
          "body": "I’ve had ARFID for as long as I can remember (30+ years). My parents tell me that it started when I was really young and it was like the flip of a switch. One day I’d eat whatever they put in front of me and the next I would only eat a few things prepared specific ways. \n\nI’ve been fortunate to have really patient  and kind parents who have put up with me. My mom brought it up to my doctor all the time and he kept telling her that I’d grow out of it. I have not. So I definitely don’t think it’s the parents’ fault at all. But I do think there is a smart way to approach it and how you help your kids navigate this disorder is your responsibility. The best way to help your kid is up to you and if you aren’t sure you can try to enlist help from dietitians and/or therapists who specialize in eating disorders. \n\nI wish you and everyone who has ARFID the best of luck finding a strategy that works for them.",
          "created_utc": 1728512531.0
        },
        {
          "id": "lr68ler",
          "author": "lemurificspeckle",
          "body": "Off topic, and forgive me if this is overstepping, but have you ever heard of PANDAS or PANS? I only bring it up because there’s a good chance that played a part in my developing/worsening ARFID, and the change at a flip of a switch thing is what PANDAS/PANS is known for. Could be worth some research!",
          "created_utc": 1728517160.0
        }
      ]
    },
    {
      "id": "lr66i8o",
      "author": "Under-the-oak-trees",
      "body": "I got chronically ill and it wrecked my ability to cook, my ability to chew, and gave me GERD. \n\nSo before, I could manage my sensory issues by getting Really Good at cooking things that met my exact flavour and texture needs, and most of my favourite textures were, like, crunchy things, chewy bread, crisp-tender vegetables — mush has always been a big avoidance for me. \n\nBut then my jaw went to shit, and I can only eat a few bites of chewed foods, and acidic things and mint give me GERD, and a lot of strong flavours now give me migraines… and I don’t have the energy to prepare most of my own food, and I have dietary restrictions that preclude a lot of prepared food, and I’m So Particular about minute differences in flavour and texture (which has also just intensified with the chronic illness)….\n\nAnyway, highly disrecommend getting ME/CFS, it fucks everything up real good 🫠\n\nI ate a whole muffin today, which made my jaw ache pretty bad, but I just couldn’t face a cold smoothie with how cold the weather has gotten. And smoothies and milkshakes are a Lot of what I consume due to my jaw issues. Not sure how I’m going to manage the winter, since things are significantly worse now than they were this time last year.",
      "created_utc": 1728516384.0,
      "score": 5,
      "context": [
        {
          "id": "lr5wbdg",
          "author": "Under-the-oak-trees",
          "body": "I’ve always had some food issues (especially around flavour and texture), but they didn’t develop into an intake disorder until the past couple years (I’m in my 30s). I actually credit my parents’ low-pressure approach to food — always allowing me to get something else if I didn’t want what was being served, and approaching new foods with curiosity rather than pressure — with it Not getting worse sooner. \n\nForcing your daughter to eat unfamiliar foods would just increase her anxiety around food. Letting her have something familiar isn’t causing this, and is exactly what you should be doing. \n\nIt’s a tough thing to deal with, but having supportive family who don’t shame you for being picky/anxious about trying new things, and who also don’t make a big deal out of you trying new foods (like, overly celebrating a new food without her initiating it can feel like pressure) makes it less hellish.",
          "created_utc": 1728512550.0
        },
        {
          "id": "lr64tyz",
          "author": "ihtm1220",
          "body": "Well you’ve unlocked a new fear that things could get worse for her. Obviously only share what you’re comfortable sharing but did it develop into a disorder due to increased stress or trauma? I didn’t realize eating disorders could develop so far into adulthood.",
          "created_utc": 1728515760.0
        }
      ]
    },
    {
      "id": "lrg2j9b",
      "author": "listlessgod",
      "body": "I was born with arfid, but it got more severe when I hit adulthood. I used to at least like eating when the food was to my liking, but now, I genuinely hate the act of eating in general. Chewing and swallowing is unpleasant and feels gross to me. I can’t think of a single cause for this either. It just kinda happened slowly over time. I don’t blame my parents for it btw! She made me try a pickle once (because I insisted I hated them even though I never had them before. The smell and appearance of them is my worst nightmare) and I immediately gagged and threw up all over her, so I think she learned her lesson 😂",
      "created_utc": 1728669303.0,
      "score": 1,
      "context": [
        {
          "id": "lr5wbdg",
          "author": "Under-the-oak-trees",
          "body": "I’ve always had some food issues (especially around flavour and texture), but they didn’t develop into an intake disorder until the past couple years (I’m in my 30s). I actually credit my parents’ low-pressure approach to food — always allowing me to get something else if I didn’t want what was being served, and approaching new foods with curiosity rather than pressure — with it Not getting worse sooner. \n\nForcing your daughter to eat unfamiliar foods would just increase her anxiety around food. Letting her have something familiar isn’t causing this, and is exactly what you should be doing. \n\nIt’s a tough thing to deal with, but having supportive family who don’t shame you for being picky/anxious about trying new things, and who also don’t make a big deal out of you trying new foods (like, overly celebrating a new food without her initiating it can feel like pressure) makes it less hellish.",
          "created_utc": 1728512550.0
        },
        {
          "id": "lr64tyz",
          "author": "ihtm1220",
          "body": "Well you’ve unlocked a new fear that things could get worse for her. Obviously only share what you’re comfortable sharing but did it develop into a disorder due to increased stress or trauma? I didn’t realize eating disorders could develop so far into adulthood.",
          "created_utc": 1728515760.0
        }
      ]
    },
    {
      "id": "lr65p6j",
      "author": "blackmetalwarlock",
      "body": "What matters is that you try. She might not realize it now but she will see it later. You don’t need to push her but you can always just try and never give up",
      "created_utc": 1728516083.0,
      "score": 2,
      "context": [
        {
          "id": "lr5we7u",
          "author": "blackmetalwarlock",
          "body": "Personally, I do, because my parents did not care to feed me nutritious meals and I was never challenged to eat anything besides microwave food alone in my room. There were years where all I ate was one or two small microwave pizzas a day and no one said anything to me about it or cared, because they simply didn’t want to deal with cooking or working with my diet. My mom had anorexia and rarely ate when I was growing up. I would eat a few cookies for breakfast and no one cared. I literally never ate vegetables, fruit, or meat. I also now have a lot of health problems. \n\nWhen I got older I didn’t know how to cook, what proper food safety practices were, and honestly I still don’t know what some foods are supposed to be like, look like, smell like. I had to learn everything from YouTube. I have no emotional connection to food. \n\nAs a parent, I think they fucked up big time. I feed my daughter lots of nutritious meals despite it being difficult and I try to challenge myself to eat those meals with her as well, even when it’s difficult. Because food can be medicine, it’s good for you, it helps you grow. I have always been skinny as a twig, short, and sick. I do not want that for my kid. And I often wonder if I was properly nourished, if my body would be more functional as an adult.",
          "created_utc": 1728512579.0
        },
        {
          "id": "lr65hl7",
          "author": "ihtm1220",
          "body": "See this is why I’m torn because I want to keep her fed and I keep my mouth shut but it’s hard to watch her eat chips and salsa for dinner when I know she’s not getting enough nutrients. I feel like I’m failing her in so many ways.",
          "created_utc": 1728516005.0
        }
      ]
    },
    {
      "id": "lra1a0h",
      "author": "lemurificspeckle",
      "body": "Aw no problem! <3 \n\nYeah, I always felt bad about my eating but never really wanted to do the hard work to change anything until it got to a breaking point. Also, I obviously can’t speak on the quality of your son’s therapy sessions, but I can say that progress can feel *sooooo slooooowwwwww* and even invisible at times, especially since ARFID can kind of flare up with stress! I recently lamented the fact that I hadn’t made much progress over the past couple of months to my dietician and she quickly checked my shame and applauded me for doing as well as I was. :)",
      "created_utc": 1728579907.0,
      "score": 2,
      "context": [
        {
          "id": "lr64jch",
          "author": "lemurificspeckle",
          "body": "Not at all! I’m actually ***SO*** thankful that my parents were accommodating to my weird ARFID diet. Everyone around them was telling them to force food on me with advice like the typical “you eat this or you don’t eat tonight at all” but they stood firm and let me eat my safe foods and found creative ways to try to meet at least *some* of my nutritional needs (so many protein bars). Thank god they never forced me to eat anything, because otherwise I would’ve been straight up traumatized and my relationship with food would be even WORSE. \n\nThe only thing I “blame” anybody for is blaming the DSM for not making ARFID a thing until the latest edition. I kind of blame my doctors for not trying to do anything about it, but same thing: I’m glad I wasn’t ever shamed by a doctor (my parents made sure to find cool  ones) or traumatized by “treatment.” And for what it’s worth, my parents did find a speech pathologist who did exposure therapy for me; I just wasn’t ready for it yet.\n\nYou might ask if your daughter is interested in seeking some form of treatment. I say that because she sounds a bit like me when I was 17 (now 22). I was in my senior year of high school and felt exhausted all the time and like my body was working against me. That frustration led me to seek out a dietician, and the dietician recommended I research ARFID and look into treatment. We found a good IOP/PHP, they took me in for two months or so (summer after graduation haha), and at the end of those two months I was eating pretty well balanced meals for the first time in my life. Now, **big disclaimer:** the key here is she has to want to do it. Don’t force her to do this. The only reason it worked for me is because I was insistent on it and determined to get better. I still very much have ARFID and am still in treatment now (weekly appointments with a dietician who knows about ARFID), but I’m leagues ahead of where I was five years ago. Exposure therapy is hard work, but if you’re willing and able to do the work, **it can change your life!!!!**",
          "created_utc": 1728515649.0
        },
        {
          "id": "lr91tza",
          "author": "ColorfulPizzas",
          "body": "Thank you for this info! I am the parent of a teen with arfid. I am afraid to send him to the intensive outpatient therapy mostly because I don't think he is willing to change right now. I think he might become motivated on his own when he has more life experiences as he gets older like you did. Or maybe he won't. I have him seeing a therapist that specializes in eating disorders and arfid for an hour every 2 weeks. They do some exposure therapy but I don't see much progress. I am thankful to hear about you having success with the intensive outpatient treatment! I was worried that the program I was checking into was too focused on anorexia/bulimia and I was afraid it wouldn't even work for arfid but at least I know it's possible! So thank you! I am going to ask the therapist about the iop program and get more info and talk to my son more about it so he knows it is an option in case he wants to do more towards helping himself now or in the future. Thank you for sharing your story",
          "created_utc": 1728568048.0
        }
      ]
    },
    {
      "id": "lr88c56",
      "author": "brightxeyez",
      "body": "Crap, sorry!",
      "created_utc": 1728553711.0,
      "score": 1,
      "context": [
        {
          "id": "lr6ufx5",
          "author": "brightxeyez",
          "body": "Nope I do not blame them one bit. I’m (37f) the youngest of 4 and every single one of us has a little bit of food aversion. But my mom LOVES to cook and is great at it, she was always cooking big, nutritious meals for us and we just turned our nose up at it (I mean, obviously there was a reason for it that we know now but thinking back it must have made her feel awful). Also, they tried really hard to get me to try new things but I was just very, very stubborn (by the time I came around all my siblings had figured out their own ways of getting away with not eating what she cooked but I did not lol). \n\nSo, all that to say. It’s great that there’s so many new methods of parenting and things to try to work with your kids on this issue, compared to what our parents knew/had available when we were kids. But just because they’re available to us now doesn’t mean that any of them will work for your kiddo. \n\nI hope this didn’t come off mean or dismissive. It sounds to me like you’re a great mother doing all you can to help your daughter. There’s no need to blame anyone.",
          "created_utc": 1728525467.0
        },
        {
          "id": "lr6vvhl",
          "author": "ihtm1220",
          "body": "I’m a dad, actually! And thank you for sharing.",
          "created_utc": 1728526021.0
        }
      ]
    },
    {
      "id": "lraonw5",
      "author": "DefinitelynotDanger",
      "body": "I'm referring to myself.",
      "created_utc": 1728587434.0,
      "score": 1,
      "context": [
        {
          "id": "lr6whrv",
          "author": "DefinitelynotDanger",
          "body": "I think it's my parents fault. But I don't blame them. It must be awful having a child that won't eat healthy food. The frustration of making food that goes to waste. It's hard for us but being a parent is hard too. I know they did their best.",
          "created_utc": 1728526267.0
        },
        {
          "id": "lrajzqq",
          "author": "Letshavemorefun",
          "body": "People with ARFID aren’t only averse to healthy foods. That’s a really harmful misnomer. \n\nA build your own salad is one of my favorite meals (build your own so I can choose the ingredients) but I can’t eat almost all candy bars and potato chips. \n\nLet’s not perpetuate these harmful stereotypes about Arfid. It isn’t about only eating junk food.",
          "created_utc": 1728585926.0
        }
      ]
    },
    {
      "id": "lr716sk",
      "author": "DefinitelynotDanger",
      "body": "You can't look at it like that. The fact that you're on here reflecting on what you could do or could have done better tells me you're a good person and a good parent. \n\nHumans aren't perfect. There is no perfect way to be a parent. There are going to be things we do that have a positive effect and there's going to be things that have a negative effect. That's just a fact of life. \n\nThe important thing is that you'll be there for her when she needs you and that you'll listen to her with respect and understanding. That's all I would ask of my parents.",
      "created_utc": 1728528165.0,
      "score": 2,
      "context": [
        {
          "id": "lr6whrv",
          "author": "DefinitelynotDanger",
          "body": "I think it's my parents fault. But I don't blame them. It must be awful having a child that won't eat healthy food. The frustration of making food that goes to waste. It's hard for us but being a parent is hard too. I know they did their best.",
          "created_utc": 1728526267.0
        },
        {
          "id": "lr6z4og",
          "author": "ihtm1220",
          "body": "The hard part is feeling like something I did or didn’t do has made her life worse",
          "created_utc": 1728527316.0
        }
      ]
    },
    {
      "id": "lr5xhxj",
      "author": "Chatkathena",
      "body": "My mom is the reason I have this. I had major Ana last year and now I'm a normal weight but I have safe foods. I wish she would be nicer because she would make fun of me and my food choices. I will eat outside my comfort zone but it really causes me distress and I wish I had someone for comfort and she wouldn't do anything except mock me",
      "created_utc": 1728512990.0,
      "score": 1,
      "context": [
        {
          "id": "lr5x2kc",
          "author": "Chatkathena",
          "body": "I'm that girl (not actually but I'm also 17 and feel like this )\n\nFuck yeah my family's diet ass culture lifestyle was a major factor",
          "created_utc": 1728512830.0
        },
        {
          "id": "lr5x9rb",
          "author": "ihtm1220",
          "body": "What do you wish your parents or someone would do for you now to help?",
          "created_utc": 1728512904.0
        }
      ]
    },
    {
      "id": "lr6c04s",
      "author": "lemurificspeckle",
      "body": "I don’t have any specific sources, sorry! :( I can give you a pretty quick TL;DR, though: the theory is that you can get infected with a pathogen (strep for PANDAS, something else for PANS) and your body develops an autoimmune reaction to it where it mistakenly starts attacking your brain, and voilà, you now have OCD, ARFID, and/or tics! Some people think it can only happen to you as a kid, but some people have the same story happen to them as adults.\n\nFair warning: PANDAS/PANS isn’t fully accepted by doctors, but it’s accepted enough that multiple pediatricians brought it up to my parents when I was a kid, and when I mentioned it to my neurologist (who I see about tics) he was like “I can’t tell you 100% that’s what happened but yeah it sounds pretty probable, and I’m sure we’ll learn a lot more about it as more research comes out over the next decade!”\n\nBesides just having an answer for why you are the way you are, it could be good to know about because there could *potentially* be something to do about it that *might* make your symptoms better. BIG on the “potentially” and “might,” as we still don’t know a whole lot about it, but a strong and/or long course of antibiotics *might* help. My doctor recently did a GI map on me and we found out I have an overgrowth of H pylori (which I’ve likely had since I was like 2yo), and she said she considers that to be a potential PANS pathogen. I’m about to start antibiotics to see if we can get that taken care of, and while I’m mainly doing it because of acid reflux and general health stuff, I am interested to see if my OCD, ARFID, and tics get better!\n\nThis comment ended up SO long, omg!!!",
      "created_utc": 1728518430.0,
      "score": 5,
      "context": [
        {
          "id": "lr5w9il",
          "author": "None",
          "body": "I’ve had ARFID for as long as I can remember (30+ years). My parents tell me that it started when I was really young and it was like the flip of a switch. One day I’d eat whatever they put in front of me and the next I would only eat a few things prepared specific ways. \n\nI’ve been fortunate to have really patient  and kind parents who have put up with me. My mom brought it up to my doctor all the time and he kept telling her that I’d grow out of it. I have not. So I definitely don’t think it’s the parents’ fault at all. But I do think there is a smart way to approach it and how you help your kids navigate this disorder is your responsibility. The best way to help your kid is up to you and if you aren’t sure you can try to enlist help from dietitians and/or therapists who specialize in eating disorders. \n\nI wish you and everyone who has ARFID the best of luck finding a strategy that works for them.",
          "created_utc": 1728512531.0
        },
        {
          "id": "lr68ler",
          "author": "lemurificspeckle",
          "body": "Off topic, and forgive me if this is overstepping, but have you ever heard of PANDAS or PANS? I only bring it up because there’s a good chance that played a part in my developing/worsening ARFID, and the change at a flip of a switch thing is what PANDAS/PANS is known for. Could be worth some research!",
          "created_utc": 1728517160.0
        },
        {
          "id": "lr693i0",
          "author": "None",
          "body": "I have not! I appreciate you asking! I will definitely have to look into this. If you have any references and are able to share please feel free to do so.",
          "created_utc": 1728517345.0
        }
      ]
    },
    {
      "id": "lrapj5t",
      "author": "Letshavemorefun",
      "body": "Then you should make that clear. Maybe you weren’t aware that there is a harmful stereotype that people with Arfid just use it as an excuse to eat junk food - but now that you know, i think it makes sense to make it clear that you are only referring to yourself and that many people with Arfid eat a lot of healthy food and can’t eat plenty of junk foods.",
      "created_utc": 1728587713.0,
      "score": 1,
      "context": [
        {
          "id": "lr6whrv",
          "author": "DefinitelynotDanger",
          "body": "I think it's my parents fault. But I don't blame them. It must be awful having a child that won't eat healthy food. The frustration of making food that goes to waste. It's hard for us but being a parent is hard too. I know they did their best.",
          "created_utc": 1728526267.0
        },
        {
          "id": "lrajzqq",
          "author": "Letshavemorefun",
          "body": "People with ARFID aren’t only averse to healthy foods. That’s a really harmful misnomer. \n\nA build your own salad is one of my favorite meals (build your own so I can choose the ingredients) but I can’t eat almost all candy bars and potato chips. \n\nLet’s not perpetuate these harmful stereotypes about Arfid. It isn’t about only eating junk food.",
          "created_utc": 1728585926.0
        },
        {
          "id": "lraonw5",
          "author": "DefinitelynotDanger",
          "body": "I'm referring to myself.",
          "created_utc": 1728587434.0
        }
      ]
    },
    {
      "id": "lr6d9zc",
      "author": "None",
      "body": "This is so fascinating to me! Thank you so much! I didn’t mean to put you on the spot lol. I’m working so I can’t dig into it as much as I’d like to right now but I definitely will. You’re the bomb! \n\nEdit: Also, best of luck with everything! I hope you and your doctor make progress!",
      "created_utc": 1728518908.0,
      "score": 4,
      "context": [
        {
          "id": "lr5w9il",
          "author": "None",
          "body": "I’ve had ARFID for as long as I can remember (30+ years). My parents tell me that it started when I was really young and it was like the flip of a switch. One day I’d eat whatever they put in front of me and the next I would only eat a few things prepared specific ways. \n\nI’ve been fortunate to have really patient  and kind parents who have put up with me. My mom brought it up to my doctor all the time and he kept telling her that I’d grow out of it. I have not. So I definitely don’t think it’s the parents’ fault at all. But I do think there is a smart way to approach it and how you help your kids navigate this disorder is your responsibility. The best way to help your kid is up to you and if you aren’t sure you can try to enlist help from dietitians and/or therapists who specialize in eating disorders. \n\nI wish you and everyone who has ARFID the best of luck finding a strategy that works for them.",
          "created_utc": 1728512531.0
        },
        {
          "id": "lr68ler",
          "author": "lemurificspeckle",
          "body": "Off topic, and forgive me if this is overstepping, but have you ever heard of PANDAS or PANS? I only bring it up because there’s a good chance that played a part in my developing/worsening ARFID, and the change at a flip of a switch thing is what PANDAS/PANS is known for. Could be worth some research!",
          "created_utc": 1728517160.0
        },
        {
          "id": "lr693i0",
          "author": "None",
          "body": "I have not! I appreciate you asking! I will definitely have to look into this. If you have any references and are able to share please feel free to do so.",
          "created_utc": 1728517345.0
        },
        {
          "id": "lr6c04s",
          "author": "lemurificspeckle",
          "body": "I don’t have any specific sources, sorry! :( I can give you a pretty quick TL;DR, though: the theory is that you can get infected with a pathogen (strep for PANDAS, something else for PANS) and your body develops an autoimmune reaction to it where it mistakenly starts attacking your brain, and voilà, you now have OCD, ARFID, and/or tics! Some people think it can only happen to you as a kid, but some people have the same story happen to them as adults.\n\nFair warning: PANDAS/PANS isn’t fully accepted by doctors, but it’s accepted enough that multiple pediatricians brought it up to my parents when I was a kid, and when I mentioned it to my neurologist (who I see about tics) he was like “I can’t tell you 100% that’s what happened but yeah it sounds pretty probable, and I’m sure we’ll learn a lot more about it as more research comes out over the next decade!”\n\nBesides just having an answer for why you are the way you are, it could be good to know about because there could *potentially* be something to do about it that *might* make your symptoms better. BIG on the “potentially” and “might,” as we still don’t know a whole lot about it, but a strong and/or long course of antibiotics *might* help. My doctor recently did a GI map on me and we found out I have an overgrowth of H pylori (which I’ve likely had since I was like 2yo), and she said she considers that to be a potential PANS pathogen. I’m about to start antibiotics to see if we can get that taken care of, and while I’m mainly doing it because of acid reflux and general health stuff, I am interested to see if my OCD, ARFID, and tics get better!\n\nThis comment ended up SO long, omg!!!",
          "created_utc": 1728518430.0
        }
      ]
    },
    {
      "id": "lr8fdwg",
      "author": "Hanhula",
      "body": "Holy shit, this might be what happened to me. I had some very mild OCD-like symptoms as a child, but one day I *very* suddenly went from being a relatively normal child to having pretty severe ARFID. Went undiagnosed, obviously, but my parents were distressed at their child suddenly no longer being able to eat 99% of things.\n\nWe've always assumed something bad happened at pre-school that I can't remember, but this might legitimately be the real explanation.",
      "created_utc": 1728558110.0,
      "score": 4,
      "context": [
        {
          "id": "lr5w9il",
          "author": "None",
          "body": "I’ve had ARFID for as long as I can remember (30+ years). My parents tell me that it started when I was really young and it was like the flip of a switch. One day I’d eat whatever they put in front of me and the next I would only eat a few things prepared specific ways. \n\nI’ve been fortunate to have really patient  and kind parents who have put up with me. My mom brought it up to my doctor all the time and he kept telling her that I’d grow out of it. I have not. So I definitely don’t think it’s the parents’ fault at all. But I do think there is a smart way to approach it and how you help your kids navigate this disorder is your responsibility. The best way to help your kid is up to you and if you aren’t sure you can try to enlist help from dietitians and/or therapists who specialize in eating disorders. \n\nI wish you and everyone who has ARFID the best of luck finding a strategy that works for them.",
          "created_utc": 1728512531.0
        },
        {
          "id": "lr68ler",
          "author": "lemurificspeckle",
          "body": "Off topic, and forgive me if this is overstepping, but have you ever heard of PANDAS or PANS? I only bring it up because there’s a good chance that played a part in my developing/worsening ARFID, and the change at a flip of a switch thing is what PANDAS/PANS is known for. Could be worth some research!",
          "created_utc": 1728517160.0
        },
        {
          "id": "lr693i0",
          "author": "None",
          "body": "I have not! I appreciate you asking! I will definitely have to look into this. If you have any references and are able to share please feel free to do so.",
          "created_utc": 1728517345.0
        },
        {
          "id": "lr6c04s",
          "author": "lemurificspeckle",
          "body": "I don’t have any specific sources, sorry! :( I can give you a pretty quick TL;DR, though: the theory is that you can get infected with a pathogen (strep for PANDAS, something else for PANS) and your body develops an autoimmune reaction to it where it mistakenly starts attacking your brain, and voilà, you now have OCD, ARFID, and/or tics! Some people think it can only happen to you as a kid, but some people have the same story happen to them as adults.\n\nFair warning: PANDAS/PANS isn’t fully accepted by doctors, but it’s accepted enough that multiple pediatricians brought it up to my parents when I was a kid, and when I mentioned it to my neurologist (who I see about tics) he was like “I can’t tell you 100% that’s what happened but yeah it sounds pretty probable, and I’m sure we’ll learn a lot more about it as more research comes out over the next decade!”\n\nBesides just having an answer for why you are the way you are, it could be good to know about because there could *potentially* be something to do about it that *might* make your symptoms better. BIG on the “potentially” and “might,” as we still don’t know a whole lot about it, but a strong and/or long course of antibiotics *might* help. My doctor recently did a GI map on me and we found out I have an overgrowth of H pylori (which I’ve likely had since I was like 2yo), and she said she considers that to be a potential PANS pathogen. I’m about to start antibiotics to see if we can get that taken care of, and while I’m mainly doing it because of acid reflux and general health stuff, I am interested to see if my OCD, ARFID, and tics get better!\n\nThis comment ended up SO long, omg!!!",
          "created_utc": 1728518430.0
        }
      ]
    },
    {
      "id": "lrb4gs6",
      "author": "DefinitelynotDanger",
      "body": "I'm aware.\n\n I think it was pretty clear that I was referring to my personal story when I referred to my parents.",
      "created_utc": 1728592469.0,
      "score": 0,
      "context": [
        {
          "id": "lr6whrv",
          "author": "DefinitelynotDanger",
          "body": "I think it's my parents fault. But I don't blame them. It must be awful having a child that won't eat healthy food. The frustration of making food that goes to waste. It's hard for us but being a parent is hard too. I know they did their best.",
          "created_utc": 1728526267.0
        },
        {
          "id": "lrajzqq",
          "author": "Letshavemorefun",
          "body": "People with ARFID aren’t only averse to healthy foods. That’s a really harmful misnomer. \n\nA build your own salad is one of my favorite meals (build your own so I can choose the ingredients) but I can’t eat almost all candy bars and potato chips. \n\nLet’s not perpetuate these harmful stereotypes about Arfid. It isn’t about only eating junk food.",
          "created_utc": 1728585926.0
        },
        {
          "id": "lraonw5",
          "author": "DefinitelynotDanger",
          "body": "I'm referring to myself.",
          "created_utc": 1728587434.0
        },
        {
          "id": "lrapj5t",
          "author": "Letshavemorefun",
          "body": "Then you should make that clear. Maybe you weren’t aware that there is a harmful stereotype that people with Arfid just use it as an excuse to eat junk food - but now that you know, i think it makes sense to make it clear that you are only referring to yourself and that many people with Arfid eat a lot of healthy food and can’t eat plenty of junk foods.",
          "created_utc": 1728587713.0
        }
      ]
    },
    {
      "id": "lr6dhwq",
      "author": "lemurificspeckle",
      "body": "Nonono, you’re all good!! I’m just happy to be able to share the knowledge to someone it might apply to!! :) 🩷🩷🩷🩷",
      "created_utc": 1728518993.0,
      "score": 1,
      "context": [
        {
          "id": "lr5w9il",
          "author": "None",
          "body": "I’ve had ARFID for as long as I can remember (30+ years). My parents tell me that it started when I was really young and it was like the flip of a switch. One day I’d eat whatever they put in front of me and the next I would only eat a few things prepared specific ways. \n\nI’ve been fortunate to have really patient  and kind parents who have put up with me. My mom brought it up to my doctor all the time and he kept telling her that I’d grow out of it. I have not. So I definitely don’t think it’s the parents’ fault at all. But I do think there is a smart way to approach it and how you help your kids navigate this disorder is your responsibility. The best way to help your kid is up to you and if you aren’t sure you can try to enlist help from dietitians and/or therapists who specialize in eating disorders. \n\nI wish you and everyone who has ARFID the best of luck finding a strategy that works for them.",
          "created_utc": 1728512531.0
        },
        {
          "id": "lr68ler",
          "author": "lemurificspeckle",
          "body": "Off topic, and forgive me if this is overstepping, but have you ever heard of PANDAS or PANS? I only bring it up because there’s a good chance that played a part in my developing/worsening ARFID, and the change at a flip of a switch thing is what PANDAS/PANS is known for. Could be worth some research!",
          "created_utc": 1728517160.0
        },
        {
          "id": "lr693i0",
          "author": "None",
          "body": "I have not! I appreciate you asking! I will definitely have to look into this. If you have any references and are able to share please feel free to do so.",
          "created_utc": 1728517345.0
        },
        {
          "id": "lr6c04s",
          "author": "lemurificspeckle",
          "body": "I don’t have any specific sources, sorry! :( I can give you a pretty quick TL;DR, though: the theory is that you can get infected with a pathogen (strep for PANDAS, something else for PANS) and your body develops an autoimmune reaction to it where it mistakenly starts attacking your brain, and voilà, you now have OCD, ARFID, and/or tics! Some people think it can only happen to you as a kid, but some people have the same story happen to them as adults.\n\nFair warning: PANDAS/PANS isn’t fully accepted by doctors, but it’s accepted enough that multiple pediatricians brought it up to my parents when I was a kid, and when I mentioned it to my neurologist (who I see about tics) he was like “I can’t tell you 100% that’s what happened but yeah it sounds pretty probable, and I’m sure we’ll learn a lot more about it as more research comes out over the next decade!”\n\nBesides just having an answer for why you are the way you are, it could be good to know about because there could *potentially* be something to do about it that *might* make your symptoms better. BIG on the “potentially” and “might,” as we still don’t know a whole lot about it, but a strong and/or long course of antibiotics *might* help. My doctor recently did a GI map on me and we found out I have an overgrowth of H pylori (which I’ve likely had since I was like 2yo), and she said she considers that to be a potential PANS pathogen. I’m about to start antibiotics to see if we can get that taken care of, and while I’m mainly doing it because of acid reflux and general health stuff, I am interested to see if my OCD, ARFID, and tics get better!\n\nThis comment ended up SO long, omg!!!",
          "created_utc": 1728518430.0
        },
        {
          "id": "lr6d9zc",
          "author": "None",
          "body": "This is so fascinating to me! Thank you so much! I didn’t mean to put you on the spot lol. I’m working so I can’t dig into it as much as I’d like to right now but I definitely will. You’re the bomb! \n\nEdit: Also, best of luck with everything! I hope you and your doctor make progress!",
          "created_utc": 1728518908.0
        }
      ]
    },
    {
      "id": "lr8jj6x",
      "author": "lemurificspeckle",
      "body": "My story is pretty similar! I’m so glad this might give you your explanation! :,) <3",
      "created_utc": 1728560300.0,
      "score": 1,
      "context": [
        {
          "id": "lr5w9il",
          "author": "None",
          "body": "I’ve had ARFID for as long as I can remember (30+ years). My parents tell me that it started when I was really young and it was like the flip of a switch. One day I’d eat whatever they put in front of me and the next I would only eat a few things prepared specific ways. \n\nI’ve been fortunate to have really patient  and kind parents who have put up with me. My mom brought it up to my doctor all the time and he kept telling her that I’d grow out of it. I have not. So I definitely don’t think it’s the parents’ fault at all. But I do think there is a smart way to approach it and how you help your kids navigate this disorder is your responsibility. The best way to help your kid is up to you and if you aren’t sure you can try to enlist help from dietitians and/or therapists who specialize in eating disorders. \n\nI wish you and everyone who has ARFID the best of luck finding a strategy that works for them.",
          "created_utc": 1728512531.0
        },
        {
          "id": "lr68ler",
          "author": "lemurificspeckle",
          "body": "Off topic, and forgive me if this is overstepping, but have you ever heard of PANDAS or PANS? I only bring it up because there’s a good chance that played a part in my developing/worsening ARFID, and the change at a flip of a switch thing is what PANDAS/PANS is known for. Could be worth some research!",
          "created_utc": 1728517160.0
        },
        {
          "id": "lr693i0",
          "author": "None",
          "body": "I have not! I appreciate you asking! I will definitely have to look into this. If you have any references and are able to share please feel free to do so.",
          "created_utc": 1728517345.0
        },
        {
          "id": "lr6c04s",
          "author": "lemurificspeckle",
          "body": "I don’t have any specific sources, sorry! :( I can give you a pretty quick TL;DR, though: the theory is that you can get infected with a pathogen (strep for PANDAS, something else for PANS) and your body develops an autoimmune reaction to it where it mistakenly starts attacking your brain, and voilà, you now have OCD, ARFID, and/or tics! Some people think it can only happen to you as a kid, but some people have the same story happen to them as adults.\n\nFair warning: PANDAS/PANS isn’t fully accepted by doctors, but it’s accepted enough that multiple pediatricians brought it up to my parents when I was a kid, and when I mentioned it to my neurologist (who I see about tics) he was like “I can’t tell you 100% that’s what happened but yeah it sounds pretty probable, and I’m sure we’ll learn a lot more about it as more research comes out over the next decade!”\n\nBesides just having an answer for why you are the way you are, it could be good to know about because there could *potentially* be something to do about it that *might* make your symptoms better. BIG on the “potentially” and “might,” as we still don’t know a whole lot about it, but a strong and/or long course of antibiotics *might* help. My doctor recently did a GI map on me and we found out I have an overgrowth of H pylori (which I’ve likely had since I was like 2yo), and she said she considers that to be a potential PANS pathogen. I’m about to start antibiotics to see if we can get that taken care of, and while I’m mainly doing it because of acid reflux and general health stuff, I am interested to see if my OCD, ARFID, and tics get better!\n\nThis comment ended up SO long, omg!!!",
          "created_utc": 1728518430.0
        },
        {
          "id": "lr8fdwg",
          "author": "Hanhula",
          "body": "Holy shit, this might be what happened to me. I had some very mild OCD-like symptoms as a child, but one day I *very* suddenly went from being a relatively normal child to having pretty severe ARFID. Went undiagnosed, obviously, but my parents were distressed at their child suddenly no longer being able to eat 99% of things.\n\nWe've always assumed something bad happened at pre-school that I can't remember, but this might legitimately be the real explanation.",
          "created_utc": 1728558110.0
        }
      ]
    },
    {
      "id": "lrb763i",
      "author": "Letshavemorefun",
      "body": "It definitely wasn’t clear to me. Seemed like a general statement to me.",
      "created_utc": 1728593316.0,
      "score": 0,
      "context": [
        {
          "id": "lr6whrv",
          "author": "DefinitelynotDanger",
          "body": "I think it's my parents fault. But I don't blame them. It must be awful having a child that won't eat healthy food. The frustration of making food that goes to waste. It's hard for us but being a parent is hard too. I know they did their best.",
          "created_utc": 1728526267.0
        },
        {
          "id": "lrajzqq",
          "author": "Letshavemorefun",
          "body": "People with ARFID aren’t only averse to healthy foods. That’s a really harmful misnomer. \n\nA build your own salad is one of my favorite meals (build your own so I can choose the ingredients) but I can’t eat almost all candy bars and potato chips. \n\nLet’s not perpetuate these harmful stereotypes about Arfid. It isn’t about only eating junk food.",
          "created_utc": 1728585926.0
        },
        {
          "id": "lraonw5",
          "author": "DefinitelynotDanger",
          "body": "I'm referring to myself.",
          "created_utc": 1728587434.0
        },
        {
          "id": "lrapj5t",
          "author": "Letshavemorefun",
          "body": "Then you should make that clear. Maybe you weren’t aware that there is a harmful stereotype that people with Arfid just use it as an excuse to eat junk food - but now that you know, i think it makes sense to make it clear that you are only referring to yourself and that many people with Arfid eat a lot of healthy food and can’t eat plenty of junk foods.",
          "created_utc": 1728587713.0
        },
        {
          "id": "lrb4gs6",
          "author": "DefinitelynotDanger",
          "body": "I'm aware.\n\n I think it was pretty clear that I was referring to my personal story when I referred to my parents.",
          "created_utc": 1728592469.0
        }
      ]
    },
    {
      "id": "lr8n3ly",
      "author": "Hanhula",
      "body": "Yeah, I'm gonna have to look into this a little more and chat to my medical team around all of this. My parents have long felt guilty for the place they sent me potentially triggering this -- the place was awful for many reasons, so this was just one more thing that had them pull me out. If it's just my lifelong chronic illnesses kicking in, well.. that'll take something off them, I hope.",
      "created_utc": 1728562021.0,
      "score": 2,
      "context": [
        {
          "id": "lr5w9il",
          "author": "None",
          "body": "I’ve had ARFID for as long as I can remember (30+ years). My parents tell me that it started when I was really young and it was like the flip of a switch. One day I’d eat whatever they put in front of me and the next I would only eat a few things prepared specific ways. \n\nI’ve been fortunate to have really patient  and kind parents who have put up with me. My mom brought it up to my doctor all the time and he kept telling her that I’d grow out of it. I have not. So I definitely don’t think it’s the parents’ fault at all. But I do think there is a smart way to approach it and how you help your kids navigate this disorder is your responsibility. The best way to help your kid is up to you and if you aren’t sure you can try to enlist help from dietitians and/or therapists who specialize in eating disorders. \n\nI wish you and everyone who has ARFID the best of luck finding a strategy that works for them.",
          "created_utc": 1728512531.0
        },
        {
          "id": "lr68ler",
          "author": "lemurificspeckle",
          "body": "Off topic, and forgive me if this is overstepping, but have you ever heard of PANDAS or PANS? I only bring it up because there’s a good chance that played a part in my developing/worsening ARFID, and the change at a flip of a switch thing is what PANDAS/PANS is known for. Could be worth some research!",
          "created_utc": 1728517160.0
        },
        {
          "id": "lr693i0",
          "author": "None",
          "body": "I have not! I appreciate you asking! I will definitely have to look into this. If you have any references and are able to share please feel free to do so.",
          "created_utc": 1728517345.0
        },
        {
          "id": "lr6c04s",
          "author": "lemurificspeckle",
          "body": "I don’t have any specific sources, sorry! :( I can give you a pretty quick TL;DR, though: the theory is that you can get infected with a pathogen (strep for PANDAS, something else for PANS) and your body develops an autoimmune reaction to it where it mistakenly starts attacking your brain, and voilà, you now have OCD, ARFID, and/or tics! Some people think it can only happen to you as a kid, but some people have the same story happen to them as adults.\n\nFair warning: PANDAS/PANS isn’t fully accepted by doctors, but it’s accepted enough that multiple pediatricians brought it up to my parents when I was a kid, and when I mentioned it to my neurologist (who I see about tics) he was like “I can’t tell you 100% that’s what happened but yeah it sounds pretty probable, and I’m sure we’ll learn a lot more about it as more research comes out over the next decade!”\n\nBesides just having an answer for why you are the way you are, it could be good to know about because there could *potentially* be something to do about it that *might* make your symptoms better. BIG on the “potentially” and “might,” as we still don’t know a whole lot about it, but a strong and/or long course of antibiotics *might* help. My doctor recently did a GI map on me and we found out I have an overgrowth of H pylori (which I’ve likely had since I was like 2yo), and she said she considers that to be a potential PANS pathogen. I’m about to start antibiotics to see if we can get that taken care of, and while I’m mainly doing it because of acid reflux and general health stuff, I am interested to see if my OCD, ARFID, and tics get better!\n\nThis comment ended up SO long, omg!!!",
          "created_utc": 1728518430.0
        },
        {
          "id": "lr8fdwg",
          "author": "Hanhula",
          "body": "Holy shit, this might be what happened to me. I had some very mild OCD-like symptoms as a child, but one day I *very* suddenly went from being a relatively normal child to having pretty severe ARFID. Went undiagnosed, obviously, but my parents were distressed at their child suddenly no longer being able to eat 99% of things.\n\nWe've always assumed something bad happened at pre-school that I can't remember, but this might legitimately be the real explanation.",
          "created_utc": 1728558110.0
        },
        {
          "id": "lr8jj6x",
          "author": "lemurificspeckle",
          "body": "My story is pretty similar! I’m so glad this might give you your explanation! :,) <3",
          "created_utc": 1728560300.0
        }
      ]
    }
  ]
}