{
  "id": "1g273ws",
  "subreddit": "ARFID",
  "author": "iloveyoustellarose",
  "created_utc": 1728759357.0,
  "title": "I hate you I hate you I hate you",
  "selftext": "Was talking about how I have ARFID in GC with the boys and one of them comes in with this tone deaf ass comment. Like I was just talking about forcing myself to eat things I don't like so I can get a sufficient amount of vitamins and gagging. Literally fuck you ",
  "url": "https://i.redd.it/2ukjxe75hdud1.png",
  "score": 257,
  "num_comments": 58,
  "comments": [
    {
      "id": "lrlvbll",
      "author": "Tallem00",
      "body": "That's some psychic damage I was not expecting today. I literally just told my girlfriend the other day how horrible I feel because I restrict where she can eat. \n\nShe said this though, and it was good reassurance so maybe it'll reassure you all as well: \"I love you more than I care to eat at those places\"",
      "created_utc": 1728759553.0,
      "score": 277,
      "context": []
    },
    {
      "id": "lrlw7d4",
      "author": "apk5005",
      "body": "I’ve been married for thirteen years and dated the same woman for four years before that. \n\nShe understands my issues and has been unfailingly supportive.\n\nThe number of times she has said to me “let’s go there” for a meal that didn’t serve my kinds of food is pretty low…and, after each (mostly weddings) we have found a McDonald’s or all night diner where I got food. It isn’t that big of a deal if you are open and communicate clearly in your relationships.\n\nPeople who dismiss arfid out of hand are the ones in the wrong. People who belittle others for what/how they eat are just assholes. Don’t waste your good vibes countering their negativity.",
      "created_utc": 1728759852.0,
      "score": 69,
      "context": []
    },
    {
      "id": "lrlvgha",
      "author": "geekgeek2019",
      "body": "THE AUDACITY TO SIDE WITH A RANDOM PERSON BUT NOT THE ACTUAL sick person??\n\n one person can't eat at all and can die if not given safe foods vs one person can eat anything\n\ni can't with some people.",
      "created_utc": 1728759599.0,
      "score": 90,
      "context": []
    },
    {
      "id": "lrm3rpb",
      "author": "aroaceautistic",
      "body": "Do they suffer from a tragic illness that makes them unable to eat at restaurants unless they are with their partner specifically?",
      "created_utc": 1728762440.0,
      "score": 38,
      "context": []
    },
    {
      "id": "lrlxhzf",
      "author": "bobaylaa",
      "body": "that’s so rude!! there’s so many workarounds - a lot of places will have at least one “safe” food on the menu, and if not nobody’s stopping the partner from going out to an unsafe restaurant with their friends instead! or you could have a cute little takeout date where you get food from different places and eat at home together!\n\nlearning more about ARFID has really shown me how incredibly ableist our society still is. great strides have been made, but so many people are just completely unwilling to make even the tiniest of concessions in order to accommodate others and it’s disgusting. placing the desire to go to certain restaurants over respect for another human being, really??",
      "created_utc": 1728760281.0,
      "score": 20,
      "context": []
    },
    {
      "id": "lrmcb6m",
      "author": "Mago-Salicar",
      "body": "I have a group of friends who are hardcore foodies and I rarely got to go out with them because they would choose restaurants with limited menus, despite knowing my whole ARFID deal. That's fine, I don't expect everyone to cater to my eating habits, though it did sting a little that they never asked for my input. Eventually one of them asked why I turned down every invitation and I explained, \"As you know, I have an eating disorder that limits my palate and it is very difficult for me to find food to eat at the places you choose, and it's really uncomfortable to just sit there and watch everybody else eat.\" So the next time we were all going to dinner, I was asked to pick the restaurant. I chose a familiar restaurant I enjoy that had plenty of options, even for discerning palates. It was a chain but a local one, so I thought that would be acceptable.\n\nI was never invited out again.\n\nARFID often reveals more about the people around you than it does about you.",
      "created_utc": 1728765405.0,
      "score": 16,
      "context": []
    },
    {
      "id": "lrm0vin",
      "author": "Fizzabl",
      "body": "Oof. Wish I could erase those words from my eyes, what an asshole",
      "created_utc": 1728761427.0,
      "score": 10,
      "context": []
    },
    {
      "id": "lrm2jk3",
      "author": "Shot_Theory3862",
      "body": "Now I wish I didn’t click 🙃",
      "created_utc": 1728762013.0,
      "score": 7,
      "context": []
    },
    {
      "id": "lrmeff0",
      "author": "anilucy",
      "body": "I can’t even eat chicken tenders anymore after biting into a couple ones with the unchewable tendon/ligament thing so if you are still able to eat them, that’s a big accomplishment in my eyes. \n\nps- get new friends please the right ones would not make fun of your arfid.",
      "created_utc": 1728766150.0,
      "score": 6,
      "context": []
    },
    {
      "id": "lrlvc0z",
      "author": "Invisibleoatmeal",
      "body": "Please comment on it. Call them out on their bs",
      "created_utc": 1728759557.0,
      "score": 13,
      "context": []
    },
    {
      "id": "lrmb758",
      "author": "kendraro",
      "body": "I have extensive food allergies and I think ARFID is no different - it is a medical condition. People should learn compassion.",
      "created_utc": 1728765017.0,
      "score": 6,
      "context": []
    },
    {
      "id": "lrm6mja",
      "author": "purplechunkymonkey",
      "body": "Please stop forcing yourself. Find a multi vitamin you can handle. Don't put yourself through more trauma.",
      "created_utc": 1728763435.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lrmsew7",
      "author": "None",
      "body": "my wife refuses to eat anywhere i wont and i hate it :( id rather not eat than make anyone abide by my diet",
      "created_utc": 1728771291.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lrm6p53",
      "author": "colesense",
      "body": "Most places have a kids menu and I can eat. But also I’m fine with going out and just having a drink and eating home!! Or yknow they can go out with friends instead…",
      "created_utc": 1728763460.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lrmncdz",
      "author": "bubble-buddy2",
      "body": "It doesn't matter how they feel about their friend's partner. It's up to the partner to decide how they feel about it. And from this it seems the partner doesn't have an issue",
      "created_utc": 1728769367.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lrn97h9",
      "author": "wormfro",
      "body": "when i dated someone who had ARFID we just got food at different places if they didnt want the place i wanted, its not that hard",
      "created_utc": 1728777789.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lrnpihq",
      "author": "None",
      "body": "it’s so nasty when people say “i feel bad for their bf/gf” abt someone with mental health problems",
      "created_utc": 1728784354.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lrpija2",
      "author": "Ard4i",
      "body": "That's literally not even true?? most places have kids' menus.. i know a lot of our safe foods are on there, lol! plus, i dont think it'd be offensive to go to a restaurant with your own food to keep someone company! simply saying, \"Nothing for me, thank you, i brought my own! i have arfid, but i still wanted to keep my friend company\" would be enough! the tough part would be other peoples opinions, but that's also good exposure therapy and learning how not to care!",
      "created_utc": 1728821520.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lrq8tb1",
      "author": "RipCommon2394",
      "body": "This logic doesn't even track. Most places (even fancier places) will have chicken tenders for kids.",
      "created_utc": 1728832072.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lrr3hbr",
      "author": "phoebemocha",
      "body": "im so fed up to the point where i just fucking hate eating out. i dont even bother asking where my friends are going out anymore just flat out saying no because unless its like a breakfast diner or pizza then im probably not into it, and im not spending $7 on fries in a small ass tray.\n\ni just buy $7 frozen medium pizzas from target and make chocolate milk and call it a night.",
      "created_utc": 1728842065.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lrwwdcy",
      "author": "titica420",
      "body": "my bf just feels sad bc he doesn't like cooking only for himself:(",
      "created_utc": 1728929865.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m3ssf6t",
      "author": "ms_sylveon",
      "body": "What are they talking about alot of places have chicken nuggets or a chicken nugget equivalent.",
      "created_utc": 1735168438.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lrmqpt3",
      "author": "unimpressedmo",
      "body": "Sounds like something my gf’s friend would say",
      "created_utc": 1728770637.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lrn6lvd",
      "author": "brittndelilah",
      "body": "Partners can go out with someone else tbh",
      "created_utc": 1728776778.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lrno7n4",
      "author": "nimpog",
      "body": "Fuck that’s horrible.\n\nMy platonic wife and I both search restaurants that cater to our particular needs. I’m lucky to have everyone who eats with me find places I *can* eat at.",
      "created_utc": 1728783813.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lrogd0v",
      "author": "skorletun",
      "body": "Hey, I was this girlfriend for 5 years and we didn't break up for ARFID reasons that's for sure. My palate is wide and varied and I love trying new foods, my partner had to make sure there was some form of battered fried chicken before he could eat somewhere. It got a little annoying sometimes, sure, but he was annoyed that I slept in so insanely late even on holidays. We all have our own issues. Just because yours is a food aversion disorder doesn't mean you're any less worthy of love.",
      "created_utc": 1728796785.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lrze02w",
      "author": "WrongdoerForeign2364",
      "body": "As someone with like... 10 safe foods max most times and sometimes only 3 (all plain stuff with nothing added most of the time) Bread. Just plain bread. It doesn't matter if I don't eat bread at home but the little bread baskets at restaurants? Yea I'll eat those. In fact one time I was at a family dinner at this really posh place and I ate like 3 whole baskets of that stuff 😂 the waiter was shocked at how much plain ass bread I ate. And I would happily do that with a partner, I don't NEED to eat stuff at the restaurant 🤷 idk if America has the bread things but in Australia it's quite common in a lot of restaurants. I moved to America this year and haven't really gone to food places. Also there's other things to do with a partner or friend? Like I would rather go for a walk and talk then awkwardly sit and eat in a loud place anyways.",
      "created_utc": 1728961116.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lrm7uwd",
      "author": "braedizzle",
      "body": "This isn’t hateful. I have ARFID and agree one of the biggest challenges is that it limits where my partner can go with me.",
      "created_utc": 1728763861.0,
      "score": -6,
      "context": []
    },
    {
      "id": "lrm8t0a",
      "author": "QueenSlothie",
      "body": "Honestly, this doesn't seem that tone deaf to me. As someone who genuinely restricts where their partner eats...it's more of a statement and observation, in my opinion. Especially from an outside perspective this is very very common.  Yes, it might have been better to address your concerns first, but he is not wrong in saying he feels bad because their partner doesn't eat at the same places. My fiancé has wanted to take me to KBBQ forever, and I've never gone. I know he loves me, but I'm sure it would be great if I ate that kind of stuff, yknow. I'm not saying we should feel bad since we can't control it, I'm just saying I get the outside perspective. \n\nMaybe instead of getting upset at him for being unknowledgable, take this as an opportunity to inform him more about the disorder and the friend's partner's perspective, to maybe provide more empathy rather than judgment. Explain that it's more than just eating only chicken tenders. It's very close to a phobia of new food and textures and tastes because they can overwhelm us. Explain that eating at the same places can be very anxiety inducing and that it is extremely painful to live mentally, especially when people say we're being a burden because they can't eat what they want.",
      "created_utc": 1728764187.0,
      "score": -7,
      "context": []
    },
    {
      "id": "lrlxgkc",
      "author": "SmallHouseDog",
      "body": "I feel this a lot, lately we’ve been finding more non-mall dining hall/food-court options in big cities OR we’ll get to-go from separate places and meet back up to eat together. We still go out and eat together in a traditional sense sometimes, especially for events or nice dinners, but this has helped me feel less guilty many times.",
      "created_utc": 1728760268.0,
      "score": 51,
      "context": [
        {
          "id": "lrlvbll",
          "author": "Tallem00",
          "body": "That's some psychic damage I was not expecting today. I literally just told my girlfriend the other day how horrible I feel because I restrict where she can eat. \n\nShe said this though, and it was good reassurance so maybe it'll reassure you all as well: \"I love you more than I care to eat at those places\"",
          "created_utc": 1728759553.0
        }
      ]
    },
    {
      "id": "lrlxpct",
      "author": "Tarkus459",
      "body": "That is so awesome.",
      "created_utc": 1728760348.0,
      "score": 12,
      "context": [
        {
          "id": "lrlvbll",
          "author": "Tallem00",
          "body": "That's some psychic damage I was not expecting today. I literally just told my girlfriend the other day how horrible I feel because I restrict where she can eat. \n\nShe said this though, and it was good reassurance so maybe it'll reassure you all as well: \"I love you more than I care to eat at those places\"",
          "created_utc": 1728759553.0
        }
      ]
    },
    {
      "id": "lrm1kso",
      "author": "brothajim69",
      "body": "I feel the same way I always feel like a piece of shit about it too",
      "created_utc": 1728761676.0,
      "score": 8,
      "context": [
        {
          "id": "lrlvbll",
          "author": "Tallem00",
          "body": "That's some psychic damage I was not expecting today. I literally just told my girlfriend the other day how horrible I feel because I restrict where she can eat. \n\nShe said this though, and it was good reassurance so maybe it'll reassure you all as well: \"I love you more than I care to eat at those places\"",
          "created_utc": 1728759553.0
        }
      ]
    },
    {
      "id": "lrm8ftj",
      "author": "geekgeek2019",
      "body": " yes the guilt is so real",
      "created_utc": 1728764060.0,
      "score": 6,
      "context": [
        {
          "id": "lrlvbll",
          "author": "Tallem00",
          "body": "That's some psychic damage I was not expecting today. I literally just told my girlfriend the other day how horrible I feel because I restrict where she can eat. \n\nShe said this though, and it was good reassurance so maybe it'll reassure you all as well: \"I love you more than I care to eat at those places\"",
          "created_utc": 1728759553.0
        }
      ]
    },
    {
      "id": "ltcgnto",
      "author": "huntresswizard_",
      "body": "There’s also the magic of getting separate meals from separate places and eating them together at home :)",
      "created_utc": 1729693407.0,
      "score": 1,
      "context": [
        {
          "id": "lrlvbll",
          "author": "Tallem00",
          "body": "That's some psychic damage I was not expecting today. I literally just told my girlfriend the other day how horrible I feel because I restrict where she can eat. \n\nShe said this though, and it was good reassurance so maybe it'll reassure you all as well: \"I love you more than I care to eat at those places\"",
          "created_utc": 1728759553.0
        }
      ]
    },
    {
      "id": "lrmc084",
      "author": "johnny-Low-Five",
      "body": "My wife knows I will go to ANY restaurant and either eat some fries or bread or I would gladly not eat anything if it was something she enjoyed. She prefers to go places where I'll eat \"a meal\" but I've told her innumerable times how sad I would be if she was denying herself on my behalf. \n\nWere married 12 years and have a child together. We only eat out, at most, a dozen times a year. People posting nonsense like this are likely very young and have no idea what makes a real relationship work. If anyone is in this boat one thing I've found that is both useful and, I think, shows my appreciation for her is the handful of times a year she goes out with her sister or a friend I try to \"insist' they do dinner as well. I remind her how I hate being a restriction on her \"diet\" and even when money is tight I suggest they go eat somewhere she's not comfortable going and having me \"watch\" her eat. \n\nIt's not a big thing but it seems to matter alot, in the same way she knows how much I thrive off of verbal affection and affirmations. I would gladly wait till later to eat if it meant my wife could enjoy her meal, it just so happens that, like someone else posted, she says she would rather go somewhere WITH ME, than eat a specific dish. \n\nIt's different but I don't want her to watch the Jets or Mets with me just to be supportive, I would rather know she's enjoying herself. Sometimes she'll play around on her phone and pretend to agree with whatever I say about my team and even though I know she has no idea what  I'm talking about, the effort is what I appreciate. \n\nGood relationships don't get bogged down over stuff like this and anyone thinking it's a \"deal breaker\" clearly hasn't met the right person yet. I've watched more real housewives than I ever imagined I would, I laugh at them but just being with my wife makes anything fun.",
      "created_utc": 1728765300.0,
      "score": 27,
      "context": [
        {
          "id": "lrlw7d4",
          "author": "apk5005",
          "body": "I’ve been married for thirteen years and dated the same woman for four years before that. \n\nShe understands my issues and has been unfailingly supportive.\n\nThe number of times she has said to me “let’s go there” for a meal that didn’t serve my kinds of food is pretty low…and, after each (mostly weddings) we have found a McDonald’s or all night diner where I got food. It isn’t that big of a deal if you are open and communicate clearly in your relationships.\n\nPeople who dismiss arfid out of hand are the ones in the wrong. People who belittle others for what/how they eat are just assholes. Don’t waste your good vibes countering their negativity.",
          "created_utc": 1728759852.0
        }
      ]
    },
    {
      "id": "lrm9wpv",
      "author": "QueenSlothie",
      "body": "It honestly doesn't seem malicious to me, just uninformed about the disorder. Many people don't understand the concept of safe foods or anything about the disorder. I have met many people who view it as a choice for picky eating, not an eating disorder. I think it's important to understand the general populations concept of food: which to them is a beautiful, enriching experience they like to enjoy and share with others. He is saying he feels bad because their friend can't do that with their partner. That can be a difficult thing for someone who has never dated a \"picky eater\" before (by this, i mean, in general, actual picky eaters AND people with ARFID, which I know are not synonymous but the general category of people who don't \"eat everything\") My fiancé is a bit picky, so that kinda helps my case, but not everyone has that luxury.",
      "created_utc": 1728764571.0,
      "score": 24,
      "context": [
        {
          "id": "lrlvgha",
          "author": "geekgeek2019",
          "body": "THE AUDACITY TO SIDE WITH A RANDOM PERSON BUT NOT THE ACTUAL sick person??\n\n one person can't eat at all and can die if not given safe foods vs one person can eat anything\n\ni can't with some people.",
          "created_utc": 1728759599.0
        }
      ]
    },
    {
      "id": "lrm5lq6",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1728763075.0,
      "score": 14,
      "context": [
        {
          "id": "lrm3rpb",
          "author": "aroaceautistic",
          "body": "Do they suffer from a tragic illness that makes them unable to eat at restaurants unless they are with their partner specifically?",
          "created_utc": 1728762440.0
        }
      ]
    },
    {
      "id": "lrme20i",
      "author": "iloveyoustellarose",
      "body": "And people act like restaurants don't have a wide menu option for ARFID people?? Like I hate seafood, but I will go to the seafood place with you and order the chicken tenders that they all have on the menu. \n\nJust because I'm not getting the food in the name of the restaurant doesn't mean I can't go?? But if the menu is limited then that changes a lot, and I honestly haven't encountered many places like this.\n\nI'm sorry your friends excluded you like that when you did exactly what any other person in your position would do.",
      "created_utc": 1728766019.0,
      "score": 10,
      "context": [
        {
          "id": "lrmcb6m",
          "author": "Mago-Salicar",
          "body": "I have a group of friends who are hardcore foodies and I rarely got to go out with them because they would choose restaurants with limited menus, despite knowing my whole ARFID deal. That's fine, I don't expect everyone to cater to my eating habits, though it did sting a little that they never asked for my input. Eventually one of them asked why I turned down every invitation and I explained, \"As you know, I have an eating disorder that limits my palate and it is very difficult for me to find food to eat at the places you choose, and it's really uncomfortable to just sit there and watch everybody else eat.\" So the next time we were all going to dinner, I was asked to pick the restaurant. I chose a familiar restaurant I enjoy that had plenty of options, even for discerning palates. It was a chain but a local one, so I thought that would be acceptable.\n\nI was never invited out again.\n\nARFID often reveals more about the people around you than it does about you.",
          "created_utc": 1728765405.0
        }
      ]
    },
    {
      "id": "lrm1jv3",
      "author": "iloveyoustellarose",
      "body": "Same :((",
      "created_utc": 1728761666.0,
      "score": 1,
      "context": [
        {
          "id": "lrm0vin",
          "author": "Fizzabl",
          "body": "Oof. Wish I could erase those words from my eyes, what an asshole",
          "created_utc": 1728761427.0
        }
      ]
    },
    {
      "id": "lrm8n65",
      "author": "geekgeek2019",
      "body": "ikrrr im so maddd",
      "created_utc": 1728764131.0,
      "score": 2,
      "context": [
        {
          "id": "lrm2jk3",
          "author": "Shot_Theory3862",
          "body": "Now I wish I didn’t click 🙃",
          "created_utc": 1728762013.0
        }
      ]
    },
    {
      "id": "lrmf0qo",
      "author": "iloveyoustellarose",
      "body": "I've had that happen and didn't eat them for a few months... But after like 6 months I smelled a Bojangles and got the hankering again. Now I'm back to my chicken eating tendencies. This guy is a mutual friend tbh and I just kinda tolerate him >.>",
      "created_utc": 1728766358.0,
      "score": 4,
      "context": [
        {
          "id": "lrmeff0",
          "author": "anilucy",
          "body": "I can’t even eat chicken tenders anymore after biting into a couple ones with the unchewable tendon/ligament thing so if you are still able to eat them, that’s a big accomplishment in my eyes. \n\nps- get new friends please the right ones would not make fun of your arfid.",
          "created_utc": 1728766150.0
        }
      ]
    },
    {
      "id": "lrma1e1",
      "author": "iloveyoustellarose",
      "body": "This is a vent post. I am not looking for criticism. Thank you.",
      "created_utc": 1728764616.0,
      "score": 9,
      "context": [
        {
          "id": "lrm8t0a",
          "author": "QueenSlothie",
          "body": "Honestly, this doesn't seem that tone deaf to me. As someone who genuinely restricts where their partner eats...it's more of a statement and observation, in my opinion. Especially from an outside perspective this is very very common.  Yes, it might have been better to address your concerns first, but he is not wrong in saying he feels bad because their partner doesn't eat at the same places. My fiancé has wanted to take me to KBBQ forever, and I've never gone. I know he loves me, but I'm sure it would be great if I ate that kind of stuff, yknow. I'm not saying we should feel bad since we can't control it, I'm just saying I get the outside perspective. \n\nMaybe instead of getting upset at him for being unknowledgable, take this as an opportunity to inform him more about the disorder and the friend's partner's perspective, to maybe provide more empathy rather than judgment. Explain that it's more than just eating only chicken tenders. It's very close to a phobia of new food and textures and tastes because they can overwhelm us. Explain that eating at the same places can be very anxiety inducing and that it is extremely painful to live mentally, especially when people say we're being a burden because they can't eat what they want.",
          "created_utc": 1728764187.0
        }
      ]
    },
    {
      "id": "lrmvyv2",
      "author": "gunswithkids",
      "body": "I completely agree. You suggested actionable responses which in my experience really help. Getting people to understand the disorder is so important. \n\nI have ARFID but I fully recognize that it can be a bummer to people. Especially partners. With neurotypical people without ARFID, food is a vibrant culture. It’s a love language. It’s spanned for the entire existence of humanity. In their eyes, they want to share something important to them with me. Watching Anthony Bourdain truthfully helped me understand this to the fullest. Understanding the frustration while also providing insight to your own personal experience is so helpful.",
      "created_utc": 1728772665.0,
      "score": 3,
      "context": [
        {
          "id": "lrm8t0a",
          "author": "QueenSlothie",
          "body": "Honestly, this doesn't seem that tone deaf to me. As someone who genuinely restricts where their partner eats...it's more of a statement and observation, in my opinion. Especially from an outside perspective this is very very common.  Yes, it might have been better to address your concerns first, but he is not wrong in saying he feels bad because their partner doesn't eat at the same places. My fiancé has wanted to take me to KBBQ forever, and I've never gone. I know he loves me, but I'm sure it would be great if I ate that kind of stuff, yknow. I'm not saying we should feel bad since we can't control it, I'm just saying I get the outside perspective. \n\nMaybe instead of getting upset at him for being unknowledgable, take this as an opportunity to inform him more about the disorder and the friend's partner's perspective, to maybe provide more empathy rather than judgment. Explain that it's more than just eating only chicken tenders. It's very close to a phobia of new food and textures and tastes because they can overwhelm us. Explain that eating at the same places can be very anxiety inducing and that it is extremely painful to live mentally, especially when people say we're being a burden because they can't eat what they want.",
          "created_utc": 1728764187.0
        }
      ]
    },
    {
      "id": "lrmcrhf",
      "author": "ChurchOW",
      "body": "Down voting for not contributing to the echo chamber is wild",
      "created_utc": 1728765565.0,
      "score": -2,
      "context": [
        {
          "id": "lrm8t0a",
          "author": "QueenSlothie",
          "body": "Honestly, this doesn't seem that tone deaf to me. As someone who genuinely restricts where their partner eats...it's more of a statement and observation, in my opinion. Especially from an outside perspective this is very very common.  Yes, it might have been better to address your concerns first, but he is not wrong in saying he feels bad because their partner doesn't eat at the same places. My fiancé has wanted to take me to KBBQ forever, and I've never gone. I know he loves me, but I'm sure it would be great if I ate that kind of stuff, yknow. I'm not saying we should feel bad since we can't control it, I'm just saying I get the outside perspective. \n\nMaybe instead of getting upset at him for being unknowledgable, take this as an opportunity to inform him more about the disorder and the friend's partner's perspective, to maybe provide more empathy rather than judgment. Explain that it's more than just eating only chicken tenders. It's very close to a phobia of new food and textures and tastes because they can overwhelm us. Explain that eating at the same places can be very anxiety inducing and that it is extremely painful to live mentally, especially when people say we're being a burden because they can't eat what they want.",
          "created_utc": 1728764187.0
        }
      ]
    },
    {
      "id": "lrlyd7n",
      "author": "Tallem00",
      "body": "She usually drives us to grab each of our meals to-go at different places then go eat together at a park. It's lovely getting to feel like I'm not restricting her *and* I prefer eating in nature to cramped up in a restaurant anyway",
      "created_utc": 1728760572.0,
      "score": 30,
      "context": [
        {
          "id": "lrlvbll",
          "author": "Tallem00",
          "body": "That's some psychic damage I was not expecting today. I literally just told my girlfriend the other day how horrible I feel because I restrict where she can eat. \n\nShe said this though, and it was good reassurance so maybe it'll reassure you all as well: \"I love you more than I care to eat at those places\"",
          "created_utc": 1728759553.0
        },
        {
          "id": "lrlxgkc",
          "author": "SmallHouseDog",
          "body": "I feel this a lot, lately we’ve been finding more non-mall dining hall/food-court options in big cities OR we’ll get to-go from separate places and meet back up to eat together. We still go out and eat together in a traditional sense sometimes, especially for events or nice dinners, but this has helped me feel less guilty many times.",
          "created_utc": 1728760268.0
        }
      ]
    },
    {
      "id": "lrps2di",
      "author": "MrPureinstinct",
      "body": "My wife and I will do our own thing for food every now and then. She loves food and has a really diverse palette. \nI obviously do not share that so if she's craving something we both know I cannot eat we just order our own things for delivery or takeout that night. \n\nThen we both get what we like and just eat together, same as if we'd made the same meal.",
      "created_utc": 1728825896.0,
      "score": 3,
      "context": [
        {
          "id": "lrlvbll",
          "author": "Tallem00",
          "body": "That's some psychic damage I was not expecting today. I literally just told my girlfriend the other day how horrible I feel because I restrict where she can eat. \n\nShe said this though, and it was good reassurance so maybe it'll reassure you all as well: \"I love you more than I care to eat at those places\"",
          "created_utc": 1728759553.0
        },
        {
          "id": "lrlxgkc",
          "author": "SmallHouseDog",
          "body": "I feel this a lot, lately we’ve been finding more non-mall dining hall/food-court options in big cities OR we’ll get to-go from separate places and meet back up to eat together. We still go out and eat together in a traditional sense sometimes, especially for events or nice dinners, but this has helped me feel less guilty many times.",
          "created_utc": 1728760268.0
        }
      ]
    },
    {
      "id": "lrlyexi",
      "author": "Tallem00",
      "body": "She's the best!",
      "created_utc": 1728760588.0,
      "score": 7,
      "context": [
        {
          "id": "lrlvbll",
          "author": "Tallem00",
          "body": "That's some psychic damage I was not expecting today. I literally just told my girlfriend the other day how horrible I feel because I restrict where she can eat. \n\nShe said this though, and it was good reassurance so maybe it'll reassure you all as well: \"I love you more than I care to eat at those places\"",
          "created_utc": 1728759553.0
        },
        {
          "id": "lrlxpct",
          "author": "Tarkus459",
          "body": "That is so awesome.",
          "created_utc": 1728760348.0
        }
      ]
    },
    {
      "id": "lrmi2d7",
      "author": "apk5005",
      "body": "Yes!\n\nMy wife routinely brags about how I’m a “cheap date”…cheese pizza, fries, and/or spaghetti with just marinara are all pretty inexpensive.",
      "created_utc": 1728767439.0,
      "score": 14,
      "context": [
        {
          "id": "lrlw7d4",
          "author": "apk5005",
          "body": "I’ve been married for thirteen years and dated the same woman for four years before that. \n\nShe understands my issues and has been unfailingly supportive.\n\nThe number of times she has said to me “let’s go there” for a meal that didn’t serve my kinds of food is pretty low…and, after each (mostly weddings) we have found a McDonald’s or all night diner where I got food. It isn’t that big of a deal if you are open and communicate clearly in your relationships.\n\nPeople who dismiss arfid out of hand are the ones in the wrong. People who belittle others for what/how they eat are just assholes. Don’t waste your good vibes countering their negativity.",
          "created_utc": 1728759852.0
        },
        {
          "id": "lrmc084",
          "author": "johnny-Low-Five",
          "body": "My wife knows I will go to ANY restaurant and either eat some fries or bread or I would gladly not eat anything if it was something she enjoyed. She prefers to go places where I'll eat \"a meal\" but I've told her innumerable times how sad I would be if she was denying herself on my behalf. \n\nWere married 12 years and have a child together. We only eat out, at most, a dozen times a year. People posting nonsense like this are likely very young and have no idea what makes a real relationship work. If anyone is in this boat one thing I've found that is both useful and, I think, shows my appreciation for her is the handful of times a year she goes out with her sister or a friend I try to \"insist' they do dinner as well. I remind her how I hate being a restriction on her \"diet\" and even when money is tight I suggest they go eat somewhere she's not comfortable going and having me \"watch\" her eat. \n\nIt's not a big thing but it seems to matter alot, in the same way she knows how much I thrive off of verbal affection and affirmations. I would gladly wait till later to eat if it meant my wife could enjoy her meal, it just so happens that, like someone else posted, she says she would rather go somewhere WITH ME, than eat a specific dish. \n\nIt's different but I don't want her to watch the Jets or Mets with me just to be supportive, I would rather know she's enjoying herself. Sometimes she'll play around on her phone and pretend to agree with whatever I say about my team and even though I know she has no idea what  I'm talking about, the effort is what I appreciate. \n\nGood relationships don't get bogged down over stuff like this and anyone thinking it's a \"deal breaker\" clearly hasn't met the right person yet. I've watched more real housewives than I ever imagined I would, I laugh at them but just being with my wife makes anything fun.",
          "created_utc": 1728765300.0
        }
      ]
    },
    {
      "id": "lrna0cd",
      "author": "haydesigner",
      "body": "To be fair, no one should make anyone watch the Mets.",
      "created_utc": 1728778105.0,
      "score": 5,
      "context": [
        {
          "id": "lrlw7d4",
          "author": "apk5005",
          "body": "I’ve been married for thirteen years and dated the same woman for four years before that. \n\nShe understands my issues and has been unfailingly supportive.\n\nThe number of times she has said to me “let’s go there” for a meal that didn’t serve my kinds of food is pretty low…and, after each (mostly weddings) we have found a McDonald’s or all night diner where I got food. It isn’t that big of a deal if you are open and communicate clearly in your relationships.\n\nPeople who dismiss arfid out of hand are the ones in the wrong. People who belittle others for what/how they eat are just assholes. Don’t waste your good vibes countering their negativity.",
          "created_utc": 1728759852.0
        },
        {
          "id": "lrmc084",
          "author": "johnny-Low-Five",
          "body": "My wife knows I will go to ANY restaurant and either eat some fries or bread or I would gladly not eat anything if it was something she enjoyed. She prefers to go places where I'll eat \"a meal\" but I've told her innumerable times how sad I would be if she was denying herself on my behalf. \n\nWere married 12 years and have a child together. We only eat out, at most, a dozen times a year. People posting nonsense like this are likely very young and have no idea what makes a real relationship work. If anyone is in this boat one thing I've found that is both useful and, I think, shows my appreciation for her is the handful of times a year she goes out with her sister or a friend I try to \"insist' they do dinner as well. I remind her how I hate being a restriction on her \"diet\" and even when money is tight I suggest they go eat somewhere she's not comfortable going and having me \"watch\" her eat. \n\nIt's not a big thing but it seems to matter alot, in the same way she knows how much I thrive off of verbal affection and affirmations. I would gladly wait till later to eat if it meant my wife could enjoy her meal, it just so happens that, like someone else posted, she says she would rather go somewhere WITH ME, than eat a specific dish. \n\nIt's different but I don't want her to watch the Jets or Mets with me just to be supportive, I would rather know she's enjoying herself. Sometimes she'll play around on her phone and pretend to agree with whatever I say about my team and even though I know she has no idea what  I'm talking about, the effort is what I appreciate. \n\nGood relationships don't get bogged down over stuff like this and anyone thinking it's a \"deal breaker\" clearly hasn't met the right person yet. I've watched more real housewives than I ever imagined I would, I laugh at them but just being with my wife makes anything fun.",
          "created_utc": 1728765300.0
        }
      ]
    },
    {
      "id": "lrm9stx",
      "author": "aroaceautistic",
      "body": "Obviously nights out with friends or family are out of the question as well lmao",
      "created_utc": 1728764533.0,
      "score": 7,
      "context": [
        {
          "id": "lrm3rpb",
          "author": "aroaceautistic",
          "body": "Do they suffer from a tragic illness that makes them unable to eat at restaurants unless they are with their partner specifically?",
          "created_utc": 1728762440.0
        },
        {
          "id": "lrm5lq6",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1728763075.0
        }
      ]
    },
    {
      "id": "lrmihzx",
      "author": "Mago-Salicar",
      "body": "To give an example, they really enjoyed Vietnamese food, and while I have nothing against any culture's cuisine, but the restaurant they choose has absolutely no options that jive with my particular brand of ARFID. Same goes for the Indian and Ethiopian places they like. I don't want them to not be able to eat where they want, but the one time they offered to accommodate me, they just couldn't handle it. It made me feel so Othered. I realized that if I want to preserve those friendships, I need to take food out of the equation entirely and concede defeat.\n\nIt's all good though, I have cultivated a different little group of friends who have no problem with the kinds of places I prefer. I found folks who love a good diner and who don't think a chain restaurant is somehow beneath them, and they don't make fun of me if all I can manage is the grilled cheese. I found people who understand why sometimes 2am Taco Bell is a necessity. <3",
      "created_utc": 1728767594.0,
      "score": 9,
      "context": [
        {
          "id": "lrmcb6m",
          "author": "Mago-Salicar",
          "body": "I have a group of friends who are hardcore foodies and I rarely got to go out with them because they would choose restaurants with limited menus, despite knowing my whole ARFID deal. That's fine, I don't expect everyone to cater to my eating habits, though it did sting a little that they never asked for my input. Eventually one of them asked why I turned down every invitation and I explained, \"As you know, I have an eating disorder that limits my palate and it is very difficult for me to find food to eat at the places you choose, and it's really uncomfortable to just sit there and watch everybody else eat.\" So the next time we were all going to dinner, I was asked to pick the restaurant. I chose a familiar restaurant I enjoy that had plenty of options, even for discerning palates. It was a chain but a local one, so I thought that would be acceptable.\n\nI was never invited out again.\n\nARFID often reveals more about the people around you than it does about you.",
          "created_utc": 1728765405.0
        },
        {
          "id": "lrme20i",
          "author": "iloveyoustellarose",
          "body": "And people act like restaurants don't have a wide menu option for ARFID people?? Like I hate seafood, but I will go to the seafood place with you and order the chicken tenders that they all have on the menu. \n\nJust because I'm not getting the food in the name of the restaurant doesn't mean I can't go?? But if the menu is limited then that changes a lot, and I honestly haven't encountered many places like this.\n\nI'm sorry your friends excluded you like that when you did exactly what any other person in your position would do.",
          "created_utc": 1728766019.0
        }
      ]
    },
    {
      "id": "lrspol8",
      "author": "FreddyPlayz",
      "body": "God I want a Bonjangles in my town SO bad I love that place 😭",
      "created_utc": 1728861601.0,
      "score": 1,
      "context": [
        {
          "id": "lrmeff0",
          "author": "anilucy",
          "body": "I can’t even eat chicken tenders anymore after biting into a couple ones with the unchewable tendon/ligament thing so if you are still able to eat them, that’s a big accomplishment in my eyes. \n\nps- get new friends please the right ones would not make fun of your arfid.",
          "created_utc": 1728766150.0
        },
        {
          "id": "lrmf0qo",
          "author": "iloveyoustellarose",
          "body": "I've had that happen and didn't eat them for a few months... But after like 6 months I smelled a Bojangles and got the hankering again. Now I'm back to my chicken eating tendencies. This guy is a mutual friend tbh and I just kinda tolerate him >.>",
          "created_utc": 1728766358.0
        }
      ]
    },
    {
      "id": "lrn8f06",
      "author": "QueenSlothie",
      "body": "Yes exactly!! Thank you so much ❤️ I was really feeling brought down about all of the other responses to my comment...i truly didn't mean anything other than understanding the other person and providing information on the disorder to help them in the future not say something that could be seen as offensive. \n\nI prefer to provide solutions...and I'm sorry if OP just wanted to vent but some people like to suggest ways to help rather than just saying \"damn that really sucks\" yknow? \n\nI will definitely look into Anthony Bourdain! I've heard of him and seen a bit of his stuff but yes, neurotypical people without ARFID love food and they can't really understand NOT loving food so it's a hard disorder for them to grasp.",
      "created_utc": 1728777482.0,
      "score": 2,
      "context": [
        {
          "id": "lrm8t0a",
          "author": "QueenSlothie",
          "body": "Honestly, this doesn't seem that tone deaf to me. As someone who genuinely restricts where their partner eats...it's more of a statement and observation, in my opinion. Especially from an outside perspective this is very very common.  Yes, it might have been better to address your concerns first, but he is not wrong in saying he feels bad because their partner doesn't eat at the same places. My fiancé has wanted to take me to KBBQ forever, and I've never gone. I know he loves me, but I'm sure it would be great if I ate that kind of stuff, yknow. I'm not saying we should feel bad since we can't control it, I'm just saying I get the outside perspective. \n\nMaybe instead of getting upset at him for being unknowledgable, take this as an opportunity to inform him more about the disorder and the friend's partner's perspective, to maybe provide more empathy rather than judgment. Explain that it's more than just eating only chicken tenders. It's very close to a phobia of new food and textures and tastes because they can overwhelm us. Explain that eating at the same places can be very anxiety inducing and that it is extremely painful to live mentally, especially when people say we're being a burden because they can't eat what they want.",
          "created_utc": 1728764187.0
        },
        {
          "id": "lrmvyv2",
          "author": "gunswithkids",
          "body": "I completely agree. You suggested actionable responses which in my experience really help. Getting people to understand the disorder is so important. \n\nI have ARFID but I fully recognize that it can be a bummer to people. Especially partners. With neurotypical people without ARFID, food is a vibrant culture. It’s a love language. It’s spanned for the entire existence of humanity. In their eyes, they want to share something important to them with me. Watching Anthony Bourdain truthfully helped me understand this to the fullest. Understanding the frustration while also providing insight to your own personal experience is so helpful.",
          "created_utc": 1728772665.0
        }
      ]
    },
    {
      "id": "lrmcxf3",
      "author": "QueenSlothie",
      "body": "He blocked me too lol like damn don't post to a public forum if you don't accept everyone's opinions",
      "created_utc": 1728765621.0,
      "score": -3,
      "context": [
        {
          "id": "lrm8t0a",
          "author": "QueenSlothie",
          "body": "Honestly, this doesn't seem that tone deaf to me. As someone who genuinely restricts where their partner eats...it's more of a statement and observation, in my opinion. Especially from an outside perspective this is very very common.  Yes, it might have been better to address your concerns first, but he is not wrong in saying he feels bad because their partner doesn't eat at the same places. My fiancé has wanted to take me to KBBQ forever, and I've never gone. I know he loves me, but I'm sure it would be great if I ate that kind of stuff, yknow. I'm not saying we should feel bad since we can't control it, I'm just saying I get the outside perspective. \n\nMaybe instead of getting upset at him for being unknowledgable, take this as an opportunity to inform him more about the disorder and the friend's partner's perspective, to maybe provide more empathy rather than judgment. Explain that it's more than just eating only chicken tenders. It's very close to a phobia of new food and textures and tastes because they can overwhelm us. Explain that eating at the same places can be very anxiety inducing and that it is extremely painful to live mentally, especially when people say we're being a burden because they can't eat what they want.",
          "created_utc": 1728764187.0
        },
        {
          "id": "lrmcrhf",
          "author": "ChurchOW",
          "body": "Down voting for not contributing to the echo chamber is wild",
          "created_utc": 1728765565.0
        }
      ]
    },
    {
      "id": "lrm6ug4",
      "author": "colesense",
      "body": "Omg yes I love getting food at my own place and my bf gets his food and we sit at a park together",
      "created_utc": 1728763511.0,
      "score": 16,
      "context": [
        {
          "id": "lrlvbll",
          "author": "Tallem00",
          "body": "That's some psychic damage I was not expecting today. I literally just told my girlfriend the other day how horrible I feel because I restrict where she can eat. \n\nShe said this though, and it was good reassurance so maybe it'll reassure you all as well: \"I love you more than I care to eat at those places\"",
          "created_utc": 1728759553.0
        },
        {
          "id": "lrlxgkc",
          "author": "SmallHouseDog",
          "body": "I feel this a lot, lately we’ve been finding more non-mall dining hall/food-court options in big cities OR we’ll get to-go from separate places and meet back up to eat together. We still go out and eat together in a traditional sense sometimes, especially for events or nice dinners, but this has helped me feel less guilty many times.",
          "created_utc": 1728760268.0
        },
        {
          "id": "lrlyd7n",
          "author": "Tallem00",
          "body": "She usually drives us to grab each of our meals to-go at different places then go eat together at a park. It's lovely getting to feel like I'm not restricting her *and* I prefer eating in nature to cramped up in a restaurant anyway",
          "created_utc": 1728760572.0
        }
      ]
    },
    {
      "id": "lrr7iw5",
      "author": "katekate5300",
      "body": "This is the sweetest",
      "created_utc": 1728843331.0,
      "score": 3,
      "context": [
        {
          "id": "lrlvbll",
          "author": "Tallem00",
          "body": "That's some psychic damage I was not expecting today. I literally just told my girlfriend the other day how horrible I feel because I restrict where she can eat. \n\nShe said this though, and it was good reassurance so maybe it'll reassure you all as well: \"I love you more than I care to eat at those places\"",
          "created_utc": 1728759553.0
        },
        {
          "id": "lrlxgkc",
          "author": "SmallHouseDog",
          "body": "I feel this a lot, lately we’ve been finding more non-mall dining hall/food-court options in big cities OR we’ll get to-go from separate places and meet back up to eat together. We still go out and eat together in a traditional sense sometimes, especially for events or nice dinners, but this has helped me feel less guilty many times.",
          "created_utc": 1728760268.0
        },
        {
          "id": "lrlyd7n",
          "author": "Tallem00",
          "body": "She usually drives us to grab each of our meals to-go at different places then go eat together at a park. It's lovely getting to feel like I'm not restricting her *and* I prefer eating in nature to cramped up in a restaurant anyway",
          "created_utc": 1728760572.0
        }
      ]
    },
    {
      "id": "lrmi4nw",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1728767462.0,
      "score": 4,
      "context": [
        {
          "id": "lrm8t0a",
          "author": "QueenSlothie",
          "body": "Honestly, this doesn't seem that tone deaf to me. As someone who genuinely restricts where their partner eats...it's more of a statement and observation, in my opinion. Especially from an outside perspective this is very very common.  Yes, it might have been better to address your concerns first, but he is not wrong in saying he feels bad because their partner doesn't eat at the same places. My fiancé has wanted to take me to KBBQ forever, and I've never gone. I know he loves me, but I'm sure it would be great if I ate that kind of stuff, yknow. I'm not saying we should feel bad since we can't control it, I'm just saying I get the outside perspective. \n\nMaybe instead of getting upset at him for being unknowledgable, take this as an opportunity to inform him more about the disorder and the friend's partner's perspective, to maybe provide more empathy rather than judgment. Explain that it's more than just eating only chicken tenders. It's very close to a phobia of new food and textures and tastes because they can overwhelm us. Explain that eating at the same places can be very anxiety inducing and that it is extremely painful to live mentally, especially when people say we're being a burden because they can't eat what they want.",
          "created_utc": 1728764187.0
        },
        {
          "id": "lrmcrhf",
          "author": "ChurchOW",
          "body": "Down voting for not contributing to the echo chamber is wild",
          "created_utc": 1728765565.0
        },
        {
          "id": "lrmcxf3",
          "author": "QueenSlothie",
          "body": "He blocked me too lol like damn don't post to a public forum if you don't accept everyone's opinions",
          "created_utc": 1728765621.0
        }
      ]
    },
    {
      "id": "lrrajjw",
      "author": "Tallem00",
      "body": "That she is",
      "created_utc": 1728844277.0,
      "score": 3,
      "context": [
        {
          "id": "lrlvbll",
          "author": "Tallem00",
          "body": "That's some psychic damage I was not expecting today. I literally just told my girlfriend the other day how horrible I feel because I restrict where she can eat. \n\nShe said this though, and it was good reassurance so maybe it'll reassure you all as well: \"I love you more than I care to eat at those places\"",
          "created_utc": 1728759553.0
        },
        {
          "id": "lrlxgkc",
          "author": "SmallHouseDog",
          "body": "I feel this a lot, lately we’ve been finding more non-mall dining hall/food-court options in big cities OR we’ll get to-go from separate places and meet back up to eat together. We still go out and eat together in a traditional sense sometimes, especially for events or nice dinners, but this has helped me feel less guilty many times.",
          "created_utc": 1728760268.0
        },
        {
          "id": "lrlyd7n",
          "author": "Tallem00",
          "body": "She usually drives us to grab each of our meals to-go at different places then go eat together at a park. It's lovely getting to feel like I'm not restricting her *and* I prefer eating in nature to cramped up in a restaurant anyway",
          "created_utc": 1728760572.0
        },
        {
          "id": "lrr7iw5",
          "author": "katekate5300",
          "body": "This is the sweetest",
          "created_utc": 1728843331.0
        }
      ]
    },
    {
      "id": "lrmvu91",
      "author": "QueenSlothie",
      "body": "I understand that not everyone has the energy to provide more insight, but these are conversations that need to happen. Especially if you're getting upset because someone is uneducated. The only way to fix that is to talk to them, not only for their own sake but for anyone else that the person might offend in the future by continuing to be uneducated. \n\nYes, this was tagged as a venting post. But I am allowed to give my own opinion on how to solve that need to vent so it doesn't happen again.",
      "created_utc": 1728772613.0,
      "score": 2,
      "context": [
        {
          "id": "lrm8t0a",
          "author": "QueenSlothie",
          "body": "Honestly, this doesn't seem that tone deaf to me. As someone who genuinely restricts where their partner eats...it's more of a statement and observation, in my opinion. Especially from an outside perspective this is very very common.  Yes, it might have been better to address your concerns first, but he is not wrong in saying he feels bad because their partner doesn't eat at the same places. My fiancé has wanted to take me to KBBQ forever, and I've never gone. I know he loves me, but I'm sure it would be great if I ate that kind of stuff, yknow. I'm not saying we should feel bad since we can't control it, I'm just saying I get the outside perspective. \n\nMaybe instead of getting upset at him for being unknowledgable, take this as an opportunity to inform him more about the disorder and the friend's partner's perspective, to maybe provide more empathy rather than judgment. Explain that it's more than just eating only chicken tenders. It's very close to a phobia of new food and textures and tastes because they can overwhelm us. Explain that eating at the same places can be very anxiety inducing and that it is extremely painful to live mentally, especially when people say we're being a burden because they can't eat what they want.",
          "created_utc": 1728764187.0
        },
        {
          "id": "lrmcrhf",
          "author": "ChurchOW",
          "body": "Down voting for not contributing to the echo chamber is wild",
          "created_utc": 1728765565.0
        },
        {
          "id": "lrmcxf3",
          "author": "QueenSlothie",
          "body": "He blocked me too lol like damn don't post to a public forum if you don't accept everyone's opinions",
          "created_utc": 1728765621.0
        },
        {
          "id": "lrmi4nw",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1728767462.0
        }
      ]
    },
    {
      "id": "lrmzn1m",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1728774070.0,
      "score": 0,
      "context": [
        {
          "id": "lrm8t0a",
          "author": "QueenSlothie",
          "body": "Honestly, this doesn't seem that tone deaf to me. As someone who genuinely restricts where their partner eats...it's more of a statement and observation, in my opinion. Especially from an outside perspective this is very very common.  Yes, it might have been better to address your concerns first, but he is not wrong in saying he feels bad because their partner doesn't eat at the same places. My fiancé has wanted to take me to KBBQ forever, and I've never gone. I know he loves me, but I'm sure it would be great if I ate that kind of stuff, yknow. I'm not saying we should feel bad since we can't control it, I'm just saying I get the outside perspective. \n\nMaybe instead of getting upset at him for being unknowledgable, take this as an opportunity to inform him more about the disorder and the friend's partner's perspective, to maybe provide more empathy rather than judgment. Explain that it's more than just eating only chicken tenders. It's very close to a phobia of new food and textures and tastes because they can overwhelm us. Explain that eating at the same places can be very anxiety inducing and that it is extremely painful to live mentally, especially when people say we're being a burden because they can't eat what they want.",
          "created_utc": 1728764187.0
        },
        {
          "id": "lrmcrhf",
          "author": "ChurchOW",
          "body": "Down voting for not contributing to the echo chamber is wild",
          "created_utc": 1728765565.0
        },
        {
          "id": "lrmcxf3",
          "author": "QueenSlothie",
          "body": "He blocked me too lol like damn don't post to a public forum if you don't accept everyone's opinions",
          "created_utc": 1728765621.0
        },
        {
          "id": "lrmi4nw",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1728767462.0
        },
        {
          "id": "lrmvu91",
          "author": "QueenSlothie",
          "body": "I understand that not everyone has the energy to provide more insight, but these are conversations that need to happen. Especially if you're getting upset because someone is uneducated. The only way to fix that is to talk to them, not only for their own sake but for anyone else that the person might offend in the future by continuing to be uneducated. \n\nYes, this was tagged as a venting post. But I am allowed to give my own opinion on how to solve that need to vent so it doesn't happen again.",
          "created_utc": 1728772613.0
        }
      ]
    },
    {
      "id": "lrn7vdt",
      "author": "QueenSlothie",
      "body": "I wasn't trying to be a smartass. I was trying to simply give insight into the possible intentions of the so-called friend. I was not trying to say \"erm actually.\" I had no malicious intent on my comment. I was simply trying to suggest ways to navigate the situation, which could have been helpful if OP needed it. They could have also chosen to ignore my comment if they didn't want to read it, but if someone else in the group maybe was dealing with a similar situation and didn't want to just write it off as ignorance, then maybe that would be okay too. You're right that maybe OP wouldn't be able to have that conversation right away, but I don't think the answer to supposed ignorance is hatred or anything of the like. We cannot battle ignorance with more ignorance, that just brews negativity. I was simply trying to suggest a positive way to resolve the situation which I understand, not everyone wants a solution which is fine but that's all they had to say.",
      "created_utc": 1728777268.0,
      "score": 2,
      "context": [
        {
          "id": "lrm8t0a",
          "author": "QueenSlothie",
          "body": "Honestly, this doesn't seem that tone deaf to me. As someone who genuinely restricts where their partner eats...it's more of a statement and observation, in my opinion. Especially from an outside perspective this is very very common.  Yes, it might have been better to address your concerns first, but he is not wrong in saying he feels bad because their partner doesn't eat at the same places. My fiancé has wanted to take me to KBBQ forever, and I've never gone. I know he loves me, but I'm sure it would be great if I ate that kind of stuff, yknow. I'm not saying we should feel bad since we can't control it, I'm just saying I get the outside perspective. \n\nMaybe instead of getting upset at him for being unknowledgable, take this as an opportunity to inform him more about the disorder and the friend's partner's perspective, to maybe provide more empathy rather than judgment. Explain that it's more than just eating only chicken tenders. It's very close to a phobia of new food and textures and tastes because they can overwhelm us. Explain that eating at the same places can be very anxiety inducing and that it is extremely painful to live mentally, especially when people say we're being a burden because they can't eat what they want.",
          "created_utc": 1728764187.0
        },
        {
          "id": "lrmcrhf",
          "author": "ChurchOW",
          "body": "Down voting for not contributing to the echo chamber is wild",
          "created_utc": 1728765565.0
        },
        {
          "id": "lrmcxf3",
          "author": "QueenSlothie",
          "body": "He blocked me too lol like damn don't post to a public forum if you don't accept everyone's opinions",
          "created_utc": 1728765621.0
        },
        {
          "id": "lrmi4nw",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1728767462.0
        },
        {
          "id": "lrmvu91",
          "author": "QueenSlothie",
          "body": "I understand that not everyone has the energy to provide more insight, but these are conversations that need to happen. Especially if you're getting upset because someone is uneducated. The only way to fix that is to talk to them, not only for their own sake but for anyone else that the person might offend in the future by continuing to be uneducated. \n\nYes, this was tagged as a venting post. But I am allowed to give my own opinion on how to solve that need to vent so it doesn't happen again.",
          "created_utc": 1728772613.0
        },
        {
          "id": "lrmzn1m",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1728774070.0
        }
      ]
    }
  ]
}