{
  "id": "1g47kpr",
  "subreddit": "ARFID",
  "author": "aha_p",
  "created_utc": 1728998495.0,
  "title": "ARFID at corporate job",
  "selftext": "I’m not diagnosed but textbook arfid sufferer since early childhood. I have about 10 safe foods. I cope fairly well in day to day life but since I started working (commercial law) I have found that eating (or not eating more specifically) in professional contexts is causing issues for me. \n\nUsually the problem is that there’s a selection of food for an event, meeting etc and I can’t/don’t want to eat any of. Usually generic salads and sandwiches. I don’t do sauce as one of my big rules, and generally eat simple, which kind of kills a lot of stereotypical lunch options. It isn’t possible to not eat without being noticed and whether I do or don’t broach the subject, and whether I go into detail or keep it light hearted, ultimately I feel self conscious, awkward and embarrassed.\n\nI fear that this condition will genuinely impact my career if it hasn’t already, I find myself skipping work lunches and events that involve food, accordingly missing out on networking and other professional development opportunities. I don’t even like to attend the office because I end up eating my lunch alone as I don’t want any judgements or comments on what I eat. I wish it was as simple as saying I have an intolerance to this or that - most people straight up don’t understand or don’t care to understand what it’s like. Ughhhh. Any advice please! ",
  "url": "https://www.reddit.com/r/ARFID/comments/1g47kpr/arfid_at_corporate_job/",
  "score": 88,
  "num_comments": 34,
  "comments": [
    {
      "id": "ls1aux0",
      "author": "RhenHarper",
      "body": "\"Sorry, I'm a diet for medical reasons. I don't want to bore you with the details. Please continue to eat!\" and then gently move the conversation back to work or another subject.",
      "created_utc": 1728999087.0,
      "score": 150,
      "context": []
    },
    {
      "id": "ls1c1sl",
      "author": "shitz_brickz",
      "body": "In corporate world especially, people are generally more educated and are focused on their life as a whole (their family, kids, their retirement). \n\nSaying absolutely anything mildly reasonable - from being on a diet due to genetics or your spouse's request, to training for a marathon will get you out of it. Do not skip the meetings just because there is food. Go grab a soda or bag of chips or something to snack on, or \"to take back to your desk to eat at a specific time.\" \n\nEventually people might come to know you as the guy who doesn't eat lunch at lunch time, but I promise there are other people in the office who are body builders or runners who eat a similarly 'bizarre' food choice every day, and there is always the person microwaving fish. People think about those people 100x more than they think about the guy who didn't eat the catered tuna salad sandwich.",
      "created_utc": 1728999537.0,
      "score": 50,
      "context": []
    },
    {
      "id": "ls1ttiv",
      "author": "Hanhula",
      "body": "Hey, I work in a corporate environment and used to travel frequently for work. This frequently involved nights out with clients at restaurants and the like.\n\nRaise this with your HR. You have a medical condition that impacts the food you can eat; provide HR with a small list of safe foods and advise them that you'll be happy to work around this where possible if your restrictions are too severe. \n\nFor your coworkers - I promise you, all you need to do is say it's because of a medical condition. If they pry, say you'd rather not go into it. If they get arsey about it, go to HR - this is also why we tell HR about these things.\n\nWith my ARFID, I can get away with having chips, pizza, and chicken in most forms. This allows me a lot of leeway over nights out. That being said, I have ended up at restaurants where I haven't been able to eat what's offered, and conferences where my needs weren't communicated. Often the wait staff will be able to accommodate you with small requests so that you can still participate in the night (e.g. bread rolls, drinks, the like), and in a corporate environment, you can get away with \"oh, it's this medical thing, it's no problem - I wish I could enjoy it like you do!\" and then direct the conversation away from your food. \n\nYou can do this. The people in your office will get used to you. They have to get used to Kathy having the most god awful eggy fishy salad every day and John eating with his mouth open; they can easily tolerate you having the same possibly odd lunch every day.",
      "created_utc": 1729005590.0,
      "score": 15,
      "context": []
    },
    {
      "id": "ls1bf2u",
      "author": "Raderg32",
      "body": "\"I have a very limited diet due to healt issues that I'd rather not talk about.\"",
      "created_utc": 1728999298.0,
      "score": 34,
      "context": []
    },
    {
      "id": "ls1mfuf",
      "author": "HotBackgroundGirl",
      "body": "I hide in my car. I have celiac disease along with arfrid so I usually just tell people that. Feel free to use my diagnosis as an excuse!",
      "created_utc": 1729003178.0,
      "score": 9,
      "context": []
    },
    {
      "id": "ls1nqr0",
      "author": "boytoy421",
      "body": "\"I have a minor medical condition that unfortunately leaves me with a pretty restricted diet. It would be unreasonable for me to ask you to accommodate it and of course you'll understand that I don't particularly want to go into detail but don't worry about me I'm fine\" and just say it nonchalantly and like it's nbd and people won't really care",
      "created_utc": 1729003609.0,
      "score": 6,
      "context": []
    },
    {
      "id": "ls1clqv",
      "author": "SunMoonEtAl",
      "body": "corpo slaves with arfid rise up cause this is exactly my problem as well lol",
      "created_utc": 1728999744.0,
      "score": 13,
      "context": []
    },
    {
      "id": "ls1gbjr",
      "author": "phoebemocha",
      "body": "just say u have a medical disorder preventing u from eating normally if anyone ever asks. i fucked up by telling friends i have arfid and now they all just think im picky. shouldve just said i couldnt process foods normally, maybe theyd take it more seriously",
      "created_utc": 1729001097.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ls1hamz",
      "author": "Weary-Toast",
      "body": "Been in the corporate world for about 20 years now, all different companies. I bring my own food everyday and at first you might get some questions and I usually just say allergies (which I do have on top of ARFID) but after a while people just get used to it and stop asking.",
      "created_utc": 1729001442.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ls1vy6e",
      "author": "Minute-Lemon-3650",
      "body": "Do you think getting a solid diagnosis from a professional would help you? There’s a lot of great points made on this post already, you don’t need to get into details with just anyone you work with/ random coworkers, but a diagnosis could help with HR getting you necessary accommodations. At the end of the day, it is a medical condition that requires special needs, and your work place should not be making it more difficult for you to get your needs met.",
      "created_utc": 1729006276.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ls1e0gs",
      "author": "Bankerlady10",
      "body": "In the same boat, 20 years in. I’ve learned to say that I have dietary restrictions. It causes some questions and then I can usually say something like “tons of allergies or clean eating” and it dies off quickly. I’ve been more embarrassed for the wait staff when they make no money off me vs my guests. Now I’m struggling with trying to reduce sugar intake with drinks. Restaurants don’t have any sugar free options outside of Diet Coke-yuck. \n\nDon’t skip the events!",
      "created_utc": 1729000263.0,
      "score": 7,
      "context": []
    },
    {
      "id": "ls287dz",
      "author": "straightedge316",
      "body": "I started straight up telling people that I have an eating disorder if anyone asks about why I’m not eating. People usually don’t ask more questions after that, but if they do I’m very open about having ARFID and what it means and everyone is usually very understanding. It was nerve wracking at first but now everyone just knows that I bring my safe meal for lunch every day and they don’t question it or make comments.",
      "created_utc": 1729010218.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ls2r8yd",
      "author": "Dramatic-Growth1335",
      "body": "Well done for not letting it affect your education to get a decent job! \nI partly blame my Arfid for not going on to further education.\nThe last 14 years I've been really trying to eat more foods and it's like a snowball effect the more you force yourself into uncomfortable situations/ food. \nI'm 38 now and unrecognisable from when I started.\nPeople would still say I'm a bit of a picky eater but at least I eat more than sweets, bread, cheese, chocolate and fruit.\nI ate lasagne today.\nThat's fucking wild.\nDid I like it? Not really, but I gave it a go and I didn't throw up or wretch.\nI have a kid now so need to set a good example.",
      "created_utc": 1729016197.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ls2x2rl",
      "author": "Amazing-Cellist3672",
      "body": "I talked my office coordinator into ordering peanut butter and banana sandwiches along with the usual assortment. Obviously we don't have any severe peanut allergies among us. The funny thing is that the pbb sandwiches are always the first to get snapped up at meetings",
      "created_utc": 1729018014.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ls3crad",
      "author": "Objective-Wait-9709",
      "body": "I used to eat beforehand and tell them that I was not hungry because I had a large snack or lunch, or my partner was making a big fancy dinner and I was saving space. Otherwise, a few dialogue options are:   \n\"I eat a simple diet and can't have certain foods, but I brought my own food and I'm happy to attend with everyone.\"   \n\"It's complicated but my medication interacts with some foods, and I have no way to know if these foods contain those so I ate ahead of time and I'm full anyway.\"  \n\"I'm just not super hungry currently but I have a (delicious meal you like) waiting at home when I get there. Don't mind me.\"\n\nI will say that my coworkers never said anything outright about my eating habits, but the more I avoided, the weirder it felt. Just bring your lunch and say you prefer what you packed. You're prepared, professional, and fed: which is enough. It would not be wrong to talk to someone you trust and say that you don't eat offered food, you bring your own. Most people aren't going to expect you to waste what you brought to accommodate their emotions. If they do, ignore them. \n\nI've even seen kids pack lunches for parents so your coworkers probably have weird lunches of their own.",
      "created_utc": 1729022931.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ls1hblz",
      "author": "OG1999x",
      "body": "A medical disorder with dietary restrictions.",
      "created_utc": 1729001451.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ls2f2bk",
      "author": "thatsnuckinfutz",
      "body": "i have ARFID and have been in the corporate \"world\" for over a decade...at most i get that \"ur so disciplined/healthy\". I don't get into it and participate when i can or bring my own food. I typically don't enjoy fast food in general anyway so it's easy for me to just say \"it's too heavy for my stomach\". We're honestly so busy in our office nobody has the time.",
      "created_utc": 1729012379.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ls3gw2e",
      "author": "makinggrace",
      "body": "If you have only 10 foods and are not actively in treatment, I think it would be well worth your time to explore that. I say that not because of the social situations that your job will entail, but because of your overall health.\n\nThis doesn’t solve any immediate issues but expanding your foods even a little could help a lot. (And since you have a corporate job you probably have good health insurance—yay!!!)\n\nThere are many ways to accommodate ARFID and I have had to use all of them to at some point or another. If lunches etc are ordered by an admin your best bet is to find out who that is and talk to him or her about your medical condition. You need not mention what it is—and in a corporate setting I would absolutely not give any more info than is absolutely necessary. Usually it’s easier to ask to see the catering menu that they order from than to suggest things. And if it’s on-site, it’s fine to bring your own meal. Off-site is more problematic—but easier to control the food. You can literally call them and say you are with xyz party coming for the mtg on such and such a date. You have medical restrictions on your diet and require (whatever you want within reason) or ask what they are serving and modify it.",
      "created_utc": 1729024226.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ls42zq2",
      "author": "DifferentIsPossble",
      "body": "What I usually do is I clarify that I have a restrictive diet for health reasons, and I pack food from home/eat at home/etc.\n\nIn my favorite former workplace, they actually got to know me and would always ask if there's something I can eat at x place. But otherwise, I'd just have tea and thank them for asking",
      "created_utc": 1729031709.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ls5i7wy",
      "author": "Naejakire",
      "body": "Ha! I was literally just choosing a meal option for a work conference where it's all weird shit I would never eat, lol. I'm so used to it at this point.\n\nThey ask questions because they genuinely don't know. Most people don't know about ARFID and most will just consider you picky and be curious. You need to own it. That is the ONLY option that won't leave you feeling self conscious while other people scratch their heads and wonder what is up with you.\n\nI'm lucky that in my career, I am in a close knit mgmt team. We have all been here for years and they know \"ask her because she's the one who eats pretty much nothing\" when figuring out what to eat for a lunch meeting. I don't like being the one to always pick so sometimes I'll just eat before, and that's OK. They know about my ARFID and don't care. They're just hungry, they're not worried about me and what I'm doing.\n\nFor bigger meetings/conferences with people I don't know? I will always hate the options. This one I'm going to has a \"I'll bring my own lunch\" option, and I remember there being food places nearby. I could just buy my own food and eat with everyone else, or I will just eat before and confidently tell everyone \"I'm good\" if they ask if I'm going to eat or if I'm hungry. I've also noticed that people judge way more if they think you're just \"picky\".. if you actually tell them you have a disorder you can't control, they will be far more understanding. You can just say \"sensory processing disorder\" if you dont want to get too into it. If you REALLY don't want to say anything about it, just say you're on a macro diet or something weird lol. My coworker is doing some points diet and she never eats with us and no one questions it, because diets/weight loss efforts are seen as admirable. The \"picky eater\" can just sound immature.. So that's why I tell people it's a real disorder and I say it lighthearted like \"yeah I got some issues lol, I've always been like this\" or try to explain it like \"someone telling me to eat this egg would be like if I handed you a stapler and told you to eat it. It doesn't compute. My brain doesn't consider it edible\". Sometimes I tell them all the things I've never eaten and they're amazed, and sometimes I share stories like \"I literally only ate canteloupe the first 4 years of my life\". 😂When you're in on the joke and can make fun of yourself, you take the power away from others to find you \"weird\" or talk about you. Own it! People can sense when someone is self conscious or ashamed and that's when they focus on it more. When you're not, they don't even think about it.\n\nI used to be soo weird about it and it would cause me so much stress. Stressing wont suddenly make me normal, though. It solves nothing. This is just the way I am and have always been. Think about this.. We have spent our whole lives being around people who eat things we consider gross (unsafe).. Are you judging or making fun of people for eating those things? Probably not.",
      "created_utc": 1729052028.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ls1wp3t",
      "author": "None",
      "body": "Kate Farms meal replacement shakes!",
      "created_utc": 1729006518.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lsaqumb",
      "author": "qning",
      "body": "When I can do it I use a decoy plate. \n\nSo if everyone is in a conference room and the food is out in the hall, I’ll smear some food on a plate and carry it around while chomping on a carrot or a cracker. \n\nIt’s also nice to have a friend who knows the deal, because they can cover for you, give you their plate, etc. \n\nBut also - I don’t know about your career, but in my professional circles people let other peoples’ health conditions be their thing and it’s off limits for gossip and chatting. There are legit health conditions that limit peoples’ food options. AND ARFID IS ONE OF THEM!\n\nI encourage you to do your job and focus on doing it the best you can. The people who value your contribution will promote you for how you work and not how you eat. And I believe you’ll find that they even protect you. \n\nRemindMe! Ten years",
      "created_utc": 1729129221.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ls3ptwl",
      "author": "lovetoogoodtoleave",
      "body": "exactly! my go to is “i have complex dietary restrictions”",
      "created_utc": 1729027093.0,
      "score": 24,
      "context": [
        {
          "id": "ls1aux0",
          "author": "RhenHarper",
          "body": "\"Sorry, I'm a diet for medical reasons. I don't want to bore you with the details. Please continue to eat!\" and then gently move the conversation back to work or another subject.",
          "created_utc": 1728999087.0
        }
      ]
    },
    {
      "id": "ls1nz6m",
      "author": "Current-Click-2631",
      "body": "So good",
      "created_utc": 1729003686.0,
      "score": 14,
      "context": [
        {
          "id": "ls1aux0",
          "author": "RhenHarper",
          "body": "\"Sorry, I'm a diet for medical reasons. I don't want to bore you with the details. Please continue to eat!\" and then gently move the conversation back to work or another subject.",
          "created_utc": 1728999087.0
        }
      ]
    },
    {
      "id": "ls3ex94",
      "author": "canadave_nyc",
      "body": "This works, and works particularly well at an event where you probably won't see most of the people again; but the problem is that a lot of these types of events involve co-workers. The nature of human curiosity and human concern for a fellow person being what it is, at some point people who work with you will ask about the details if you keep using that line. It's at that point that it becomes uncomfortable.",
      "created_utc": 1729023610.0,
      "score": 11,
      "context": [
        {
          "id": "ls1aux0",
          "author": "RhenHarper",
          "body": "\"Sorry, I'm a diet for medical reasons. I don't want to bore you with the details. Please continue to eat!\" and then gently move the conversation back to work or another subject.",
          "created_utc": 1728999087.0
        }
      ]
    },
    {
      "id": "ls1ha9m",
      "author": "justasapling",
      "body": ">Eventually people might come to know you as the guy who doesn't eat lunch at lunch time, but I promise there are other people in the office who are body builders or runners who eat a similarly 'bizarre' food choice every day, and there is always the person microwaving fish. People think about those people 100x more than they think about the guy who didn't eat the catered tuna salad sandwich.\n\nThis is so important to state plainly, and I think it's information this sub really needs to hear repeatedly.\n\nI *also* wonder how much this advice varies in efficacy depending on where it's applied.\n\nThat is to say, I live in a place where 'dietary restrictions' are extremely normalized, so not participating in catered meals or whatever wouldn't be an issue at all. **You might eventually get asked about what you can and can't eat so that you can be accommodated**, but nobody would judge or expend thought on it beyond that. But I can also imagine other regional cultures that treat shared food and shared meals really differently, and I can imagine this advice not working as well there.",
      "created_utc": 1729001438.0,
      "score": 28,
      "context": [
        {
          "id": "ls1c1sl",
          "author": "shitz_brickz",
          "body": "In corporate world especially, people are generally more educated and are focused on their life as a whole (their family, kids, their retirement). \n\nSaying absolutely anything mildly reasonable - from being on a diet due to genetics or your spouse's request, to training for a marathon will get you out of it. Do not skip the meetings just because there is food. Go grab a soda or bag of chips or something to snack on, or \"to take back to your desk to eat at a specific time.\" \n\nEventually people might come to know you as the guy who doesn't eat lunch at lunch time, but I promise there are other people in the office who are body builders or runners who eat a similarly 'bizarre' food choice every day, and there is always the person microwaving fish. People think about those people 100x more than they think about the guy who didn't eat the catered tuna salad sandwich.",
          "created_utc": 1728999537.0
        }
      ]
    },
    {
      "id": "ls2g6n1",
      "author": "thatsnuckinfutz",
      "body": "100% this. im known as either the one who doesnt eat, barely eats or eats very healthy. depending on the day all are accurate lol but nobody makes a *big* deal over it. When our Chief visits I purposely will snack on whatever he brings to be a participant but even he will ask if anyone has dietary needs to try and accommodate.  \n\nmy colleagues who know me well will just joke with me about my portions (they're very small) and comment how they wish they could eat as little as i do. Never anything rude, inappropriate or even uncomfortable.",
      "created_utc": 1729012731.0,
      "score": 2,
      "context": [
        {
          "id": "ls1c1sl",
          "author": "shitz_brickz",
          "body": "In corporate world especially, people are generally more educated and are focused on their life as a whole (their family, kids, their retirement). \n\nSaying absolutely anything mildly reasonable - from being on a diet due to genetics or your spouse's request, to training for a marathon will get you out of it. Do not skip the meetings just because there is food. Go grab a soda or bag of chips or something to snack on, or \"to take back to your desk to eat at a specific time.\" \n\nEventually people might come to know you as the guy who doesn't eat lunch at lunch time, but I promise there are other people in the office who are body builders or runners who eat a similarly 'bizarre' food choice every day, and there is always the person microwaving fish. People think about those people 100x more than they think about the guy who didn't eat the catered tuna salad sandwich.",
          "created_utc": 1728999537.0
        }
      ]
    },
    {
      "id": "ls3xb0r",
      "author": "GaydrianTheRainbow",
      "body": "Unfortunately this only works if all your safe foods you might eat around them are all gluten free, or that could get awkward.",
      "created_utc": 1729029648.0,
      "score": 1,
      "context": [
        {
          "id": "ls1mfuf",
          "author": "HotBackgroundGirl",
          "body": "I hide in my car. I have celiac disease along with arfrid so I usually just tell people that. Feel free to use my diagnosis as an excuse!",
          "created_utc": 1729003178.0
        }
      ]
    },
    {
      "id": "ls5jbl5",
      "author": "Naejakire",
      "body": "Or you could just say you have allergies.. Everyone understands that",
      "created_utc": 1729052584.0,
      "score": 1,
      "context": [
        {
          "id": "ls5i7wy",
          "author": "Naejakire",
          "body": "Ha! I was literally just choosing a meal option for a work conference where it's all weird shit I would never eat, lol. I'm so used to it at this point.\n\nThey ask questions because they genuinely don't know. Most people don't know about ARFID and most will just consider you picky and be curious. You need to own it. That is the ONLY option that won't leave you feeling self conscious while other people scratch their heads and wonder what is up with you.\n\nI'm lucky that in my career, I am in a close knit mgmt team. We have all been here for years and they know \"ask her because she's the one who eats pretty much nothing\" when figuring out what to eat for a lunch meeting. I don't like being the one to always pick so sometimes I'll just eat before, and that's OK. They know about my ARFID and don't care. They're just hungry, they're not worried about me and what I'm doing.\n\nFor bigger meetings/conferences with people I don't know? I will always hate the options. This one I'm going to has a \"I'll bring my own lunch\" option, and I remember there being food places nearby. I could just buy my own food and eat with everyone else, or I will just eat before and confidently tell everyone \"I'm good\" if they ask if I'm going to eat or if I'm hungry. I've also noticed that people judge way more if they think you're just \"picky\".. if you actually tell them you have a disorder you can't control, they will be far more understanding. You can just say \"sensory processing disorder\" if you dont want to get too into it. If you REALLY don't want to say anything about it, just say you're on a macro diet or something weird lol. My coworker is doing some points diet and she never eats with us and no one questions it, because diets/weight loss efforts are seen as admirable. The \"picky eater\" can just sound immature.. So that's why I tell people it's a real disorder and I say it lighthearted like \"yeah I got some issues lol, I've always been like this\" or try to explain it like \"someone telling me to eat this egg would be like if I handed you a stapler and told you to eat it. It doesn't compute. My brain doesn't consider it edible\". Sometimes I tell them all the things I've never eaten and they're amazed, and sometimes I share stories like \"I literally only ate canteloupe the first 4 years of my life\". 😂When you're in on the joke and can make fun of yourself, you take the power away from others to find you \"weird\" or talk about you. Own it! People can sense when someone is self conscious or ashamed and that's when they focus on it more. When you're not, they don't even think about it.\n\nI used to be soo weird about it and it would cause me so much stress. Stressing wont suddenly make me normal, though. It solves nothing. This is just the way I am and have always been. Think about this.. We have spent our whole lives being around people who eat things we consider gross (unsafe).. Are you judging or making fun of people for eating those things? Probably not.",
          "created_utc": 1729052028.0
        }
      ]
    },
    {
      "id": "lsar092",
      "author": "RemindMeBot",
      "body": "I will be messaging you in 10 years on [**2034-10-17 01:40:21 UTC**](http://www.wolframalpha.com/input/?i=2034-10-17%2001:40:21%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/ARFID/comments/1g47kpr/arfid_at_corporate_job/lsaqumb/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2FARFID%2Fcomments%2F1g47kpr%2Farfid_at_corporate_job%2Flsaqumb%2F%5D%0A%0ARemindMe%21%202034-10-17%2001%3A40%3A21%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201g47kpr)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
      "created_utc": 1729129282.0,
      "score": 1,
      "context": [
        {
          "id": "lsaqumb",
          "author": "qning",
          "body": "When I can do it I use a decoy plate. \n\nSo if everyone is in a conference room and the food is out in the hall, I’ll smear some food on a plate and carry it around while chomping on a carrot or a cracker. \n\nIt’s also nice to have a friend who knows the deal, because they can cover for you, give you their plate, etc. \n\nBut also - I don’t know about your career, but in my professional circles people let other peoples’ health conditions be their thing and it’s off limits for gossip and chatting. There are legit health conditions that limit peoples’ food options. AND ARFID IS ONE OF THEM!\n\nI encourage you to do your job and focus on doing it the best you can. The people who value your contribution will promote you for how you work and not how you eat. And I believe you’ll find that they even protect you. \n\nRemindMe! Ten years",
          "created_utc": 1729129221.0
        }
      ]
    },
    {
      "id": "ls53mgi",
      "author": "galwall",
      "body": "Be honest but short,\n\nYou have a very strict eating regiment and that's not included\n\nWhen someone invariably says come one, just repeat...I wish I could eat that, have a bite for me\n\n90% of people are just like you, having their own issues to deal with hoping the others won't realise what's up.\n\nIf someone is too pushy try, actually I'm an exceptionally picky eater and that's not for me, but thanks anyway\n\nHope this helps",
      "created_utc": 1729045546.0,
      "score": 6,
      "context": [
        {
          "id": "ls1aux0",
          "author": "RhenHarper",
          "body": "\"Sorry, I'm a diet for medical reasons. I don't want to bore you with the details. Please continue to eat!\" and then gently move the conversation back to work or another subject.",
          "created_utc": 1728999087.0
        },
        {
          "id": "ls3ptwl",
          "author": "lovetoogoodtoleave",
          "body": "exactly! my go to is “i have complex dietary restrictions”",
          "created_utc": 1729027093.0
        }
      ]
    },
    {
      "id": "ls5n8zp",
      "author": "R0da",
      "body": "All hail \"food sensitivities\"!",
      "created_utc": 1729054669.0,
      "score": 1,
      "context": [
        {
          "id": "ls1aux0",
          "author": "RhenHarper",
          "body": "\"Sorry, I'm a diet for medical reasons. I don't want to bore you with the details. Please continue to eat!\" and then gently move the conversation back to work or another subject.",
          "created_utc": 1728999087.0
        },
        {
          "id": "ls3ptwl",
          "author": "lovetoogoodtoleave",
          "body": "exactly! my go to is “i have complex dietary restrictions”",
          "created_utc": 1729027093.0
        }
      ]
    },
    {
      "id": "ls1jwp3",
      "author": "shitz_brickz",
      "body": "Ya I am fortunate to work in Boston for a big publicly traded company. Liberal area, HR is in the building, and there is a marathon scheduled in 6 months. Everyone is doing something weird to try and be super healthy including the guy who eats a plate of bacon for lunch. \n\nHigh school and college I know were a totally different world. It's much harder to say \"I'll eat lunch later\" when everyone knows you have math class later. I have had to end at least one relationship in part because her family was from a culture of 'everyone eats everything together every Sunday, and btw your house is in the middle so you will host each week.\"",
      "created_utc": 1729002334.0,
      "score": 7,
      "context": [
        {
          "id": "ls1c1sl",
          "author": "shitz_brickz",
          "body": "In corporate world especially, people are generally more educated and are focused on their life as a whole (their family, kids, their retirement). \n\nSaying absolutely anything mildly reasonable - from being on a diet due to genetics or your spouse's request, to training for a marathon will get you out of it. Do not skip the meetings just because there is food. Go grab a soda or bag of chips or something to snack on, or \"to take back to your desk to eat at a specific time.\" \n\nEventually people might come to know you as the guy who doesn't eat lunch at lunch time, but I promise there are other people in the office who are body builders or runners who eat a similarly 'bizarre' food choice every day, and there is always the person microwaving fish. People think about those people 100x more than they think about the guy who didn't eat the catered tuna salad sandwich.",
          "created_utc": 1728999537.0
        },
        {
          "id": "ls1ha9m",
          "author": "justasapling",
          "body": ">Eventually people might come to know you as the guy who doesn't eat lunch at lunch time, but I promise there are other people in the office who are body builders or runners who eat a similarly 'bizarre' food choice every day, and there is always the person microwaving fish. People think about those people 100x more than they think about the guy who didn't eat the catered tuna salad sandwich.\n\nThis is so important to state plainly, and I think it's information this sub really needs to hear repeatedly.\n\nI *also* wonder how much this advice varies in efficacy depending on where it's applied.\n\nThat is to say, I live in a place where 'dietary restrictions' are extremely normalized, so not participating in catered meals or whatever wouldn't be an issue at all. **You might eventually get asked about what you can and can't eat so that you can be accommodated**, but nobody would judge or expend thought on it beyond that. But I can also imagine other regional cultures that treat shared food and shared meals really differently, and I can imagine this advice not working as well there.",
          "created_utc": 1729001438.0
        }
      ]
    },
    {
      "id": "ls1kw25",
      "author": "justasapling",
      "body": ">Everyone is doing something weird to try and be super healthy including the guy who eats a plate of bacon for lunch. \n\nHa! That's my parents. Honestly, seems to suit them.",
      "created_utc": 1729002662.0,
      "score": 3,
      "context": [
        {
          "id": "ls1c1sl",
          "author": "shitz_brickz",
          "body": "In corporate world especially, people are generally more educated and are focused on their life as a whole (their family, kids, their retirement). \n\nSaying absolutely anything mildly reasonable - from being on a diet due to genetics or your spouse's request, to training for a marathon will get you out of it. Do not skip the meetings just because there is food. Go grab a soda or bag of chips or something to snack on, or \"to take back to your desk to eat at a specific time.\" \n\nEventually people might come to know you as the guy who doesn't eat lunch at lunch time, but I promise there are other people in the office who are body builders or runners who eat a similarly 'bizarre' food choice every day, and there is always the person microwaving fish. People think about those people 100x more than they think about the guy who didn't eat the catered tuna salad sandwich.",
          "created_utc": 1728999537.0
        },
        {
          "id": "ls1ha9m",
          "author": "justasapling",
          "body": ">Eventually people might come to know you as the guy who doesn't eat lunch at lunch time, but I promise there are other people in the office who are body builders or runners who eat a similarly 'bizarre' food choice every day, and there is always the person microwaving fish. People think about those people 100x more than they think about the guy who didn't eat the catered tuna salad sandwich.\n\nThis is so important to state plainly, and I think it's information this sub really needs to hear repeatedly.\n\nI *also* wonder how much this advice varies in efficacy depending on where it's applied.\n\nThat is to say, I live in a place where 'dietary restrictions' are extremely normalized, so not participating in catered meals or whatever wouldn't be an issue at all. **You might eventually get asked about what you can and can't eat so that you can be accommodated**, but nobody would judge or expend thought on it beyond that. But I can also imagine other regional cultures that treat shared food and shared meals really differently, and I can imagine this advice not working as well there.",
          "created_utc": 1729001438.0
        },
        {
          "id": "ls1jwp3",
          "author": "shitz_brickz",
          "body": "Ya I am fortunate to work in Boston for a big publicly traded company. Liberal area, HR is in the building, and there is a marathon scheduled in 6 months. Everyone is doing something weird to try and be super healthy including the guy who eats a plate of bacon for lunch. \n\nHigh school and college I know were a totally different world. It's much harder to say \"I'll eat lunch later\" when everyone knows you have math class later. I have had to end at least one relationship in part because her family was from a culture of 'everyone eats everything together every Sunday, and btw your house is in the middle so you will host each week.\"",
          "created_utc": 1729002334.0
        }
      ]
    }
  ]
}