{
  "id": "1g4aix7",
  "subreddit": "ARFID",
  "author": "Ill-Option-677",
  "created_utc": 1729006383.0,
  "title": "Abbot elementary and ARFID",
  "selftext": "The Philly based comedy series Abott Elementary features a character named Gregory. Gregory is a very picky eater and is often made fun of for his food choices. In the latest episode Gregory is talking to his now girlfriend Janine about dinner, she recommended a restaurant and he responds with “as long as they have buttered noodles.” She says “I would never take you anywhere without buttered noodles.” This really was the moment that really convinced me to make this post. There’s an episode based on his “weird” food preferences and fears of foods. I really wish they addressed this as arfid or hope that they have an arfid episode in the future. Maybe a kid is diagnosed with it and the school is made aware of this and Ava is being ignorant while the teachers try to accommodate the child. After everyone failing to help this kid, Janine starts doing more research to help this student and realizes that Gregory also has arfid and might be able to help the kid. Then start to close it out with something sweet like them eating together in his classroom so it’s not as stressful as being in the cafeteria and because it’s always easier to eat when ur not alone. And then mr. Johnson or Ava can walk by and say something out of pocket but funny to end it off. It would be a great way to educate people on how to go about helping someone who struggles with arfid. No one knows about it and I feel like so many people have arfid tendencies and the awareness could really help people. Idk that’s my opinion what do you think? ",
  "url": "https://www.reddit.com/r/ARFID/comments/1g4aix7/abbot_elementary_and_arfid/",
  "score": 100,
  "num_comments": 12,
  "comments": [
    {
      "id": "ls2de5s",
      "author": "velociraptor56",
      "body": "Same. There’s also an episode where he tries to hide that he doesn’t like pizza because he knows people think that’s weird. He was definitely portrayed as neurodivergent at the beginning, but he’s sort of less so now. \n\nHe reminds me of Phoebe’s character in Friends. She’s a veg but only when it’s really convenient for the storyline.",
      "created_utc": 1729011853.0,
      "score": 43,
      "context": []
    },
    {
      "id": "ls3hemv",
      "author": "MidnightFox452",
      "body": "https://preview.redd.it/atbv24u7dzud1.jpeg?width=1355&format=pjpg&auto=webp&s=122e041ad15b078085e5d0a186ddfff3a3e71540",
      "created_utc": 1729024388.0,
      "score": 32,
      "context": []
    },
    {
      "id": "ls2504d",
      "author": "maxpowersr",
      "body": "Just watched this with the kids, and it was nice for them to see another functional adult other than myself who just… had it, and lived with it. I really like that they wrote this into his character. What a small percentage of the population we are, but then given a voice there. Pretty cool.",
      "created_utc": 1729009196.0,
      "score": 16,
      "context": []
    },
    {
      "id": "ls292nc",
      "author": "himydandelion",
      "body": "Abbott is one of my favorite shows rn!!! Noticed Gregory was ARFID coded and was just so excited about the representation even if it wasn’t named. My coworkers who watch the show were even happy about seeing me represented like that!",
      "created_utc": 1729010494.0,
      "score": 13,
      "context": []
    },
    {
      "id": "ls4hn9f",
      "author": "Cephalophore",
      "body": "Fruit should not be hot.",
      "created_utc": 1729037208.0,
      "score": 8,
      "context": []
    },
    {
      "id": "ls5jt9q",
      "author": "isa_1357",
      "body": "I turned to my partner as we watched the episode tonight and said the EXACT same thing! I was so excited that they said something about buttered noodles because I love that they keep showing representation for ARFID even if they aren't stating it outrightly.",
      "created_utc": 1729052841.0,
      "score": 8,
      "context": []
    },
    {
      "id": "ls4nyka",
      "author": "giraffemoo",
      "body": "Thanks, I need it.\n\nI loved the episode with the \"wet pizza\".",
      "created_utc": 1729039544.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ls8bsgw",
      "author": "Pale-Dragonfruit-765",
      "body": "~~is this how i get spoiled abt gregory and janine's relationship?!~~\n\nyesss i think it would be awesome if this show had an arfid episode or something akin to it. especially considering how light hearted and feel good the show can be.",
      "created_utc": 1729099436.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lx0q9i4",
      "author": "not-a-popup-ad",
      "body": "I've always loved his character so much. He's extremely relatable to me as a man who works in education and as a person with ARFID.",
      "created_utc": 1731549235.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ls2rs1r",
      "author": "pasghetti_n_meatbals",
      "body": "I just ran to YouTube to watch! Thanks for mentioning! My kiddo is also \"no pizza\". Last year he said, \"I told my friends my pizza secret.\" His best friend from that class has EOE, so they felt solidarity with each other when it comes to food! School has a pizza night fundraiser every month and sends home a flyer. The first time he came home with one, he got off the bus crying that he didn't want to eat pizza. He didn't understand that it a was voluntary event (age 6). Last year with his buddy, he didn't feel alone when that flyer got passed out! Good for Abbot Elementary!! I'll have to start watching. ",
      "created_utc": 1729016363.0,
      "score": 7,
      "context": [
        {
          "id": "ls2de5s",
          "author": "velociraptor56",
          "body": "Same. There’s also an episode where he tries to hide that he doesn’t like pizza because he knows people think that’s weird. He was definitely portrayed as neurodivergent at the beginning, but he’s sort of less so now. \n\nHe reminds me of Phoebe’s character in Friends. She’s a veg but only when it’s really convenient for the storyline.",
          "created_utc": 1729011853.0
        }
      ]
    },
    {
      "id": "lspoq2c",
      "author": "Ill-Option-677",
      "body": "IM SO SORRY I should have put a spoiler disclaimer",
      "created_utc": 1729358549.0,
      "score": 2,
      "context": [
        {
          "id": "ls8bsgw",
          "author": "Pale-Dragonfruit-765",
          "body": "~~is this how i get spoiled abt gregory and janine's relationship?!~~\n\nyesss i think it would be awesome if this show had an arfid episode or something akin to it. especially considering how light hearted and feel good the show can be.",
          "created_utc": 1729099436.0
        }
      ]
    },
    {
      "id": "ls34f1c",
      "author": "velociraptor56",
      "body": "I’m hoping at some point they will say that Gregory has ARFID - they may not have intended that or known it existed when they wrote those storylines, but I think it would be awesome.\n\nMy ARFID kid is 15 and your story sounds really familiar (though my kid’s safe food is pizza). He did disclose his ARFID to his friends in the past year and so far they have all been super supportive. He does have a lot of “weird” friends - most of them have their own “issues” and don’t judge (I mean this in the best way, I’m a weird person and don’t fit in either). I know we’re not past it - as I read some of the 20 somethings on here with their dating struggles. The thing I always tell him is that if someone is your friend and loves you, they will not care what you eat.",
      "created_utc": 1729020322.0,
      "score": 4,
      "context": [
        {
          "id": "ls2de5s",
          "author": "velociraptor56",
          "body": "Same. There’s also an episode where he tries to hide that he doesn’t like pizza because he knows people think that’s weird. He was definitely portrayed as neurodivergent at the beginning, but he’s sort of less so now. \n\nHe reminds me of Phoebe’s character in Friends. She’s a veg but only when it’s really convenient for the storyline.",
          "created_utc": 1729011853.0
        },
        {
          "id": "ls2rs1r",
          "author": "pasghetti_n_meatbals",
          "body": "I just ran to YouTube to watch! Thanks for mentioning! My kiddo is also \"no pizza\". Last year he said, \"I told my friends my pizza secret.\" His best friend from that class has EOE, so they felt solidarity with each other when it comes to food! School has a pizza night fundraiser every month and sends home a flyer. The first time he came home with one, he got off the bus crying that he didn't want to eat pizza. He didn't understand that it a was voluntary event (age 6). Last year with his buddy, he didn't feel alone when that flyer got passed out! Good for Abbot Elementary!! I'll have to start watching. ",
          "created_utc": 1729016363.0
        }
      ]
    }
  ]
}