{
  "id": "1g55yxn",
  "subreddit": "ARFID",
  "author": "smores_or_pizzasnack",
  "created_utc": 1729102163.0,
  "title": "Posted about picky eater hatred on r/petpeeves. Some of the comments were certainly…something",
  "selftext": "",
  "url": "https://www.reddit.com/gallery/1g55yxn",
  "score": 228,
  "num_comments": 103,
  "comments": [
    {
      "id": "ls8qvpz",
      "author": "Shykae33",
      "body": "“Why can’t you just be normal and healthy?” \nYOU THINK I DONT WANT TO BE NORMAL?\nDO YOU THINK I ENJOY STARVING MYSELF BECAUSE MY BODY WONT ME SWALLOW ANYTHING?!\n\nThey act like it’s a choice, trust me, if it were a choice I wouldn’t be going 24-48 hrs on 500 calories.",
      "created_utc": 1729104162.0,
      "score": 218,
      "context": []
    },
    {
      "id": "ls8mnic",
      "author": "uraniumsunglasses",
      "body": "This reminds me of the hateful way people talk about autistic traits. Ironically, I think less of these people for being vile to others who don't conform to their ideals of \"normalcy\" to boost their own egos.",
      "created_utc": 1729102830.0,
      "score": 304,
      "context": []
    },
    {
      "id": "ls8pszb",
      "author": "ScaryBoyRobots",
      "body": "lmao this is the same \"but what about their *health*!!\" bullshit people use to justify bullying fat people. lbr not a single one of them give a shit about anything other than making themselves feel superior at the expense of other people. \"It makes me think less of them,\" give me a break. *I* think less of people who judge others based on superficial assumptions, because none of them know anyone else's medical history, and who are so lacking in emotional depth that they have to lie and pretend they care about the health of people they probably barely know. And if you're judging people you *do* already know and profess to genuinely care about their health, then you're an asshole anyway, because you're not expressing concern, you're just *judging*.\n\nBullying is far more childish than \"being picky\" could ever be.",
      "created_utc": 1729103829.0,
      "score": 143,
      "context": []
    },
    {
      "id": "ls8npcf",
      "author": "No-Yogurtcloset-1900",
      "body": "I don’t get why it bothers people so much when it has quite literally zero impact on them. You have to be looking for something to be upset about if what foods a hypothetical stranger eats is infuriating",
      "created_utc": 1729103166.0,
      "score": 264,
      "context": []
    },
    {
      "id": "ls8ujdl",
      "author": "patrickbateperson",
      "body": "it's funny how they don't even consider how some of us *did* grow up poor and still have ARFID. when it came to \"eat what's on your plate or starve,\" starve was the preferable option. my brain is wired in a way that the vast majority of foods don't register as edible, they register as poison. i have the same visceral physical and mental reaction to 99% of foods that a regular person has to feces, rat poison, rotten food, whatever. i'm lucky that the few foods i *was* able to eat were inexpensive and covered by food stamps during the brief time when my family relied on them.",
      "created_utc": 1729105307.0,
      "score": 111,
      "context": []
    },
    {
      "id": "ls8ti34",
      "author": "colesense",
      "body": "\"privileged\" i grew up in an incredibly poor family. we lived off of food stamps and leftover food from the school my mom worked at. if there were no safe foods id literally starve because the other option was to force myself to eat it and then throw it up and be sick. at some point i ended up being around 60lbs it got so bad. suffering isnt a fucking privilege.",
      "created_utc": 1729104980.0,
      "score": 79,
      "context": []
    },
    {
      "id": "ls8nyu4",
      "author": "jeannesloaf",
      "body": "Comments like this make me wish I was dead lol",
      "created_utc": 1729103251.0,
      "score": 68,
      "context": []
    },
    {
      "id": "ls8qsa6",
      "author": "MaleficentSwan0223",
      "body": "I have a genuine question… do other people waste food? \n\nI have arfid and I cried about throwing 5 chips away last week as I was too full to finish them? My husband said food waste is normal and to not get so upset. I’m the picky eater and the least wasteful one. \n\nAlso when people say ‘you’re not going to live as long’ I feel like saying NO FUCKING SHIT! But if they feel this way I’m happy for them to pay for my treatment. ",
      "created_utc": 1729104132.0,
      "score": 66,
      "context": []
    },
    {
      "id": "ls8tu9p",
      "author": "TeaIsMyCat",
      "body": "I genuinely hate the people acting like this is a \"privilege\" issue. I grew up poor and I still have severe ARFID. Money has nothing to do with my eating.",
      "created_utc": 1729105086.0,
      "score": 48,
      "context": []
    },
    {
      "id": "ls8w15p",
      "author": "tobeasloth",
      "body": "Comments like this so upset me, because it shows lack of empathy and understanding. We don’t choose to have ARFID, and it can be distressing for us. I wish I could make them just get it, but that’s impossible of course",
      "created_utc": 1729105783.0,
      "score": 44,
      "context": []
    },
    {
      "id": "ls8s75s",
      "author": "Delicious_Impress818",
      "body": "wow people really just don’t know how to think about anyone other than themselves. insane",
      "created_utc": 1729104574.0,
      "score": 27,
      "context": []
    },
    {
      "id": "ls8vdf3",
      "author": "WilsonSimons12",
      "body": "This is my biggest fear when I tell people about ARFID, they’ll think less of me or only see me as a child",
      "created_utc": 1729105571.0,
      "score": 23,
      "context": []
    },
    {
      "id": "ls91y6q",
      "author": "Viener-Schnitzel",
      "body": "The “picky eaters are privileged because I grew up poor and had to eat whatever was on the table” argument drives me INSANE. I also grew up poor. Like no utilities in the house several times a year kind of poor. Food aversions don’t go away because you live in poverty and it’s insane to assume you know other people’s upbringing.",
      "created_utc": 1729107674.0,
      "score": 24,
      "context": []
    },
    {
      "id": "ls93gr9",
      "author": "eggsoda23",
      "body": "\"Why can't you just be normal and healthy\" as if I'm specifically choosing NOT to be either of those things. That comment, especially with the way it's phrased, literally pisses me off to no end.",
      "created_utc": 1729108154.0,
      "score": 21,
      "context": []
    },
    {
      "id": "ls9411v",
      "author": "serioustransvibes",
      "body": "A lot of these comments piss me off but that idiot saying they “grew up poor so picky eaters seem privileged to me” …bitch me too. I also grew up poor enough to barely get food each day. And you know what? That didn’t make a fucking difference. I’d genuinely rather starve to fucking death than eat a lot of things, (slight TW here) I’ve genuinely gone almost a week without eating in the past because there genuinely was NO food I could eat at home, so I *know* that depriving the body of nutrients like that HURTS. I’m not fucking “privileged enough” to be a picky eater! You’re damn lucky you didn’t have to grow up with severe arfid on top of being poor! You’re damn lucky you can walk around saying ignorant bs like that, you really wouldn’t want to know.",
      "created_utc": 1729108331.0,
      "score": 19,
      "context": []
    },
    {
      "id": "ls93p8x",
      "author": "witchblade_007",
      "body": "the “growing up poor” excuse from them kills me because i WAS poor and i went hungry SO OFTEN. i was underweight because of arfid. \n\ni could not eat the food, i would sit at the dinner table while being yelled at. when i got older i never wanted to eat around anyone. my self esteem was ruined because of it. the constant judgement was so hurtful because i couldn’t explain myself.\n\ni NEVER wanted to be a picky eater. i would eat chicken nuggets and pretend they were a fancy dish i couldn’t eat when i was 6 years old. i wanted to be normal so bad.",
      "created_utc": 1729108229.0,
      "score": 16,
      "context": []
    },
    {
      "id": "ls8tr07",
      "author": "ohhyouknow",
      "body": "The people acting like being poor as a kid makes it okay to hate on people with literal disorders. As if it’s impossible to have both ARFID and be poor. I’d rather just be poor than be poor AND have ARFID.",
      "created_utc": 1729105058.0,
      "score": 17,
      "context": []
    },
    {
      "id": "ls8s6nq",
      "author": "peanutbutternmtn",
      "body": "Yeah, people don’t get it.",
      "created_utc": 1729104570.0,
      "score": 15,
      "context": []
    },
    {
      "id": "ls8w9od",
      "author": "NerdyYogaGirl",
      "body": "People are so stupid. I know these comments come from a place of ignorance but I'm so exhausted trying to explain something to people that they could easily understand if they just had an ounce of empathy.",
      "created_utc": 1729105860.0,
      "score": 16,
      "context": []
    },
    {
      "id": "ls8y4sd",
      "author": "arachnids-bakery",
      "body": "Sorry guys, apparently you cant have eating disorders if you arent well-off 😔 /s",
      "created_utc": 1729106454.0,
      "score": 15,
      "context": []
    },
    {
      "id": "ls8zvwg",
      "author": "Quantum_Aurora",
      "body": "They act as if most picky eaters aren't constantly actively trying to change that.",
      "created_utc": 1729107013.0,
      "score": 14,
      "context": []
    },
    {
      "id": "ls99mze",
      "author": "ArtfulAesthetic",
      "body": "the way that they always talk about ppl like this in a hypothetical scenario because they cant recall any people like this in their own lives",
      "created_utc": 1729110089.0,
      "score": 13,
      "context": []
    },
    {
      "id": "ls9mvhb",
      "author": "seaurchin76",
      "body": "The assumptions that people have arfid and sensory issues because they’re inherently privileged piss me tf off. I lost 10 pounds because I used to live at a homeless shelter and couldn’t always afford to replace the meals they’d serve, and I physically could not eat most of the food they offered without gagging and feeling sick. I’m not spoiled because I have an eating disorder. You can’t just ‘get over’ a fucking eating disorder and instead of people showing compassion, they shit on a sick person for being sick. It’s ridiculous. And the generalization about what people w arfids safe foods are. Not every single person with arfid or sensory issues relies on sugar for fuel, some people, like myself, enjoy a select amount of vegetables and other things. I don’t even really like sweets, my current safe foods are bean burritos, tuna sandwiches w avocado, and egg sandwiches, so bite me.",
      "created_utc": 1729114359.0,
      "score": 13,
      "context": []
    },
    {
      "id": "ls9q0k1",
      "author": "jennybean2442",
      "body": "The whole \"won't live as long\" thing is stupid. I am well aware my eating habits are unhealthy and will bite me in the ass when im older.  I also know what will kill a person faster than heart disease or diabetes is starving. Plus you can eat very healthy and still end up with a disease that kills you prematurely.  Life is unpredictable and anyone can go at any time. Food is not the end all be all for when you encounter the Grim Reaper",
      "created_utc": 1729115420.0,
      "score": 12,
      "context": []
    },
    {
      "id": "ls90pa6",
      "author": "Scorpiodancer123",
      "body": "Urgh this just confirms to me that some people are arseholes, pure and simple. I cannot for any reason understand why some people can be so bothered about what someone else eats when it has absolutely no impact on them.\n\nIt's just amazing to me how people can think they are superior to other people because of something - food, music taste, hobbies whatever. \n\nI know it's so easy to say but you just have to ignore people like this and let them stress themselves out over something that has no bearing whatsoever on their lives. It's pretty sad really.",
      "created_utc": 1729107275.0,
      "score": 11,
      "context": []
    },
    {
      "id": "ls953db",
      "author": "spooky-ufo",
      "body": "ugh i HATE when they say “well if you’re poor-“ i AM poor. i always have been, even as a kid. my parents didn’t force me to eat everything that was on my plate and if i didn’t like something that was FINE. these people actually drive me insane like mind your own fucking business holy SHIT\n\nedit: “why can’t you be normal and healthy” I DON’ T KNOW BUT I CANT!! these people are so hateful :-(",
      "created_utc": 1729108664.0,
      "score": 7,
      "context": []
    },
    {
      "id": "ls9czz9",
      "author": "boringlesbian",
      "body": "Ahh, yes, the “train yourself” to get over food aversion. Okay, I’ll do that when you are able to train yourself to grow three more inches and not need glasses anymore just by will alone.",
      "created_utc": 1729111152.0,
      "score": 8,
      "context": []
    },
    {
      "id": "ls9frm6",
      "author": "evilgirlwdevilhorns",
      "body": "“I dont care what someone else chooses to eat it doesn’t affect me! That being said, I actually care a lot, enough to let it affect my mood/feelings on that person! I love to lie!!!!”",
      "created_utc": 1729112020.0,
      "score": 6,
      "context": []
    },
    {
      "id": "ls9oquj",
      "author": "Agreeable_Thing_8394",
      "body": "People love to be like “I dont care, it doesn’t affect me” then go on to say how they don’t respect us/look down on us lmfao. Pick one Mr cognitive dissonance !!!!!",
      "created_utc": 1729114991.0,
      "score": 7,
      "context": []
    },
    {
      "id": "ls8wm0u",
      "author": "sweeperchick",
      "body": "\"violent scebarios\"",
      "created_utc": 1729105970.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ls9e1kk",
      "author": "_VLW_",
      "body": "Crazy how these SAME commentators can get away with saying they don’t like certain ethnic foods, BUT it’s end of the world for them if someone tells them no thank you to eating something.",
      "created_utc": 1729111482.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ls9sb21",
      "author": "None",
      "body": "All these people say, ‘I’m not going to lose sleep over this’ or ‘I don’t care what other people eat’ but then proceed to further complain and call ‘picky eaters’ childish…they’re the ones acting childish because they are making it a big deal/problem",
      "created_utc": 1729116222.0,
      "score": 6,
      "context": []
    },
    {
      "id": "ls9xoqg",
      "author": "Alarming-Ad4296",
      "body": "This is insane. The whole thing of “if you were poor you wouldn’t have a choice” is bs for people with severe ARFID. My mom took away all food for multiple days when I was a kid because she said I couldn’t eat unless I ate a new food. I was literally like 5 and I didn’t eat for 3+ days. Even now, if I didn’t have my safe foods I would probably starve. They don’t understand that eating a non-safe food is genuinely the equivalent of shoving literal shit down my throat: THAT’S how vile it is to me.",
      "created_utc": 1729118182.0,
      "score": 7,
      "context": []
    },
    {
      "id": "lsa3d3e",
      "author": "multicolourfruit",
      "body": "i only managed to get to the 7th pic before i noped out. feels like empathy is non existent nowadays 😕",
      "created_utc": 1729120292.0,
      "score": 7,
      "context": []
    },
    {
      "id": "ls9hsgk",
      "author": "MrPureinstinct",
      "body": "I'm glad I haven't experienced people like this outside of dickheads on the internet because I simply wouldn't be their friend anymore. \n\nI've been lucky to have friends that understand I might bring my own meal to a gathering so they aren't inconvenienced by my specific needs and no one gets upset when I say I'm not interested in trying something they've cooked. \n\nMaybe people on the internet are just bigger dickheads in general, I got very lucky, or people don't say anything to my face about it.",
      "created_utc": 1729112668.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lsa1dcj",
      "author": "Invisibleoatmeal",
      "body": "Every time I read things like this I know I will regret it and I read it anyway",
      "created_utc": 1729119540.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lsa69s6",
      "author": "nimpog",
      "body": "I grew up poor and am a broke uni student, the privilege comment pisses me off so much. My arfid stops me from eating full stop if there’s nothing I can eat.",
      "created_utc": 1729121381.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lsa79zo",
      "author": "NoAstronomer3244",
      "body": "2nd person is kinda right, but also at the same time some of us cannot afford dietitians or doctors don't take us seriously enough to care!",
      "created_utc": 1729121763.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lsb0bap",
      "author": "turtleshellstew",
      "body": "When I see people like this I assume they are people who genuinely don’t have anything of value to do with their lives. If you care that much about the eating habits of another person that has absolutely no effect on you, you must be bored and miserable.",
      "created_utc": 1729132909.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lsb3089",
      "author": "donotthedabi",
      "body": "i hate how these people will try to justify their weird obsession with picky eaters\n\n\"it's okay if someone has issues with food, just so long as they never talk about it, never ask for accommodations, and quietly forces themselves to eat whatever i buy\" genuinely fuck you",
      "created_utc": 1729134012.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lsbin14",
      "author": "yungcremepuff",
      "body": "This is my fault for looking at these comments, but wow do i feel shitty reading them, like i dont feel this way already :(",
      "created_utc": 1729141599.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lsc1w6u",
      "author": "GaydrianTheRainbow",
      "body": "Yeesh. Ah, yes, we choose this. /sarcasm\n\nCounterpoints (preaching to the choir):\n- Can people please stop moralising food to this extent/in these ways? Like... \"choosing\" (or only being able to eat, or only having access to) \"less nutritious\" foods does not make someone less of a good person? Judging someone for their food intake, on the other hand... Strangers on the internet stop being so classist, ableist, and fatphobic about processed foods challenge. Also fearmongering death as if all fat, disabled, poor, and \"picky\" people will die and it will be All Our Fault. What the heck how does this make them feel like they are stating moral things when they are so unkind and factually wrong 😭 I do not understand their set of ethics.\n- As someone with dietary sensitivities, while they are terrible and do interact strongly with my \"picky eating,\" my sensory issues limit my diet at least as significantly. They are not trivial.\n- Also holy shit imagine, consider... Not infantilising disabled people, Autistic people, people with eating disorders... What if adults can also have sensory issues, fears and anxieties, lack of interest... and still be adults? What if \"picky eaters\" are actually full and multifaceted people? What if... being a \"picky eater\" doesn't actually say anything about your age or personality or...\n- Many of the foods I've struggled most with have been very sweet. Not that that matters as a defense; let people eat sweet foods! Just amused me as like... clearly this person does not understand food issues.\n- Ah, yes, not like food insecurity is a risk factor for ARFID. We're all so privileged /sarcasm. Not like forcing myself to choke down food due to not having other options made things worse.\n- Being upset with someone for being a judgemental asshole is not the same thing as being a judgemental asshole what the actual duck 😤 We aren't instigating you or being mean to you by being picky. You are hurting us! Being upset about harm is not equivalent to... enacting harm. We're not harming them. Cognitive dissonance explodes.\n- Oh g-d raw carrots and nuts are Not the same as chips or crackers. Carrots are initially crunchy, not crispy, and they get drier and harder to swallow the more you chew them instead of easier to swallow. And whole nuts/pieces are slidey and zjierb (word coined by Brian David Gilbert to describe the feeling experienced when biting into a limp pickle). I cannot with those textures and flavours. Also lols in medically-indicated high-salt diet POTS 🙄",
      "created_utc": 1729154031.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ls9md9c",
      "author": "Fizzabl",
      "body": "Welcome to reddit...",
      "created_utc": 1729114188.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ls9thtg",
      "author": "yaelfitzy",
      "body": "Oh my god these people are insane. I wish I could just be healthy and normal!! my god!! and yeah we grew up poor, know what that means? if my comfortable foods weren't available I simply wouldn't eat.",
      "created_utc": 1729116647.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ls9ze59",
      "author": "InevitablePersimmon6",
      "body": "People are stupid. I truly don’t care what anyone is eating as long as it makes them happy. I’ve had ARFID since I got put on solids and how I eat literally doesn’t affect anyone else.",
      "created_utc": 1729118817.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lsa6ieh",
      "author": "None",
      "body": "I was born poor, extremely underprivileged and almost homeless for a good 1/3 of my life. I still had ARFID. If I couldn’t handle the texture of whatever food was available, I simply would not eat. I went that way for years, and it definitely caused issues for me development wise, but ARFID is not something you can just make go away even if you’re impoverished.",
      "created_utc": 1729121472.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lsc4fh8",
      "author": "GaydrianTheRainbow",
      "body": "OP: Please be kind to picky eaters. We're not making your lives difficult. Here are some simple explanations [in case you need examples to be kind to people 😭]. Just let us live, thanks!\n\nThe commenters: How dare you get so upset about how rude people are? After all picky eaters are children and children don't deserve human rights. Just don't let it affect you when I say I don't respect you or say I think of you as a child. Stop being so sensitive this is all your fault. I should be able to be mean to you and if you don't just take it, that's you being completely terrible to me. How dare you.",
      "created_utc": 1729155815.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lsdd5wm",
      "author": "Rinny-ThePooh",
      "body": "Btw I think this brings up an important conversation of “well obviously I didn’t mean if you have (insert condition)” for example calling someone dumb for not getting context clues and then when you find out they’re autistic being like “well actually” well actually you called a symptom of a disorder “dumb”. Also abliesm is actually discrimination based on only using able bandied language, dis abliesm, is against disabled people. So this is in fact a perfect example of abliesm, (likely) neurodivergent people using language that only applys to them and not taking into account if someone might have a hidden disability.",
      "created_utc": 1729176479.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lsdkoes",
      "author": "KillTheInc",
      "body": "Some of the other comments on that post are wild.... Is the Rude And Mean picky eater who bitches and moans about food that isn't theirs in the room with us right now? Because I don't think that happens as often as people say it does. \n\nI'm always too embarrassed about having to eat something different that I never make any comments. I get grossed out by other people's food for sure, but I don't know any other \"picky eaters\" that would be rude about stuff. We're usually shamed into silence anyway, even for things that wouldn't be rude",
      "created_utc": 1729178895.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ls9cyuj",
      "author": "pinkcheekdisco",
      "body": "“I don’t even give a care” yoink I’ll be adopting that  phrase",
      "created_utc": 1729111142.0,
      "score": 6,
      "context": []
    },
    {
      "id": "lsgs2lg",
      "author": "PuzzleheadedHeight25",
      "body": "Where, pray tell, are all these adults throwing tantrums if their peas touch their mash potatoes? This is always the justification but I’ve literally nvrrrr seen an adult do this. Since I have ARFID I notice ED adjacent behaviors in other ppl pretty quickly (kinda like when you buy a new car then start seeing it everywhere). \n\nAnd you only see us eating ultra processed foods? Oh you mean the foods that are designed to be hyper-palatable?? And addicting (if you’re in the US especially) 🤯🤯 oh my god.. no waaayyyy\n\nI’ve been in enough therapy that this stuff doesn’t bother me anymore so I’ve made it my mission to be a loud and proud picky eater. Not throwing tantrums, but if someone tries to be condescending about it they’re getting a shame uno reverse. I got a 2-for-1 special, my ARFID came with ASD and I have no issues weaponizing my intense sense of justice—destigmatizing mental illness means removing stigma from ALL mental illnesses not just the ones we think are “justified”.",
      "created_utc": 1729217959.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lwm84sj",
      "author": "Enkiiper",
      "body": "One of the commenters called ARFID \"bullshit\"\n\nThey called a legitimate condition bullshit.\n\nThey're not even trying to hide their ableism.",
      "created_utc": 1731348998.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lsbusdv",
      "author": "molly_menace",
      "body": "It’s ignorance.",
      "created_utc": 1729149051.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lsc45yi",
      "author": "Peak-Pickiness00",
      "body": "I'm just a regular picky eater, but this doesn't mean I haven't dealt with a fair share of unsolicited comments like \"Are you a picky eater?\", \"You really had bad parenting\" or the evergreen \"When you travel  do you always end up at McDonald's?\"\n\nFor me It's hard not to get noticed at events, cuz my aversions stand out: no salad, no cold appetizers (including cold cheese on boards) and no seafood (except fish & chips and calamari). I'd say that I have a strong aversion to anything cold and salty. Like an egg salad sandwich makes me gag, but I like toast and scrambled eggs (same food different preparation). \nCooked cherry tomato on pizza ok, raw sends my tastebuds haywire that I grimace and gag in disgust.\n\nIt's more than enough turning down salad IMHO, given how ubiquitous it is, to be called \"picky eater\" and getting that damn weird side eye and the occasional unwanted remarks.\n\nI don't want others to cater to me, if I can't eat most of the foods without gagging at your dinner parties, weddings or whatever.\nI will just stick to crackers, but please mind your own business.",
      "created_utc": 1729155629.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lscthxi",
      "author": "Iam_weird123",
      "body": "Yeah I wish I was normal, I WISH.",
      "created_utc": 1729169423.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lsdcms8",
      "author": "Rinny-ThePooh",
      "body": "It’s funny how many people said “I don’t care because it doesn’t affect me but I judge you for it” like.. this sounds like maybe a bit of unresolved ableism",
      "created_utc": 1729176304.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lsdw2ap",
      "author": "Manospondylus_gigas",
      "body": "\"why can't you just be normal and healthy\" you think we don't want that too?",
      "created_utc": 1729182502.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lsfhyna",
      "author": "Frazzle64",
      "body": "I think the second person was the only reasonable one since their POV comes from an actual place of care and compassion for others",
      "created_utc": 1729200936.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lsfic3a",
      "author": "honeynut_queerio",
      "body": "it’s funny how the people in the comments of the post literally illustrate the point you’re trying to make 🙃\n\nsome people have so little self awareness/critical thinking skills",
      "created_utc": 1729201065.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lsjir35",
      "author": "imdestroylonely",
      "body": "comparing somebody with eating issues to a little bitch baby brat who “CRIES when they don’t get their way” is absolute insanity. these people are SO embarrassing, and they don’t even know it. they think they’re spitting facts right now.",
      "created_utc": 1729265948.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lsjjp02",
      "author": "imdestroylonely",
      "body": "also wait til hangriestbadger finds out that certain foods fuck with digestive issues more than others… they tried putting me on a low fodmap diet (EXTREMELY restricted) for my IBS and i couldn’t even go on it because of my arfid.",
      "created_utc": 1729266243.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lsql4lr",
      "author": "toocynicaltocare",
      "body": "I'm sorry but you're posting on reddit. What were you expecting? I probably have symptoms of ARFID, but I'm not actively looking to find people to be enraged at because of their ignorance.",
      "created_utc": 1729369420.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ls8smtx",
      "author": "Delicious_Impress818",
      "body": "THIS. oh my god. I have lost FIFTEEN POUNDS because I barely have any safe foods anymore. I hate looking at old pictures of my body because I look so healthy and I miss it. I miss being able to actually eat and sustain my weight instead of feeling like I could sleep for 24 hours and still be tired smh.",
      "created_utc": 1729104711.0,
      "score": 59,
      "context": [
        {
          "id": "ls8qvpz",
          "author": "Shykae33",
          "body": "“Why can’t you just be normal and healthy?” \nYOU THINK I DONT WANT TO BE NORMAL?\nDO YOU THINK I ENJOY STARVING MYSELF BECAUSE MY BODY WONT ME SWALLOW ANYTHING?!\n\nThey act like it’s a choice, trust me, if it were a choice I wouldn’t be going 24-48 hrs on 500 calories.",
          "created_utc": 1729104162.0
        }
      ]
    },
    {
      "id": "lsjj2fg",
      "author": "imdestroylonely",
      "body": "if someone has autism i do lose a little bit of respect for them. (joking obviously)",
      "created_utc": 1729266046.0,
      "score": 2,
      "context": [
        {
          "id": "ls8mnic",
          "author": "uraniumsunglasses",
          "body": "This reminds me of the hateful way people talk about autistic traits. Ironically, I think less of these people for being vile to others who don't conform to their ideals of \"normalcy\" to boost their own egos.",
          "created_utc": 1729102830.0
        }
      ]
    },
    {
      "id": "ls8vn85",
      "author": "BirdsNeedNames",
      "body": "yup, it's exactly the same. as a fat person with arfid, i'm constantly getting this crap spewed at me by people who would legitimately rather see me starve than have to deal with me eating french fries while in their presence.",
      "created_utc": 1729105659.0,
      "score": 41,
      "context": [
        {
          "id": "ls8pszb",
          "author": "ScaryBoyRobots",
          "body": "lmao this is the same \"but what about their *health*!!\" bullshit people use to justify bullying fat people. lbr not a single one of them give a shit about anything other than making themselves feel superior at the expense of other people. \"It makes me think less of them,\" give me a break. *I* think less of people who judge others based on superficial assumptions, because none of them know anyone else's medical history, and who are so lacking in emotional depth that they have to lie and pretend they care about the health of people they probably barely know. And if you're judging people you *do* already know and profess to genuinely care about their health, then you're an asshole anyway, because you're not expressing concern, you're just *judging*.\n\nBullying is far more childish than \"being picky\" could ever be.",
          "created_utc": 1729103829.0
        }
      ]
    },
    {
      "id": "ls8q996",
      "author": "uraniumsunglasses",
      "body": "Couldn't agree more.",
      "created_utc": 1729103968.0,
      "score": 5,
      "context": [
        {
          "id": "ls8pszb",
          "author": "ScaryBoyRobots",
          "body": "lmao this is the same \"but what about their *health*!!\" bullshit people use to justify bullying fat people. lbr not a single one of them give a shit about anything other than making themselves feel superior at the expense of other people. \"It makes me think less of them,\" give me a break. *I* think less of people who judge others based on superficial assumptions, because none of them know anyone else's medical history, and who are so lacking in emotional depth that they have to lie and pretend they care about the health of people they probably barely know. And if you're judging people you *do* already know and profess to genuinely care about their health, then you're an asshole anyway, because you're not expressing concern, you're just *judging*.\n\nBullying is far more childish than \"being picky\" could ever be.",
          "created_utc": 1729103829.0
        }
      ]
    },
    {
      "id": "ls9d7ts",
      "author": "fwmh_royale",
      "body": "exactly this. 99% of the time when ive told people about my arfid they don't give a fuck. no reasonable adult would care this much about what someone else eats",
      "created_utc": 1729111220.0,
      "score": 50,
      "context": [
        {
          "id": "ls8npcf",
          "author": "No-Yogurtcloset-1900",
          "body": "I don’t get why it bothers people so much when it has quite literally zero impact on them. You have to be looking for something to be upset about if what foods a hypothetical stranger eats is infuriating",
          "created_utc": 1729103166.0
        }
      ]
    },
    {
      "id": "lsag7cr",
      "author": "Stormdude127",
      "body": "I would understand if they were referring to picky eaters that ask other people to do unreasonable things to accommodate them. But I know they’re not, they just hate picky eaters in general, even though I and many others literally go out of our way to make sure we don’t inconvenience others. I’ll literally tell people to go where they want and not try to pick a restaurant that I’ll like, but they don’t like the fact that I’ll sit there not eating anything. Even if I tell them repeatedly that I don’t care and I’ll eat something later, they don’t believe me, and then they end up picking a place they didn’t really want to just for me and being unhappy. Like at that point you did that to yourself I tried to be accommodating, so you don’t get to complain.",
      "created_utc": 1729125159.0,
      "score": 24,
      "context": [
        {
          "id": "ls8npcf",
          "author": "No-Yogurtcloset-1900",
          "body": "I don’t get why it bothers people so much when it has quite literally zero impact on them. You have to be looking for something to be upset about if what foods a hypothetical stranger eats is infuriating",
          "created_utc": 1729103166.0
        }
      ]
    },
    {
      "id": "lsb1mxq",
      "author": "corn_breath",
      "body": "Dunno if this helps, but my take on a genuine explanation: \n\n1. People put enormous amounts of energy and resources into eating in a way they believe is right for their bodies, minds, their longevity. Do they KNOW that that way is the right way? Does anyone know? They're just hoping they trusted the right resource. If not, god, what a waste. Like if you became a doctor only to realize you can't stand the job. They feel so triggered by what **feels** to them like you being *defiant* of these views about diet, forcing them to think about the possibility that their dietary efforts are for naught, that they won't be able to think clearly or listen when you explain ARFID to them. \n\n2. Is it possible to grow up spoiled with parents who never bothered to challenge you, bent to your every will? The outcome of this is a person who can't tolerate anything that isn't just their way, and I'm betting people read this quality into many people with ARFID because what would this spoiled person do if they were FORCED to try something other than the junk food they've been eating their whole lives? They'd make a big performance about how horrible the experience is (because anything that isn't exactly how they want it to be is horrible). SO the issue here is how do you clarify that you are not this person that people without even realizing it may be assuming you are?",
      "created_utc": 1729133442.0,
      "score": 10,
      "context": [
        {
          "id": "ls8npcf",
          "author": "No-Yogurtcloset-1900",
          "body": "I don’t get why it bothers people so much when it has quite literally zero impact on them. You have to be looking for something to be upset about if what foods a hypothetical stranger eats is infuriating",
          "created_utc": 1729103166.0
        }
      ]
    },
    {
      "id": "ls8wa0t",
      "author": "TrickyVast1183",
      "body": "I’ve always explained it the same way as you- it’s like foods outside of my safe foods is literally spoiled maggoty dog poo. I don’t even want to SMELL it. If I told someone with a normal brain that they had to eat a nasty concoction of garbage and rotten fish heads three times a day for the rest of their lives, they would have a hard time too lol.",
      "created_utc": 1729105863.0,
      "score": 48,
      "context": [
        {
          "id": "ls8ujdl",
          "author": "patrickbateperson",
          "body": "it's funny how they don't even consider how some of us *did* grow up poor and still have ARFID. when it came to \"eat what's on your plate or starve,\" starve was the preferable option. my brain is wired in a way that the vast majority of foods don't register as edible, they register as poison. i have the same visceral physical and mental reaction to 99% of foods that a regular person has to feces, rat poison, rotten food, whatever. i'm lucky that the few foods i *was* able to eat were inexpensive and covered by food stamps during the brief time when my family relied on them.",
          "created_utc": 1729105307.0
        }
      ]
    },
    {
      "id": "lsa6uq7",
      "author": "None",
      "body": "That’s exactly where I was, I’d simply starve when safe foods weren’t an option. So many foods don’t seem edible to me, my way of describing how it is for me is like: “This is poison, I cannot touch or smell it or I will die”",
      "created_utc": 1729121601.0,
      "score": 11,
      "context": [
        {
          "id": "ls8ujdl",
          "author": "patrickbateperson",
          "body": "it's funny how they don't even consider how some of us *did* grow up poor and still have ARFID. when it came to \"eat what's on your plate or starve,\" starve was the preferable option. my brain is wired in a way that the vast majority of foods don't register as edible, they register as poison. i have the same visceral physical and mental reaction to 99% of foods that a regular person has to feces, rat poison, rotten food, whatever. i'm lucky that the few foods i *was* able to eat were inexpensive and covered by food stamps during the brief time when my family relied on them.",
          "created_utc": 1729105307.0
        }
      ]
    },
    {
      "id": "ls9y2m2",
      "author": "Alarming-Ad4296",
      "body": "YES! THIS! I’ve tried to explain to people that eating a non-safe food is LITERALLY like eating shit. Because it is. It quite literally is",
      "created_utc": 1729118325.0,
      "score": 16,
      "context": [
        {
          "id": "ls8ujdl",
          "author": "patrickbateperson",
          "body": "it's funny how they don't even consider how some of us *did* grow up poor and still have ARFID. when it came to \"eat what's on your plate or starve,\" starve was the preferable option. my brain is wired in a way that the vast majority of foods don't register as edible, they register as poison. i have the same visceral physical and mental reaction to 99% of foods that a regular person has to feces, rat poison, rotten food, whatever. i'm lucky that the few foods i *was* able to eat were inexpensive and covered by food stamps during the brief time when my family relied on them.",
          "created_utc": 1729105307.0
        }
      ]
    },
    {
      "id": "lsdcq3g",
      "author": "-FrogPotato-",
      "body": "The thing about being poor with ARFID is that, besides being a rare condition already, they are less likely to survive since they don't have easier access to safe foods. We don't see people who have little to eat complaining about food because those who can't stand eating what they have die earlier. It's called survivorship bias. Maybe people should learn a thing or two about it before making us feel bad for not being like them.",
      "created_utc": 1729176333.0,
      "score": 5,
      "context": [
        {
          "id": "ls8ujdl",
          "author": "patrickbateperson",
          "body": "it's funny how they don't even consider how some of us *did* grow up poor and still have ARFID. when it came to \"eat what's on your plate or starve,\" starve was the preferable option. my brain is wired in a way that the vast majority of foods don't register as edible, they register as poison. i have the same visceral physical and mental reaction to 99% of foods that a regular person has to feces, rat poison, rotten food, whatever. i'm lucky that the few foods i *was* able to eat were inexpensive and covered by food stamps during the brief time when my family relied on them.",
          "created_utc": 1729105307.0
        }
      ]
    },
    {
      "id": "ls9hyum",
      "author": "solraysre",
      "body": "Literally",
      "created_utc": 1729112726.0,
      "score": 10,
      "context": [
        {
          "id": "ls8nyu4",
          "author": "jeannesloaf",
          "body": "Comments like this make me wish I was dead lol",
          "created_utc": 1729103251.0
        }
      ]
    },
    {
      "id": "ls8vf1s",
      "author": "ScaryBoyRobots",
      "body": "I feel like most of my food waste comes from the fact that I live alone, so it can be very difficult to eat everything before it expires. Food just isn't really packaged for people who live alone, it's sold in family quantities. I can't go buy four slices of bread for one week, but I'm not realistically ever going to be able to eat a whole loaf of bread before it starts molding, or a whole bunch of fruit and vegetables that rot. Even stuff I *love* can go bad before I manage to get to it.\n\nBut I never make or order or buy a large quantity of *anything* I don't know I already like. I don't let other people order for me, and if there's nothing at a party or event that I like, then I don't touch it. If I want to try something new, it's going to be extremely preplanned and only a very small amount, preferably just enough to have maybe two bites. I'm not just throwing out food willy-nilly.",
      "created_utc": 1729105586.0,
      "score": 31,
      "context": [
        {
          "id": "ls8qsa6",
          "author": "MaleficentSwan0223",
          "body": "I have a genuine question… do other people waste food? \n\nI have arfid and I cried about throwing 5 chips away last week as I was too full to finish them? My husband said food waste is normal and to not get so upset. I’m the picky eater and the least wasteful one. \n\nAlso when people say ‘you’re not going to live as long’ I feel like saying NO FUCKING SHIT! But if they feel this way I’m happy for them to pay for my treatment. ",
          "created_utc": 1729104132.0
        }
      ]
    },
    {
      "id": "ls8whyb",
      "author": "sweeperchick",
      "body": "If anything, I'd imagine picky eaters are less likely to waste food because we're not ordering unknown dishes at restaurants and only eating a few bites before we decide we don't like it. More likely we will pick a \"safe\" food and either eat all of it or gladly take the leftovers home.\n\n\nSame thing at a party, I'm not loading my plate with heaps of foods to try, I'm taking moderate portions of my safe foods.\n\n\nIf I'm at someone's house and they cook, I might take a portion and only eat a few bites to be polite, but most of my family and friends are aware of my food restrictions and don't force that on me, so there's really no waste occurring.",
      "created_utc": 1729105934.0,
      "score": 30,
      "context": [
        {
          "id": "ls8qsa6",
          "author": "MaleficentSwan0223",
          "body": "I have a genuine question… do other people waste food? \n\nI have arfid and I cried about throwing 5 chips away last week as I was too full to finish them? My husband said food waste is normal and to not get so upset. I’m the picky eater and the least wasteful one. \n\nAlso when people say ‘you’re not going to live as long’ I feel like saying NO FUCKING SHIT! But if they feel this way I’m happy for them to pay for my treatment. ",
          "created_utc": 1729104132.0
        }
      ]
    },
    {
      "id": "ls91xjw",
      "author": "linx14",
      "body": "Anyone who cares that much about food waste to the point of judging individuals needs therapy. Food waste happens. It’s not ideal, but corporations are 1000% worse than a handful of people not finishing their plates. \n\n\nI’m still trying to deconstruct my food issues and allow myself to throw out food instead of making myself sick by eating it. Over eating is not better than throwing away food. And eating something that brings you mental/physical is not okay either. People just don’t get it and it’s exhausting.",
      "created_utc": 1729107668.0,
      "score": 18,
      "context": [
        {
          "id": "ls8qsa6",
          "author": "MaleficentSwan0223",
          "body": "I have a genuine question… do other people waste food? \n\nI have arfid and I cried about throwing 5 chips away last week as I was too full to finish them? My husband said food waste is normal and to not get so upset. I’m the picky eater and the least wasteful one. \n\nAlso when people say ‘you’re not going to live as long’ I feel like saying NO FUCKING SHIT! But if they feel this way I’m happy for them to pay for my treatment. ",
          "created_utc": 1729104132.0
        }
      ]
    },
    {
      "id": "ls8tw9y",
      "author": "colesense",
      "body": "i do sometimes and it stresses me out so bad. usually when i eat a non safe food because theres nothing else i can eat and then after a while i get so sick i cant finish it. i try to only give myself small amounts of food but sometimes im so hungry that i pile it on and hope for the best. it doesnt happen too often, luckily.",
      "created_utc": 1729105103.0,
      "score": 13,
      "context": [
        {
          "id": "ls8qsa6",
          "author": "MaleficentSwan0223",
          "body": "I have a genuine question… do other people waste food? \n\nI have arfid and I cried about throwing 5 chips away last week as I was too full to finish them? My husband said food waste is normal and to not get so upset. I’m the picky eater and the least wasteful one. \n\nAlso when people say ‘you’re not going to live as long’ I feel like saying NO FUCKING SHIT! But if they feel this way I’m happy for them to pay for my treatment. ",
          "created_utc": 1729104132.0
        }
      ]
    },
    {
      "id": "ls97eqc",
      "author": "LemonfishSoda",
      "body": "I unfortunately waste quite a lot - a mix between not eating certain parts of things (the stalks of broccoli, cauliflower and other things, for instance), things turning out not to be what I expected (i.e. unwanted surprises in seemingly safe food items), and some things just plainly not being available in smaller portions (bread, milk, mustard, margarine, jam...).",
      "created_utc": 1729109394.0,
      "score": 9,
      "context": [
        {
          "id": "ls8qsa6",
          "author": "MaleficentSwan0223",
          "body": "I have a genuine question… do other people waste food? \n\nI have arfid and I cried about throwing 5 chips away last week as I was too full to finish them? My husband said food waste is normal and to not get so upset. I’m the picky eater and the least wasteful one. \n\nAlso when people say ‘you’re not going to live as long’ I feel like saying NO FUCKING SHIT! But if they feel this way I’m happy for them to pay for my treatment. ",
          "created_utc": 1729104132.0
        }
      ]
    },
    {
      "id": "ls9nqj3",
      "author": "seaurchin76",
      "body": "I feel absolutely horrible when I waste food, to the point of not even wanting to make meals for myself in case I don’t want them when I’m done, especially if I know I’m just gonna stuff it in the fridge and forget about it bc I’m never gonna eat it 💀 food waste makes me feel guilty af",
      "created_utc": 1729114650.0,
      "score": 8,
      "context": [
        {
          "id": "ls8qsa6",
          "author": "MaleficentSwan0223",
          "body": "I have a genuine question… do other people waste food? \n\nI have arfid and I cried about throwing 5 chips away last week as I was too full to finish them? My husband said food waste is normal and to not get so upset. I’m the picky eater and the least wasteful one. \n\nAlso when people say ‘you’re not going to live as long’ I feel like saying NO FUCKING SHIT! But if they feel this way I’m happy for them to pay for my treatment. ",
          "created_utc": 1729104132.0
        }
      ]
    },
    {
      "id": "lsc30d8",
      "author": "GaydrianTheRainbow",
      "body": "Right? Food waste stresses me the fuck out. I'm trying to let it go and compost if family doesn't want it. But it's agonising.\n\nAnd trying to learn to assess portions I can actually eat is hard, and it can be so hard to let a bit go to waste if I'm not hungry for it all and I can't leftover it. But feeling overfull is so uncomfortable and I'm trying to get better at listening to my body after years of assorted overlapping disordered eating.\n\nAlso \"loading up a buffet plate\"—nO! It will be a small number of things at a time or else they will touch and I cannot. And also I'd do my best to assess if I'd like it.\n\nThey just so clearly do not grasp what ARFID, Autistic sensory issues, etc. are like.",
      "created_utc": 1729154822.0,
      "score": 5,
      "context": [
        {
          "id": "ls8qsa6",
          "author": "MaleficentSwan0223",
          "body": "I have a genuine question… do other people waste food? \n\nI have arfid and I cried about throwing 5 chips away last week as I was too full to finish them? My husband said food waste is normal and to not get so upset. I’m the picky eater and the least wasteful one. \n\nAlso when people say ‘you’re not going to live as long’ I feel like saying NO FUCKING SHIT! But if they feel this way I’m happy for them to pay for my treatment. ",
          "created_utc": 1729104132.0
        }
      ]
    },
    {
      "id": "lsc370o",
      "author": "GaydrianTheRainbow",
      "body": "Right? Experiencing food insecurity is literally a risk factor for ARFID smh",
      "created_utc": 1729154951.0,
      "score": 6,
      "context": [
        {
          "id": "ls8tu9p",
          "author": "TeaIsMyCat",
          "body": "I genuinely hate the people acting like this is a \"privilege\" issue. I grew up poor and I still have severe ARFID. Money has nothing to do with my eating.",
          "created_utc": 1729105086.0
        }
      ]
    },
    {
      "id": "ls91kam",
      "author": "Scorpiodancer123",
      "body": "Easy to say but try not to let it upset you, they're not worth it. Some people just lack empathy. They think that because it doesn't affect them it couldn't possibly affect anyone else. It's a very sad and intolerant way of living.",
      "created_utc": 1729107551.0,
      "score": 11,
      "context": [
        {
          "id": "ls8w15p",
          "author": "tobeasloth",
          "body": "Comments like this so upset me, because it shows lack of empathy and understanding. We don’t choose to have ARFID, and it can be distressing for us. I wish I could make them just get it, but that’s impossible of course",
          "created_utc": 1729105783.0
        }
      ]
    },
    {
      "id": "lsb4qqw",
      "author": "titaniumorbit",
      "body": "Same here. Like, I wish I could eat vegetables - I wish I could enjoy them the way other people do. But most of its textures are soo awful for me and I want to gag. It's really hard for me going to restaurants and not being able to eat half the menu or having to pick out half the ingredients cause of my ARFID",
      "created_utc": 1729134750.0,
      "score": 3,
      "context": [
        {
          "id": "ls8w15p",
          "author": "tobeasloth",
          "body": "Comments like this so upset me, because it shows lack of empathy and understanding. We don’t choose to have ARFID, and it can be distressing for us. I wish I could make them just get it, but that’s impossible of course",
          "created_utc": 1729105783.0
        }
      ]
    },
    {
      "id": "lsa1ujo",
      "author": "anxiety_ftw",
      "body": "I genuinely hate when my fears are justified by people like this.",
      "created_utc": 1729119718.0,
      "score": 8,
      "context": [
        {
          "id": "ls8vdf3",
          "author": "WilsonSimons12",
          "body": "This is my biggest fear when I tell people about ARFID, they’ll think less of me or only see me as a child",
          "created_utc": 1729105571.0
        }
      ]
    },
    {
      "id": "ls999gl",
      "author": "I_use_the_word_shall",
      "body": "frrr!\n\nand the privileged bs, like all that talk about picky eaters being privileged is what fuels me being so self conscious about my arfid :/\n\nlike, as if we have a choice if we have a condition or not??? or if we dislike something???",
      "created_utc": 1729109971.0,
      "score": 8,
      "context": [
        {
          "id": "ls93gr9",
          "author": "eggsoda23",
          "body": "\"Why can't you just be normal and healthy\" as if I'm specifically choosing NOT to be either of those things. That comment, especially with the way it's phrased, literally pisses me off to no end.",
          "created_utc": 1729108154.0
        }
      ]
    },
    {
      "id": "lsc3h2f",
      "author": "GaydrianTheRainbow",
      "body": "Food insecurity is literally a risk factor for ARFID. They truly do not care to know the truth 😫",
      "created_utc": 1729155147.0,
      "score": 3,
      "context": [
        {
          "id": "ls8tr07",
          "author": "ohhyouknow",
          "body": "The people acting like being poor as a kid makes it okay to hate on people with literal disorders. As if it’s impossible to have both ARFID and be poor. I’d rather just be poor than be poor AND have ARFID.",
          "created_utc": 1729105058.0
        }
      ]
    },
    {
      "id": "lsfhlbu",
      "author": "honeynut_queerio",
      "body": "i decided to go to the original post and i’ve gotten steaming angry…. the amount of absolute HATE masked as “concern” or “oh well one time this person…” is absolutely exhausting to even think about trying to engage with",
      "created_utc": 1729200807.0,
      "score": 1,
      "context": [
        {
          "id": "ls8w9od",
          "author": "NerdyYogaGirl",
          "body": "People are so stupid. I know these comments come from a place of ignorance but I'm so exhausted trying to explain something to people that they could easily understand if they just had an ounce of empathy.",
          "created_utc": 1729105860.0
        }
      ]
    },
    {
      "id": "lsfhqxc",
      "author": "honeynut_queerio",
      "body": "yes! or they use one example to generalize to entire populations of people… the same prejudiced bs",
      "created_utc": 1729200861.0,
      "score": 1,
      "context": [
        {
          "id": "ls99mze",
          "author": "ArtfulAesthetic",
          "body": "the way that they always talk about ppl like this in a hypothetical scenario because they cant recall any people like this in their own lives",
          "created_utc": 1729110089.0
        }
      ]
    },
    {
      "id": "lsc3qox",
      "author": "GaydrianTheRainbow",
      "body": "Right?!",
      "created_utc": 1729155333.0,
      "score": 3,
      "context": [
        {
          "id": "ls9frm6",
          "author": "evilgirlwdevilhorns",
          "body": "“I dont care what someone else chooses to eat it doesn’t affect me! That being said, I actually care a lot, enough to let it affect my mood/feelings on that person! I love to lie!!!!”",
          "created_utc": 1729112020.0
        }
      ]
    },
    {
      "id": "lsfi2a7",
      "author": "honeynut_queerio",
      "body": "i made the mistake of reading some of the comments from the original post :( some people really do lack empathy",
      "created_utc": 1729200971.0,
      "score": 2,
      "context": [
        {
          "id": "lsa3d3e",
          "author": "multicolourfruit",
          "body": "i only managed to get to the 7th pic before i noped out. feels like empathy is non existent nowadays 😕",
          "created_utc": 1729120292.0
        }
      ]
    },
    {
      "id": "ls8y6kv",
      "author": "Desert_Fairy",
      "body": "Don’t worry, you can be a healthy weight and still feel like you could sleep for 24 hours and still be tired.",
      "created_utc": 1729106470.0,
      "score": 25,
      "context": [
        {
          "id": "ls8qvpz",
          "author": "Shykae33",
          "body": "“Why can’t you just be normal and healthy?” \nYOU THINK I DONT WANT TO BE NORMAL?\nDO YOU THINK I ENJOY STARVING MYSELF BECAUSE MY BODY WONT ME SWALLOW ANYTHING?!\n\nThey act like it’s a choice, trust me, if it were a choice I wouldn’t be going 24-48 hrs on 500 calories.",
          "created_utc": 1729104162.0
        },
        {
          "id": "ls8smtx",
          "author": "Delicious_Impress818",
          "body": "THIS. oh my god. I have lost FIFTEEN POUNDS because I barely have any safe foods anymore. I hate looking at old pictures of my body because I look so healthy and I miss it. I miss being able to actually eat and sustain my weight instead of feeling like I could sleep for 24 hours and still be tired smh.",
          "created_utc": 1729104711.0
        }
      ]
    },
    {
      "id": "ls8x33e",
      "author": "ScaryBoyRobots",
      "body": "I'm also fat with ARFID, because I've spent most of my life on a cocktail of medications with weight gain as a symptom. These horrible people would be shocked at how little I actually eat in a day, because I have almost no appetite or interest in food, and I *do* uncontrollably gag and vomit when I eat certain textures or sometimes even just *smell* certain food.",
      "created_utc": 1729106121.0,
      "score": 31,
      "context": [
        {
          "id": "ls8pszb",
          "author": "ScaryBoyRobots",
          "body": "lmao this is the same \"but what about their *health*!!\" bullshit people use to justify bullying fat people. lbr not a single one of them give a shit about anything other than making themselves feel superior at the expense of other people. \"It makes me think less of them,\" give me a break. *I* think less of people who judge others based on superficial assumptions, because none of them know anyone else's medical history, and who are so lacking in emotional depth that they have to lie and pretend they care about the health of people they probably barely know. And if you're judging people you *do* already know and profess to genuinely care about their health, then you're an asshole anyway, because you're not expressing concern, you're just *judging*.\n\nBullying is far more childish than \"being picky\" could ever be.",
          "created_utc": 1729103829.0
        },
        {
          "id": "ls8vn85",
          "author": "BirdsNeedNames",
          "body": "yup, it's exactly the same. as a fat person with arfid, i'm constantly getting this crap spewed at me by people who would legitimately rather see me starve than have to deal with me eating french fries while in their presence.",
          "created_utc": 1729105659.0
        }
      ]
    },
    {
      "id": "ls9f4yk",
      "author": "Darthcookie",
      "body": "Yeah, that guy commenting on a picky eater filling a buffet plate with all sorts of food only to discover they don’t like it and thus waste it is so unrealistic. \n\nI would never do that. Also when I want to try something new I don’t go and fill up a plate or order blindly. I probably annoy people by asking a fuck ton of questions about the dish in question to gauge wether it’s feasible for me to be able to eat it or not. \n\nI also hate wasting food because to me it’s precious. I actually hate it when other people decide for me that I need “variety” and bring me stuff without even asking and assuming I’m just gonna eat whatever out of a sense of obligation or guilt.",
      "created_utc": 1729111821.0,
      "score": 19,
      "context": [
        {
          "id": "ls8qsa6",
          "author": "MaleficentSwan0223",
          "body": "I have a genuine question… do other people waste food? \n\nI have arfid and I cried about throwing 5 chips away last week as I was too full to finish them? My husband said food waste is normal and to not get so upset. I’m the picky eater and the least wasteful one. \n\nAlso when people say ‘you’re not going to live as long’ I feel like saying NO FUCKING SHIT! But if they feel this way I’m happy for them to pay for my treatment. ",
          "created_utc": 1729104132.0
        },
        {
          "id": "ls8whyb",
          "author": "sweeperchick",
          "body": "If anything, I'd imagine picky eaters are less likely to waste food because we're not ordering unknown dishes at restaurants and only eating a few bites before we decide we don't like it. More likely we will pick a \"safe\" food and either eat all of it or gladly take the leftovers home.\n\n\nSame thing at a party, I'm not loading my plate with heaps of foods to try, I'm taking moderate portions of my safe foods.\n\n\nIf I'm at someone's house and they cook, I might take a portion and only eat a few bites to be polite, but most of my family and friends are aware of my food restrictions and don't force that on me, so there's really no waste occurring.",
          "created_utc": 1729105934.0
        }
      ]
    },
    {
      "id": "lsfgn09",
      "author": "honeynut_queerio",
      "body": "absolutely! part of the reason that i really don’t order new things at restaurants (other than, you know, the arfid) is that i don’t want to not tolerate the food and not be able to eat it! i feel awful when this happens. i also hate how grocery stores tend to sell larger quantities (sometimes the “regular” feels large) because i don’t want to buy a big new food thing and then only eat a little bit. it’s easier to try new food when someone else gets it lol bc i’m only going to have a couple of bites even if i like it",
      "created_utc": 1729200481.0,
      "score": 1,
      "context": [
        {
          "id": "ls8qsa6",
          "author": "MaleficentSwan0223",
          "body": "I have a genuine question… do other people waste food? \n\nI have arfid and I cried about throwing 5 chips away last week as I was too full to finish them? My husband said food waste is normal and to not get so upset. I’m the picky eater and the least wasteful one. \n\nAlso when people say ‘you’re not going to live as long’ I feel like saying NO FUCKING SHIT! But if they feel this way I’m happy for them to pay for my treatment. ",
          "created_utc": 1729104132.0
        },
        {
          "id": "ls8whyb",
          "author": "sweeperchick",
          "body": "If anything, I'd imagine picky eaters are less likely to waste food because we're not ordering unknown dishes at restaurants and only eating a few bites before we decide we don't like it. More likely we will pick a \"safe\" food and either eat all of it or gladly take the leftovers home.\n\n\nSame thing at a party, I'm not loading my plate with heaps of foods to try, I'm taking moderate portions of my safe foods.\n\n\nIf I'm at someone's house and they cook, I might take a portion and only eat a few bites to be polite, but most of my family and friends are aware of my food restrictions and don't force that on me, so there's really no waste occurring.",
          "created_utc": 1729105934.0
        }
      ]
    },
    {
      "id": "lsfh1u5",
      "author": "honeynut_queerio",
      "body": "(not the point of your comment but i also only eat the ends of broccoli!! i don’t know anyone else who does it!) it’s great being around chickens and compost bins where i don’t have to worry about this as much",
      "created_utc": 1729200620.0,
      "score": 2,
      "context": [
        {
          "id": "ls8qsa6",
          "author": "MaleficentSwan0223",
          "body": "I have a genuine question… do other people waste food? \n\nI have arfid and I cried about throwing 5 chips away last week as I was too full to finish them? My husband said food waste is normal and to not get so upset. I’m the picky eater and the least wasteful one. \n\nAlso when people say ‘you’re not going to live as long’ I feel like saying NO FUCKING SHIT! But if they feel this way I’m happy for them to pay for my treatment. ",
          "created_utc": 1729104132.0
        },
        {
          "id": "ls97eqc",
          "author": "LemonfishSoda",
          "body": "I unfortunately waste quite a lot - a mix between not eating certain parts of things (the stalks of broccoli, cauliflower and other things, for instance), things turning out not to be what I expected (i.e. unwanted surprises in seemingly safe food items), and some things just plainly not being available in smaller portions (bread, milk, mustard, margarine, jam...).",
          "created_utc": 1729109394.0
        }
      ]
    },
    {
      "id": "ls90ns6",
      "author": "Delicious_Impress818",
      "body": "oh good!! 😫",
      "created_utc": 1729107261.0,
      "score": 11,
      "context": [
        {
          "id": "ls8qvpz",
          "author": "Shykae33",
          "body": "“Why can’t you just be normal and healthy?” \nYOU THINK I DONT WANT TO BE NORMAL?\nDO YOU THINK I ENJOY STARVING MYSELF BECAUSE MY BODY WONT ME SWALLOW ANYTHING?!\n\nThey act like it’s a choice, trust me, if it were a choice I wouldn’t be going 24-48 hrs on 500 calories.",
          "created_utc": 1729104162.0
        },
        {
          "id": "ls8smtx",
          "author": "Delicious_Impress818",
          "body": "THIS. oh my god. I have lost FIFTEEN POUNDS because I barely have any safe foods anymore. I hate looking at old pictures of my body because I look so healthy and I miss it. I miss being able to actually eat and sustain my weight instead of feeling like I could sleep for 24 hours and still be tired smh.",
          "created_utc": 1729104711.0
        },
        {
          "id": "ls8y6kv",
          "author": "Desert_Fairy",
          "body": "Don’t worry, you can be a healthy weight and still feel like you could sleep for 24 hours and still be tired.",
          "created_utc": 1729106470.0
        }
      ]
    },
    {
      "id": "ls961o4",
      "author": "spooky-ufo",
      "body": "omg same. i have always been really skinny, like 110lbs max up until i started a certain medication and now i’m at 180lbs. it’s entirely out of my control and i have to work really hard to lose the weight! it’s not easy when you’re taking meds constantly, that make you gain. it’s bad enough that i’m VERY self conscious of how i look and my weight now…. but to be mean to me because of what i eat/don’t eat?? people are so mean :(",
      "created_utc": 1729108963.0,
      "score": 11,
      "context": [
        {
          "id": "ls8pszb",
          "author": "ScaryBoyRobots",
          "body": "lmao this is the same \"but what about their *health*!!\" bullshit people use to justify bullying fat people. lbr not a single one of them give a shit about anything other than making themselves feel superior at the expense of other people. \"It makes me think less of them,\" give me a break. *I* think less of people who judge others based on superficial assumptions, because none of them know anyone else's medical history, and who are so lacking in emotional depth that they have to lie and pretend they care about the health of people they probably barely know. And if you're judging people you *do* already know and profess to genuinely care about their health, then you're an asshole anyway, because you're not expressing concern, you're just *judging*.\n\nBullying is far more childish than \"being picky\" could ever be.",
          "created_utc": 1729103829.0
        },
        {
          "id": "ls8vn85",
          "author": "BirdsNeedNames",
          "body": "yup, it's exactly the same. as a fat person with arfid, i'm constantly getting this crap spewed at me by people who would legitimately rather see me starve than have to deal with me eating french fries while in their presence.",
          "created_utc": 1729105659.0
        },
        {
          "id": "ls8x33e",
          "author": "ScaryBoyRobots",
          "body": "I'm also fat with ARFID, because I've spent most of my life on a cocktail of medications with weight gain as a symptom. These horrible people would be shocked at how little I actually eat in a day, because I have almost no appetite or interest in food, and I *do* uncontrollably gag and vomit when I eat certain textures or sometimes even just *smell* certain food.",
          "created_utc": 1729106121.0
        }
      ]
    },
    {
      "id": "lsa7gtu",
      "author": "wynterin",
      "body": "The nice thing about buffets imo is you can try tiny amounts of new things and then get more if you do like it, for me it’s a chance to try new things *without* worrying about wasting food",
      "created_utc": 1729121835.0,
      "score": 9,
      "context": [
        {
          "id": "ls8qsa6",
          "author": "MaleficentSwan0223",
          "body": "I have a genuine question… do other people waste food? \n\nI have arfid and I cried about throwing 5 chips away last week as I was too full to finish them? My husband said food waste is normal and to not get so upset. I’m the picky eater and the least wasteful one. \n\nAlso when people say ‘you’re not going to live as long’ I feel like saying NO FUCKING SHIT! But if they feel this way I’m happy for them to pay for my treatment. ",
          "created_utc": 1729104132.0
        },
        {
          "id": "ls8whyb",
          "author": "sweeperchick",
          "body": "If anything, I'd imagine picky eaters are less likely to waste food because we're not ordering unknown dishes at restaurants and only eating a few bites before we decide we don't like it. More likely we will pick a \"safe\" food and either eat all of it or gladly take the leftovers home.\n\n\nSame thing at a party, I'm not loading my plate with heaps of foods to try, I'm taking moderate portions of my safe foods.\n\n\nIf I'm at someone's house and they cook, I might take a portion and only eat a few bites to be polite, but most of my family and friends are aware of my food restrictions and don't force that on me, so there's really no waste occurring.",
          "created_utc": 1729105934.0
        },
        {
          "id": "ls9f4yk",
          "author": "Darthcookie",
          "body": "Yeah, that guy commenting on a picky eater filling a buffet plate with all sorts of food only to discover they don’t like it and thus waste it is so unrealistic. \n\nI would never do that. Also when I want to try something new I don’t go and fill up a plate or order blindly. I probably annoy people by asking a fuck ton of questions about the dish in question to gauge wether it’s feasible for me to be able to eat it or not. \n\nI also hate wasting food because to me it’s precious. I actually hate it when other people decide for me that I need “variety” and bring me stuff without even asking and assuming I’m just gonna eat whatever out of a sense of obligation or guilt.",
          "created_utc": 1729111821.0
        }
      ]
    },
    {
      "id": "lshs4mi",
      "author": "LemonfishSoda",
      "body": "Oh yeah, we do have an organic-waste bin at this house, which was really nice to have after having lived almost 40 years without one. \n\nStill feels bad wasting so much, but it's definitely an improvement to my old adress.",
      "created_utc": 1729236892.0,
      "score": 2,
      "context": [
        {
          "id": "ls8qsa6",
          "author": "MaleficentSwan0223",
          "body": "I have a genuine question… do other people waste food? \n\nI have arfid and I cried about throwing 5 chips away last week as I was too full to finish them? My husband said food waste is normal and to not get so upset. I’m the picky eater and the least wasteful one. \n\nAlso when people say ‘you’re not going to live as long’ I feel like saying NO FUCKING SHIT! But if they feel this way I’m happy for them to pay for my treatment. ",
          "created_utc": 1729104132.0
        },
        {
          "id": "ls97eqc",
          "author": "LemonfishSoda",
          "body": "I unfortunately waste quite a lot - a mix between not eating certain parts of things (the stalks of broccoli, cauliflower and other things, for instance), things turning out not to be what I expected (i.e. unwanted surprises in seemingly safe food items), and some things just plainly not being available in smaller portions (bread, milk, mustard, margarine, jam...).",
          "created_utc": 1729109394.0
        },
        {
          "id": "lsfh1u5",
          "author": "honeynut_queerio",
          "body": "(not the point of your comment but i also only eat the ends of broccoli!! i don’t know anyone else who does it!) it’s great being around chickens and compost bins where i don’t have to worry about this as much",
          "created_utc": 1729200620.0
        }
      ]
    },
    {
      "id": "ls9lp3k",
      "author": "retropillow",
      "body": "Same here except im at 200 now!\n\nPeople tell me I'm lying when I say I don't eat much, that I'm just delusional and making shit up to not lose weight.\n\nThankfully I'm not too self conscious but man",
      "created_utc": 1729113965.0,
      "score": 4,
      "context": [
        {
          "id": "ls8pszb",
          "author": "ScaryBoyRobots",
          "body": "lmao this is the same \"but what about their *health*!!\" bullshit people use to justify bullying fat people. lbr not a single one of them give a shit about anything other than making themselves feel superior at the expense of other people. \"It makes me think less of them,\" give me a break. *I* think less of people who judge others based on superficial assumptions, because none of them know anyone else's medical history, and who are so lacking in emotional depth that they have to lie and pretend they care about the health of people they probably barely know. And if you're judging people you *do* already know and profess to genuinely care about their health, then you're an asshole anyway, because you're not expressing concern, you're just *judging*.\n\nBullying is far more childish than \"being picky\" could ever be.",
          "created_utc": 1729103829.0
        },
        {
          "id": "ls8vn85",
          "author": "BirdsNeedNames",
          "body": "yup, it's exactly the same. as a fat person with arfid, i'm constantly getting this crap spewed at me by people who would legitimately rather see me starve than have to deal with me eating french fries while in their presence.",
          "created_utc": 1729105659.0
        },
        {
          "id": "ls8x33e",
          "author": "ScaryBoyRobots",
          "body": "I'm also fat with ARFID, because I've spent most of my life on a cocktail of medications with weight gain as a symptom. These horrible people would be shocked at how little I actually eat in a day, because I have almost no appetite or interest in food, and I *do* uncontrollably gag and vomit when I eat certain textures or sometimes even just *smell* certain food.",
          "created_utc": 1729106121.0
        },
        {
          "id": "ls961o4",
          "author": "spooky-ufo",
          "body": "omg same. i have always been really skinny, like 110lbs max up until i started a certain medication and now i’m at 180lbs. it’s entirely out of my control and i have to work really hard to lose the weight! it’s not easy when you’re taking meds constantly, that make you gain. it’s bad enough that i’m VERY self conscious of how i look and my weight now…. but to be mean to me because of what i eat/don’t eat?? people are so mean :(",
          "created_utc": 1729108963.0
        }
      ]
    },
    {
      "id": "ls9xtnz",
      "author": "Alarming-Ad4296",
      "body": "Me too!! Is anyone’s med lexapro? I gained 60 pounds on it😀",
      "created_utc": 1729118233.0,
      "score": 2,
      "context": [
        {
          "id": "ls8pszb",
          "author": "ScaryBoyRobots",
          "body": "lmao this is the same \"but what about their *health*!!\" bullshit people use to justify bullying fat people. lbr not a single one of them give a shit about anything other than making themselves feel superior at the expense of other people. \"It makes me think less of them,\" give me a break. *I* think less of people who judge others based on superficial assumptions, because none of them know anyone else's medical history, and who are so lacking in emotional depth that they have to lie and pretend they care about the health of people they probably barely know. And if you're judging people you *do* already know and profess to genuinely care about their health, then you're an asshole anyway, because you're not expressing concern, you're just *judging*.\n\nBullying is far more childish than \"being picky\" could ever be.",
          "created_utc": 1729103829.0
        },
        {
          "id": "ls8vn85",
          "author": "BirdsNeedNames",
          "body": "yup, it's exactly the same. as a fat person with arfid, i'm constantly getting this crap spewed at me by people who would legitimately rather see me starve than have to deal with me eating french fries while in their presence.",
          "created_utc": 1729105659.0
        },
        {
          "id": "ls8x33e",
          "author": "ScaryBoyRobots",
          "body": "I'm also fat with ARFID, because I've spent most of my life on a cocktail of medications with weight gain as a symptom. These horrible people would be shocked at how little I actually eat in a day, because I have almost no appetite or interest in food, and I *do* uncontrollably gag and vomit when I eat certain textures or sometimes even just *smell* certain food.",
          "created_utc": 1729106121.0
        },
        {
          "id": "ls961o4",
          "author": "spooky-ufo",
          "body": "omg same. i have always been really skinny, like 110lbs max up until i started a certain medication and now i’m at 180lbs. it’s entirely out of my control and i have to work really hard to lose the weight! it’s not easy when you’re taking meds constantly, that make you gain. it’s bad enough that i’m VERY self conscious of how i look and my weight now…. but to be mean to me because of what i eat/don’t eat?? people are so mean :(",
          "created_utc": 1729108963.0
        },
        {
          "id": "ls9lp3k",
          "author": "retropillow",
          "body": "Same here except im at 200 now!\n\nPeople tell me I'm lying when I say I don't eat much, that I'm just delusional and making shit up to not lose weight.\n\nThankfully I'm not too self conscious but man",
          "created_utc": 1729113965.0
        }
      ]
    },
    {
      "id": "lsgpjcx",
      "author": "retropillow",
      "body": "you know it bestie!!!! i gained 100 pounds myself (i was very underweight)",
      "created_utc": 1729216973.0,
      "score": 1,
      "context": [
        {
          "id": "ls8pszb",
          "author": "ScaryBoyRobots",
          "body": "lmao this is the same \"but what about their *health*!!\" bullshit people use to justify bullying fat people. lbr not a single one of them give a shit about anything other than making themselves feel superior at the expense of other people. \"It makes me think less of them,\" give me a break. *I* think less of people who judge others based on superficial assumptions, because none of them know anyone else's medical history, and who are so lacking in emotional depth that they have to lie and pretend they care about the health of people they probably barely know. And if you're judging people you *do* already know and profess to genuinely care about their health, then you're an asshole anyway, because you're not expressing concern, you're just *judging*.\n\nBullying is far more childish than \"being picky\" could ever be.",
          "created_utc": 1729103829.0
        },
        {
          "id": "ls8vn85",
          "author": "BirdsNeedNames",
          "body": "yup, it's exactly the same. as a fat person with arfid, i'm constantly getting this crap spewed at me by people who would legitimately rather see me starve than have to deal with me eating french fries while in their presence.",
          "created_utc": 1729105659.0
        },
        {
          "id": "ls8x33e",
          "author": "ScaryBoyRobots",
          "body": "I'm also fat with ARFID, because I've spent most of my life on a cocktail of medications with weight gain as a symptom. These horrible people would be shocked at how little I actually eat in a day, because I have almost no appetite or interest in food, and I *do* uncontrollably gag and vomit when I eat certain textures or sometimes even just *smell* certain food.",
          "created_utc": 1729106121.0
        },
        {
          "id": "ls961o4",
          "author": "spooky-ufo",
          "body": "omg same. i have always been really skinny, like 110lbs max up until i started a certain medication and now i’m at 180lbs. it’s entirely out of my control and i have to work really hard to lose the weight! it’s not easy when you’re taking meds constantly, that make you gain. it’s bad enough that i’m VERY self conscious of how i look and my weight now…. but to be mean to me because of what i eat/don’t eat?? people are so mean :(",
          "created_utc": 1729108963.0
        },
        {
          "id": "ls9lp3k",
          "author": "retropillow",
          "body": "Same here except im at 200 now!\n\nPeople tell me I'm lying when I say I don't eat much, that I'm just delusional and making shit up to not lose weight.\n\nThankfully I'm not too self conscious but man",
          "created_utc": 1729113965.0
        },
        {
          "id": "ls9xtnz",
          "author": "Alarming-Ad4296",
          "body": "Me too!! Is anyone’s med lexapro? I gained 60 pounds on it😀",
          "created_utc": 1729118233.0
        }
      ]
    }
  ]
}