{
  "id": "1g8fr8q",
  "subreddit": "ARFID",
  "author": "SarahL1990",
  "created_utc": 1729478565.0,
  "title": "People really don't like it when people are different",
  "selftext": "Getting downvoted and called childish when trying to educate people about ARFID...",
  "url": "https://i.redd.it/zzixraspv0wd1.png",
  "score": 291,
  "num_comments": 53,
  "comments": [
    {
      "id": "lsy81sp",
      "author": "CorporateSharkbait",
      "body": "This is why I don’t try new foods in front of people. I have a gag issue that happens even if I don’t dislike the food I’m trying. I’ve straight plopped food in my mouth if encouraged to try it and the person offering got extremely offended when I gagged. It fucking sucks",
      "created_utc": 1729479889.0,
      "score": 188,
      "context": []
    },
    {
      "id": "lsyewso",
      "author": "oddistrange",
      "body": "I like how they mention saying \"No thanks\" as not being rude when some people will find that just as rude. Or they'll just completely ignore your \"No thanks\" and keep pestering and pressuring you to try it which makes me not want to try it even more.",
      "created_utc": 1729482798.0,
      "score": 81,
      "context": []
    },
    {
      "id": "lsy6c3i",
      "author": "emptyhellebore",
      "body": "Just skimming right over that involuntary thing, I see.  You’re trying.  At times when I get in similar exchanges, I try to remember that it’s okay if the person I’m disagreeing with doesn’t get it.  If one person who didn’t know what ARFID is sees the comment and learns and is a bit kinder in the future, you’ve done well.  \n\nYou did well.",
      "created_utc": 1729479211.0,
      "score": 80,
      "context": []
    },
    {
      "id": "lsybw4i",
      "author": "littleghool",
      "body": "I will never understand why people care about what other people eat. Unless it's some weird shit like raw alligator, it's completely meaningless. WHY CANT WE EAT THE THINGS WE LIKE",
      "created_utc": 1729481465.0,
      "score": 63,
      "context": []
    },
    {
      "id": "lsyi1ta",
      "author": "R0da",
      "body": "Lmao \"no thanks is a whole sentence\" like people don't immediately start getting super weird at you when you turn down food",
      "created_utc": 1729484332.0,
      "score": 52,
      "context": []
    },
    {
      "id": "lsycoes",
      "author": "listlessgod",
      "body": "Sadly people are just ignorant. My mother forced me eat something I didn’t like as a kid and I literally threw up at the table. Like tell me I did that on purpose I DARE U. But I do understand someone being offended at someone not liking their food. Not enough to be angry about it, but I can understand if they feel hurt. I don’t eat other people’s cooking or eat around other people because I can’t tolerate it. I can’t trust food I didn’t see get prepared and would need to investigate it first. I have gagged just watching other people eat food I don’t like and I can imagine that would be very offensive to people LOL. It’s kinda sad always eating alone when I think about it but I’m more comfortable this way and others would be more comfortable that way too.",
      "created_utc": 1729481801.0,
      "score": 23,
      "context": []
    },
    {
      "id": "lsyh320",
      "author": "throwawaypatien",
      "body": "People hate things they don't understand. \n\nI've had someone tell me a few times whenever I made faces trying a new food \"You're acting as if we're poisoning you!\"\n\nAs far as I'm concerned, you are!",
      "created_utc": 1729483851.0,
      "score": 19,
      "context": []
    },
    {
      "id": "lsy6f7b",
      "author": "Sweetybancha222",
      "body": "There’s no point of educating those who won’t listen sadly, in fact people just find dumb reasons to just hate on other people no matter how stupid they are",
      "created_utc": 1729479245.0,
      "score": 17,
      "context": []
    },
    {
      "id": "lsymh4z",
      "author": "imdestroylonely",
      "body": "i have adhd and i’m always high so my facial expressions are always EXTRA AS FUCKKK , so even if i did i wouldn’t even notice. people are so so miserable and dreadful to spread hate the way they do. sorry other people’s eating habits bother YOU, that makes YOU childish definitely not those with different eating habits😭",
      "created_utc": 1729486659.0,
      "score": 10,
      "context": []
    },
    {
      "id": "lsymjwy",
      "author": "ControlOk8832",
      "body": "There is a logical reason. Our brains are literally hard wired to do that, it’s the same as when you get hit in the face and recoil from it in pain",
      "created_utc": 1729486702.0,
      "score": 7,
      "context": []
    },
    {
      "id": "lszbez2",
      "author": "Spacemanspiff78",
      "body": "So not only am I obligated to try a food, but also be judged on my reaction based on acceptable facial expression parameters? Lol get fucked",
      "created_utc": 1729503155.0,
      "score": 9,
      "context": []
    },
    {
      "id": "lsykx5c",
      "author": "Mustard-cutt-r",
      "body": "Just explain to them that every time you put food in your mouth you want to barf.",
      "created_utc": 1729485819.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lt0wf98",
      "author": "thereaintshitcaptain",
      "body": "Do people not realize we can smell it, see it, and feel it BEFORE we taste it? Any one of those can be a trigger even without trying the food",
      "created_utc": 1729526884.0,
      "score": 7,
      "context": []
    },
    {
      "id": "lsz22bo",
      "author": "Culvingg",
      "body": "I fucking hate foodies",
      "created_utc": 1729496521.0,
      "score": 11,
      "context": []
    },
    {
      "id": "lszo45s",
      "author": "pendigedig",
      "body": "i went and helped the vote ratio lol",
      "created_utc": 1729510691.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lsye8ud",
      "author": "SachiKaM",
      "body": "How did you take a screen shot this long?",
      "created_utc": 1729482489.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lsz3hko",
      "author": "None",
      "body": "I hope those people lose the ability to do they cannot control. See how they like it. People like this is why I hate the world",
      "created_utc": 1729497524.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lt03ijj",
      "author": "se7entythree",
      "body": "I wouldn’t have expected any different reaction from the OP given it’s posted in the pet peeves sub",
      "created_utc": 1729517268.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lt17bp1",
      "author": "overduedevil",
      "body": "“there’s no logical reason to do that” my brother in christ it’s an involuntary instinctual response. i do it sometimes when i have a safe food that i LOVE right in front of me because i literally just cannot control it.",
      "created_utc": 1729530243.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lsz9epm",
      "author": "goldfishmuncher",
      "body": "these people are nuts. i totally understand!",
      "created_utc": 1729501741.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lt0c77n",
      "author": "Affectionate-Stay-51",
      "body": "This makes me so mad - have some empathy with humans in general… some people are for a reason not comfortable to be around and for that reason it’s also valid to not enjoy spending time in public eating for so many people. What’s even more hilarious- from that one bit one can taste and feel a lot of things. Even just from checking it out. As said. Empathy please",
      "created_utc": 1729520370.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lt0emnb",
      "author": "Angelangepange",
      "body": "I have learned to recognise flavours and textures without trying foods and I do say no thanks and I try to keep as straight as possible face but guess what they still usually get offended. \"How could you know if you don't try\" over and over again. People's ego is so fragile.",
      "created_utc": 1729521187.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lt0noj3",
      "author": "paradigm_mgmt",
      "body": "i will gag or not be able to swallow 🤷🏼 i always keep a disposable napkin near me and eject the food immediately to avoid further issues ... i generally don't eat around people that can't handle that 🫤😒",
      "created_utc": 1729524127.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lt1gbmv",
      "author": "Pringlesthief",
      "body": "That dude better eat an entire lemon without pulling any expression, that'd be childish as hell and he would have no reason to do so, right?",
      "created_utc": 1729532996.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lt2py6d",
      "author": "SoftAffectionate591",
      "body": "It’s really weird and sad. I love learning about people who are different from me - in any way! Most seem afraid to leave their bubbles and it tends to render them close minded.",
      "created_utc": 1729546924.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lt78888",
      "author": "None",
      "body": "Ever since being diagnosed with ARFID it has been so nice that I can say \"oh sorry I have a condition\" when people offer me food. So far nobody has questioned it, makes me so much less afraid to eat with other people.",
      "created_utc": 1729616726.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lt8yuis",
      "author": "TormentaElectronica",
      "body": "“Tell me you’re neurotypical without telling me” 😂",
      "created_utc": 1729636265.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ltcddil",
      "author": "huntresswizard_",
      "body": "Man, I used to gag and full on throw up at the sight of food, and definitely the smell. I’ve been so stressed out over having to be near food (or just eat, let’s be real) around other people, that it’s reduced me to tears. None of that is logical or makes sense to people that don’t have compassion or empathy. \nAnd people like this wad in your post will never understand unless they have to deal with it personally, either themselves or someone they love dearly. Until then, they’ll continue to live their lives thinking they’re superior and those of us with debilitating eating disorders are just being dramatic and rude. Honestly it used to bother me, but I’ve lived enough years to just feel pity for the small minded folk among us. They have such fragile egos for someone else’s choices to offend them. It’s not an enviable existence.",
      "created_utc": 1729692312.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ltirtky",
      "author": "xThyQueen",
      "body": "I can't help it. If it's too sweet or sour or anything too much I make a sour face. Even if I like it I look like I don't. I tend to not eat new things in front of people cause of it. I have ARFID and autism so if someone asks I just say no idk how my tummy will respond which is true cause textures and over stimulation in food is w thing for me.",
      "created_utc": 1729781638.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ltljiqd",
      "author": "Jazzlike_Elderberry9",
      "body": "how about i spit it onto their face instead",
      "created_utc": 1729812499.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lt0u2dy",
      "author": "None",
      "body": "You didn’t need to make that comment. Arfid doesn’t make you make faces like that and cringe to bite on something. Like you’d never be in that situation unless op would be a partner you live with. At that point don’t be with someone who doesn’t understand.\n\nBut randomly out and about? If you can’t control your face to a stranger wanting you to taste food or can’t politely decline a sample to save grace- you’re the rude one.",
      "created_utc": 1729526145.0,
      "score": 0,
      "context": []
    },
    {
      "id": "lsyda82",
      "author": "venomous_sheep",
      "body": "i get it even when eating food i know i like but am not 100% comfortable with yet! i’ve recently discovered i like certain soups, but i can’t help but gag a little because i’m not used to eating warm liquids with solids in them. i hate the way people take so much offense to reactions that are very clearly involuntary.",
      "created_utc": 1729482061.0,
      "score": 47,
      "context": [
        {
          "id": "lsy81sp",
          "author": "CorporateSharkbait",
          "body": "This is why I don’t try new foods in front of people. I have a gag issue that happens even if I don’t dislike the food I’m trying. I’ve straight plopped food in my mouth if encouraged to try it and the person offering got extremely offended when I gagged. It fucking sucks",
          "created_utc": 1729479889.0
        }
      ]
    },
    {
      "id": "lsz043v",
      "author": "Scorpiodancer123",
      "body": "100% this. I gag and can't control my face. No chance I'm doing that in public. When I'm trying something new I have to take teeny tiny bites, the size people would probably laugh at and probably find it insulting. It absolutely sucks and I wish people would understand that literally no-one chooses to be this way.",
      "created_utc": 1729495159.0,
      "score": 17,
      "context": [
        {
          "id": "lsy81sp",
          "author": "CorporateSharkbait",
          "body": "This is why I don’t try new foods in front of people. I have a gag issue that happens even if I don’t dislike the food I’m trying. I’ve straight plopped food in my mouth if encouraged to try it and the person offering got extremely offended when I gagged. It fucking sucks",
          "created_utc": 1729479889.0
        }
      ]
    },
    {
      "id": "lt11xhq",
      "author": "subgutz",
      "body": "one time my mom took me and my brother to get breakfast and i got these pancakes with strawberry syrup and strawberries on top. the fruit itself was really mushy and i gagged so hard the food came back out and onto the plate. thankfully nobody (at least at my table) saw but i was so embarrassed 😭 it was a horrible feeling both mentally and physically, it’s like my body detected a poison and needed it out ASAP",
      "created_utc": 1729528602.0,
      "score": 5,
      "context": [
        {
          "id": "lsy81sp",
          "author": "CorporateSharkbait",
          "body": "This is why I don’t try new foods in front of people. I have a gag issue that happens even if I don’t dislike the food I’m trying. I’ve straight plopped food in my mouth if encouraged to try it and the person offering got extremely offended when I gagged. It fucking sucks",
          "created_utc": 1729479889.0
        }
      ]
    },
    {
      "id": "lsz3ahn",
      "author": "hubblebubblen",
      "body": "I also have the gaging issue (even when I like the taste), drinking something to down it really helps as long as it’s a safe drink. Not sure if it makes it less noticeable though or if everyone around me just gets too awkward to comment on it lol",
      "created_utc": 1729497385.0,
      "score": 5,
      "context": [
        {
          "id": "lsy81sp",
          "author": "CorporateSharkbait",
          "body": "This is why I don’t try new foods in front of people. I have a gag issue that happens even if I don’t dislike the food I’m trying. I’ve straight plopped food in my mouth if encouraged to try it and the person offering got extremely offended when I gagged. It fucking sucks",
          "created_utc": 1729479889.0
        }
      ]
    },
    {
      "id": "lsyxtm1",
      "author": "Moosycakes",
      "body": "Yeah it can be really embarrassing and feels really shameful. I even have problems sometimes in the supermarket just looking at packets of things that trigger my disgust reaction. It’s embarrass to gag and have a huge public reaction just from seeing the wrong flavour of chips. I can usually hold back my reaction but it gets very hard if I have other vulnerabilities like being tired or sick or too hot.",
      "created_utc": 1729493604.0,
      "score": 4,
      "context": [
        {
          "id": "lsy81sp",
          "author": "CorporateSharkbait",
          "body": "This is why I don’t try new foods in front of people. I have a gag issue that happens even if I don’t dislike the food I’m trying. I’ve straight plopped food in my mouth if encouraged to try it and the person offering got extremely offended when I gagged. It fucking sucks",
          "created_utc": 1729479889.0
        }
      ]
    },
    {
      "id": "lt120t8",
      "author": "subgutz",
      "body": "one time my mom took me and my brother to get breakfast and i got these pancakes with strawberry syrup and strawberries on top. the fruit itself was really mushy and i gagged so hard the food came back out and onto the plate. thankfully nobody (at least at my table) saw but i was so embarrassed 😭 it was a horrible feeling both mentally and physically, it’s like my body detected a poison and needed it out ASAP",
      "created_utc": 1729528631.0,
      "score": 0,
      "context": [
        {
          "id": "lsy81sp",
          "author": "CorporateSharkbait",
          "body": "This is why I don’t try new foods in front of people. I have a gag issue that happens even if I don’t dislike the food I’m trying. I’ve straight plopped food in my mouth if encouraged to try it and the person offering got extremely offended when I gagged. It fucking sucks",
          "created_utc": 1729479889.0
        }
      ]
    },
    {
      "id": "lszy73g",
      "author": "LilRedHead101",
      "body": "I was thinking something similar. Most people would gag if they had to eat alligator meat. I believe some people eat that in the south? Rare minority but still…",
      "created_utc": 1729515199.0,
      "score": 11,
      "context": [
        {
          "id": "lsybw4i",
          "author": "littleghool",
          "body": "I will never understand why people care about what other people eat. Unless it's some weird shit like raw alligator, it's completely meaningless. WHY CANT WE EAT THE THINGS WE LIKE",
          "created_utc": 1729481465.0
        }
      ]
    },
    {
      "id": "lt0wksf",
      "author": "thereaintshitcaptain",
      "body": "\"No seriously, just try it. Come onnn. Just try it, it won't bite. Wow, whatever, you're no fun.\"",
      "created_utc": 1729526933.0,
      "score": 27,
      "context": [
        {
          "id": "lsyi1ta",
          "author": "R0da",
          "body": "Lmao \"no thanks is a whole sentence\" like people don't immediately start getting super weird at you when you turn down food",
          "created_utc": 1729484332.0
        }
      ]
    },
    {
      "id": "lsyfej4",
      "author": "oddistrange",
      "body": "I think most phones give you an option after you screenshot to continue scrolling down the page. \n\nOn my Google Pixel after a screenshot a button pops up that says \"Capture more\" and I can choose how much of the page I want to screenshot, on my Samsung it would just scroll down slowly automatically until I stopped it. I hope this sorta makes sense lol.",
      "created_utc": 1729483031.0,
      "score": 7,
      "context": [
        {
          "id": "lsye8ud",
          "author": "SachiKaM",
          "body": "How did you take a screen shot this long?",
          "created_utc": 1729482489.0
        }
      ]
    },
    {
      "id": "lt03mo1",
      "author": "SarahL1990",
      "body": "It wasn't even the OP who was commenting.",
      "created_utc": 1729517311.0,
      "score": 0,
      "context": [
        {
          "id": "lt03ijj",
          "author": "se7entythree",
          "body": "I wouldn’t have expected any different reaction from the OP given it’s posted in the pet peeves sub",
          "created_utc": 1729517268.0
        }
      ]
    },
    {
      "id": "lt0w2pa",
      "author": "SarahL1990",
      "body": "I made the comment to provide an example of why someone might *instinctively* and *involuntarily* pull a face when offered food. \n\nWhy is it considered rudeness to instinctively pull a face and go \"ugh no\".",
      "created_utc": 1729526776.0,
      "score": 4,
      "context": [
        {
          "id": "lt0u2dy",
          "author": "None",
          "body": "You didn’t need to make that comment. Arfid doesn’t make you make faces like that and cringe to bite on something. Like you’d never be in that situation unless op would be a partner you live with. At that point don’t be with someone who doesn’t understand.\n\nBut randomly out and about? If you can’t control your face to a stranger wanting you to taste food or can’t politely decline a sample to save grace- you’re the rude one.",
          "created_utc": 1729526145.0
        }
      ]
    },
    {
      "id": "lt19hwo",
      "author": "overduedevil",
      "body": "arfid does in fact make me make faces and cringe involuntarily. i do it even with food i DO like. please do not sit here and say something definitively about a disorder just because YOU don’t personally experience it.",
      "created_utc": 1729530913.0,
      "score": 2,
      "context": [
        {
          "id": "lt0u2dy",
          "author": "None",
          "body": "You didn’t need to make that comment. Arfid doesn’t make you make faces like that and cringe to bite on something. Like you’d never be in that situation unless op would be a partner you live with. At that point don’t be with someone who doesn’t understand.\n\nBut randomly out and about? If you can’t control your face to a stranger wanting you to taste food or can’t politely decline a sample to save grace- you’re the rude one.",
          "created_utc": 1729526145.0
        }
      ]
    },
    {
      "id": "lsyds6d",
      "author": "CorporateSharkbait",
      "body": "I also get this way with soups! Sometimes I’ll have a random craving for things I don’t generally like but I’ll jump on it when it happens since that’s the best way to get used to foods more. I wish we had more control over it as for me it does slowly go away but it’s still embarrassing as heck",
      "created_utc": 1729482281.0,
      "score": 10,
      "context": [
        {
          "id": "lsy81sp",
          "author": "CorporateSharkbait",
          "body": "This is why I don’t try new foods in front of people. I have a gag issue that happens even if I don’t dislike the food I’m trying. I’ve straight plopped food in my mouth if encouraged to try it and the person offering got extremely offended when I gagged. It fucking sucks",
          "created_utc": 1729479889.0
        },
        {
          "id": "lsyda82",
          "author": "venomous_sheep",
          "body": "i get it even when eating food i know i like but am not 100% comfortable with yet! i’ve recently discovered i like certain soups, but i can’t help but gag a little because i’m not used to eating warm liquids with solids in them. i hate the way people take so much offense to reactions that are very clearly involuntary.",
          "created_utc": 1729482061.0
        }
      ]
    },
    {
      "id": "lt22p8v",
      "author": "LikesBreakfast",
      "body": "I've had it. It tastes and feels like chicken that's a little chewier than normal.\n\nEDIT: FWIW, my wife with ARFID didn't like it, but didn't outright reject it or gag.",
      "created_utc": 1729539883.0,
      "score": 5,
      "context": [
        {
          "id": "lsybw4i",
          "author": "littleghool",
          "body": "I will never understand why people care about what other people eat. Unless it's some weird shit like raw alligator, it's completely meaningless. WHY CANT WE EAT THE THINGS WE LIKE",
          "created_utc": 1729481465.0
        },
        {
          "id": "lszy73g",
          "author": "LilRedHead101",
          "body": "I was thinking something similar. Most people would gag if they had to eat alligator meat. I believe some people eat that in the south? Rare minority but still…",
          "created_utc": 1729515199.0
        }
      ]
    },
    {
      "id": "ltcdwaz",
      "author": "huntresswizard_",
      "body": "I feel like this is a buried memory pulled straight out of my brain. Right down to the “you’re no fun” bit 🤣",
      "created_utc": 1729692490.0,
      "score": 3,
      "context": [
        {
          "id": "lsyi1ta",
          "author": "R0da",
          "body": "Lmao \"no thanks is a whole sentence\" like people don't immediately start getting super weird at you when you turn down food",
          "created_utc": 1729484332.0
        },
        {
          "id": "lt0wksf",
          "author": "thereaintshitcaptain",
          "body": "\"No seriously, just try it. Come onnn. Just try it, it won't bite. Wow, whatever, you're no fun.\"",
          "created_utc": 1729526933.0
        }
      ]
    },
    {
      "id": "lt04w97",
      "author": "se7entythree",
      "body": "Well, given that it’s posted in the pet peeves sub. It’s just going to be full of people who are also annoyed by that particular behavior.",
      "created_utc": 1729517787.0,
      "score": 2,
      "context": [
        {
          "id": "lt03ijj",
          "author": "se7entythree",
          "body": "I wouldn’t have expected any different reaction from the OP given it’s posted in the pet peeves sub",
          "created_utc": 1729517268.0
        },
        {
          "id": "lt03mo1",
          "author": "SarahL1990",
          "body": "It wasn't even the OP who was commenting.",
          "created_utc": 1729517311.0
        }
      ]
    },
    {
      "id": "lt1pqve",
      "author": "None",
      "body": "Sucks to suck not every case of arfid does.\nHad it all my life and I understand and can control display rules. Work in therapy more idk man",
      "created_utc": 1729535911.0,
      "score": 1,
      "context": [
        {
          "id": "lt0u2dy",
          "author": "None",
          "body": "You didn’t need to make that comment. Arfid doesn’t make you make faces like that and cringe to bite on something. Like you’d never be in that situation unless op would be a partner you live with. At that point don’t be with someone who doesn’t understand.\n\nBut randomly out and about? If you can’t control your face to a stranger wanting you to taste food or can’t politely decline a sample to save grace- you’re the rude one.",
          "created_utc": 1729526145.0
        },
        {
          "id": "lt19hwo",
          "author": "overduedevil",
          "body": "arfid does in fact make me make faces and cringe involuntarily. i do it even with food i DO like. please do not sit here and say something definitively about a disorder just because YOU don’t personally experience it.",
          "created_utc": 1729530913.0
        }
      ]
    },
    {
      "id": "lt1q046",
      "author": "overduedevil",
      "body": "that’s exactly what i’m trying to say, not every case of arfid presents like you’re assuming. you made a general statement that arfid doesn’t cause it at all. but that’s simply not true for everyone. you don’t have to be so rude towards people who are struggling, i just spent two and a half months in a hospitalization program for this shit, you don’t know what i’ve worked on in therapy. have the day you deserve.",
      "created_utc": 1729535989.0,
      "score": 1,
      "context": [
        {
          "id": "lt0u2dy",
          "author": "None",
          "body": "You didn’t need to make that comment. Arfid doesn’t make you make faces like that and cringe to bite on something. Like you’d never be in that situation unless op would be a partner you live with. At that point don’t be with someone who doesn’t understand.\n\nBut randomly out and about? If you can’t control your face to a stranger wanting you to taste food or can’t politely decline a sample to save grace- you’re the rude one.",
          "created_utc": 1729526145.0
        },
        {
          "id": "lt19hwo",
          "author": "overduedevil",
          "body": "arfid does in fact make me make faces and cringe involuntarily. i do it even with food i DO like. please do not sit here and say something definitively about a disorder just because YOU don’t personally experience it.",
          "created_utc": 1729530913.0
        },
        {
          "id": "lt1pqve",
          "author": "None",
          "body": "Sucks to suck not every case of arfid does.\nHad it all my life and I understand and can control display rules. Work in therapy more idk man",
          "created_utc": 1729535911.0
        }
      ]
    },
    {
      "id": "lt1q65e",
      "author": "overduedevil",
      "body": "“i understand and can control display rules” congrats!!! not everyone has your abilities!!!!! get off the fucking pedestal",
      "created_utc": 1729536042.0,
      "score": 1,
      "context": [
        {
          "id": "lt0u2dy",
          "author": "None",
          "body": "You didn’t need to make that comment. Arfid doesn’t make you make faces like that and cringe to bite on something. Like you’d never be in that situation unless op would be a partner you live with. At that point don’t be with someone who doesn’t understand.\n\nBut randomly out and about? If you can’t control your face to a stranger wanting you to taste food or can’t politely decline a sample to save grace- you’re the rude one.",
          "created_utc": 1729526145.0
        },
        {
          "id": "lt19hwo",
          "author": "overduedevil",
          "body": "arfid does in fact make me make faces and cringe involuntarily. i do it even with food i DO like. please do not sit here and say something definitively about a disorder just because YOU don’t personally experience it.",
          "created_utc": 1729530913.0
        },
        {
          "id": "lt1pqve",
          "author": "None",
          "body": "Sucks to suck not every case of arfid does.\nHad it all my life and I understand and can control display rules. Work in therapy more idk man",
          "created_utc": 1729535911.0
        }
      ]
    },
    {
      "id": "lt1rbwv",
      "author": "None",
      "body": "Please stop crying",
      "created_utc": 1729536398.0,
      "score": -1,
      "context": [
        {
          "id": "lt0u2dy",
          "author": "None",
          "body": "You didn’t need to make that comment. Arfid doesn’t make you make faces like that and cringe to bite on something. Like you’d never be in that situation unless op would be a partner you live with. At that point don’t be with someone who doesn’t understand.\n\nBut randomly out and about? If you can’t control your face to a stranger wanting you to taste food or can’t politely decline a sample to save grace- you’re the rude one.",
          "created_utc": 1729526145.0
        },
        {
          "id": "lt19hwo",
          "author": "overduedevil",
          "body": "arfid does in fact make me make faces and cringe involuntarily. i do it even with food i DO like. please do not sit here and say something definitively about a disorder just because YOU don’t personally experience it.",
          "created_utc": 1729530913.0
        },
        {
          "id": "lt1pqve",
          "author": "None",
          "body": "Sucks to suck not every case of arfid does.\nHad it all my life and I understand and can control display rules. Work in therapy more idk man",
          "created_utc": 1729535911.0
        },
        {
          "id": "lt1q65e",
          "author": "overduedevil",
          "body": "“i understand and can control display rules” congrats!!! not everyone has your abilities!!!!! get off the fucking pedestal",
          "created_utc": 1729536042.0
        }
      ]
    },
    {
      "id": "lt1rl6w",
      "author": "overduedevil",
      "body": "only when you stop thinking you’re better than people who have a more severe case of a disorder than you 🥰🥰😘",
      "created_utc": 1729536478.0,
      "score": 2,
      "context": [
        {
          "id": "lt0u2dy",
          "author": "None",
          "body": "You didn’t need to make that comment. Arfid doesn’t make you make faces like that and cringe to bite on something. Like you’d never be in that situation unless op would be a partner you live with. At that point don’t be with someone who doesn’t understand.\n\nBut randomly out and about? If you can’t control your face to a stranger wanting you to taste food or can’t politely decline a sample to save grace- you’re the rude one.",
          "created_utc": 1729526145.0
        },
        {
          "id": "lt19hwo",
          "author": "overduedevil",
          "body": "arfid does in fact make me make faces and cringe involuntarily. i do it even with food i DO like. please do not sit here and say something definitively about a disorder just because YOU don’t personally experience it.",
          "created_utc": 1729530913.0
        },
        {
          "id": "lt1pqve",
          "author": "None",
          "body": "Sucks to suck not every case of arfid does.\nHad it all my life and I understand and can control display rules. Work in therapy more idk man",
          "created_utc": 1729535911.0
        },
        {
          "id": "lt1q65e",
          "author": "overduedevil",
          "body": "“i understand and can control display rules” congrats!!! not everyone has your abilities!!!!! get off the fucking pedestal",
          "created_utc": 1729536042.0
        },
        {
          "id": "lt1rbwv",
          "author": "None",
          "body": "Please stop crying",
          "created_utc": 1729536398.0
        }
      ]
    },
    {
      "id": "lt24mvh",
      "author": "None",
      "body": "No one said or thought I was better. I’m just not a baby and can control my face or turn down an item I’m trying. It’s not about the arfid girl once again. That’s a personal issue you gotta tackle mentally. ITS NOT ARFID",
      "created_utc": 1729540469.0,
      "score": 0,
      "context": [
        {
          "id": "lt0u2dy",
          "author": "None",
          "body": "You didn’t need to make that comment. Arfid doesn’t make you make faces like that and cringe to bite on something. Like you’d never be in that situation unless op would be a partner you live with. At that point don’t be with someone who doesn’t understand.\n\nBut randomly out and about? If you can’t control your face to a stranger wanting you to taste food or can’t politely decline a sample to save grace- you’re the rude one.",
          "created_utc": 1729526145.0
        },
        {
          "id": "lt19hwo",
          "author": "overduedevil",
          "body": "arfid does in fact make me make faces and cringe involuntarily. i do it even with food i DO like. please do not sit here and say something definitively about a disorder just because YOU don’t personally experience it.",
          "created_utc": 1729530913.0
        },
        {
          "id": "lt1pqve",
          "author": "None",
          "body": "Sucks to suck not every case of arfid does.\nHad it all my life and I understand and can control display rules. Work in therapy more idk man",
          "created_utc": 1729535911.0
        },
        {
          "id": "lt1q65e",
          "author": "overduedevil",
          "body": "“i understand and can control display rules” congrats!!! not everyone has your abilities!!!!! get off the fucking pedestal",
          "created_utc": 1729536042.0
        },
        {
          "id": "lt1rbwv",
          "author": "None",
          "body": "Please stop crying",
          "created_utc": 1729536398.0
        },
        {
          "id": "lt1rl6w",
          "author": "overduedevil",
          "body": "only when you stop thinking you’re better than people who have a more severe case of a disorder than you 🥰🥰😘",
          "created_utc": 1729536478.0
        }
      ]
    }
  ]
}