{
  "id": "1g8yi86",
  "subreddit": "ARFID",
  "author": "Baring-My-Heart",
  "created_utc": 1729539140.0,
  "title": "Is anyone else “comfortable” with their ARFID?",
  "selftext": "I don’t know how else to phrase it, but while I’m bothered by the fact that my palette is so small and not diverse, I don’t feel the need to go out of my way to try new things. I’m rarely interested in trying new foods, since I know how scary/unnerving it can be. I just prefer the status quo. ",
  "url": "https://www.reddit.com/r/ARFID/comments/1g8yi86/is_anyone_else_comfortable_with_their_arfid/",
  "score": 115,
  "num_comments": 49,
  "comments": [
    {
      "id": "lt2c52y",
      "author": "luminousfloret",
      "body": "I 100% am. I’m healthy, at the perfect weight for my height and if I start not eating due to stress/food disgust I drink ensure which keeps me healthy. \n\nI don’t care what people think about my eating habits and have amazing people in my life who don’t judge me at all. \n\nI don’t force myself to try new foods, if it happens it happens. I’m not going to live miserably because I have an eating disorder.",
      "created_utc": 1729542742.0,
      "score": 70,
      "context": []
    },
    {
      "id": "lt2ue64",
      "author": "KirbysLeftBigToe",
      "body": "Yes. Mine is due to my sensory issues I was born with so “recovery” isn’t an idea that works for me. This is my life and as long as I keep my needs in mind (in terms of being comfortable and maintaining my health) and have empathetic people around who respect me I generally do just fine.",
      "created_utc": 1729548435.0,
      "score": 35,
      "context": []
    },
    {
      "id": "lt2ep47",
      "author": "Idkhow_dude",
      "body": "There are moments I feel like this but then I’m brutally reminded by all my health complications that I can’t keep eating like this for the rest of my life. I wouldn’t say I feel comfortable with it but rather I feel unmotivated to branch out and find comfort in sticking to what I find safe. I was a ‘failure to thrive’ kid and it ended up stunting my height but despite how angry that makes me I’m still too stubborn to change.",
      "created_utc": 1729543490.0,
      "score": 20,
      "context": []
    },
    {
      "id": "lt2vmer",
      "author": "Brilliant-Bowl6745",
      "body": "I am older and neurodivergent and also live on my own, and I am at peace with my Arfid. I am fortunate that I have a few vegetables and fruits in my rotation of safe foods and my nutritional needs are met. It is a bit difficult when I am at a party or asked out for dinner but I worry about it less and less.",
      "created_utc": 1729548862.0,
      "score": 12,
      "context": []
    },
    {
      "id": "lt3jc6s",
      "author": "Fun_Intention_5371",
      "body": "Omg same. \n\nAlso definitely dont make me try food in front of people. It's gonna go badly",
      "created_utc": 1729557416.0,
      "score": 8,
      "context": []
    },
    {
      "id": "lt26siu",
      "author": "Kittencab00dles",
      "body": "If your nutrition needs are being met, I understand the feeling, but the danger comes in with the idea someday the foods you accept will further restrict. So yes, I do understand feeling comfortable and wanting to just accept that, but (reasonably speaking) what makes us uncomfortable is usually where our weakness lies and what we should put some effort into. IMO, if you are healthy currently, it would honestly be a good time to just try a little branching out. Ideally you’ll be pleasantly surprised and find some new stuff you enjoy, and long term it would absolutely be a safety net in case stuff you currently like shifts out of your favor. Don’t overwhelm yourself, maybe even a goal of one new bite a month. As my recent therapy has shown me too, it does help my self esteem and mental health a lot when I push myself gently to keep tackling challenges.",
      "created_utc": 1729541122.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lt2qsmi",
      "author": "Ky3031",
      "body": "I get it. I’m not as ashamed of it as I use to be, and I don’t put up with people commenting on it anymore either. My old roommate always tried to comment on my eating habits and I shot that down so quickly. \n\nIt’s no one else’s business. I eat way more than I use to as a kid and that’s a win for me.",
      "created_utc": 1729547205.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lt2vjnx",
      "author": "whatdoidonowdamnit",
      "body": "No. A lot of my arfid is just straight up not eating, which has a lot of negative effects on every aspect of my life. I spent a long time adding to my diet so I do eat a healthy diet now, when I can eat. If I could eat just two times a day every day, I would be comfortable. My weight wouldn’t fluctuate as much. I wouldn’t be tired all the time. I wouldn’t be so damn cold. I’d be able to cook more for my family. I would be able to think a little clearer. I know I need to eat. The only reasons I’m able to stay above the underweight border are my age and drinking my calories (protein drinks and coffee, not alcohol)\n \nYesterday I took a pack of whole chicken breasts out the fridge. My bf cut them up with the bones and then went out. He was supposed to take the bones out. I cut the bones out of two breasts before I was gagging and long story short my kids ate chicken nuggets with dinner instead of butter chicken. And I ate a kids’ bowl of pasta a few hours later when the nausea subsided with the help of zofran.",
      "created_utc": 1729548836.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lt3vz11",
      "author": "Neocactus",
      "body": "I'm comfortable with ARFID, but in a way I'm not comfortable with the fact that I'm comfortable with it.\n\nI'd eat the few things I eat for the rest of my life if I could get away with it. But I hate feeling like a damn child with my eating habits, and they sure as hell aren't healthy.",
      "created_utc": 1729562078.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lt32ffa",
      "author": "ndlesbian",
      "body": "yup. I'm mostly at peace with my arfid, and I'll only occasionally try new things that are similar enough to something I like that I know might be safe.\n\nthe one disturbing my peace is my mom tbh, she keeps bugging me I'm not eating well, even though the doctor has assured me that I'm fine. (edit- I am an adult)",
      "created_utc": 1729551268.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lt37cpd",
      "author": "bio_coop",
      "body": "I'd say im about 99% good with it. I refused pretty much every food at age 7 or 8, I'm 50 now, eating my same safe foods for 40+ years\n\nBesides the bullying or teasing. \n\nHonestly, I feel healthier now than as a child. \nI don't care about trying new foods, I'm good with my safe foods, plus I don't spend much money on food because of the disorder",
      "created_utc": 1729553032.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lt39xl0",
      "author": "patrickbateperson",
      "body": "i absolutely am. i’ve stopped giving any fucks at all about what other people think i *should* eat and instead i am prioritizing getting proper nutrition through supplements and meal replacements. i just don’t care anymore about putting myself through hell to satisfy other people’s judgements about my relationship with food which doesn’t affect them in the slightest. my limited palate is childish? you don’t respect my medical condition that restricts my diet? boo hoo i’m gonna keep chugging my liquid meals",
      "created_utc": 1729553959.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lt3k9c1",
      "author": "Entire-Somewhere-198",
      "body": "Yeah- and that’s okay!! If you’re happy and healthy then it’s not a problem really",
      "created_utc": 1729557757.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lt24h0r",
      "author": "poppunkdaddyy",
      "body": "Don’t feel the need to answer this, but do you find that in comparison to a lot of people on Reddit, your health is in better shape, even if you eat the same? I’m in the same boat as you where I feel no need to try anything new I have my go-to safe foods, but health wise, my body is costing. Maybe id try a new food if I was on my death bed lol",
      "created_utc": 1729540421.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lt36u1n",
      "author": "TashaT50",
      "body": "I’m not ashamed of having ARFID and in many ways I’m comfortable with my diet as is. Most of the time I’ve reached a point where I have a reasonable varied diet. I don’t care what other people think and have no problem handling situations where someone tries to make my ARFID a problem. Anyone I see regularly has long since stopped pressuring me and for the most part are supportive or indifferent.\n\nOn the other hand I have health issues and making a few changes to my diet by adding more veggies would be a huge help. I’m also getting tired of cooking two versions of things like omelettes or not being able to eat leftovers. I’ve been making changes I want to make for me in my 50s without finding it onerous over the last year. \n\nUnfortunately I’m in my yearly severe depression cycle and I’m back to eating breakfast and not eating dinner or snacks as I’m having problems with a number of my safe foods. Hopefully I’ll be out of this stage by November.",
      "created_utc": 1729552845.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lt3eojc",
      "author": "Tommy_Wisseau_burner",
      "body": "I mean I’m comfortable with my food pallet because the food tastes good to me. What I’m not comfortable with is the stigma and judgment from everyone else, and the amount of places and situations where my needs aren’t being met and I’m basically forced to starve myself or possibly vomit",
      "created_utc": 1729555693.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lt3h4qw",
      "author": "giraffemoo",
      "body": "Yes, until none of my safe foods work anymore lol. I'm on vacation now and having a hard time.",
      "created_utc": 1729556600.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lt3hyt7",
      "author": "lyresince",
      "body": "whenever I have money 😁",
      "created_utc": 1729556907.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lt3pnd9",
      "author": "Casper_coon22",
      "body": "This is exactly me!!! I thought I was the only one!! I just don't feel the need to change my diet, it's good enough for me!!",
      "created_utc": 1729559729.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lt3uyrx",
      "author": "littleghool",
      "body": "I'm absolutely fine with my food habits. I have some weight to lose, that's for sure, but I have absolutely no interest in expanding my diet. I'm comfortable with my ARFID and so are the people in my life 🖤",
      "created_utc": 1729561706.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lt4dnlt",
      "author": "Darthcookie",
      "body": "I don’t know if it qualifies as comfortable but I just accept I am the way I am. \n\nI do try to eat things I barely tolerate for the nutritional value but I don’t force myself to do it anymore. \n\nWould I like to be normal? Fuck yes. 18 year old me was all like “FUCK YOU WORLD” but 45 year old me is too old for this shit. \n\nBut since there’s no fix (no amount of therapy or medication is going to make my super smelling and tasting powers go away), I am okay being this way. \n\nAnd even when I briefly lost my super sense of smell after I got COVID a few months back didn’t help make things more appetizing.",
      "created_utc": 1729569152.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lt4mo1m",
      "author": "StarwatchingFox",
      "body": "Basically yes. I still try unsafe foods sometimes, but I don't force myself to. Helps that I don't have the whole vomit thing.",
      "created_utc": 1729573736.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lt4mwh5",
      "author": "SomeScorpio",
      "body": "Yes, I feel the same!",
      "created_utc": 1729573864.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lt5r4of",
      "author": "No-Lemon-1183",
      "body": "i only feel consious of it in two situations #1 when the grocery clerk starts to make comments about how much I must LOVE a certain food , i feel super mocked, thank god for self checkouts, and #2 every single time i eat a meal with my extended family and they make comments about what im eating, how im eating, how much im eating and why if i dont like something i dont just try it, which is why i usually get so anxious that i throw up when i have to eat around other people\n\n  \nliving alone when nobody could comment on what o how i was eating was the best time of my lfife for this reason",
      "created_utc": 1729598690.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lt8k911",
      "author": "Pgodin67",
      "body": "10 years ago when I went through an eating disorder clinic, I got recommended to a primary care doctor that was familiar with arfid. she did a series of blood work and sent me down a path with vitamins/supplements that covers the things I was lacking. I feel great ever since then, but have lost my motivation to change anything.",
      "created_utc": 1729631445.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ltr8us4",
      "author": "SaveTheNinjasThenRun",
      "body": "I'm okay with mine in the moment. I don't mind trying new foods if they interest me and when I travel I do like to try new restaurants. Which is good because I don't feel like therapy would benefit me. ",
      "created_utc": 1729894086.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lwi4utd",
      "author": "Iridescenthedgehog",
      "body": "Not 100%- I still get frustrated occasionally when people are rude or ignorant. But in my everyday life I’m ok. Nobody cares what I eat most of the time and I try to do the best I can each day. It’s pretty much become normal for me.",
      "created_utc": 1731285342.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lt2f0vk",
      "author": "aroaceautistic",
      "body": "Not me. I feel like a huge asshole when I can’t eat my friends cultural foods, and I know that as my stomach problems get worse I won’t be able to adjust my diet as needed",
      "created_utc": 1729543585.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lt2kxwl",
      "author": "Upset-Lavishness-522",
      "body": "I read on some ED therapy site that if itsnoth impacting your life (ie health ok, and the range of foods, regardless of social limitations isn't causing guilt, etc) then it's ok. That said, another ED site (focusing a lot on parental control) says tge opposite.\n\nNot a terribly helpful response from me, just putting different professional opinions out there !",
      "created_utc": 1729545282.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lt3frsm",
      "author": "Glass_Intern_2680",
      "body": "I feel more at peace with it, like just accepting it will always be here and it’s okay",
      "created_utc": 1729556097.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lt3fz99",
      "author": "CSMom74",
      "body": "I'm 50. Been this way my whole life so I'm adopted to it over my life but if other people aren't comfortable with it that's on them. Some people make a big deal if you won't eat their cooking or whatever they're having in a restaurant or try their food but I have gotten to the point where I'm long past caring about what other people think of what I'm cramming in my mouth.",
      "created_utc": 1729556173.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lt4izjl",
      "author": "First-Butterscotch-3",
      "body": "Yeah",
      "created_utc": 1729571769.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lt85cmn",
      "author": "Gold_Event_1537",
      "body": "This is me. I don’t want to “recover” because I know I won’t. I’m okay with eating what I like and why should I try something that looks disgusting and I know I won’t like? I don’t really care that my palette is not big.",
      "created_utc": 1729626969.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lt8819f",
      "author": "emmatheshark",
      "body": "Usually, I am comfortable with my ARFID. My parents let me eat what I’m comfortable so I don’t really have to think about it that much. The only times I am uncomfortable is when I’m offered food or I’m eating my safe foods in front of people o don’t know as well. Most of the time I don’t think about my AFRID, but those times remind me that I have it",
      "created_utc": 1729627788.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lt8dw1e",
      "author": "angeltay",
      "body": "Because my ARFID doesn’t affect my health to an extreme extent, I am comfortable with it. There are certain foods I will never eat (meat, bananas) but I still eat enough of other foods and will try new dishes as long as the ingredients are my safe foods. Beans and greens are favorites of mine so I do alright without meat.",
      "created_utc": 1729629560.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lt33cqd",
      "author": "ndlesbian",
      "body": "this is the same for me. I can't really 'recover' from sensory issues. I'll have times I'm more overwhelmed and struggling, and times I feel more calm and have the energy to try things, but mostly the situation has not changed since I've started eating solids",
      "created_utc": 1729551595.0,
      "score": 14,
      "context": [
        {
          "id": "lt2ue64",
          "author": "KirbysLeftBigToe",
          "body": "Yes. Mine is due to my sensory issues I was born with so “recovery” isn’t an idea that works for me. This is my life and as long as I keep my needs in mind (in terms of being comfortable and maintaining my health) and have empathetic people around who respect me I generally do just fine.",
          "created_utc": 1729548435.0
        }
      ]
    },
    {
      "id": "lt38w3b",
      "author": "TashaT50",
      "body": "I get a kick out of the term recovery as I literally came out of the womb having ARFID - it started with breast milk and showed up as soon as foods were introduced. I can’t recover what never was. I have had some luck expanding what I can eat under ideal situations, if the planets are aligned, and my luck is holding that day.",
      "created_utc": 1729553584.0,
      "score": 14,
      "context": [
        {
          "id": "lt2ue64",
          "author": "KirbysLeftBigToe",
          "body": "Yes. Mine is due to my sensory issues I was born with so “recovery” isn’t an idea that works for me. This is my life and as long as I keep my needs in mind (in terms of being comfortable and maintaining my health) and have empathetic people around who respect me I generally do just fine.",
          "created_utc": 1729548435.0
        }
      ]
    },
    {
      "id": "lt3stt1",
      "author": "Baring-My-Heart",
      "body": "God for REAL. Even trying “new” variants of my safe foods freak me out, having to try “new” foods is a no go in front of others",
      "created_utc": 1729560908.0,
      "score": 8,
      "context": [
        {
          "id": "lt3jc6s",
          "author": "Fun_Intention_5371",
          "body": "Omg same. \n\nAlso definitely dont make me try food in front of people. It's gonna go badly",
          "created_utc": 1729557416.0
        }
      ]
    },
    {
      "id": "lt31758",
      "author": "earlnacht",
      "body": "Honestly, as someone who’s been more open to trying new foods lately, I disagree with this. I didn’t become brave enough to step outside my comfort zone until I became comfortable with where I was at already. Knowing I was safe to eat what I wanted and that I wouldn’t be judged helped me a lot in feeling safe and treating food like a friend rather than an enemy. Pressuring yourself to try things before you’re ready can just have the opposite effect: it feels bigger and scarier to try new things because you’re already afraid of what you’re eating day to day. Let people come to their exploration naturally.\n\nEdit: just saw OP said they’re anorexic, which changes things. But honestly I think it’s better for them to start eating more of what they’re comfy eating rather than force themself to try new things and risk not eating enough. At a certain point you have to value caloric intake over the food pyramid.",
      "created_utc": 1729550837.0,
      "score": 7,
      "context": [
        {
          "id": "lt26siu",
          "author": "Kittencab00dles",
          "body": "If your nutrition needs are being met, I understand the feeling, but the danger comes in with the idea someday the foods you accept will further restrict. So yes, I do understand feeling comfortable and wanting to just accept that, but (reasonably speaking) what makes us uncomfortable is usually where our weakness lies and what we should put some effort into. IMO, if you are healthy currently, it would honestly be a good time to just try a little branching out. Ideally you’ll be pleasantly surprised and find some new stuff you enjoy, and long term it would absolutely be a safety net in case stuff you currently like shifts out of your favor. Don’t overwhelm yourself, maybe even a goal of one new bite a month. As my recent therapy has shown me too, it does help my self esteem and mental health a lot when I push myself gently to keep tackling challenges.",
          "created_utc": 1729541122.0
        }
      ]
    },
    {
      "id": "lt4t2z0",
      "author": "ae4ther4",
      "body": "That’s exactly how I feel! It’s so frustrating sometimes because it’s like I don’t have enough motivation to properly go into recovery but I can still wallow in the sadness of dealing with it every day.",
      "created_utc": 1729577542.0,
      "score": 2,
      "context": [
        {
          "id": "lt3vz11",
          "author": "Neocactus",
          "body": "I'm comfortable with ARFID, but in a way I'm not comfortable with the fact that I'm comfortable with it.\n\nI'd eat the few things I eat for the rest of my life if I could get away with it. But I hate feeling like a damn child with my eating habits, and they sure as hell aren't healthy.",
          "created_utc": 1729562078.0
        }
      ]
    },
    {
      "id": "lt2652n",
      "author": "Baring-My-Heart",
      "body": "No I have anorexia lol, so it’s def not",
      "created_utc": 1729540922.0,
      "score": -1,
      "context": [
        {
          "id": "lt24h0r",
          "author": "poppunkdaddyy",
          "body": "Don’t feel the need to answer this, but do you find that in comparison to a lot of people on Reddit, your health is in better shape, even if you eat the same? I’m in the same boat as you where I feel no need to try anything new I have my go-to safe foods, but health wise, my body is costing. Maybe id try a new food if I was on my death bed lol",
          "created_utc": 1729540421.0
        }
      ]
    },
    {
      "id": "lt3sf8f",
      "author": "amb3rjan3",
      "body": "mhm i feel this. i went on a cruise and had a full on breakdown the first night because there was nothing i could eat",
      "created_utc": 1729560759.0,
      "score": 2,
      "context": [
        {
          "id": "lt3h4qw",
          "author": "giraffemoo",
          "body": "Yes, until none of my safe foods work anymore lol. I'm on vacation now and having a hard time.",
          "created_utc": 1729556600.0
        }
      ]
    },
    {
      "id": "lt38z1i",
      "author": "TashaT50",
      "body": "Yeah that’s hard.",
      "created_utc": 1729553614.0,
      "score": 0,
      "context": [
        {
          "id": "lt2f0vk",
          "author": "aroaceautistic",
          "body": "Not me. I feel like a huge asshole when I can’t eat my friends cultural foods, and I know that as my stomach problems get worse I won’t be able to adjust my diet as needed",
          "created_utc": 1729543585.0
        }
      ]
    },
    {
      "id": "lt41cqo",
      "author": "angeldust-22269",
      "body": "i also started as a baby. the doctors prescribed me with some fancy milk because they knew that my final height would be short asf, but my 1 month ahh self didn’t like the texture apparently (according to my parents idk tho) so now i’m stuck at 4’7 🔥🔥",
      "created_utc": 1729564072.0,
      "score": 5,
      "context": [
        {
          "id": "lt2ue64",
          "author": "KirbysLeftBigToe",
          "body": "Yes. Mine is due to my sensory issues I was born with so “recovery” isn’t an idea that works for me. This is my life and as long as I keep my needs in mind (in terms of being comfortable and maintaining my health) and have empathetic people around who respect me I generally do just fine.",
          "created_utc": 1729548435.0
        },
        {
          "id": "lt38w3b",
          "author": "TashaT50",
          "body": "I get a kick out of the term recovery as I literally came out of the womb having ARFID - it started with breast milk and showed up as soon as foods were introduced. I can’t recover what never was. I have had some luck expanding what I can eat under ideal situations, if the planets are aligned, and my luck is holding that day.",
          "created_utc": 1729553584.0
        }
      ]
    },
    {
      "id": "lt3tnfr",
      "author": "Fun_Intention_5371",
      "body": "I'd much rather eat by myself ALWAYS \n\nLess commentary. \n\nLike leave me alone and just let me live in my food prison",
      "created_utc": 1729561217.0,
      "score": 7,
      "context": [
        {
          "id": "lt3jc6s",
          "author": "Fun_Intention_5371",
          "body": "Omg same. \n\nAlso definitely dont make me try food in front of people. It's gonna go badly",
          "created_utc": 1729557416.0
        },
        {
          "id": "lt3stt1",
          "author": "Baring-My-Heart",
          "body": "God for REAL. Even trying “new” variants of my safe foods freak me out, having to try “new” foods is a no go in front of others",
          "created_utc": 1729560908.0
        }
      ]
    },
    {
      "id": "lt37ry5",
      "author": "TashaT50",
      "body": "I think, pending serious health issues, accepting our ARFID restrictions, and having supportive people in our lives may make it easier to then try new foods. It may be different for different people. There’s rarely one right way for everyone.",
      "created_utc": 1729553182.0,
      "score": 6,
      "context": [
        {
          "id": "lt26siu",
          "author": "Kittencab00dles",
          "body": "If your nutrition needs are being met, I understand the feeling, but the danger comes in with the idea someday the foods you accept will further restrict. So yes, I do understand feeling comfortable and wanting to just accept that, but (reasonably speaking) what makes us uncomfortable is usually where our weakness lies and what we should put some effort into. IMO, if you are healthy currently, it would honestly be a good time to just try a little branching out. Ideally you’ll be pleasantly surprised and find some new stuff you enjoy, and long term it would absolutely be a safety net in case stuff you currently like shifts out of your favor. Don’t overwhelm yourself, maybe even a goal of one new bite a month. As my recent therapy has shown me too, it does help my self esteem and mental health a lot when I push myself gently to keep tackling challenges.",
          "created_utc": 1729541122.0
        },
        {
          "id": "lt31758",
          "author": "earlnacht",
          "body": "Honestly, as someone who’s been more open to trying new foods lately, I disagree with this. I didn’t become brave enough to step outside my comfort zone until I became comfortable with where I was at already. Knowing I was safe to eat what I wanted and that I wouldn’t be judged helped me a lot in feeling safe and treating food like a friend rather than an enemy. Pressuring yourself to try things before you’re ready can just have the opposite effect: it feels bigger and scarier to try new things because you’re already afraid of what you’re eating day to day. Let people come to their exploration naturally.\n\nEdit: just saw OP said they’re anorexic, which changes things. But honestly I think it’s better for them to start eating more of what they’re comfy eating rather than force themself to try new things and risk not eating enough. At a certain point you have to value caloric intake over the food pyramid.",
          "created_utc": 1729550837.0
        }
      ]
    },
    {
      "id": "lt91wi0",
      "author": "Neocactus",
      "body": "I think I'm gonna try to get into therapy soon and see where I go from there. I'm starting to realize it's definitely not something I could accomplish on my own, the way I used to think I could.\n\nAlso sucks that I started a new job this week, so I don't have insurance quite yet (I actually just enrolled today, but idk when it'll kick in exactly).",
      "created_utc": 1729637334.0,
      "score": 2,
      "context": [
        {
          "id": "lt3vz11",
          "author": "Neocactus",
          "body": "I'm comfortable with ARFID, but in a way I'm not comfortable with the fact that I'm comfortable with it.\n\nI'd eat the few things I eat for the rest of my life if I could get away with it. But I hate feeling like a damn child with my eating habits, and they sure as hell aren't healthy.",
          "created_utc": 1729562078.0
        },
        {
          "id": "lt4t2z0",
          "author": "ae4ther4",
          "body": "That’s exactly how I feel! It’s so frustrating sometimes because it’s like I don’t have enough motivation to properly go into recovery but I can still wallow in the sadness of dealing with it every day.",
          "created_utc": 1729577542.0
        }
      ]
    },
    {
      "id": "lt4251w",
      "author": "giraffemoo",
      "body": "I'm in the airport heading home right now, I'll be able to sleep in my own bed and eat my own food tonight!",
      "created_utc": 1729564373.0,
      "score": 1,
      "context": [
        {
          "id": "lt3h4qw",
          "author": "giraffemoo",
          "body": "Yes, until none of my safe foods work anymore lol. I'm on vacation now and having a hard time.",
          "created_utc": 1729556600.0
        },
        {
          "id": "lt3sf8f",
          "author": "amb3rjan3",
          "body": "mhm i feel this. i went on a cruise and had a full on breakdown the first night because there was nothing i could eat",
          "created_utc": 1729560759.0
        }
      ]
    },
    {
      "id": "lt45ytl",
      "author": "TashaT50",
      "body": "Our stories are so interesting and stranger than fiction. \n\nI ended up on the very first soy formula, I was sensitive to dairy, which came out the year before I was born but it had to be modified with yogurt, I know doesn’t make sense but ya know our bodies are weird, and brewers yeast. As soon as they tried foods if I didn’t like it I wouldn’t eat beyond the 1st taste and refused food for a number of hours. Try to give it to me again and I wouldn’t eat it of anything else for 6 hours. No trust in those who’d try to feed me vile gross food after I’d let them know I didn’t like it. At like 4-5 months old. Sometimes I wonder how much this impacted my issues with authority figures.",
      "created_utc": 1729565872.0,
      "score": 4,
      "context": [
        {
          "id": "lt2ue64",
          "author": "KirbysLeftBigToe",
          "body": "Yes. Mine is due to my sensory issues I was born with so “recovery” isn’t an idea that works for me. This is my life and as long as I keep my needs in mind (in terms of being comfortable and maintaining my health) and have empathetic people around who respect me I generally do just fine.",
          "created_utc": 1729548435.0
        },
        {
          "id": "lt38w3b",
          "author": "TashaT50",
          "body": "I get a kick out of the term recovery as I literally came out of the womb having ARFID - it started with breast milk and showed up as soon as foods were introduced. I can’t recover what never was. I have had some luck expanding what I can eat under ideal situations, if the planets are aligned, and my luck is holding that day.",
          "created_utc": 1729553584.0
        },
        {
          "id": "lt41cqo",
          "author": "angeldust-22269",
          "body": "i also started as a baby. the doctors prescribed me with some fancy milk because they knew that my final height would be short asf, but my 1 month ahh self didn’t like the texture apparently (according to my parents idk tho) so now i’m stuck at 4’7 🔥🔥",
          "created_utc": 1729564072.0
        }
      ]
    }
  ]
}