{
  "id": "1ghbb1l",
  "subreddit": "ARFID",
  "author": "ibelieveinaliens111",
  "created_utc": 1730483098.0,
  "title": "Anyone else crave foods you know you would hate?",
  "selftext": "Anytime I’m at the grocery store and hungry, everything starts to look good- but I know I’d absolutely hate all of it. The texture, taste, everything. But the food on the packaging looks so good? As well as things on TV and cartoons. People draw and film foods as being so tasty, but I know the second I tried it I’d be dissapointed.",
  "url": "https://www.reddit.com/r/ARFID/comments/1ghbb1l/anyone_else_crave_foods_you_know_you_would_hate/",
  "score": 94,
  "num_comments": 36,
  "comments": [
    {
      "id": "luw5k1e",
      "author": "SekMemoria",
      "body": "All the time, especially if I'm hungry and something is cooking. My mom, dad, and grandmother were all particularly good cooks, too. It's torture going to places like the boardwalk at the beach or food court at a mall where nothing really appeals to me, yet everything still smells amazing.  \n\nAs far as food commercials go, there's practically a whole science to that itself. The funny thing about commercial food being in any way appetizing is how fake and made-up it all is.",
      "created_utc": 1730483877.0,
      "score": 32,
      "context": []
    },
    {
      "id": "luwizrl",
      "author": "Bri_bug",
      "body": "One time I convinced my partner that I’d eat a can of beans if we bought it bc I was craving it. I did not. I hate beans lol",
      "created_utc": 1730488070.0,
      "score": 19,
      "context": []
    },
    {
      "id": "luw8116",
      "author": "byeon_hyemi",
      "body": "this is how i am with pizza.. it looks good, smells good too but i can’t bring myself to eat it :(",
      "created_utc": 1730484648.0,
      "score": 14,
      "context": []
    },
    {
      "id": "luw4vef",
      "author": "Impressive_Mud_8019",
      "body": "At restaurants with other people their food looks soo good but I can bring my self to try.",
      "created_utc": 1730483666.0,
      "score": 11,
      "context": []
    },
    {
      "id": "luw6x8y",
      "author": "geekgeek2019",
      "body": "i crave meat, i kinda was able to eat it as a kid but overtime got a bad ick. but i crave those moment ahh.",
      "created_utc": 1730484302.0,
      "score": 8,
      "context": []
    },
    {
      "id": "luwaed0",
      "author": "iamacraftyhooker",
      "body": "I don't have arfid, my kid does, but I have a relevant experience.\n\nWhen I was pregnant eggs smelled like the most delicious thing in the world. On at least 3 seperate occasions I made myself eggs, and then was instantly repulsed that they tasted like eggs",
      "created_utc": 1730485390.0,
      "score": 5,
      "context": []
    },
    {
      "id": "luw74gb",
      "author": "thick-bootycuti3",
      "body": "Me with sushi. Absolute hard no, but crave it all the time???",
      "created_utc": 1730484365.0,
      "score": 4,
      "context": []
    },
    {
      "id": "luxjubl",
      "author": "BillyJohn1799",
      "body": "I frequently want to eat a salad, like a really nice salad with crunchy lettuce and sliced onions, but I know that as soon as it gets near my tongue I wouldn't be able to tolerate it.",
      "created_utc": 1730500198.0,
      "score": 3,
      "context": []
    },
    {
      "id": "luwb43p",
      "author": "emmatheshark",
      "body": "This happens to me when I smell something good. Sometimes someone will be eating something around me and I say “that smells good” but if they ask if I want to try it I just can’t. It’s weird because the smell is good, but I just can’t bring myself to try it.",
      "created_utc": 1730485614.0,
      "score": 2,
      "context": []
    },
    {
      "id": "luwjxsc",
      "author": "sh--",
      "body": "Yes sometimes I crave baked beans from adverts and pics but then I remember I hate the smell, that consistency is so disgusting to me and the idea of them even lukewarm in the slightest 🤢",
      "created_utc": 1730488373.0,
      "score": 1,
      "context": []
    },
    {
      "id": "luwl5m4",
      "author": "stillabadkid",
      "body": "A lot of Indian dishes smell amazing but I'm scared of the texture",
      "created_utc": 1730488760.0,
      "score": 1,
      "context": []
    },
    {
      "id": "luwl6kw",
      "author": "icewuerfelchen",
      "body": "this happens to me with meat dishes all time time, especially Indian and Chinese food. It looks and smells amazing but every attempt I’ve ever made at trying it has gone horribly.",
      "created_utc": 1730488768.0,
      "score": 1,
      "context": []
    },
    {
      "id": "luwpmgw",
      "author": "Armayra",
      "body": "This happens to me too, and I've started joking that I don't want to eat it, I just want to have it, lol",
      "created_utc": 1730490183.0,
      "score": 1,
      "context": []
    },
    {
      "id": "luww0mh",
      "author": "StarwatchingFox",
      "body": "I want to eat molten cheese. But I know I would hate it, especially if it isn't hot. But there was a time where I liked molten cheese, before I had ARFID. So I want back what was lost. But that cheese is so nausea inducing now, it's sad.",
      "created_utc": 1730492215.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lux1vaf",
      "author": "sofmoth",
      "body": "i would love to try mussels but i know i would gag from the texture. everyone i know who eats them loves how they taste, but from what i’ve heard the texture is questionable to say the least.",
      "created_utc": 1730494099.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lux4re4",
      "author": "strawberrykisses__",
      "body": "sushi is repulsive but looks so good 💔🥲",
      "created_utc": 1730495033.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lux5ezs",
      "author": "milkforbrains_",
      "body": "2 min noodles, they smell so good and there’s nothing else that I eat that’s as fast and convenient it would be so nice 😭",
      "created_utc": 1730495248.0,
      "score": 1,
      "context": []
    },
    {
      "id": "luxhjz3",
      "author": "spooky-ufo",
      "body": "i think burgers and ribs smell incredible but i haven’t eaten either in my entire life and i’m not about to start now at 26! meat is 10000% my non safe foods 😭",
      "created_utc": 1730499385.0,
      "score": 1,
      "context": []
    },
    {
      "id": "luxpnxs",
      "author": "bobaylaa",
      "body": "this is a really weird one but i’m a pet sitter and for some reason every once in a while when i’m scooping out wet cat food i feel compelled to just eat a mouthful? meanwhile if it were a spoonful of like beans or something i’d be completely repulsed?? but also if i get the cat food on my hands im like “ew gross” and need to wash them immediately??? like what in the hell is that about",
      "created_utc": 1730502303.0,
      "score": 1,
      "context": []
    },
    {
      "id": "luxslfi",
      "author": "AllStitchedTogether",
      "body": "Anime food making me think I can eat anything 😅",
      "created_utc": 1730503355.0,
      "score": 1,
      "context": []
    },
    {
      "id": "luxyeqz",
      "author": "None",
      "body": "I’ve been craving all types of vegetables lately. My body is definitely trying to tell me something. But I know I’ll gag the moment one reaches my mouth.",
      "created_utc": 1730505453.0,
      "score": 1,
      "context": []
    },
    {
      "id": "luy0a3k",
      "author": "purebuttjuice",
      "body": "I want Lobster Mac n Cheese but I don’t like sea food (it hurts my tummy!!)",
      "created_utc": 1730506139.0,
      "score": 1,
      "context": []
    },
    {
      "id": "luy3860",
      "author": "psychadelicphysicist",
      "body": "Yes!! I’ve been craving sandwiches and wraps which are my worst nightmare cos of all the different textures and flavours and soggy stuff. So werid",
      "created_utc": 1730507229.0,
      "score": 1,
      "context": []
    },
    {
      "id": "luyl0nh",
      "author": "luminousfloret",
      "body": "Beef 😔",
      "created_utc": 1730514282.0,
      "score": 1,
      "context": []
    },
    {
      "id": "luynzoy",
      "author": "Tommy_Wisseau_burner",
      "body": "Burgers. I like the smell of them usually but hate burgers and all the crap that gets put in. I don’t think I’d mind it so much if it weren’t for the judgement of getting a burger with literally nothing on it",
      "created_utc": 1730515534.0,
      "score": 1,
      "context": []
    },
    {
      "id": "luyqd3y",
      "author": "Visible-Passenger544",
      "body": "PIE, it looks SO good on TV! \npeople seem like they really enjoy it. \nbut I hate the texture and taste of cooked fruit.",
      "created_utc": 1730516564.0,
      "score": 1,
      "context": []
    },
    {
      "id": "luzpzi4",
      "author": "Markus_314",
      "body": "This is me every time I see a commercial for a Wendy’s Baconater",
      "created_utc": 1730538266.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lv04r72",
      "author": "PixiePrism",
      "body": "Meat, any kind of meat. The smell, the flavor, even the condiments are very appealing. My body craves protein and iron. The inconsistent texture absolutely disgusts me.",
      "created_utc": 1730547795.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lv0dvii",
      "author": "ParfaitDisastrous306",
      "body": "Apples always look so yummy to me, but as soon as I bite into that shit I gag",
      "created_utc": 1730552213.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lv1zymt",
      "author": "g3twr3nch3d",
      "body": "i know i don’t like chinese food but my god does it look and smell SO GOOOOOD",
      "created_utc": 1730571918.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lv4tf9k",
      "author": "allegraorallegro",
      "body": "YESSSS!!!! omg, i work at panda express and every dish looks terrific, but i know i wouldn’t like basically any of them 😭",
      "created_utc": 1730608911.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lv597gk",
      "author": "Euphemia-Alder",
      "body": "Broccoli. Everyone makes it look tasty. It’s a cutie little tiny tree vegetable. But the taste and texture and smell are horrible. Can’t do it. Same with Brussels sprouts. Ew.",
      "created_utc": 1730618522.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lv69koh",
      "author": "5e5a80",
      "body": "orange chicken",
      "created_utc": 1730640121.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lvayz5q",
      "author": "LuLuu1997",
      "body": "Those foods that are served with everything in there like poke bowls or some place in my country called “Green Bowl” or anything that’s just a mix of things in a plate looks like it would be a nice experience in theory. But nope, too much risk as variability.\n\nAlso there’s a version of dumplings in my country (maybe call it poor people dumpling as is a very Dominican version that has nothing to do with the Asian ways xd) which is small balls of flour boiled in sauce with crumbled sardines, sausages, diced smoked pork chops and sometimes chicken parts if the cook is feeling fancy. It’s a kind of soup I guess. \n\nI have never put my mouth in it but smells delicious and is usually made in big groups in a pot for sometimes dozens of people at the time. Served hot and eaten anywhere a chair is available because people are busy talking among them or drinking and just having fun while the pot boils.\n\nSo it’s the type of thing where I’m definitely noticed while eating chips or the food I choose to repeat that day.",
      "created_utc": 1730697153.0,
      "score": 1,
      "context": []
    },
    {
      "id": "luwz85m",
      "author": "Tricky-Animator5582",
      "body": "When I was a baby 0-4, it was almost impossible for my parents to feed me anything because I hated the tastes so much. One day they got the idea for me to try pizza, and half the stuff I’ve eaten (probably more) has been pizza. I totally get what you mean though.",
      "created_utc": 1730493247.0,
      "score": 5,
      "context": [
        {
          "id": "luw8116",
          "author": "byeon_hyemi",
          "body": "this is how i am with pizza.. it looks good, smells good too but i can’t bring myself to eat it :(",
          "created_utc": 1730484648.0
        }
      ]
    },
    {
      "id": "lv0plmr",
      "author": "ibelieveinaliens111",
      "body": "the ones that come in those styrofoam cups would be so good if they didn’t come with all the little tidbits 🙁 just noodles and broth",
      "created_utc": 1730556785.0,
      "score": 1,
      "context": [
        {
          "id": "lux5ezs",
          "author": "milkforbrains_",
          "body": "2 min noodles, they smell so good and there’s nothing else that I eat that’s as fast and convenient it would be so nice 😭",
          "created_utc": 1730495248.0
        }
      ]
    }
  ]
}