{
  "id": "1ghhpdx",
  "subreddit": "ARFID",
  "author": "BillyJohn1799",
  "created_utc": 1730500056.0,
  "title": "Was anyone else confused what most people mean when they say that they don't like a certain food but still eat it?",
  "selftext": "As long as I can remember, I've found some foods completely repulsive. I literally can't bring myself to eat them. It always really confused me when someone would say they don't like a certain food but still eat it. Not only that, but I would also be really confused when I ate something and didn't like it but was reduced to gagging whenever it came near my mouth. But I've just realised that's what not disliking food it for most people and, when I not able to eat something it's probably ARFID.",
  "url": "https://www.reddit.com/r/ARFID/comments/1ghhpdx/was_anyone_else_confused_what_most_people_mean/",
  "score": 89,
  "num_comments": 33,
  "comments": [
    {
      "id": "luxldqv",
      "author": "N7_Hellblazer",
      "body": "The way I see it is they don’t have the same reaction we do. They may dislike something but we have a severe reaction to it, like in our case gagging or throwing up. For them it’s a minor inconvenience. \n\nIf my partner doesn’t like something he will say he doesn’t like it but finish it if it ain’t so bad for him. I’m less confused by it by watching others reaction and realising for me it is a lot more extreme. Better to avoid those foods.",
      "created_utc": 1730500755.0,
      "score": 56,
      "context": []
    },
    {
      "id": "luxm9cc",
      "author": "retropillow",
      "body": "I didn't understand either until I managed to eat tacos. I don't like the taste, and I realized that if anyone but my mom makes them I probably can't eat it, but I will still do it if that's what my parents are making.\n\nThankfully my boyfriend is the \"its food, I'll eat it even if I don't like it\" type so sometimes I feel adventurous and buy a weird soda and hate it and then he finishes it for me.",
      "created_utc": 1730501073.0,
      "score": 42,
      "context": []
    },
    {
      "id": "luxptxd",
      "author": "LeakyFountainPen",
      "body": "Yeah, that was a big revelation for me one day. I don't LOVE eating carrots and broccoli, but I CAN eat them. I don't like eating bell peppers at all, but I CAN eat them.\n\nHad a conversation with my mom many years ago and it came up. She was shocked and said something like \"but I thought you loved carrots & broccoli? They were the only vegetables I could get you to eat as a kid?\"\n\nAnd I really had to break it down that there were tons of foods that were on my \"can eat\" list that I genuinely did not like. But I eat them because they're some of the few foods that don't make me gag/vomit, so they're on the menu by necessity.\n\nThat was when I finally realized that the reason everyone always got so frustrated with my \"picky eating\" is that they thought I was kicking up a fuss about like...*actual* preferences. Like a snooty sort of \"oh, it's not my most favorite, so make it different!! Only the best for me!!\" when from my end it was that I genuinely couldn't even get it near my mouth. (Like trying to make yourself eat someone else's snot.)",
      "created_utc": 1730502362.0,
      "score": 22,
      "context": []
    },
    {
      "id": "luxqxc4",
      "author": "Version_Present",
      "body": "ARFID also includes disinterest in food\n\nTbh I kinda get it. Sometimes if I get tired of a safe food or don't feel like eating it's like eating cardboard or paper; not disgusting but it doesn't make me want to eat. There are also times where I'm trying my best not to gag and usually then I can only take a couple bites if that.",
      "created_utc": 1730502755.0,
      "score": 14,
      "context": []
    },
    {
      "id": "luxn70l",
      "author": "Different_Move_1497",
      "body": "You like certain foods right? And must have food that you l don’t hate but isn’t necessarily your favourite right? To some people, not liking a certain food could be like that. It’s edible but simply not their favourite. \n\nFor you, the deification of ‘dis’like may be something quite repulsive rather than something you don’t particularly like, which is the case of many people. It is very different matters; a matter of definition and spectrum. \n\nFor you, things that you don’t super like could be largely categorised as repulsive considering that you are particularly sensitive with food. Whereas some people have a more diverse spectrum of LOVE-LIKE-NOT BAD-NOT GREAT-REPULSIVE, and to them, in terms of edibility, it could be the case of: NOT BAD=NOT GREAT.",
      "created_utc": 1730501417.0,
      "score": 9,
      "context": []
    },
    {
      "id": "luxua49",
      "author": "ratgarcon",
      "body": "I have some foods that I kinda like but not always. A great example is corn and bananas. Idk why. It’s not bad tasting, the texture isn’t a problem. It’s just sometimes they don’t sound good so I can’t eat it. I have to want to eat it. It doesn’t really make much sense to me either tho",
      "created_utc": 1730503962.0,
      "score": 9,
      "context": []
    },
    {
      "id": "luxttli",
      "author": "Damsel_IRL",
      "body": "I don't know if it's really accurate but sometimes when I try to explain it to people I compare it to my understanding of what causes my motion sickness. With motion sickness, as I understand it, my body is getting multiple sensory messages it doesn't understand and it jumps to the conclusion I have been poisoned and need to vomit in an attempt to survive so I become nauseated.  With some foods, my body gets sensory messages it doesn't understand and it jumps to the conclusion I am being poisoned so I gag or I get nauseated. Then my body associates those sensory messages with the  nausea and a cycle begins. My reactions to food and my motion sickness have both improved as my anxiety has improved so it makes sense to me that they are connected to how my body processes sensory and emotional input. I don't know if this is at all how it actually works though. \n\n\nWhen people without these sensory problems don't like food, I don't think their body is jumping to the \"I've been poisoned\" conclusion. It's just unpleasant or something. Some of these people haven't even considered that it's more than just unpleasant or uncomfortable for us and that's where some of their judgment and confusion stem from.",
      "created_utc": 1730503798.0,
      "score": 4,
      "context": []
    },
    {
      "id": "luxxjdx",
      "author": "emmatheshark",
      "body": "Yes this confuses me all the time. I’ll ask people how their food is and they say “I don’t really like it” but they continue to eat it. If I don’t like something, I just won’t eat it. My mom doesn’t like seafood, but she’ll eat it and I don’t get it. I feel like people sometimes just eat something they don’t like to be respectful",
      "created_utc": 1730505132.0,
      "score": 5,
      "context": []
    },
    {
      "id": "luy52vi",
      "author": "Amazing_Duck_8298",
      "body": "For me, there is a difference between foods that I am afraid of/that disgust me and foods that I simply don't like. My fear foods give me a lot of anxiety, make me gag, etc. and I absolutely cannot casually eat them nor are they incorporated into my regular diet. But I do have many foods that are safe (don't cause more anxiety or make me gag more than my preferred foods) but that I simply do not prefer. Unfortunately, many of these foods that are safe but that I don't like are necessary for my diet. For example, I do not like the taste of chicken but it is my primary source of protein because most other sources of protein are unsafe. Likewise, I do not like foods that are salty but am prescribed a high salt diet. My lack of interest in food often makes it so that eating isn't enjoyable no matter what the food is, so I'd rather focus on getting the nutrition I need than on what tastes slightly better. At the same time, there are many times when I have so little bandwidth to force myself to eat that I feel less capable of eating anything but the safest and most preferred of my options. At these times, the foods that I dislike move more towards being unsafe instead of simply not preferred.",
      "created_utc": 1730507924.0,
      "score": 4,
      "context": []
    },
    {
      "id": "luy7tix",
      "author": "milkforbrains_",
      "body": "I could not and would not eat something I don’t like, like why would I??? I know it’s a little more complicated than just “why would I” and I know our brains just work a lil differently but I genuinely cannot even fathom eating something I knowingly dislike",
      "created_utc": 1730508978.0,
      "score": 2,
      "context": []
    },
    {
      "id": "luz6z4w",
      "author": "Angelangepange",
      "body": "When I was a child and tried to explain to my parents why I was not eating I said \"it makes me vomit\" and they, thinking I was using it as a figurative insult, said \"you don't say that, you say you don't like it\".  \nI had no idea that was their thought process, all my life I thought everyone was having the same experience as me but they had such will power that they ate it anyway and looked like nothing was happening because vomiting was a taboo you could never talk about like poop.   \nIt's only recently I found out none of that was true 🙄",
      "created_utc": 1730524979.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lv29lbe",
      "author": "Numerous_Formal4130",
      "body": "This is actually something I’ve recently experienced! Throughout arfid recovery, I’ve actually developed what I like to call a “foods I don’t like but will eat if it’s the only thing available” category. For instance, pretzels. I don’t like pretzels, but I don’t hate them and if I’m really hungry and they’re the only thing at a party I’ll eat them. However, this is a “if there’s nothing else” situation…but I also known in some cultures it’s rude to refuse food, leave leftovers, etc. Perhaps those are some other reasons people can do this.",
      "created_utc": 1730574946.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lv03v7v",
      "author": "Fantastic-Leopard131",
      "body": "Part of me overcoming AFRID was accepting that im not always going to like a food but that i still need to eat anyways. I dont like a lot of foods, so i have to eat foods i dont like to be healthy. You just force it down and learn to accept that enjoying someone isnt a requirement to eat it.",
      "created_utc": 1730547301.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lv2ewwv",
      "author": "thatsnuckinfutz",
      "body": "I get it honestly, my arfid is overall disinterest of food (among other issues) so the majority of what i eat are things that i dont like but just eat so i can say that i actually ate that day. There are times where the idea of eating anything does make me nauseated so i understand both sides.",
      "created_utc": 1730576680.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lv3rn6d",
      "author": "Ky3031",
      "body": "I get it. Honestly, I felt kind of alone AFRID wise since it’s seems like the more “popular” issues are textures or disinterest. But for me, lots of food just tastes repulsive. Nothing to do with texture, just tastes horrible to the point I don’t understand how anyone could eat it. My mom would make me try something, I’d put it in my mouth and the second I tasted someone bad I just left my mouth hanging open trying not to taste it, wouldn’t even chew most of the time. Then I had to spit it out and rinse my mouth out with water. Some cases I have to get juice or something to wash out the taste.",
      "created_utc": 1730593514.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lv48ndg",
      "author": "Desert_Fairy",
      "body": "There is a vast difference between not liking something and having an aversion to it. \n\nI like to explain it to people that the sensation I have to the foods I can’t eat is similar to the sensation they would feel if someone put a plate of live cockroaches in-front of them and started eating them. \n\nThen asked if you wanted some.  Said it was really good. \n\nIt isn’t that the food I can’t eat is bad, it is that my hind brain says that it is the equivalent eating live cockroaches.",
      "created_utc": 1730599934.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lv6hou4",
      "author": "Prometheus-is-vulcan",
      "body": "There are 100% of possible foods. I eat maybe 30%. I like around 10%.\n\nSo yes, i absolutely know what it means, as there are foods that dont taste good. But i eat them, as long as they wont trigger disgust.",
      "created_utc": 1730643202.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lv7fe5v",
      "author": "CSMom74",
      "body": "I would say those people that eat what they don't like anyway don't truly have ARFID.\n\nI physically and mentally cannot get myself to eat anything that's not one of my favorite foods. Or seafood I guess they call it. I remember once even as a 14 year old, we went to Medieval Times and I was you know going to try to do it this time. I was really geared up that I was going to try that chicken that they were going to bring out so that way I could surprise everybody and they'd be proud of me. And once they started passing down those plates, mine got in front of me and I just froze. I could not even have it in front of me to the point that I had to push the plate away. There's no \"eating it anyway.\" And I felt horrible that I couldn't get myself to try it or even have it closely in front of me, but that's just how it's been my whole life. And I'm 50, this has been a lifelong issue for me.  \n\nAlthough, somewhere around the age of one and a half or two there is a picture of me with a piece of chicken in my hand. But I don't know what happened after that because I don't have any memory of ever eating chicken. Or any other kind of thing like pork chops or steak or anything like that. I can eat ground beef, I can even eat raw ground beef, but not in state form. People will never understand unless they live with this.",
      "created_utc": 1730653899.0,
      "score": 1,
      "context": []
    },
    {
      "id": "luzcsk5",
      "author": "sugaredsnickerdoodle",
      "body": "I think for people without eating issues \"I don't like it\" is more along the lines of maybe how we'd feel if something is slightly too salty, for example. Like, this is still okay food, just perhaps not how I would've prepared it or generally not my preference, but fine to eat.",
      "created_utc": 1730528747.0,
      "score": 16,
      "context": [
        {
          "id": "luxldqv",
          "author": "N7_Hellblazer",
          "body": "The way I see it is they don’t have the same reaction we do. They may dislike something but we have a severe reaction to it, like in our case gagging or throwing up. For them it’s a minor inconvenience. \n\nIf my partner doesn’t like something he will say he doesn’t like it but finish it if it ain’t so bad for him. I’m less confused by it by watching others reaction and realising for me it is a lot more extreme. Better to avoid those foods.",
          "created_utc": 1730500755.0
        }
      ]
    },
    {
      "id": "luxqzas",
      "author": "AllStitchedTogether",
      "body": "My partner is also a \"will eat anything\" guy. It's so nice having someone around who will eat what I can't! We both hate food waste, so having someone like him around makes me feel like I can be a little more adventurous sometimes without the fear of throwing it away of I don't like it.",
      "created_utc": 1730502774.0,
      "score": 24,
      "context": [
        {
          "id": "luxm9cc",
          "author": "retropillow",
          "body": "I didn't understand either until I managed to eat tacos. I don't like the taste, and I realized that if anyone but my mom makes them I probably can't eat it, but I will still do it if that's what my parents are making.\n\nThankfully my boyfriend is the \"its food, I'll eat it even if I don't like it\" type so sometimes I feel adventurous and buy a weird soda and hate it and then he finishes it for me.",
          "created_utc": 1730501073.0
        }
      ]
    },
    {
      "id": "lv9wv2r",
      "author": "Backrow6",
      "body": "I'm 40 and I've been functionally \"over\" my ARFID since some time in my 20s.\n\n\nBut there are loads of formerly unsafe foods where I now CAN eat them, but every time I do it feels like I'm completing a challenge. \n\n\nIf I lived alone I'd probably never eat a lamb chop or a fish finger again. But I have 3 small kids who eat dinner with me every day, so I want to model a healthy and varied diet. \n\n\nI only recently realised how big or small that challenge can be, depending on things like my mood, stress level, or just the level of noise in the room.",
      "created_utc": 1730681765.0,
      "score": 2,
      "context": [
        {
          "id": "luxptxd",
          "author": "LeakyFountainPen",
          "body": "Yeah, that was a big revelation for me one day. I don't LOVE eating carrots and broccoli, but I CAN eat them. I don't like eating bell peppers at all, but I CAN eat them.\n\nHad a conversation with my mom many years ago and it came up. She was shocked and said something like \"but I thought you loved carrots & broccoli? They were the only vegetables I could get you to eat as a kid?\"\n\nAnd I really had to break it down that there were tons of foods that were on my \"can eat\" list that I genuinely did not like. But I eat them because they're some of the few foods that don't make me gag/vomit, so they're on the menu by necessity.\n\nThat was when I finally realized that the reason everyone always got so frustrated with my \"picky eating\" is that they thought I was kicking up a fuss about like...*actual* preferences. Like a snooty sort of \"oh, it's not my most favorite, so make it different!! Only the best for me!!\" when from my end it was that I genuinely couldn't even get it near my mouth. (Like trying to make yourself eat someone else's snot.)",
          "created_utc": 1730502362.0
        }
      ]
    },
    {
      "id": "mqqv4rx",
      "author": "KSTornadoGirl",
      "body": "That sounds...exhausting \n\nI'm thankful that my arfid isn't bad enough that I have to go to therapy for it because I imagine that's what a therapist would try and tell me to do.",
      "created_utc": 1746468046.0,
      "score": 2,
      "context": [
        {
          "id": "lv03v7v",
          "author": "Fantastic-Leopard131",
          "body": "Part of me overcoming AFRID was accepting that im not always going to like a food but that i still need to eat anyways. I dont like a lot of foods, so i have to eat foods i dont like to be healthy. You just force it down and learn to accept that enjoying someone isnt a requirement to eat it.",
          "created_utc": 1730547301.0
        }
      ]
    },
    {
      "id": "lvaehrp",
      "author": "xThyQueen",
      "body": "Except I literally can't. I have an intense smell and the moment my sensory smell receptors take in something that is extremely overwhelming to me my gag reflux starts and it's before I even eat it. I will try to force food and my throat will close up and I will gag it out. You don't think a lot of us have tried to force stuff? Our nervous system believes it's under attack and does whatever it has to, to prevent whatever it believes is attacking us. I hate it but it's how my system works. I can't eat broccoli for the life of me, even though I know nothing is wrong with it, the smell and texture just set off alarms in my brain and my throat will not let me swallow it. It's crazy.",
      "created_utc": 1730688192.0,
      "score": 1,
      "context": [
        {
          "id": "lv03v7v",
          "author": "Fantastic-Leopard131",
          "body": "Part of me overcoming AFRID was accepting that im not always going to like a food but that i still need to eat anyways. I dont like a lot of foods, so i have to eat foods i dont like to be healthy. You just force it down and learn to accept that enjoying someone isnt a requirement to eat it.",
          "created_utc": 1730547301.0
        }
      ]
    },
    {
      "id": "mypu47t",
      "author": "Fantastic-Leopard131",
      "body": "I didn’t just go to therapy, i was in a whole treatment program for 8hr a day for 8 months and yes, you dont get a choice to eat what you like. You eat whats in front of you and dont leave until it’s gone. You get 3 set no’s you pick at the beginning of treatment, if its not one of those three nos you will be forced to eat it. And if you refuse to eat theyll kick you out of treatment. Its shitty af but it also saved my life. \n\nWhen it’s something i dont like i treat it like i would if i were chugging vodka - just plug your nose and shove it down your throat as fast as possible, try to swallow before you can throw up then hold it in till the gagging passes. My therapist was not a fan when i told her that, but i was like you want me to get it down right? And she just kinda threw up her hands and was like yeah i guess you gotta do what you gotta do.",
      "created_utc": 1750374728.0,
      "score": 1,
      "context": [
        {
          "id": "lv03v7v",
          "author": "Fantastic-Leopard131",
          "body": "Part of me overcoming AFRID was accepting that im not always going to like a food but that i still need to eat anyways. I dont like a lot of foods, so i have to eat foods i dont like to be healthy. You just force it down and learn to accept that enjoying someone isnt a requirement to eat it.",
          "created_utc": 1730547301.0
        },
        {
          "id": "mqqv4rx",
          "author": "KSTornadoGirl",
          "body": "That sounds...exhausting \n\nI'm thankful that my arfid isn't bad enough that I have to go to therapy for it because I imagine that's what a therapist would try and tell me to do.",
          "created_utc": 1746468046.0
        }
      ]
    },
    {
      "id": "lvafz3o",
      "author": "Fantastic-Leopard131",
      "body": "Of course i understand that but thats why you have to work to expand the foods that you can eat without gagging. A lot of foods will just never work for you but you can get a lot of variety without a lot of variety if that makes sense lol. Ex- think of all the way potato’s can be done. \n\nYou asked what ppl mean when they dont like a certain food but still eat it, dont get upset now and take it so personally when i just answered your question. Something can be disgusting and you still just force it down and eat it. I may gag at times but theres still a lot of foods i can get down without actually going as far as throwing up. It sucks but you gotta do what you gotta do to be healthy. I view it like cleaning the bathroom, i may gag and hold my nose but i cant just not clean the toilet. Ill complain with you all day about the frequency that you need to eat, it sucks theres no doubt about that.",
      "created_utc": 1730688765.0,
      "score": 1,
      "context": [
        {
          "id": "lv03v7v",
          "author": "Fantastic-Leopard131",
          "body": "Part of me overcoming AFRID was accepting that im not always going to like a food but that i still need to eat anyways. I dont like a lot of foods, so i have to eat foods i dont like to be healthy. You just force it down and learn to accept that enjoying someone isnt a requirement to eat it.",
          "created_utc": 1730547301.0
        },
        {
          "id": "lvaehrp",
          "author": "xThyQueen",
          "body": "Except I literally can't. I have an intense smell and the moment my sensory smell receptors take in something that is extremely overwhelming to me my gag reflux starts and it's before I even eat it. I will try to force food and my throat will close up and I will gag it out. You don't think a lot of us have tried to force stuff? Our nervous system believes it's under attack and does whatever it has to, to prevent whatever it believes is attacking us. I hate it but it's how my system works. I can't eat broccoli for the life of me, even though I know nothing is wrong with it, the smell and texture just set off alarms in my brain and my throat will not let me swallow it. It's crazy.",
          "created_utc": 1730688192.0
        }
      ]
    },
    {
      "id": "mypzzra",
      "author": "KSTornadoGirl",
      "body": "Wow. Were you having the sort of Arfid where you were in danger of starvation? I am the opposite, I just like carbs and such too much and am on the chubby side. To me starvation would be the only thing that might possibly justify such a forceful approach. I hesitate to say much else if it worked for you and you didn't starve, but my mind has a hard time wrapping around it. Anyway, hope things are better for you one way or another these days. Take care!",
      "created_utc": 1750376696.0,
      "score": 1,
      "context": [
        {
          "id": "lv03v7v",
          "author": "Fantastic-Leopard131",
          "body": "Part of me overcoming AFRID was accepting that im not always going to like a food but that i still need to eat anyways. I dont like a lot of foods, so i have to eat foods i dont like to be healthy. You just force it down and learn to accept that enjoying someone isnt a requirement to eat it.",
          "created_utc": 1730547301.0
        },
        {
          "id": "mqqv4rx",
          "author": "KSTornadoGirl",
          "body": "That sounds...exhausting \n\nI'm thankful that my arfid isn't bad enough that I have to go to therapy for it because I imagine that's what a therapist would try and tell me to do.",
          "created_utc": 1746468046.0
        },
        {
          "id": "mypu47t",
          "author": "Fantastic-Leopard131",
          "body": "I didn’t just go to therapy, i was in a whole treatment program for 8hr a day for 8 months and yes, you dont get a choice to eat what you like. You eat whats in front of you and dont leave until it’s gone. You get 3 set no’s you pick at the beginning of treatment, if its not one of those three nos you will be forced to eat it. And if you refuse to eat theyll kick you out of treatment. Its shitty af but it also saved my life. \n\nWhen it’s something i dont like i treat it like i would if i were chugging vodka - just plug your nose and shove it down your throat as fast as possible, try to swallow before you can throw up then hold it in till the gagging passes. My therapist was not a fan when i told her that, but i was like you want me to get it down right? And she just kinda threw up her hands and was like yeah i guess you gotta do what you gotta do.",
          "created_utc": 1750374728.0
        }
      ]
    },
    {
      "id": "lvaoobc",
      "author": "xThyQueen",
      "body": "I don't think you understand and that's okay. Gagging from something nasty is not the same as gagging cause my brain thinks it's under attack. Completely different instances. Like I said you just don't understand and that's fine.",
      "created_utc": 1730692285.0,
      "score": 1,
      "context": [
        {
          "id": "lv03v7v",
          "author": "Fantastic-Leopard131",
          "body": "Part of me overcoming AFRID was accepting that im not always going to like a food but that i still need to eat anyways. I dont like a lot of foods, so i have to eat foods i dont like to be healthy. You just force it down and learn to accept that enjoying someone isnt a requirement to eat it.",
          "created_utc": 1730547301.0
        },
        {
          "id": "lvaehrp",
          "author": "xThyQueen",
          "body": "Except I literally can't. I have an intense smell and the moment my sensory smell receptors take in something that is extremely overwhelming to me my gag reflux starts and it's before I even eat it. I will try to force food and my throat will close up and I will gag it out. You don't think a lot of us have tried to force stuff? Our nervous system believes it's under attack and does whatever it has to, to prevent whatever it believes is attacking us. I hate it but it's how my system works. I can't eat broccoli for the life of me, even though I know nothing is wrong with it, the smell and texture just set off alarms in my brain and my throat will not let me swallow it. It's crazy.",
          "created_utc": 1730688192.0
        },
        {
          "id": "lvafz3o",
          "author": "Fantastic-Leopard131",
          "body": "Of course i understand that but thats why you have to work to expand the foods that you can eat without gagging. A lot of foods will just never work for you but you can get a lot of variety without a lot of variety if that makes sense lol. Ex- think of all the way potato’s can be done. \n\nYou asked what ppl mean when they dont like a certain food but still eat it, dont get upset now and take it so personally when i just answered your question. Something can be disgusting and you still just force it down and eat it. I may gag at times but theres still a lot of foods i can get down without actually going as far as throwing up. It sucks but you gotta do what you gotta do to be healthy. I view it like cleaning the bathroom, i may gag and hold my nose but i cant just not clean the toilet. Ill complain with you all day about the frequency that you need to eat, it sucks theres no doubt about that.",
          "created_utc": 1730688765.0
        }
      ]
    },
    {
      "id": "myq53an",
      "author": "Fantastic-Leopard131",
      "body": "Yeah im 5’-7” and weighed less than 100 lbs at my lowest. I looked like a skeleton and some of my organs and bodily processes were starting to shut down. I keep an eye on my weight now, 130 is my minimum of what is healthy so if i dip below that i know im getting back into a danger zone. And it is often enough that i get to 130 and go ah fuck gotta start forcing shit down again to try and gain a bit. I tried really hard not to go to treatment - i mean 8 hours a day, you gotta put your whole life on hold. But i had stomach paralysis so eating more than a few bites was very painful and i wasn’t going to get over that hump of getting my digestion working again without some help. \n\nIve been an athlete in the past (college soccer) so im familiar with a mindset of pushing through the pain and going hard and that was something i adopted in my treatment. Im also a perfectionist so my therapists didnt know what to do with me when i demanded they grade my food logs. They literally were like “im not sure this mentality is healthy” but it did work and i got out of there faster than most. But i did all that so that i dont have to go that extreme again. \n\nA big part of my arfid is lack of interest in food. Like almost no interest. You could put my favorite food in front of me and it’s 50/50 if id actually want to eat it. So i starve if i only eat when i actually want to. I’ve had to settle with indifference or just not actively gagging being a pretty good reaction.",
      "created_utc": 1750378480.0,
      "score": 2,
      "context": [
        {
          "id": "lv03v7v",
          "author": "Fantastic-Leopard131",
          "body": "Part of me overcoming AFRID was accepting that im not always going to like a food but that i still need to eat anyways. I dont like a lot of foods, so i have to eat foods i dont like to be healthy. You just force it down and learn to accept that enjoying someone isnt a requirement to eat it.",
          "created_utc": 1730547301.0
        },
        {
          "id": "mqqv4rx",
          "author": "KSTornadoGirl",
          "body": "That sounds...exhausting \n\nI'm thankful that my arfid isn't bad enough that I have to go to therapy for it because I imagine that's what a therapist would try and tell me to do.",
          "created_utc": 1746468046.0
        },
        {
          "id": "mypu47t",
          "author": "Fantastic-Leopard131",
          "body": "I didn’t just go to therapy, i was in a whole treatment program for 8hr a day for 8 months and yes, you dont get a choice to eat what you like. You eat whats in front of you and dont leave until it’s gone. You get 3 set no’s you pick at the beginning of treatment, if its not one of those three nos you will be forced to eat it. And if you refuse to eat theyll kick you out of treatment. Its shitty af but it also saved my life. \n\nWhen it’s something i dont like i treat it like i would if i were chugging vodka - just plug your nose and shove it down your throat as fast as possible, try to swallow before you can throw up then hold it in till the gagging passes. My therapist was not a fan when i told her that, but i was like you want me to get it down right? And she just kinda threw up her hands and was like yeah i guess you gotta do what you gotta do.",
          "created_utc": 1750374728.0
        },
        {
          "id": "mypzzra",
          "author": "KSTornadoGirl",
          "body": "Wow. Were you having the sort of Arfid where you were in danger of starvation? I am the opposite, I just like carbs and such too much and am on the chubby side. To me starvation would be the only thing that might possibly justify such a forceful approach. I hesitate to say much else if it worked for you and you didn't starve, but my mind has a hard time wrapping around it. Anyway, hope things are better for you one way or another these days. Take care!",
          "created_utc": 1750376696.0
        }
      ]
    },
    {
      "id": "lvatqm8",
      "author": "Fantastic-Leopard131",
      "body": "You act like i dont have the same disorder. If you dont want to be open minded do you but dont come on Reddit and ask a question then get mad when someone answers it. Im talking about my experience, the thing you asked about, and you cant help but make it about you. Please learn some perspective, its exhausting trying to talk to you. Ive done the work to be able to be healthy, you clearly dont understand that you can do things to grow and dont just have to accept your situation as it is. Absolutes and black and white thinking are something they work on a lot in treatment, you may benefit from getting some.",
      "created_utc": 1730694528.0,
      "score": 1,
      "context": [
        {
          "id": "lv03v7v",
          "author": "Fantastic-Leopard131",
          "body": "Part of me overcoming AFRID was accepting that im not always going to like a food but that i still need to eat anyways. I dont like a lot of foods, so i have to eat foods i dont like to be healthy. You just force it down and learn to accept that enjoying someone isnt a requirement to eat it.",
          "created_utc": 1730547301.0
        },
        {
          "id": "lvaehrp",
          "author": "xThyQueen",
          "body": "Except I literally can't. I have an intense smell and the moment my sensory smell receptors take in something that is extremely overwhelming to me my gag reflux starts and it's before I even eat it. I will try to force food and my throat will close up and I will gag it out. You don't think a lot of us have tried to force stuff? Our nervous system believes it's under attack and does whatever it has to, to prevent whatever it believes is attacking us. I hate it but it's how my system works. I can't eat broccoli for the life of me, even though I know nothing is wrong with it, the smell and texture just set off alarms in my brain and my throat will not let me swallow it. It's crazy.",
          "created_utc": 1730688192.0
        },
        {
          "id": "lvafz3o",
          "author": "Fantastic-Leopard131",
          "body": "Of course i understand that but thats why you have to work to expand the foods that you can eat without gagging. A lot of foods will just never work for you but you can get a lot of variety without a lot of variety if that makes sense lol. Ex- think of all the way potato’s can be done. \n\nYou asked what ppl mean when they dont like a certain food but still eat it, dont get upset now and take it so personally when i just answered your question. Something can be disgusting and you still just force it down and eat it. I may gag at times but theres still a lot of foods i can get down without actually going as far as throwing up. It sucks but you gotta do what you gotta do to be healthy. I view it like cleaning the bathroom, i may gag and hold my nose but i cant just not clean the toilet. Ill complain with you all day about the frequency that you need to eat, it sucks theres no doubt about that.",
          "created_utc": 1730688765.0
        },
        {
          "id": "lvaoobc",
          "author": "xThyQueen",
          "body": "I don't think you understand and that's okay. Gagging from something nasty is not the same as gagging cause my brain thinks it's under attack. Completely different instances. Like I said you just don't understand and that's fine.",
          "created_utc": 1730692285.0
        }
      ]
    },
    {
      "id": "myu9a2f",
      "author": "KSTornadoGirl",
      "body": "Yeah, I guess if you had the sports discipline thing going on you could kind of view it as like bootcamp.\n\nIf someone were to throw a big pile of money at me, I wonder if I could design (or hire the right folks to design) a study of the neurobiology of the various subtypes of arfid. Because my type is more sensory, and some people deal with PTSD from experiences such as choking, and then there are those like you - maybe there's something going on with the brain region that controls the actual desire to eat. The study could possibly include stroke patients who lose the motivation to eat and see if they can spot the smoking gun and then scan arfid sufferers and see if anything similar is going on with them.\n\nAgain, good luck, you've been through a lot of struggle with this. Hope the bootcamp results are lasting for all the effort and expense you put in.",
      "created_utc": 1750438235.0,
      "score": 2,
      "context": [
        {
          "id": "lv03v7v",
          "author": "Fantastic-Leopard131",
          "body": "Part of me overcoming AFRID was accepting that im not always going to like a food but that i still need to eat anyways. I dont like a lot of foods, so i have to eat foods i dont like to be healthy. You just force it down and learn to accept that enjoying someone isnt a requirement to eat it.",
          "created_utc": 1730547301.0
        },
        {
          "id": "mqqv4rx",
          "author": "KSTornadoGirl",
          "body": "That sounds...exhausting \n\nI'm thankful that my arfid isn't bad enough that I have to go to therapy for it because I imagine that's what a therapist would try and tell me to do.",
          "created_utc": 1746468046.0
        },
        {
          "id": "mypu47t",
          "author": "Fantastic-Leopard131",
          "body": "I didn’t just go to therapy, i was in a whole treatment program for 8hr a day for 8 months and yes, you dont get a choice to eat what you like. You eat whats in front of you and dont leave until it’s gone. You get 3 set no’s you pick at the beginning of treatment, if its not one of those three nos you will be forced to eat it. And if you refuse to eat theyll kick you out of treatment. Its shitty af but it also saved my life. \n\nWhen it’s something i dont like i treat it like i would if i were chugging vodka - just plug your nose and shove it down your throat as fast as possible, try to swallow before you can throw up then hold it in till the gagging passes. My therapist was not a fan when i told her that, but i was like you want me to get it down right? And she just kinda threw up her hands and was like yeah i guess you gotta do what you gotta do.",
          "created_utc": 1750374728.0
        },
        {
          "id": "mypzzra",
          "author": "KSTornadoGirl",
          "body": "Wow. Were you having the sort of Arfid where you were in danger of starvation? I am the opposite, I just like carbs and such too much and am on the chubby side. To me starvation would be the only thing that might possibly justify such a forceful approach. I hesitate to say much else if it worked for you and you didn't starve, but my mind has a hard time wrapping around it. Anyway, hope things are better for you one way or another these days. Take care!",
          "created_utc": 1750376696.0
        },
        {
          "id": "myq53an",
          "author": "Fantastic-Leopard131",
          "body": "Yeah im 5’-7” and weighed less than 100 lbs at my lowest. I looked like a skeleton and some of my organs and bodily processes were starting to shut down. I keep an eye on my weight now, 130 is my minimum of what is healthy so if i dip below that i know im getting back into a danger zone. And it is often enough that i get to 130 and go ah fuck gotta start forcing shit down again to try and gain a bit. I tried really hard not to go to treatment - i mean 8 hours a day, you gotta put your whole life on hold. But i had stomach paralysis so eating more than a few bites was very painful and i wasn’t going to get over that hump of getting my digestion working again without some help. \n\nIve been an athlete in the past (college soccer) so im familiar with a mindset of pushing through the pain and going hard and that was something i adopted in my treatment. Im also a perfectionist so my therapists didnt know what to do with me when i demanded they grade my food logs. They literally were like “im not sure this mentality is healthy” but it did work and i got out of there faster than most. But i did all that so that i dont have to go that extreme again. \n\nA big part of my arfid is lack of interest in food. Like almost no interest. You could put my favorite food in front of me and it’s 50/50 if id actually want to eat it. So i starve if i only eat when i actually want to. I’ve had to settle with indifference or just not actively gagging being a pretty good reaction.",
          "created_utc": 1750378480.0
        }
      ]
    },
    {
      "id": "lw6d9fx",
      "author": "xThyQueen",
      "body": "No you're just telling me how I am. I am not telling you how you are. You are telling me how to deal and maybe I should do this. Well I'm 33 and have tried all of that. This is how I am. You take some perspective and stop assuming people can just do things when they can't.",
      "created_utc": 1731113673.0,
      "score": 1,
      "context": [
        {
          "id": "lv03v7v",
          "author": "Fantastic-Leopard131",
          "body": "Part of me overcoming AFRID was accepting that im not always going to like a food but that i still need to eat anyways. I dont like a lot of foods, so i have to eat foods i dont like to be healthy. You just force it down and learn to accept that enjoying someone isnt a requirement to eat it.",
          "created_utc": 1730547301.0
        },
        {
          "id": "lvaehrp",
          "author": "xThyQueen",
          "body": "Except I literally can't. I have an intense smell and the moment my sensory smell receptors take in something that is extremely overwhelming to me my gag reflux starts and it's before I even eat it. I will try to force food and my throat will close up and I will gag it out. You don't think a lot of us have tried to force stuff? Our nervous system believes it's under attack and does whatever it has to, to prevent whatever it believes is attacking us. I hate it but it's how my system works. I can't eat broccoli for the life of me, even though I know nothing is wrong with it, the smell and texture just set off alarms in my brain and my throat will not let me swallow it. It's crazy.",
          "created_utc": 1730688192.0
        },
        {
          "id": "lvafz3o",
          "author": "Fantastic-Leopard131",
          "body": "Of course i understand that but thats why you have to work to expand the foods that you can eat without gagging. A lot of foods will just never work for you but you can get a lot of variety without a lot of variety if that makes sense lol. Ex- think of all the way potato’s can be done. \n\nYou asked what ppl mean when they dont like a certain food but still eat it, dont get upset now and take it so personally when i just answered your question. Something can be disgusting and you still just force it down and eat it. I may gag at times but theres still a lot of foods i can get down without actually going as far as throwing up. It sucks but you gotta do what you gotta do to be healthy. I view it like cleaning the bathroom, i may gag and hold my nose but i cant just not clean the toilet. Ill complain with you all day about the frequency that you need to eat, it sucks theres no doubt about that.",
          "created_utc": 1730688765.0
        },
        {
          "id": "lvaoobc",
          "author": "xThyQueen",
          "body": "I don't think you understand and that's okay. Gagging from something nasty is not the same as gagging cause my brain thinks it's under attack. Completely different instances. Like I said you just don't understand and that's fine.",
          "created_utc": 1730692285.0
        },
        {
          "id": "lvatqm8",
          "author": "Fantastic-Leopard131",
          "body": "You act like i dont have the same disorder. If you dont want to be open minded do you but dont come on Reddit and ask a question then get mad when someone answers it. Im talking about my experience, the thing you asked about, and you cant help but make it about you. Please learn some perspective, its exhausting trying to talk to you. Ive done the work to be able to be healthy, you clearly dont understand that you can do things to grow and dont just have to accept your situation as it is. Absolutes and black and white thinking are something they work on a lot in treatment, you may benefit from getting some.",
          "created_utc": 1730694528.0
        }
      ]
    },
    {
      "id": "mywka0e",
      "author": "Fantastic-Leopard131",
      "body": "Yeah viewing it as bootcamp is a good way to describe it. Thanks for the kind words, ive been out for about a year and have been able to maintain it so far so as long as i keep an eye on it i should be ok. It’s when i dont actively track how much im eating that i dont realize how little calories im actually eating. I have to put a good bit of intentional effort into making sure im getting close to 1500 calories a day. If i dont actively count and make myself eat more to get close to that number i usually wont get above 800 cals. \n\nI would definitely love to see a study on that. I have part of the sensitivity side too bc food texture is a big thing for me. Most of the foods i hate or gag on are due to the texture rather than taste and some of my favorite snacks, like frozen peas, have little pros or cons to the taste but a great texture. Im sure there’s different factors, i mean hunger and desire to eat are literally based off of hormone production so we already know there’s scientific backing for certain factors, but arfid is so new of a medical diagnosis i just dont think there really been any real research on it yet. Ill be interested to see what more we learn about it as time goes on and it gains more traction. Right now ppl who aren’t diagnosed usually have never even heard of it. I mean i was in the depths of being underweight for a while before i even learned what it was and found out there’s treatment for it. Bc i dont have body image issues so tactics for helping anorexic didn’t help and for a while that was all i knew until i went to someone specializing in diagnosing and treating arfid. And ironically i learned what arfid was from reddit bc i made a post describing my issues and asking if anyone else experiences something similar and 1 person replied and was like yeah that’s arfid and sent me to this sub. My primary care doc has notes about it in my file, ARFID isnt even one of the ED options in their system so the notes are under the anorexia section/tag. Im hoping more research starts to become available on it soon.",
      "created_utc": 1750463849.0,
      "score": 2,
      "context": [
        {
          "id": "lv03v7v",
          "author": "Fantastic-Leopard131",
          "body": "Part of me overcoming AFRID was accepting that im not always going to like a food but that i still need to eat anyways. I dont like a lot of foods, so i have to eat foods i dont like to be healthy. You just force it down and learn to accept that enjoying someone isnt a requirement to eat it.",
          "created_utc": 1730547301.0
        },
        {
          "id": "mqqv4rx",
          "author": "KSTornadoGirl",
          "body": "That sounds...exhausting \n\nI'm thankful that my arfid isn't bad enough that I have to go to therapy for it because I imagine that's what a therapist would try and tell me to do.",
          "created_utc": 1746468046.0
        },
        {
          "id": "mypu47t",
          "author": "Fantastic-Leopard131",
          "body": "I didn’t just go to therapy, i was in a whole treatment program for 8hr a day for 8 months and yes, you dont get a choice to eat what you like. You eat whats in front of you and dont leave until it’s gone. You get 3 set no’s you pick at the beginning of treatment, if its not one of those three nos you will be forced to eat it. And if you refuse to eat theyll kick you out of treatment. Its shitty af but it also saved my life. \n\nWhen it’s something i dont like i treat it like i would if i were chugging vodka - just plug your nose and shove it down your throat as fast as possible, try to swallow before you can throw up then hold it in till the gagging passes. My therapist was not a fan when i told her that, but i was like you want me to get it down right? And she just kinda threw up her hands and was like yeah i guess you gotta do what you gotta do.",
          "created_utc": 1750374728.0
        },
        {
          "id": "mypzzra",
          "author": "KSTornadoGirl",
          "body": "Wow. Were you having the sort of Arfid where you were in danger of starvation? I am the opposite, I just like carbs and such too much and am on the chubby side. To me starvation would be the only thing that might possibly justify such a forceful approach. I hesitate to say much else if it worked for you and you didn't starve, but my mind has a hard time wrapping around it. Anyway, hope things are better for you one way or another these days. Take care!",
          "created_utc": 1750376696.0
        },
        {
          "id": "myq53an",
          "author": "Fantastic-Leopard131",
          "body": "Yeah im 5’-7” and weighed less than 100 lbs at my lowest. I looked like a skeleton and some of my organs and bodily processes were starting to shut down. I keep an eye on my weight now, 130 is my minimum of what is healthy so if i dip below that i know im getting back into a danger zone. And it is often enough that i get to 130 and go ah fuck gotta start forcing shit down again to try and gain a bit. I tried really hard not to go to treatment - i mean 8 hours a day, you gotta put your whole life on hold. But i had stomach paralysis so eating more than a few bites was very painful and i wasn’t going to get over that hump of getting my digestion working again without some help. \n\nIve been an athlete in the past (college soccer) so im familiar with a mindset of pushing through the pain and going hard and that was something i adopted in my treatment. Im also a perfectionist so my therapists didnt know what to do with me when i demanded they grade my food logs. They literally were like “im not sure this mentality is healthy” but it did work and i got out of there faster than most. But i did all that so that i dont have to go that extreme again. \n\nA big part of my arfid is lack of interest in food. Like almost no interest. You could put my favorite food in front of me and it’s 50/50 if id actually want to eat it. So i starve if i only eat when i actually want to. I’ve had to settle with indifference or just not actively gagging being a pretty good reaction.",
          "created_utc": 1750378480.0
        },
        {
          "id": "myu9a2f",
          "author": "KSTornadoGirl",
          "body": "Yeah, I guess if you had the sports discipline thing going on you could kind of view it as like bootcamp.\n\nIf someone were to throw a big pile of money at me, I wonder if I could design (or hire the right folks to design) a study of the neurobiology of the various subtypes of arfid. Because my type is more sensory, and some people deal with PTSD from experiences such as choking, and then there are those like you - maybe there's something going on with the brain region that controls the actual desire to eat. The study could possibly include stroke patients who lose the motivation to eat and see if they can spot the smoking gun and then scan arfid sufferers and see if anything similar is going on with them.\n\nAgain, good luck, you've been through a lot of struggle with this. Hope the bootcamp results are lasting for all the effort and expense you put in.",
          "created_utc": 1750438235.0
        }
      ]
    },
    {
      "id": "myx03nl",
      "author": "KSTornadoGirl",
      "body": "Yeah, there definitely needs to be much research. Interviews and written accounts from people who have it and maybe also their parents, siblings, spouses... those accounts should first of all be compared against accounts of anorexia because the difference is usually readily apparent if you know what to look for. I have read a story here and there of arfid people who were sadly accused of being anorexic and treated as if they were lying and that's no good. \n\nThen the first person arfid accounts could be grouped into type(s) of arfid. More data could be gathered about whether they have conditions such as autism or ADHD, OCD, PTSD, etc. FMRI studies could look for neural connections and such.\n\nTreatment options need to be expanded as well, because I'll speak for myself anyway, not everyone is going to be desperate enough to try the bootcamp approach. Right now I'm looking at what changes I might make in order to improve my cholesterol so I don't have to go on a statin pill. But few of the recommended foods are things that I can imagine myself ingesting.",
      "created_utc": 1750469750.0,
      "score": 1,
      "context": [
        {
          "id": "lv03v7v",
          "author": "Fantastic-Leopard131",
          "body": "Part of me overcoming AFRID was accepting that im not always going to like a food but that i still need to eat anyways. I dont like a lot of foods, so i have to eat foods i dont like to be healthy. You just force it down and learn to accept that enjoying someone isnt a requirement to eat it.",
          "created_utc": 1730547301.0
        },
        {
          "id": "mqqv4rx",
          "author": "KSTornadoGirl",
          "body": "That sounds...exhausting \n\nI'm thankful that my arfid isn't bad enough that I have to go to therapy for it because I imagine that's what a therapist would try and tell me to do.",
          "created_utc": 1746468046.0
        },
        {
          "id": "mypu47t",
          "author": "Fantastic-Leopard131",
          "body": "I didn’t just go to therapy, i was in a whole treatment program for 8hr a day for 8 months and yes, you dont get a choice to eat what you like. You eat whats in front of you and dont leave until it’s gone. You get 3 set no’s you pick at the beginning of treatment, if its not one of those three nos you will be forced to eat it. And if you refuse to eat theyll kick you out of treatment. Its shitty af but it also saved my life. \n\nWhen it’s something i dont like i treat it like i would if i were chugging vodka - just plug your nose and shove it down your throat as fast as possible, try to swallow before you can throw up then hold it in till the gagging passes. My therapist was not a fan when i told her that, but i was like you want me to get it down right? And she just kinda threw up her hands and was like yeah i guess you gotta do what you gotta do.",
          "created_utc": 1750374728.0
        },
        {
          "id": "mypzzra",
          "author": "KSTornadoGirl",
          "body": "Wow. Were you having the sort of Arfid where you were in danger of starvation? I am the opposite, I just like carbs and such too much and am on the chubby side. To me starvation would be the only thing that might possibly justify such a forceful approach. I hesitate to say much else if it worked for you and you didn't starve, but my mind has a hard time wrapping around it. Anyway, hope things are better for you one way or another these days. Take care!",
          "created_utc": 1750376696.0
        },
        {
          "id": "myq53an",
          "author": "Fantastic-Leopard131",
          "body": "Yeah im 5’-7” and weighed less than 100 lbs at my lowest. I looked like a skeleton and some of my organs and bodily processes were starting to shut down. I keep an eye on my weight now, 130 is my minimum of what is healthy so if i dip below that i know im getting back into a danger zone. And it is often enough that i get to 130 and go ah fuck gotta start forcing shit down again to try and gain a bit. I tried really hard not to go to treatment - i mean 8 hours a day, you gotta put your whole life on hold. But i had stomach paralysis so eating more than a few bites was very painful and i wasn’t going to get over that hump of getting my digestion working again without some help. \n\nIve been an athlete in the past (college soccer) so im familiar with a mindset of pushing through the pain and going hard and that was something i adopted in my treatment. Im also a perfectionist so my therapists didnt know what to do with me when i demanded they grade my food logs. They literally were like “im not sure this mentality is healthy” but it did work and i got out of there faster than most. But i did all that so that i dont have to go that extreme again. \n\nA big part of my arfid is lack of interest in food. Like almost no interest. You could put my favorite food in front of me and it’s 50/50 if id actually want to eat it. So i starve if i only eat when i actually want to. I’ve had to settle with indifference or just not actively gagging being a pretty good reaction.",
          "created_utc": 1750378480.0
        },
        {
          "id": "myu9a2f",
          "author": "KSTornadoGirl",
          "body": "Yeah, I guess if you had the sports discipline thing going on you could kind of view it as like bootcamp.\n\nIf someone were to throw a big pile of money at me, I wonder if I could design (or hire the right folks to design) a study of the neurobiology of the various subtypes of arfid. Because my type is more sensory, and some people deal with PTSD from experiences such as choking, and then there are those like you - maybe there's something going on with the brain region that controls the actual desire to eat. The study could possibly include stroke patients who lose the motivation to eat and see if they can spot the smoking gun and then scan arfid sufferers and see if anything similar is going on with them.\n\nAgain, good luck, you've been through a lot of struggle with this. Hope the bootcamp results are lasting for all the effort and expense you put in.",
          "created_utc": 1750438235.0
        },
        {
          "id": "mywka0e",
          "author": "Fantastic-Leopard131",
          "body": "Yeah viewing it as bootcamp is a good way to describe it. Thanks for the kind words, ive been out for about a year and have been able to maintain it so far so as long as i keep an eye on it i should be ok. It’s when i dont actively track how much im eating that i dont realize how little calories im actually eating. I have to put a good bit of intentional effort into making sure im getting close to 1500 calories a day. If i dont actively count and make myself eat more to get close to that number i usually wont get above 800 cals. \n\nI would definitely love to see a study on that. I have part of the sensitivity side too bc food texture is a big thing for me. Most of the foods i hate or gag on are due to the texture rather than taste and some of my favorite snacks, like frozen peas, have little pros or cons to the taste but a great texture. Im sure there’s different factors, i mean hunger and desire to eat are literally based off of hormone production so we already know there’s scientific backing for certain factors, but arfid is so new of a medical diagnosis i just dont think there really been any real research on it yet. Ill be interested to see what more we learn about it as time goes on and it gains more traction. Right now ppl who aren’t diagnosed usually have never even heard of it. I mean i was in the depths of being underweight for a while before i even learned what it was and found out there’s treatment for it. Bc i dont have body image issues so tactics for helping anorexic didn’t help and for a while that was all i knew until i went to someone specializing in diagnosing and treating arfid. And ironically i learned what arfid was from reddit bc i made a post describing my issues and asking if anyone else experiences something similar and 1 person replied and was like yeah that’s arfid and sent me to this sub. My primary care doc has notes about it in my file, ARFID isnt even one of the ED options in their system so the notes are under the anorexia section/tag. Im hoping more research starts to become available on it soon.",
          "created_utc": 1750463849.0
        }
      ]
    }
  ]
}