{
  "id": "1gqs4wb",
  "subreddit": "ARFID",
  "author": "blaiiiiir",
  "created_utc": 1731544108.0,
  "title": "I can’t stand the people who make fun of people with ARFID and downplay it as if it isn’t a “real” eating disorder",
  "selftext": "I always see comments like “wah wah, you can’t eat your food” “you’re just picky” “grow up”. and the worst is when it’s people that ignore their kids ARFID symptoms and just give them fear foods and say “if you’re hungry enough, you’ll eat it” because they “won’t cater to picky eating”\n\nI feel like these people should be served canned dog food for a week, and told “if you’re hungry enough, you’ll eat it” ",
  "url": "https://www.reddit.com/r/ARFID/comments/1gqs4wb/i_cant_stand_the_people_who_make_fun_of_people/",
  "score": 235,
  "num_comments": 27,
  "comments": [
    {
      "id": "lx0czo5",
      "author": "jemappelletired",
      "body": "My parents did this to me growing up and shocker…. it did not work. It honestly probably made everything worse.",
      "created_utc": 1731544509.0,
      "score": 91,
      "context": []
    },
    {
      "id": "lx0h50o",
      "author": "nibblesweetoats",
      "body": "Pretty much no one takes arfid seriously until you are hospitalized from not being able to eat, and even then everyone will assume it’s anorexia.",
      "created_utc": 1731545974.0,
      "score": 61,
      "context": []
    },
    {
      "id": "lx0l0t8",
      "author": "StrawbraryLiberry",
      "body": "The problem is, no I won't eat it if I'm hungry enough. I will just starve. And I'm really good at starving, unfortunately. \n\nI've also noticed forcing myself to eat things I don't want to can make my symptoms much worse in general. \n\nIt's awful when people downplay this, because it's definitely not fun to deal with. It's not a choice. \n\nForcing kids with ARFID to eat fear foods is abuse.",
      "created_utc": 1731547369.0,
      "score": 53,
      "context": []
    },
    {
      "id": "lx0xmm4",
      "author": "SadisticGoose",
      "body": "I ended up in an eating disorder treatment facility because I had co-morbid atypical anorexia. They had no idea what to do with me. Didn’t even tell me my diagnosis. I struggled to eat the meals because there was always a portion I couldn’t eat. They didn’t understand the difference between not eating for sensory reasons and not eating because I was starving myself. \n\nEven the places for eating disorders don’t understand eating disorders.",
      "created_utc": 1731551895.0,
      "score": 26,
      "context": []
    },
    {
      "id": "lx0ihwj",
      "author": "Playful-Flatworm501",
      "body": "Of course it’s real, I don’t have it but I know people who do, I used to say the same about anxiety but turns out I’m dealing with anxiety myself)",
      "created_utc": 1731546464.0,
      "score": 9,
      "context": []
    },
    {
      "id": "lx7g6le",
      "author": "pendigedig",
      "body": "Gotta post a success story here--my son was admitted to the hospital last week (just overnight thankfully; he's ok now) and the nurse asked me if I had eaten and if she could get me a turkey sandwich or something from their little unit kitchen (they have premade sandwiches for the patients and parents). I got anxious because no I hadn't eaten in like two days because I was so focused on my son, but I have ARFID. So I said so. I said \"Oh, thank you, but I have ARFID, so I have trouble eating quite a few foods.\" And this pediatric nurse KNEW WHAT I WAS TALKING ABOUT!! (I mean, if anyone is gonna know, I assume a pedi nurse will know??) Without missing a beat she said \"No problem, I'll put a parent's meal order in for you and you can order off the cafeteria menu--they have some simple things and packaged foods, if those are easier!\" WHAT A HERO! I was able to call down to the cafeteria for a free \"parent/caregiver\" meal and they brought it up so I could eat it in my son's hospital room. I felt so validated.",
      "created_utc": 1731642595.0,
      "score": 8,
      "context": []
    },
    {
      "id": "lx3j4j4",
      "author": "rthorndy",
      "body": "I wish it was known just as much as anorexia and bulimia. It's every bit as complicated and dangerous. I use that exact analogy when I encounter skepticism -- just *try* dog food, you'll learn to like it!! 😜 People may still find it hard to understand that such a revulsion can exist with normal food, but it gets the point across!",
      "created_utc": 1731597612.0,
      "score": 8,
      "context": []
    },
    {
      "id": "lx0ra3h",
      "author": "bakharat",
      "body": "I'd say it depends. Exposing kids to fear foods on their plate is fine (if you're not forcing them to eat, that is) and may even work with many picky kids. It worked with some dishes in my case. But if it's been the 10th time you offered it and your child still refuses it? Yeah, perhaps something is wrong.\n\n\n Maybe their type of ARFID is caused by sensory issues and then no psychological techniques are gonna help. It's just that most parents don't understand this and just think their kids are being nasty. ",
      "created_utc": 1731549597.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lx2obb6",
      "author": "anxiety_ftw",
      "body": "I truly do not understand why people hate catering to picky rating sometimes. Even looking past ARFID as a topic or cause how are you harmed by giving someone food they like?",
      "created_utc": 1731585547.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lx1tsfg",
      "author": "Angelangepange",
      "body": "Yeah, I had to block some subreddits because that was all they were talking about 🙄 non stop complaining about something that does not affect them in the slightest.  \nWhen I was young my parents were almost (almost) understanding but damn every freaking server at every restaurant had to pick up a fight with me, a kid, for asking for accommodations which was most of the time just no onions please (i would select the one dish that had one safe food but onions were/are in everything). Complains and even yelling sometimes over not wanting to cook meat more. Oof. Did they even get paid enough for that? Like what do you even care?  \nThis does not happen anymore and I don't know if it's because people are better or because I'm an adult and so I'm more intimidating? Or maybe they get really paid less lol.",
      "created_utc": 1731566282.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lx3beic",
      "author": "bblulz",
      "body": "the countless hours i had to sit at the dinner table trying to choke down something without gagging",
      "created_utc": 1731595013.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lx3qnow",
      "author": "FycoPsycho",
      "body": "I had this happen so much as a kid, there was a sort of after-school daycare I went to (mb around 7-10yrs old i cant remember) and I wasn't allowed to get up from the table to play with the other kids, and it was all one room. They even forced me to take milk (normal in our country to have it most meals) since I didn't have a lactoce introlerance, I just couldnt stand it.\n\nI have multiple memories of sitting there at that table until the place closed for the day and i got picked up by a parent, only then did I get to get up. Like how the hell did they think it'd work if they tried ot multiple time & it never worked?? Like that's p much humiliating a kid to eat??\n\nMy mom also repeatedly told me I'd grow up to have various EDs (ofc ARFID only recently got discovered) but specifically by showing me pictures of adults w/ severe EDs like \"thats what you'll grow up to be\" like in what world would that work??",
      "created_utc": 1731599991.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lx6npls",
      "author": "Witty_Health3146",
      "body": "They’re just ignorant unfortunately. Which means they probably won’t learn. It sucks. I try not to take them seriously.",
      "created_utc": 1731632809.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lxamr22",
      "author": "the_grays_of_ink",
      "body": "Yeah, talking to an Ed professional about my other one, and she mentioned sensory issues and said “and then some people don’t even have a real Ed, just arfid! I mean, arfid is a real Ed, but yknow!” No I don’t!! I have arfid. Other patients in treatment didn’t get it either",
      "created_utc": 1731691468.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lxe6jur",
      "author": "schumphrey",
      "body": "ARFID is getting diagnosed more and more so at least it’s getting recognized a bit better than it was a few years ago. I once promised to buy my son anything he wanted if he would just take one little bite of a chicken nugget. He wanted to so badly but just couldn’t do it. Those with ARFID are hard enough on themselves without everyone piling on. Pressure & anxiety will only make eating disorders worse. Patience, understanding and unconditional love help more than pressure ever could. Hugs.",
      "created_utc": 1731736850.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lxjbsoh",
      "author": "DangOldFluffyCat",
      "body": "REALL 🗣️📢📢📢📢📢",
      "created_utc": 1731812402.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lxmt3ec",
      "author": "Big-Camel351",
      "body": "I travelled to Bali earlier this year, it was a lovely expierence! However there was 1 girl that was not my type of friend.\n\nWe were eating out somewhere and i jokingly said “i wonder if they have fries lol” and the first thing this girl says is: “is the only thing you’re eating this trip fries?” In a way that was not cute\n\nMan that comment still hurts :(",
      "created_utc": 1731869985.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lx0damo",
      "author": "blaiiiiir",
      "body": "it’s so awful. I’m lucky enough to have parents that supported my struggle with it but i’ve been in situations without having safe foods before and I’ll definitely starve before forcing myself to eat something I can’t handle",
      "created_utc": 1731544617.0,
      "score": 32,
      "context": [
        {
          "id": "lx0czo5",
          "author": "jemappelletired",
          "body": "My parents did this to me growing up and shocker…. it did not work. It honestly probably made everything worse.",
          "created_utc": 1731544509.0
        }
      ]
    },
    {
      "id": "lx0lh14",
      "author": "QuothetheRaven1845",
      "body": "Yeah I was forced to eat food I hated growing up and if it made me sick I'd get yelled at, called dramatic, etc. They forced me to eat creamed corn once to the point I had to sit up all night if I didn't eat it. Eventually I did and it made me sick. Now I absolutely refuse anything with corn in it.",
      "created_utc": 1731547529.0,
      "score": 18,
      "context": [
        {
          "id": "lx0czo5",
          "author": "jemappelletired",
          "body": "My parents did this to me growing up and shocker…. it did not work. It honestly probably made everything worse.",
          "created_utc": 1731544509.0
        }
      ]
    },
    {
      "id": "lx7c3ha",
      "author": "retropillow",
      "body": "My parents tried to force me to eat something I didn't want to eat ONCE when I was really young.\n\nThey realized I really wasn't just being picky and that continuing would just be abusive.\n\nGlad they did, whenever someone else was babysitting us and didn't get the memo and tried to make me eat stuff I didn't want to, it would really traumatize me.",
      "created_utc": 1731641162.0,
      "score": 2,
      "context": [
        {
          "id": "lx0czo5",
          "author": "jemappelletired",
          "body": "My parents did this to me growing up and shocker…. it did not work. It honestly probably made everything worse.",
          "created_utc": 1731544509.0
        }
      ]
    },
    {
      "id": "lxphw5k",
      "author": "None",
      "body": "Not that my parents did this but most of my family made comments and said some really mean things. My mom would try to make new food and because I also have OCD and I cannot resist the urge to say how gross something is, she just stopped trying. But if I didn’t eat, I would end up making bad choices. That’s why I have so much childhood trauma over this.",
      "created_utc": 1731903907.0,
      "score": 1,
      "context": [
        {
          "id": "lx0czo5",
          "author": "jemappelletired",
          "body": "My parents did this to me growing up and shocker…. it did not work. It honestly probably made everything worse.",
          "created_utc": 1731544509.0
        }
      ]
    },
    {
      "id": "lx5iahc",
      "author": "power36113",
      "body": "And as someone who is a lil chunky (190 lbs) with ARFID, it’s likely almost never taken seriously. I’m just a “picky eater.”",
      "created_utc": 1731619479.0,
      "score": 9,
      "context": [
        {
          "id": "lx0h50o",
          "author": "nibblesweetoats",
          "body": "Pretty much no one takes arfid seriously until you are hospitalized from not being able to eat, and even then everyone will assume it’s anorexia.",
          "created_utc": 1731545974.0
        }
      ]
    },
    {
      "id": "lxedue3",
      "author": "throw0OO0away",
      "body": "I'm just about guaranteed an admission at this point. I'm preparing my case should they assume anorexia over ARFID.",
      "created_utc": 1731740815.0,
      "score": 1,
      "context": [
        {
          "id": "lx0h50o",
          "author": "nibblesweetoats",
          "body": "Pretty much no one takes arfid seriously until you are hospitalized from not being able to eat, and even then everyone will assume it’s anorexia.",
          "created_utc": 1731545974.0
        }
      ]
    },
    {
      "id": "lx4lm16",
      "author": "BillyYumYumTwo-byTwo",
      "body": "“Just eat it”\n\n“No”\n\n“Fine. You’ll eat it when your hungry enough”\n\n“lol”",
      "created_utc": 1731609464.0,
      "score": 13,
      "context": [
        {
          "id": "lx0l0t8",
          "author": "StrawbraryLiberry",
          "body": "The problem is, no I won't eat it if I'm hungry enough. I will just starve. And I'm really good at starving, unfortunately. \n\nI've also noticed forcing myself to eat things I don't want to can make my symptoms much worse in general. \n\nIt's awful when people downplay this, because it's definitely not fun to deal with. It's not a choice. \n\nForcing kids with ARFID to eat fear foods is abuse.",
          "created_utc": 1731547369.0
        }
      ]
    },
    {
      "id": "lx89yp0",
      "author": "MyDogsAreRealCute",
      "body": "Yeah, my daughter’s therapist has told me I can stop doing the exposure therapy with eggs, rice and broccoli. It’s been 2 years. She’s never going to eat them. Actually, the only vegetable she eats is zucchini. \nExposure therapy is nice but not always effective. For us, it’s let her try things here and there, but nothing eaten this way has ever joined her ‘safe’ list. \n\nI have to say, overall, these comments are really sad. So many horror stories of parents who just don’t get it right. I know I won’t always, and I know I haven’t always done the right thing, but at least I try. What a low bar.",
      "created_utc": 1731656370.0,
      "score": 4,
      "context": [
        {
          "id": "lx0ra3h",
          "author": "bakharat",
          "body": "I'd say it depends. Exposing kids to fear foods on their plate is fine (if you're not forcing them to eat, that is) and may even work with many picky kids. It worked with some dishes in my case. But if it's been the 10th time you offered it and your child still refuses it? Yeah, perhaps something is wrong.\n\n\n Maybe their type of ARFID is caused by sensory issues and then no psychological techniques are gonna help. It's just that most parents don't understand this and just think their kids are being nasty. ",
          "created_utc": 1731549597.0
        }
      ]
    },
    {
      "id": "lx4lqsk",
      "author": "Gracecar03",
      "body": "We had a after school program for kids who had to stay later because their parents worked later. They had the program open over the summer and I went until about 6th grade. One year they decided to make a fun little game on Tuesday where they gave us unique foods under a false name like, Iguana meat (spam), tarantula sacks (chick peas). You had to try and guess what it actually was. I used to beg my mom to take me to my aunts on Tuesdays. \n\nI don’t know where adults get off on forcing a child into that when it clearly causes them distress to the point they’re crying every week. I will never forgive them.",
      "created_utc": 1731609504.0,
      "score": 5,
      "context": [
        {
          "id": "lx3qnow",
          "author": "FycoPsycho",
          "body": "I had this happen so much as a kid, there was a sort of after-school daycare I went to (mb around 7-10yrs old i cant remember) and I wasn't allowed to get up from the table to play with the other kids, and it was all one room. They even forced me to take milk (normal in our country to have it most meals) since I didn't have a lactoce introlerance, I just couldnt stand it.\n\nI have multiple memories of sitting there at that table until the place closed for the day and i got picked up by a parent, only then did I get to get up. Like how the hell did they think it'd work if they tried ot multiple time & it never worked?? Like that's p much humiliating a kid to eat??\n\nMy mom also repeatedly told me I'd grow up to have various EDs (ofc ARFID only recently got discovered) but specifically by showing me pictures of adults w/ severe EDs like \"thats what you'll grow up to be\" like in what world would that work??",
          "created_utc": 1731599991.0
        }
      ]
    },
    {
      "id": "lx0vtls",
      "author": "jemappelletired",
      "body": "Ugh I’m sorry. It sounds like we had very similar dinner experiences :(( One time I threw away a couple of dried cranberries after I finished everything else because they have always made me gag every time I was forced to have them. My mom saw them in the trash can and counted out 50 for me to eat. I was 5. \n\nIf it wasn’t a punishment like that, anytime I was anxious about eating something they would pick one or multiple punishments from the list: I lost my comfort item for the night (my blankie), couldn’t have dessert (this one makes sense tbh), wasn’t allowed to pick another option to eat or allowed to modify or pick ingredients out, or I wasn’t allowed to read before bed (my favorite thing in the world to do), and I always had to sit at the dinner table until my food was gone. \n\nI will never understand their logic. Ever.",
      "created_utc": 1731551238.0,
      "score": 14,
      "context": [
        {
          "id": "lx0czo5",
          "author": "jemappelletired",
          "body": "My parents did this to me growing up and shocker…. it did not work. It honestly probably made everything worse.",
          "created_utc": 1731544509.0
        },
        {
          "id": "lx0lh14",
          "author": "QuothetheRaven1845",
          "body": "Yeah I was forced to eat food I hated growing up and if it made me sick I'd get yelled at, called dramatic, etc. They forced me to eat creamed corn once to the point I had to sit up all night if I didn't eat it. Eventually I did and it made me sick. Now I absolutely refuse anything with corn in it.",
          "created_utc": 1731547529.0
        }
      ]
    }
  ]
}