{
  "id": "1gsazfp",
  "subreddit": "ARFID",
  "author": "Baring-My-Heart",
  "created_utc": 1731716571.0,
  "title": "Hiding myself in the bathroom so my friend’s dad can’t force me to eat",
  "selftext": "I’m at a Friendsgiving and thought it was mainly friends. Turns out it’s mainly his family, which is fine, but his dad really pressured me to eat some of the spring roll, and I did grab it to try because, you know, peer pressure works ig. \n\nAnyway I’m now hiding in the bathroom for a few. The good news is that it fried, and i pretended to chew and swallowed with water, but like if I say no let me say no, god damn.",
  "url": "https://www.reddit.com/r/ARFID/comments/1gsazfp/hiding_myself_in_the_bathroom_so_my_friends_dad/",
  "score": 105,
  "num_comments": 13,
  "comments": [
    {
      "id": "lxcvefr",
      "author": "MaleficentSwan0223",
      "body": "Peer pressure didn’t do anything for me. Just created more anxiety which made it hard to even eat safe foods. \n\nI feel for you though. When I got to them points I’d just make myself vomit and be like ‘oh shame, looks like I have a bug! I need to leave.’",
      "created_utc": 1731717143.0,
      "score": 83,
      "context": []
    },
    {
      "id": "lxd9bpo",
      "author": "AlternateUsername22",
      "body": "Just say no next time and refuse. You don't have to give in to peer pressure. \"I said no why are you trying to force the issue?\"",
      "created_utc": 1731722454.0,
      "score": 42,
      "context": []
    },
    {
      "id": "lxduz0d",
      "author": "phoebemocha",
      "body": "worst fucking occasion ever honestly. i know its an eating disorder but its concerning and honestly creepy how many family and peers want to watch us eat so badly to the point where they're sad/disappointed/angry, im not fucking hungry, the end, it isnt the end of the world. im gonna blow it up every time especially with family because for over a decade its been the same, im not hungry, it isnt hard.",
      "created_utc": 1731731218.0,
      "score": 39,
      "context": []
    },
    {
      "id": "lxdexuz",
      "author": "NoIron9582",
      "body": "\"I've said no politely several times , you need to drop this , you're making me incredible uncomfortable. There is no world where what i put in my body is any of your business.\"",
      "created_utc": 1731724681.0,
      "score": 26,
      "context": []
    },
    {
      "id": "lxe40a0",
      "author": "lizardgal10",
      "body": "I honestly hate eating around people! My best friend and her parents are the only ones I can handle. I’ve spent a couple Thanksgivings with them and there’s just absolutely no pressure. I’m the only vegetarian, I just much bread and potatoes and gush over their dumb dog.",
      "created_utc": 1731735651.0,
      "score": 11,
      "context": []
    },
    {
      "id": "lxe4urd",
      "author": "schumphrey",
      "body": "I’m a mom to a child with ARFID. I’m so sorry the clueless dad is pressuring you to eat. I wish I was there to help. My first instinct is to want to yell at the man but he’s obviously clueless about eating issues. Hugs to you ♥️",
      "created_utc": 1731736045.0,
      "score": 6,
      "context": []
    },
    {
      "id": "lxgm04h",
      "author": "Fun_Intention_5371",
      "body": "Can you go out the window? \n\nTell them you're nauseous, maybe the fried foods aren't sitting right. \n\nMaking nauseaus people eat is usually a bad idea. People usually don't push that",
      "created_utc": 1731778389.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lxguv6q",
      "author": "isawolf123",
      "body": "Get too full too fast, ask if you can save it to take home later! then i share it with my family, that’s been the best way to get out of eating some things for me",
      "created_utc": 1731781209.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lxgzap3",
      "author": "PinkPaperPenguin",
      "body": "If I ever am feeling pressured around people I don’t know I’ll say I have food allergies and they will usually stop bugging me. I shouldn’t have to lie but… it makes it easier lol",
      "created_utc": 1731782614.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lxdkei7",
      "author": "Baring-My-Heart",
      "body": "God i know right",
      "created_utc": 1731726870.0,
      "score": 12,
      "context": [
        {
          "id": "lxcvefr",
          "author": "MaleficentSwan0223",
          "body": "Peer pressure didn’t do anything for me. Just created more anxiety which made it hard to even eat safe foods. \n\nI feel for you though. When I got to them points I’d just make myself vomit and be like ‘oh shame, looks like I have a bug! I need to leave.’",
          "created_utc": 1731717143.0
        }
      ]
    },
    {
      "id": "lxdkftn",
      "author": "Baring-My-Heart",
      "body": "Not wrong. Being polite never works",
      "created_utc": 1731726884.0,
      "score": 18,
      "context": [
        {
          "id": "lxd9bpo",
          "author": "AlternateUsername22",
          "body": "Just say no next time and refuse. You don't have to give in to peer pressure. \"I said no why are you trying to force the issue?\"",
          "created_utc": 1731722454.0
        }
      ]
    },
    {
      "id": "lxja44z",
      "author": "None",
      "body": "I'll really never understand why people get so mad when you don't want to eat something. Like, it's *food.* It's organic matter that our body processes to keep us alive. Why do people care so much if I don't want to eat mushy, disgusting, soggy bread (turkey stuffing)??? \n\nMaybe I'm biased due to me seeing food as a chore, a nuisance that I have to deal with on a regular basis. If not a chore, a source of pure stress. Potato chips are about as exciting as plain carrots in my mind. Less, actually. Carrots are at least bland enough for me to not even register them as food. Exercise is more enjoyable to me than eating, but I can't even do that without eating more to compensate for it. I fucking hate that food even exists at this point, I want to photosynthesize instead. If I had one wish, it would be to get rid of the need for me to eat. Maybe that's extreme, but come on, why does it feel like the world revolves around the stuff..? \n\nAnd some people won't even be friends with you for being a \"picky eater\" because they don't like seeing someone order something \"weird\" (chicken tenders are weird apparently) when going out to dinner. Like it has to be an obsession. It can't be healthy for a person to pick their friends based on what they eat, or to feel the need to force us to eat stuff that we have made clear makes us feel physically ill, otherwise they get offended. It's getting to a point where I'm wondering if that's some kind of a disorder of its own lol.",
      "created_utc": 1731811732.0,
      "score": 7,
      "context": [
        {
          "id": "lxduz0d",
          "author": "phoebemocha",
          "body": "worst fucking occasion ever honestly. i know its an eating disorder but its concerning and honestly creepy how many family and peers want to watch us eat so badly to the point where they're sad/disappointed/angry, im not fucking hungry, the end, it isnt the end of the world. im gonna blow it up every time especially with family because for over a decade its been the same, im not hungry, it isnt hard.",
          "created_utc": 1731731218.0
        }
      ]
    },
    {
      "id": "lxt9rn6",
      "author": "shitz_brickz",
      "body": "Sometimes I just join their side to get them to shut up. \n\n\"Ya you're totally right I should try it I bet I would love it. Too bad I won't, o well, probably going to ruin the rest of my night knowing I could have tried it and didn't, once in a lifetime opportunity squandered. Hopefully it doesn't ruin your night too.\"",
      "created_utc": 1731961533.0,
      "score": 3,
      "context": [
        {
          "id": "lxd9bpo",
          "author": "AlternateUsername22",
          "body": "Just say no next time and refuse. You don't have to give in to peer pressure. \"I said no why are you trying to force the issue?\"",
          "created_utc": 1731722454.0
        },
        {
          "id": "lxdkftn",
          "author": "Baring-My-Heart",
          "body": "Not wrong. Being polite never works",
          "created_utc": 1731726884.0
        }
      ]
    }
  ]
}