{
  "id": "1gtp0d1",
  "subreddit": "ARFID",
  "author": "PlaidFlannel271",
  "created_utc": 1731881091.0,
  "title": "People misconstruding ARFID and Anorexia ",
  "selftext": "Tw: Body image issues mentioned, restricting \n\nSometimes when I tell people I struggle with food and I restrict unintentionally due to food repulsion, some people jump to the whole \"what did you eat today?\" Or \"you're body needs food.\" Same kind of thing they'd say to those who purposefully restrict if they're having body image issues and I have no idea how to react. Like... \"Yeah I know my body needs food...\" Or I'd tell them how what I ate and they go \"that's not enough.\" no duh. I don't have body image issues. I dont have body dysmorphia, I know I'm under eating. I literally cannot help it and people doing these weird \"check ins\" are so unhelpful and just put more pressure on me. It's only happened a handful of times but each time it leaves me feeling really uncomfortable. On the other end of the spectrum once people find out I don't have body image issues they just go \"oh... So eat?\" It just shows a severe lack of understanding and I find people stop trying to understand when they realize it's not body image related, which honestly is better than unhelpful comments and \"encouragement.\" Just something I've noticed here and there. 80% of the people in my life are pretty okay just some odd comments here and there.\n\n\nEdit: I forgot about Reddit for a couple days, my bad. It was really eye opening to hear everyone's stories especially those that have been mistreated in the medical system and treatments centers. That's on a whole other level of messed up and I'm so sorry that anybody has ever had to experience that. \n\nI also wanted to clarify that this post was not meant to be bashing Anorexia or implying that it's okay to say these kinds of things to people with anorexia. It was just a frustration that I was having with people who were making assumptions with what I was struggling with and then saying very unhelpful things on top of that assumption. It's not okay to say these things to anybody with any type of eating disorder. \n\n",
  "url": "https://www.reddit.com/r/ARFID/comments/1gtp0d1/people_misconstruding_arfid_and_anorexia/",
  "score": 90,
  "num_comments": 23,
  "comments": [
    {
      "id": "lxntq9a",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1731881818.0,
      "score": 47,
      "context": []
    },
    {
      "id": "lxp82na",
      "author": "Pure_puppy521",
      "body": "I was in a full time eating disorder program where they falsely diagnosed with me with anorexia nervosa because I was afraid of gaining weight- like nope, I’m actually going from drinking 2 supplement shakes a day to eating six full meals and am TERRIFIED of the change that is going to happen to my body so quickly. I went to treatment after years of fluctuating up and down 30 pounds. It kept getting worse and worse so I had no choice. But they confused my autism for anorexia and that fucked me up for a loooooong time :) being in nonstop therapy about body image honestly created trauma around weight for me (they would hide our weights from us) when all I wanted to know is how much was an adult me supposed to weigh 😭 the false diagnosis led to me being on the wrong anxiety medication for months resulting in a major depressive and burnout episode. In treatment, they taught me how to be a “normal eater” - well, I cannot possibly live up to those standards. So I have beat myself  up every single day for the past year that even the best I have ever done was called “disordered” - Find a dietician who understand neurodivergence. Do not pursue traditional eating disorder treatment. It will do a lot of good in your life but also create almost too much awareness into your self in an ableist way 🤪",
      "created_utc": 1731899850.0,
      "score": 14,
      "context": []
    },
    {
      "id": "lxq2u66",
      "author": "dmlzr",
      "body": "I had this when i started a new work place 6 months ago, one girl noticed i didn’t eat much and said “oh your one of those, do i have to tell you to eat more?” \n\ni said “no.. that would be fucking weird” and stared a long absent my blood sugars are\ndropping stare into her soul. \n\nmake me feel weird then ima make you feel weird right back! people have literally NO right to make any comments on our eating and need to be reminded.",
      "created_utc": 1731914992.0,
      "score": 13,
      "context": []
    },
    {
      "id": "lxnxiwa",
      "author": "FigeaterApocalypse",
      "body": "Please consider that anorexics can feel the same dire feelings regarding consumption of calories (that there's literally no other option than continuing on the same disordered path they've been on.) I can guarantee those same statements are just as irritating and inapplicable to anorexics as arfids. Ableism cuts us all.",
      "created_utc": 1731883088.0,
      "score": 28,
      "context": []
    },
    {
      "id": "lxpzfgn",
      "author": "Angelangepange",
      "body": "Sadly it's an integral part of ableism to act as if the illness / disability / disorder is a choice 🙄 these words all imply you or even an anorexic person is doing this on purpose. Which no one is.",
      "created_utc": 1731912879.0,
      "score": 9,
      "context": []
    },
    {
      "id": "lxpte3k",
      "author": "No-Marionberry-8278",
      "body": "I was misdiagnosed by Emily program in 2013 w anorexia nos when I clearly didn’t fit the frame. Was a p traumatic experience tbh. Can’t wait for clinical advancement they don’t know wtf they’re doing when it comes to ARFID. honestly it’s the biggest reason I haven’t made the progress I could be. The countless “well you look great” at 5’3 and 98# then, again when I replenished weight, and now still after maxing out at 300# from rapid weight gain from a med and losing 145#….like ok THATS what you’re taking away from me being vulnerable to tell you this or try to educate you?! Fuckin a 😒 \nSide note. Bless this sub I’ve felt alone and ashamed about this my entire life and I don’t anymore 🫶🏽",
      "created_utc": 1731909420.0,
      "score": 7,
      "context": []
    },
    {
      "id": "lxpvh9b",
      "author": "IdeaOdd6181",
      "body": "So true. I get so irritated at the amount of people who conflate the two- even among the ED recovery community. I was initially diagnosed with anorexia about 12 years ago prior to ARFID being in the DSM. This diagnosis was purely based on my physical presentation when I was first admitted into hospital- despite no body image issues or intentional weight loss- I was never given a psyc evaluation. This meant I was subjected to YEARS of inappropriate and completely unhelpful “treatment”. It took so long to get someone to listen to what was really going on and get the correct help I needed. These are two different conditions and people need to understand that",
      "created_utc": 1731910581.0,
      "score": 6,
      "context": []
    },
    {
      "id": "lxrjf5d",
      "author": "None",
      "body": "some peaple don't understand wen I explaned to them that i have ARFID. becaus i am heavyset \nbut my safe foods are mostly junk and fast food and i can't exercise much becaus i have realley bad fibromyalgia and CFS plus on top of that i have PCOS",
      "created_utc": 1731942353.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lxqmr5f",
      "author": "Ok-Committee-5867",
      "body": "I think no matter the disorder these comments are weird to make. I get that people may be concerned or trying to be helpful, but it feels completely infantilising, and frustrating to see someone send you a message like that or say it to your face. They are just pointing out the obvious, “you need to eat more”, oh? I hadn’t thought of that! \n\nI get your frustration. Honestly I’ve reacted badly to people who tell me this kind of thing before because it is so ANNOYING to hear and as you say, puts a lot of pressure on us. I’ve absolutely said to someone, “nope, weren’t not doing this”, in regards to the checking up on me and what I’m eating. \n\nAs much as it may be awkward, don’t ever be scared to set the boundary and tell someone you don’t need them to make such comments and check on you in that way. It’s the only way I’ve found people stop saying things.",
      "created_utc": 1731928125.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lxqnvdp",
      "author": "Manospondylus_gigas",
      "body": "It bugs me a lot especially as I *want* to be fat, I just can't gain weight easily from my diet and no matter how much I have there's a limit to what I can have",
      "created_utc": 1731928793.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lxscd06",
      "author": "strawbabyoatmilk",
      "body": "… damn why’s everyone flaming mental illness on this sub.. your emotions around the subject are totally valid but it’s kinda mean to take away the suffering people with other eating disorders may feel. \n\nAnorexia and ARFID have pretty high comorbidity rates.. both having pretty high links to autism— \nand eating disorders aren’t as surface level as that, as we all know from experience..\n\nNot everyone with anorexia has body dysmorphia and not everyone with body dysmorphia has anorexia  or experiences the same level of symptoms.. the generalization can be really harmful..",
      "created_utc": 1731951444.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lxse4zw",
      "author": "Sure-Lecture-2542",
      "body": "I’ll say that as someone who does not have ARFID, I have zero emotional reaction to someone asking me if I’ve eaten or if I’ve had enough to eat today or a reminder that my body needs food. Avoidant behavior is hard to pinpoint sometimes because it’s the lack of doing something. In my family I can clearly see these emotional reactions to question and comments….as avoidant behavior. \nMy husband gets instantly very angry. My kids get annoyed and irritated. Because they would rather avoid (always unintentionally) and my questions and reminders have prevented or interfered with their avoidance.",
      "created_utc": 1731951973.0,
      "score": 0,
      "context": []
    },
    {
      "id": "lxssezc",
      "author": "jorwyn",
      "body": "Right? There's a huge difference between \"my mental image of my body is not right\" and \"my brain is sure this food isn't safe for whatever reason or isn't food.\"\n\nI do have some issues with body weight, but they're based on the fact that I am heavy and it's hard on my joints and hard to do the things I really want to do. I'm working on that, but my brain is well aware of what's healthy for my frame and height, and that's my goal. That's not anorexia. \n\nSome foods, I have past trauma with. It's a small enough list, I'm honestly not even trying with those. \n\nSome foods have textures my brain says are just not food. Trying to eat them is like trying to eat wood chips. My brain has the same reaction to them. I am in therapy and working on that, but it's hard. It's so hard. It's also not anorexia. \n\nAnd like most people without an eating disorder, I just don't like some foods because I don't think they taste good. That's absolutely okay and normal. I can eat a balanced diet without ever eating bitter foods, rosemary, or sharp cheese. This is also definitely not anorexia. It's not even ARFID. Almost everyone has at least something they don't like.",
      "created_utc": 1731956263.0,
      "score": 4,
      "context": [
        {
          "id": "lxntq9a",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1731881818.0
        }
      ]
    },
    {
      "id": "ly2r9n9",
      "author": "PlaidFlannel271",
      "body": "That's so messed up! How are they allowed to practice? Glad you're not seeing them anymore. Jesus Christ.",
      "created_utc": 1732096210.0,
      "score": 1,
      "context": [
        {
          "id": "lxntq9a",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1731881818.0
        }
      ]
    },
    {
      "id": "ly8y865",
      "author": "DreamOk816",
      "body": "What are some arfid beliefs? I don't even think I have one, it just hurts when I become full, or I lose my appetite and can't bring myself to eat food. Or I just hate the taste and never eat it again. But I don't have an actual reason or fear, as far as I can tell",
      "created_utc": 1732195741.0,
      "score": 1,
      "context": [
        {
          "id": "lxntq9a",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1731881818.0
        }
      ]
    },
    {
      "id": "lxtq1ya",
      "author": "No_Evidence_19",
      "body": "i have never felt more seen; they did the same thing to me and could NOT understand my fear of food, they just kept treating me for anorexia which i very clearly did/do not have. The best thing i got out of treatment were my friends and the fact that i got connected to my now therapist thru my php dietitian, loved that woman (she quit working with eating disorders)\nout of the two treatment centers i went to, residential/inpatient is the absolute worst place for an autistic arfid individual to be, they refuse to accommodate and do not understand the differences between arfid and anorexia\nphp was absolutely horrible, esp bc they kept me there for 10 months even when they genuinely did not know what to do and i wasn’t making any progress (past the finally eating again and gaining the weight to a certain point then started losing again bc it wasn’t working 🥸). They thought the GOLD STANDARD for arfid was exposure and created completely unfeasible “5 step plans” for me to get out of there (which I never did bc that’s not how arfid works, I can’t just eat the foods that are untouchable, much less try to in front of the entire group)\nThe part where you mentioned the “self awareness but in an ableist way” THIS!!!! Like that’s exactly it, i just constantly think about how “disordered” and not normal I am with eating and I have SO MUCH shame and guilt around it; I was not nearly as self-conscious abt my eating habits and food choices before treatment. \nAnother thing, I had literally NEVER felt so bad about what I would eat and how I would “get out of” having to eat the prepared meals. But also them questioning why I won’t eat certain things, for example I don’t do condiments, none of them, and the first time I mentioned it (literal months into being in php) I was questioned as to whether it was a “calorie thing” and I was so frustrated bc I didn’t know how to explain it, I didn’t wanna make others uncomfortable by being put off by the idea that it would be about calories but I also didn’t want them to think it was, bc it’s not, I don’t like the strong flavors and the wet on dry foods (ik how to explain it better now)\nI just wish arfid was better understood and that treatment centers didn’t pretend like they know how to treat EVERY eating disorder, while not understanding the basics of arfid or accommodating without making it seem like the BIGGEST THING EVER.",
      "created_utc": 1731966458.0,
      "score": 5,
      "context": [
        {
          "id": "lxp82na",
          "author": "Pure_puppy521",
          "body": "I was in a full time eating disorder program where they falsely diagnosed with me with anorexia nervosa because I was afraid of gaining weight- like nope, I’m actually going from drinking 2 supplement shakes a day to eating six full meals and am TERRIFIED of the change that is going to happen to my body so quickly. I went to treatment after years of fluctuating up and down 30 pounds. It kept getting worse and worse so I had no choice. But they confused my autism for anorexia and that fucked me up for a loooooong time :) being in nonstop therapy about body image honestly created trauma around weight for me (they would hide our weights from us) when all I wanted to know is how much was an adult me supposed to weigh 😭 the false diagnosis led to me being on the wrong anxiety medication for months resulting in a major depressive and burnout episode. In treatment, they taught me how to be a “normal eater” - well, I cannot possibly live up to those standards. So I have beat myself  up every single day for the past year that even the best I have ever done was called “disordered” - Find a dietician who understand neurodivergence. Do not pursue traditional eating disorder treatment. It will do a lot of good in your life but also create almost too much awareness into your self in an ableist way 🤪",
          "created_utc": 1731899850.0
        }
      ]
    },
    {
      "id": "lxyxrz9",
      "author": "Alternative_List_978",
      "body": "i love this🙌🏻",
      "created_utc": 1732042080.0,
      "score": 2,
      "context": [
        {
          "id": "lxq2u66",
          "author": "dmlzr",
          "body": "I had this when i started a new work place 6 months ago, one girl noticed i didn’t eat much and said “oh your one of those, do i have to tell you to eat more?” \n\ni said “no.. that would be fucking weird” and stared a long absent my blood sugars are\ndropping stare into her soul. \n\nmake me feel weird then ima make you feel weird right back! people have literally NO right to make any comments on our eating and need to be reminded.",
          "created_utc": 1731914992.0
        }
      ]
    },
    {
      "id": "ly2rypn",
      "author": "PlaidFlannel271",
      "body": "I can completely sympathize with people who have anorexia or other eating disorders. I never meant to imply that it was okay to say those kinds of things to people with anorexia. I meant that people try to use the same unhelpful and harmful comments while also assuming I struggle with anorexia and body image issues. I have issues with the comments as well, not just the assumption of my struggles.",
      "created_utc": 1732096690.0,
      "score": 1,
      "context": [
        {
          "id": "lxnxiwa",
          "author": "FigeaterApocalypse",
          "body": "Please consider that anorexics can feel the same dire feelings regarding consumption of calories (that there's literally no other option than continuing on the same disordered path they've been on.) I can guarantee those same statements are just as irritating and inapplicable to anorexics as arfids. Ableism cuts us all.",
          "created_utc": 1731883088.0
        }
      ]
    },
    {
      "id": "ly2sgxw",
      "author": "PlaidFlannel271",
      "body": "People just need to stop commenting on peoples weight, especially when sharing a story. Like you said, why is that the main point you're taking away.",
      "created_utc": 1732097033.0,
      "score": 3,
      "context": [
        {
          "id": "lxpte3k",
          "author": "No-Marionberry-8278",
          "body": "I was misdiagnosed by Emily program in 2013 w anorexia nos when I clearly didn’t fit the frame. Was a p traumatic experience tbh. Can’t wait for clinical advancement they don’t know wtf they’re doing when it comes to ARFID. honestly it’s the biggest reason I haven’t made the progress I could be. The countless “well you look great” at 5’3 and 98# then, again when I replenished weight, and now still after maxing out at 300# from rapid weight gain from a med and losing 145#….like ok THATS what you’re taking away from me being vulnerable to tell you this or try to educate you?! Fuckin a 😒 \nSide note. Bless this sub I’ve felt alone and ashamed about this my entire life and I don’t anymore 🫶🏽",
          "created_utc": 1731909420.0
        }
      ]
    },
    {
      "id": "lxtk6fl",
      "author": "Maxusam",
      "body": "Same for me, I have PCOS which causes its own issues but, my calorie intake is mostly large coffees and juice drinks rather than fast food which I hear are just as bad for us. :(",
      "created_utc": 1731964674.0,
      "score": 2,
      "context": [
        {
          "id": "lxrjf5d",
          "author": "None",
          "body": "some peaple don't understand wen I explaned to them that i have ARFID. becaus i am heavyset \nbut my safe foods are mostly junk and fast food and i can't exercise much becaus i have realley bad fibromyalgia and CFS plus on top of that i have PCOS",
          "created_utc": 1731942353.0
        }
      ]
    },
    {
      "id": "ly2tjsr",
      "author": "PlaidFlannel271",
      "body": "I just kind of stare at them and make it even more uncomfortable and just walk away, mostly because I don't know how to respond. Seems to work somewhat okay.",
      "created_utc": 1732097746.0,
      "score": 1,
      "context": [
        {
          "id": "lxqmr5f",
          "author": "Ok-Committee-5867",
          "body": "I think no matter the disorder these comments are weird to make. I get that people may be concerned or trying to be helpful, but it feels completely infantilising, and frustrating to see someone send you a message like that or say it to your face. They are just pointing out the obvious, “you need to eat more”, oh? I hadn’t thought of that! \n\nI get your frustration. Honestly I’ve reacted badly to people who tell me this kind of thing before because it is so ANNOYING to hear and as you say, puts a lot of pressure on us. I’ve absolutely said to someone, “nope, weren’t not doing this”, in regards to the checking up on me and what I’m eating. \n\nAs much as it may be awkward, don’t ever be scared to set the boundary and tell someone you don’t need them to make such comments and check on you in that way. It’s the only way I’ve found people stop saying things.",
          "created_utc": 1731928125.0
        }
      ]
    },
    {
      "id": "ly2r1qx",
      "author": "PlaidFlannel271",
      "body": "I genuinely have no idea how you extrapolated that I was trying to take away other people's suffering, or that I was implying that everyone with Anorexia has body dysmorphia and everyone with body dysmorphia has anorexia. These generalizations are harmful, that's why I didn't make them. I made distinct separate statements.",
      "created_utc": 1732096059.0,
      "score": 1,
      "context": [
        {
          "id": "lxscd06",
          "author": "strawbabyoatmilk",
          "body": "… damn why’s everyone flaming mental illness on this sub.. your emotions around the subject are totally valid but it’s kinda mean to take away the suffering people with other eating disorders may feel. \n\nAnorexia and ARFID have pretty high comorbidity rates.. both having pretty high links to autism— \nand eating disorders aren’t as surface level as that, as we all know from experience..\n\nNot everyone with anorexia has body dysmorphia and not everyone with body dysmorphia has anorexia  or experiences the same level of symptoms.. the generalization can be really harmful..",
          "created_utc": 1731951444.0
        }
      ]
    },
    {
      "id": "ly4383t",
      "author": "strawbabyoatmilk",
      "body": "Ok",
      "created_utc": 1732117320.0,
      "score": 1,
      "context": [
        {
          "id": "lxscd06",
          "author": "strawbabyoatmilk",
          "body": "… damn why’s everyone flaming mental illness on this sub.. your emotions around the subject are totally valid but it’s kinda mean to take away the suffering people with other eating disorders may feel. \n\nAnorexia and ARFID have pretty high comorbidity rates.. both having pretty high links to autism— \nand eating disorders aren’t as surface level as that, as we all know from experience..\n\nNot everyone with anorexia has body dysmorphia and not everyone with body dysmorphia has anorexia  or experiences the same level of symptoms.. the generalization can be really harmful..",
          "created_utc": 1731951444.0
        },
        {
          "id": "ly2r1qx",
          "author": "PlaidFlannel271",
          "body": "I genuinely have no idea how you extrapolated that I was trying to take away other people's suffering, or that I was implying that everyone with Anorexia has body dysmorphia and everyone with body dysmorphia has anorexia. These generalizations are harmful, that's why I didn't make them. I made distinct separate statements.",
          "created_utc": 1732096059.0
        }
      ]
    },
    {
      "id": "ly43i7s",
      "author": "strawbabyoatmilk",
      "body": "You just kinda started venting there toward the end so that got lost in the sauce. Wasn’t super clear since you implied you don’t have anorexia because you don’t struggle with Body dysmorphia. General take away from ur post 👌. Feel free to calm down",
      "created_utc": 1732117409.0,
      "score": 1,
      "context": [
        {
          "id": "lxscd06",
          "author": "strawbabyoatmilk",
          "body": "… damn why’s everyone flaming mental illness on this sub.. your emotions around the subject are totally valid but it’s kinda mean to take away the suffering people with other eating disorders may feel. \n\nAnorexia and ARFID have pretty high comorbidity rates.. both having pretty high links to autism— \nand eating disorders aren’t as surface level as that, as we all know from experience..\n\nNot everyone with anorexia has body dysmorphia and not everyone with body dysmorphia has anorexia  or experiences the same level of symptoms.. the generalization can be really harmful..",
          "created_utc": 1731951444.0
        },
        {
          "id": "ly2r1qx",
          "author": "PlaidFlannel271",
          "body": "I genuinely have no idea how you extrapolated that I was trying to take away other people's suffering, or that I was implying that everyone with Anorexia has body dysmorphia and everyone with body dysmorphia has anorexia. These generalizations are harmful, that's why I didn't make them. I made distinct separate statements.",
          "created_utc": 1732096059.0
        }
      ]
    }
  ]
}