{
  "id": "1gzaxlc",
  "subreddit": "ARFID",
  "author": "None",
  "created_utc": 1732509990.0,
  "title": "The dislike towards picky eaters and those with ARFID is wild. ",
  "selftext": "Let us be, man. ",
  "url": "https://www.reddit.com/r/ARFID/comments/1gzaxlc/the_dislike_towards_picky_eaters_and_those_with/",
  "score": 291,
  "num_comments": 42,
  "comments": [
    {
      "id": "lyuzsz8",
      "author": "TrashCanEnigma",
      "body": "For real, literally breaks my heart every time someone says some shit about it. People really wanna believe that the way we are is a choice. Why would I CHOOSE not to be able to like more than 20 foods. It's not that I'm \"not adventurous\" for Pete's sake.",
      "created_utc": 1732510437.0,
      "score": 186,
      "context": []
    },
    {
      "id": "lyv3rza",
      "author": "None",
      "body": "I carry so much shame due to my disorder. And people feel it is justified, they think they do us a favour by being mean or rude, like enough*** shame will force us to be \"normal\". It just makes it worse.",
      "created_utc": 1732512394.0,
      "score": 90,
      "context": []
    },
    {
      "id": "lyv2hdk",
      "author": "geekgeek2019",
      "body": "Ikr very ableist behavior",
      "created_utc": 1732511744.0,
      "score": 71,
      "context": []
    },
    {
      "id": "lyvek2z",
      "author": "Angelangepange",
      "body": "I had to block the picky eaters sub because half was just people complaining someone else is a picky eater and then not listening to anyone who wasn't bashing picky eaters.    \n         \nBefore finding out that arfid existed I felt so so much shame about it. Now that I know I tell everyone. At the first signs of aholery I repeat \"it's a DISORDER, do you think I want to struggle?\". But that is just the way that I am, I enjoy making them feel bad when they have been aholes first.   \nMy whole life I was told that I was a horrible person because my family thought I was pretending to gag to offend their food.    \nYeah I also blocked the am I the ahole sub.",
      "created_utc": 1732518359.0,
      "score": 48,
      "context": []
    },
    {
      "id": "lywksd5",
      "author": "ThatScottishLassie",
      "body": "Or when some people develop a saviour complex and fuss over you, telling you \"x will happen if you don't eat\" or \"you look like x\", as if that's supposed to help??? It only ever made me more anxious, stressed and defeatist. \n\nMy ARFID started to get slowly better after I started being much kinder to myself and trying to develop a positive mindset. It took a very long time to start making any progress and it's difficult to do when people are grabbing your wrist or commenting on your health etc. \n\nI wish people understood that you *cannot* shame or fearmonger people into recovery. It doesn't work that way!!\n\nI want to give everyone here and in this sub a big hug 🫂. It's hard enough going through ARFID itself let alone the societal pressure and shame that comes with it.",
      "created_utc": 1732542409.0,
      "score": 19,
      "context": []
    },
    {
      "id": "lywesz3",
      "author": "None",
      "body": "I grew up being ridiculed for my choices. It wasn’t a choice though. I had no control over the fear my brain feels about food.",
      "created_utc": 1732539969.0,
      "score": 18,
      "context": []
    },
    {
      "id": "lyv08w3",
      "author": "Sweetybancha222",
      "body": "It makes me so sad bruh",
      "created_utc": 1732510648.0,
      "score": 16,
      "context": []
    },
    {
      "id": "lywa2mq",
      "author": "-SecondHandSmoke-",
      "body": "I think the more creators that make Arfid known, the less negative attention it will get. I recently found Arfid_andrew on tiktok and it was the first time in my entire life I've actually felt related to in that sense. He's gained a decent following and it seems like it's helping others understand it IS a mental issue, it's not a choice. The comments are majority positive, and his friends/family are often apart of his content and trying to help him widen his pallet. \n\nIf you do look him up, fair warning his content is mainly him trying new foods with very real reactions, gagging, spitting it out.",
      "created_utc": 1732537825.0,
      "score": 13,
      "context": []
    },
    {
      "id": "lyx39xe",
      "author": "humansnackdispenser",
      "body": "My SIL made some comment the other day about how she's not sure if she could deal with having an autistic kiddo. And I was like well your brother and sister are both profoundly affected by neurodivergence, so maybe you just shouldn't have any kids. And that did not go over well lol. My husband (her brother) and I both have ARFID and I'm profoundly autistic. If neurotypicals aren't ready for a special needs kid, maybe you should just not have a kid then.",
      "created_utc": 1732548995.0,
      "score": 13,
      "context": []
    },
    {
      "id": "lyy3nwk",
      "author": "Fearless_Nope",
      "body": "i like to point out the irony whenever i hear it. \n\nlike “aren’t you being picky about what they eat?” \nor                                                                                        \n“i think being picky about your own food is better than being picky with someone else’s- it’s not like you’ve gotta eat it lol”",
      "created_utc": 1732560278.0,
      "score": 13,
      "context": []
    },
    {
      "id": "lyuz4jm",
      "author": "DangerousDeer7246",
      "body": "Facts",
      "created_utc": 1732510114.0,
      "score": 11,
      "context": []
    },
    {
      "id": "lyvv7ry",
      "author": "Fun_Intention_5371",
      "body": "OMG right? \n\nAlso if someone is having trouble eating, the last thing I would ever think of doing would be to make them feel worse about it. \n\nEspecially since I have NEVER made someone feel bad about eating what they like. \n\nIt's not like I'm asking you to eat like me. \n\nPeople need to STFU",
      "created_utc": 1732529265.0,
      "score": 22,
      "context": []
    },
    {
      "id": "lyyiyeq",
      "author": "Conscious-Studio8111",
      "body": "The wildest thing to me is how upset people get like….*Okay*? \n\nEven if it *was* a choice to be picky, how… does that affect you? Like, if I order the same dish at every restaurant, how… does this negatively impact you in any way? You can order whatever you want. I’m not going to eat your dish, you don’t eat mine. The end.",
      "created_utc": 1732565030.0,
      "score": 8,
      "context": []
    },
    {
      "id": "lyym3sa",
      "author": "afaithross",
      "body": "I've had it since I was basically born and have been bullied for it since I was school age. Even my family bullied me for it and I was always the \"problem\". It didn't take until adulthood for me to realize I HAVE a problem not that I AM the problem.",
      "created_utc": 1732566009.0,
      "score": 6,
      "context": []
    },
    {
      "id": "lyxs0a4",
      "author": "kilroy-was-here-2543",
      "body": "One of my roommates is a twat about my eating, because it effects him somehow? He also called my other roommates girlfriend fat because she drinks soda, even though she is more shape than him. Some people are just assholes",
      "created_utc": 1732556693.0,
      "score": 6,
      "context": []
    },
    {
      "id": "lyxc7bg",
      "author": "Rinny-ThePooh",
      "body": "I’m going to tell you a secret. Anybody that gets angry over what somebody else is doing with their life is miserable. I promise you. If they were happy with themselves they wouldn’t care what you do, they’d focus on them. It’s like with being LGBTQ+, people hate on you just for who you are because they cannot accept many parts of themselves, and have been taught not to. So let it be known, next time somebody comments on your life, especially when it doesn’t affect them in the slightest, they simply want you to be as miserable as them.",
      "created_utc": 1732551836.0,
      "score": 10,
      "context": []
    },
    {
      "id": "lyx0a7k",
      "author": "Cyber-Cafe",
      "body": "I try not to draw attention to this or make a big deal about it because it makes people treat me differently. Sometimes I just pass on food because I’m “vegetarian” and people understand. I’m not really, kind of the opposite, but I hate having to explain my issues and that’s what I’ve found makes people drop it the fastest.",
      "created_utc": 1732548012.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lyyju4a",
      "author": "MundaneVillian",
      "body": "I’ve been considering just telling people something vague about being on a restricted list of foods by my doctor for reasons I will not elaborate on. Been learning the hard way exactly how common a lack of empathy or understanding truly is.",
      "created_utc": 1732565306.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lyzqhv2",
      "author": "throw0OO0away",
      "body": "I feel this. I get scared that I'll be ridiculed for not eating at the table. Granted, I have a gluten intolerance of some sort and that gives me an exit strategy to eat something different. A lot of foods have gluten and eating something different is part of that territory. This means I can have safe foods that are gluten free and ARFID friendly and no one will care. They'll just view it as a medical issue and not think twice about ARFID. However, I do wish I could eat what everyone else is eating regardless if it's gluten or ARFID. Also, there are safe foods that I do miss that have gluten...\n\nI did early intervention and learned how to cope and get through meals. That was prior to the intolerance but the intolerance and GI symptoms is what caused the ARFID to develop. Now, I'm shoved back into that same position for both medical reasons and ARFID. \n\n\"Why aren't you eating?\" Well, I have an intolerance and eating gluten makes me feel sick. It's nothing against you.",
      "created_utc": 1732579043.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lz5eefn",
      "author": "beegogh",
      "body": "honestly it’s crazy.  i’ve had to stop talking to family members because of it and had to defend myself to a friend recently because i’m staying by her and whenever she wants to cook something and wants me to eat it too she jokingly complains that “i don't eat this and that (certain foods that might be ingredients) so its probably a no” or in some cases she’ll deliberately mention that she's cooking a dish with (something i can't eat) as to put emphasis on what idk?? like its unconvincing her - mind you i don't ever ask her to cook for me and i eat/cook/buy what my body will usually allow. \n\nmy parents too since i used to be forced to stay up until everything they put on my plate was eaten when i was a kid growing up, dislikes secretly minced up would be put in my favorite dishes (things i considered “safe”) but i’d notice immediately because im sensitive a bit to texture (like i know how certain foods should feel like in my mouth when i eat them) and being the running joke if we ever ate out during family meals since i’d always order the same thing. even got singled out by a manager at a job once because i couldn't eat the companys free lunch, though i always bring what i can eat just in case to put in the break room but they saw it as weird so i was outed in front all employees (manager kept holding it against me so i ended up having to leave)\n\nanyway to avoid any one making a bigger deal going forward i’ve just started saying im allergic but i really wish this eating disorder was more known since i’ve seen people not even acknowledge it at all, like its not a choice either im sure some of us would love to be able to stomach certain foods but we do what we can, y’know?",
      "created_utc": 1732660012.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lz661y2",
      "author": "stonerexicplutolover",
      "body": "seriously. how does me not wanting to eat tomatoes effect you negatively??😭😭 just let me eat my hummus and pita every day in peace!",
      "created_utc": 1732670018.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lyvglvl",
      "author": "None",
      "body": "I saw something like this on TikTok",
      "created_utc": 1732519613.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lyzmq08",
      "author": "independentchickpea",
      "body": "I'm vegan and gave ARFID.\n\nOh the frustrated comments I've gotten, the baseless judgments.... ugh...",
      "created_utc": 1732577705.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lyvtzrh",
      "author": "Miserable_Hour_3800",
      "body": "Fr",
      "created_utc": 1732528464.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lzgoh5m",
      "author": "dajita",
      "body": "I think it’s because ARFID is a pretty rare disorder to have and a lot of people who claim to have it are usually self diagnosed. My gf is one who claims to have it but has never been diagnosed professionally. I wouldn’t say it’s a strain on our relationship but it’s definitely annoying when we decide meals for the week and where to go out. \nFor myself, if someone claims to have it, it’s definitely a situation where you mind your own business but I can definitely see how it’s bothersome if it’s someone close to you who is self diagnosing.",
      "created_utc": 1732827315.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lyv0e3s",
      "author": "None",
      "body": "Exactly. And literally if it is just picky eating, people should still mind their business.",
      "created_utc": 1732510718.0,
      "score": 59,
      "context": [
        {
          "id": "lyuzsz8",
          "author": "TrashCanEnigma",
          "body": "For real, literally breaks my heart every time someone says some shit about it. People really wanna believe that the way we are is a choice. Why would I CHOOSE not to be able to like more than 20 foods. It's not that I'm \"not adventurous\" for Pete's sake.",
          "created_utc": 1732510437.0
        }
      ]
    },
    {
      "id": "lyv2wel",
      "author": "Otherwise-Ad4641",
      "body": "I just say the shit about myself now - yeah I have ARFID, but I’ll just proclaim I’m a really fussy eater. People don’t generally say anything if I say it myself.",
      "created_utc": 1732511951.0,
      "score": 18,
      "context": [
        {
          "id": "lyuzsz8",
          "author": "TrashCanEnigma",
          "body": "For real, literally breaks my heart every time someone says some shit about it. People really wanna believe that the way we are is a choice. Why would I CHOOSE not to be able to like more than 20 foods. It's not that I'm \"not adventurous\" for Pete's sake.",
          "created_utc": 1732510437.0
        }
      ]
    },
    {
      "id": "lywyolv",
      "author": "HezaLeNormandy",
      "body": "I may have once yelled at my family about this. We were at a Taco Bell-esque place and I could only eat one thing. I forget what it was, but my sister and mom were laughing about it so I yelled “you think I choose this”?! They’ve been better ever since. I’m lucky honestly",
      "created_utc": 1732547480.0,
      "score": 15,
      "context": [
        {
          "id": "lyuzsz8",
          "author": "TrashCanEnigma",
          "body": "For real, literally breaks my heart every time someone says some shit about it. People really wanna believe that the way we are is a choice. Why would I CHOOSE not to be able to like more than 20 foods. It's not that I'm \"not adventurous\" for Pete's sake.",
          "created_utc": 1732510437.0
        }
      ]
    },
    {
      "id": "lyx5eaj",
      "author": "s317sv17vnv",
      "body": "Speaking of \"adventurous,\" I like to travel, and just about everyone else in my family is a foodie. When I'm visiting a new country, I absolutely want to try local cuisine. It's part of the experience. But sometimes I just can't find anything I can eat.\n\nFor what it's worth, they're getting better at not shaming me for going to a familiar fast food establishment separately if I've exhausted all other options in the area. And the fast food restaurants often have different menu options that aren't available at home, so they'll sometimes join me even if just to get a snack or dessert.",
      "created_utc": 1732549677.0,
      "score": 6,
      "context": [
        {
          "id": "lyuzsz8",
          "author": "TrashCanEnigma",
          "body": "For real, literally breaks my heart every time someone says some shit about it. People really wanna believe that the way we are is a choice. Why would I CHOOSE not to be able to like more than 20 foods. It's not that I'm \"not adventurous\" for Pete's sake.",
          "created_utc": 1732510437.0
        }
      ]
    },
    {
      "id": "lyzt9q8",
      "author": "None",
      "body": "Ikr",
      "created_utc": 1732580033.0,
      "score": 2,
      "context": [
        {
          "id": "lyuzsz8",
          "author": "TrashCanEnigma",
          "body": "For real, literally breaks my heart every time someone says some shit about it. People really wanna believe that the way we are is a choice. Why would I CHOOSE not to be able to like more than 20 foods. It's not that I'm \"not adventurous\" for Pete's sake.",
          "created_utc": 1732510437.0
        }
      ]
    },
    {
      "id": "lywgb0q",
      "author": "KennaLikesPizza",
      "body": "Absolutely 😭 one of my coworkers was pressing me about something food related and I panicked and told them I had ARFID, and that trying new foods makes me anxious. He then proceeded to give me different things and when I declined the guacamole and pico he asked \"is this making you extra nervous?\" He's a cool guy and I know he wasn't doing it to be mean but I definitely should have told him it wasn't cool. It made me feel so awful.",
      "created_utc": 1732540605.0,
      "score": 20,
      "context": [
        {
          "id": "lyv3rza",
          "author": "None",
          "body": "I carry so much shame due to my disorder. And people feel it is justified, they think they do us a favour by being mean or rude, like enough*** shame will force us to be \"normal\". It just makes it worse.",
          "created_utc": 1732512394.0
        }
      ]
    },
    {
      "id": "lyvadbz",
      "author": "bobaylaa",
      "body": "you’re right and it bothers me so much when it so often comes from normally “non-ableist” people/communities. it’s like they think the point is just “such and such disability exists” and not that ALL people deserve respect and reasonable accommodations whether or not you understand why it’s required for them. like what is it - do you need the general public to have already come to the consensus that a certain disability is “valid” before you’re willing to just not be a judgmental jerk towards people you don’t understand?",
      "created_utc": 1732515942.0,
      "score": 36,
      "context": [
        {
          "id": "lyv2hdk",
          "author": "geekgeek2019",
          "body": "Ikr very ableist behavior",
          "created_utc": 1732511744.0
        }
      ]
    },
    {
      "id": "lzue58k",
      "author": "Meallaire",
      "body": "Fwiw, I rarely see threads on aita where people bitch about \"picky\" eating without seeing someone mention ARFID these days!",
      "created_utc": 1733041020.0,
      "score": 1,
      "context": [
        {
          "id": "lyvek2z",
          "author": "Angelangepange",
          "body": "I had to block the picky eaters sub because half was just people complaining someone else is a picky eater and then not listening to anyone who wasn't bashing picky eaters.    \n         \nBefore finding out that arfid existed I felt so so much shame about it. Now that I know I tell everyone. At the first signs of aholery I repeat \"it's a DISORDER, do you think I want to struggle?\". But that is just the way that I am, I enjoy making them feel bad when they have been aholes first.   \nMy whole life I was told that I was a horrible person because my family thought I was pretending to gag to offend their food.    \nYeah I also blocked the am I the ahole sub.",
          "created_utc": 1732518359.0
        }
      ]
    },
    {
      "id": "lyx4zah",
      "author": "cearbhallain",
      "body": "Or the vomiting. As a kid, they'd make me finish my dinner anyway, or stay at the table until bed.",
      "created_utc": 1732549543.0,
      "score": 5,
      "context": [
        {
          "id": "lywesz3",
          "author": "None",
          "body": "I grew up being ridiculed for my choices. It wasn’t a choice though. I had no control over the fear my brain feels about food.",
          "created_utc": 1732539969.0
        }
      ]
    },
    {
      "id": "lz1wncl",
      "author": "Fantastic-Leopard131",
      "body": "Oh this is good",
      "created_utc": 1732614999.0,
      "score": 3,
      "context": [
        {
          "id": "lyy3nwk",
          "author": "Fearless_Nope",
          "body": "i like to point out the irony whenever i hear it. \n\nlike “aren’t you being picky about what they eat?” \nor                                                                                        \n“i think being picky about your own food is better than being picky with someone else’s- it’s not like you’ve gotta eat it lol”",
          "created_utc": 1732560278.0
        }
      ]
    },
    {
      "id": "lyyk1rn",
      "author": "None",
      "body": "It is baffling",
      "created_utc": 1732565372.0,
      "score": 2,
      "context": [
        {
          "id": "lyyiyeq",
          "author": "Conscious-Studio8111",
          "body": "The wildest thing to me is how upset people get like….*Okay*? \n\nEven if it *was* a choice to be picky, how… does that affect you? Like, if I order the same dish at every restaurant, how… does this negatively impact you in any way? You can order whatever you want. I’m not going to eat your dish, you don’t eat mine. The end.",
          "created_utc": 1732565030.0
        }
      ]
    },
    {
      "id": "lyxg5ri",
      "author": "vlc97",
      "body": "This is absolutely true. I used to get constant comments on lunch breaks at work from people about what I was eating, and once I realised that they were just projecting their own issues onto me I stopped caring",
      "created_utc": 1732553066.0,
      "score": 5,
      "context": [
        {
          "id": "lyxc7bg",
          "author": "Rinny-ThePooh",
          "body": "I’m going to tell you a secret. Anybody that gets angry over what somebody else is doing with their life is miserable. I promise you. If they were happy with themselves they wouldn’t care what you do, they’d focus on them. It’s like with being LGBTQ+, people hate on you just for who you are because they cannot accept many parts of themselves, and have been taught not to. So let it be known, next time somebody comments on your life, especially when it doesn’t affect them in the slightest, they simply want you to be as miserable as them.",
          "created_utc": 1732551836.0
        }
      ]
    },
    {
      "id": "lywq7yq",
      "author": "Im_A_Fuckin_Liar",
      "body": "That’s very hard for people to do but it would make everyone’s life a little easier if they did.",
      "created_utc": 1732544487.0,
      "score": 13,
      "context": [
        {
          "id": "lyuzsz8",
          "author": "TrashCanEnigma",
          "body": "For real, literally breaks my heart every time someone says some shit about it. People really wanna believe that the way we are is a choice. Why would I CHOOSE not to be able to like more than 20 foods. It's not that I'm \"not adventurous\" for Pete's sake.",
          "created_utc": 1732510437.0
        },
        {
          "id": "lyv0e3s",
          "author": "None",
          "body": "Exactly. And literally if it is just picky eating, people should still mind their business.",
          "created_utc": 1732510718.0
        }
      ]
    },
    {
      "id": "lz0ha9j",
      "author": "owlsandmoths",
      "body": "I’ve had to pretty much do the same, I will straight up call myself a picky eater rather than let someone else give me the label in a condescending way. Nobody bats an eye if you say it first instead of giving them the satisfaction of “shaming” you.",
      "created_utc": 1732588556.0,
      "score": 6,
      "context": [
        {
          "id": "lyuzsz8",
          "author": "TrashCanEnigma",
          "body": "For real, literally breaks my heart every time someone says some shit about it. People really wanna believe that the way we are is a choice. Why would I CHOOSE not to be able to like more than 20 foods. It's not that I'm \"not adventurous\" for Pete's sake.",
          "created_utc": 1732510437.0
        },
        {
          "id": "lyv2wel",
          "author": "Otherwise-Ad4641",
          "body": "I just say the shit about myself now - yeah I have ARFID, but I’ll just proclaim I’m a really fussy eater. People don’t generally say anything if I say it myself.",
          "created_utc": 1732511951.0
        }
      ]
    },
    {
      "id": "lzued9h",
      "author": "Angelangepange",
      "body": "Yeah but that's the thing that gets me. Even when someone mentions it the op and others still double down because they are there to be told that they are not the ahole. :( it's not ignorance anymore.",
      "created_utc": 1733041168.0,
      "score": 1,
      "context": [
        {
          "id": "lyvek2z",
          "author": "Angelangepange",
          "body": "I had to block the picky eaters sub because half was just people complaining someone else is a picky eater and then not listening to anyone who wasn't bashing picky eaters.    \n         \nBefore finding out that arfid existed I felt so so much shame about it. Now that I know I tell everyone. At the first signs of aholery I repeat \"it's a DISORDER, do you think I want to struggle?\". But that is just the way that I am, I enjoy making them feel bad when they have been aholes first.   \nMy whole life I was told that I was a horrible person because my family thought I was pretending to gag to offend their food.    \nYeah I also blocked the am I the ahole sub.",
          "created_utc": 1732518359.0
        },
        {
          "id": "lzue58k",
          "author": "Meallaire",
          "body": "Fwiw, I rarely see threads on aita where people bitch about \"picky\" eating without seeing someone mention ARFID these days!",
          "created_utc": 1733041020.0
        }
      ]
    },
    {
      "id": "lyxuxry",
      "author": "None",
      "body": "We didn’t have that. My mom just wouldn’t cook things anymore BUT my family still always had things like salad dressing  and tuna and those are huge triggers for me. \n\nWhen people ask me why or how - I tell them I don’t know because if I could understand why I fear things, maybe I could work towards getting a better grip on it.",
      "created_utc": 1732557577.0,
      "score": 3,
      "context": [
        {
          "id": "lywesz3",
          "author": "None",
          "body": "I grew up being ridiculed for my choices. It wasn’t a choice though. I had no control over the fear my brain feels about food.",
          "created_utc": 1732539969.0
        },
        {
          "id": "lyx4zah",
          "author": "cearbhallain",
          "body": "Or the vomiting. As a kid, they'd make me finish my dinner anyway, or stay at the table until bed.",
          "created_utc": 1732549543.0
        }
      ]
    },
    {
      "id": "lz1que8",
      "author": "Otherwise-Ad4641",
      "body": "Yep. Allergies + ARFID + Autism + OCD (obsessions and compulsions around how food is stored, prepared, served, handled) + Vegetarian.\n\nFood has never been easy + I’m already so good at criticising myself!",
      "created_utc": 1732611082.0,
      "score": 3,
      "context": [
        {
          "id": "lyuzsz8",
          "author": "TrashCanEnigma",
          "body": "For real, literally breaks my heart every time someone says some shit about it. People really wanna believe that the way we are is a choice. Why would I CHOOSE not to be able to like more than 20 foods. It's not that I'm \"not adventurous\" for Pete's sake.",
          "created_utc": 1732510437.0
        },
        {
          "id": "lyv2wel",
          "author": "Otherwise-Ad4641",
          "body": "I just say the shit about myself now - yeah I have ARFID, but I’ll just proclaim I’m a really fussy eater. People don’t generally say anything if I say it myself.",
          "created_utc": 1732511951.0
        },
        {
          "id": "lz0ha9j",
          "author": "owlsandmoths",
          "body": "I’ve had to pretty much do the same, I will straight up call myself a picky eater rather than let someone else give me the label in a condescending way. Nobody bats an eye if you say it first instead of giving them the satisfaction of “shaming” you.",
          "created_utc": 1732588556.0
        }
      ]
    }
  ]
}