{
  "id": "1h1dwz5",
  "subreddit": "ARFID",
  "author": "patrickbateperson",
  "created_utc": 1732738873.0,
  "title": "obligatory \"fuck thanksgiving\" thread",
  "selftext": "that's it. that's the post. this holiday has been a nightmare since i was a child and i wish i weren't still shamed and pressured into attending meals with judgmental family. i hope all of my fellow USAmericans with ARFID survive tomorrow with minimal bullshit -\\_-",
  "url": "https://www.reddit.com/r/ARFID/comments/1h1dwz5/obligatory_fuck_thanksgiving_thread/",
  "score": 377,
  "num_comments": 89,
  "comments": [
    {
      "id": "lzber7b",
      "author": "jinxxsyd13",
      "body": "i got my wisdom teeth removed a couple days ago so I have the easiest excuse to avoid the foods, i get my popsicles and mashed potatoes and I get to be happy",
      "created_utc": 1732746684.0,
      "score": 125,
      "context": []
    },
    {
      "id": "lzasntg",
      "author": "Tallem00",
      "body": "I remember as a small child (roughly 6-11 years old based on where I was living) I was sitting on the floor behind the couch crying and eating chicken nuggets because my family wouldn't stop making fun of me for the nuggets",
      "created_utc": 1732739636.0,
      "score": 122,
      "context": []
    },
    {
      "id": "lzc534r",
      "author": "MeowMeow_77",
      "body": "I have felt bad for subjecting my 11 yo to this holiday for the past 7 years! On one hand, it’s a holiday for family to gather, in the other it revolves around food that my child can’t tolerate. Everyone looks at me like I’m a bad parent for “catering” to my child and not “forcing” her to eat food like everyone else. She will literally starve herself to the point of throwing up instead of eating food she can’t tolerate. Why are people sick AH when it comes to food?!  I got her her safe food and I will fight anyone that judges us. I hate this holiday for her 😢",
      "created_utc": 1732756530.0,
      "score": 26,
      "context": []
    },
    {
      "id": "lzbvqwl",
      "author": "pwhlb",
      "body": "Me and the dinner rolls against the world 🤜🏻🤛🏻",
      "created_utc": 1732752953.0,
      "score": 46,
      "context": []
    },
    {
      "id": "lzarg4j",
      "author": "Traumarama79",
      "body": "I hated Thanksgiving as a kid. For some reason we would go and spend it with a particular side of in-laws who were very traditional and judgmental, and openly made comments about my dislike of, well, everything that was served. For some reason in adulthood my tastes changed and now I love Thanksgiving food. But it still sucks. And it's a colonialist tradition that celebrates settling and genocide, so there's that.",
      "created_utc": 1732739249.0,
      "score": 37,
      "context": []
    },
    {
      "id": "lzbytpn",
      "author": "Pigman373",
      "body": "probably the worst day of the year",
      "created_utc": 1732754120.0,
      "score": 14,
      "context": []
    },
    {
      "id": "lzazg3c",
      "author": "ZoeyMoon",
      "body": "A couple years back my partner and I started making our own thanksgiving. We do enchiladas and tacos with some pumpkin pie dessert (his dessert). We celebrate just the two of us and I don’t have to worry about making food I won’t even eat.",
      "created_utc": 1732741775.0,
      "score": 25,
      "context": []
    },
    {
      "id": "lzb3lz8",
      "author": "pansai_",
      "body": "My mom keeps asking me what dishes I want for Thanksgiving. \n\n*\"Same as every year, mother. Turkey, mashed potatoes with cheese/butter, and corn.\"*\n\nShe then asks me if I'm going to try any of the other food. I reply, as usual, no.",
      "created_utc": 1732743071.0,
      "score": 25,
      "context": []
    },
    {
      "id": "lzc8tyn",
      "author": "Chelseannerose",
      "body": "When I was a kid I would always have something different for dinner on thanksgiving like rice or pasta. Well this once Thanksgiving I was eating rice and my aunts husbands sister sat next to me. She looked at my food and said I don’t want to sit next to someone who’s not eating a traditional thanksgiving meal. Then she got up to eat at another table. This made me hate thanksgiving even more. Thankfully now it’s now my husband and my parents. My husband’s family is very understanding so it makes it easier for me to enjoy it.",
      "created_utc": 1732757973.0,
      "score": 9,
      "context": []
    },
    {
      "id": "lzastpv",
      "author": "ResurgentClusterfuck",
      "body": "My ex husband used to force me to eat nasty shit on holidays like Thanksgiving \n\nNever again",
      "created_utc": 1732739689.0,
      "score": 26,
      "context": []
    },
    {
      "id": "lzcrlc1",
      "author": "boringlesbian",
      "body": "When I got custody of my nephew, and we had a roommate that never had a say in what was served at meals, and my ex had grown up in chaos, I decided that everyone would get exactly what they wanted for thanksgiving dinner. It didn’t matter what it was, I was going to make it for them.\n\nSo the first thanksgiving we had together, I decided to start preparing the night before, because there was going to be three different types of mashed potatoes, two types of dressing/stuffing, multiple versions of various vegetables, multiple bread types, and three types of meats. Then four different desserts.\n\nI was up for hours, but I was enjoying myself. \nAround midnight, the kid wandered out and said the smells were making his stomach grumble and could he have a little bit now? Then the other two came out. We ended up having midnight thanksgiving with everyone getting what they liked. \n\nIt was awesome. Midnight thanksgiving continued for several years until everyone moved apart.",
      "created_utc": 1732765455.0,
      "score": 9,
      "context": []
    },
    {
      "id": "lzbxwde",
      "author": "Neocactus",
      "body": "Fuck Thanksgiving\n\nI'm prolly going this year, but I've skipped in the past. No regrets. Being there literally makes me feel like an alien",
      "created_utc": 1732753770.0,
      "score": 8,
      "context": []
    },
    {
      "id": "lzc25aw",
      "author": "feistymummy",
      "body": "I used ketchup with my turkey to make it edible for me. When I got married my husbands family made fun of me for it…so I don’t do that anymore. Fuck this holiday.",
      "created_utc": 1732755390.0,
      "score": 8,
      "context": []
    },
    {
      "id": "lzckr75",
      "author": "anilucy",
      "body": "I literally ate so much food today bc I know there’s not going to be anything arfid friendly for me tomorrow on the dinner table so I’m going to starve",
      "created_utc": 1732762636.0,
      "score": 8,
      "context": []
    },
    {
      "id": "lzb41w1",
      "author": "Fun_Intention_5371",
      "body": "Wishing you all a bullshit free holiday. Eat before you go",
      "created_utc": 1732743211.0,
      "score": 12,
      "context": []
    },
    {
      "id": "lzcbsj8",
      "author": "toomuch_lavender",
      "body": "My solution is to be the person in control of the entire meal - I only serve what I know I'll eat. There are only three of us, all of us really like what I'm making. No crazy smells, no unexpected textures, no weird mixed-up things that shouldn't  be touching, not a damn casserole in sight. I've waited my entire life for this one Thanksgiving.",
      "created_utc": 1732759105.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lzbw9ol",
      "author": "ch3rrybl0ssoms",
      "body": "So glad I don’t celebrate it",
      "created_utc": 1732753153.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lzc0br4",
      "author": "Rsbbit060404",
      "body": "Last year, I made myself broccoli cheese soup, and this year, I made trail mix, which I will probably only eat the M&Ms out of. My tip is to make something and bring it so everyone at the table can enjoy it. I am extremely fortunate that I like most traditional Thanksgiving food. Seriously, mashed potatoes with beef gravy are my biggest safe food.",
      "created_utc": 1732754691.0,
      "score": 6,
      "context": []
    },
    {
      "id": "lzcczs1",
      "author": "kippenon",
      "body": "Unfortunately my ARFID (which mainly surrounds a severe fear of choking) decided to major-league flare up around two weeks ago, & it’s still going strong. So I won’t be able to eat pretty much anything tmrw when I go to my family’s event :[ It’s gotten progressively worse by the year, but at least the mashed potatoes will always be my savior during this time lmao \n\nI wish the best for everyone tomorrow! 🩷",
      "created_utc": 1732759574.0,
      "score": 6,
      "context": []
    },
    {
      "id": "lzayl5x",
      "author": "purplechunkymonkey",
      "body": "My daughter will eat turkey and biscuits. Maybe stuffing and cranberry sauce.",
      "created_utc": 1732741501.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lzblaqw",
      "author": "unicorn_in-training",
      "body": "I left the country for it this year 😁 No Thanksgiving for me, woohoo! Sending love to everyone who has to suffer through Black Thursday ❤️",
      "created_utc": 1732749000.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lzbmojy",
      "author": "MyMoreOriginalName",
      "body": "God I feel this sooo much.I hope you have a bullshit free day tomorrow too!  This holiday sucks and I haven't actively celebrated it with people in years. Too much bullshit shame for me to deal with around it when it comes to the food aspect. It's just Not worth my time",
      "created_utc": 1732749513.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lzbpxr2",
      "author": "SadisticGoose",
      "body": "Thanksgiving has always been my parents, my sister, and myself. I help make the mac n cheese, but otherwise I don’t have to help with or eat anything else. Sometimes I decide to try something new, but I don’t care for casseroles, which is most of what we have. I’d really love to try sweet potato casserole because I’ve had sweet potatoes in other forms, but my family doesn’t do that.",
      "created_utc": 1732750739.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lzbwygy",
      "author": "Otherwise-Ad4641",
      "body": "Another year of being thankful not to be American and not have to suffer through Thanksgiving.",
      "created_utc": 1732753414.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lzc5ggw",
      "author": "KurapikaKurtaAkaku",
      "body": "My mom made food for me and is letting me stay home, I’m actually looking forward to it :)",
      "created_utc": 1732756672.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lzc9p2d",
      "author": "soggycedar",
      "body": "Meat and potatoes with gravy is one of my favorite foods. Green bean casserole is also great because any cream based salty food is great. I happen to like stuffing too, so between those, even if people serve weird stuff, I will always be happy at thanksgiving!\n\nEdit: The stuffing has to be the instant kind or similar. When people get creative with it, I am not interested in trying it.",
      "created_utc": 1732758302.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lzc8zns",
      "author": "littleghool",
      "body": "I finally get the day to myself this year. I'm gonna sit in my bed, get whatever is available on door dash and watch The Office without anyone here to make food that grosses me out, to judge me or ask me what I'm eating or have to deal with the nasty dishes or have to find a place to hide in the middle of the dinner. Solo Thanksgiving 👌",
      "created_utc": 1732758035.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lzc9pyi",
      "author": "Queenofwands1212",
      "body": "I don’t celebrate it. I don’t do anything with anyone. I don’t submit to the stupidity that society makes this holiday. It’s a gluttony holiday and serves no purpose other than food and “family” and drinking and getting fucked up. I have no friends or family where I live. I’m happy to be alone and just eat the same shit I eat everyday. Same shit different day :)",
      "created_utc": 1732758311.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lzcgpl3",
      "author": "Outsider0_0",
      "body": "Thanksgiving has always been my least favorite holiday... Stay strong out there folks. It always sucks dealing with family members who just refuse to get it or refuse to accept that this is just how you are... It's even worse when people take it as an insult that you won't try their food, but then you're the bad guy for calling people out for insulting you constantly for your food choices/needs...\n\nI'm so glad I moved away from all my family. Now I usually can just avoid the mess that is Thanksgiving and do my own thing by myself. I can only fly home so often, and will always choose going home for Christmas instead.",
      "created_utc": 1732761036.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lzccdh0",
      "author": "lykexomigah",
      "body": "my husband said i get to stay home this year!! i wish i was celebrating with my mom and dad. My dad most likely has arfid and my niece who is a kid (super picky) my mom is making her a cheese pizza at her request",
      "created_utc": 1732759332.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lzczl6d",
      "author": "Bulky_Influence_4914",
      "body": "Illusion and Picking Feast. Move your food around enough to make it look like you're eating. All Thanksgiving food is gross, especially stuffing that's too moist and mushy. Sweet potatoes are way too sweet. Turkey mostly tastes disgusting. And I like ham, but it's rife with gristle and weird veins of connective tissue. Pumpkin pie is like snot and gross tasting. Too many different food soaking in various juices and gravy, all spread out on the plate. Dinner rolls, mashed potatoes, maybe some green beans. The rest of it, 🤢🤮",
      "created_utc": 1732769030.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lzf6don",
      "author": "Tommy_Wisseau_burner",
      "body": "It’s not too hard for me, luckily. My family absolutely judges me for picky eating because everyone on both sides will eat everything under the sun\n\nThat said I make it work by getting what I want and then 2 things I don’t like (and obviously make sure they don’t touch lol). And not that much so later on it looks like I just couldn’t finish everything. Then I start moseying around and watching football as if I’m *that* entrenched in the game (I love football but not enough to forget to eat). Then I’ll get up go somewhere so no one catches on that I didn’t eat that much. Important that you mix the food before getting to the other group and have a napkin to hide some of it. Then throw it out and everything is Gucci",
      "created_utc": 1732809314.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lzfv8pi",
      "author": "lucksh0t",
      "body": "Fuck this stupid holiday. I'm not going this year it just brings up to many bad memories. I'm just gonna have a hard lift in my gym and have a pizza for dinner.",
      "created_utc": 1732817461.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lzgi07g",
      "author": "vonoddly",
      "body": "The worst part for me is having a family offer up something they made from scratch and say something like “Oh, please try it!!! Just for me. It would make me so happy if you tried it for me!” When there is any pressure for me to be brave and try something new it’s extra difficult. Trying something different while 10 or so people stare is so hard omg.\n\nEveryone makes fun of whatever I brought for me to eat and they are all disappointed that I won’t try whatever they brought. It’s the worst holiday.",
      "created_utc": 1732825116.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lzgsvap",
      "author": "ControlOk8832",
      "body": "Agreed fuck thanksgiving. Our society is way too foodcentric",
      "created_utc": 1732828769.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lzhyw03",
      "author": "self-lovin",
      "body": "i think this was my last thanksgiving. i will no longer be celebrating. its a problematic food-centered holiday with a shady propagandized history. why do i force myself to sit at a table listening to problematic uncles and flinch at all the comments i get on my plate or lack thereof? just to avoid hurting someone's feelings? no thank you. i get to the end of the day every thanksgiving thinking \"huh. may have been better to disappoint someone today.\" cuz this aint worth it. i'd rather hang with loved ones when i genuinely want to than force myself through a day of expectations that \"celebrates\" things that arent really authentic to me to celebrate in the first place. im over it",
      "created_utc": 1732845841.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lzi5czo",
      "author": "princessuuke",
      "body": "Im so glad i found out arfid is a thing and im not \"just picky\" its been a struggle my entire life. I hate thanksgiving. I did somewhat enjoy it some years with my dads family cause my grandparents knew i had issues with most of the food and would make something for me so i wouldnt be left out. But fuck i still hate comments and people being weird and then being forced to see other peoples plates and seeing them eat and the smells... gross gross GROSS",
      "created_utc": 1732848645.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lzcgtqn",
      "author": "Violet_Mermaid",
      "body": "Well luckily I wasn’t invited to my family’s thanksgiving. It’s out of town and I’m deemed too poor to take a week off. Wasn’t even asked or anything. So I’m gonna eat whatever I want tomorrow. Which will probably be soup. Lol",
      "created_utc": 1732761082.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lzcys7s",
      "author": "spooky-ufo",
      "body": "i don’t eat a single thing unless there are roasted vegetables and pie lol. i’ve always hated thanksgiving for this reason",
      "created_utc": 1732768657.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lzdv50t",
      "author": "Pink_Bread_76",
      "body": "AMEN I relate so hard to every word of this",
      "created_utc": 1732787049.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lzebffb",
      "author": "CatLover_801",
      "body": "My moms family had (back in October cus we’re Canadian) a large plate of snacks that we could eat as we wanted and we didn’t do any big dinner this year. I hope this continues next year because I love being with my family but the food part is less than fun",
      "created_utc": 1732796988.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lzfp1dt",
      "author": "Prettynoises",
      "body": "Fuck Thankstaking even without the food issues",
      "created_utc": 1732815438.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lzg4a58",
      "author": "1dsided",
      "body": "Stuffing, gravy, and dessert day!",
      "created_utc": 1732820411.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lzgwuud",
      "author": "KennaLikesPizza",
      "body": "Happy Thanksgiving ❌\nStressful Thanksgiving ✅",
      "created_utc": 1732830204.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lzh354j",
      "author": "bblulz",
      "body": "they can pry my mashed potatoes, canned cranberry sauce, and kings hawaiian rolls from my cold dead hands",
      "created_utc": 1732832537.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lzh7byw",
      "author": "greychick",
      "body": "Currently frustrated everything is closed and the things I cooked didn't come out appropriately enough for my brain to eat! Hate holidays for food reasons!",
      "created_utc": 1732834162.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lzh7jeu",
      "author": "poopyfard666",
      "body": "me trying to eat pumpkin pie but the texture is making me sick while reading this. i tried turkey earlier but it was on the bone and slimey so i didnt eat much, but im proud of myself for attempting",
      "created_utc": 1732834244.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lzhhn1a",
      "author": "Ok-Perspective-9684",
      "body": "yeah this is the last year i celebrate thanksgiving. after this year me and my sister are gonna stand together and not go to EITHER of my divorced families thanksgiving events",
      "created_utc": 1732838438.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lzhqasf",
      "author": "Alternative_Tone1461",
      "body": "i was always made fun of for only eating turkey, rolls, and angel food cake. now that it’s only seven of us, they’ve stopped. i hated today, tbh",
      "created_utc": 1732842133.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lzipmzp",
      "author": "melfilmz",
      "body": "i just hide in the corner and eat all of the rolls ",
      "created_utc": 1732858040.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lzv55nm",
      "author": "None",
      "body": "Got food poisoning this year from the family Thanksgiving. They complain about me not eating next year I'll shit in a fucking bag and dump it on their damn couch.",
      "created_utc": 1733058249.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lzc9xmo",
      "author": "kittysparkles85",
      "body": "Everyone in here is now planning dental surgery before major holidays.",
      "created_utc": 1732758392.0,
      "score": 69,
      "context": [
        {
          "id": "lzber7b",
          "author": "jinxxsyd13",
          "body": "i got my wisdom teeth removed a couple days ago so I have the easiest excuse to avoid the foods, i get my popsicles and mashed potatoes and I get to be happy",
          "created_utc": 1732746684.0
        }
      ]
    },
    {
      "id": "lzby1s6",
      "author": "cearbhallain",
      "body": "I love this for you!!!",
      "created_utc": 1732753826.0,
      "score": 10,
      "context": [
        {
          "id": "lzber7b",
          "author": "jinxxsyd13",
          "body": "i got my wisdom teeth removed a couple days ago so I have the easiest excuse to avoid the foods, i get my popsicles and mashed potatoes and I get to be happy",
          "created_utc": 1732746684.0
        }
      ]
    },
    {
      "id": "lzdqttb",
      "author": "Fizzabl",
      "body": "I might have the exact same over Christmas. I'll be sucking chocolate all day!",
      "created_utc": 1732784170.0,
      "score": 2,
      "context": [
        {
          "id": "lzber7b",
          "author": "jinxxsyd13",
          "body": "i got my wisdom teeth removed a couple days ago so I have the easiest excuse to avoid the foods, i get my popsicles and mashed potatoes and I get to be happy",
          "created_utc": 1732746684.0
        }
      ]
    },
    {
      "id": "lzat29r",
      "author": "patrickbateperson",
      "body": "this kind of shit BREAKS you as a kid. it's just \"jokes\" and passing comments to the people saying it, but to a child it is a *constant* barrage that makes you feel like something is fundamentally wrong with you.",
      "created_utc": 1732739764.0,
      "score": 105,
      "context": [
        {
          "id": "lzasntg",
          "author": "Tallem00",
          "body": "I remember as a small child (roughly 6-11 years old based on where I was living) I was sitting on the floor behind the couch crying and eating chicken nuggets because my family wouldn't stop making fun of me for the nuggets",
          "created_utc": 1732739636.0
        }
      ]
    },
    {
      "id": "lzcani5",
      "author": "None",
      "body": "Every year - why don’t you eat - insert food name here- just try it. Or  - not even with gravy? Every single year…. Oh you have never had mine.",
      "created_utc": 1732758668.0,
      "score": 23,
      "context": [
        {
          "id": "lzasntg",
          "author": "Tallem00",
          "body": "I remember as a small child (roughly 6-11 years old based on where I was living) I was sitting on the floor behind the couch crying and eating chicken nuggets because my family wouldn't stop making fun of me for the nuggets",
          "created_utc": 1732739636.0
        }
      ]
    },
    {
      "id": "lzef2y4",
      "author": "mamapajamas",
      "body": "For Thanksgiving, my kid eats her fave: baked beans, corn chips and pickles, and I’ll defend her til my dying day against anyone that utters a hint of a criticism. Seriously, mind your own plates, people!",
      "created_utc": 1732798772.0,
      "score": 9,
      "context": [
        {
          "id": "lzasntg",
          "author": "Tallem00",
          "body": "I remember as a small child (roughly 6-11 years old based on where I was living) I was sitting on the floor behind the couch crying and eating chicken nuggets because my family wouldn't stop making fun of me for the nuggets",
          "created_utc": 1732739636.0
        }
      ]
    },
    {
      "id": "lzdfzg2",
      "author": "Carlulua",
      "body": "My dad had a huge shout at me when I was 8-10 because I didn't like gammon and some potato bake for the first time. Didn't eat gammon again for 15 years.\n\nBut turns out I love gammon. This kinda shit screws progress up for us. \n\nWe need acceptance and gentle encouragement, not shouting and judgement.",
      "created_utc": 1732777458.0,
      "score": 4,
      "context": [
        {
          "id": "lzasntg",
          "author": "Tallem00",
          "body": "I remember as a small child (roughly 6-11 years old based on where I was living) I was sitting on the floor behind the couch crying and eating chicken nuggets because my family wouldn't stop making fun of me for the nuggets",
          "created_utc": 1732739636.0
        }
      ]
    },
    {
      "id": "lzcnlq1",
      "author": "ThemChad",
      "body": "Same but with bagels or burritos! Then they made fun of my for sitting in my room the whole time. It’s my last thanksgiving at home and I have no idea what to do now.",
      "created_utc": 1732763784.0,
      "score": 1,
      "context": [
        {
          "id": "lzasntg",
          "author": "Tallem00",
          "body": "I remember as a small child (roughly 6-11 years old based on where I was living) I was sitting on the floor behind the couch crying and eating chicken nuggets because my family wouldn't stop making fun of me for the nuggets",
          "created_utc": 1732739636.0
        }
      ]
    },
    {
      "id": "lzcsevn",
      "author": "pasghetti_n_meatbals",
      "body": "Yup! As a parent, if we are going to another house, I need to know ahead of time who will be there and that they are respectful and the entire menu. Safe foods need to be included as special like the other dishes, not just a little separate lunch box, where smell free rooms are located, have plenty of activities on hand to shift the focus from eating to having fun and be ready to take a break away or even bail on the event if needed. ",
      "created_utc": 1732765802.0,
      "score": 8,
      "context": [
        {
          "id": "lzc534r",
          "author": "MeowMeow_77",
          "body": "I have felt bad for subjecting my 11 yo to this holiday for the past 7 years! On one hand, it’s a holiday for family to gather, in the other it revolves around food that my child can’t tolerate. Everyone looks at me like I’m a bad parent for “catering” to my child and not “forcing” her to eat food like everyone else. She will literally starve herself to the point of throwing up instead of eating food she can’t tolerate. Why are people sick AH when it comes to food?!  I got her her safe food and I will fight anyone that judges us. I hate this holiday for her 😢",
          "created_utc": 1732756530.0
        }
      ]
    },
    {
      "id": "lzd849c",
      "author": "jorwyn",
      "body": "I got mostly lucky as a little kid. My grandma always quietly was on my side. She'd offer to make up my plate and then not include anything she knew I wouldn't eat. Sometimes, Mom got involved and added other things, but most of the time we'd wait until she wasn't paying attention, and Grandma would motion for one of my cousins would eat that stuff for me.  It's too bad we moved away when I was almost 10, but at least my very early holidays weren't too bad - at least, not relevant to food. \n\nGrandma had this belief that as long as I ate, and not just dessert, it was fine. She knew if I was forced to eat things, I'd shut down and be unable to eat anything. To her, it was a holiday, so we should be enjoying things and being together, not worrying about what someone did or didn't eat. She just made sure there were things that everyone could/would eat and didn't judge.",
      "created_utc": 1732773152.0,
      "score": 17,
      "context": [
        {
          "id": "lzarg4j",
          "author": "Traumarama79",
          "body": "I hated Thanksgiving as a kid. For some reason we would go and spend it with a particular side of in-laws who were very traditional and judgmental, and openly made comments about my dislike of, well, everything that was served. For some reason in adulthood my tastes changed and now I love Thanksgiving food. But it still sucks. And it's a colonialist tradition that celebrates settling and genocide, so there's that.",
          "created_utc": 1732739249.0
        }
      ]
    },
    {
      "id": "lzasqs2",
      "author": "patrickbateperson",
      "body": "100%, all this bullshit for some myth that whitewashes colonial history and obscures the violence european settlers inflicted on native americans. i can definitely relate to the judgmental comments from family :( i am very glad though that you are able to enjoy more foods now! :)",
      "created_utc": 1732739663.0,
      "score": 18,
      "context": [
        {
          "id": "lzarg4j",
          "author": "Traumarama79",
          "body": "I hated Thanksgiving as a kid. For some reason we would go and spend it with a particular side of in-laws who were very traditional and judgmental, and openly made comments about my dislike of, well, everything that was served. For some reason in adulthood my tastes changed and now I love Thanksgiving food. But it still sucks. And it's a colonialist tradition that celebrates settling and genocide, so there's that.",
          "created_utc": 1732739249.0
        }
      ]
    },
    {
      "id": "lzd4ylk",
      "author": "jorwyn",
      "body": "My husband and I have his mom over. She's happy with whatever I make and always praises it. I swear, I could make pb&j, and she'd still be happy. I love her so much. \n\nI do make small portions of some things I won't eat that I know she loves, and she doesn't even comment on me not eating them except the one time she told me she didn't want me to go to the bother. It's not at all a bother to make things just for her, honestly.",
      "created_utc": 1732771575.0,
      "score": 8,
      "context": [
        {
          "id": "lzazg3c",
          "author": "ZoeyMoon",
          "body": "A couple years back my partner and I started making our own thanksgiving. We do enchiladas and tacos with some pumpkin pie dessert (his dessert). We celebrate just the two of us and I don’t have to worry about making food I won’t even eat.",
          "created_utc": 1732741775.0
        }
      ]
    },
    {
      "id": "lzd8pq2",
      "author": "jorwyn",
      "body": "Wow! Rice was part of our Thanksgiving when I was growing up. It was meant to be some sort of dessert with sugar, butter, and milk. I was not into that, but I liked the rice by itself. Even my mom who could get so crazy about what I ate had no issues with that. \n\nWhy the hell would .. did she miss the point of the holiday? Clearly, yes. I will never understand people like that.",
      "created_utc": 1732773461.0,
      "score": 6,
      "context": [
        {
          "id": "lzc8tyn",
          "author": "Chelseannerose",
          "body": "When I was a kid I would always have something different for dinner on thanksgiving like rice or pasta. Well this once Thanksgiving I was eating rice and my aunts husbands sister sat next to me. She looked at my food and said I don’t want to sit next to someone who’s not eating a traditional thanksgiving meal. Then she got up to eat at another table. This made me hate thanksgiving even more. Thankfully now it’s now my husband and my parents. My husband’s family is very understanding so it makes it easier for me to enjoy it.",
          "created_utc": 1732757973.0
        }
      ]
    },
    {
      "id": "lzaureb",
      "author": "patrickbateperson",
      "body": "i'm glad he's an ex now!",
      "created_utc": 1732740299.0,
      "score": 23,
      "context": [
        {
          "id": "lzastpv",
          "author": "ResurgentClusterfuck",
          "body": "My ex husband used to force me to eat nasty shit on holidays like Thanksgiving \n\nNever again",
          "created_utc": 1732739689.0
        }
      ]
    },
    {
      "id": "lzff0un",
      "author": "is_bench",
      "body": "i’m gonna cry this is so wholesome",
      "created_utc": 1732812166.0,
      "score": 2,
      "context": [
        {
          "id": "lzcrlc1",
          "author": "boringlesbian",
          "body": "When I got custody of my nephew, and we had a roommate that never had a say in what was served at meals, and my ex had grown up in chaos, I decided that everyone would get exactly what they wanted for thanksgiving dinner. It didn’t matter what it was, I was going to make it for them.\n\nSo the first thanksgiving we had together, I decided to start preparing the night before, because there was going to be three different types of mashed potatoes, two types of dressing/stuffing, multiple versions of various vegetables, multiple bread types, and three types of meats. Then four different desserts.\n\nI was up for hours, but I was enjoying myself. \nAround midnight, the kid wandered out and said the smells were making his stomach grumble and could he have a little bit now? Then the other two came out. We ended up having midnight thanksgiving with everyone getting what they liked. \n\nIt was awesome. Midnight thanksgiving continued for several years until everyone moved apart.",
          "created_utc": 1732765455.0
        }
      ]
    },
    {
      "id": "lzhonty",
      "author": "Sure-Lecture-2542",
      "body": "If you want sweet potato casserole, you should have it. Pick out a recipe. There are so many options with or without marshmallows, nuts, different crusts, etc. \nPick it out and then say something. I bet your family would love to try it with you.",
      "created_utc": 1732841427.0,
      "score": 1,
      "context": [
        {
          "id": "lzbpxr2",
          "author": "SadisticGoose",
          "body": "Thanksgiving has always been my parents, my sister, and myself. I help make the mac n cheese, but otherwise I don’t have to help with or eat anything else. Sometimes I decide to try something new, but I don’t care for casseroles, which is most of what we have. I’d really love to try sweet potato casserole because I’ve had sweet potatoes in other forms, but my family doesn’t do that.",
          "created_utc": 1732750739.0
        }
      ]
    },
    {
      "id": "lzd92g7",
      "author": "jorwyn",
      "body": "I'm envious of your ability to eat green bean casserole. That's not something I've even managed to try since I was a kid. I mean, I still have no plans to. Lol. I can eat green beans plain now. That's plenty. \n\nBuuuut, I host, and it's just my husband and his mom. There's no stress about food at all. I make a bit of some things they like that I don't, but no one is gonna say a word about me not eating them. They just feel grateful I actually made things I don't like.",
      "created_utc": 1732773649.0,
      "score": 2,
      "context": [
        {
          "id": "lzc9p2d",
          "author": "soggycedar",
          "body": "Meat and potatoes with gravy is one of my favorite foods. Green bean casserole is also great because any cream based salty food is great. I happen to like stuffing too, so between those, even if people serve weird stuff, I will always be happy at thanksgiving!\n\nEdit: The stuffing has to be the instant kind or similar. When people get creative with it, I am not interested in trying it.",
          "created_utc": 1732758302.0
        }
      ]
    },
    {
      "id": "lzcsqjo",
      "author": "greens_beans_queen",
      "body": "I feel like this is a plot line for a Black Mirror episode.",
      "created_utc": 1732765942.0,
      "score": 13,
      "context": [
        {
          "id": "lzber7b",
          "author": "jinxxsyd13",
          "body": "i got my wisdom teeth removed a couple days ago so I have the easiest excuse to avoid the foods, i get my popsicles and mashed potatoes and I get to be happy",
          "created_utc": 1732746684.0
        },
        {
          "id": "lzc9xmo",
          "author": "kittysparkles85",
          "body": "Everyone in here is now planning dental surgery before major holidays.",
          "created_utc": 1732758392.0
        }
      ]
    },
    {
      "id": "lzd7aib",
      "author": "amh8011",
      "body": "Unless you’re like me and don’t like mashed potatoes… I prefer dry, overcooked turkey. Yeah, I know it’s a horrible preference. But it’s what I like.",
      "created_utc": 1732772734.0,
      "score": 7,
      "context": [
        {
          "id": "lzber7b",
          "author": "jinxxsyd13",
          "body": "i got my wisdom teeth removed a couple days ago so I have the easiest excuse to avoid the foods, i get my popsicles and mashed potatoes and I get to be happy",
          "created_utc": 1732746684.0
        },
        {
          "id": "lzc9xmo",
          "author": "kittysparkles85",
          "body": "Everyone in here is now planning dental surgery before major holidays.",
          "created_utc": 1732758392.0
        }
      ]
    },
    {
      "id": "lzgggwy",
      "author": "cloudfangLP",
      "body": "I just got full top dentures 3 weeks ago so it definitely works 🤣",
      "created_utc": 1732824577.0,
      "score": 2,
      "context": [
        {
          "id": "lzber7b",
          "author": "jinxxsyd13",
          "body": "i got my wisdom teeth removed a couple days ago so I have the easiest excuse to avoid the foods, i get my popsicles and mashed potatoes and I get to be happy",
          "created_utc": 1732746684.0
        },
        {
          "id": "lzc9xmo",
          "author": "kittysparkles85",
          "body": "Everyone in here is now planning dental surgery before major holidays.",
          "created_utc": 1732758392.0
        }
      ]
    },
    {
      "id": "lzat9at",
      "author": "Tallem00",
      "body": "Exactly. I tried to joke back for a long time but it still always hurt. I could never eat around them without someone saying something.",
      "created_utc": 1732739825.0,
      "score": 28,
      "context": [
        {
          "id": "lzasntg",
          "author": "Tallem00",
          "body": "I remember as a small child (roughly 6-11 years old based on where I was living) I was sitting on the floor behind the couch crying and eating chicken nuggets because my family wouldn't stop making fun of me for the nuggets",
          "created_utc": 1732739636.0
        },
        {
          "id": "lzat29r",
          "author": "patrickbateperson",
          "body": "this kind of shit BREAKS you as a kid. it's just \"jokes\" and passing comments to the people saying it, but to a child it is a *constant* barrage that makes you feel like something is fundamentally wrong with you.",
          "created_utc": 1732739764.0
        }
      ]
    },
    {
      "id": "lzb23oc",
      "author": "BirdsNeedNames",
      "body": "it's comforting in a way to know that i wasn't the only one who experienced this as a kid. constant comments, insults, and judgemental looks. i couldn't escape it at home, at school, at friends' houses, anywhere. it fucked me up really bad. trauma is a word that gets thrown around way too much, but i think for some of us, this kind of stuff might qualify.",
      "created_utc": 1732742600.0,
      "score": 20,
      "context": [
        {
          "id": "lzasntg",
          "author": "Tallem00",
          "body": "I remember as a small child (roughly 6-11 years old based on where I was living) I was sitting on the floor behind the couch crying and eating chicken nuggets because my family wouldn't stop making fun of me for the nuggets",
          "created_utc": 1732739636.0
        },
        {
          "id": "lzat29r",
          "author": "patrickbateperson",
          "body": "this kind of shit BREAKS you as a kid. it's just \"jokes\" and passing comments to the people saying it, but to a child it is a *constant* barrage that makes you feel like something is fundamentally wrong with you.",
          "created_utc": 1732739764.0
        }
      ]
    },
    {
      "id": "lzd9lji",
      "author": "AerolothLorien666",
      "body": "There was vocal intimidation from my stepdad, but the sitting for hours trying to break my will was the worst.",
      "created_utc": 1732773926.0,
      "score": 5,
      "context": [
        {
          "id": "lzasntg",
          "author": "Tallem00",
          "body": "I remember as a small child (roughly 6-11 years old based on where I was living) I was sitting on the floor behind the couch crying and eating chicken nuggets because my family wouldn't stop making fun of me for the nuggets",
          "created_utc": 1732739636.0
        },
        {
          "id": "lzat29r",
          "author": "patrickbateperson",
          "body": "this kind of shit BREAKS you as a kid. it's just \"jokes\" and passing comments to the people saying it, but to a child it is a *constant* barrage that makes you feel like something is fundamentally wrong with you.",
          "created_utc": 1732739764.0
        }
      ]
    },
    {
      "id": "lzcaujm",
      "author": "Tallem00",
      "body": "I could feel myself breathing quicker and getting more anxious as I read that. \"Oh but you've never had *miiiiiiiine*\" always gets me. People take such personal offense to MY eating disorder",
      "created_utc": 1732758743.0,
      "score": 21,
      "context": [
        {
          "id": "lzasntg",
          "author": "Tallem00",
          "body": "I remember as a small child (roughly 6-11 years old based on where I was living) I was sitting on the floor behind the couch crying and eating chicken nuggets because my family wouldn't stop making fun of me for the nuggets",
          "created_utc": 1732739636.0
        },
        {
          "id": "lzcani5",
          "author": "None",
          "body": "Every year - why don’t you eat - insert food name here- just try it. Or  - not even with gravy? Every single year…. Oh you have never had mine.",
          "created_utc": 1732758668.0
        }
      ]
    },
    {
      "id": "lzcj60p",
      "author": "R0da",
      "body": "This is the she that has made me turn evil.\n\nPressure me like that and I'll have no regrets showing you \"your special recipe\" a second time buddy.",
      "created_utc": 1732762004.0,
      "score": 7,
      "context": [
        {
          "id": "lzasntg",
          "author": "Tallem00",
          "body": "I remember as a small child (roughly 6-11 years old based on where I was living) I was sitting on the floor behind the couch crying and eating chicken nuggets because my family wouldn't stop making fun of me for the nuggets",
          "created_utc": 1732739636.0
        },
        {
          "id": "lzcani5",
          "author": "None",
          "body": "Every year - why don’t you eat - insert food name here- just try it. Or  - not even with gravy? Every single year…. Oh you have never had mine.",
          "created_utc": 1732758668.0
        }
      ]
    },
    {
      "id": "lzcw4kv",
      "author": "Isadum",
      "body": "Literally every year like why!! 🤦‍♀️",
      "created_utc": 1732767438.0,
      "score": 1,
      "context": [
        {
          "id": "lzasntg",
          "author": "Tallem00",
          "body": "I remember as a small child (roughly 6-11 years old based on where I was living) I was sitting on the floor behind the couch crying and eating chicken nuggets because my family wouldn't stop making fun of me for the nuggets",
          "created_utc": 1732739636.0
        },
        {
          "id": "lzcani5",
          "author": "None",
          "body": "Every year - why don’t you eat - insert food name here- just try it. Or  - not even with gravy? Every single year…. Oh you have never had mine.",
          "created_utc": 1732758668.0
        }
      ]
    },
    {
      "id": "lzeidpv",
      "author": "SekMemoria",
      "body": "💓",
      "created_utc": 1732800262.0,
      "score": 2,
      "context": [
        {
          "id": "lzasntg",
          "author": "Tallem00",
          "body": "I remember as a small child (roughly 6-11 years old based on where I was living) I was sitting on the floor behind the couch crying and eating chicken nuggets because my family wouldn't stop making fun of me for the nuggets",
          "created_utc": 1732739636.0
        },
        {
          "id": "lzef2y4",
          "author": "mamapajamas",
          "body": "For Thanksgiving, my kid eats her fave: baked beans, corn chips and pickles, and I’ll defend her til my dying day against anyone that utters a hint of a criticism. Seriously, mind your own plates, people!",
          "created_utc": 1732798772.0
        }
      ]
    },
    {
      "id": "lzfic4a",
      "author": "Tallem00",
      "body": "Good mom! \n\n\nMeanwhile my mom *continues* to make fun of how I eat. I'm 24",
      "created_utc": 1732813238.0,
      "score": 2,
      "context": [
        {
          "id": "lzasntg",
          "author": "Tallem00",
          "body": "I remember as a small child (roughly 6-11 years old based on where I was living) I was sitting on the floor behind the couch crying and eating chicken nuggets because my family wouldn't stop making fun of me for the nuggets",
          "created_utc": 1732739636.0
        },
        {
          "id": "lzef2y4",
          "author": "mamapajamas",
          "body": "For Thanksgiving, my kid eats her fave: baked beans, corn chips and pickles, and I’ll defend her til my dying day against anyone that utters a hint of a criticism. Seriously, mind your own plates, people!",
          "created_utc": 1732798772.0
        }
      ]
    },
    {
      "id": "lzfd3eb",
      "author": "AshTecEmpire",
      "body": "Awww, she sounds really sweet 💜 w Grandma",
      "created_utc": 1732811550.0,
      "score": 7,
      "context": [
        {
          "id": "lzarg4j",
          "author": "Traumarama79",
          "body": "I hated Thanksgiving as a kid. For some reason we would go and spend it with a particular side of in-laws who were very traditional and judgmental, and openly made comments about my dislike of, well, everything that was served. For some reason in adulthood my tastes changed and now I love Thanksgiving food. But it still sucks. And it's a colonialist tradition that celebrates settling and genocide, so there's that.",
          "created_utc": 1732739249.0
        },
        {
          "id": "lzd849c",
          "author": "jorwyn",
          "body": "I got mostly lucky as a little kid. My grandma always quietly was on my side. She'd offer to make up my plate and then not include anything she knew I wouldn't eat. Sometimes, Mom got involved and added other things, but most of the time we'd wait until she wasn't paying attention, and Grandma would motion for one of my cousins would eat that stuff for me.  It's too bad we moved away when I was almost 10, but at least my very early holidays weren't too bad - at least, not relevant to food. \n\nGrandma had this belief that as long as I ate, and not just dessert, it was fine. She knew if I was forced to eat things, I'd shut down and be unable to eat anything. To her, it was a holiday, so we should be enjoying things and being together, not worrying about what someone did or didn't eat. She just made sure there were things that everyone could/would eat and didn't judge.",
          "created_utc": 1732773152.0
        }
      ]
    },
    {
      "id": "lzd5j92",
      "author": "ZoeyMoon",
      "body": "That’s how it should be! \n\nWe’d invite people except I’m not close with my family that lives nearby and my husband’s mother passed when he was young. Usually he drops in for family Thanksgiving for an hour or two and then comes back home. I don’t go because everyone is always offended when I refuse to eat. Even if I make up an excuse like I already ate, we have food waiting at home, etc. it doesn’t matter. So I just stopped going 🤷🏼‍♀️ I tried, no reason to make myself uncomfortable. \n\nWe used to do a big Friendsgiving but we’re all at the ages everyone has their own kids and 3-4 Thanksgivings to go to so we usually just go out to dinner one night instead.\n\nIt does make it easier to have less to cook for!",
      "created_utc": 1732771859.0,
      "score": 2,
      "context": [
        {
          "id": "lzazg3c",
          "author": "ZoeyMoon",
          "body": "A couple years back my partner and I started making our own thanksgiving. We do enchiladas and tacos with some pumpkin pie dessert (his dessert). We celebrate just the two of us and I don’t have to worry about making food I won’t even eat.",
          "created_utc": 1732741775.0
        },
        {
          "id": "lzd4ylk",
          "author": "jorwyn",
          "body": "My husband and I have his mom over. She's happy with whatever I make and always praises it. I swear, I could make pb&j, and she'd still be happy. I love her so much. \n\nI do make small portions of some things I won't eat that I know she loves, and she doesn't even comment on me not eating them except the one time she told me she didn't want me to go to the bother. It's not at all a bother to make things just for her, honestly.",
          "created_utc": 1732771575.0
        }
      ]
    },
    {
      "id": "lzhs90l",
      "author": "SadisticGoose",
      "body": "We actually talked at dinner about doing sweet potatoes for Christmas. We just have a lot of food that gets cooked for Thanksgiving and Christmas, so we have to plan for fridge and oven space.",
      "created_utc": 1732842980.0,
      "score": 1,
      "context": [
        {
          "id": "lzbpxr2",
          "author": "SadisticGoose",
          "body": "Thanksgiving has always been my parents, my sister, and myself. I help make the mac n cheese, but otherwise I don’t have to help with or eat anything else. Sometimes I decide to try something new, but I don’t care for casseroles, which is most of what we have. I’d really love to try sweet potato casserole because I’ve had sweet potatoes in other forms, but my family doesn’t do that.",
          "created_utc": 1732750739.0
        },
        {
          "id": "lzhonty",
          "author": "Sure-Lecture-2542",
          "body": "If you want sweet potato casserole, you should have it. Pick out a recipe. There are so many options with or without marshmallows, nuts, different crusts, etc. \nPick it out and then say something. I bet your family would love to try it with you.",
          "created_utc": 1732841427.0
        }
      ]
    },
    {
      "id": "lzyje5n",
      "author": "soggycedar",
      "body": "The green beans need to be canned or well (over) cooked, so they don’t taste too green beany lol. I usually make it myself to ensure that.",
      "created_utc": 1733099288.0,
      "score": 1,
      "context": [
        {
          "id": "lzc9p2d",
          "author": "soggycedar",
          "body": "Meat and potatoes with gravy is one of my favorite foods. Green bean casserole is also great because any cream based salty food is great. I happen to like stuffing too, so between those, even if people serve weird stuff, I will always be happy at thanksgiving!\n\nEdit: The stuffing has to be the instant kind or similar. When people get creative with it, I am not interested in trying it.",
          "created_utc": 1732758302.0
        },
        {
          "id": "lzd92g7",
          "author": "jorwyn",
          "body": "I'm envious of your ability to eat green bean casserole. That's not something I've even managed to try since I was a kid. I mean, I still have no plans to. Lol. I can eat green beans plain now. That's plenty. \n\nBuuuut, I host, and it's just my husband and his mom. There's no stress about food at all. I make a bit of some things they like that I don't, but no one is gonna say a word about me not eating them. They just feel grateful I actually made things I don't like.",
          "created_utc": 1732773649.0
        }
      ]
    },
    {
      "id": "lzd27o9",
      "author": "kittysparkles85",
      "body": "Omg that would be a good episode",
      "created_utc": 1732770253.0,
      "score": 4,
      "context": [
        {
          "id": "lzber7b",
          "author": "jinxxsyd13",
          "body": "i got my wisdom teeth removed a couple days ago so I have the easiest excuse to avoid the foods, i get my popsicles and mashed potatoes and I get to be happy",
          "created_utc": 1732746684.0
        },
        {
          "id": "lzc9xmo",
          "author": "kittysparkles85",
          "body": "Everyone in here is now planning dental surgery before major holidays.",
          "created_utc": 1732758392.0
        },
        {
          "id": "lzcsqjo",
          "author": "greens_beans_queen",
          "body": "I feel like this is a plot line for a Black Mirror episode.",
          "created_utc": 1732765942.0
        }
      ]
    },
    {
      "id": "lzd9xcn",
      "author": "kittysparkles85",
      "body": "But this way you could not eat anything in front of people and have an excuse to stay in bed.",
      "created_utc": 1732774102.0,
      "score": 1,
      "context": [
        {
          "id": "lzber7b",
          "author": "jinxxsyd13",
          "body": "i got my wisdom teeth removed a couple days ago so I have the easiest excuse to avoid the foods, i get my popsicles and mashed potatoes and I get to be happy",
          "created_utc": 1732746684.0
        },
        {
          "id": "lzc9xmo",
          "author": "kittysparkles85",
          "body": "Everyone in here is now planning dental surgery before major holidays.",
          "created_utc": 1732758392.0
        },
        {
          "id": "lzd7aib",
          "author": "amh8011",
          "body": "Unless you’re like me and don’t like mashed potatoes… I prefer dry, overcooked turkey. Yeah, I know it’s a horrible preference. But it’s what I like.",
          "created_utc": 1732772734.0
        }
      ]
    },
    {
      "id": "lzgpzg3",
      "author": "kittysparkles85",
      "body": "\"Man I don't think these are fitting right, it just hurts to eat anything, and it's giving me a headache so I'm going to go lay down. Byyyyyyyeeeee\"",
      "created_utc": 1732827783.0,
      "score": 2,
      "context": [
        {
          "id": "lzber7b",
          "author": "jinxxsyd13",
          "body": "i got my wisdom teeth removed a couple days ago so I have the easiest excuse to avoid the foods, i get my popsicles and mashed potatoes and I get to be happy",
          "created_utc": 1732746684.0
        },
        {
          "id": "lzc9xmo",
          "author": "kittysparkles85",
          "body": "Everyone in here is now planning dental surgery before major holidays.",
          "created_utc": 1732758392.0
        },
        {
          "id": "lzgggwy",
          "author": "cloudfangLP",
          "body": "I just got full top dentures 3 weeks ago so it definitely works 🤣",
          "created_utc": 1732824577.0
        }
      ]
    },
    {
      "id": "lzce1f9",
      "author": "None",
      "body": "Then the - oh you are so picky comments came. It’s just turkey….",
      "created_utc": 1732759983.0,
      "score": 6,
      "context": [
        {
          "id": "lzasntg",
          "author": "Tallem00",
          "body": "I remember as a small child (roughly 6-11 years old based on where I was living) I was sitting on the floor behind the couch crying and eating chicken nuggets because my family wouldn't stop making fun of me for the nuggets",
          "created_utc": 1732739636.0
        },
        {
          "id": "lzcani5",
          "author": "None",
          "body": "Every year - why don’t you eat - insert food name here- just try it. Or  - not even with gravy? Every single year…. Oh you have never had mine.",
          "created_utc": 1732758668.0
        },
        {
          "id": "lzcaujm",
          "author": "Tallem00",
          "body": "I could feel myself breathing quicker and getting more anxious as I read that. \"Oh but you've never had *miiiiiiiine*\" always gets me. People take such personal offense to MY eating disorder",
          "created_utc": 1732758743.0
        }
      ]
    },
    {
      "id": "lzfnhrj",
      "author": "mamapajamas",
      "body": "Oh Tallem00, you don’t deserve that, not a bit. I swear there needs to be an ARFID parenting 101 class. Hugs to you - you are a lovely shining light, and you are *much more* than what you eat.",
      "created_utc": 1732814927.0,
      "score": 2,
      "context": [
        {
          "id": "lzasntg",
          "author": "Tallem00",
          "body": "I remember as a small child (roughly 6-11 years old based on where I was living) I was sitting on the floor behind the couch crying and eating chicken nuggets because my family wouldn't stop making fun of me for the nuggets",
          "created_utc": 1732739636.0
        },
        {
          "id": "lzef2y4",
          "author": "mamapajamas",
          "body": "For Thanksgiving, my kid eats her fave: baked beans, corn chips and pickles, and I’ll defend her til my dying day against anyone that utters a hint of a criticism. Seriously, mind your own plates, people!",
          "created_utc": 1732798772.0
        },
        {
          "id": "lzfic4a",
          "author": "Tallem00",
          "body": "Good mom! \n\n\nMeanwhile my mom *continues* to make fun of how I eat. I'm 24",
          "created_utc": 1732813238.0
        }
      ]
    },
    {
      "id": "lzd6nbr",
      "author": "jorwyn",
      "body": "The family I have in the area, besides my son, are too toxic. I don't have anything to do with them. To be fair to them, they all gave up a very long time ago when it came to food with me. They might eye my plate, but they wouldn't say anything. The toxicity was around, well, absolutely everything else. It got to where I only forced myself to see them on holidays, and that made me dread holidays. Since I stopped talking to them, I love holidays! They're so chill at my house. Quiet, peaceful, and fun. And you're right. That's how it should be. \n\nMy son works in a steak house, so he almost always works on Thanksgiving. He's got Christmas off, though, and it's similar. I make what I feel like. He eats pretty much anything and everything except cake, though. I fought my ARFID so hard when he was little to set a good example for him, and I'm so glad it worked. If he'd turned out really restrictive about food after all those things I learned to pretend to like when I wanted to be sick, I'd be so upset. I have to say, though, it actually did help me expand what I could eat. I was honestly pretty mad that the doctors were right about that. Lol. It did not expand what I like, though. It just made me able to tolerate more without freaking out.",
      "created_utc": 1732772409.0,
      "score": 1,
      "context": [
        {
          "id": "lzazg3c",
          "author": "ZoeyMoon",
          "body": "A couple years back my partner and I started making our own thanksgiving. We do enchiladas and tacos with some pumpkin pie dessert (his dessert). We celebrate just the two of us and I don’t have to worry about making food I won’t even eat.",
          "created_utc": 1732741775.0
        },
        {
          "id": "lzd4ylk",
          "author": "jorwyn",
          "body": "My husband and I have his mom over. She's happy with whatever I make and always praises it. I swear, I could make pb&j, and she'd still be happy. I love her so much. \n\nI do make small portions of some things I won't eat that I know she loves, and she doesn't even comment on me not eating them except the one time she told me she didn't want me to go to the bother. It's not at all a bother to make things just for her, honestly.",
          "created_utc": 1732771575.0
        },
        {
          "id": "lzd5j92",
          "author": "ZoeyMoon",
          "body": "That’s how it should be! \n\nWe’d invite people except I’m not close with my family that lives nearby and my husband’s mother passed when he was young. Usually he drops in for family Thanksgiving for an hour or two and then comes back home. I don’t go because everyone is always offended when I refuse to eat. Even if I make up an excuse like I already ate, we have food waiting at home, etc. it doesn’t matter. So I just stopped going 🤷🏼‍♀️ I tried, no reason to make myself uncomfortable. \n\nWe used to do a big Friendsgiving but we’re all at the ages everyone has their own kids and 3-4 Thanksgivings to go to so we usually just go out to dinner one night instead.\n\nIt does make it easier to have less to cook for!",
          "created_utc": 1732771859.0
        }
      ]
    }
  ]
}