{
  "id": "1h248te",
  "subreddit": "ARFID",
  "author": "JelloOfLife",
  "created_utc": 1732823601.0,
  "title": "i HATE thanksgiving ",
  "selftext": "And I assume I’m not alone. It really sucks how the whole holiday is food centric, like yea it’s about being thankful or whatever, but let’s be for real. It’s food day.\n\nShout out to everyone else having panic attacks in their girlfriend’s bedroom because you have to explain why you’re only eating mashed potatoes today. ",
  "url": "https://www.reddit.com/r/ARFID/comments/1h248te/i_hate_thanksgiving/",
  "score": 154,
  "num_comments": 45,
  "comments": [
    {
      "id": "lzgfr94",
      "author": "Armayra",
      "body": "I was coming here to make a post like this, only for me it's 'having a panic attack in their parents bathroom'. I was doing okayish until my dad made a joke about eating until being ill and so now we're here. \n\nI wish everyone with ARFID could have just one year where it's easy",
      "created_utc": 1732824327.0,
      "score": 43,
      "context": []
    },
    {
      "id": "lzgra9x",
      "author": "Chemical-Ad2770",
      "body": "It’s so fucking embarrassing sitting at the table eating pizza while everyone else is eating the other stuff. Also there was a commercial for advice with picky kids and I immediately left because I knew they would make stupid comments. And from the other room I heard my mom say “it’s called ARFID” and my dad responding “it isn’t called anything, it’s called being picky like his mom”. I wish I had my journal lol",
      "created_utc": 1732828219.0,
      "score": 30,
      "context": []
    },
    {
      "id": "lzgoehj",
      "author": "iloveyoustellarose",
      "body": "Boyfriend's dad bullying me because I didn't \"try a spoonful\" of everything available at dinner even though he's known I've been like this for like 7 years at this point.",
      "created_utc": 1732827291.0,
      "score": 26,
      "context": []
    },
    {
      "id": "lzgqhoi",
      "author": "heartoffiction",
      "body": "My mother in law trying to “accommodate” me by trying to make special versions of things but me saying I couldn’t eat things in the first place was just me lying to try to avoid eating the things…. AHHHHHHHHHHHH",
      "created_utc": 1732827946.0,
      "score": 21,
      "context": []
    },
    {
      "id": "lzgud14",
      "author": "valerieflames",
      "body": "I don’t have ARFID but I suspect my 4 year old son does although not formally diagnosed. I just set his place as usual today and gave him his bowl of Goldfish crackers that he wanted. Thanksgiving is about being together, doesn’t matter what you eat.\n\nOne thing I read on here once that stuck with me is comparing it to how someone without ARFID would feel being pressured to eat food with a dead fly on it. I’m more understanding now to how my son is but I still offer and encourage new foods.",
      "created_utc": 1732829299.0,
      "score": 18,
      "context": []
    },
    {
      "id": "lzh84lh",
      "author": "None",
      "body": "As a mom of an ARFID young adult, I don’t try now in the same way. I offer (is there anything you would like? Pie? Biscuits? Anything —you just let me know). Since we don’t live near family, it’s easy to keep it lowkey. I just feel bad about the missed big dinners with extended family. I always worry I haven’t done enough to help with this. What would you find helpful from your mom? Maybe you can help me be more supportive.",
      "created_utc": 1732834479.0,
      "score": 11,
      "context": []
    },
    {
      "id": "lzgejk5",
      "author": "samit2heck",
      "body": "https://preview.redd.it/fn0ks4x37p3e1.png?width=1080&format=pjpg&auto=webp&s=4085b8b3816479f7e56a28093da10e6caf7c3acd\n\nDefinitely not alone!",
      "created_utc": 1732823898.0,
      "score": 31,
      "context": []
    },
    {
      "id": "lzghr1o",
      "author": "Altruistic_Yellow_29",
      "body": "happy my dad know i got arfid cus ts suck",
      "created_utc": 1732825027.0,
      "score": 8,
      "context": []
    },
    {
      "id": "lzh00lo",
      "author": "GeGeTravis",
      "body": "I have an ARFID cousin and our plates were literally just mashed potatoes. Thankfully everyone understood but I hope you’re doing okay with that.",
      "created_utc": 1732831362.0,
      "score": 7,
      "context": []
    },
    {
      "id": "lzh2i3j",
      "author": "Frenchfrydude",
      "body": "I just hate not being at the table while everyone else is eating. I try to be out in the living room with them, but I still feel so embarrassed and awful needing to sit off to the side",
      "created_utc": 1732832292.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lzh93ky",
      "author": "None",
      "body": "I hate thanksgiving. I hate the memories that surround it. \n\nI’m about to get ready. I’m gonna do my hair and makeup and put on a pretty outfit and not worry about the food or the comments because right now, in this moment in my life, I’m so happy. No one can kill my happiness or my joy.",
      "created_utc": 1732834874.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lzgx06o",
      "author": "Bulky_Influence_4914",
      "body": "I did some pre-eating",
      "created_utc": 1732830259.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lzh9j69",
      "author": "None",
      "body": "I’m not ARFID but my child is. I don’t know what has happened with my appetite over the past few years but it’s not normal and I find myself experiencing what I know she has experienced way too many times. I will be out for a nice dinner with other couples and I’m pushing really good food around my plate. It’s uncomfortable. And I can’t just make myself eat when I don’t want to. I prep for these dinners-including an edible ahead of time. There is no guarantee and it takes away from the evening. My partner gets especially uncomfortable even though he tries not to make it a thing. Happy Thanksgiving to you guys! Holidays are already difficult sometimes.",
      "created_utc": 1732835054.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lzhixfv",
      "author": "veganeyez",
      "body": "Am with you there. This sucks",
      "created_utc": 1732838983.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lzgt6x2",
      "author": "ControlOk8832",
      "body": "Same, except there’s no girlfriend",
      "created_utc": 1732828884.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lzgum3n",
      "author": "StrawbraryLiberry",
      "body": "Yeah, Thanksgiving was ruined for me long ago. I haven't been able to make myself do more than help with food prep in quite a while.",
      "created_utc": 1732829389.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lzhkmld",
      "author": "myhusbandmademedoit5",
      "body": "I have a family member with ARFID, so just asking out of genuine curiosity and care: Is it being around other people that are eating that's a trigger, or food, or being asked why you aren't eating? \n\nMy relative brings her own food when she eats at our house, but I know it makes her uncomfortable to have certain foods in her house, and that's ok. (It's taken some getting used to, but I usually eat before or after I visit.)\nIt would just never occur to me to ask someone why they aren't eating, because it's not my business. My kid ate a roll and some strawberries. It was fine!\nI'm trying to understand triggers better so I can be more mindful. \nI'm sorry that food centered holidays can be rough. \nI like cooking different things, but I'm not offended when someone doesn't try something I make. \n\nJust curious for any input if you would like to give yours!",
      "created_utc": 1732839700.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lziqrcn",
      "author": "rabbit7891",
      "body": "my family has gotten better about commenting on my eating habits but my uncle made duck and cooked it rare and it was so chewy >!it was making me sick and i had to spit it onto my place because i physically couldn’t eat it even though i liked the taste!<",
      "created_utc": 1732858626.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lzh23lx",
      "author": "purplechunkymonkey",
      "body": "So far my daughter has eaten crackers.",
      "created_utc": 1732832140.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lzhpc6b",
      "author": "Jihiprinsa",
      "body": "I’m so thankful that my parents are ok that I only eat 2 things of the dinner they make… my other family though isn’t as accepting and it’s so humiliating when they ask me if I’m going to eat anything else",
      "created_utc": 1732841718.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lzlq2lp",
      "author": "Phoenixtdm",
      "body": "I don’t have ARFID I’m just autistic but the only things I didn’t like at the table was green beans and  my mom didnt force me to eat it",
      "created_utc": 1732908887.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lzm17b9",
      "author": "weebdoesreddit",
      "body": "Yeah Thanksgiving sucks- I just sit in the corner and eat ham",
      "created_utc": 1732912782.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lzhux70",
      "author": "Queenofwands1212",
      "body": "I don’t even celebrate it or do anything with anyone. It’s literally one day. It’s one meal. It’s over tomorrow and no one gives a shit about the holiday",
      "created_utc": 1732844128.0,
      "score": -4,
      "context": []
    },
    {
      "id": "lzggapg",
      "author": "JelloOfLife",
      "body": "Yea we need a thanksgivingless year man",
      "created_utc": 1732824516.0,
      "score": 9,
      "context": [
        {
          "id": "lzgfr94",
          "author": "Armayra",
          "body": "I was coming here to make a post like this, only for me it's 'having a panic attack in their parents bathroom'. I was doing okayish until my dad made a joke about eating until being ill and so now we're here. \n\nI wish everyone with ARFID could have just one year where it's easy",
          "created_utc": 1732824327.0
        }
      ]
    },
    {
      "id": "lzhkbll",
      "author": "communistsayori",
      "body": "Make your dad read the ARFID section of the DSM-5 in front of you and then ask him if it's just being picky. (I know this is likely not applicable I'm just an incredibly petty person.)",
      "created_utc": 1732839571.0,
      "score": 20,
      "context": [
        {
          "id": "lzgra9x",
          "author": "Chemical-Ad2770",
          "body": "It’s so fucking embarrassing sitting at the table eating pizza while everyone else is eating the other stuff. Also there was a commercial for advice with picky kids and I immediately left because I knew they would make stupid comments. And from the other room I heard my mom say “it’s called ARFID” and my dad responding “it isn’t called anything, it’s called being picky like his mom”. I wish I had my journal lol",
          "created_utc": 1732828219.0
        }
      ]
    },
    {
      "id": "lzh8d07",
      "author": "None",
      "body": "I’m sorry :(",
      "created_utc": 1732834574.0,
      "score": 5,
      "context": [
        {
          "id": "lzgoehj",
          "author": "iloveyoustellarose",
          "body": "Boyfriend's dad bullying me because I didn't \"try a spoonful\" of everything available at dinner even though he's known I've been like this for like 7 years at this point.",
          "created_utc": 1732827291.0
        }
      ]
    },
    {
      "id": "lzi8fb4",
      "author": "TashaT50",
      "body": "I’m so sorry",
      "created_utc": 1732849973.0,
      "score": 3,
      "context": [
        {
          "id": "lzgoehj",
          "author": "iloveyoustellarose",
          "body": "Boyfriend's dad bullying me because I didn't \"try a spoonful\" of everything available at dinner even though he's known I've been like this for like 7 years at this point.",
          "created_utc": 1732827291.0
        }
      ]
    },
    {
      "id": "lzi8i9z",
      "author": "TashaT50",
      "body": "That’s the worst. Solidarity",
      "created_utc": 1732850008.0,
      "score": 4,
      "context": [
        {
          "id": "lzgqhoi",
          "author": "heartoffiction",
          "body": "My mother in law trying to “accommodate” me by trying to make special versions of things but me saying I couldn’t eat things in the first place was just me lying to try to avoid eating the things…. AHHHHHHHHHHHH",
          "created_utc": 1732827946.0
        }
      ]
    },
    {
      "id": "lzhz0ok",
      "author": "jorwyn",
      "body": "I compare to wood chips. They smell lovely, but I'm not interested in eating them because they aren't food. For some, I think it is more like your fly example. I'm not grossed out at all if someone else eats those things. In fact, I honestly do love the smell of many things, like coffee, I can't stand consuming. That confuses people, and I find the wood chips analogy works. \n\nTW, cultural food many Westerners may be disturbed by:    \n>! But I've also used grubs before. Many cultures eat grubs, but mine doesn't. If I set a plate of grubs in front of most people where I live and insisted they try just a bite and kept pressuring, I'd have a fight on my hands. They are perfectly edible and nutritious, though, so it's a better analogy than wood chips. However, it grosses people out when I use that example, so I generally won't unless they're being a jerk. !<",
      "created_utc": 1732845897.0,
      "score": 9,
      "context": [
        {
          "id": "lzgud14",
          "author": "valerieflames",
          "body": "I don’t have ARFID but I suspect my 4 year old son does although not formally diagnosed. I just set his place as usual today and gave him his bowl of Goldfish crackers that he wanted. Thanksgiving is about being together, doesn’t matter what you eat.\n\nOne thing I read on here once that stuck with me is comparing it to how someone without ARFID would feel being pressured to eat food with a dead fly on it. I’m more understanding now to how my son is but I still offer and encourage new foods.",
          "created_utc": 1732829299.0
        }
      ]
    },
    {
      "id": "lzh8wu7",
      "author": "None",
      "body": "I agree with how you handled it. I’m not sure how to avoid this but when they get older, it gets harder. People are more likely to accept a 4 year old with a limited pallet. Not so gracious as they age. And they don’t mean anything by it-they just don’t get it. I wish I had known about ARFID when my young adult was 4. I’m not sure what would be different today but I missed the boat completely.",
      "created_utc": 1732834797.0,
      "score": 8,
      "context": [
        {
          "id": "lzgud14",
          "author": "valerieflames",
          "body": "I don’t have ARFID but I suspect my 4 year old son does although not formally diagnosed. I just set his place as usual today and gave him his bowl of Goldfish crackers that he wanted. Thanksgiving is about being together, doesn’t matter what you eat.\n\nOne thing I read on here once that stuck with me is comparing it to how someone without ARFID would feel being pressured to eat food with a dead fly on it. I’m more understanding now to how my son is but I still offer and encourage new foods.",
          "created_utc": 1732829299.0
        }
      ]
    },
    {
      "id": "lzi8qzh",
      "author": "TashaT50",
      "body": "Great mom. Thanks for understanding and supporting him. We need more people like you in this world.",
      "created_utc": 1732850114.0,
      "score": 5,
      "context": [
        {
          "id": "lzgud14",
          "author": "valerieflames",
          "body": "I don’t have ARFID but I suspect my 4 year old son does although not formally diagnosed. I just set his place as usual today and gave him his bowl of Goldfish crackers that he wanted. Thanksgiving is about being together, doesn’t matter what you eat.\n\nOne thing I read on here once that stuck with me is comparing it to how someone without ARFID would feel being pressured to eat food with a dead fly on it. I’m more understanding now to how my son is but I still offer and encourage new foods.",
          "created_utc": 1732829299.0
        }
      ]
    },
    {
      "id": "lzi6c6i",
      "author": "jorwyn",
      "body": "This is super long, and I don't really know how to sum it up. I guess \"don't force particular foods, but encourage trying without any pressure.\" \n\nHelpful for me when I was young would have been my mom not trying to force me to eat things. On top of that, not being sent to the kids' table by myself at 13 (I'm the youngest on all sides) because I wouldn't eat \"like a normal person\" when what I did eat wasn't going to make anyone else not want to eat would have helped. The majority of my family *did not care* what I ate or didn't eat, but my mom seemed to find me embarrassing, and that added stress and shame that made my ARFID worse. Just letting me eat peas, corn, rolls, and mashed potatoes with only butter on them and acting like that was perfectly normal would have been great. \n\nMy son, who is 28 now, will eat anything but cake and asparagus. As soon as he started on solid foods, I introduced a lot of different foods. If he clearly disliked something, I didn't try that food again for months. I just fed him something I knew he did like. As he got old enough to be able to talk to me, I asked him to always try a bite. If he didn't like it, he was allowed to (politely) spit it out. He always knew he had that option, so he was willing to try almost anything. Some, he wouldn't even take a bite of because of the smell. That was fine as long as he told me that's why. We learned to cook things together in different ways to see if he liked them some other way, so he had a lot of control over the food he ate. I think that sense of control is why he is so willing to try new foods and has a huge variety of things he'll eat now. Honestly, he never flat out refused to at least smell something and never refused a single bite if it didn't smell bad to him, but I think I'd have just accepted his no and moved on. There were a lot of things he didn't take a second bite of, but a year or more later, he'd be willing to try again, and he'd often like them. There are so many possible foods, I really didn't care as long as he was getting enough nutrition, but I didn't want him.to be hampered by a restrictive diet like I was. \n\nHe doesn't have ARFID, to be fair, but I know this approach would have helped me a lot. I have texture issues more than anything else, and getting to have control over whether I finished chewing and swallowing it (rather than being punished when I couldn't) would have led to more foods I could eat. I know this because I finally got to do that as an adult, and it did help. My biggest problem now is that I cannot bring myself to try the foods she forced on me. I have too many bad memories attached to those foods. Some of them smell sooooo good, but when I try to eat them, I feel sick and anxious. \n\nMy grandma was totally different from my mom about food. She basically only had a rule that I had to eat something from each category - so one veggie, one meat, one fruit, one dairy. She didn't care what I chose. The only caveat was that if it wasn't what she was making for everyone else and had to be cooked, I had to help cook it - or cook it myself once I was old enough. And meat was expensive, so generally I was going to get a couple of slices of bologna (which was cheap) if I couldn't eat the meat she was already cooking. I think that was totally fair. She shouldn't have had to make something just for me on top of the meal she was making for everyone else once I could cook. She did get in a fight with my mom about this, once. \"All the kids get to choose which cereal they want or what they want in their oatmeal. Why is it different that I let her choose raw peas when everyone else is having cooked carrots?\" Mom's answer was that I needed to eat what everyone else was having. Grandma thought it was dumb to make that rule, since it meant I wouldn't eat at all when I was in the 5th percentile for weight. To her, me eating at all was much more important than what I ate. Grandma, \"so, you'd rather control her than see her healthy? What is wrong with you?\" My hero. :) All my grandparents and great grandparents were super chill about my ARFID. And you know what? I ate a lot more things at their houses - because there was no anxiety attached to food there.",
      "created_utc": 1732849066.0,
      "score": 7,
      "context": [
        {
          "id": "lzh84lh",
          "author": "None",
          "body": "As a mom of an ARFID young adult, I don’t try now in the same way. I offer (is there anything you would like? Pie? Biscuits? Anything —you just let me know). Since we don’t live near family, it’s easy to keep it lowkey. I just feel bad about the missed big dinners with extended family. I always worry I haven’t done enough to help with this. What would you find helpful from your mom? Maybe you can help me be more supportive.",
          "created_utc": 1732834479.0
        }
      ]
    },
    {
      "id": "lzib4x4",
      "author": "TashaT50",
      "body": "Always a smart move. My family, when we get together, which isn’t as often anymore, always does appetizers so it’s easy to accidentally eat too much before the big meal.",
      "created_utc": 1732851172.0,
      "score": 2,
      "context": [
        {
          "id": "lzgx06o",
          "author": "Bulky_Influence_4914",
          "body": "I did some pre-eating",
          "created_utc": 1732830259.0
        }
      ]
    },
    {
      "id": "lzidqc5",
      "author": "TashaT50",
      "body": "It’s a combination of factors: \n* For many of us our families don’t accept we have an ED, ARFID, we need to grow up and stop with the picky eating so they make comments or we know from their looks and body language they are unhappy with us for not eating the normal meal like everyone else. For example Aunt Shirley is loudly offended I’m not having her green bean casserole, just a little taste and she’s sure I’ll love it. We’ve had the same “discussion” for 20 years, it started when I was 5, and will continue until she dies at 80, another 40 years from now. Don’t get me started on Uncle Sam and his special giblet gravy *shudders*\n* Many of us are self conscious eating around others after years and years of people commenting on what we do and don’t eat. We prefer to limit who we eat around as we are ashamed of our limited safe foods \n* Depending on what’s being served it might be a food that just smelling or looking at triggers our gag reflex so being around it is impossible. For example seafood smells literally make me vomit so being around my family when they are doing lobster for Christmas can be extremely difficult as sometimes I can’t eat with the house smelling and I’m trying very hard not to get sick at the table while looking like everything is just fine and people keep asking me what’s wrong and I can’t claim a migraine and upset stomach every single Christmas",
      "created_utc": 1732852326.0,
      "score": 7,
      "context": [
        {
          "id": "lzhkmld",
          "author": "myhusbandmademedoit5",
          "body": "I have a family member with ARFID, so just asking out of genuine curiosity and care: Is it being around other people that are eating that's a trigger, or food, or being asked why you aren't eating? \n\nMy relative brings her own food when she eats at our house, but I know it makes her uncomfortable to have certain foods in her house, and that's ok. (It's taken some getting used to, but I usually eat before or after I visit.)\nIt would just never occur to me to ask someone why they aren't eating, because it's not my business. My kid ate a roll and some strawberries. It was fine!\nI'm trying to understand triggers better so I can be more mindful. \nI'm sorry that food centered holidays can be rough. \nI like cooking different things, but I'm not offended when someone doesn't try something I make. \n\nJust curious for any input if you would like to give yours!",
          "created_utc": 1732839700.0
        }
      ]
    },
    {
      "id": "lzhpi01",
      "author": "Jihiprinsa",
      "body": "I can only eat the pork and the mashed potatoes. Nothing else btw",
      "created_utc": 1732841788.0,
      "score": 1,
      "context": [
        {
          "id": "lzhpc6b",
          "author": "Jihiprinsa",
          "body": "I’m so thankful that my parents are ok that I only eat 2 things of the dinner they make… my other family though isn’t as accepting and it’s so humiliating when they ask me if I’m going to eat anything else",
          "created_utc": 1732841718.0
        }
      ]
    },
    {
      "id": "lzi4nf5",
      "author": "JelloOfLife",
      "body": "Say that to my entire extended family pal, I wish no one gave a shit.",
      "created_utc": 1732848341.0,
      "score": 3,
      "context": [
        {
          "id": "lzhux70",
          "author": "Queenofwands1212",
          "body": "I don’t even celebrate it or do anything with anyone. It’s literally one day. It’s one meal. It’s over tomorrow and no one gives a shit about the holiday",
          "created_utc": 1732844128.0
        }
      ]
    },
    {
      "id": "lzghfk6",
      "author": "Armayra",
      "body": "Yeah, that would be nice. I'd even take a version that was just 'everything is the same except there is no food involved whatsoever' at this point",
      "created_utc": 1732824914.0,
      "score": 5,
      "context": [
        {
          "id": "lzgfr94",
          "author": "Armayra",
          "body": "I was coming here to make a post like this, only for me it's 'having a panic attack in their parents bathroom'. I was doing okayish until my dad made a joke about eating until being ill and so now we're here. \n\nI wish everyone with ARFID could have just one year where it's easy",
          "created_utc": 1732824327.0
        },
        {
          "id": "lzggapg",
          "author": "JelloOfLife",
          "body": "Yea we need a thanksgivingless year man",
          "created_utc": 1732824516.0
        }
      ]
    },
    {
      "id": "lzlj3pa",
      "author": "throw0OO0away",
      "body": "That or we have a Thanksgiving with ONLY safe food.",
      "created_utc": 1732906494.0,
      "score": 1,
      "context": [
        {
          "id": "lzgfr94",
          "author": "Armayra",
          "body": "I was coming here to make a post like this, only for me it's 'having a panic attack in their parents bathroom'. I was doing okayish until my dad made a joke about eating until being ill and so now we're here. \n\nI wish everyone with ARFID could have just one year where it's easy",
          "created_utc": 1732824327.0
        },
        {
          "id": "lzggapg",
          "author": "JelloOfLife",
          "body": "Yea we need a thanksgivingless year man",
          "created_utc": 1732824516.0
        }
      ]
    },
    {
      "id": "lzjxeb8",
      "author": "Chemical-Ad2770",
      "body": "Yeah that ain’t gonna happen lol",
      "created_utc": 1732885035.0,
      "score": 3,
      "context": [
        {
          "id": "lzgra9x",
          "author": "Chemical-Ad2770",
          "body": "It’s so fucking embarrassing sitting at the table eating pizza while everyone else is eating the other stuff. Also there was a commercial for advice with picky kids and I immediately left because I knew they would make stupid comments. And from the other room I heard my mom say “it’s called ARFID” and my dad responding “it isn’t called anything, it’s called being picky like his mom”. I wish I had my journal lol",
          "created_utc": 1732828219.0
        },
        {
          "id": "lzhkbll",
          "author": "communistsayori",
          "body": "Make your dad read the ARFID section of the DSM-5 in front of you and then ask him if it's just being picky. (I know this is likely not applicable I'm just an incredibly petty person.)",
          "created_utc": 1732839571.0
        }
      ]
    },
    {
      "id": "lzl6nfv",
      "author": "Chemical-Ad2770",
      "body": "Also my uncle said “so what have you been eating these days” and apparently my grandpa told my dad something about a nutritionist",
      "created_utc": 1732902263.0,
      "score": 1,
      "context": [
        {
          "id": "lzgra9x",
          "author": "Chemical-Ad2770",
          "body": "It’s so fucking embarrassing sitting at the table eating pizza while everyone else is eating the other stuff. Also there was a commercial for advice with picky kids and I immediately left because I knew they would make stupid comments. And from the other room I heard my mom say “it’s called ARFID” and my dad responding “it isn’t called anything, it’s called being picky like his mom”. I wish I had my journal lol",
          "created_utc": 1732828219.0
        },
        {
          "id": "lzhkbll",
          "author": "communistsayori",
          "body": "Make your dad read the ARFID section of the DSM-5 in front of you and then ask him if it's just being picky. (I know this is likely not applicable I'm just an incredibly petty person.)",
          "created_utc": 1732839571.0
        }
      ]
    },
    {
      "id": "lziau4u",
      "author": "TashaT50",
      "body": "I second all of this. Not being forced to eat foods would have made for a less complicated relationship with food. So many foods I can’t eat because dad forced them. \n\nMy mom had me in the kitchen with her starting around three. As long as my dad wasn’t around I had a lot of control around food, from planning menus, shopping, cooking, learned to modify recipes for my tastes and very comfortable with failure and it taking a number of tries, it made a huge difference for me. Even though I had a restricted number of ingredients I had a much less restricted number of foods. For example I can eat a multitude of chicken, beef, and pasta dishes. I think your right about how you handled things with your son and many of us would have more safe foods if our parents had done it similar.",
      "created_utc": 1732851039.0,
      "score": 5,
      "context": [
        {
          "id": "lzh84lh",
          "author": "None",
          "body": "As a mom of an ARFID young adult, I don’t try now in the same way. I offer (is there anything you would like? Pie? Biscuits? Anything —you just let me know). Since we don’t live near family, it’s easy to keep it lowkey. I just feel bad about the missed big dinners with extended family. I always worry I haven’t done enough to help with this. What would you find helpful from your mom? Maybe you can help me be more supportive.",
          "created_utc": 1732834479.0
        },
        {
          "id": "lzi6c6i",
          "author": "jorwyn",
          "body": "This is super long, and I don't really know how to sum it up. I guess \"don't force particular foods, but encourage trying without any pressure.\" \n\nHelpful for me when I was young would have been my mom not trying to force me to eat things. On top of that, not being sent to the kids' table by myself at 13 (I'm the youngest on all sides) because I wouldn't eat \"like a normal person\" when what I did eat wasn't going to make anyone else not want to eat would have helped. The majority of my family *did not care* what I ate or didn't eat, but my mom seemed to find me embarrassing, and that added stress and shame that made my ARFID worse. Just letting me eat peas, corn, rolls, and mashed potatoes with only butter on them and acting like that was perfectly normal would have been great. \n\nMy son, who is 28 now, will eat anything but cake and asparagus. As soon as he started on solid foods, I introduced a lot of different foods. If he clearly disliked something, I didn't try that food again for months. I just fed him something I knew he did like. As he got old enough to be able to talk to me, I asked him to always try a bite. If he didn't like it, he was allowed to (politely) spit it out. He always knew he had that option, so he was willing to try almost anything. Some, he wouldn't even take a bite of because of the smell. That was fine as long as he told me that's why. We learned to cook things together in different ways to see if he liked them some other way, so he had a lot of control over the food he ate. I think that sense of control is why he is so willing to try new foods and has a huge variety of things he'll eat now. Honestly, he never flat out refused to at least smell something and never refused a single bite if it didn't smell bad to him, but I think I'd have just accepted his no and moved on. There were a lot of things he didn't take a second bite of, but a year or more later, he'd be willing to try again, and he'd often like them. There are so many possible foods, I really didn't care as long as he was getting enough nutrition, but I didn't want him.to be hampered by a restrictive diet like I was. \n\nHe doesn't have ARFID, to be fair, but I know this approach would have helped me a lot. I have texture issues more than anything else, and getting to have control over whether I finished chewing and swallowing it (rather than being punished when I couldn't) would have led to more foods I could eat. I know this because I finally got to do that as an adult, and it did help. My biggest problem now is that I cannot bring myself to try the foods she forced on me. I have too many bad memories attached to those foods. Some of them smell sooooo good, but when I try to eat them, I feel sick and anxious. \n\nMy grandma was totally different from my mom about food. She basically only had a rule that I had to eat something from each category - so one veggie, one meat, one fruit, one dairy. She didn't care what I chose. The only caveat was that if it wasn't what she was making for everyone else and had to be cooked, I had to help cook it - or cook it myself once I was old enough. And meat was expensive, so generally I was going to get a couple of slices of bologna (which was cheap) if I couldn't eat the meat she was already cooking. I think that was totally fair. She shouldn't have had to make something just for me on top of the meal she was making for everyone else once I could cook. She did get in a fight with my mom about this, once. \"All the kids get to choose which cereal they want or what they want in their oatmeal. Why is it different that I let her choose raw peas when everyone else is having cooked carrots?\" Mom's answer was that I needed to eat what everyone else was having. Grandma thought it was dumb to make that rule, since it meant I wouldn't eat at all when I was in the 5th percentile for weight. To her, me eating at all was much more important than what I ate. Grandma, \"so, you'd rather control her than see her healthy? What is wrong with you?\" My hero. :) All my grandparents and great grandparents were super chill about my ARFID. And you know what? I ate a lot more things at their houses - because there was no anxiety attached to food there.",
          "created_utc": 1732849066.0
        }
      ]
    },
    {
      "id": "lzl3esa",
      "author": "Bulky_Influence_4914",
      "body": "Always the way. I completely avoided the turkey. It looked so gross and fleshy",
      "created_utc": 1732901168.0,
      "score": 3,
      "context": [
        {
          "id": "lzgx06o",
          "author": "Bulky_Influence_4914",
          "body": "I did some pre-eating",
          "created_utc": 1732830259.0
        },
        {
          "id": "lzib4x4",
          "author": "TashaT50",
          "body": "Always a smart move. My family, when we get together, which isn’t as often anymore, always does appetizers so it’s easy to accidentally eat too much before the big meal.",
          "created_utc": 1732851172.0
        }
      ]
    },
    {
      "id": "lzi552k",
      "author": "Queenofwands1212",
      "body": "At the end of the day you’re an adult. You can choose to engage in whatever holidays you want or don’t want. End of story, if they can’t handle it that’s on them. There’s 365 days in the year. Can they not connect with you on any of the other days",
      "created_utc": 1732848550.0,
      "score": -1,
      "context": [
        {
          "id": "lzhux70",
          "author": "Queenofwands1212",
          "body": "I don’t even celebrate it or do anything with anyone. It’s literally one day. It’s one meal. It’s over tomorrow and no one gives a shit about the holiday",
          "created_utc": 1732844128.0
        },
        {
          "id": "lzi4nf5",
          "author": "JelloOfLife",
          "body": "Say that to my entire extended family pal, I wish no one gave a shit.",
          "created_utc": 1732848341.0
        }
      ]
    },
    {
      "id": "lzi67e9",
      "author": "JelloOfLife",
      "body": "The other days aren’t the point. The point for the overwhelming majority is family dinner on thanksgiving.\n\nSaying “can they not connect with you any other day” is pretty ignorant lol",
      "created_utc": 1732849010.0,
      "score": 2,
      "context": [
        {
          "id": "lzhux70",
          "author": "Queenofwands1212",
          "body": "I don’t even celebrate it or do anything with anyone. It’s literally one day. It’s one meal. It’s over tomorrow and no one gives a shit about the holiday",
          "created_utc": 1732844128.0
        },
        {
          "id": "lzi4nf5",
          "author": "JelloOfLife",
          "body": "Say that to my entire extended family pal, I wish no one gave a shit.",
          "created_utc": 1732848341.0
        },
        {
          "id": "lzi552k",
          "author": "Queenofwands1212",
          "body": "At the end of the day you’re an adult. You can choose to engage in whatever holidays you want or don’t want. End of story, if they can’t handle it that’s on them. There’s 365 days in the year. Can they not connect with you on any of the other days",
          "created_utc": 1732848550.0
        }
      ]
    },
    {
      "id": "lzi8mbp",
      "author": "Queenofwands1212",
      "body": "I’m not being ignorant. But okay. Im just saying if it really traumatizes you so much to engage in thanksgiving dinner there are other options. Good luck to ya!",
      "created_utc": 1732850057.0,
      "score": -1,
      "context": [
        {
          "id": "lzhux70",
          "author": "Queenofwands1212",
          "body": "I don’t even celebrate it or do anything with anyone. It’s literally one day. It’s one meal. It’s over tomorrow and no one gives a shit about the holiday",
          "created_utc": 1732844128.0
        },
        {
          "id": "lzi4nf5",
          "author": "JelloOfLife",
          "body": "Say that to my entire extended family pal, I wish no one gave a shit.",
          "created_utc": 1732848341.0
        },
        {
          "id": "lzi552k",
          "author": "Queenofwands1212",
          "body": "At the end of the day you’re an adult. You can choose to engage in whatever holidays you want or don’t want. End of story, if they can’t handle it that’s on them. There’s 365 days in the year. Can they not connect with you on any of the other days",
          "created_utc": 1732848550.0
        },
        {
          "id": "lzi67e9",
          "author": "JelloOfLife",
          "body": "The other days aren’t the point. The point for the overwhelming majority is family dinner on thanksgiving.\n\nSaying “can they not connect with you any other day” is pretty ignorant lol",
          "created_utc": 1732849010.0
        }
      ]
    }
  ]
}