{
  "id": "1h5ix61",
  "subreddit": "ARFID",
  "author": "vEGAN_cHONKER",
  "created_utc": 1733214682.0,
  "title": "oral sex with ARFID",
  "selftext": "This might be a weird question but I'm wondering if other people also dislike oral sex because of their arfid, I feel bad about it to my partner cuz he does not have any issues with it. Arfid is destroying my life man I just want it to magically disappear 🥲\nI just wanna know if I'm the only one here or not",
  "url": "https://www.reddit.com/r/ARFID/comments/1h5ix61/oral_sex_with_arfid/",
  "score": 124,
  "num_comments": 66,
  "comments": [
    {
      "id": "m06v3ug",
      "author": "PearSufficient4554",
      "body": "Just going to throw it out there that you should not feel that you need to do sexual acts that make you feel dread, uncomfortable, or ill. No one is owed oral sex, even if they like it, if it’s something that you do not enjoy giving.",
      "created_utc": 1733228787.0,
      "score": 280,
      "context": []
    },
    {
      "id": "m06j7om",
      "author": "Disastrous_Bus1904",
      "body": "yes! thankfully my partner literally does not give a flying fuck if i do or don’t, very understanding. but it’s not something i do either and you shouldn’t feel so bad about it.",
      "created_utc": 1733221892.0,
      "score": 60,
      "context": []
    },
    {
      "id": "m06x7v7",
      "author": "casris",
      "body": "I struggle with the taste a lot and because of sexual trauma I kinda start to panic and have ptsd episodes when I try so I just don’t anymore. There’s plenty of other ways to make sex fun than oral and anyone who says otherwise can kick rocks",
      "created_utc": 1733229800.0,
      "score": 45,
      "context": []
    },
    {
      "id": "m06a4d6",
      "author": "Final-Ad7247",
      "body": "Yep. Coincidentally my dental hygienist in high school taught me a trick that helps with gag reflex: tuck your left hand thumb inside your left hand fist. I have to take frequent breaks and turn off my taste buds (iykyk) the way I did as a kid when I was forced to eat fear foods, but I can normally make it about 10 minutes. I don't swallow though, did it once and almost puked 🤢",
      "created_utc": 1733215622.0,
      "score": 55,
      "context": []
    },
    {
      "id": "m07gh4k",
      "author": "vEGAN_cHONKER",
      "body": "Just to clarify my partner doesn't force me to, it's mostly myself who feels like I \"should\" because it's \"normal.\" that's one of my main struggles that comes with my autism, I always wanna do everything by the rules, I also struggle with saying no and I want him to feel good because he makes me feel good too. Im really glad to know im not the only one in this, makes me feel a little less alone.",
      "created_utc": 1733237455.0,
      "score": 46,
      "context": []
    },
    {
      "id": "m07b1oc",
      "author": "porgch0ps",
      "body": "No issue with it here beyond my non-food related childhood trauma.  Just want to add that you are not obligated to perform any sex acts you don’t want to.  I understand the conflict between “want to” and “have a fear block to being able to”, but a worthy partner will do their best to support you and will not ever make you feel pressure or obligation.",
      "created_utc": 1733235493.0,
      "score": 21,
      "context": []
    },
    {
      "id": "m069n78",
      "author": "ivysmorgue",
      "body": "i’m a lesbian so my experience with oral sex is different. \n\ntbh, the huge issue with me and oral sex is the taste. i have developed lungs of *gods* so i either have my nose plugged or im holding my breath… and it doesn’t really affect me after that. \n\nhowever tho for a long time before hand, i *hated* it. i didn’t like the taste, i didn’t like the texture, and it was especially worse with men",
      "created_utc": 1733215294.0,
      "score": 17,
      "context": []
    },
    {
      "id": "m07ef6h",
      "author": "None",
      "body": "Yep, I posted about this on this sub about a year ago…it’s unfortunate. What’s more is that I’m bisexual. I am with my fiancé who is a man and because I love him so much I do give him oral. I don’t force myself, and he doesn’t pressure me to at ALL, but I do want him to be satisfied as it makes me happy to know he is.  However, I never had the chance to actually have seggs with a girl and I’m not sure I would’ve been able to (in the way I would want to please them) as an owner of a vagina…I know what goes on in there😅 and i genuinely don’t know if I could do it, I’d be concerned with the taste, the moth feel…al of it. It makes me feel so badddd😩 fortunately I probably won’t ever end up having sex with a girl since I’m pretty sure I’m with my forever person, but it doesn’t make it suck any less. \n\nThe amount of people that commented on my post about this though was SO validating though. I’m not the only one, and neither are you. So many people have issues with oral for alllll kinds of reasons, and like others have said, there are other creative ways to please your partner, don’t ever force yourself to do it. I’m also on the spectrum, and a lot of us have these hold ups as well. It’s wild how literally everything ties into this eating disorder, just know you aren’t alone🫶",
      "created_utc": 1733236727.0,
      "score": 13,
      "context": []
    },
    {
      "id": "m06oytx",
      "author": "GaydrianTheRainbow",
      "body": "I definitely don’t like the flavour or texture. Hadn’t connected it to ARFID but yeah… that tracks 😅",
      "created_utc": 1733225493.0,
      "score": 31,
      "context": []
    },
    {
      "id": "m06zcr4",
      "author": "General_Feeling4589",
      "body": "I’m a pansexual woman with Arfid and I have no issues whatsoever giving oral, I also prefer to give than receive",
      "created_utc": 1733230768.0,
      "score": 12,
      "context": []
    },
    {
      "id": "m08idzn",
      "author": "Dmdel24",
      "body": "The *act* itself? No problem at all. I enjoy it, which is why I continue to do it.\n\nThe.... \"end result\".... so to speak? The texture and taste are revolting to me. But I could never tell my husband that.",
      "created_utc": 1733249556.0,
      "score": 10,
      "context": []
    },
    {
      "id": "m073436",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1733232386.0,
      "score": 7,
      "context": []
    },
    {
      "id": "m08e0zt",
      "author": "g3twr3nch3d",
      "body": "nah because the thought of a dick in my mouth or pussy juice makes me want to vomit…",
      "created_utc": 1733248208.0,
      "score": 5,
      "context": []
    },
    {
      "id": "m06onp4",
      "author": "None",
      "body": "i have ARFID and i dont have this problem",
      "created_utc": 1733225308.0,
      "score": 15,
      "context": []
    },
    {
      "id": "m0730xi",
      "author": "None",
      "body": "I'm married and my husband does everything he can to help with my ARFID. to include removing stress and pressure for me to perform sexual acts that will literally make me sick. In the beginning of our relationship, I didn't have the language or knowledge I do now about my issues and was still just trying to be \"normal\" so there were a few times I'd be the one pushing it and I got sick every time. Nothing sexier than your woman vomiting all over your pantless nether region.... Don't force anything and don't let anyone try to either.",
      "created_utc": 1733232349.0,
      "score": 5,
      "context": []
    },
    {
      "id": "m07mvp5",
      "author": "ibelieveinaliens111",
      "body": "I’m sure your partner would only want you to do it if you’re 100% sure. (People aren’t usually willing to let other people’s teeth close to their privates unless they’re completely sure the person won’t bite them off.) \n\nThere’s plenty of other ways for you two to enjoy yourselves. Sex isn’t a checklist where you have to do absolutely everything. You can find what you like and work with it.\n\nAnd, sadly, Arfid can’t magically disappear (I’m sure you know that already 🫂) but if you know your partner loves and supports you, you should have trust that when they say it’s not a problem, they mean it. \n\nHopefully you’ll get better someday, but until then communication is key. Let your partner know you love them in other ways, and you’ll always have time to figure this out when you can.\n\n(Edit: Broke sentences up for better reading)",
      "created_utc": 1733239630.0,
      "score": 4,
      "context": []
    },
    {
      "id": "m0ao3mq",
      "author": "quetsies",
      "body": "i’ve thought about this so much. haven’t encountered it yet but if my arfid restricts me from eating pussy i’m gonna have to riot",
      "created_utc": 1733274669.0,
      "score": 4,
      "context": []
    },
    {
      "id": "m07t51u",
      "author": "Manospondylus_gigas",
      "body": "I'm the exact same, I can't have it in my mouth because my gag reflex goes off immediately and I feel guilty about it, wish it could be cured",
      "created_utc": 1733241642.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m090253",
      "author": "LunarToast7",
      "body": "So I have a SUPER funny story about it. I was SUPER WORRIED about it, but it ended up being something I was totally fine with. I ended up joking that pussy was one of my safe foods lol. So it might be safe for you who knows! \n\nBut also as what everyone else says, you don’t owe anyone any specific kind of sex and if you try it and hated it, you absolutely don’t need to feel obligated to keep doing it, there are many other options",
      "created_utc": 1733254982.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m0bsc2l",
      "author": "Emmit-Nervend",
      "body": "For some reason it’s easier for me to put lubricated rubber in my mouth than vegetables. 😵‍💫",
      "created_utc": 1733290709.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m07ko32",
      "author": "_weedkiller_",
      "body": "Nope. I dislike doing it to penises and haven’t in years, but with women I love it. I don’t even care if it smells sweaty, I’ve done it when they’ve been on their period.  \nThat’s what happens when you try to suppress your lesbianism for years, once you release it you become ravenous for cunnilingus.",
      "created_utc": 1733238893.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m086azr",
      "author": "Pink_Bread_76",
      "body": "it’s really gross if you think about it. you don’t have to do it",
      "created_utc": 1733245799.0,
      "score": 4,
      "context": []
    },
    {
      "id": "m07g653",
      "author": "Useful-Actuator8549",
      "body": "bisexual woman here, i never ever had any hint of an issue with oral sex on women. i dont have much issue with it with men either, other than im not a swallower. i would gag if i did try to swallow. \nso i just spit it into a nearby hand towel and i wipe my tongue off from anything that could possibly be left behind.",
      "created_utc": 1733237347.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m07yarp",
      "author": "wormcuItist",
      "body": "didn't know that arfid would affect that stuff tbh since you're not like swallowing (i don't have arfid so i just didn't know i am not speaking from experience)",
      "created_utc": 1733243278.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m0834cx",
      "author": "iandmeagree",
      "body": "My partner and I are asexual so maybe that plays a part but we don’t really touch downstairs. Icky",
      "created_utc": 1733244793.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m084451",
      "author": "d20damage",
      "body": "I've had issues with the smell before, if I'm being honest, but usually I'm completely fine and enjoy it",
      "created_utc": 1733245106.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m089cxc",
      "author": "Scary_Ad4850",
      "body": "I enjoy it but I do have struggle on and off with some aspects. I've done it with both sexes and one I strongly prefer for texture reasons. I'd never thought much about it till seeing this lol!",
      "created_utc": 1733246765.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m09ait0",
      "author": "bionicocce",
      "body": "I have ARFID and personally I love giving head LOL but I definitely understand why it's tough for some folks. Like the other comments are saying, you absolutely don't have to do anything in the bedroom that you don't want to. If it doesn't bring you pleasure, don't worry about it. Sex is whatever you want it to be.\n\nIf you still want to give oral without triggering your ARFID, maybe try flavored lube or condoms? If it's more about texture, there are textured condoms (ribbed, studded, etc) that might help. Also, always ask your partner to wash his dick thoroughly beforehand, maybe with a soap you like the smell of. Even if he's generally a clean guy, we all get stinky down there, especially at the end of the day.\n\nThis is a crazy idea, but if you like grapefruit (or a fruit with a similar texture), the \"grapefruit trick\" might help you kinda ease into it maybe?",
      "created_utc": 1733258220.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m09xtx8",
      "author": "jemappelletired",
      "body": "Yes but things that help… \n-only in the shower post washing or right after shower is over \n-rarely to completion and if it is, not in my mouth \n-tucking your thumb helps with gag reflex! \n-if you use your hands at the same time, you don’t have to take in as much in your mouth\n-I focus on other things besides what is going on in my face, if I start to focus on the fact that there is a 🍆 in my face, I’ll start gagging. So focusing on other stimuli helps",
      "created_utc": 1733265489.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m0ad55e",
      "author": "not-a-popup-ad",
      "body": "Yes omg I just experienced this last night. I like it a lot, however I can't stand the taste when he finishes. It made me gag so bad I thought I was going to throw up. I also have a bad gag reflex, so that made it even worse 😭",
      "created_utc": 1733270808.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m0b0npo",
      "author": "random_guy_8375",
      "body": "On the one hand yum yum pussy, on the other hand I cant breathe and its uncomfortable and not good.",
      "created_utc": 1733279210.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m0bhgbo",
      "author": "39dayou",
      "body": "when i had a bf i would always refuse whenever it was brought up , everything abt it terrified meee and i still can’t think abt it without getting nauseous it’s awful . ur not alone",
      "created_utc": 1733285701.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m08ni11",
      "author": "bruhkms18",
      "body": "i just have a very easily triggered gag reflex so i don’t do it often. my bf doesnt care",
      "created_utc": 1733251129.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m08qa5q",
      "author": "stebbi01",
      "body": "Personally I’ve never had an issue giving oral sex to a partner while also having ARFID",
      "created_utc": 1733251974.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m08wpeq",
      "author": "Gaymer7437",
      "body": "I haven't given cunnilingus many times but I haven't had an aversion to it yet.\n\n\nsometimes my partner (penis haver) and I will plan on doing oral to each other but my mouth feel will disagree with it in the moment and we roll with it. oftentimes it doesn't bother me but sometimes it does.",
      "created_utc": 1733253947.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m09eyk2",
      "author": "Prometheus-is-vulcan",
      "body": "I (m) have never been intimate, but dont think that it triggers me. \n\nPerfect hygiene is a must oc.\n\n\nWhat triggers me, is the thought of kissing her, after she performed it on me. To the point, that I would prefer to never receive it, at all.",
      "created_utc": 1733259583.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m0a98k9",
      "author": "robertstobe",
      "body": "I’m a woman married to a man for context.\n\nI’ve tried on a few occasions to give oral, but I just can’t. Even if I could get past the idea of what’s in my mouth, the taste of even pre-cum is just too gross for me. I feel a little bad that I’ll never give it, especially because my husband loves giving, but he doesn’t mind. As long as you communicate and you work together to figure out what DOES work, it doesn’t have to ruin anything.",
      "created_utc": 1733269422.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m0agnfk",
      "author": "milkforbrains_",
      "body": "Flavoured lube helps me lmao",
      "created_utc": 1733272041.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m0aifkp",
      "author": "HotBackgroundGirl",
      "body": "I freaking hate oral sex, last guy I was with wanted in multiple times a day. Not only did he taste like spoiled cheese, but ugh never again. This was also before I realized I was Ace and Repulse, so I may represent a  minority here.",
      "created_utc": 1733272659.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m0anckq",
      "author": "blaiiiiir",
      "body": "yes🥲 one time he “finished” while I was doing it and I threw up and felt so bad",
      "created_utc": 1733274402.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m0bbic3",
      "author": "MissLuna93",
      "body": "Bisexual here\n\nI cannot handle a guy finishing in my mouth at all similar reaction to eating an unsafe food\n\nI cannot go down on a girl - idk why just never been able to even if I want ton but get the same voice saying the type of 'no' I get when I try to have a new food :/",
      "created_utc": 1733283289.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m0bjeal",
      "author": "randompersonignoreme",
      "body": "I've never done it myself IRL but the concept IRL seems really revolting. Just the idea of mouth = genital part that is lumpy (even if there's a condom). Don't know if it's due to ARFID though.",
      "created_utc": 1733286536.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m0ceevz",
      "author": "piefanart",
      "body": "Yes, it makes it difficult. I cant handle a lot of the... textures, especially the more liquid ones. Additionally my contamination ocd causes issues.\n\nUsing a condom and washing the area first makes things a lot easier, but it still requires a lot of mental effort on my part to even consider doing it.",
      "created_utc": 1733304232.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m0fopxo",
      "author": "Kida-Lunara154",
      "body": "TMI but I've literally thrown up while doing .... That... So yeah hate it, but you do what you must",
      "created_utc": 1733347689.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m11ulrf",
      "author": "Stronghold257",
      "body": "One thing that has helped me before is brushing my teeth before doing it, that way you’re mostly tasting your clean mouth. And personally I really like the taste of my toothpaste lol",
      "created_utc": 1733675945.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m0cz8z0",
      "author": "sarcastabtch",
      "body": "Same",
      "created_utc": 1733316423.0,
      "score": 1,
      "context": [
        {
          "id": "m06j7om",
          "author": "Disastrous_Bus1904",
          "body": "yes! thankfully my partner literally does not give a flying fuck if i do or don’t, very understanding. but it’s not something i do either and you shouldn’t feel so bad about it.",
          "created_utc": 1733221892.0
        }
      ]
    },
    {
      "id": "m07pu73",
      "author": "jizzyjazz2",
      "body": "how does the gag reflex trick work? i dont get it",
      "created_utc": 1733240593.0,
      "score": 11,
      "context": [
        {
          "id": "m06a4d6",
          "author": "Final-Ad7247",
          "body": "Yep. Coincidentally my dental hygienist in high school taught me a trick that helps with gag reflex: tuck your left hand thumb inside your left hand fist. I have to take frequent breaks and turn off my taste buds (iykyk) the way I did as a kid when I was forced to eat fear foods, but I can normally make it about 10 minutes. I don't swallow though, did it once and almost puked 🤢",
          "created_utc": 1733215622.0
        }
      ]
    },
    {
      "id": "m08camm",
      "author": "beanburritoperson",
      "body": "This never works for me but wiggling my toes does!\n\n\nThis is easier in a hygienist chair than during head tho 😭 ",
      "created_utc": 1733247673.0,
      "score": 16,
      "context": [
        {
          "id": "m06a4d6",
          "author": "Final-Ad7247",
          "body": "Yep. Coincidentally my dental hygienist in high school taught me a trick that helps with gag reflex: tuck your left hand thumb inside your left hand fist. I have to take frequent breaks and turn off my taste buds (iykyk) the way I did as a kid when I was forced to eat fear foods, but I can normally make it about 10 minutes. I don't swallow though, did it once and almost puked 🤢",
          "created_utc": 1733215622.0
        }
      ]
    },
    {
      "id": "m0aeidb",
      "author": "SqueeTheMancake",
      "body": "I don’t have ARFID personally but my wife does! I joined this Reddit to understand better what she is going through. \nShe absolutely hates oral sex. I have no issue with it and my pleasure comes more from giving her pleasure anyways. She always asks me “are you sure you’re okay with it?” and I confirm with her that it is okay, no bother! I know each case is different but that’s just from my perspective. I hope it helps!",
      "created_utc": 1733271291.0,
      "score": 15,
      "context": [
        {
          "id": "m07gh4k",
          "author": "vEGAN_cHONKER",
          "body": "Just to clarify my partner doesn't force me to, it's mostly myself who feels like I \"should\" because it's \"normal.\" that's one of my main struggles that comes with my autism, I always wanna do everything by the rules, I also struggle with saying no and I want him to feel good because he makes me feel good too. Im really glad to know im not the only one in this, makes me feel a little less alone.",
          "created_utc": 1733237455.0
        }
      ]
    },
    {
      "id": "m07fndv",
      "author": "vEGAN_cHONKER",
      "body": "Thank you and yes he doesn't force me to I just kind of feel like I need to idk because I want him to feel good cuz he makes me feel good too, I know it's not necessary but I've kinda told myself its all just in my head and if I don't get too much in my head about it it can be okay for me. (Gaslighting myself much?)",
      "created_utc": 1733237162.0,
      "score": 6,
      "context": [
        {
          "id": "m07ef6h",
          "author": "None",
          "body": "Yep, I posted about this on this sub about a year ago…it’s unfortunate. What’s more is that I’m bisexual. I am with my fiancé who is a man and because I love him so much I do give him oral. I don’t force myself, and he doesn’t pressure me to at ALL, but I do want him to be satisfied as it makes me happy to know he is.  However, I never had the chance to actually have seggs with a girl and I’m not sure I would’ve been able to (in the way I would want to please them) as an owner of a vagina…I know what goes on in there😅 and i genuinely don’t know if I could do it, I’d be concerned with the taste, the moth feel…al of it. It makes me feel so badddd😩 fortunately I probably won’t ever end up having sex with a girl since I’m pretty sure I’m with my forever person, but it doesn’t make it suck any less. \n\nThe amount of people that commented on my post about this though was SO validating though. I’m not the only one, and neither are you. So many people have issues with oral for alllll kinds of reasons, and like others have said, there are other creative ways to please your partner, don’t ever force yourself to do it. I’m also on the spectrum, and a lot of us have these hold ups as well. It’s wild how literally everything ties into this eating disorder, just know you aren’t alone🫶",
          "created_utc": 1733236727.0
        }
      ]
    },
    {
      "id": "m08i0s5",
      "author": "Dmdel24",
      "body": "Same omg I never made the connection 😂",
      "created_utc": 1733249441.0,
      "score": 5,
      "context": [
        {
          "id": "m06oytx",
          "author": "GaydrianTheRainbow",
          "body": "I definitely don’t like the flavour or texture. Hadn’t connected it to ARFID but yeah… that tracks 😅",
          "created_utc": 1733225493.0
        }
      ]
    },
    {
      "id": "m09byv7",
      "author": "vEGAN_cHONKER",
      "body": "The end result XD that made me chuckle",
      "created_utc": 1733258663.0,
      "score": 3,
      "context": [
        {
          "id": "m08idzn",
          "author": "Dmdel24",
          "body": "The *act* itself? No problem at all. I enjoy it, which is why I continue to do it.\n\nThe.... \"end result\".... so to speak? The texture and taste are revolting to me. But I could never tell my husband that.",
          "created_utc": 1733249556.0
        }
      ]
    },
    {
      "id": "m07fzmt",
      "author": "vEGAN_cHONKER",
      "body": "Interesting I'll look into it, I do know that condoms are even worse for me cuz of the lube that's usually on them and honestly I still prefer without cuz there's a less likely chance I'll throw up 😭 but thank you!",
      "created_utc": 1733237283.0,
      "score": 2,
      "context": [
        {
          "id": "m073436",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1733232386.0
        }
      ]
    },
    {
      "id": "m076i4y",
      "author": "boytoy421",
      "body": "...a simple \"i have ARFID but don't have this problem\" would have sufficed dude",
      "created_utc": 1733233745.0,
      "score": 22,
      "context": [
        {
          "id": "m06onp4",
          "author": "None",
          "body": "i have ARFID and i dont have this problem",
          "created_utc": 1733225308.0
        }
      ]
    },
    {
      "id": "mk6okqz",
      "author": "Araumand",
      "body": "Having to trust the woman with all her sharp teeth down there is actually the thrilling reason why Bj turns me on.",
      "created_utc": 1743170377.0,
      "score": 1,
      "context": [
        {
          "id": "m07mvp5",
          "author": "ibelieveinaliens111",
          "body": "I’m sure your partner would only want you to do it if you’re 100% sure. (People aren’t usually willing to let other people’s teeth close to their privates unless they’re completely sure the person won’t bite them off.) \n\nThere’s plenty of other ways for you two to enjoy yourselves. Sex isn’t a checklist where you have to do absolutely everything. You can find what you like and work with it.\n\nAnd, sadly, Arfid can’t magically disappear (I’m sure you know that already 🫂) but if you know your partner loves and supports you, you should have trust that when they say it’s not a problem, they mean it. \n\nHopefully you’ll get better someday, but until then communication is key. Let your partner know you love them in other ways, and you’ll always have time to figure this out when you can.\n\n(Edit: Broke sentences up for better reading)",
          "created_utc": 1733239630.0
        }
      ]
    },
    {
      "id": "m08acq2",
      "author": "Scary_Ad4850",
      "body": "It's not all about swallowing, or can have to do with just what you have in your mouth or even feeling strongly that you just can't put it in your mouth/feeling like it's not food or unsafe. \nIt's also, for me, not just something where I stop and think \"what if I choke on this?\". It's just my body subconsciously protecting me from it and I just know I can't eat that/my mouth is too full/this texture is gonna make me gag/this taste means something is wrong. It's largely a physical feeling if that makes sense.",
      "created_utc": 1733247073.0,
      "score": 8,
      "context": [
        {
          "id": "m07yarp",
          "author": "wormcuItist",
          "body": "didn't know that arfid would affect that stuff tbh since you're not like swallowing (i don't have arfid so i just didn't know i am not speaking from experience)",
          "created_utc": 1733243278.0
        }
      ]
    },
    {
      "id": "m08w8iz",
      "author": "Gaymer7437",
      "body": "My issues with ARFID are around mouth feel and how textures interact with my mouth, sometimes it can make me averse to oral and other times it doesn't",
      "created_utc": 1733253802.0,
      "score": 2,
      "context": [
        {
          "id": "m07yarp",
          "author": "wormcuItist",
          "body": "didn't know that arfid would affect that stuff tbh since you're not like swallowing (i don't have arfid so i just didn't know i am not speaking from experience)",
          "created_utc": 1733243278.0
        }
      ]
    },
    {
      "id": "m0cflmh",
      "author": "vEGAN_cHONKER",
      "body": "Those are good tips thanks!",
      "created_utc": 1733305056.0,
      "score": 1,
      "context": [
        {
          "id": "m09xtx8",
          "author": "jemappelletired",
          "body": "Yes but things that help… \n-only in the shower post washing or right after shower is over \n-rarely to completion and if it is, not in my mouth \n-tucking your thumb helps with gag reflex! \n-if you use your hands at the same time, you don’t have to take in as much in your mouth\n-I focus on other things besides what is going on in my face, if I start to focus on the fact that there is a 🍆 in my face, I’ll start gagging. So focusing on other stimuli helps",
          "created_utc": 1733265489.0
        }
      ]
    },
    {
      "id": "m0cfq7m",
      "author": "vEGAN_cHONKER",
      "body": "Not spoiled cheese 😭😭😭 yucky",
      "created_utc": 1733305145.0,
      "score": 1,
      "context": [
        {
          "id": "m0aifkp",
          "author": "HotBackgroundGirl",
          "body": "I freaking hate oral sex, last guy I was with wanted in multiple times a day. Not only did he taste like spoiled cheese, but ugh never again. This was also before I realized I was Ace and Repulse, so I may represent a  minority here.",
          "created_utc": 1733272659.0
        }
      ]
    },
    {
      "id": "m1rv5ku",
      "author": "vEGAN_cHONKER",
      "body": "Thats a great idea omg Ive never thought about that",
      "created_utc": 1734045934.0,
      "score": 1,
      "context": [
        {
          "id": "m11ulrf",
          "author": "Stronghold257",
          "body": "One thing that has helped me before is brushing my teeth before doing it, that way you’re mostly tasting your clean mouth. And personally I really like the taste of my toothpaste lol",
          "created_utc": 1733675945.0
        }
      ]
    },
    {
      "id": "m089jd1",
      "author": "Scary_Ad4850",
      "body": "It kinda tricks your brain if you really trust it. I do it and it works for me.",
      "created_utc": 1733246821.0,
      "score": 7,
      "context": [
        {
          "id": "m06a4d6",
          "author": "Final-Ad7247",
          "body": "Yep. Coincidentally my dental hygienist in high school taught me a trick that helps with gag reflex: tuck your left hand thumb inside your left hand fist. I have to take frequent breaks and turn off my taste buds (iykyk) the way I did as a kid when I was forced to eat fear foods, but I can normally make it about 10 minutes. I don't swallow though, did it once and almost puked 🤢",
          "created_utc": 1733215622.0
        },
        {
          "id": "m07pu73",
          "author": "jizzyjazz2",
          "body": "how does the gag reflex trick work? i dont get it",
          "created_utc": 1733240593.0
        }
      ]
    },
    {
      "id": "m0cf4sb",
      "author": "vEGAN_cHONKER",
      "body": "You sound like a great husband, your wife is lucky to have you!",
      "created_utc": 1733304731.0,
      "score": 3,
      "context": [
        {
          "id": "m07gh4k",
          "author": "vEGAN_cHONKER",
          "body": "Just to clarify my partner doesn't force me to, it's mostly myself who feels like I \"should\" because it's \"normal.\" that's one of my main struggles that comes with my autism, I always wanna do everything by the rules, I also struggle with saying no and I want him to feel good because he makes me feel good too. Im really glad to know im not the only one in this, makes me feel a little less alone.",
          "created_utc": 1733237455.0
        },
        {
          "id": "m0aeidb",
          "author": "SqueeTheMancake",
          "body": "I don’t have ARFID personally but my wife does! I joined this Reddit to understand better what she is going through. \nShe absolutely hates oral sex. I have no issue with it and my pleasure comes more from giving her pleasure anyways. She always asks me “are you sure you’re okay with it?” and I confirm with her that it is okay, no bother! I know each case is different but that’s just from my perspective. I hope it helps!",
          "created_utc": 1733271291.0
        }
      ]
    },
    {
      "id": "m07kl96",
      "author": "None",
      "body": "Yea same, I can’t do it for long, no more than 2 or 3 minutes tops, and I can’t think too hard about it. I also have emetephobia so the fear of gagging is constant lol. I also need him to clean it first🙈 which I always feel bad about lol, he’s not unhygienic by any means it just freaks me out if it’s been in undies all day and isn’t cleaned first. I’m the same way though, I don’t won’t go to funky town if I haven’t showered in the last hour or so. It sucks have so many “rules” and boundaries around it but what can ya do🤷🏻‍♀️ being a person is hard and we’re all doing our best. \n\nAlso, consider doing oral in the shower! That’s my favorite place to do it, the water and stuff really helps ;)",
      "created_utc": 1733238867.0,
      "score": 5,
      "context": [
        {
          "id": "m07ef6h",
          "author": "None",
          "body": "Yep, I posted about this on this sub about a year ago…it’s unfortunate. What’s more is that I’m bisexual. I am with my fiancé who is a man and because I love him so much I do give him oral. I don’t force myself, and he doesn’t pressure me to at ALL, but I do want him to be satisfied as it makes me happy to know he is.  However, I never had the chance to actually have seggs with a girl and I’m not sure I would’ve been able to (in the way I would want to please them) as an owner of a vagina…I know what goes on in there😅 and i genuinely don’t know if I could do it, I’d be concerned with the taste, the moth feel…al of it. It makes me feel so badddd😩 fortunately I probably won’t ever end up having sex with a girl since I’m pretty sure I’m with my forever person, but it doesn’t make it suck any less. \n\nThe amount of people that commented on my post about this though was SO validating though. I’m not the only one, and neither are you. So many people have issues with oral for alllll kinds of reasons, and like others have said, there are other creative ways to please your partner, don’t ever force yourself to do it. I’m also on the spectrum, and a lot of us have these hold ups as well. It’s wild how literally everything ties into this eating disorder, just know you aren’t alone🫶",
          "created_utc": 1733236727.0
        },
        {
          "id": "m07fndv",
          "author": "vEGAN_cHONKER",
          "body": "Thank you and yes he doesn't force me to I just kind of feel like I need to idk because I want him to feel good cuz he makes me feel good too, I know it's not necessary but I've kinda told myself its all just in my head and if I don't get too much in my head about it it can be okay for me. (Gaslighting myself much?)",
          "created_utc": 1733237162.0
        }
      ]
    },
    {
      "id": "m07vjxa",
      "author": "nonbinary_parent",
      "body": "This exchange is hilarious post-edit",
      "created_utc": 1733242415.0,
      "score": 27,
      "context": [
        {
          "id": "m06onp4",
          "author": "None",
          "body": "i have ARFID and i dont have this problem",
          "created_utc": 1733225308.0
        },
        {
          "id": "m076i4y",
          "author": "boytoy421",
          "body": "...a simple \"i have ARFID but don't have this problem\" would have sufficed dude",
          "created_utc": 1733233745.0
        }
      ]
    },
    {
      "id": "m08fz1b",
      "author": "wormcuItist",
      "body": "ty for informing me",
      "created_utc": 1733248800.0,
      "score": 1,
      "context": [
        {
          "id": "m07yarp",
          "author": "wormcuItist",
          "body": "didn't know that arfid would affect that stuff tbh since you're not like swallowing (i don't have arfid so i just didn't know i am not speaking from experience)",
          "created_utc": 1733243278.0
        },
        {
          "id": "m08acq2",
          "author": "Scary_Ad4850",
          "body": "It's not all about swallowing, or can have to do with just what you have in your mouth or even feeling strongly that you just can't put it in your mouth/feeling like it's not food or unsafe. \nIt's also, for me, not just something where I stop and think \"what if I choke on this?\". It's just my body subconsciously protecting me from it and I just know I can't eat that/my mouth is too full/this texture is gonna make me gag/this taste means something is wrong. It's largely a physical feeling if that makes sense.",
          "created_utc": 1733247073.0
        }
      ]
    },
    {
      "id": "m07rme1",
      "author": "vEGAN_cHONKER",
      "body": "Haha yess same i want it to be clean and in the shower is wayy better indeed I also prefer that. Being a person is so hard fr!! 😭",
      "created_utc": 1733241164.0,
      "score": 3,
      "context": [
        {
          "id": "m07ef6h",
          "author": "None",
          "body": "Yep, I posted about this on this sub about a year ago…it’s unfortunate. What’s more is that I’m bisexual. I am with my fiancé who is a man and because I love him so much I do give him oral. I don’t force myself, and he doesn’t pressure me to at ALL, but I do want him to be satisfied as it makes me happy to know he is.  However, I never had the chance to actually have seggs with a girl and I’m not sure I would’ve been able to (in the way I would want to please them) as an owner of a vagina…I know what goes on in there😅 and i genuinely don’t know if I could do it, I’d be concerned with the taste, the moth feel…al of it. It makes me feel so badddd😩 fortunately I probably won’t ever end up having sex with a girl since I’m pretty sure I’m with my forever person, but it doesn’t make it suck any less. \n\nThe amount of people that commented on my post about this though was SO validating though. I’m not the only one, and neither are you. So many people have issues with oral for alllll kinds of reasons, and like others have said, there are other creative ways to please your partner, don’t ever force yourself to do it. I’m also on the spectrum, and a lot of us have these hold ups as well. It’s wild how literally everything ties into this eating disorder, just know you aren’t alone🫶",
          "created_utc": 1733236727.0
        },
        {
          "id": "m07fndv",
          "author": "vEGAN_cHONKER",
          "body": "Thank you and yes he doesn't force me to I just kind of feel like I need to idk because I want him to feel good cuz he makes me feel good too, I know it's not necessary but I've kinda told myself its all just in my head and if I don't get too much in my head about it it can be okay for me. (Gaslighting myself much?)",
          "created_utc": 1733237162.0
        },
        {
          "id": "m07kl96",
          "author": "None",
          "body": "Yea same, I can’t do it for long, no more than 2 or 3 minutes tops, and I can’t think too hard about it. I also have emetephobia so the fear of gagging is constant lol. I also need him to clean it first🙈 which I always feel bad about lol, he’s not unhygienic by any means it just freaks me out if it’s been in undies all day and isn’t cleaned first. I’m the same way though, I don’t won’t go to funky town if I haven’t showered in the last hour or so. It sucks have so many “rules” and boundaries around it but what can ya do🤷🏻‍♀️ being a person is hard and we’re all doing our best. \n\nAlso, consider doing oral in the shower! That’s my favorite place to do it, the water and stuff really helps ;)",
          "created_utc": 1733238867.0
        }
      ]
    }
  ]
}