{
  "id": "1h8ctkt",
  "subreddit": "ARFID",
  "author": "keycharm_",
  "created_utc": 1733522024.0,
  "title": "I burst into tears and it was a power move",
  "selftext": "I’ve had ARFID my entire life, and over the past few years, I’ve become a lot more comfortable with it, and with telling other people what I have. I’ve been working on trying new foods lately, but I definitely know my own limitations, and what foods are WAY too scary for now.\n\nA bit ago, one of my friends was trying to be helpful in a misguided way. I usually explain ARFID to people as a “food phobia” to begin with, and I think he was struggling to see it as anything more than picky eating (since he’s a picky eater). We were on the beach and he was eating chips with salsa, and I was eating plain chips. So he started encouraging me to try the salsa, and he put a very small amount of salsa on a chip and started trying to convince me that I wouldn’t even taste it. (i think this is a classic ARFID experience lol)\n\nI think I looked stressed, because one of my other friends came over and told him off a little. She was like “hey, you don’t have to try anything if you don’t want to,” and I was like “well I know this is gonna be WAY too hard for me, but how about I do it anyways?”\n\nSo I spent a little bit working up the nerve while my friend was holding the salsa chip in my face (he was still trying to convince me it would be fine) and I did manage to eat it after several attempts. By the time I managed it though, I had FULLY burst into tears and was sobbing, and he clearly was uncomfortable and wasn’t trying to make me eat it anymore. But I still ate the chip, through the tears. Lately my mindset has been like “I can’t let (x tiny piece of food) defeat me” and it adds a lot more humour to the fear.\n\nI don’t think eating the salsa chip helped me to feel any more comfortable with salsa, and I don’t think bursting into tears is a recommended therapeutic method. I’ve actually never burst into tears like that over eating, at least not as an adult. But it was also SO funny to see the dawning realization of “oh shit, this isn’t just picky eating” and I still view it as a victory because I did something I was so scared of. Overall, a power move.\n\nSo anyways, I would encourage anyone who’s feeling capable to show the big reactions in front of people who will support you. A lot of ARFID symptoms are internal, and by externalizing it a little bit, I think it definitely helped to make others understand. Also, I think it was funny.",
  "url": "https://www.reddit.com/r/ARFID/comments/1h8ctkt/i_burst_into_tears_and_it_was_a_power_move/",
  "score": 86,
  "num_comments": 8,
  "comments": [
    {
      "id": "m0s9ki6",
      "author": "beaumega1",
      "body": "Awesome job being vulnerable and trying something new. Proud of you!",
      "created_utc": 1733526432.0,
      "score": 27,
      "context": []
    },
    {
      "id": "m0slr40",
      "author": "cheese_and_toasty",
      "body": "Omg love this",
      "created_utc": 1733530991.0,
      "score": 11,
      "context": []
    },
    {
      "id": "m0uyjkp",
      "author": "Meallaire",
      "body": "I think a lot of us have had similar moments. My \"power move\" was the time I ended up projectile vomiting after my grandma finally succeeded in sneaking a much hated food of mine into tomato sauce.\n\n\nShe seemed to understand after that and never tried again!",
      "created_utc": 1733574625.0,
      "score": 7,
      "context": []
    },
    {
      "id": "m0uc6nl",
      "author": "SomeTraits",
      "body": "I hope you're feeling better now! Last time I was so stressed from trying something new I felt anxious and overwhelmed for a week...",
      "created_utc": 1733560947.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m0y759l",
      "author": "Otherwise_Click_8694",
      "body": "Boss shit... proud, took a similiar approach. \n\nWas just honest bout the condition, to friends, strangers, coworkers, girls, etc.\n\nAlso started trying new things, also know my limitations and things I would not even touch. \n\nNow I have expanded to a lot of veggies and fruits, as well as condiments.",
      "created_utc": 1733614648.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m14s9hz",
      "author": "idk_honestly24",
      "body": "Real, my friends found out about my arfid after i started crying in my school’s dining hall because there was nothing I could eat 😅",
      "created_utc": 1733711162.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m0u2cbw",
      "author": "sh--",
      "body": "I hope your friend posts this experience on AITA and is educated by the internet that it was an arsehole move. \n\nHow did he react when you started crying? \n\nGood for you, on both the being vulnerable and eating a little salsa 🤗 I also don’t eat salsa and would probably have a similar reaction.",
      "created_utc": 1733554583.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m1s05cm",
      "author": "keycharm_",
      "body": "Lol I think he understood pretty well when I started crying! In my experience, people are harder on me when they think it’s regular picky eating, and back way off when they realize it’s a real problem. Sometimes they just need a bit of ‘proof’ to realize it.",
      "created_utc": 1734047741.0,
      "score": 1,
      "context": [
        {
          "id": "m0u2cbw",
          "author": "sh--",
          "body": "I hope your friend posts this experience on AITA and is educated by the internet that it was an arsehole move. \n\nHow did he react when you started crying? \n\nGood for you, on both the being vulnerable and eating a little salsa 🤗 I also don’t eat salsa and would probably have a similar reaction.",
          "created_utc": 1733554583.0
        }
      ]
    }
  ]
}