{
  "id": "1hal5gf",
  "subreddit": "ARFID",
  "author": "MundaneVillian",
  "created_utc": 1733780245.0,
  "title": "Family laughed about lying to me about meals they’ve served",
  "selftext": "Had a dinner out with some immediate family members recently and they got on the topic of my eating habits. They laughed about how they could give me anything and say it was something that I’m fine to eat, even if it was actually something I would never touch. \n\nI’m so mad and have been having low grade constant anxiety since, because how am I supposed to eat anything they buy or make again, ever?\n\nHonestly, it is really a shitty thing to do regardless of why someone doesn’t want to eat a particular thing, because some people have allergies to certain foods which can cause bad reactions or death. Even if it’s not as immediately serious as an allergic reaction it’s still a super shitty thing to do.",
  "url": "https://www.reddit.com/r/ARFID/comments/1hal5gf/family_laughed_about_lying_to_me_about_meals/",
  "score": 156,
  "num_comments": 15,
  "comments": [
    {
      "id": "m19dzq2",
      "author": "velociraptor56",
      "body": "ARFID parent here - I hear parents use that tactic a lot and it upsets me. Because it’s mean and insulting. And it is just a fundamental misunderstanding of what ARFID is. You’re likely to make the situation worse doing something like that. \nYou’re totally justified in your feelings. I’d ask them how they’d feel if the situation were reversed, but I do not think this person understands your situation so that may just be a futile exercise.",
      "created_utc": 1733780562.0,
      "score": 129,
      "context": []
    },
    {
      "id": "m19jmrw",
      "author": "kuroicoeur",
      "body": "This is not a victimless crime. My arfid is  bad enough that I tend to taste most times when people try to slip something in, but I don’t think people realize just how much of it is psychological damage too.  some things I straight up do not want in my body whether I have a rational reason for that or not . I do not want them in my body at all whatsoever. This isn’t any better than slipping, a vegetarian some meat or labeling something organic that was made with pesticides. I have a right to know what goes into my body and they had no right to take that choice away from you.",
      "created_utc": 1733782369.0,
      "score": 90,
      "context": []
    },
    {
      "id": "m1a5syw",
      "author": "TraditionalClerk9017",
      "body": "Another ARFID parent here. Not doing this is ARFID 101. All it does is destroy trust and amplify fear and anxiety. I know some parents get desperate about their child's diet not having enough nutrition, but it just shows them they can't depend on you. I'm so sorry about this!",
      "created_utc": 1733790087.0,
      "score": 24,
      "context": []
    },
    {
      "id": "m19ib6x",
      "author": "linx14",
      "body": "They literally are telling you that they’d be okay poisoning you if it fit their narrative. It’s disgusting.\n\nTampering with people’s food is psychotic behavior. It takes away your ability to make an informed decision and express your bodily autonomy. I would never accept food from them again. And that’s the consequences of their actions.\n\nThey told you they couldn’t be trusted. Believe them and choose healthier people to surround yourself with.",
      "created_utc": 1733781938.0,
      "score": 47,
      "context": []
    },
    {
      "id": "m1a4zj5",
      "author": "chunkeymunkeyandrunt",
      "body": "Unless I’ve given someone permission to do this to me, I’d never trust them ever again. \n\nMaybe it sounds weird to say that I’d give someone permission, but I’ve had it work out before so I’m willing to give a few trusted people that privilege. I don’t know exactly what my husband does to our spaghetti sauce, for example, but it’s delicious so I don’t ask. Psychologically though if I knew what was in it that would make me not want to eat it which is dumb so I choose to remain ignorant. But this is a choice that I made _for myself_ and my husband knows he can’t just do it to whatever whenever. \n\nThe only time my parents ever did this to me was after a 20+ hour journey to New Zealand, where the friends we were visiting provided lamb as dinner. I was 4. Apparently I was so hungry and exhausted I absolutely snarfed it down and asked for seconds. Mom was just excited that I liked it but apparently on my second serving I said ‘why does this chicken taste different’ so there went her hopes of me liking a new food 😂",
      "created_utc": 1733789796.0,
      "score": 21,
      "context": []
    },
    {
      "id": "m19px6d",
      "author": "packurdollsinasweatr",
      "body": "this is so so harmful, there have been times when i was younger where my family would make a safe food, alter it and add a fear food (like adding beans to plain ground beef tacos) and i was instantly able to tell and was never able to eat that safe food again",
      "created_utc": 1733784466.0,
      "score": 17,
      "context": []
    },
    {
      "id": "m1c6snn",
      "author": "3cubedisnot27",
      "body": "i was in hospital once because my arfid got so severe and my doctor (psychiatrist) literally asked what would happen if he put something in the *one* thing i could still consume orally (a specific type of bottled water). they have no clue. or at least i hope they have no clue, cos otherwise its malicious, which is even worse.",
      "created_utc": 1733825187.0,
      "score": 7,
      "context": []
    },
    {
      "id": "m1bqoa0",
      "author": "soft_seraphim",
      "body": "If someone would lie about my food like that I would not eat it again/have anxiety when trying to eat it again/won't trust the person that did this to me",
      "created_utc": 1733814181.0,
      "score": 5,
      "context": []
    },
    {
      "id": "m1d8i6v",
      "author": "CeleryPractical5698",
      "body": "This is my worst nightmare! What a terribly cruel and thoughtless act. I’m so sorry. I have such a hard time eating food that other people have cooked that this sort of behavior would amplify that to no return. I know my mom snuck things in without me knowing when I was young, but she thought I was just annoyingly picky. ARFID wasn’t a diagnosis back then. Even still, why do people think it’s ok to force foods into your body without your consent. The entitlement and thoughtlessness is off the charts.",
      "created_utc": 1733843202.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m1b3a6q",
      "author": "greycloud-desertsky",
      "body": "I’m sorry! This is mean.",
      "created_utc": 1733802601.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m1exdv2",
      "author": "jeannesloaf",
      "body": "My cousins used to help me pick out the marshmallows from Lucky Charms so I could eat those cause I didn’t like the cereal part, they used to hide pieces of cereal in the handfuls of marshmallows they would pull out & feed it to me and laugh. \n\nThat’s a silly example cause I like cereal nowadays, but it’s literally traumatizing to have someone trick you into eating an unsafe food. You can never trust eating around others again.",
      "created_utc": 1733862433.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m1i38sy",
      "author": "SprintsAC",
      "body": "What they've done is disgusting. I'm so sorry.",
      "created_utc": 1733910529.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m1d0zaq",
      "author": "TheMelonSystem",
      "body": "Excellently put. Everyone has the right to decide what goes in their body, and tricking someone into eating something they normally wouldn’t is appalling.",
      "created_utc": 1733840485.0,
      "score": 7,
      "context": [
        {
          "id": "m19jmrw",
          "author": "kuroicoeur",
          "body": "This is not a victimless crime. My arfid is  bad enough that I tend to taste most times when people try to slip something in, but I don’t think people realize just how much of it is psychological damage too.  some things I straight up do not want in my body whether I have a rational reason for that or not . I do not want them in my body at all whatsoever. This isn’t any better than slipping, a vegetarian some meat or labeling something organic that was made with pesticides. I have a right to know what goes into my body and they had no right to take that choice away from you.",
          "created_utc": 1733782369.0
        }
      ]
    },
    {
      "id": "m1d1742",
      "author": "TheMelonSystem",
      "body": "Same thing happened to me. It only makes things worse 😭",
      "created_utc": 1733840567.0,
      "score": 5,
      "context": [
        {
          "id": "m19px6d",
          "author": "packurdollsinasweatr",
          "body": "this is so so harmful, there have been times when i was younger where my family would make a safe food, alter it and add a fear food (like adding beans to plain ground beef tacos) and i was instantly able to tell and was never able to eat that safe food again",
          "created_utc": 1733784466.0
        }
      ]
    },
    {
      "id": "m1gsf76",
      "author": "SpOoKy_sKeLeToN_1998",
      "body": "I think they make an all marshmallow version now",
      "created_utc": 1733885485.0,
      "score": 1,
      "context": [
        {
          "id": "m1exdv2",
          "author": "jeannesloaf",
          "body": "My cousins used to help me pick out the marshmallows from Lucky Charms so I could eat those cause I didn’t like the cereal part, they used to hide pieces of cereal in the handfuls of marshmallows they would pull out & feed it to me and laugh. \n\nThat’s a silly example cause I like cereal nowadays, but it’s literally traumatizing to have someone trick you into eating an unsafe food. You can never trust eating around others again.",
          "created_utc": 1733862433.0
        }
      ]
    }
  ]
}