{
  "id": "1hd9n9g",
  "subreddit": "ARFID",
  "author": "amorphousflesh",
  "created_utc": 1734086855.0,
  "title": "Adults with ARFID",
  "selftext": "Just venting because I'm turning 38 and have a \"children's illness\" according to the Internet.  Does it bother anyone else that so much of the information about our condition online treats it like something we really shouldn't have as adults?",
  "url": "https://www.reddit.com/r/ARFID/comments/1hd9n9g/adults_with_arfid/",
  "score": 245,
  "num_comments": 38,
  "comments": [
    {
      "id": "m1ubqs8",
      "author": "wmdggur",
      "body": "Yes I dislike it too :( same with autism tbh and I feel like these things encourage the belief that adults with such conditions don’t/ shouldn’t exist",
      "created_utc": 1734087823.0,
      "score": 107,
      "context": []
    },
    {
      "id": "m1v7w39",
      "author": "WaterFnord",
      "body": "Ive been watching a show called Abbott Elementary. One of the main characters is an adult in his 30s who has ARFID. While it’s not brought up too often, it’s portrayed in a realistic and genuinely funny way. Just bringing this up because we have never really had that kind of representation in media before. It’s such a breath of fresh air for precisely the point I’m at in my life also being someone around that age with ARFID. I think we have to keep rolling with the punches and hope that understanding and sympathy grow more over time. After all, we are still only a little over 10 years since the DSM revision that brought this condition to light.",
      "created_utc": 1734102068.0,
      "score": 79,
      "context": []
    },
    {
      "id": "m1un118",
      "author": "None",
      "body": "Absolutely. The hatred, actual hate, that people have towards us is so bizarre and almost as disgusting as the food they try to force onto us. All we can do is to try and realise people that act in that way are idiots, and try to not let it hurt your mental health too much.",
      "created_utc": 1734093921.0,
      "score": 42,
      "context": []
    },
    {
      "id": "m1ujinh",
      "author": "Dramatic-Growth1335",
      "body": "Hello fellow 38 yr old Arfid sufferer.\nSince realising it's basically a phobia I think back to watching TV shows with hypnotists and they'd get someone out with a stupid phobia of something like buttons or oranges. I used to laugh my head off.\nNow I look at it with a different lens seeing as I've basically been scared of food my whole life. \nYou have to laugh....it's better than crying 😭",
      "created_utc": 1734092233.0,
      "score": 19,
      "context": []
    },
    {
      "id": "m1uc443",
      "author": "aha_p",
      "body": "At 25 I know what you mean. I think it’s because picky eating (which we of course now know arfid is not) is something associated with children and not having a fully developed palate. Me personally, I have seen an improvement in my functional relationship with food and my condition since I became an adult, not least because I had had enough of the level of struggle I was used to and had to, by force, make some progress to make existing in the world as an adult easier. But I wouldn’t let it get you down, dietary restrictions and eating conditions can affect anyone at any age and can absolutely be taken seriously by adults when you use the right language and start by being clear that you take your own health seriously as something more than some kind of childish issue but an actual disorder you didn’t chose to have. ♥️",
      "created_utc": 1734088056.0,
      "score": 38,
      "context": []
    },
    {
      "id": "m1ue4p2",
      "author": "MaleficentSwan0223",
      "body": "I feel you. I remember going to the doctors after 15 years of back and forth and they were still insisting I’d grow out of it. I just don’t mention it to them anymore. ",
      "created_utc": 1734089283.0,
      "score": 15,
      "context": []
    },
    {
      "id": "m1ufkgt",
      "author": "Applegirl2021",
      "body": "I hear you, it is so incredibly demoralizing! Honestly, what I’ve had to do to protect my mental health is just basically use how they handle this as the barrier for being part of my life. So I mean my fiancé was the first one to know after I got diagnosed and he has been just incredibly supportive (it helps that he is autistic and ADHD too so doesn’t mind eating the same small variety of safe foods, he actually needs it). Then my parents—my mom was reasonably supportive and has done research and educated herself on it, while my father has done jack squat and has been unsupportive so I’ve had to go low/no contact with him. Then the same for friends and extended family and the ones who were supportive get to stay part of my world of interactions and those who aren’t supportive or treat it like it’s a child’s disease then they aren’t worth my time and care. Hope you are able to do the same! The way I explain it is that it is an eating disorder and basically when you ask me to “just try X non-safe food” you are basically asking me to eat that car tire over there. I state it matter of factly and do not back down. Most decent people respect that and let it be.",
      "created_utc": 1734090120.0,
      "score": 11,
      "context": []
    },
    {
      "id": "m1uqjbr",
      "author": "giraffemoo",
      "body": "I'm 40. My pcp knows that arfid exists and thinks I have it from a brief discussion we had about it. She didn't even need convincing, she's like \"yeah that sounds about right\". \n\nDecent doctors are rare but they do exist.",
      "created_utc": 1734095474.0,
      "score": 10,
      "context": []
    },
    {
      "id": "m1v9ehn",
      "author": "None",
      "body": "Yep. It’s the same with my autism and ADHD too. We’re not all non verbal 8 yr old boys who love trains. They grow up! So much of the research and info is child based and it scews everything. I hate it :/",
      "created_utc": 1734102587.0,
      "score": 9,
      "context": []
    },
    {
      "id": "m1vk7hb",
      "author": "None",
      "body": "36 with it. I will always be weird with food.",
      "created_utc": 1734106135.0,
      "score": 5,
      "context": []
    },
    {
      "id": "m1umpzy",
      "author": "_mnmlst",
      "body": "Yes. I am unusual because while I had a bought of ARFID as a consequence of PANDAS as a child, I had a completely “normal” diet with no restrictions at all (and was a foodie, if I do say so) until the age of 24, when (probably as a consequence of PANDAS again.. followed a strep infection) I developed ARFID due to fear of anaphylaxis. I feel very childish even though I know this is a disorder, and it’s hurtful to see this opinion reinforced online.",
      "created_utc": 1734093780.0,
      "score": 5,
      "context": []
    },
    {
      "id": "m1w5y4e",
      "author": "SadisticGoose",
      "body": "I’ve learned as an adult that what I need more than anything is control when it comes to food. Also being able to try new foods by myself where there’s no pressure. Cooking my own meals has really helped me expand my palette some because I know what’s in it and what type of dish it is. It’s all on my terms. \n\nFor example, my mother only ever makes boiled green beans that I can’t stand. I thought I hated all green beans. Found out I like roasted green beans as an adult because I tried cooking them that way for myself.",
      "created_utc": 1734113025.0,
      "score": 5,
      "context": []
    },
    {
      "id": "m1w54lk",
      "author": "SuccessPutrid7349",
      "body": "I recently saw a photo of the in flight food requirements that Michael Jackson had and all the comments online were like omg he was basically an autistic child, he ate like a kid because he didn't have a childhood, etc etc. Pretty confident he just had some shade of ARFID.",
      "created_utc": 1734112765.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m1wfsy0",
      "author": "None",
      "body": "I doesnt really bother me. I never knew why i did not eat good. Now we know i have it because we found out my son has it.\nIt is something that is not a lot is known of. I think with a few years we can understand more of ARFID with adults. Most of us had i t as a kid, but since no one knew about arfid, we now as adults have the bad luck that experts only know this with kids.\nGive it time.",
      "created_utc": 1734116158.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m1wgc7j",
      "author": "None",
      "body": "Yeah people generally aren’t very understanding of it and seem to think that’s it’s a choice",
      "created_utc": 1734116328.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m1y149h",
      "author": "St4r_5lut",
      "body": "It’s made worse by the fact that autism and arfid are almost directly correlated, and autism is also considered a ‘children’s illness’ or just being ‘spoiled and picky’. You can have autism and not arfid, you can have arfid and not autism, you could have both separately, or they could be directly correlated for you. Regardless? You still be seen as an infantile adult who can’t get over it and just eat. Fucking miserable and people ask why we ‘choose’ this like we wanted this.",
      "created_utc": 1734135772.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m1vzdhp",
      "author": "carcassgardenn",
      "body": "yes. i recently learnt i have it because I SHARE IT WITH MY MOTHER. (20 and 50 respectively. )\n\ni always have to look up ARFID adults especially. i didnt even show that many symptoms as a kid either",
      "created_utc": 1734110960.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m1zcos3",
      "author": "Professional_Ear9795",
      "body": "It's a human illness 🫶🏽 mine is worse than ever rn at 31",
      "created_utc": 1734157237.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m23g1bh",
      "author": "ProBreadKING",
      "body": "Yes this is so frustrating. A lot of people don’t know that some ARFID cases are caused by past trauma. Never had a problem with food in my 20 years of life until I got food poisoning and it completely wrecked how I view and eat my food.",
      "created_utc": 1734221951.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m1ux4s1",
      "author": "JelloOfLife",
      "body": "Yep, not cool tbh. I already get enough shit from family that doesn’t understand lol, Google giving them that ammo is annoying.",
      "created_utc": 1734098139.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m1vbwq2",
      "author": "None",
      "body": "I'm 30 and I couldn't agree more.",
      "created_utc": 1734103431.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m1wp4tn",
      "author": "jeannesloaf",
      "body": "This is one of my biggest pet peeves. I HATE when ARFID is treated as a little kid disorder. I hate when adults with ARFID are belittled and treated like little kids. I can’t stand the idea of a fucking ARFID plushie. It bothers me so much and no one else seems to understand. It’s frustrating.",
      "created_utc": 1734119117.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m1x45pk",
      "author": "chronically-killed",
      "body": "It bothers me too, especially because most children don't have ARFID, they are just picky eaters (yet they call it ARFID when it's not), and yet children are respected for this while we get berated and infantilized for actually having long term issues with food.",
      "created_utc": 1734124032.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m1xe77i",
      "author": "purple_bin",
      "body": "yeah :(",
      "created_utc": 1734127357.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m1xh8lb",
      "author": "crash----",
      "body": "Yup. I’m 27. I feel your pain.",
      "created_utc": 1734128398.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m1xk2ev",
      "author": "TashaT50",
      "body": "It doesn’t bother me. Possibly because I’m rarely around anyone who doesn’t have any problems with my eating restrictions or because at 57 I’m out of f*cks.",
      "created_utc": 1734129391.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m21fqgw",
      "author": "Spider_pig448",
      "body": "Not really. As a kid, no one knew anything at all about this. It didn't even have a name (and when I was in college, it was called Selective Eating Disorder). These things take time, and I'm sure it is more commonly treated in kids, so it seems reasonable.",
      "created_utc": 1734196156.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m21lcdm",
      "author": "TexasVols1794",
      "body": "My 7 year old son has ARFID and it’s the opposite problem for us. Only info we can gather is from adults. Not many 7 year olds out there sharing their experiences to help us with our son.",
      "created_utc": 1734198062.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m1vn063",
      "author": "velociraptor56",
      "body": "It’s season 1, episode 9 where Greg is forced to reveal that he doesn’t like pizza, in case anyone is interested!",
      "created_utc": 1734107024.0,
      "score": 24,
      "context": [
        {
          "id": "m1v7w39",
          "author": "WaterFnord",
          "body": "Ive been watching a show called Abbott Elementary. One of the main characters is an adult in his 30s who has ARFID. While it’s not brought up too often, it’s portrayed in a realistic and genuinely funny way. Just bringing this up because we have never really had that kind of representation in media before. It’s such a breath of fresh air for precisely the point I’m at in my life also being someone around that age with ARFID. I think we have to keep rolling with the punches and hope that understanding and sympathy grow more over time. After all, we are still only a little over 10 years since the DSM revision that brought this condition to light.",
          "created_utc": 1734102068.0
        }
      ]
    },
    {
      "id": "m22higy",
      "author": "MiracleNights1224",
      "body": "Really? I will have to give it a watch.  Thanks !",
      "created_utc": 1734209183.0,
      "score": 4,
      "context": [
        {
          "id": "m1v7w39",
          "author": "WaterFnord",
          "body": "Ive been watching a show called Abbott Elementary. One of the main characters is an adult in his 30s who has ARFID. While it’s not brought up too often, it’s portrayed in a realistic and genuinely funny way. Just bringing this up because we have never really had that kind of representation in media before. It’s such a breath of fresh air for precisely the point I’m at in my life also being someone around that age with ARFID. I think we have to keep rolling with the punches and hope that understanding and sympathy grow more over time. After all, we are still only a little over 10 years since the DSM revision that brought this condition to light.",
          "created_utc": 1734102068.0
        }
      ]
    },
    {
      "id": "m2dtdx3",
      "author": "notj3sus",
      "body": "now that theres 4 seasons, there even more examples of him saying he has unpopular opinions and tastes in food",
      "created_utc": 1734380529.0,
      "score": 2,
      "context": [
        {
          "id": "m1v7w39",
          "author": "WaterFnord",
          "body": "Ive been watching a show called Abbott Elementary. One of the main characters is an adult in his 30s who has ARFID. While it’s not brought up too often, it’s portrayed in a realistic and genuinely funny way. Just bringing this up because we have never really had that kind of representation in media before. It’s such a breath of fresh air for precisely the point I’m at in my life also being someone around that age with ARFID. I think we have to keep rolling with the punches and hope that understanding and sympathy grow more over time. After all, we are still only a little over 10 years since the DSM revision that brought this condition to light.",
          "created_utc": 1734102068.0
        }
      ]
    },
    {
      "id": "m1wyuh0",
      "author": "Outside-Bridge-9223",
      "body": "this is why i never go out with my coworkers. one of them was ranting about how her friend is “the worst person to go out with because she’s so picky”. they have no clue about my eating habits because i know they’d be super negative about it. they’ve already made a few remarks about what ive eaten (or not eaten) at staff potlucks and it’s ridiculous.",
      "created_utc": 1734122292.0,
      "score": 13,
      "context": [
        {
          "id": "m1un118",
          "author": "None",
          "body": "Absolutely. The hatred, actual hate, that people have towards us is so bizarre and almost as disgusting as the food they try to force onto us. All we can do is to try and realise people that act in that way are idiots, and try to not let it hurt your mental health too much.",
          "created_utc": 1734093921.0
        }
      ]
    },
    {
      "id": "m1vedvq",
      "author": "khurley424",
      "body": "I've genuinely considered seeking out a good hypnotist more than once to be rid of it. Something like that, if effective, would be nothing short of a miracle",
      "created_utc": 1734104249.0,
      "score": 12,
      "context": [
        {
          "id": "m1ujinh",
          "author": "Dramatic-Growth1335",
          "body": "Hello fellow 38 yr old Arfid sufferer.\nSince realising it's basically a phobia I think back to watching TV shows with hypnotists and they'd get someone out with a stupid phobia of something like buttons or oranges. I used to laugh my head off.\nNow I look at it with a different lens seeing as I've basically been scared of food my whole life. \nYou have to laugh....it's better than crying 😭",
          "created_utc": 1734092233.0
        }
      ]
    },
    {
      "id": "m1xj6dl",
      "author": "TashaT50",
      "body": "I know I’ve had an easier time than many because my mom had me in the kitchen helping at age 3. The ability to cook, control all steps in the food going into my body, is huge. I didn’t realize that until I found out my picky eating was ARFID, at 55, and reading peoples stories on this sub.",
      "created_utc": 1734129077.0,
      "score": 3,
      "context": [
        {
          "id": "m1w5y4e",
          "author": "SadisticGoose",
          "body": "I’ve learned as an adult that what I need more than anything is control when it comes to food. Also being able to try new foods by myself where there’s no pressure. Cooking my own meals has really helped me expand my palette some because I know what’s in it and what type of dish it is. It’s all on my terms. \n\nFor example, my mother only ever makes boiled green beans that I can’t stand. I thought I hated all green beans. Found out I like roasted green beans as an adult because I tried cooking them that way for myself.",
          "created_utc": 1734113025.0
        }
      ]
    },
    {
      "id": "m21xbmo",
      "author": "tjamesw1234",
      "body": "I feel like the population is fairly sparse and your not likely to encounter another kid with it in the same school. Also typically I remember trying to keep it in the background when I was 7. It’s tricky.",
      "created_utc": 1734202153.0,
      "score": 1,
      "context": [
        {
          "id": "m21lcdm",
          "author": "TexasVols1794",
          "body": "My 7 year old son has ARFID and it’s the opposite problem for us. Only info we can gather is from adults. Not many 7 year olds out there sharing their experiences to help us with our son.",
          "created_utc": 1734198062.0
        }
      ]
    },
    {
      "id": "m1vnczi",
      "author": "WaterFnord",
      "body": "Haha yep and the nasty ass pizza they showed to illustrate the validity of his problems was an incredible punchline.",
      "created_utc": 1734107136.0,
      "score": 16,
      "context": [
        {
          "id": "m1v7w39",
          "author": "WaterFnord",
          "body": "Ive been watching a show called Abbott Elementary. One of the main characters is an adult in his 30s who has ARFID. While it’s not brought up too often, it’s portrayed in a realistic and genuinely funny way. Just bringing this up because we have never really had that kind of representation in media before. It’s such a breath of fresh air for precisely the point I’m at in my life also being someone around that age with ARFID. I think we have to keep rolling with the punches and hope that understanding and sympathy grow more over time. After all, we are still only a little over 10 years since the DSM revision that brought this condition to light.",
          "created_utc": 1734102068.0
        },
        {
          "id": "m1vn063",
          "author": "velociraptor56",
          "body": "It’s season 1, episode 9 where Greg is forced to reveal that he doesn’t like pizza, in case anyone is interested!",
          "created_utc": 1734107024.0
        }
      ]
    },
    {
      "id": "m26e4de",
      "author": "icedteaqueeen",
      "body": "Reminded me YouTube videos i used to watch to try to hypnotize myself, was and still am desperate 😔",
      "created_utc": 1734276061.0,
      "score": 1,
      "context": [
        {
          "id": "m1ujinh",
          "author": "Dramatic-Growth1335",
          "body": "Hello fellow 38 yr old Arfid sufferer.\nSince realising it's basically a phobia I think back to watching TV shows with hypnotists and they'd get someone out with a stupid phobia of something like buttons or oranges. I used to laugh my head off.\nNow I look at it with a different lens seeing as I've basically been scared of food my whole life. \nYou have to laugh....it's better than crying 😭",
          "created_utc": 1734092233.0
        },
        {
          "id": "m1vedvq",
          "author": "khurley424",
          "body": "I've genuinely considered seeking out a good hypnotist more than once to be rid of it. Something like that, if effective, would be nothing short of a miracle",
          "created_utc": 1734104249.0
        }
      ]
    },
    {
      "id": "m1vtpqe",
      "author": "velociraptor56",
      "body": "That episode is especially funny to me because I have 2 kids, one with ARFID. And the kid without ARFID is the one that actually doesn’t like pizza very much.",
      "created_utc": 1734109151.0,
      "score": 11,
      "context": [
        {
          "id": "m1v7w39",
          "author": "WaterFnord",
          "body": "Ive been watching a show called Abbott Elementary. One of the main characters is an adult in his 30s who has ARFID. While it’s not brought up too often, it’s portrayed in a realistic and genuinely funny way. Just bringing this up because we have never really had that kind of representation in media before. It’s such a breath of fresh air for precisely the point I’m at in my life also being someone around that age with ARFID. I think we have to keep rolling with the punches and hope that understanding and sympathy grow more over time. After all, we are still only a little over 10 years since the DSM revision that brought this condition to light.",
          "created_utc": 1734102068.0
        },
        {
          "id": "m1vn063",
          "author": "velociraptor56",
          "body": "It’s season 1, episode 9 where Greg is forced to reveal that he doesn’t like pizza, in case anyone is interested!",
          "created_utc": 1734107024.0
        },
        {
          "id": "m1vnczi",
          "author": "WaterFnord",
          "body": "Haha yep and the nasty ass pizza they showed to illustrate the validity of his problems was an incredible punchline.",
          "created_utc": 1734107136.0
        }
      ]
    }
  ]
}