{
  "id": "1hdgydm",
  "subreddit": "ARFID",
  "author": "canadave_nyc",
  "created_utc": 1734109760.0,
  "title": "Warning: If you have ARFID, make sure you monitor your health",
  "selftext": "I'm 53 years old, and have had sensory/sensitive ARFID my entire life. My diet has always been heavily into things like pizza, fries, burgers, bread, and pasta--no fruits or vegetables (I find even looking at them revolting). I have a very limited diet. I don't eat many sugary things though--knowing that I have an unhealthy diet, I've tried my best to avoid problems from drinking soda pop and having tons of ice cream and things like that. I drink water and try to use low-fat cheese where I can, etc.\n\nAlthough I'm not obese, I've always had high triglycerides, despite being fairly active and doing lots of sports things. I've just kind of ignored it and said \"whatever is going to happen will happen, it's all due to my ARFID and there's nothing I can do about it.\" Well, it turns out this has finally come to bite me. After a month of feeling progressively vaguely worse and worse, with bowel habits changing, I finally had an \"attack\" on September 25. Turns out, this was acute pancreatitis brought on by the high triglycerides. I was lucky--pancreatitis can be quite severe and even fatal. My case was mild, but I'm still in recovery mode. It's been a very, very rough ride these past couple of months. (Make sure you go to your doctor if you notice your bowel habits changing, folks. I ignored it and it cost me bigtime.) The scary thing about pancreatitis, too, is that it can recur worse each time, and eventually become chronic, at which point you have a major permanent health problem on your hands. A bad fatty diet can also lead to non-alcoholic fatty liver disease, which is insidious because it often has no symptoms until you have cirrhosis of the liver (permanent scarring/damage).\n\nI'm writing this not to scare anyone, but simply to caution you--if you have an unhealthy diet due to ARFID, make sure you at least monitor your health, speak to a doctor, get regular blood work checkups, and try to do something about any high cholesterol or triglycerides you may have. For example, I've managed to modify my diet entirely by at least having fish and chicken as protein sources at mealtime (leaner meat) rather than burgers. An air fryer has been a GODSEND for this--I used to hate fish because it tasted \"fishy\", but baking the fish in the air fryer and sprinkling some cayenne pepper/paprika mix I made onto the fish once it's done has turned it into delicious-tasting meat--no more \"fishy taste\"!\n\nI've cut out pizza and have instead found some high-fiber bagels I like and I coat those in a bit of tomato sauce and just a TINY bit of low-fat cheese, and I also get some chia and sesame seeds on the bagels for more healthy fat/fiber. Instead of white rice, I trained myself to eat brown rice (I never was able to before, but this was a small and easy step I was able to make--and honestly, now I'm almost embarrassed at how long it took me, because brown rice tastes almost exactly like white rice).\n\nI'm going to have to try to do some ARFID treatment to be able to eat at least SOME fruits and vegetables--I'm sure I won't get to the point of being freely able to eat anything like most people, but as long as I can focus on a very small number of them and start with that, maybe that will at least be enough to keep me healthy. *Don't worry about making big changes--just focus on multiple small, incremental steps over time.* It's something I'm hoping I can do, and I hope you can all too. Stay healthy everyone!",
  "url": "https://www.reddit.com/r/ARFID/comments/1hdgydm/warning_if_you_have_arfid_make_sure_you_monitor/",
  "score": 214,
  "num_comments": 41,
  "comments": [
    {
      "id": "m1w3ij6",
      "author": "WildWallFlower97",
      "body": "This is somsthing I've thought about and feared my whole life. I'm only in my 20s but I just know something is wrong with me. I have to get blood work next week and I've been pushing it off for a longgggg time. I know I need to make changes but just can't.  Are there any supplements/vitamins/mixes you have been recommended that might help?",
      "created_utc": 1734112263.0,
      "score": 110,
      "context": []
    },
    {
      "id": "m1wisy1",
      "author": "throw0OO0away",
      "body": "I second this. One of the best pieces of advice I can give is to use what works as a foundation and expand upon it. \n\nFor me, I struggle with solid foods. However, I can tolerate peanut butter and jelly together without the bread. I plan on adding small amounts of bread chunks that feel manageable to me into the PB&J jam/sauce/filling/whatever it is. This way, I introduce bread and slowly build towards a sandwich. Once I can tolerate a PB&J sandwich, then I’ll start exploring with other types of sandwiches.",
      "created_utc": 1734117106.0,
      "score": 38,
      "context": []
    },
    {
      "id": "m1wqa9l",
      "author": "acidinbath",
      "body": "we have the exact same sounding diet and this is something that stressed me out SO MUCH i just live off of pizza and pasta and packs of crisps and can feel how weak im becoming , i feel sick all the time and i wanna change but i just hate food so much i dont wanna start trying to fix my shit diet .",
      "created_utc": 1734119490.0,
      "score": 31,
      "context": []
    },
    {
      "id": "m1wva2j",
      "author": "jizzyjazz2",
      "body": "how would someone even go about modifying their diet to prevent something like this if they're extremely limited, like me for instance? it kinda just feels like fate to me",
      "created_utc": 1734121117.0,
      "score": 12,
      "context": []
    },
    {
      "id": "m1vyehq",
      "author": "SecretSquirrelSpot",
      "body": "I am 40 and already failing health wise. I got one of those DNA tests to see if it was my body failing me or me failing my body, and as it happens, it’s both. \n\nI have some genes that make it difficult for my body to convert (methylate) B12, Vit D, Folate & some others. I now use methylated versions of the vitamins and my lethargy / tiredness has improved significantly. \n\nI still have gut issues but that’s my fault for eating a beige diet!",
      "created_utc": 1734110653.0,
      "score": 13,
      "context": []
    },
    {
      "id": "m1xs291",
      "author": "AfternoonParty8832",
      "body": "I think being in touch with your body can keep many of us from panicking about this. Like OP said, don't avoid the doctor. Get yearly physicals and blood work done. Stay active. Stay hydrated. If something changes in your bowel movements or energy or whatever, look into it right away. I have a little OCD I think in addition to ARFID so this isn't as hard for me lol.\n\nI also personally ensure I get enough fiber through daily gummies, and I take a multivitamin, fish oil, vitamin D, probiotic, the works. Not sure if any of these supplements specifically prevent OP's issue, but with our unhealthy diets, it's worth it to be as proactive as possible!!",
      "created_utc": 1734132320.0,
      "score": 4,
      "context": []
    },
    {
      "id": "m24x4rv",
      "author": "abldraws",
      "body": "This is something i’m afraid of. My diet is pretty much the exact same it’s literally a rotation between burgers and pizza. I did get bloodwork done recently cause I thought I had diabetes but I don’t… in general whenever I do bloodwork it comes back “healthy”. I really don’t feel that way tho, i’m exhausted all the time (probably cause of my diet)",
      "created_utc": 1734246128.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m1xo8oq",
      "author": "Affectionate_Face557",
      "body": "If you don't mind sharing the specifics of your bowel \"changes\" I'd appreciate it since I could have written your post (although I do eat cooked carrots and salads) \nI'm terrified of pancreatitis and am looking to eat healthier at the start of new year.\nMy bowel habits are def on my radar bc of my family history of colon cancer. \nIf you'd rather not share that info it's ok. I respect that.",
      "created_utc": 1734130882.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m21jez6",
      "author": "sweetpeaandmax",
      "body": "I also have ARFID and also developed pancreatitis!  Mine was at a much younger age though, 13.  I had to change my diet a bit to make my “safe foods” more low-fat and less greasy/fatty but and that was scary at first but I also started taking an enzyme supplement that has given me a little more freedom to eat what I’m comfortable with.  Look into Essentialzymes 4 from Young Living—it’s a more natural solution and it’s what has worked for me.  I still have flare ups occasionally but they are MUCH further spaced out.  You can also look into kreon which is a medication!",
      "created_utc": 1734197404.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m2200ad",
      "author": "Goat_External",
      "body": "Totally agree. I'm 26 and already have more healthy problems related to bone density and nutrient deficiencies than my mom. I'm trying to improve what I eat slowly, but there's days that I simple can't eat a food that I technically like? Especially meat, I need to be in the right mindset. And I have to be the one to cook it lol",
      "created_utc": 1734203072.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m1y8ia6",
      "author": "Sarasyourdaddy",
      "body": "Thank you so much for sharing. I often worry about my health and that of my child, 17, who also has ARFID. I have been on an almost completely liquid diet because now I’m not only afraid of throwing up or choking, I’m afraid to chew. I will never ever ever try fish. I just can’t. But I like your tip about the bagels. Hopefully I can get myself to try it and successfully eat it often.",
      "created_utc": 1734138633.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m21izw0",
      "author": "brandielynng29",
      "body": "As a type 2 diabetic and someone with ARFID. I too struggled with my eating and suffered from DKA and Pancreatitis back in May of 2021. It was scary. My diet still hasn’t changed completely but I’m in recovery for the ARFID. My triglycerides are still elevated but i dont know what else to do because my safe foods consist of high carb foods",
      "created_utc": 1734197261.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m2eq8bh",
      "author": "xThyQueen",
      "body": "I take supplements, it's easier to swallow pills then eat veggies a lot of the time.",
      "created_utc": 1734391186.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m2gmbjc",
      "author": "leeharveyoswaldAlt",
      "body": "glad youre doing alright, thats scary! im 19 and my triglycerides are already high + i have a history of diabetes in my family :,) good on you for working on improving!!",
      "created_utc": 1734419402.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m2ku11q",
      "author": "Mean_Mango6955",
      "body": "This is my biggest fear for my son and he's only 13.",
      "created_utc": 1734479899.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m1w4r4a",
      "author": "canadave_nyc",
      "body": "This is a very tricky question. There are some supplements that *may* help with certain things--for instance, turmeric/curcumin may have some anti-inflammatory effects. But I would caution you against just popping a bunch of supplements without medical advice to do so. Maybe just look into the subject and bring some ideas to your doctor and ask if they think it'd be a good idea.\n\nBut definitely, definitely get that blood work done. Ever since I was a kid I used to be scared of needles, I would faint. And now I just go \"ho hum, another day at the office\"--just look away, close my eyes, and it's over and done with in 20 seconds with only the most miniscule childish pinprick kind of discomfort (sometimes not even that). The blood work is what will save you from a lot of things. Check it regularly. In my case it showed my lipase levels indicated pancreatitis, which was subsequently confirmed via a CT scan of my abdomen.\n\nAnd as for making changes--believe me, *you can*. If I can, anyone can. Again--don't try to make a huge change. Take a couple of hours one weekend and make a list of all the bad things you eat or do in one column. Then, next to that, in the right column, write in any small changes you can make. So for instance, one of my things was \"I only eat white rice, which can raise triglycerides.\" It turns out brown rice doesn't have the same effect, so I said \"maybe I can make this small change and switch from white rice to being able to eat brown rice.\" I then had a single grain of brown rice. It tasted almost exactly like white rice. I had a little more. Same thing. Then I smacked myself in the head with my hand for being this stupid for this long--they taste almost exactly the same.\n\nAnother example--I wasn't a huge fan of fish, and in particular salmon, which is very healthy. I wanted to eat salmon, but every time I did, it just tasted so...salmony and fishy. So I hardly ate it, ever. After my pancreatitis hit, I learned my trick of using the air fryer to get rid of the salmony/fishy taste, and then sprinkling my cayenne pepper/paprika spice mix on it. I also now break up the salmon into chunks and put them on taco shells, and eat them as fish tacos (I love beef tacos!). Total gamechanger--now I LOVE salmon, particular when eaten in fish tacos, and I eat it all the time--so yummy. Old me would NEVER have eaten that.\n\nDo small things like that, incrementally, over time, and it will eventually add up to making a positive change. Don't think to yourself \"I have to make all these massive changes and there's no way I can do that!\" You're right--you likely can't. But the small changes will make a difference.",
      "created_utc": 1734112649.0,
      "score": 38,
      "context": [
        {
          "id": "m1w3ij6",
          "author": "WildWallFlower97",
          "body": "This is somsthing I've thought about and feared my whole life. I'm only in my 20s but I just know something is wrong with me. I have to get blood work next week and I've been pushing it off for a longgggg time. I know I need to make changes but just can't.  Are there any supplements/vitamins/mixes you have been recommended that might help?",
          "created_utc": 1734112263.0
        }
      ]
    },
    {
      "id": "m1x7pxa",
      "author": "canadave_nyc",
      "body": "That is a great idea! I wouldn't even try to add \"chunks\" of bread--I'd basically just have a few \"crumbs\"--the tiniest little \"chunks\" possible.",
      "created_utc": 1734125213.0,
      "score": 7,
      "context": [
        {
          "id": "m1wisy1",
          "author": "throw0OO0away",
          "body": "I second this. One of the best pieces of advice I can give is to use what works as a foundation and expand upon it. \n\nFor me, I struggle with solid foods. However, I can tolerate peanut butter and jelly together without the bread. I plan on adding small amounts of bread chunks that feel manageable to me into the PB&J jam/sauce/filling/whatever it is. This way, I introduce bread and slowly build towards a sandwich. Once I can tolerate a PB&J sandwich, then I’ll start exploring with other types of sandwiches.",
          "created_utc": 1734117106.0
        }
      ]
    },
    {
      "id": "m1wt729",
      "author": "canadave_nyc",
      "body": "First step: Forget food for a minute. Put that aside. \n\nNext: Go to a doctor, explain your situation and concerns, and get blood work. That will establish where you're at as a \"baseline\". It will identify any health problems you may be at risk for--make sure at the very least the blood work looks at markers for potential diabetes, liver disease, cholesterol levels, and triglycerides. \n\nOnce you have your blood work done, face the results. Take a step back and look at the results closely, carefully. If you don't understand them, ask your doctor.\n\nOnce you know what the results indicate in terms of risks, then look at ways you can make SMALL changes. For example--you said you eat pasta. I take it that's regular pasta. Do you eat brown rice pasta? If not, maybe that's something you can try (I've eaten both--they taste almost identical). Brown rice pasta maybe then gets you able to eat brown rice, which is a healthier food than regular pasta. It doesn't mean you can never eat regular pasta again--just trying to expand things even slightly.\n\nLook at simple things you can substitute. For example--you said you eat pizza. How about a pizza bagel? I love both. If you can stomach a pizza bagel (pretty much a pizza except with bagel bread under it instead of pizza bread, which is almost identical), then maybe you can try a pizza bagel with some chia seeds on it (chia seeds are tasteless and can be good for health). If you can do that, then maybe some time later you can keep the chia seeds, ditch the pizza topping on the bagel, and put something else on it.\n\nIf you do crisps, then maybe you can make your own healthier version instead of store-bought. Look up recipes for \"homemade healthier crisps\" on youtube.\n\nAs I said--these are all small steps. Don't look at it as \"I have so much I have to change in big ways, I'll never be able to.\" You're right. Instead of doing that, do much much smaller incremental steps. Tiny steps. Make 100 of those tiny steps add up to one big step instead of trying to do the one big step all at once.",
      "created_utc": 1734120429.0,
      "score": 29,
      "context": [
        {
          "id": "m1wqa9l",
          "author": "acidinbath",
          "body": "we have the exact same sounding diet and this is something that stressed me out SO MUCH i just live off of pizza and pasta and packs of crisps and can feel how weak im becoming , i feel sick all the time and i wanna change but i just hate food so much i dont wanna start trying to fix my shit diet .",
          "created_utc": 1734119490.0
        }
      ]
    },
    {
      "id": "m1wuard",
      "author": "SecretSquirrelSpot",
      "body": "A tip for pizzas if you want to try it. Get a base, any kind you like, I use the naan breads from Costco, and then make your own sauce with hidden veggies. I use 1 packet of steam fresh veggies (the microwave ones) which has a small amount of sweetcorn, broccoli and carrots, I blend it to small chunks, add in a jar of dolmio and blend it again until smooth. Then I put it in an ice cube tray and freeze it. Then whenever I want a pizza I use 2 small cubes (defrost in the microwave in a mug for like 50 secs until it’s spreadable) add the cheese (pre grated mozzarella bag from Costco also - which I freeze also) and then bake as usual for like 10 mins.\n\nExtra veggies that you genuinely cannot taste. It all adds up bit by bit when you hide it from yourself.",
      "created_utc": 1734120794.0,
      "score": 13,
      "context": [
        {
          "id": "m1wqa9l",
          "author": "acidinbath",
          "body": "we have the exact same sounding diet and this is something that stressed me out SO MUCH i just live off of pizza and pasta and packs of crisps and can feel how weak im becoming , i feel sick all the time and i wanna change but i just hate food so much i dont wanna start trying to fix my shit diet .",
          "created_utc": 1734119490.0
        }
      ]
    },
    {
      "id": "m1wwis1",
      "author": "canadave_nyc",
      "body": "See the rest of my replies in this thread :) As well as my original post about ways I modified my diet slightly.",
      "created_utc": 1734121527.0,
      "score": 3,
      "context": [
        {
          "id": "m1wva2j",
          "author": "jizzyjazz2",
          "body": "how would someone even go about modifying their diet to prevent something like this if they're extremely limited, like me for instance? it kinda just feels like fate to me",
          "created_utc": 1734121117.0
        }
      ]
    },
    {
      "id": "m1w3ldo",
      "author": "RunaroundX",
      "body": "Yo! Can I get some info on that test? Do you request it from a Dr. or is it like a kit you buy? I had low foilate on my last checkup and I am constantly tired and wonder if this test could help me :)",
      "created_utc": 1734112287.0,
      "score": 7,
      "context": [
        {
          "id": "m1vyehq",
          "author": "SecretSquirrelSpot",
          "body": "I am 40 and already failing health wise. I got one of those DNA tests to see if it was my body failing me or me failing my body, and as it happens, it’s both. \n\nI have some genes that make it difficult for my body to convert (methylate) B12, Vit D, Folate & some others. I now use methylated versions of the vitamins and my lethargy / tiredness has improved significantly. \n\nI still have gut issues but that’s my fault for eating a beige diet!",
          "created_utc": 1734110653.0
        }
      ]
    },
    {
      "id": "m1xsskt",
      "author": "canadave_nyc",
      "body": "Yep--exactly this. Our diets are (usually) not healthy, so we absolutely must: (1) keep on top of our health with good monitoring, and (2) be as healthy as possible in other ways (such as the multivitamins, fish oil, and probiotics you mentioned) to try to offset it as much as possible.",
      "created_utc": 1734132597.0,
      "score": 5,
      "context": [
        {
          "id": "m1xs291",
          "author": "AfternoonParty8832",
          "body": "I think being in touch with your body can keep many of us from panicking about this. Like OP said, don't avoid the doctor. Get yearly physicals and blood work done. Stay active. Stay hydrated. If something changes in your bowel movements or energy or whatever, look into it right away. I have a little OCD I think in addition to ARFID so this isn't as hard for me lol.\n\nI also personally ensure I get enough fiber through daily gummies, and I take a multivitamin, fish oil, vitamin D, probiotic, the works. Not sure if any of these supplements specifically prevent OP's issue, but with our unhealthy diets, it's worth it to be as proactive as possible!!",
          "created_utc": 1734132320.0
        }
      ]
    },
    {
      "id": "m25osa8",
      "author": "canadave_nyc",
      "body": "Make sure your blood work is also checking things like triglycerides, cholesterol (lipid panel), lipase (to detect pancreas problems), and AST and ALT (to detect liver disease). Those plus the diabetes are the big ticket items.\n\nNot sure how old you are, but it took me 53 years to run into problems....so if you're still young, there's plenty of time to change :)",
      "created_utc": 1734264543.0,
      "score": 2,
      "context": [
        {
          "id": "m24x4rv",
          "author": "abldraws",
          "body": "This is something i’m afraid of. My diet is pretty much the exact same it’s literally a rotation between burgers and pizza. I did get bloodwork done recently cause I thought I had diabetes but I don’t… in general whenever I do bloodwork it comes back “healthy”. I really don’t feel that way tho, i’m exhausted all the time (probably cause of my diet)",
          "created_utc": 1734246128.0
        }
      ]
    },
    {
      "id": "m1xopf9",
      "author": "canadave_nyc",
      "body": "No worries. My bowel habits were always very irritable--lots of loose stool, diarrhea after especially fatty meals, etc. But I never had trouble going to the bathroom. \n\nWhat I found was over the course of a month, I began producing less and less stool. By the end of the month, I was hardly producing any stool at all--pretty much zero, even after eating. At the same time, I started feeling vaguely \"off\"--just generally unwell, nothing I could pinpoint really, but I knew something wasn't right. Soon after that, my pancreatitis hit. I'm still struggling with that now, even after the pancreatitis has subsided.",
      "created_utc": 1734131054.0,
      "score": 4,
      "context": [
        {
          "id": "m1xo8oq",
          "author": "Affectionate_Face557",
          "body": "If you don't mind sharing the specifics of your bowel \"changes\" I'd appreciate it since I could have written your post (although I do eat cooked carrots and salads) \nI'm terrified of pancreatitis and am looking to eat healthier at the start of new year.\nMy bowel habits are def on my radar bc of my family history of colon cancer. \nIf you'd rather not share that info it's ok. I respect that.",
          "created_utc": 1734130882.0
        }
      ]
    },
    {
      "id": "m21j8m7",
      "author": "canadave_nyc",
      "body": "Sorry to hear about your struggles.\n\nHave you spoken to your doctor about your high triglycerides? There is medication to lower them significantly, such as fenofibrates.",
      "created_utc": 1734197343.0,
      "score": 1,
      "context": [
        {
          "id": "m21izw0",
          "author": "brandielynng29",
          "body": "As a type 2 diabetic and someone with ARFID. I too struggled with my eating and suffered from DKA and Pancreatitis back in May of 2021. It was scary. My diet still hasn’t changed completely but I’m in recovery for the ARFID. My triglycerides are still elevated but i dont know what else to do because my safe foods consist of high carb foods",
          "created_utc": 1734197261.0
        }
      ]
    },
    {
      "id": "m1x4jsd",
      "author": "acidinbath",
      "body": "this is a really helpful comment thank you so much !! i am going to follow this advice hopefully i see good results :)",
      "created_utc": 1734124162.0,
      "score": 4,
      "context": [
        {
          "id": "m1wqa9l",
          "author": "acidinbath",
          "body": "we have the exact same sounding diet and this is something that stressed me out SO MUCH i just live off of pizza and pasta and packs of crisps and can feel how weak im becoming , i feel sick all the time and i wanna change but i just hate food so much i dont wanna start trying to fix my shit diet .",
          "created_utc": 1734119490.0
        },
        {
          "id": "m1wt729",
          "author": "canadave_nyc",
          "body": "First step: Forget food for a minute. Put that aside. \n\nNext: Go to a doctor, explain your situation and concerns, and get blood work. That will establish where you're at as a \"baseline\". It will identify any health problems you may be at risk for--make sure at the very least the blood work looks at markers for potential diabetes, liver disease, cholesterol levels, and triglycerides. \n\nOnce you have your blood work done, face the results. Take a step back and look at the results closely, carefully. If you don't understand them, ask your doctor.\n\nOnce you know what the results indicate in terms of risks, then look at ways you can make SMALL changes. For example--you said you eat pasta. I take it that's regular pasta. Do you eat brown rice pasta? If not, maybe that's something you can try (I've eaten both--they taste almost identical). Brown rice pasta maybe then gets you able to eat brown rice, which is a healthier food than regular pasta. It doesn't mean you can never eat regular pasta again--just trying to expand things even slightly.\n\nLook at simple things you can substitute. For example--you said you eat pizza. How about a pizza bagel? I love both. If you can stomach a pizza bagel (pretty much a pizza except with bagel bread under it instead of pizza bread, which is almost identical), then maybe you can try a pizza bagel with some chia seeds on it (chia seeds are tasteless and can be good for health). If you can do that, then maybe some time later you can keep the chia seeds, ditch the pizza topping on the bagel, and put something else on it.\n\nIf you do crisps, then maybe you can make your own healthier version instead of store-bought. Look up recipes for \"homemade healthier crisps\" on youtube.\n\nAs I said--these are all small steps. Don't look at it as \"I have so much I have to change in big ways, I'll never be able to.\" You're right. Instead of doing that, do much much smaller incremental steps. Tiny steps. Make 100 of those tiny steps add up to one big step instead of trying to do the one big step all at once.",
          "created_utc": 1734120429.0
        }
      ]
    },
    {
      "id": "m1wyaay",
      "author": "canadave_nyc",
      "body": "I've never heard of half the things you mentioned :) I looked up Dolmio--okay, gotcha, sauce. What is a packet of steam fresh veggies (the microwave ones)?\n\nAnd just so I'm clear--your ratio is one packet to one full jar of sauce? It seems like that would be very little vegetable content per pizza (unless I'm misinterpreting how large \"a packet\" is). But I'm willing (would love to) to be convinced!",
      "created_utc": 1734122108.0,
      "score": 4,
      "context": [
        {
          "id": "m1wqa9l",
          "author": "acidinbath",
          "body": "we have the exact same sounding diet and this is something that stressed me out SO MUCH i just live off of pizza and pasta and packs of crisps and can feel how weak im becoming , i feel sick all the time and i wanna change but i just hate food so much i dont wanna start trying to fix my shit diet .",
          "created_utc": 1734119490.0
        },
        {
          "id": "m1wuard",
          "author": "SecretSquirrelSpot",
          "body": "A tip for pizzas if you want to try it. Get a base, any kind you like, I use the naan breads from Costco, and then make your own sauce with hidden veggies. I use 1 packet of steam fresh veggies (the microwave ones) which has a small amount of sweetcorn, broccoli and carrots, I blend it to small chunks, add in a jar of dolmio and blend it again until smooth. Then I put it in an ice cube tray and freeze it. Then whenever I want a pizza I use 2 small cubes (defrost in the microwave in a mug for like 50 secs until it’s spreadable) add the cheese (pre grated mozzarella bag from Costco also - which I freeze also) and then bake as usual for like 10 mins.\n\nExtra veggies that you genuinely cannot taste. It all adds up bit by bit when you hide it from yourself.",
          "created_utc": 1734120794.0
        }
      ]
    },
    {
      "id": "m1x7hj5",
      "author": "jizzyjazz2",
      "body": "that's assuming you *can* modify it though. what if there's no room for improvement?",
      "created_utc": 1734125136.0,
      "score": 6,
      "context": [
        {
          "id": "m1wva2j",
          "author": "jizzyjazz2",
          "body": "how would someone even go about modifying their diet to prevent something like this if they're extremely limited, like me for instance? it kinda just feels like fate to me",
          "created_utc": 1734121117.0
        },
        {
          "id": "m1wwis1",
          "author": "canadave_nyc",
          "body": "See the rest of my replies in this thread :) As well as my original post about ways I modified my diet slightly.",
          "created_utc": 1734121527.0
        }
      ]
    },
    {
      "id": "m1wb2gv",
      "author": "SecretSquirrelSpot",
      "body": "I used Circle DNA, it’s a private test so quite expensive unfortunately but I was at my wits end with the medical profession in the UK. \n\nDepending on where you are will determine which company to use I guess. \n\nYou’re looking specifically for a methylation DNA test. I found loads of info watching Gary Brecka on you tube about it. And he’s not scamming like some would have you believe, because literally all the things my bloods were showing as deficient in, are the ones that my DNA test said that I can’t methylate. I’ve been taking multivitamins for years to no effect, now I know why.",
      "created_utc": 1734114655.0,
      "score": 4,
      "context": [
        {
          "id": "m1vyehq",
          "author": "SecretSquirrelSpot",
          "body": "I am 40 and already failing health wise. I got one of those DNA tests to see if it was my body failing me or me failing my body, and as it happens, it’s both. \n\nI have some genes that make it difficult for my body to convert (methylate) B12, Vit D, Folate & some others. I now use methylated versions of the vitamins and my lethargy / tiredness has improved significantly. \n\nI still have gut issues but that’s my fault for eating a beige diet!",
          "created_utc": 1734110653.0
        },
        {
          "id": "m1w3ldo",
          "author": "RunaroundX",
          "body": "Yo! Can I get some info on that test? Do you request it from a Dr. or is it like a kit you buy? I had low foilate on my last checkup and I am constantly tired and wonder if this test could help me :)",
          "created_utc": 1734112287.0
        }
      ]
    },
    {
      "id": "m1wfdln",
      "author": "SecretSquirrelSpot",
      "body": "Sorry I didn’t really answer your question clearly. It’s a kit you order online, they post it you, you swab the inside of your cheek, post it back and wait a few weeks for the results. If you buy a test, look out for discount codes, a lot of them have good discounts via their Facebook pages or referrals from friends etc so don’t buy one at full price. \n\nIf I were to do it again I’d probably use mybodyfabulous as their report seems much clearer than the one I ordered, I didn’t research it enough bar finding one that provided the specific methylation genes, I just got excited and pressed buy!",
      "created_utc": 1734116023.0,
      "score": 2,
      "context": [
        {
          "id": "m1vyehq",
          "author": "SecretSquirrelSpot",
          "body": "I am 40 and already failing health wise. I got one of those DNA tests to see if it was my body failing me or me failing my body, and as it happens, it’s both. \n\nI have some genes that make it difficult for my body to convert (methylate) B12, Vit D, Folate & some others. I now use methylated versions of the vitamins and my lethargy / tiredness has improved significantly. \n\nI still have gut issues but that’s my fault for eating a beige diet!",
          "created_utc": 1734110653.0
        },
        {
          "id": "m1w3ldo",
          "author": "RunaroundX",
          "body": "Yo! Can I get some info on that test? Do you request it from a Dr. or is it like a kit you buy? I had low foilate on my last checkup and I am constantly tired and wonder if this test could help me :)",
          "created_utc": 1734112287.0
        }
      ]
    },
    {
      "id": "m1xsrbg",
      "author": "Affectionate_Face557",
      "body": "Ah ok, I see. I'm so sorry that you had to experience this but I congratulate you on your courage to make this major change in your eating habits. You've prob extended your life if not actually saved it. \nYou've inspired me (scared straight  😅) and given me the motivation I need to make this change also. Thank you so much.",
      "created_utc": 1734132583.0,
      "score": 6,
      "context": [
        {
          "id": "m1xo8oq",
          "author": "Affectionate_Face557",
          "body": "If you don't mind sharing the specifics of your bowel \"changes\" I'd appreciate it since I could have written your post (although I do eat cooked carrots and salads) \nI'm terrified of pancreatitis and am looking to eat healthier at the start of new year.\nMy bowel habits are def on my radar bc of my family history of colon cancer. \nIf you'd rather not share that info it's ok. I respect that.",
          "created_utc": 1734130882.0
        },
        {
          "id": "m1xopf9",
          "author": "canadave_nyc",
          "body": "No worries. My bowel habits were always very irritable--lots of loose stool, diarrhea after especially fatty meals, etc. But I never had trouble going to the bathroom. \n\nWhat I found was over the course of a month, I began producing less and less stool. By the end of the month, I was hardly producing any stool at all--pretty much zero, even after eating. At the same time, I started feeling vaguely \"off\"--just generally unwell, nothing I could pinpoint really, but I knew something wasn't right. Soon after that, my pancreatitis hit. I'm still struggling with that now, even after the pancreatitis has subsided.",
          "created_utc": 1734131054.0
        }
      ]
    },
    {
      "id": "m21jhh1",
      "author": "brandielynng29",
      "body": "Yes my doctors and I are working closely together I’m on fish oil supplements to help try lowering them. I’m also not active but I’m hoping to get a puppy next year and become more active",
      "created_utc": 1734197428.0,
      "score": 1,
      "context": [
        {
          "id": "m21izw0",
          "author": "brandielynng29",
          "body": "As a type 2 diabetic and someone with ARFID. I too struggled with my eating and suffered from DKA and Pancreatitis back in May of 2021. It was scary. My diet still hasn’t changed completely but I’m in recovery for the ARFID. My triglycerides are still elevated but i dont know what else to do because my safe foods consist of high carb foods",
          "created_utc": 1734197261.0
        },
        {
          "id": "m21j8m7",
          "author": "canadave_nyc",
          "body": "Sorry to hear about your struggles.\n\nHave you spoken to your doctor about your high triglycerides? There is medication to lower them significantly, such as fenofibrates.",
          "created_utc": 1734197343.0
        }
      ]
    },
    {
      "id": "m1x8j8e",
      "author": "SecretSquirrelSpot",
      "body": "Well you don’t want to overpower the sauce with veggies but here is a link of what I use [steam fresh veggies](https://www.iceland.co.uk/p/birds-eye-steamfresh-4-family-favourites-steam-bags-540g/57297.html?&utm_source=google&utm_medium=cpc&utm_campaign=Iceland+%7C+Generic+%7C+Performance+Max+%7C+Frozen&utm_term=&utm_content=&source=ppc&gad_source=1&gbraid=0AAAAADpNH_3eks2H6t95vRCfdnJImpb5n&gclid=Cj0KCQiA0--6BhCBARIsADYqyL9xPiMVmTi8aOpi3SYg-689ZL0WggKysXHwVPepfoDqMacInqL3IiwaAhh3EALw_wcB&gclsrc=aw.ds)\n\nThey are frozen sealed bags of veg that you microwave until they puff up a bit like a popcorn bag. The benefit of which is that you’re not boiling away the nutrients. Each bag is approximately 135-150g \n\nDolmio, as you have seen is a jar of tomato based sauce typically with basil, onions and a few other random bits of veg [dolmio](https://www.waitrose.com/ecom/products/dolmio-bolognese-original-sauce/017320-8362-8363?gad_source=1&gbraid=0AAAAADnhuuVGrhr5SUS5tsraNWj8p-EKa&gclid=Cj0KCQiA0--6BhCBARIsADYqyL9sjTytloyCIxkIaizaf6q0fGrcwMVz3HxmYhAvQkowGgR6NbMLjS8aAjuMEALw_wcB&gclsrc=aw.ds) they come in 500g jars but already have a decent amount of veg in them too.\n\nYou can add extra “pizza” flavour in there like oregano but I don’t really like oregano personally. \n\nI know it’s not a lot of veg per serving, but when you think that it’s more than you’re currently eating, and if you eat pizzas a lot, it will add up over time.\n\nThink about those programmes that show how much sugar you eat over a year if you have 1 can of coke a day. If you eat many pizzas, by the end of the year you may have eaten the equivalent of 25 broccolis, 150 carrots and 10 tins of sweetcorn. Just saying, it all adds up.",
      "created_utc": 1734125486.0,
      "score": 6,
      "context": [
        {
          "id": "m1wqa9l",
          "author": "acidinbath",
          "body": "we have the exact same sounding diet and this is something that stressed me out SO MUCH i just live off of pizza and pasta and packs of crisps and can feel how weak im becoming , i feel sick all the time and i wanna change but i just hate food so much i dont wanna start trying to fix my shit diet .",
          "created_utc": 1734119490.0
        },
        {
          "id": "m1wuard",
          "author": "SecretSquirrelSpot",
          "body": "A tip for pizzas if you want to try it. Get a base, any kind you like, I use the naan breads from Costco, and then make your own sauce with hidden veggies. I use 1 packet of steam fresh veggies (the microwave ones) which has a small amount of sweetcorn, broccoli and carrots, I blend it to small chunks, add in a jar of dolmio and blend it again until smooth. Then I put it in an ice cube tray and freeze it. Then whenever I want a pizza I use 2 small cubes (defrost in the microwave in a mug for like 50 secs until it’s spreadable) add the cheese (pre grated mozzarella bag from Costco also - which I freeze also) and then bake as usual for like 10 mins.\n\nExtra veggies that you genuinely cannot taste. It all adds up bit by bit when you hide it from yourself.",
          "created_utc": 1734120794.0
        },
        {
          "id": "m1wyaay",
          "author": "canadave_nyc",
          "body": "I've never heard of half the things you mentioned :) I looked up Dolmio--okay, gotcha, sauce. What is a packet of steam fresh veggies (the microwave ones)?\n\nAnd just so I'm clear--your ratio is one packet to one full jar of sauce? It seems like that would be very little vegetable content per pizza (unless I'm misinterpreting how large \"a packet\" is). But I'm willing (would love to) to be convinced!",
          "created_utc": 1734122108.0
        }
      ]
    },
    {
      "id": "m1x91q0",
      "author": "canadave_nyc",
      "body": "Let's put it this way--if you were stranded on a desert island, and a food crate with all the foods you \"cannot improve enough to eat\" came ashore, and it was a choice between eating them or starving to death while staring at the crate of food...I'm betting we'd all find a way to eat the food. We may gag, retch, vomit, whatever, but we'd find a way. So by definition that means there's always \"room for improvement.\" The real question is how to improve in a way that works sustainably for each of us, doesn't make us want to vomit, etc.\n\nFor some it's harder than others. I've never eaten vegetables in my life before and the mere idea makes me want to vomit. I can't imagine anyone being worse than that. My plan is to try to find some ways to eat tiny, tiny amounts--like crumb-sized--to start with, and go from there. I also plan to try to drench the vegetables in some kind of spice mix I like, to try to overwhelm the taste. There are always things to try. This group itself has some very helpful suggestions. Again--small steps, not big ones. I wound up being able to eat brown rice after not being able to for some time, because I could only stomach white rice. Brown rice was at least close enough that I could make the incremental step of trying to expand by diet by that tiny small amount.\n\nSomeone also recommended the Picky Eater's Recovery Book (https://www.amazon.ca/Picky-Eaters-Recovery-Book-Restrictive/dp/1108796176), which is written by clinicians and seems to have some great advice that I haven't fully delved into yet.",
      "created_utc": 1734125656.0,
      "score": 3,
      "context": [
        {
          "id": "m1wva2j",
          "author": "jizzyjazz2",
          "body": "how would someone even go about modifying their diet to prevent something like this if they're extremely limited, like me for instance? it kinda just feels like fate to me",
          "created_utc": 1734121117.0
        },
        {
          "id": "m1wwis1",
          "author": "canadave_nyc",
          "body": "See the rest of my replies in this thread :) As well as my original post about ways I modified my diet slightly.",
          "created_utc": 1734121527.0
        },
        {
          "id": "m1x7hj5",
          "author": "jizzyjazz2",
          "body": "that's assuming you *can* modify it though. what if there's no room for improvement?",
          "created_utc": 1734125136.0
        }
      ]
    },
    {
      "id": "m1xtyfm",
      "author": "canadave_nyc",
      "body": "Thank you...If by posting my story even one person such as yourself is able to make some changes to improve their long-term health prospects, that's music to my ears. Best of luck to you! Remember, make small changes, incremental, and they hopefully add up. I wish I'd known sooner, because some of these simple changes are so, so easy to make--eating fish and chicken for dinner instead of burgers and pizza every night, for example.",
      "created_utc": 1734133043.0,
      "score": 3,
      "context": [
        {
          "id": "m1xo8oq",
          "author": "Affectionate_Face557",
          "body": "If you don't mind sharing the specifics of your bowel \"changes\" I'd appreciate it since I could have written your post (although I do eat cooked carrots and salads) \nI'm terrified of pancreatitis and am looking to eat healthier at the start of new year.\nMy bowel habits are def on my radar bc of my family history of colon cancer. \nIf you'd rather not share that info it's ok. I respect that.",
          "created_utc": 1734130882.0
        },
        {
          "id": "m1xopf9",
          "author": "canadave_nyc",
          "body": "No worries. My bowel habits were always very irritable--lots of loose stool, diarrhea after especially fatty meals, etc. But I never had trouble going to the bathroom. \n\nWhat I found was over the course of a month, I began producing less and less stool. By the end of the month, I was hardly producing any stool at all--pretty much zero, even after eating. At the same time, I started feeling vaguely \"off\"--just generally unwell, nothing I could pinpoint really, but I knew something wasn't right. Soon after that, my pancreatitis hit. I'm still struggling with that now, even after the pancreatitis has subsided.",
          "created_utc": 1734131054.0
        },
        {
          "id": "m1xsrbg",
          "author": "Affectionate_Face557",
          "body": "Ah ok, I see. I'm so sorry that you had to experience this but I congratulate you on your courage to make this major change in your eating habits. You've prob extended your life if not actually saved it. \nYou've inspired me (scared straight  😅) and given me the motivation I need to make this change also. Thank you so much.",
          "created_utc": 1734132583.0
        }
      ]
    },
    {
      "id": "m1x9hvw",
      "author": "canadave_nyc",
      "body": "Thanks! This is very helpful, will look at doing this.",
      "created_utc": 1734125806.0,
      "score": 3,
      "context": [
        {
          "id": "m1wqa9l",
          "author": "acidinbath",
          "body": "we have the exact same sounding diet and this is something that stressed me out SO MUCH i just live off of pizza and pasta and packs of crisps and can feel how weak im becoming , i feel sick all the time and i wanna change but i just hate food so much i dont wanna start trying to fix my shit diet .",
          "created_utc": 1734119490.0
        },
        {
          "id": "m1wuard",
          "author": "SecretSquirrelSpot",
          "body": "A tip for pizzas if you want to try it. Get a base, any kind you like, I use the naan breads from Costco, and then make your own sauce with hidden veggies. I use 1 packet of steam fresh veggies (the microwave ones) which has a small amount of sweetcorn, broccoli and carrots, I blend it to small chunks, add in a jar of dolmio and blend it again until smooth. Then I put it in an ice cube tray and freeze it. Then whenever I want a pizza I use 2 small cubes (defrost in the microwave in a mug for like 50 secs until it’s spreadable) add the cheese (pre grated mozzarella bag from Costco also - which I freeze also) and then bake as usual for like 10 mins.\n\nExtra veggies that you genuinely cannot taste. It all adds up bit by bit when you hide it from yourself.",
          "created_utc": 1734120794.0
        },
        {
          "id": "m1wyaay",
          "author": "canadave_nyc",
          "body": "I've never heard of half the things you mentioned :) I looked up Dolmio--okay, gotcha, sauce. What is a packet of steam fresh veggies (the microwave ones)?\n\nAnd just so I'm clear--your ratio is one packet to one full jar of sauce? It seems like that would be very little vegetable content per pizza (unless I'm misinterpreting how large \"a packet\" is). But I'm willing (would love to) to be convinced!",
          "created_utc": 1734122108.0
        },
        {
          "id": "m1x8j8e",
          "author": "SecretSquirrelSpot",
          "body": "Well you don’t want to overpower the sauce with veggies but here is a link of what I use [steam fresh veggies](https://www.iceland.co.uk/p/birds-eye-steamfresh-4-family-favourites-steam-bags-540g/57297.html?&utm_source=google&utm_medium=cpc&utm_campaign=Iceland+%7C+Generic+%7C+Performance+Max+%7C+Frozen&utm_term=&utm_content=&source=ppc&gad_source=1&gbraid=0AAAAADpNH_3eks2H6t95vRCfdnJImpb5n&gclid=Cj0KCQiA0--6BhCBARIsADYqyL9xPiMVmTi8aOpi3SYg-689ZL0WggKysXHwVPepfoDqMacInqL3IiwaAhh3EALw_wcB&gclsrc=aw.ds)\n\nThey are frozen sealed bags of veg that you microwave until they puff up a bit like a popcorn bag. The benefit of which is that you’re not boiling away the nutrients. Each bag is approximately 135-150g \n\nDolmio, as you have seen is a jar of tomato based sauce typically with basil, onions and a few other random bits of veg [dolmio](https://www.waitrose.com/ecom/products/dolmio-bolognese-original-sauce/017320-8362-8363?gad_source=1&gbraid=0AAAAADnhuuVGrhr5SUS5tsraNWj8p-EKa&gclid=Cj0KCQiA0--6BhCBARIsADYqyL9sjTytloyCIxkIaizaf6q0fGrcwMVz3HxmYhAvQkowGgR6NbMLjS8aAjuMEALw_wcB&gclsrc=aw.ds) they come in 500g jars but already have a decent amount of veg in them too.\n\nYou can add extra “pizza” flavour in there like oregano but I don’t really like oregano personally. \n\nI know it’s not a lot of veg per serving, but when you think that it’s more than you’re currently eating, and if you eat pizzas a lot, it will add up over time.\n\nThink about those programmes that show how much sugar you eat over a year if you have 1 can of coke a day. If you eat many pizzas, by the end of the year you may have eaten the equivalent of 25 broccolis, 150 carrots and 10 tins of sweetcorn. Just saying, it all adds up.",
          "created_utc": 1734125486.0
        }
      ]
    },
    {
      "id": "m1xlazw",
      "author": "jizzyjazz2",
      "body": "i'm glad things work out for you that way. all due respect, i've heard that improvement strategy many times before, and i've been down that road many times along my journey, and it just doesn't really work for me personally. but i've still got a long way to go until i'm your age, OP. i'm open to being pleasantly surprised one day, although i don't expect it",
      "created_utc": 1734129822.0,
      "score": 7,
      "context": [
        {
          "id": "m1wva2j",
          "author": "jizzyjazz2",
          "body": "how would someone even go about modifying their diet to prevent something like this if they're extremely limited, like me for instance? it kinda just feels like fate to me",
          "created_utc": 1734121117.0
        },
        {
          "id": "m1wwis1",
          "author": "canadave_nyc",
          "body": "See the rest of my replies in this thread :) As well as my original post about ways I modified my diet slightly.",
          "created_utc": 1734121527.0
        },
        {
          "id": "m1x7hj5",
          "author": "jizzyjazz2",
          "body": "that's assuming you *can* modify it though. what if there's no room for improvement?",
          "created_utc": 1734125136.0
        },
        {
          "id": "m1x91q0",
          "author": "canadave_nyc",
          "body": "Let's put it this way--if you were stranded on a desert island, and a food crate with all the foods you \"cannot improve enough to eat\" came ashore, and it was a choice between eating them or starving to death while staring at the crate of food...I'm betting we'd all find a way to eat the food. We may gag, retch, vomit, whatever, but we'd find a way. So by definition that means there's always \"room for improvement.\" The real question is how to improve in a way that works sustainably for each of us, doesn't make us want to vomit, etc.\n\nFor some it's harder than others. I've never eaten vegetables in my life before and the mere idea makes me want to vomit. I can't imagine anyone being worse than that. My plan is to try to find some ways to eat tiny, tiny amounts--like crumb-sized--to start with, and go from there. I also plan to try to drench the vegetables in some kind of spice mix I like, to try to overwhelm the taste. There are always things to try. This group itself has some very helpful suggestions. Again--small steps, not big ones. I wound up being able to eat brown rice after not being able to for some time, because I could only stomach white rice. Brown rice was at least close enough that I could make the incremental step of trying to expand by diet by that tiny small amount.\n\nSomeone also recommended the Picky Eater's Recovery Book (https://www.amazon.ca/Picky-Eaters-Recovery-Book-Restrictive/dp/1108796176), which is written by clinicians and seems to have some great advice that I haven't fully delved into yet.",
          "created_utc": 1734125656.0
        }
      ]
    },
    {
      "id": "m21lndg",
      "author": "3cubedisnot27",
      "body": "I'm genuinely not upset at you about this, but a significant proportion of people would (and in cases, have) starved to death instead of eating the food. Im not disagreeing with anything else youre saying, just correcting that bit.",
      "created_utc": 1734198165.0,
      "score": 4,
      "context": [
        {
          "id": "m1wva2j",
          "author": "jizzyjazz2",
          "body": "how would someone even go about modifying their diet to prevent something like this if they're extremely limited, like me for instance? it kinda just feels like fate to me",
          "created_utc": 1734121117.0
        },
        {
          "id": "m1wwis1",
          "author": "canadave_nyc",
          "body": "See the rest of my replies in this thread :) As well as my original post about ways I modified my diet slightly.",
          "created_utc": 1734121527.0
        },
        {
          "id": "m1x7hj5",
          "author": "jizzyjazz2",
          "body": "that's assuming you *can* modify it though. what if there's no room for improvement?",
          "created_utc": 1734125136.0
        },
        {
          "id": "m1x91q0",
          "author": "canadave_nyc",
          "body": "Let's put it this way--if you were stranded on a desert island, and a food crate with all the foods you \"cannot improve enough to eat\" came ashore, and it was a choice between eating them or starving to death while staring at the crate of food...I'm betting we'd all find a way to eat the food. We may gag, retch, vomit, whatever, but we'd find a way. So by definition that means there's always \"room for improvement.\" The real question is how to improve in a way that works sustainably for each of us, doesn't make us want to vomit, etc.\n\nFor some it's harder than others. I've never eaten vegetables in my life before and the mere idea makes me want to vomit. I can't imagine anyone being worse than that. My plan is to try to find some ways to eat tiny, tiny amounts--like crumb-sized--to start with, and go from there. I also plan to try to drench the vegetables in some kind of spice mix I like, to try to overwhelm the taste. There are always things to try. This group itself has some very helpful suggestions. Again--small steps, not big ones. I wound up being able to eat brown rice after not being able to for some time, because I could only stomach white rice. Brown rice was at least close enough that I could make the incremental step of trying to expand by diet by that tiny small amount.\n\nSomeone also recommended the Picky Eater's Recovery Book (https://www.amazon.ca/Picky-Eaters-Recovery-Book-Restrictive/dp/1108796176), which is written by clinicians and seems to have some great advice that I haven't fully delved into yet.",
          "created_utc": 1734125656.0
        }
      ]
    },
    {
      "id": "m23ey22",
      "author": "mykineticromance",
      "body": "if you like garlicky mashed potatoes, mashed cauliflower with garlic might be a good thing to try, or like half mashed potatoes and half mashed cauliflower. If you have a food processor or immersion blender you can get the texture pretty close to mashed potatoes and the garlic butter flavors will cover up the cauliflower flavor. Cauliflower does have a slight vegetable flavor, but is milder than say broccoli. It's also a little less starchy/creamy and a little more watery texture than mashed potatoes, but is decent, especially if you have it as a side dish to a main meat.",
      "created_utc": 1734221530.0,
      "score": 1,
      "context": [
        {
          "id": "m1wva2j",
          "author": "jizzyjazz2",
          "body": "how would someone even go about modifying their diet to prevent something like this if they're extremely limited, like me for instance? it kinda just feels like fate to me",
          "created_utc": 1734121117.0
        },
        {
          "id": "m1wwis1",
          "author": "canadave_nyc",
          "body": "See the rest of my replies in this thread :) As well as my original post about ways I modified my diet slightly.",
          "created_utc": 1734121527.0
        },
        {
          "id": "m1x7hj5",
          "author": "jizzyjazz2",
          "body": "that's assuming you *can* modify it though. what if there's no room for improvement?",
          "created_utc": 1734125136.0
        },
        {
          "id": "m1x91q0",
          "author": "canadave_nyc",
          "body": "Let's put it this way--if you were stranded on a desert island, and a food crate with all the foods you \"cannot improve enough to eat\" came ashore, and it was a choice between eating them or starving to death while staring at the crate of food...I'm betting we'd all find a way to eat the food. We may gag, retch, vomit, whatever, but we'd find a way. So by definition that means there's always \"room for improvement.\" The real question is how to improve in a way that works sustainably for each of us, doesn't make us want to vomit, etc.\n\nFor some it's harder than others. I've never eaten vegetables in my life before and the mere idea makes me want to vomit. I can't imagine anyone being worse than that. My plan is to try to find some ways to eat tiny, tiny amounts--like crumb-sized--to start with, and go from there. I also plan to try to drench the vegetables in some kind of spice mix I like, to try to overwhelm the taste. There are always things to try. This group itself has some very helpful suggestions. Again--small steps, not big ones. I wound up being able to eat brown rice after not being able to for some time, because I could only stomach white rice. Brown rice was at least close enough that I could make the incremental step of trying to expand by diet by that tiny small amount.\n\nSomeone also recommended the Picky Eater's Recovery Book (https://www.amazon.ca/Picky-Eaters-Recovery-Book-Restrictive/dp/1108796176), which is written by clinicians and seems to have some great advice that I haven't fully delved into yet.",
          "created_utc": 1734125656.0
        }
      ]
    },
    {
      "id": "m1xmcoa",
      "author": "canadave_nyc",
      "body": "I'm genuinely sorry to hear that. It sounds like you might benefit from being in a clinic for eating disorders (or getting an appointment to see a doctor from one) if you're having that much difficulty. I know I'm having a great deal of difficulty with vegetables--I by no means meant to imply that it works out for me, because I haven't even tried it yet for those.\n\nBut I mean, there's only two choices for us, right? One choice is to give up trying to fix it, and just live with it. That's fine, if that's what you want to do--no judgments from me! :) The other choice is to do whatever it takes to try to get it fixed--if you've tried one improvement strategy and it doesn't work, then keep trying other ones; if you run out, then speak to a doctor; if the doctor can't help, try another doctor; if no one can help, reach out to this subreddit; if no one on this subreddit can help, contact every eating disorder hospital and explain what your situation is and ask for help; etc etc etc etc etc. Like, it's really a choice between just giving up and trying something else, anything else.",
      "created_utc": 1734130195.0,
      "score": 4,
      "context": [
        {
          "id": "m1wva2j",
          "author": "jizzyjazz2",
          "body": "how would someone even go about modifying their diet to prevent something like this if they're extremely limited, like me for instance? it kinda just feels like fate to me",
          "created_utc": 1734121117.0
        },
        {
          "id": "m1wwis1",
          "author": "canadave_nyc",
          "body": "See the rest of my replies in this thread :) As well as my original post about ways I modified my diet slightly.",
          "created_utc": 1734121527.0
        },
        {
          "id": "m1x7hj5",
          "author": "jizzyjazz2",
          "body": "that's assuming you *can* modify it though. what if there's no room for improvement?",
          "created_utc": 1734125136.0
        },
        {
          "id": "m1x91q0",
          "author": "canadave_nyc",
          "body": "Let's put it this way--if you were stranded on a desert island, and a food crate with all the foods you \"cannot improve enough to eat\" came ashore, and it was a choice between eating them or starving to death while staring at the crate of food...I'm betting we'd all find a way to eat the food. We may gag, retch, vomit, whatever, but we'd find a way. So by definition that means there's always \"room for improvement.\" The real question is how to improve in a way that works sustainably for each of us, doesn't make us want to vomit, etc.\n\nFor some it's harder than others. I've never eaten vegetables in my life before and the mere idea makes me want to vomit. I can't imagine anyone being worse than that. My plan is to try to find some ways to eat tiny, tiny amounts--like crumb-sized--to start with, and go from there. I also plan to try to drench the vegetables in some kind of spice mix I like, to try to overwhelm the taste. There are always things to try. This group itself has some very helpful suggestions. Again--small steps, not big ones. I wound up being able to eat brown rice after not being able to for some time, because I could only stomach white rice. Brown rice was at least close enough that I could make the incremental step of trying to expand by diet by that tiny small amount.\n\nSomeone also recommended the Picky Eater's Recovery Book (https://www.amazon.ca/Picky-Eaters-Recovery-Book-Restrictive/dp/1108796176), which is written by clinicians and seems to have some great advice that I haven't fully delved into yet.",
          "created_utc": 1734125656.0
        },
        {
          "id": "m1xlazw",
          "author": "jizzyjazz2",
          "body": "i'm glad things work out for you that way. all due respect, i've heard that improvement strategy many times before, and i've been down that road many times along my journey, and it just doesn't really work for me personally. but i've still got a long way to go until i'm your age, OP. i'm open to being pleasantly surprised one day, although i don't expect it",
          "created_utc": 1734129822.0
        }
      ]
    },
    {
      "id": "m23936m",
      "author": "jizzyjazz2",
      "body": "that's all i could think about, lol. i would totally starve to death next to a box of unsafe food",
      "created_utc": 1734219262.0,
      "score": 8,
      "context": [
        {
          "id": "m1wva2j",
          "author": "jizzyjazz2",
          "body": "how would someone even go about modifying their diet to prevent something like this if they're extremely limited, like me for instance? it kinda just feels like fate to me",
          "created_utc": 1734121117.0
        },
        {
          "id": "m1wwis1",
          "author": "canadave_nyc",
          "body": "See the rest of my replies in this thread :) As well as my original post about ways I modified my diet slightly.",
          "created_utc": 1734121527.0
        },
        {
          "id": "m1x7hj5",
          "author": "jizzyjazz2",
          "body": "that's assuming you *can* modify it though. what if there's no room for improvement?",
          "created_utc": 1734125136.0
        },
        {
          "id": "m1x91q0",
          "author": "canadave_nyc",
          "body": "Let's put it this way--if you were stranded on a desert island, and a food crate with all the foods you \"cannot improve enough to eat\" came ashore, and it was a choice between eating them or starving to death while staring at the crate of food...I'm betting we'd all find a way to eat the food. We may gag, retch, vomit, whatever, but we'd find a way. So by definition that means there's always \"room for improvement.\" The real question is how to improve in a way that works sustainably for each of us, doesn't make us want to vomit, etc.\n\nFor some it's harder than others. I've never eaten vegetables in my life before and the mere idea makes me want to vomit. I can't imagine anyone being worse than that. My plan is to try to find some ways to eat tiny, tiny amounts--like crumb-sized--to start with, and go from there. I also plan to try to drench the vegetables in some kind of spice mix I like, to try to overwhelm the taste. There are always things to try. This group itself has some very helpful suggestions. Again--small steps, not big ones. I wound up being able to eat brown rice after not being able to for some time, because I could only stomach white rice. Brown rice was at least close enough that I could make the incremental step of trying to expand by diet by that tiny small amount.\n\nSomeone also recommended the Picky Eater's Recovery Book (https://www.amazon.ca/Picky-Eaters-Recovery-Book-Restrictive/dp/1108796176), which is written by clinicians and seems to have some great advice that I haven't fully delved into yet.",
          "created_utc": 1734125656.0
        },
        {
          "id": "m21lndg",
          "author": "3cubedisnot27",
          "body": "I'm genuinely not upset at you about this, but a significant proportion of people would (and in cases, have) starved to death instead of eating the food. Im not disagreeing with anything else youre saying, just correcting that bit.",
          "created_utc": 1734198165.0
        }
      ]
    }
  ]
}