{
  "id": "1hej400",
  "subreddit": "ARFID",
  "author": "i_am_confused00",
  "created_utc": 1734230543.0,
  "title": "the picky eater’s recovery book: closing thoughts",
  "selftext": "i just finished reading the picky eater’s recovery book! i just have to restate, this book is an incredible tool for anyone with ARFID. it’s super accessible to read and breaks every step of treatment down perfectly. i can’t overstate how excited i am that information like this is so widely accessible. i was delighted to see the authors address body image concerns as well, because even though ARFID doesn’t require them to be diagnosed, it’s still very possible to experience it!!\n\nBUT, i have two critiques:\n\none, the authors frequently use BMI as a tool/point of interest in their ARFID treatment. while i understand that weight is an important factor in ARFID, especially for those who need to gain weight, i was a little disappointed to see it in this book. BMI is just such an old formula that is frequently inaccurate, and it’s used too often in diet culture for me to think about using it on myself. IMO, weight gain/loss deserved a more nuanced take in this book if the authors couldn’t address it without using BMI\n\nsecond, they use myplate as a reference for a “normal” meal. they do address that a “normal” meal can look different for everyone, but again, it’s too rooted in diet culture to be included in this book for my tastes. for me, myplate was a frequent reminder in my childhood that i couldn’t eat “normally,” and using it as a guide for my meals feels icky. obviously this isn’t the same for everyone, but personally i wish the authors didn’t include it in this book. \n\nif you read all the way, thank you! i just wanted to word dump my final thoughts. all in all, this book still gets 5 stars. even though i’ve been in treatment for years, i still got some use out of it, and i recommend it wholeheartedly!!",
  "url": "https://www.reddit.com/r/ARFID/comments/1hej400/the_picky_eaters_recovery_book_closing_thoughts/",
  "score": 93,
  "num_comments": 17,
  "comments": [
    {
      "id": "m24gahu",
      "author": "heartoffiction",
      "body": "From this sub it seems like it’s pretty 50/50 on malnourished and underweight vs overweight with a binge eating disorder lol. I fall in the second category so good to know this book would be pretty useless for me",
      "created_utc": 1734237186.0,
      "score": 41,
      "context": []
    },
    {
      "id": "m2439py",
      "author": "Conscious_Town_1454",
      "body": "thank you! this book has been sitting on my nightstand but adhd keeps putting it off. this makes me excited to finally get around to it",
      "created_utc": 1734231321.0,
      "score": 16,
      "context": []
    },
    {
      "id": "m24x5ij",
      "author": "sayorihanginaround",
      "body": "my mom read that book after i was first diagnosed with arfid. i know its not like literal but i was a little bit \"ehh\" about it being called the \"picky eater\" recovery book",
      "created_utc": 1734246141.0,
      "score": 12,
      "context": []
    },
    {
      "id": "m24mue9",
      "author": "TashaT50",
      "body": "Thanks for coming back to update on the book. I’m glad you found it helpful. I’m still aiming for starting over again in January.\n\nI loathe BMI. It’s been proven it’s inaccurate as a measure of someone’s health. Medical organizations are suggesting a number of [additional factors](https://www.ama-assn.org/press-center/press-releases/ama-adopts-new-policy-clarifying-role-bmi-measure-medicine) should be taken into account but doctors are frequently behind on new standards.\n\nI don’t think I’ve heard of myplate but taking a quick look this could definitely set me back in making forward progress if I came across this too soon. It was called something else in the 70s-80s. It’s also one of those things where therapy might be needed in the same way I know if I’m going to tackle adding certain foods I’ll need therapy before and while I’m trying to move them from PTSD/auto vomit to safe foods.\n\nThanks again.\n\nEdited to fix grammar",
      "created_utc": 1734240396.0,
      "score": 6,
      "context": []
    },
    {
      "id": "m244ksj",
      "author": "hannibe",
      "body": "I haaated this book. The first recommendation is to eat more- I DO NOT NEED TO EAT MORE, I AM TOO FAT. I threw it across the room and never opened it again. I don’t know if anything else was useful in there because there’s no way I’m letting myself get fatter for any reason.",
      "created_utc": 1734231869.0,
      "score": 34,
      "context": []
    },
    {
      "id": "m24kj4t",
      "author": "asleepingotter",
      "body": "Commenting so I remember to read this",
      "created_utc": 1734239227.0,
      "score": 5,
      "context": []
    },
    {
      "id": "m25fkdo",
      "author": "impsythealmighty",
      "body": "Would you say it’d be helpful for a parent to read for an arfid diagnosed child? Or is it really meant for self help?",
      "created_utc": 1734258517.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m26t6o5",
      "author": "soft_seraphim",
      "body": "BMI is only bad if you have a lot of muscles and therefore a lot of weight. Basically it's bad if you're frequently at the gym and gaining mass. I doubt people with ARFID are those people.",
      "created_utc": 1734281280.0,
      "score": -2,
      "context": []
    },
    {
      "id": "m26x048",
      "author": "i_am_confused00",
      "body": "it’s not entirely useless, i think. depending on your subtype, there’s still plenty of info to use. personally, i experience the sensory issue ARFID flavor, and they detail how to break down food exposures in the exact same way i do them with my therapist. i’d just say that if you’re going to read it, take the first chapters with a grain of salt.",
      "created_utc": 1734282557.0,
      "score": 7,
      "context": [
        {
          "id": "m24gahu",
          "author": "heartoffiction",
          "body": "From this sub it seems like it’s pretty 50/50 on malnourished and underweight vs overweight with a binge eating disorder lol. I fall in the second category so good to know this book would be pretty useless for me",
          "created_utc": 1734237186.0
        }
      ]
    },
    {
      "id": "m26xrrw",
      "author": "Selphie12",
      "body": "Same here! It's on my tbr pile behind the 3 books on my borrowbox account, the 5 novels on my desk and (perhaps ironically) How To ADHD's new book.",
      "created_utc": 1734282805.0,
      "score": 3,
      "context": [
        {
          "id": "m2439py",
          "author": "Conscious_Town_1454",
          "body": "thank you! this book has been sitting on my nightstand but adhd keeps putting it off. this makes me excited to finally get around to it",
          "created_utc": 1734231321.0
        }
      ]
    },
    {
      "id": "m27pl36",
      "author": "i_am_confused00",
      "body": "this! BMI is just too simple to adequately gauge anything about health.",
      "created_utc": 1734291617.0,
      "score": 1,
      "context": [
        {
          "id": "m24mue9",
          "author": "TashaT50",
          "body": "Thanks for coming back to update on the book. I’m glad you found it helpful. I’m still aiming for starting over again in January.\n\nI loathe BMI. It’s been proven it’s inaccurate as a measure of someone’s health. Medical organizations are suggesting a number of [additional factors](https://www.ama-assn.org/press-center/press-releases/ama-adopts-new-policy-clarifying-role-bmi-measure-medicine) should be taken into account but doctors are frequently behind on new standards.\n\nI don’t think I’ve heard of myplate but taking a quick look this could definitely set me back in making forward progress if I came across this too soon. It was called something else in the 70s-80s. It’s also one of those things where therapy might be needed in the same way I know if I’m going to tackle adding certain foods I’ll need therapy before and while I’m trying to move them from PTSD/auto vomit to safe foods.\n\nThanks again.\n\nEdited to fix grammar",
          "created_utc": 1734240396.0
        }
      ]
    },
    {
      "id": "m245oog",
      "author": "i_am_confused00",
      "body": "that’s another thing that threw me off. being underweight is of course a valid concern for many with ARFID and they dedicated multiple sections to it, but their references to overweight ARFID are almost vague? i’m also probably “overweight” because of my ARFID (quotations because i haven’t checked my weight in years and don’t want to), and i was disappointed by their lack of discussion about it. i wish they had an explicit section about being overweight with ARFID, it would’ve made the book much more well-rounded",
      "created_utc": 1734232354.0,
      "score": 17,
      "context": [
        {
          "id": "m244ksj",
          "author": "hannibe",
          "body": "I haaated this book. The first recommendation is to eat more- I DO NOT NEED TO EAT MORE, I AM TOO FAT. I threw it across the room and never opened it again. I don’t know if anything else was useful in there because there’s no way I’m letting myself get fatter for any reason.",
          "created_utc": 1734231869.0
        }
      ]
    },
    {
      "id": "m24chlj",
      "author": "TrentKama",
      "body": "I think the book is kind of formatted poorly.\n\nIt's trying to explain the multiple ways ARFID manifests at the start, and then encourages you to skip to the specific chapters in Section 3 that fit your personal case the best. The worksheets are scattered through the document(though you can [find these online](https://www.cambridge.org/ca/universitypress/subjects/medicine/mental-health-psychiatry-and-clinical-psychology/picky-eaters-recovery-book-overcoming-avoidantrestrictive-food-intake-disorder?format=PB&isbn=9781108796170)).\n\nI'm kinda in the same boat here as I'd fall under the 'Fear of Aversive Consequences' section(which I have also failed to read yet due to lack of motivation). I can understand the 'eat more' sections being frustrating and triggering, but I'd just skip over the parts dealing with being underweight.",
      "created_utc": 1734235410.0,
      "score": 11,
      "context": [
        {
          "id": "m244ksj",
          "author": "hannibe",
          "body": "I haaated this book. The first recommendation is to eat more- I DO NOT NEED TO EAT MORE, I AM TOO FAT. I threw it across the room and never opened it again. I don’t know if anything else was useful in there because there’s no way I’m letting myself get fatter for any reason.",
          "created_utc": 1734231869.0
        }
      ]
    },
    {
      "id": "m251puz",
      "author": "throw0OO0away",
      "body": "\"Eat more\"\n\nThis is not the way, especially for those with GI issues. I was pretty much told to \"eat more\" and people kept giving food to me. It didn't work and I ended up with an NG. GI issues are niche and eating more will not solve said GI issues. You must have a medical team to find a plan that works for you. You have to know your trigger foods. You have to control symptoms and treat the condition. Eating more can make GI issues worse and cause more aversions.",
      "created_utc": 1734249093.0,
      "score": 9,
      "context": [
        {
          "id": "m244ksj",
          "author": "hannibe",
          "body": "I haaated this book. The first recommendation is to eat more- I DO NOT NEED TO EAT MORE, I AM TOO FAT. I threw it across the room and never opened it again. I don’t know if anything else was useful in there because there’s no way I’m letting myself get fatter for any reason.",
          "created_utc": 1734231869.0
        }
      ]
    },
    {
      "id": "m24ju6c",
      "author": "TashaT50",
      "body": "Yeah they mention the overweight component in passing but I had a similar problem as I’m overweight and in the section on diagnosis they only include underweight. Which means in the diagnosis section if one is overweight the diagnosis says nope not ARFID which conflicts with what they say earlier. \n\nSome of the changing eating habits focuses on eating regularly and a normal portion size but because it’s focusing on people needing to gain weight only it’s frustrating. They should have separate section on the changing your eating habits for those who are overweight which is as compassionate as the rest of the book is. While I found it frustrating I got enough from it and figured out what steps I needed to take on my own based around their goals. I need to change my grazing to regular snack times, force myself to do regular mealtimes, and choose more of my healthier safe foods for snacks. But at 57 that’s pretty obvious - how to do that is harder and while I can apply some of their advice trying to pick out what’s useful and what isn’t requires having a fair amount of knowledge and not finding the guidance triggering.",
      "created_utc": 1734238885.0,
      "score": 5,
      "context": [
        {
          "id": "m244ksj",
          "author": "hannibe",
          "body": "I haaated this book. The first recommendation is to eat more- I DO NOT NEED TO EAT MORE, I AM TOO FAT. I threw it across the room and never opened it again. I don’t know if anything else was useful in there because there’s no way I’m letting myself get fatter for any reason.",
          "created_utc": 1734231869.0
        }
      ]
    },
    {
      "id": "m26tih1",
      "author": "i_am_confused00",
      "body": "its more aimed towards adults with ARFID, since there’s already many resources out there for parents",
      "created_utc": 1734281389.0,
      "score": 1,
      "context": [
        {
          "id": "m25fkdo",
          "author": "impsythealmighty",
          "body": "Would you say it’d be helpful for a parent to read for an arfid diagnosed child? Or is it really meant for self help?",
          "created_utc": 1734258517.0
        }
      ]
    },
    {
      "id": "m27p8yn",
      "author": "i_am_confused00",
      "body": "not exactly. BMI is super outdated and its basis was coined in 1830-1850. the formula kg/m^2 , in my opinion, is nowhere near complex enough to calculate “obesity.” the human body is multidimensional, and two variables just isn’t enough. and, interestingly but not surprisingly, the origins of BMI are kinda racist! the guy who invented it was an old white man, who only tested it on other white men. so yeah, i consider BMI to be very inadequate",
      "created_utc": 1734291510.0,
      "score": 2,
      "context": [
        {
          "id": "m26t6o5",
          "author": "soft_seraphim",
          "body": "BMI is only bad if you have a lot of muscles and therefore a lot of weight. Basically it's bad if you're frequently at the gym and gaining mass. I doubt people with ARFID are those people.",
          "created_utc": 1734281280.0
        }
      ]
    }
  ]
}