{
  "id": "1hidv5a",
  "subreddit": "ARFID",
  "author": "parmaaviolet",
  "created_utc": 1734676458.0,
  "title": "i hate the fast food employees :)",
  "selftext": "hello i’m a 20 year old female with arfid and medically considered ‘overweight’ bc all my safe foods are junk but anyway. \none of my safe foods is the meatball sub. and only meatballs. no add ons, not toasted no cheese just meatballs. \nEVERYTIME, i get this in subway i get unnecessary remarks and comments made about it. \n“that’s a bit plain and simple” - with a judging look\n“are you sure you want nothing on it???” \n“no cheese????” no “are you sure??” YES. \ni hate getting it toasted too bc it makes the bread all crusty and i hate it. but they just INSIST that i need to add something to my sandwich to make it better.\nand they pry on and on and on about am i sure i want it that way and proceed to laugh in my face. it makes me feel really self conscious bc they are clearly judging me to my face about my food order bc they consider it plain and boring. it’s gotten to the point that i just order it directly to my house instead of going in because i know they are going to make stupid comments at me. \n\nit’s not just subway. like i know i’m not the only person to customise and burger at mcdonald’s to only ketchup. 9/10 times my order is delayed bc they will find my table and MAKE SURE that i want nothing in my burger and it wasn’t a mistake. like??? i’ve even had someone say to me “i’ve never seen a burger so lifeless” or “that’s weird” or “i’ve never seen anyone do that” like FUCK OFFFFF. \ndon’t even get me started when they assume i’ve made a mistake with the customisation of my order bc it’s too weird to be true so they put everything in anyway. you best believe i’m storming up to the counter with my receipt in hand. \n\nAND KFC no matter how many times i add in the order notes “no sauce and salad” they have never ONCE removed it. and i am entirely convinced kfc employees cannot read. like what if i was allergic what then. i then have to proceed to wipe off the sauce with kitchen roll and be left with the lingering taste of mayo :/\n\nin conclusion \nsubway employees are assholes\nmcdonald’s employees are dickheads\nand kfc employees cannot read. \n\nif you work in any of these places it’s nothing personal lol just my ranting and experiences. i’m sure you are lovely ",
  "url": "https://www.reddit.com/r/ARFID/comments/1hidv5a/i_hate_the_fast_food_employees/",
  "score": 133,
  "num_comments": 82,
  "comments": [
    {
      "id": "m2y8rlg",
      "author": "None",
      "body": "Honestly as someone who previously worked fast food; idgaf if you ordered burnt bread with a side of moldy lettuce and mustard; if that's what you want, I'm making it, no questions asked and no comments made. All you're getting is \"Have a great day and enjoy your meal.\" It's not hard and I have ARFID myself. Lol. People lack common decency. Smh.",
      "created_utc": 1734678908.0,
      "score": 123,
      "context": []
    },
    {
      "id": "m2y65sz",
      "author": "Perchance09",
      "body": "For the most part, I have a lot of compassion for fast food employees, but in this aspect, I agree and share the same frustration. They don't get paid enough and the job is taxing, but comments like this are just uncalled for. I've been to places where they have happily accommodated my needs even when they were busy. To a certain extent, I can understand them wanting to double-check because sometimes mistakes happen and some entitled customers end up yelling. So I personally don't mind a small delay, but I detest stuff like \"Are you sure you don't want this?\" and \"Why don't you try this with it? That will bring some flavour.\" My subway orders always get messed up because they keep adding stuff I did not opt for and specifically said not to add, and I end up with the same thoughts and emotions as you. ",
      "created_utc": 1734677254.0,
      "score": 88,
      "context": []
    },
    {
      "id": "m2yxiym",
      "author": "helchowskinator",
      "body": "I worked fast food for a while and you’d be surprised how many people intentionally order incorrectly to get a free meal. If I had to guess I’d say they’re checking to avoid getting shouted at later. Laughing at you is inexcusable but the employee who visits your table and asks if the order is correct is probably just trying to cover their butt. I’ve had a near empty milkshake thrown at me because ‘you made it wrong’ and she wanted her money back. If asking her to double check her order could have avoided that, I definitely would have done so.",
      "created_utc": 1734695748.0,
      "score": 54,
      "context": []
    },
    {
      "id": "m2zn8nm",
      "author": "Chagdoo",
      "body": "Dawg where the fuck are you ordering food. \n\nAlso can I just say, as a former fast food worker, I love people like you. No complicated bullshit, just patty on a bun. Makes my job easier, it's perfect.",
      "created_utc": 1734706914.0,
      "score": 21,
      "context": []
    },
    {
      "id": "m2zu2jb",
      "author": "ArtfulAesthetic",
      "body": "I HATE THIS SO MUCH!!!!! i always say \"yeah im getting it for my mom she can barely keep anything down after her surgery\" because MAYBE PEOPLE HAVE UNIQUE NEEDS!!! FEEL BAD!!!! these comments are always so unnecessary its so triggering and for whattt",
      "created_utc": 1734709318.0,
      "score": 22,
      "context": []
    },
    {
      "id": "m2y6r21",
      "author": "mac_and_cheese_pls",
      "body": "I have a simple Subway order as well that’s never changed. Meatball sub, mozzerella cheese, untoasted, sweet onion sauce. The employees give me looks as well. I don’t want a chunky sandwich, especially when you only give me one napkin. Best part of sandwiches is the proteins tbh. \n\nSorry this happened to you. Sending hugs!",
      "created_utc": 1734677619.0,
      "score": 17,
      "context": []
    },
    {
      "id": "m2y57pp",
      "author": "None",
      "body": "I’m sorry you dealt with this. People are very judgmental, it’s not their business on how others enjoy their food",
      "created_utc": 1734676677.0,
      "score": 16,
      "context": []
    },
    {
      "id": "m2znwvr",
      "author": "CalmGur5301",
      "body": "I had a humiliating experience at Subway when I was 14 trying to order just a cheese sandwich. Every damn employee had an opinion about it. It was so weird. Even my friend made fun of me, maybe just to join in on the fun. Ugh. That was 18 years ago and I still remember it.\n\nI've worked in food service since then, and I never, ever felt the need to comment on a customer's order like that.\n\nNowadays, if I go to Subway (rarely lol), I order online so that all I have to do is come in and pick it up.",
      "created_utc": 1734707159.0,
      "score": 15,
      "context": []
    },
    {
      "id": "m2y7v7k",
      "author": "imsatanshelper",
      "body": "I have an order from subway i always get but i try to joke with the employees because i know its simple but its annoying 😭 (Footlong Italian herbs and cheese, 6 slices of salami, 6 slices of pepperoni, extra provolone, lettuce and olives, they don't do spicy brown mustard anymore so i add my own at home)\n\nBut yours is so simple, just slap the meatballs on the bread and call it done. Idk why they made those comments?? Its an easy sandwich!\n\nAlso empathize with fast food being a safe food!\nTaco bell, McDonald's, Wendy's and Domino's have been my safe food for many many years.\n\nLately I've been on a taco bell kick 🥰",
      "created_utc": 1734678330.0,
      "score": 14,
      "context": []
    },
    {
      "id": "m2yu2yd",
      "author": "Mother_Goat1541",
      "body": "Offering food gives me such anxiety. The fast food apps and ordering online was a game changer for me.",
      "created_utc": 1734693691.0,
      "score": 12,
      "context": []
    },
    {
      "id": "m2z2ytd",
      "author": "bunnylo",
      "body": "don’t get me started on how impossible it is to order a plain hamburger, no cheese at mcdonald’s. they put cheese on it everytime. I don’t understand why the world can only grasp the concept of a cheeseburger.",
      "created_utc": 1734698602.0,
      "score": 10,
      "context": []
    },
    {
      "id": "m2zbxyz",
      "author": "JonathanStryker",
      "body": "On one hand, I understand it from the employee stand point. At least the confirmation thing. \n\nI've seen some hell stories where they try to clarify things with dumb customers and then the customers are like:\n\n\"Where's the cheese on my cheese burger\"\n\nAnd then the employees are like:\n\n\"Sir, you told me three times that you wanted no cheese.\"\n\n\"NO, I DIDN'T! I WANT A REFUND AND A FREE SANDWICH!\"\n\nIn short, irate, stupid customers are not fun to deal with. And that's probably why employees ask so many clarifying questions.\n\nOther than that, I do feel you about the more \"colorful\" comments. If I wanted to get judged for what I do or don't eat, I would still be in contact with my fucking grandmother. Or, some of my old family doctors. \n\nHope things get better for you tho.",
      "created_utc": 1734702539.0,
      "score": 7,
      "context": []
    },
    {
      "id": "m2yicgf",
      "author": "Gmschaafs",
      "body": "Is there an app you can order with so you don’t have to tell them your order in person? They probably won’t comment on it if you use the app (in my experience at least).",
      "created_utc": 1734685561.0,
      "score": 8,
      "context": []
    },
    {
      "id": "m2y66nc",
      "author": "None",
      "body": "i get sandwiches with just cheese. not toasted. if they say anything after “that’s it?” i just interrupt them with “yeah it’s the easiest thing”. that shuts them up.",
      "created_utc": 1734677268.0,
      "score": 24,
      "context": []
    },
    {
      "id": "m2zitfu",
      "author": "Peak-Pickiness00",
      "body": "I don't have ARFID, but I frickin hate raw tomatoes on my burgers. Not rarely, I do order a burger plain and I get the lettuce, that it's fairly annoying to pick off, cuz it's so often shredded. To some plain means no sauces, to others (as myself always meant) just meat and bun. To me it's so annoying, when I get the burger open it to see if they gave me it as I ordered, only to figure out that the soggy a** pinkish tomato is on my burger.\nYet, no matter what, even if I pick them off the juices still linger, make it watery and screw up the burger.\n\nStill its not a fast food employee business to comment on your order, it's so unprofessional. It's just a basic order, there's no additional stuff to add, just the simplest possible combo, except only meat or only bun.",
      "created_utc": 1734705279.0,
      "score": 5,
      "context": []
    },
    {
      "id": "m303ayz",
      "author": "None",
      "body": "yeah, it’s really frustrating when requests like that aren’t honored. even worse when you ask for extra of something you really like and they charge you and just don’t do it. i feel like a specific place nearby to me goes out of their way to spite me lol. i always order extra onions because i love them and they rarely ever give me onion at all. i don’t know why",
      "created_utc": 1734712443.0,
      "score": 5,
      "context": []
    },
    {
      "id": "m306zqy",
      "author": "gymngdoll",
      "body": "This is why I love online/app ordering. Nothing to discuss and it’s made when I get there.",
      "created_utc": 1734713659.0,
      "score": 4,
      "context": []
    },
    {
      "id": "m30cyjq",
      "author": "MrsCyanide",
      "body": "That’s actually so frustrating and rude. The customer is always right…in the matter of TASTE. They should not be judged on what they choose to eat or questioned. \n\nFunnily enough, I’m a server who has ARFID. I have had people order “basic” things with lots of modifications and a lot of them apologize profusely. You do not need to explain yourself. I’m here to take your order, send it correctly and give you a great experience. It makes me sad to think that they’ve been judged or berated for their orders in the past.",
      "created_utc": 1734715638.0,
      "score": 4,
      "context": []
    },
    {
      "id": "m30l196",
      "author": "TrashCanEnigma",
      "body": "I've got a regular at my store who I happen to know has a son who's on the spectrum. His order is a little troublesome to make because it requires a special note that I can't punch in the register. But tbh I totally get it, so I always do them the solid, and his dad is super thankful. Even if you're complete dicks (I have another regular who intentionally orders a bunch of difficult garbage and then gets made when you mix up ONE thing because she changed the order 14 times), nobody should be talking shit to your face like that. Sorry that happened to ya.",
      "created_utc": 1734718300.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m2zwgdk",
      "author": "_FirstOfHerName_",
      "body": "I live in the UK and have never had an issue with a fast-food worker understanding \"plain\" or \"no salad or sauce\" - and even on delivery sites like uber the customisation makes it so you can take off sauces or salad items. When I worked at a fast food place as a teenager loads of orders were modified too.\n\nMost definitely haven't had a fast food worker find me to double check...",
      "created_utc": 1734710127.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m30tha4",
      "author": "666hmuReddit",
      "body": "This happens to me every time I get subway because I literally just get ham and cheese on white bread and that’s it. Sometimes they even tell me that I’m not getting my moneys worth. If I enjoy the food then it’s money well spent.",
      "created_utc": 1734721106.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m30ed6l",
      "author": "jemappelletired",
      "body": "I feel this 😭 when I used to eat gluten I would just get Italian bread and American cheese (which is literally a grilled cheese so I don’t understand the hate) and EVERYONE would make comments about it. Drove me crazy!!",
      "created_utc": 1734716103.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m30pg33",
      "author": "AlternateUsername22",
      "body": "Marcos Pizza has pretty good meatball subs btw if you are looking for new places. If you order online, you can take the cheese off as an option too.",
      "created_utc": 1734719764.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m31ixpn",
      "author": "Working_Panic_1476",
      "body": "A blank stare works wonders for nosy people. \n\nOr you could give it the classic “did I stutter?”\n\nOr my personal favorite: crazy af. “Yup I’m just a SUPER big baby weirdo now can I please have my toddler sandwich as ordered because I’m late for a play date”",
      "created_utc": 1734729775.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m31jxf1",
      "author": "athey",
      "body": "I guess I’m fortunate. I’ve never had a fast food employee comment on my customizations.  I’ve been ordering my cheeseburger ketchup only at McDs for nearly 40 years, and no one’s ever said a thing.  You’ve got some nosy busy-bodies in your town.",
      "created_utc": 1734730118.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m31ush4",
      "author": "maisy2001",
      "body": "i remember someone behind the counter at burger king called me a “salad dodger” bc i ordered my burger without lettuce🥲🥲🥲",
      "created_utc": 1734734001.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m37g5y4",
      "author": "Ok-Lily",
      "body": "omg i have never seen anyone have the same issue. i like flatbread toasted with JUST cheese at subway. my dad orders for me a lot and he always gets “are you sure?????” & weird looks. he now orders “ i want only cheese NOTHING ELSE and yes i am sure.” my sister ordered for me once and told me an employee asked her “is this for you?” and when she replied no, the employee said “good, because i’d judge you if it was.” i said the next time someone tells you that PLEASE tell them it’s for your autistic sister and watch them squirm. it’s so annoying. people are very inconsiderate",
      "created_utc": 1734822603.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m2yj7wx",
      "author": "Unique-Ad-3317",
      "body": "I live in an immigrant-heavy state and city, and the amount of times my orders (where I ask to leave off half the ingredients) at a casual dining place (like burgers, or anywhere that you order at a counter first) has been wrong because the person who has the job of taking orders barely speaks English, is ridiculous. \nI’m not a braindead “this America, speak English” racist, I just don’t understand why you can’t have the one person you hired that speaks English take the orders (it’s always a manager helping make food in the back, that gets called up by the order-taker when I politely say that they got my order wrong and explain it again, and they still don’t understand). \n\nWhen I worked at a food place in a mall, the manager was bilingual so we’d call him up to take the order when we’d get a customer that didn’t speak English, and that worked well because the majority of our customers and workers spoke English- case in point, ordering food can be life-threatening if the employee doesn’t understand an allergy being communicated to them, let alone food restrictions due to autism, ARFID, or other debilitating conditions.",
      "created_utc": 1734686194.0,
      "score": 6,
      "context": []
    },
    {
      "id": "m2yvgno",
      "author": "boytoy421",
      "body": "It's funny, maybe cause I'm a guy but I order like you do (not meatballs though, but everything dry) and the most i ever get is a \"you sure?\" But usually they just confirm my order",
      "created_utc": 1734694542.0,
      "score": 4,
      "context": []
    },
    {
      "id": "m30u2n0",
      "author": "Wooperwoops7",
      "body": "I’ve started saying I have allergies to things like onions. Everytime I go to McDonald’s I get a cheeseburger no onion, extra pickle and there is ALWAYS onion. Or they take the onion off and I can freaking taste it still, they can’t get every tiny onion off there. So now I say I’m allergic bc ya know what? I do want you to change your gloves, bc honestly tasting onion makes me puke and that might as well be an allergy.",
      "created_utc": 1734721304.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m3222uw",
      "author": "danibates",
      "body": "These are my same two orders at both restaurants, except I order the meatball hoagie with light sauce. If they give it to me with regular sauce then it takes all of the 2 napkins they give me to scrape it off. *sigh*",
      "created_utc": 1734736770.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m326mvx",
      "author": "peachykeen_127",
      "body": "this shit drives me CRAZY at any make-your-own fast food, idk why everyone gets so shocked about it!! i lowkey just wanna say “yep it’s because i have an ED” so they get uncomfortable and shut up cuz it’s NOT their business",
      "created_utc": 1734738568.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m32ilg9",
      "author": "Old_Woodpecker_7677",
      "body": "I get this :/// I’m no stranger to working in food places and I still can’t understand where some of the people that work there get the audacity. It’s arguably way easier to accommodate orders like this because hello you’re adding less steps for the employee. The side comments are completely out of line, and as rude as this sounds I have found myself thinking “just put the fries in the bag dude”. (Ofc I don’t express this out loud I just get disappointed in silence) \n\nFor me, I try to limit the junk food I consume and have been able to find healthier safe foods. (Bacon Caesar salad kits will never be taken away from me) But mostly I did that because I got tired of my requests being ignored or mocked lmao. Cheese can either make or break things for me and at Subway I’ve had employees outright ignore me to my face and toast the sub for me, then give me rude looks when I ask them to please remake it. I love toasted bread but I hate hot sandwiches, the cheese gets gross and it makes the veggie toppings soggy :( (unless it’s a French dip or dominos one, there’s a huge texture difference imo) \n\nBasically tho your requests aren’t a hassle and I agree you should be left alone about it. I understand they don’t get paid very fairly but i also know from experience they’re just taking their frustrations out on the customers at some point and it’s always uncalled for.",
      "created_utc": 1734743383.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m32kpy8",
      "author": "jorwyn",
      "body": "My husband gets just roast beef with nothing else. Usually, they double check or make a comment about how easy his sandwich is but don't tend to push. Every once in a while, though, we get someone who is super judgy. \n\nI used to work at Subway when I was young, and I don't get it. I did not care what people ordered for the most part, but a sub with just one meat and nothing else would have made me so happy! I might have made a comment about it being easy thinking I was being friendly, though. I hope I never hurt anyone's feelings, because I honestly appreciated the sandwiches that weren't piled with so much stuff they were hard to close and wrap. I also appreciated that they weren't combinations that grossed me out a bit. \n\nLuckily, my ARFID doesn't really make me sick from dealing with food I cannot eat myself, but some combinations, man, why?!",
      "created_utc": 1734744247.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m32uakf",
      "author": "Accurate-Neck6933",
      "body": "I hear you. What about getting ripped off? All my son wants at Pita Pit is a BLT. It has gotten smaller and smaller. It makes me mad that just because he doesn’t want cheese and mayo or anything else on it, why does have to be smaller but we are still charged the same expensive price of $13? They are like oh that the price of a build your own. Anyway, not going there anymore.",
      "created_utc": 1734748225.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m32wg54",
      "author": "anilucy",
      "body": "This is me at in n out. I get a hamburger with grilled onions and no sauce/spread because I hate sauce/spread and they always give me such a judgmental look.  No it’s not making my burger “dry” and even if is is, IDC.",
      "created_utc": 1734749134.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m33a9d2",
      "author": "Bulky_Influence_4914",
      "body": "in and out grilled cheese ... no meat or tomato",
      "created_utc": 1734755235.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m33ud84",
      "author": "Korean_Pathfinder",
      "body": "Do you have a take on Burger King? I'm just curious because I worked for them when I was a teenager.\n\nAlso, considering you don't like cheese, I'm curious how you chose your username.🙂",
      "created_utc": 1734766506.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m34dknt",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1734779243.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m34o16e",
      "author": "IHaveNoUsernameSorry",
      "body": "I’ve worked in fast food and I prefer when people order plain cos it’s less work for me. The guy who works in my local subway always chuckles and says, “you can come back,” or something like that when I order my sub plain with nothing else on it. He’s lovely.",
      "created_utc": 1734785368.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m35vjhd",
      "author": "Pandaleelee",
      "body": "I feel this. You aren't alone here. I'm in the exact same shoes you are wearing here.\n\nIt's okay, just do your best. It's hard to deal with, but if possible for you, I like to find pre-cooked ingredients at stores to make my own at home versions of fast food. I've gotten some quite close!!!\n\nSo that's an option then you can make it just how you like it ^__^",
      "created_utc": 1734802342.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m3ab02d",
      "author": "Own_Living3523",
      "body": "That’s literally why I hate making extra requests in restaurants. Idk why but it makes me feel stupid, judged and people often makes jokes about it. 🥲",
      "created_utc": 1734877811.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m3agucb",
      "author": "None",
      "body": "I always ask for NO TARTAR SAUCE on fish sandwiches and 9 times out of 10 I have to send it back because it’s got tartar. It’s a lack of attention or care for the customer it seems",
      "created_utc": 1734880201.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m3b47kt",
      "author": "Brilliant_Mixture_51",
      "body": "Girl i’m the same way 😭 This sandwich place at my job makes a veggie sandwich. I hold the lettuce, onions, and dressing, so it’s JUST tomatoes cucumbers and feta cheese. They alwayssssss look at me like i’m so weird 😭🥹",
      "created_utc": 1734888429.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m3b4bsk",
      "author": "undercovercatman",
      "body": "I’m a fellow hamburger and only ketchup orderer! Something that makes me feel a lot better is my experience working in fast food, both at a Starbucks and a fast food chain. Chances are if you think your order is weird, someone else gets something WAY more unusual, and that’s okay too! I used to have a regular at my fast food job that would order his burger “extra drained” of fat/juiciness. Some people get burgers with only mustard, breakfast sandwiches with only the cheese, lattes with insane amounts of random syrups, soda combinations that sound disgusting, salads with no toppings except croutons, you name it. You’re never the only “weird” person at a restaurant, and who cares if some random people think you’re weird anyways! Never feel bad for ordering what YOU want to eat.",
      "created_utc": 1734888471.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m3dk3tz",
      "author": "pugsanddogs_10",
      "body": "I relate to this so hard. And I don’t understand how employees mess up food so frequently. I worked in food service for a year and NEVER ONCE got someone’s order incorrect. Literally never. Maybe it’s because I know how important this stuff is, idk if other people just don’t “care” enough to make sure it’s right?? I’m not sure but either way you deserve to get your order made correctly and without judgement",
      "created_utc": 1734919251.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m3e4g8o",
      "author": "Mediocre_Beat6329",
      "body": "One of the things that has helped me immensely is ordering through the app whenever possible. Idk about subway, but you can be very specific on the McDonald’s app. I check off everything except for the bun and the burger patties, then I also check off the box that says “plain.” This gives me double safeguards against a messed up order, and I can show the mobile order to the workers if it is not prepared exactly the way I want it.",
      "created_utc": 1734928028.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mesadxi",
      "author": "SiaoTAK",
      "body": "Grow the fuck up.",
      "created_utc": 1740523393.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m35rywr",
      "author": "Traumarama79",
      "body": "I have arfid too but I worked in fast food for years. Do better. These are people who work for a pittance and get no benefits. They're not your enemy. Yes, it's annoying to be inconvenienced, but this is entitled.",
      "created_utc": 1734801073.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m2yzu9k",
      "author": "madeleine59",
      "body": "sorry for derailling, but i'm curious as to how working fast food with ARFID was. i feel sick when i touch raw meat even in packaging",
      "created_utc": 1734697008.0,
      "score": 28,
      "context": [
        {
          "id": "m2y8rlg",
          "author": "None",
          "body": "Honestly as someone who previously worked fast food; idgaf if you ordered burnt bread with a side of moldy lettuce and mustard; if that's what you want, I'm making it, no questions asked and no comments made. All you're getting is \"Have a great day and enjoy your meal.\" It's not hard and I have ARFID myself. Lol. People lack common decency. Smh.",
          "created_utc": 1734678908.0
        }
      ]
    },
    {
      "id": "m2yac9m",
      "author": "neko_mancy",
      "body": "They might be trained to confirm weirder orders in case people forget to specify something",
      "created_utc": 1734679948.0,
      "score": 28,
      "context": [
        {
          "id": "m2y65sz",
          "author": "Perchance09",
          "body": "For the most part, I have a lot of compassion for fast food employees, but in this aspect, I agree and share the same frustration. They don't get paid enough and the job is taxing, but comments like this are just uncalled for. I've been to places where they have happily accommodated my needs even when they were busy. To a certain extent, I can understand them wanting to double-check because sometimes mistakes happen and some entitled customers end up yelling. So I personally don't mind a small delay, but I detest stuff like \"Are you sure you don't want this?\" and \"Why don't you try this with it? That will bring some flavour.\" My subway orders always get messed up because they keep adding stuff I did not opt for and specifically said not to add, and I end up with the same thoughts and emotions as you. ",
          "created_utc": 1734677254.0
        }
      ]
    },
    {
      "id": "m2y6i3m",
      "author": "parmaaviolet",
      "body": "yeah, i’d never yell at them. my anxiety meds are not that strong 😍 but it’s just frustrating when it happens constantly",
      "created_utc": 1734677465.0,
      "score": 20,
      "context": [
        {
          "id": "m2y65sz",
          "author": "Perchance09",
          "body": "For the most part, I have a lot of compassion for fast food employees, but in this aspect, I agree and share the same frustration. They don't get paid enough and the job is taxing, but comments like this are just uncalled for. I've been to places where they have happily accommodated my needs even when they were busy. To a certain extent, I can understand them wanting to double-check because sometimes mistakes happen and some entitled customers end up yelling. So I personally don't mind a small delay, but I detest stuff like \"Are you sure you don't want this?\" and \"Why don't you try this with it? That will bring some flavour.\" My subway orders always get messed up because they keep adding stuff I did not opt for and specifically said not to add, and I end up with the same thoughts and emotions as you. ",
          "created_utc": 1734677254.0
        }
      ]
    },
    {
      "id": "m392v3k",
      "author": "SapphireSky7099",
      "body": "I agree one simple confirmation of something like, “is that all you’d like?” Or “is this correct?” Is appropriate for clarification sake. \n\nBut noooo one has the right to judge someone for their order. You’d think fast food workers have seen all types of orders and they wouldn’t give a shit. \n\nSaying anything about my choices except to get a go ahead that my order is complete would get the place a bad review. Judgment like that can be so harmful. Judging peoples food choices is so unnecessary",
      "created_utc": 1734849759.0,
      "score": 6,
      "context": [
        {
          "id": "m2y65sz",
          "author": "Perchance09",
          "body": "For the most part, I have a lot of compassion for fast food employees, but in this aspect, I agree and share the same frustration. They don't get paid enough and the job is taxing, but comments like this are just uncalled for. I've been to places where they have happily accommodated my needs even when they were busy. To a certain extent, I can understand them wanting to double-check because sometimes mistakes happen and some entitled customers end up yelling. So I personally don't mind a small delay, but I detest stuff like \"Are you sure you don't want this?\" and \"Why don't you try this with it? That will bring some flavour.\" My subway orders always get messed up because they keep adding stuff I did not opt for and specifically said not to add, and I end up with the same thoughts and emotions as you. ",
          "created_utc": 1734677254.0
        }
      ]
    },
    {
      "id": "m30kgf7",
      "author": "TrashCanEnigma",
      "body": "Seconding this. Sorry that other customers are assholes, they kinda ruin it for everybody... But nobody should be laughing at you.",
      "created_utc": 1734718109.0,
      "score": 19,
      "context": [
        {
          "id": "m2yxiym",
          "author": "helchowskinator",
          "body": "I worked fast food for a while and you’d be surprised how many people intentionally order incorrectly to get a free meal. If I had to guess I’d say they’re checking to avoid getting shouted at later. Laughing at you is inexcusable but the employee who visits your table and asks if the order is correct is probably just trying to cover their butt. I’ve had a near empty milkshake thrown at me because ‘you made it wrong’ and she wanted her money back. If asking her to double check her order could have avoided that, I definitely would have done so.",
          "created_utc": 1734695748.0
        }
      ]
    },
    {
      "id": "m3ygwov",
      "author": "Airheadedlady",
      "body": "this is what I say to everyone. It could not be simpler! I genuinely don’t understand how it gets messed up sometimes.",
      "created_utc": 1735259067.0,
      "score": 1,
      "context": [
        {
          "id": "m2zn8nm",
          "author": "Chagdoo",
          "body": "Dawg where the fuck are you ordering food. \n\nAlso can I just say, as a former fast food worker, I love people like you. No complicated bullshit, just patty on a bun. Makes my job easier, it's perfect.",
          "created_utc": 1734706914.0
        }
      ]
    },
    {
      "id": "m2ybrte",
      "author": "ArcherFawkes",
      "body": "My subway order is literally just the meatball sub with cheese lol. I rarely go there because my sandwich preference (ham/turkey with cheese) is cheaper to make at home and I don't miss out on the bread 😅",
      "created_utc": 1734680924.0,
      "score": 6,
      "context": [
        {
          "id": "m2y6r21",
          "author": "mac_and_cheese_pls",
          "body": "I have a simple Subway order as well that’s never changed. Meatball sub, mozzerella cheese, untoasted, sweet onion sauce. The employees give me looks as well. I don’t want a chunky sandwich, especially when you only give me one napkin. Best part of sandwiches is the proteins tbh. \n\nSorry this happened to you. Sending hugs!",
          "created_utc": 1734677619.0
        }
      ]
    },
    {
      "id": "m2zbyva",
      "author": "Commercial_Debt_6789",
      "body": "OP said at KFC they'll put a note in their order and it'll get ignored completely! ",
      "created_utc": 1734702549.0,
      "score": 8,
      "context": [
        {
          "id": "m2yicgf",
          "author": "Gmschaafs",
          "body": "Is there an app you can order with so you don’t have to tell them your order in person? They probably won’t comment on it if you use the app (in my experience at least).",
          "created_utc": 1734685561.0
        }
      ]
    },
    {
      "id": "m2zdwxu",
      "author": "JonathanStryker",
      "body": "Had this happen at a restaurant once. Well, it was more a cafe/diner place. \n\nAs a kid, I was obsessed with cheese sandwiches, I ate them every day. Obviously, I didn't really understand the whole \"safe food\" thing at that age. I just ate what I liked and felt comfortable to me.\n\nSo one day my mom and I went to the place where she worked on an off day and there was a new waitress there. \n\nAnd, she asked what I wanted, I said a cheese sandwich. And the waitress was like \"we don't serve that here\". And mom and her had a whole big discussion about how you could just charge for a grilled cheese, not grill it, and put mayo on it (for an extra charge).\n\nI think like the store owner or manager had to sign off on it or something. It was a whole weird thing. \n\nAs an adult, looking back on it, I see both sides. On one hand, what I wanted wasn't on the menu. But, on the other hand, they have the stuff to make a grilled cheese and mayo is a condiment option for the burgers. Like, 1 + 1 should equal 2, yeah?\n\nBut, like, I was 5 or whatever. And I didn't really get the big deal. I was just asking for something I liked and thought was easy to make (because Mom made them for me all the time), you know?\n\nAnd, I can see how ordering \"off menu\" in most situations is kind of weird. Like, as an adult, I wouldn't go into a Taco Bell and order a Whopper or whatever. \n\nSo, yeah, just a funny little story from my childhood I wanted to share. I might have gotten some details wrong, as this was like 25 years ago, but I think you get the idea.",
      "created_utc": 1734703345.0,
      "score": 10,
      "context": [
        {
          "id": "m2y66nc",
          "author": "None",
          "body": "i get sandwiches with just cheese. not toasted. if they say anything after “that’s it?” i just interrupt them with “yeah it’s the easiest thing”. that shuts them up.",
          "created_utc": 1734677268.0
        }
      ]
    },
    {
      "id": "m30jz0b",
      "author": "shitz_brickz",
      "body": "That's what I try to do, I try to head them off with \"nope I like it nice and simple, NOTHING ON IT.\" Because for some reason it is always easy to remember like \"burger medium rare, swiss cheese, lettuce, onions, peppers, no tomato, ketchup, mustard, no relish\" but hard to remember \"just the patty and bread, medium rare\"",
      "created_utc": 1734717947.0,
      "score": 4,
      "context": [
        {
          "id": "m2y66nc",
          "author": "None",
          "body": "i get sandwiches with just cheese. not toasted. if they say anything after “that’s it?” i just interrupt them with “yeah it’s the easiest thing”. that shuts them up.",
          "created_utc": 1734677268.0
        }
      ]
    },
    {
      "id": "m37zaft",
      "author": "parmaaviolet",
      "body": "i’m gonna say that next time hahaah",
      "created_utc": 1734830398.0,
      "score": 2,
      "context": [
        {
          "id": "m37g5y4",
          "author": "Ok-Lily",
          "body": "omg i have never seen anyone have the same issue. i like flatbread toasted with JUST cheese at subway. my dad orders for me a lot and he always gets “are you sure?????” & weird looks. he now orders “ i want only cheese NOTHING ELSE and yes i am sure.” my sister ordered for me once and told me an employee asked her “is this for you?” and when she replied no, the employee said “good, because i’d judge you if it was.” i said the next time someone tells you that PLEASE tell them it’s for your autistic sister and watch them squirm. it’s so annoying. people are very inconsiderate",
          "created_utc": 1734822603.0
        }
      ]
    },
    {
      "id": "m35thba",
      "author": "parmaaviolet",
      "body": "I do love burger king, just getting a plain burger with ketchup. and once i asked for a plain burger and he said “which one” and i was so confused but he meant he had to put a certain burger down for my order and then remove the stuff lmao. it look me a while to figure out what he meant but that was on me not him lmao. \nand about my username i assume you are thinking of parmesan?? but parma violets are like sweets/candy in the uk. and my name is violet so i thought it worked lol",
      "created_utc": 1734801610.0,
      "score": 1,
      "context": [
        {
          "id": "m33ud84",
          "author": "Korean_Pathfinder",
          "body": "Do you have a take on Burger King? I'm just curious because I worked for them when I was a teenager.\n\nAlso, considering you don't like cheese, I'm curious how you chose your username.🙂",
          "created_utc": 1734766506.0
        }
      ]
    },
    {
      "id": "m35umo0",
      "author": "ARFID-ModTeam",
      "body": "If you see this removal reason you are a dick and we don’t want you in this community to cause harm.",
      "created_utc": 1734802019.0,
      "score": 3,
      "context": [
        {
          "id": "m34dknt",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1734779243.0
        }
      ]
    },
    {
      "id": "m3et1eq",
      "author": "parmaaviolet",
      "body": "hahahah i love this!!!",
      "created_utc": 1734942557.0,
      "score": 1,
      "context": [
        {
          "id": "m3b4bsk",
          "author": "undercovercatman",
          "body": "I’m a fellow hamburger and only ketchup orderer! Something that makes me feel a lot better is my experience working in fast food, both at a Starbucks and a fast food chain. Chances are if you think your order is weird, someone else gets something WAY more unusual, and that’s okay too! I used to have a regular at my fast food job that would order his burger “extra drained” of fat/juiciness. Some people get burgers with only mustard, breakfast sandwiches with only the cheese, lattes with insane amounts of random syrups, soda combinations that sound disgusting, salads with no toppings except croutons, you name it. You’re never the only “weird” person at a restaurant, and who cares if some random people think you’re weird anyways! Never feel bad for ordering what YOU want to eat.",
          "created_utc": 1734888471.0
        }
      ]
    },
    {
      "id": "m35vjvk",
      "author": "parmaaviolet",
      "body": "did you even read the last part? “annoying to be inconvenienced” are you joking lol. if you say you have arfid and someone puts a food you hate all over your other food surely you wont just say “oh that’s annoying, but oh well” no that shit will ruin your day. my post was just a rant about my experiences in these places. not my fault you got your knickers in a twist",
      "created_utc": 1734802345.0,
      "score": 3,
      "context": [
        {
          "id": "m35rywr",
          "author": "Traumarama79",
          "body": "I have arfid too but I worked in fast food for years. Do better. These are people who work for a pittance and get no benefits. They're not your enemy. Yes, it's annoying to be inconvenienced, but this is entitled.",
          "created_utc": 1734801073.0
        }
      ]
    },
    {
      "id": "m2zvj4a",
      "author": "AnonDxde",
      "body": "Is this common ? With Arfid? I can’t eat meat and my daughter does so I end up cooking it for her. I literally cannot stand touching it. It feels contaminated or something.",
      "created_utc": 1734709818.0,
      "score": 16,
      "context": [
        {
          "id": "m2y8rlg",
          "author": "None",
          "body": "Honestly as someone who previously worked fast food; idgaf if you ordered burnt bread with a side of moldy lettuce and mustard; if that's what you want, I'm making it, no questions asked and no comments made. All you're getting is \"Have a great day and enjoy your meal.\" It's not hard and I have ARFID myself. Lol. People lack common decency. Smh.",
          "created_utc": 1734678908.0
        },
        {
          "id": "m2yzu9k",
          "author": "madeleine59",
          "body": "sorry for derailling, but i'm curious as to how working fast food with ARFID was. i feel sick when i touch raw meat even in packaging",
          "created_utc": 1734697008.0
        }
      ]
    },
    {
      "id": "m2ztgym",
      "author": "Main_Butterfly887",
      "body": "i worked at a smoothie place for 2 hours one time. they had me prepping meat the entire time and i almost threw up, i was extremely uncomfy and just left the job",
      "created_utc": 1734709112.0,
      "score": 5,
      "context": [
        {
          "id": "m2y8rlg",
          "author": "None",
          "body": "Honestly as someone who previously worked fast food; idgaf if you ordered burnt bread with a side of moldy lettuce and mustard; if that's what you want, I'm making it, no questions asked and no comments made. All you're getting is \"Have a great day and enjoy your meal.\" It's not hard and I have ARFID myself. Lol. People lack common decency. Smh.",
          "created_utc": 1734678908.0
        },
        {
          "id": "m2yzu9k",
          "author": "madeleine59",
          "body": "sorry for derailling, but i'm curious as to how working fast food with ARFID was. i feel sick when i touch raw meat even in packaging",
          "created_utc": 1734697008.0
        }
      ]
    },
    {
      "id": "m32o9io",
      "author": "None",
      "body": "It made me nauseous and grossed out tbh, but money is money😭",
      "created_utc": 1734745703.0,
      "score": 2,
      "context": [
        {
          "id": "m2y8rlg",
          "author": "None",
          "body": "Honestly as someone who previously worked fast food; idgaf if you ordered burnt bread with a side of moldy lettuce and mustard; if that's what you want, I'm making it, no questions asked and no comments made. All you're getting is \"Have a great day and enjoy your meal.\" It's not hard and I have ARFID myself. Lol. People lack common decency. Smh.",
          "created_utc": 1734678908.0
        },
        {
          "id": "m2yzu9k",
          "author": "madeleine59",
          "body": "sorry for derailling, but i'm curious as to how working fast food with ARFID was. i feel sick when i touch raw meat even in packaging",
          "created_utc": 1734697008.0
        }
      ]
    },
    {
      "id": "m3dkbji",
      "author": "pugsanddogs_10",
      "body": "This isn’t personally an issue for me, I handle raw meat almost daily. I like to wear gloves as that makes it a lot easier. Touching it with my bare hands is slimy and kinda gross but I’m still able to do it. However I definitely will not touch a sink full of dirty dishes that haven’t been rinsed. Different “icks” for everyone lol",
      "created_utc": 1734919339.0,
      "score": 2,
      "context": [
        {
          "id": "m2y8rlg",
          "author": "None",
          "body": "Honestly as someone who previously worked fast food; idgaf if you ordered burnt bread with a side of moldy lettuce and mustard; if that's what you want, I'm making it, no questions asked and no comments made. All you're getting is \"Have a great day and enjoy your meal.\" It's not hard and I have ARFID myself. Lol. People lack common decency. Smh.",
          "created_utc": 1734678908.0
        },
        {
          "id": "m2yzu9k",
          "author": "madeleine59",
          "body": "sorry for derailling, but i'm curious as to how working fast food with ARFID was. i feel sick when i touch raw meat even in packaging",
          "created_utc": 1734697008.0
        }
      ]
    },
    {
      "id": "m3blhmf",
      "author": "stinko_bun",
      "body": "late to the thread, but i worked in food service (a poke place) and it didn't bother me. don't care about how food feels in my hands, only how it feels in my mouth lol",
      "created_utc": 1734894078.0,
      "score": 1,
      "context": [
        {
          "id": "m2y8rlg",
          "author": "None",
          "body": "Honestly as someone who previously worked fast food; idgaf if you ordered burnt bread with a side of moldy lettuce and mustard; if that's what you want, I'm making it, no questions asked and no comments made. All you're getting is \"Have a great day and enjoy your meal.\" It's not hard and I have ARFID myself. Lol. People lack common decency. Smh.",
          "created_utc": 1734678908.0
        },
        {
          "id": "m2yzu9k",
          "author": "madeleine59",
          "body": "sorry for derailling, but i'm curious as to how working fast food with ARFID was. i feel sick when i touch raw meat even in packaging",
          "created_utc": 1734697008.0
        }
      ]
    },
    {
      "id": "m39fdmz",
      "author": "Perchance09",
      "body": "Exactly. Confirmation (and even some delay) is okay, but judgement never is. \n\n\nThis may seem a bit extreme to others who don't get it, but I've gone without eating at some events because I was afraid of judgement from the servers since the way I eat is not how people conventionally eat. Like you said, judgement like that can truly be harmful. ",
      "created_utc": 1734858571.0,
      "score": 3,
      "context": [
        {
          "id": "m2y65sz",
          "author": "Perchance09",
          "body": "For the most part, I have a lot of compassion for fast food employees, but in this aspect, I agree and share the same frustration. They don't get paid enough and the job is taxing, but comments like this are just uncalled for. I've been to places where they have happily accommodated my needs even when they were busy. To a certain extent, I can understand them wanting to double-check because sometimes mistakes happen and some entitled customers end up yelling. So I personally don't mind a small delay, but I detest stuff like \"Are you sure you don't want this?\" and \"Why don't you try this with it? That will bring some flavour.\" My subway orders always get messed up because they keep adding stuff I did not opt for and specifically said not to add, and I end up with the same thoughts and emotions as you. ",
          "created_utc": 1734677254.0
        },
        {
          "id": "m392v3k",
          "author": "SapphireSky7099",
          "body": "I agree one simple confirmation of something like, “is that all you’d like?” Or “is this correct?” Is appropriate for clarification sake. \n\nBut noooo one has the right to judge someone for their order. You’d think fast food workers have seen all types of orders and they wouldn’t give a shit. \n\nSaying anything about my choices except to get a go ahead that my order is complete would get the place a bad review. Judgment like that can be so harmful. Judging peoples food choices is so unnecessary",
          "created_utc": 1734849759.0
        }
      ]
    },
    {
      "id": "m35yx1w",
      "author": "Traumarama79",
      "body": "I ask them nicely to remake it because I have class solidarity with working people. Not hard.",
      "created_utc": 1734803508.0,
      "score": 1,
      "context": [
        {
          "id": "m35rywr",
          "author": "Traumarama79",
          "body": "I have arfid too but I worked in fast food for years. Do better. These are people who work for a pittance and get no benefits. They're not your enemy. Yes, it's annoying to be inconvenienced, but this is entitled.",
          "created_utc": 1734801073.0
        },
        {
          "id": "m35vjvk",
          "author": "parmaaviolet",
          "body": "did you even read the last part? “annoying to be inconvenienced” are you joking lol. if you say you have arfid and someone puts a food you hate all over your other food surely you wont just say “oh that’s annoying, but oh well” no that shit will ruin your day. my post was just a rant about my experiences in these places. not my fault you got your knickers in a twist",
          "created_utc": 1734802345.0
        }
      ]
    },
    {
      "id": "m31e58t",
      "author": "madeleine59",
      "body": "probably i mean i'm autistic so its about as uncomfortable as the sounds in a grocery store",
      "created_utc": 1734728134.0,
      "score": 10,
      "context": [
        {
          "id": "m2y8rlg",
          "author": "None",
          "body": "Honestly as someone who previously worked fast food; idgaf if you ordered burnt bread with a side of moldy lettuce and mustard; if that's what you want, I'm making it, no questions asked and no comments made. All you're getting is \"Have a great day and enjoy your meal.\" It's not hard and I have ARFID myself. Lol. People lack common decency. Smh.",
          "created_utc": 1734678908.0
        },
        {
          "id": "m2yzu9k",
          "author": "madeleine59",
          "body": "sorry for derailling, but i'm curious as to how working fast food with ARFID was. i feel sick when i touch raw meat even in packaging",
          "created_utc": 1734697008.0
        },
        {
          "id": "m2zvj4a",
          "author": "AnonDxde",
          "body": "Is this common ? With Arfid? I can’t eat meat and my daughter does so I end up cooking it for her. I literally cannot stand touching it. It feels contaminated or something.",
          "created_utc": 1734709818.0
        }
      ]
    },
    {
      "id": "m301hq7",
      "author": "l0stk1tten",
      "body": "Yes I hate meat too and don't even want to touch it.",
      "created_utc": 1734711835.0,
      "score": 4,
      "context": [
        {
          "id": "m2y8rlg",
          "author": "None",
          "body": "Honestly as someone who previously worked fast food; idgaf if you ordered burnt bread with a side of moldy lettuce and mustard; if that's what you want, I'm making it, no questions asked and no comments made. All you're getting is \"Have a great day and enjoy your meal.\" It's not hard and I have ARFID myself. Lol. People lack common decency. Smh.",
          "created_utc": 1734678908.0
        },
        {
          "id": "m2yzu9k",
          "author": "madeleine59",
          "body": "sorry for derailling, but i'm curious as to how working fast food with ARFID was. i feel sick when i touch raw meat even in packaging",
          "created_utc": 1734697008.0
        },
        {
          "id": "m2zvj4a",
          "author": "AnonDxde",
          "body": "Is this common ? With Arfid? I can’t eat meat and my daughter does so I end up cooking it for her. I literally cannot stand touching it. It feels contaminated or something.",
          "created_utc": 1734709818.0
        }
      ]
    },
    {
      "id": "m33muik",
      "author": "OctoHelm",
      "body": "For me it’s mainly that my ARFID has all three sub types, the fear of aversive consequences is the worst of the three. I am *terrified* of vomiting and don’t eat meat because of the risk of foodborne illness.",
      "created_utc": 1734761901.0,
      "score": 3,
      "context": [
        {
          "id": "m2y8rlg",
          "author": "None",
          "body": "Honestly as someone who previously worked fast food; idgaf if you ordered burnt bread with a side of moldy lettuce and mustard; if that's what you want, I'm making it, no questions asked and no comments made. All you're getting is \"Have a great day and enjoy your meal.\" It's not hard and I have ARFID myself. Lol. People lack common decency. Smh.",
          "created_utc": 1734678908.0
        },
        {
          "id": "m2yzu9k",
          "author": "madeleine59",
          "body": "sorry for derailling, but i'm curious as to how working fast food with ARFID was. i feel sick when i touch raw meat even in packaging",
          "created_utc": 1734697008.0
        },
        {
          "id": "m2zvj4a",
          "author": "AnonDxde",
          "body": "Is this common ? With Arfid? I can’t eat meat and my daughter does so I end up cooking it for her. I literally cannot stand touching it. It feels contaminated or something.",
          "created_utc": 1734709818.0
        }
      ]
    },
    {
      "id": "m35z7vq",
      "author": "parmaaviolet",
      "body": "okay? so do i if they get it wrong.",
      "created_utc": 1734803613.0,
      "score": 3,
      "context": [
        {
          "id": "m35rywr",
          "author": "Traumarama79",
          "body": "I have arfid too but I worked in fast food for years. Do better. These are people who work for a pittance and get no benefits. They're not your enemy. Yes, it's annoying to be inconvenienced, but this is entitled.",
          "created_utc": 1734801073.0
        },
        {
          "id": "m35vjvk",
          "author": "parmaaviolet",
          "body": "did you even read the last part? “annoying to be inconvenienced” are you joking lol. if you say you have arfid and someone puts a food you hate all over your other food surely you wont just say “oh that’s annoying, but oh well” no that shit will ruin your day. my post was just a rant about my experiences in these places. not my fault you got your knickers in a twist",
          "created_utc": 1734802345.0
        },
        {
          "id": "m35yx1w",
          "author": "Traumarama79",
          "body": "I ask them nicely to remake it because I have class solidarity with working people. Not hard.",
          "created_utc": 1734803508.0
        }
      ]
    },
    {
      "id": "m32gl07",
      "author": "AnonDxde",
      "body": "It is just so disgusting! My main diagnosis is bipolar disorder, but I do share some traits with people I know who have autism. Walking on my tiptoes when I was a child, food, aversions, stuff like that.",
      "created_utc": 1734742560.0,
      "score": 2,
      "context": [
        {
          "id": "m2y8rlg",
          "author": "None",
          "body": "Honestly as someone who previously worked fast food; idgaf if you ordered burnt bread with a side of moldy lettuce and mustard; if that's what you want, I'm making it, no questions asked and no comments made. All you're getting is \"Have a great day and enjoy your meal.\" It's not hard and I have ARFID myself. Lol. People lack common decency. Smh.",
          "created_utc": 1734678908.0
        },
        {
          "id": "m2yzu9k",
          "author": "madeleine59",
          "body": "sorry for derailling, but i'm curious as to how working fast food with ARFID was. i feel sick when i touch raw meat even in packaging",
          "created_utc": 1734697008.0
        },
        {
          "id": "m2zvj4a",
          "author": "AnonDxde",
          "body": "Is this common ? With Arfid? I can’t eat meat and my daughter does so I end up cooking it for her. I literally cannot stand touching it. It feels contaminated or something.",
          "created_utc": 1734709818.0
        },
        {
          "id": "m31e58t",
          "author": "madeleine59",
          "body": "probably i mean i'm autistic so its about as uncomfortable as the sounds in a grocery store",
          "created_utc": 1734728134.0
        }
      ]
    },
    {
      "id": "m34mfl6",
      "author": "AnonDxde",
      "body": "I agree with the foodborne illness. Also, I feel like it might have parasites on it. That might be not realistic but that’s what I believe.\n\nEdit: I recently found out that one of my safe foods, which is salmon, has parasites that they just kill before they sell the meat. That disgusted me so much. I don’t know if I can ever eat it again. I haven’t tried. Unless I’m drinking. Drinking is a horrible coping mechanism, but it is a coping mechanism.",
      "created_utc": 1734784535.0,
      "score": 0,
      "context": [
        {
          "id": "m2y8rlg",
          "author": "None",
          "body": "Honestly as someone who previously worked fast food; idgaf if you ordered burnt bread with a side of moldy lettuce and mustard; if that's what you want, I'm making it, no questions asked and no comments made. All you're getting is \"Have a great day and enjoy your meal.\" It's not hard and I have ARFID myself. Lol. People lack common decency. Smh.",
          "created_utc": 1734678908.0
        },
        {
          "id": "m2yzu9k",
          "author": "madeleine59",
          "body": "sorry for derailling, but i'm curious as to how working fast food with ARFID was. i feel sick when i touch raw meat even in packaging",
          "created_utc": 1734697008.0
        },
        {
          "id": "m2zvj4a",
          "author": "AnonDxde",
          "body": "Is this common ? With Arfid? I can’t eat meat and my daughter does so I end up cooking it for her. I literally cannot stand touching it. It feels contaminated or something.",
          "created_utc": 1734709818.0
        },
        {
          "id": "m33muik",
          "author": "OctoHelm",
          "body": "For me it’s mainly that my ARFID has all three sub types, the fear of aversive consequences is the worst of the three. I am *terrified* of vomiting and don’t eat meat because of the risk of foodborne illness.",
          "created_utc": 1734761901.0
        }
      ]
    },
    {
      "id": "m35zj4x",
      "author": "Traumarama79",
      "body": "I'm just saying, like, people with arfid have an unfair reputation for being spoiled picky eaters, and this doesn't help.",
      "created_utc": 1734803721.0,
      "score": 1,
      "context": [
        {
          "id": "m35rywr",
          "author": "Traumarama79",
          "body": "I have arfid too but I worked in fast food for years. Do better. These are people who work for a pittance and get no benefits. They're not your enemy. Yes, it's annoying to be inconvenienced, but this is entitled.",
          "created_utc": 1734801073.0
        },
        {
          "id": "m35vjvk",
          "author": "parmaaviolet",
          "body": "did you even read the last part? “annoying to be inconvenienced” are you joking lol. if you say you have arfid and someone puts a food you hate all over your other food surely you wont just say “oh that’s annoying, but oh well” no that shit will ruin your day. my post was just a rant about my experiences in these places. not my fault you got your knickers in a twist",
          "created_utc": 1734802345.0
        },
        {
          "id": "m35yx1w",
          "author": "Traumarama79",
          "body": "I ask them nicely to remake it because I have class solidarity with working people. Not hard.",
          "created_utc": 1734803508.0
        },
        {
          "id": "m35z7vq",
          "author": "parmaaviolet",
          "body": "okay? so do i if they get it wrong.",
          "created_utc": 1734803613.0
        }
      ]
    },
    {
      "id": "m33525b",
      "author": "madeleine59",
      "body": "arfid definitely has overlaps with certain things so its hard to tell where one starts and the other ends lol! if you're curious i can dm resources on autism though i obviously cant diagnose you haha",
      "created_utc": 1734752850.0,
      "score": 3,
      "context": [
        {
          "id": "m2y8rlg",
          "author": "None",
          "body": "Honestly as someone who previously worked fast food; idgaf if you ordered burnt bread with a side of moldy lettuce and mustard; if that's what you want, I'm making it, no questions asked and no comments made. All you're getting is \"Have a great day and enjoy your meal.\" It's not hard and I have ARFID myself. Lol. People lack common decency. Smh.",
          "created_utc": 1734678908.0
        },
        {
          "id": "m2yzu9k",
          "author": "madeleine59",
          "body": "sorry for derailling, but i'm curious as to how working fast food with ARFID was. i feel sick when i touch raw meat even in packaging",
          "created_utc": 1734697008.0
        },
        {
          "id": "m2zvj4a",
          "author": "AnonDxde",
          "body": "Is this common ? With Arfid? I can’t eat meat and my daughter does so I end up cooking it for her. I literally cannot stand touching it. It feels contaminated or something.",
          "created_utc": 1734709818.0
        },
        {
          "id": "m31e58t",
          "author": "madeleine59",
          "body": "probably i mean i'm autistic so its about as uncomfortable as the sounds in a grocery store",
          "created_utc": 1734728134.0
        },
        {
          "id": "m32gl07",
          "author": "AnonDxde",
          "body": "It is just so disgusting! My main diagnosis is bipolar disorder, but I do share some traits with people I know who have autism. Walking on my tiptoes when I was a child, food, aversions, stuff like that.",
          "created_utc": 1734742560.0
        }
      ]
    },
    {
      "id": "m34tuma",
      "author": "AnonDxde",
      "body": "Thank you so much for that offer! I don’t check DM‘s because I get abuse sent to them. I haven’t figured out how to turn them off on mobile. I don’t think I have full-blown autism though. I think that my mood swings are my biggest symptom, and the medication treats that pretty well.I take Depakote, Cymbalta, and Abilify. Hydroxyzine for anxiety.",
      "created_utc": 1734788153.0,
      "score": 1,
      "context": [
        {
          "id": "m2y8rlg",
          "author": "None",
          "body": "Honestly as someone who previously worked fast food; idgaf if you ordered burnt bread with a side of moldy lettuce and mustard; if that's what you want, I'm making it, no questions asked and no comments made. All you're getting is \"Have a great day and enjoy your meal.\" It's not hard and I have ARFID myself. Lol. People lack common decency. Smh.",
          "created_utc": 1734678908.0
        },
        {
          "id": "m2yzu9k",
          "author": "madeleine59",
          "body": "sorry for derailling, but i'm curious as to how working fast food with ARFID was. i feel sick when i touch raw meat even in packaging",
          "created_utc": 1734697008.0
        },
        {
          "id": "m2zvj4a",
          "author": "AnonDxde",
          "body": "Is this common ? With Arfid? I can’t eat meat and my daughter does so I end up cooking it for her. I literally cannot stand touching it. It feels contaminated or something.",
          "created_utc": 1734709818.0
        },
        {
          "id": "m31e58t",
          "author": "madeleine59",
          "body": "probably i mean i'm autistic so its about as uncomfortable as the sounds in a grocery store",
          "created_utc": 1734728134.0
        },
        {
          "id": "m32gl07",
          "author": "AnonDxde",
          "body": "It is just so disgusting! My main diagnosis is bipolar disorder, but I do share some traits with people I know who have autism. Walking on my tiptoes when I was a child, food, aversions, stuff like that.",
          "created_utc": 1734742560.0
        },
        {
          "id": "m33525b",
          "author": "madeleine59",
          "body": "arfid definitely has overlaps with certain things so its hard to tell where one starts and the other ends lol! if you're curious i can dm resources on autism though i obviously cant diagnose you haha",
          "created_utc": 1734752850.0
        }
      ]
    },
    {
      "id": "m384xhu",
      "author": "celestialfairy1998",
      "body": "i have bipolar disorder 2 and autism and adhd and anxiety and arfid so it’s possible",
      "created_utc": 1734832738.0,
      "score": 3,
      "context": [
        {
          "id": "m2y8rlg",
          "author": "None",
          "body": "Honestly as someone who previously worked fast food; idgaf if you ordered burnt bread with a side of moldy lettuce and mustard; if that's what you want, I'm making it, no questions asked and no comments made. All you're getting is \"Have a great day and enjoy your meal.\" It's not hard and I have ARFID myself. Lol. People lack common decency. Smh.",
          "created_utc": 1734678908.0
        },
        {
          "id": "m2yzu9k",
          "author": "madeleine59",
          "body": "sorry for derailling, but i'm curious as to how working fast food with ARFID was. i feel sick when i touch raw meat even in packaging",
          "created_utc": 1734697008.0
        },
        {
          "id": "m2zvj4a",
          "author": "AnonDxde",
          "body": "Is this common ? With Arfid? I can’t eat meat and my daughter does so I end up cooking it for her. I literally cannot stand touching it. It feels contaminated or something.",
          "created_utc": 1734709818.0
        },
        {
          "id": "m31e58t",
          "author": "madeleine59",
          "body": "probably i mean i'm autistic so its about as uncomfortable as the sounds in a grocery store",
          "created_utc": 1734728134.0
        },
        {
          "id": "m32gl07",
          "author": "AnonDxde",
          "body": "It is just so disgusting! My main diagnosis is bipolar disorder, but I do share some traits with people I know who have autism. Walking on my tiptoes when I was a child, food, aversions, stuff like that.",
          "created_utc": 1734742560.0
        },
        {
          "id": "m33525b",
          "author": "madeleine59",
          "body": "arfid definitely has overlaps with certain things so its hard to tell where one starts and the other ends lol! if you're curious i can dm resources on autism though i obviously cant diagnose you haha",
          "created_utc": 1734752850.0
        },
        {
          "id": "m34tuma",
          "author": "AnonDxde",
          "body": "Thank you so much for that offer! I don’t check DM‘s because I get abuse sent to them. I haven’t figured out how to turn them off on mobile. I don’t think I have full-blown autism though. I think that my mood swings are my biggest symptom, and the medication treats that pretty well.I take Depakote, Cymbalta, and Abilify. Hydroxyzine for anxiety.",
          "created_utc": 1734788153.0
        }
      ]
    },
    {
      "id": "m3putt7",
      "author": "AnonDxde",
      "body": "It is possible, but I’m not sure it fits me. My father is a recovering addict who also suffers from chronic bipolar disorder so it’s Occam’s razor🪒",
      "created_utc": 1735121043.0,
      "score": 1,
      "context": [
        {
          "id": "m2y8rlg",
          "author": "None",
          "body": "Honestly as someone who previously worked fast food; idgaf if you ordered burnt bread with a side of moldy lettuce and mustard; if that's what you want, I'm making it, no questions asked and no comments made. All you're getting is \"Have a great day and enjoy your meal.\" It's not hard and I have ARFID myself. Lol. People lack common decency. Smh.",
          "created_utc": 1734678908.0
        },
        {
          "id": "m2yzu9k",
          "author": "madeleine59",
          "body": "sorry for derailling, but i'm curious as to how working fast food with ARFID was. i feel sick when i touch raw meat even in packaging",
          "created_utc": 1734697008.0
        },
        {
          "id": "m2zvj4a",
          "author": "AnonDxde",
          "body": "Is this common ? With Arfid? I can’t eat meat and my daughter does so I end up cooking it for her. I literally cannot stand touching it. It feels contaminated or something.",
          "created_utc": 1734709818.0
        },
        {
          "id": "m31e58t",
          "author": "madeleine59",
          "body": "probably i mean i'm autistic so its about as uncomfortable as the sounds in a grocery store",
          "created_utc": 1734728134.0
        },
        {
          "id": "m32gl07",
          "author": "AnonDxde",
          "body": "It is just so disgusting! My main diagnosis is bipolar disorder, but I do share some traits with people I know who have autism. Walking on my tiptoes when I was a child, food, aversions, stuff like that.",
          "created_utc": 1734742560.0
        },
        {
          "id": "m33525b",
          "author": "madeleine59",
          "body": "arfid definitely has overlaps with certain things so its hard to tell where one starts and the other ends lol! if you're curious i can dm resources on autism though i obviously cant diagnose you haha",
          "created_utc": 1734752850.0
        },
        {
          "id": "m34tuma",
          "author": "AnonDxde",
          "body": "Thank you so much for that offer! I don’t check DM‘s because I get abuse sent to them. I haven’t figured out how to turn them off on mobile. I don’t think I have full-blown autism though. I think that my mood swings are my biggest symptom, and the medication treats that pretty well.I take Depakote, Cymbalta, and Abilify. Hydroxyzine for anxiety.",
          "created_utc": 1734788153.0
        },
        {
          "id": "m384xhu",
          "author": "celestialfairy1998",
          "body": "i have bipolar disorder 2 and autism and adhd and anxiety and arfid so it’s possible",
          "created_utc": 1734832738.0
        }
      ]
    }
  ]
}