{
  "id": "1hl01mo",
  "subreddit": "ARFID",
  "author": "ninetaelz",
  "created_utc": 1734995594.0,
  "title": "Just stop commenting on food. Please. ",
  "selftext": "I want to cry. I get being concerned, really. I know my diet isn't the best. Lol. But commenting on what I am eating and when and asking if I had food before and all that other stuff just stresses me out. Especially *right after* I went to grab food? Especially when the person commenting has judgements on what good is \"good\" and \"bad\" and makes it very clear? Especially when they aren't home half the day anyways? Especially when they dont respect my food choices? \n\nI feel guilty about not eating enough and making people concerned, but I'm trying my best and knowing people are constantly monitoring and watching when/what/how much I eat stresses me out so much. And I have a dietician and therapist too.\n\nI'm trying my best, but it just never feels good enough to people. And it just makes me want to stop trying so hard because even if I eat more and eat more of a variety, it feels like it'll never be enough for them. I wish I could just not care, but.... I do. I dunno. ",
  "url": "https://www.reddit.com/r/ARFID/comments/1hl01mo/just_stop_commenting_on_food_please/",
  "score": 84,
  "num_comments": 11,
  "comments": [
    {
      "id": "m3ii6rf",
      "author": "angelneliel",
      "body": "Yes, because shaming others notoriously heals them!  /s\n\nI think they are simply ignorant, not necessarily malicious. But it triggers me nonetheless, regardless of their intent.\n\nYou have to first assess the boundary. I would suggest saying something along the lines of, \"I have an eating disorder/medical condition. I don't want to hear any comments about food, about my health, or about my body. Respect that or I will have to limit our interactions.\" \n\nI think most people without eating disorders will comment on food and bodies because for them it's often an easy conversation topic.",
      "created_utc": 1734996761.0,
      "score": 18,
      "context": []
    },
    {
      "id": "m3ijjzd",
      "author": "l0stk1tten",
      "body": "I know, friend, I know :(\n\nPestering, shaming, and scrutinising people does not work. For any eating disorder. It only does more damage to an already vulnerable person.\n\nI only have ARFID but have gotten some awful comments and interrogations from people assuming that I'm anorexic that had me reeling imagining how hurt I would be and the damage that their words would do if I actually did have anorexia.\n\nI've learned to just remember how ignorant people are rather than taking it out on myself. The shame is not yours but theirs for their behaviour. Repeat this as many times as you need until it sinks in. Those people couldn't handle what go through every single day, what anyone with any ED goes through.\n\nYou're doing amazing, stay strong and hang in there. Rely on the actual knowledgeable people - your dietician and therapist.",
      "created_utc": 1734997292.0,
      "score": 12,
      "context": []
    },
    {
      "id": "m3igwog",
      "author": "throw0OO0away",
      "body": "This. I have dysmotility and pancreatic insufficiency. My diet is shit, I don’t eat a lot, and I’m tube dependent. Right now, people are sitting around and eating pizza. I had like 5 full bites of Mac n Cheese (I tried to choose something softer and lighter but there wasn’t good options) and my stomach is wrecked.",
      "created_utc": 1734996264.0,
      "score": 6,
      "context": []
    },
    {
      "id": "m3ip9qi",
      "author": "velociraptor56",
      "body": "ARFID parent here… I presume this is a parent or someone living with you. If so, I’m so sorry. Something I’ve deflected to is, my doctor/dietitian says this is fine but I’ll give you their number if you have actual concerns.\n\nAlternatively, I recommend enlisting a friend or friendly relative to deflect for you. Change the subject, or say something positive instead. Or say something negative about the other person, lol. I do it for my kiddo, but we’re lucky I guess that people are generally receptive.",
      "created_utc": 1734999481.0,
      "score": 6,
      "context": []
    },
    {
      "id": "m3itjje",
      "author": "TraditionalClerk9017",
      "body": "Things got a lot better for my son when I set boundaries for our extended family. I said no comments on his food choices, the amount he eats, the nature of what he eats (healthy or not), or his body. Full stop. Those are the rules if you want to spend time with him. It made everyone uncomfortable for like the first two times we got together but then it made things easier.",
      "created_utc": 1735001096.0,
      "score": 4,
      "context": []
    },
    {
      "id": "m3la5rx",
      "author": "angel_of_satan",
      "body": "i feel this. im living w my grandma rn and ik she means well but every single time i eat, even if i look at my plate and am proud bc i have a meat, fruit, veg, and dairy in one meal, she finds a way to comment. \"is that what you're eating?\" \"wheres the protien?\" \"chicken patties are just processed meat and theyre not good for you, you cant just eat those forever you'll get fat\" it makes me wanna rip my hair out and makes me want to just stop eating altogether while im here so i wont have to listen to her comment on every single thing i eat",
      "created_utc": 1735047240.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m3m438e",
      "author": "Lucille11",
      "body": "I feel that in my soul.\n\nI've spent most of my life avoiding eating aroung other people for this very reason. Especially at a social function where I find some food that I like and then I get \"tHaT's AlL yOu'Re EaTiNg?\"\n\nLike, mind your own business. I don't make a big deal or draw attention to it, so why do other people?",
      "created_utc": 1735058472.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m3jva49",
      "author": "Itchy-Ball3276",
      "body": "Have you tried blended meals . They are a great way to add a protein to your diet without the extra swallowing. I usually blend until it’s a little chunky but I like to leave chunks/ ",
      "created_utc": 1735016671.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m3jxy09",
      "author": "Cats_Riding_Dragons",
      "body": "I have a suspicion that “People” in this case means “my parents” and that you’re avoiding saying that in order to manipulate our responses to your post. Random ppl commenting on unhealthy eating vs your parents doing so are very different things, so which is it…\n\nPersonally my parents/family made a lot of comments, which is understandable considering they were being forced to watch their daughter slowly kill herself from malnutrition. If they hadnt been making comments then that would mean they didnt care if their daughter died or not. Concern is a sign of love, when they stop making comments thats when you should question the relationship. Yes these types of comments arent usually helpful so i agree with you on that, but this post doesn’t really seem to be about that and how to handle it, it seems to be a rant about the specific ppl making comments and thats what im pushing back against bc its truly sad to see you want to punish ppl for caring about you. Youre blaming them for their reaction but not willing to see that their reactions are that way bc they love you.",
      "created_utc": 1735018010.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m3p145r",
      "author": "BlanKitt",
      "body": "I have a story! I’m fairly tolerant of queries and questions or comments about my eating habits and whatnot when it’s a new person or stranger, and usually don’t mind it unless they’re really pushing it. Then I get frustrated at myself unfortunately and depressed.\n\nWent to Turkey and we were at a family friend’s relative’s house, where they had prepared a ton of local cuisine. All the people that didn’t know me (which was 95% of the people there), particularly the women, were commenting about how I wasn’t eating anything and asking if I didn’t eat meat, then red meat, or whatnot and one even asked if I’m anemic (I’m not, somehow). This is all second hand as I don’t speak much Turkish, and it was translated by friends, but anyway! Surprisingly one person who I’d met a few times before came to my defense. I’m not entirely sure what was said, but I appreciated it a lot, as it stopped further inquiries. \nThis woman doesn’t even fully understand how bad I have it with food, but she wanted to help. 🥰 Maybe she saw how it was kinda a lot of people ganging up on me in a way haha. ",
      "created_utc": 1735101419.0,
      "score": 3,
      "context": [
        {
          "id": "m3ijjzd",
          "author": "l0stk1tten",
          "body": "I know, friend, I know :(\n\nPestering, shaming, and scrutinising people does not work. For any eating disorder. It only does more damage to an already vulnerable person.\n\nI only have ARFID but have gotten some awful comments and interrogations from people assuming that I'm anorexic that had me reeling imagining how hurt I would be and the damage that their words would do if I actually did have anorexia.\n\nI've learned to just remember how ignorant people are rather than taking it out on myself. The shame is not yours but theirs for their behaviour. Repeat this as many times as you need until it sinks in. Those people couldn't handle what go through every single day, what anyone with any ED goes through.\n\nYou're doing amazing, stay strong and hang in there. Rely on the actual knowledgeable people - your dietician and therapist.",
          "created_utc": 1734997292.0
        }
      ]
    },
    {
      "id": "m3jvzwp",
      "author": "bellaismyno1dog",
      "body": "Thanks for this. I will use it tomorrow when family asks why my 3 year old still isn’t eating or sleeping.",
      "created_utc": 1735017029.0,
      "score": 2,
      "context": [
        {
          "id": "m3ip9qi",
          "author": "velociraptor56",
          "body": "ARFID parent here… I presume this is a parent or someone living with you. If so, I’m so sorry. Something I’ve deflected to is, my doctor/dietitian says this is fine but I’ll give you their number if you have actual concerns.\n\nAlternatively, I recommend enlisting a friend or friendly relative to deflect for you. Change the subject, or say something positive instead. Or say something negative about the other person, lol. I do it for my kiddo, but we’re lucky I guess that people are generally receptive.",
          "created_utc": 1734999481.0
        }
      ]
    }
  ]
}