{
  "id": "1hsp5sa",
  "subreddit": "ARFID",
  "author": "grilledghum",
  "created_utc": 1735918589.0,
  "title": "What type of ARFID do you have?",
  "selftext": "Avoidant, aversive, restrictive, or arfid plus?\n\nI think I personally am mostly avoidant, but my best friend thinks I am aversive too because I have emetophobia (but I think the fear is mostly related to others vomiting not myself), and I don’t think I am severe enough to have arfid plus. ",
  "url": "https://i.redd.it/ttvas1r7tsae1.jpeg",
  "score": 782,
  "num_comments": 342,
  "comments": [
    {
      "id": "m57eqm3",
      "author": "podgoricanka93",
      "body": "“ARFID Plus” lol I have the premium version of ARFID",
      "created_utc": 1735922695.0,
      "score": 280,
      "context": []
    },
    {
      "id": "m57595a",
      "author": "No_Evidence_19",
      "body": "Very much avoidant and restrictive",
      "created_utc": 1735919789.0,
      "score": 168,
      "context": []
    },
    {
      "id": "m5788cf",
      "author": "Cyber-Cafe",
      "body": "Texture based avoidant. It fucking sucks, because the flavor/color/sight of most food does not bother me at all. But I’m very sensitive to textures in general and food in my mouth is no different.",
      "created_utc": 1735920716.0,
      "score": 120,
      "context": []
    },
    {
      "id": "m574ck8",
      "author": "meowtimegang",
      "body": "I think I am both avoidant and aversive.",
      "created_utc": 1735919506.0,
      "score": 57,
      "context": []
    },
    {
      "id": "m574j9n",
      "author": "emptyhellebore",
      "body": "All 3 right now.",
      "created_utc": 1735919564.0,
      "score": 48,
      "context": []
    },
    {
      "id": "m57dhm6",
      "author": "AdhesivenessOk5534",
      "body": "Aversive and restrictive \n\nI have a phobia of vomiting and I have fucked up hunger signals from the ARFID turning into anorexia when I was 16 \n\nI've recovered from Ana but the ARFID remains",
      "created_utc": 1735922319.0,
      "score": 39,
      "context": []
    },
    {
      "id": "m572lxv",
      "author": "None",
      "body": "I have aversive. History of severe anxiety and panic attacks which I believe predisposed me to ARFID.",
      "created_utc": 1735918958.0,
      "score": 29,
      "context": []
    },
    {
      "id": "m5752vk",
      "author": "Less_Character_8544",
      "body": "Restrictive, definitely",
      "created_utc": 1735919734.0,
      "score": 22,
      "context": []
    },
    {
      "id": "m576en9",
      "author": "Dramatic-Growth1335",
      "body": "all 3",
      "created_utc": 1735920148.0,
      "score": 20,
      "context": []
    },
    {
      "id": "m57g58x",
      "author": "Nova-Prospekt",
      "body": "Trifecta gamers rise up",
      "created_utc": 1735923115.0,
      "score": 19,
      "context": []
    },
    {
      "id": "m574swi",
      "author": "AerolothLorien666",
      "body": "Avoidant.",
      "created_utc": 1735919647.0,
      "score": 17,
      "context": []
    },
    {
      "id": "m5770tp",
      "author": "Armayra",
      "body": "Aversive for sure. Too many times getting sick from food before being able to sort out my allergies left me with trust issues around eating. I tend to refer to it as being betrayed by food.",
      "created_utc": 1735920340.0,
      "score": 15,
      "context": []
    },
    {
      "id": "m57d3ag",
      "author": "Knitting-Moose",
      "body": "Aversive babyyyy 😎 i do not want to choke and literally everything hurts to eat at least a little bit",
      "created_utc": 1735922199.0,
      "score": 15,
      "context": []
    },
    {
      "id": "m57w9jn",
      "author": "businessgoos3",
      "body": "I always heard ARFID+ was ARFID with symptoms that developed later of body-image based eating disorders (usually AN). The key being that the ARFID distinctly came first, then the body-image ED came after and is closely related to the ARFID because of the existing food restrictions (and sometimes body image issues that come from ARFID).\n\nIf we're using the infographic's definitions, I have ARFID+. If we're using the definition I listed above, I have whatever all 4 types combined would be. I propose the name \"ARFID :(\" because it's just sad, lmao.",
      "created_utc": 1735927921.0,
      "score": 13,
      "context": []
    },
    {
      "id": "m5797v7",
      "author": "purple_bin",
      "body": "all 3 🥲",
      "created_utc": 1735921019.0,
      "score": 11,
      "context": []
    },
    {
      "id": "m57djls",
      "author": "Accomplished-Act-178",
      "body": "This is super interesting..my child has all three",
      "created_utc": 1735922335.0,
      "score": 8,
      "context": []
    },
    {
      "id": "m57ja1a",
      "author": "l0rare",
      "body": "All of the above ✅",
      "created_utc": 1735924057.0,
      "score": 7,
      "context": []
    },
    {
      "id": "m587rdl",
      "author": "HungriestGirl",
      "body": "Im 100% aversive. So much anxiety while eating",
      "created_utc": 1735931288.0,
      "score": 6,
      "context": []
    },
    {
      "id": "m577pmi",
      "author": "baasheepgreat",
      "body": "A classic avoidant and restrictive",
      "created_utc": 1735920556.0,
      "score": 9,
      "context": []
    },
    {
      "id": "m57rnnj",
      "author": "EDS_Eliksni",
      "body": "ARFID Plus sounds like a fancy subscription… wish it felt that way lol",
      "created_utc": 1735926558.0,
      "score": 6,
      "context": []
    },
    {
      "id": "m580atx",
      "author": "ExplanationAny3073",
      "body": "Aversive mostly, but definitely all three, Aversive is what affects my daily life 🥲 it sucks that my brain thinks all food could kill me",
      "created_utc": 1735929110.0,
      "score": 5,
      "context": []
    },
    {
      "id": "m57donc",
      "author": "aneimansf",
      "body": "Lucky me I get to have all of them, yippee",
      "created_utc": 1735922378.0,
      "score": 4,
      "context": []
    },
    {
      "id": "m57p55m",
      "author": "GobiTheDragon",
      "body": "Aversive 100%, the whole reason I now have a feeding tube is because I was so scared of throwing up I stopped eating and drinking.",
      "created_utc": 1735925814.0,
      "score": 4,
      "context": []
    },
    {
      "id": "m57rj53",
      "author": "MultiFandomShipperr",
      "body": "I think mainly restrictive with some aversive sprinkled in",
      "created_utc": 1735926522.0,
      "score": 4,
      "context": []
    },
    {
      "id": "m578ysr",
      "author": "theatregirl1987",
      "body": "Avoident. Mostly texture based. \n\nOccasionally I get a little bit of restrictive, but it's rare and more to do with my BED then the ARFID.",
      "created_utc": 1735920942.0,
      "score": 7,
      "context": []
    },
    {
      "id": "m57ea7c",
      "author": "Emergency_Pizza1803",
      "body": "I'm definitely avoidant. Today picking off tomatoes from a pizza made me gag multiple times because of the texture.",
      "created_utc": 1735922559.0,
      "score": 7,
      "context": []
    },
    {
      "id": "m57r6ey",
      "author": "r0b0rob",
      "body": "Avoidant definitely",
      "created_utc": 1735926417.0,
      "score": 6,
      "context": []
    },
    {
      "id": "m57t74f",
      "author": "deedeemayy",
      "body": "avoidant",
      "created_utc": 1735927011.0,
      "score": 5,
      "context": []
    },
    {
      "id": "m57fwnw",
      "author": "madeleine59",
      "body": "all!!!",
      "created_utc": 1735923044.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m57r853",
      "author": "crypt1cat",
      "body": "all of them😭 and having GERD does not help",
      "created_utc": 1735926432.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m580l6l",
      "author": "lykexomigah",
      "body": "aversive",
      "created_utc": 1735929194.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m583mjr",
      "author": "Pristine-Frosting-20",
      "body": "Strictly Aversive.",
      "created_utc": 1735930088.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m586v53",
      "author": "None",
      "body": "Adversive. Fear of choking on solid foods. Liquids only.  3 years of this now in 2025. Only success I have is Starbursts, chocolate, and ice cream. I feel so dumb and I can't stand it. I just want to eat solid foods like everyone else.  😔",
      "created_utc": 1735931026.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m58py0l",
      "author": "None",
      "body": "Restrictive. I can eat just about anything these days but it's more natural for me to ignore hunger cues and skip it. I hate planning meals, cooking, touching and storing food, doing dishes, cleaning up food, etc. I'm pretty ambivalent about the act of eating. So I end nearly every day on a caloric deficit. Weed helps with it.",
      "created_utc": 1735936778.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m594csl",
      "author": "Naixee",
      "body": "Where's the \"everything taste like shit\" one😭 I swear only like 3 foods max taste good enough to eat. Starting to wonder if my taste buds are the problem. Even tho textures are a huuuge thing as well",
      "created_utc": 1735941150.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m5dcdw5",
      "author": "thatsnuckinfutz",
      "body": "Oooh i have ARFID*plus* lol\n\nPrimarily Restrictive with Avoidant features...no fearful traits that I can recall.\n\nI just hate food and was convinced after Y2K i would have a meal-in-a-pill type options 😂\n\nETA: i realized i do have a fear-based trait surrounding g.i discomfort (IBS gang!) with some foods so I'm actually a triple-threat.",
      "created_utc": 1736007182.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m578jtr",
      "author": "Hanhula",
      "body": "Strong avoidance and aversive. I used to not be able to eat a lot of crisps, despite their status as a safe food, because I was worried they'd cut my mouth.\n\n... Writing that has made me realise that the fucking things DID cut my mouth yesterday! I bit down wrong on a crisp and it stabbed where I'm missing a tooth, and I've been wondering today why that area feels injured. Well, at least that shows I've made a lot of progress on handling that one specific case.\n\nETA: I've suspected restrictive in the past, but a lot of those issues were actually motivation issues stemming from deficiencies and other disorders, so that's mostly sorted and not part of ARFID for me.",
      "created_utc": 1735920815.0,
      "score": 4,
      "context": []
    },
    {
      "id": "m57c3lh",
      "author": "brightonkennedy",
      "body": "all 3",
      "created_utc": 1735921899.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m57z0rb",
      "author": "Nic406",
      "body": "Just restrictive. It’s getting slowly better but it’s still up and down. Currently I have decided mac and cheese or meatballs are a adhd hyperfixation",
      "created_utc": 1735928731.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m583m0i",
      "author": "crittersleaze",
      "body": "Started out at strictly aversive but bled into experiencing symptoms/tendancies of the other two",
      "created_utc": 1735930083.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m586zs1",
      "author": "dontsummondemons",
      "body": "I am restrictive",
      "created_utc": 1735931063.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m589wv9",
      "author": "AdministrativeTwo367",
      "body": "I am avoidant and aversive, but more aversive than avoidant. I am deathly afraid of vomiting and food poisoning, so I rarely eat meats that can make you sick. I typically only eat red meat like steak and beef.",
      "created_utc": 1735931925.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m58dcwa",
      "author": "imhereforthemeta",
      "body": "Avoidant and Aversive. Yall gatta let me know if anyone else operates this way: I have a shockingly diverse palette, but have illogical things ive decided are scary (texture can be a part of it, but sometimes i literally just pick something in my brain at random) \n\nFor example: I don't do yogurt due to smell and texture, but id rather do 500 situps than eat a burger or anything between two slices of bread even though it smells good to me.",
      "created_utc": 1735932951.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m58kjoj",
      "author": "bruhkms18",
      "body": "avoidant & aversive. having ARFID is actually how i was able to get my autism diagnosis as a child",
      "created_utc": 1735935113.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m58kwxr",
      "author": "Useful-Actuator8549",
      "body": "big time aversive! \ni can logically tell myself that foods are likely safe, other people eat them and don’t get sick. \nbut then after eating them i’ll panic and start to worry that suddenly i’ll be sick, especially if i eat at a restaurant. i’ll feel like i have to go home immediately.",
      "created_utc": 1735935228.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m58pfpr",
      "author": "Ok_Lingonberry6957",
      "body": "mostly restrictive",
      "created_utc": 1735936623.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m58pt6g",
      "author": "BodyFold",
      "body": "primarily restrictive, then avoidant. not fear based at all really, eating is just a generally extremely uncomfortable/distressing task, and my hunger signals are absolutely fucked from a few brushes with anorexia. not fun !!!",
      "created_utc": 1735936737.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m58rrs0",
      "author": "Mysterious-Island-71",
      "body": "I already had a fear of throwing up before this. But I’m def avoidant most the time.. but when stressed both avoidant and restrictive.",
      "created_utc": 1735937333.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m58ts3s",
      "author": "ShishkabobNinja",
      "body": "Used to be Avoidant and Aversive together (my diet was so limited, but tbh it seems to have benefitted me in the long run because I have much less of an aversion or negative reaction to foods I didn't try when I was younger than the ones I did).\n\nI have spent years slowly working on introducing more foods at my own pace, and I am happy to say I no longer fall under the Avoidant type!\n\nUnfortunately I have seemed to develop the Restrictive type in it's place. At least when I do eat it's more varied? 😅😅",
      "created_utc": 1735937942.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m58tuvt",
      "author": "amorousAlligator",
      "body": "All three lol, I guess mostly aversive and restrictive though",
      "created_utc": 1735937965.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m591ah6",
      "author": "beaniebaby0929",
      "body": "avoidant and restrictive, fruits and veggies actually look good but the textures are so hard to bite into….and i think years of not being able to feel normal eating has lead to rather disinterest in it (as well as adhd can’t read my bodies signals)",
      "created_utc": 1735940231.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m593knu",
      "author": "miab2020",
      "body": "Definitely aversive. My contamination ocd fuels my arfid",
      "created_utc": 1735940915.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m59huwu",
      "author": "singlepaIerose",
      "body": "all three but restrictive is the worst for me",
      "created_utc": 1735945480.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m59id6y",
      "author": "Amazing-Cellist3672",
      "body": "Do I get a prize for being all 3?",
      "created_utc": 1735945649.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m59utw0",
      "author": "KiraLonely",
      "body": "I was Avoidant and Restrictive most of my life. Restrictive because I had so many bad experiences with food, and because my palette was so limited, and because my appetite was horribly small my whole life. Eating was a difficult hurdle every day, because just eating what I liked and what I was comfortable eating in quantity was never enough. \n\nTurns out I had a combination of issues. My appetite is better now, and Restrictive isn’t as applicable, but Avoidant definitely still is. It’s tough still. Hard to explain to people without coming across as entitled. I spent my whole childhood learning how to lie to parents (my own and my friends) that I’d already eaten so I wouldn’t seem rude if I rejected food. Or learning how to convince my parents to let me leave the table after barely eating because trying to eat the food they offered made my physically gag against my will, no matter how hard I tried not to. \n\nStuff a lot of us have experienced. Honestly I never had negative experiences with the process of eating, or rather, negative experiences never stuck with me enough to limit food. I have GERD, so you’d think I’d worry about what worsens the condition, but I’m usually more focused on getting foods in me that I can handle than I am worried about what is better or worse for the my acid reflux. It’s one of those many things that I’d love to look into and focus on one day, but I need to make sure I’m not failing nutrition first.",
      "created_utc": 1735949844.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m5ad2jr",
      "author": "RainbowsAndHomicide",
      "body": "Lol I’m sorry but arfid plus makes me feel like they’re trying to sell me another streaming service",
      "created_utc": 1735956143.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m5agckr",
      "author": "Raderg32",
      "body": "Does anyone have this image with a couple more pixels? It would be nice to be able to read what it says.",
      "created_utc": 1735957336.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m5b4bsl",
      "author": "knowledgelover94",
      "body": "I’m autistic and I think I just have avoidant. It’s gotten better but I think there’s tons of foods I’ll never appreciate due to sensory issues.",
      "created_utc": 1735966778.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m5b600g",
      "author": "DisagreeableCompote",
      "body": "Why did I read this at first as “3 types of bread” and I was like ohhh, the white kind, the brown kind, and that repulsive kind my mom used to get that had fucking seeds in it and it made me want to die.",
      "created_utc": 1735967534.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m5b8g5z",
      "author": "DisagreeableCompote",
      "body": "I have all 3 to an extent. Primarily avoidant, but I get restrictive too, (I also suffer from body dysmorphia and anorexia…) but even when I’m in recovery from the anorexia and trying to eat healthy I will literally just completely forget to eat sometimes.\n\nAlso I’m realizing right now aversive…. I do have food trauma of being forced to eat things in the past. But eating sometimes makes me very tired and so for the past few years I have deliberately avoid eating dinner too early… which sometimes leaves me at facing my bedtime having eaten nothing at all…. and I haven’t eaten lunch in like 15 years for partly the same reason but maybe it’s tied to the anorexia also. I’m not sure.",
      "created_utc": 1735968661.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m5bqjdt",
      "author": "A_Very_Living_Me",
      "body": "My wife's family has varying degrees of arfid.\n\nWife has avoidant with some degree of aversion, restrictive symptoms tends to rear it's head in times of depression or anxiety. She's been a champ trying things that I set out for her, and through that found a love for things like avocado, salmon (with mild spices), basic Tex Mex like quesadillas.and tacos, etc.\n\nHer siblings are more or less severe, one sibling can only pretty much consume ham pineapple pizza and chocolate milk (and some basic plain foods like corn flakes and juice)\n\nAnother is severely avoidant/restrictive, can only reliably eat McDonald's plain Hamburgers with only ketchup, pizza with ketchup (tomato sauce and Amy kind of cheese is a no-go), plain beef, and pineapple, and sometimes chicken wings. Otherwise she can go days without eating no problem.\n\nI don't have arfid myself, but I've learned so much from them and  this community and even been successfully able to teach others around me about what it is and how to affectively tell them how it's not just \"picky eating\"",
      "created_utc": 1735978682.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m5c249b",
      "author": "Fit-Cauliflower-9229",
      "body": "A bit of avoidant but moslty fear! Exposure therapy helped me a lot to be less fearful, and taking small steps helped me reintroduce food I didn’t eat for 6years",
      "created_utc": 1735986114.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m5cb4vm",
      "author": "None",
      "body": "3 outta 3 aint bad... wait...",
      "created_utc": 1735991731.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m5cejs3",
      "author": "spring-sapling",
      "body": "Mostly avoidant, but also trauma related I think? If that's a possibility?",
      "created_utc": 1735993656.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m5d2cc7",
      "author": "IcedBaeby04",
      "body": "Used to have restrictive and avoidant but since i found different cuisines and foods that i actually like I've become kind of a foodie. So now it's only avoidant.",
      "created_utc": 1736003765.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m5edeh8",
      "author": "Snowy_Sasquatch",
      "body": "Out of interest, where did this poster originate from? Where I am from, you really need to have a high PARDI score for at least two of those types to reach the threshold for ARFID but there is also an additional criteria that needs to be met to be diagnosed.",
      "created_utc": 1736018721.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m5iqq2w",
      "author": "SakuHusky",
      "body": "Got the premium subscription",
      "created_utc": 1736084936.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m57cqg7",
      "author": "seaurchin76",
      "body": "Honestly all of them, I think it depends on the day 😭 there’s a lot of foods I have texture issues with that make me gag and feel nauseous and of course fear based arfid comes in because I don’t want to get sick. Some days I have no interest in food period.",
      "created_utc": 1735922092.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m57ffcw",
      "author": "littleghool",
      "body": "Avoidant. Big sensory issues that teams up with my ASD",
      "created_utc": 1735922901.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m57xfpz",
      "author": "Speed_Plastic",
      "body": "Avoidant with a bit of restrictive",
      "created_utc": 1735928264.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m582ysp",
      "author": "cowfan100",
      "body": "primarily avoidant and aversive for me. i think the sensory part feeds the fear of negative consequences part for me as i get really panicked when i have to eat a food i know will make me gag (or worse) due to its texture or other sensory factors. i also have some pretty intense contamination anxiety about the food i eat, especially when it‘s made by another person.",
      "created_utc": 1735929896.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m597vrb",
      "author": "dermaria",
      "body": "avoidant",
      "created_utc": 1735942243.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m57dpml",
      "author": "brandielynng29",
      "body": "I’m VERY avoidant",
      "created_utc": 1735922386.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m57e9jj",
      "author": "my-atlantis",
      "body": "avoidant for sure",
      "created_utc": 1735922553.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m57gbx4",
      "author": "heartoffiction",
      "body": "Avoidant 100%. It’s all about those textures",
      "created_utc": 1735923171.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m57m7s4",
      "author": "sparkletrashtastic",
      "body": "Avoidant and restrictive. Slightly aversive, but more to long term fears like hypertension from too much salty food, cancer from processed meats, tooth decay from sugary drinks and candies. I still eat those things, but doing so comes with a lot of anxiety sometimes.",
      "created_utc": 1735924942.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m57xu0b",
      "author": "AngryCalibrachoa",
      "body": "All three, mostly fear-based and textural issues. I have really extreme emetophobia, and I won’t eat foods that my brain thinks “won’t mix” in my stomach.\nIt’s really stupid logic, but it’s something I’ve been doing for a decade and some years now. I hope I overcome it someday.",
      "created_utc": 1735928381.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m5831ts",
      "author": "trixiewutang",
      "body": "Avoidant. I actually have Covid right now and completely lost my taste and I said I wish I didn’t have a texture issue, cause I could probably blindfold myself and eat anything right now but can’t cause of textures.",
      "created_utc": 1735929922.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m579fwb",
      "author": "Thatdogthattellspuns",
      "body": "All three. Last mostly because of meds i think",
      "created_utc": 1735921087.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m579mjw",
      "author": "userr456721",
      "body": "All of the above 🥲",
      "created_utc": 1735921143.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m57gpzv",
      "author": "Nachtwaechterin",
      "body": "yes. (though the disinterested part is most prominent now, with some sensory sprinkled in)",
      "created_utc": 1735923288.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m57woes",
      "author": "Taurus420Spirit",
      "body": "#3",
      "created_utc": 1735928041.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m57x8lq",
      "author": "MyMoreOriginalName",
      "body": "Definitely all of them T-T",
      "created_utc": 1735928206.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m57xsdk",
      "author": "detectivecatmom",
      "body": "I’d say arfid plus, and it tends to fluctuate based on many different factors. Mental state, time of year, time of month (female), have I been sick recently, etc",
      "created_utc": 1735928367.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m57zsj8",
      "author": "killrtaco",
      "body": "All the above?",
      "created_utc": 1735928959.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m580kdx",
      "author": "HookerFace81",
      "body": "All",
      "created_utc": 1735929188.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m580xsj",
      "author": "Plastic_Regular_8097",
      "body": "All 😭",
      "created_utc": 1735929299.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m587042",
      "author": "m0chaluvv-2121",
      "body": "all of above",
      "created_utc": 1735931066.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m589hdv",
      "author": "geekgeek2019",
      "body": "All lmao",
      "created_utc": 1735931797.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m58be7m",
      "author": "glamourise",
      "body": "my boyfriend is lack of interest. i really am hoping he will get help this year. it’s been going on a long time",
      "created_utc": 1735932367.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m58eqqk",
      "author": "Lexivah",
      "body": "Somehow, I am all three. Mostly the first two (the sensory issues feeding into the fear), but I do find eating to be a chore most of the time.",
      "created_utc": 1735933360.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m58eu96",
      "author": "Substantial-Day6689",
      "body": "ALL",
      "created_utc": 1735933389.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m58gsea",
      "author": "CrisCanadian",
      "body": "Very much avoidant and restrictive. Textures have been a huge issue since age 2 and at 48 I’m still struggling with it while I’m in post treatment",
      "created_utc": 1735933967.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m58kbct",
      "author": "tittylamp",
      "body": "all 3 and then some",
      "created_utc": 1735935041.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m58kh2v",
      "author": "poppunkdaddy",
      "body": "i have all 3 i’m winning",
      "created_utc": 1735935090.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m58ny14",
      "author": "eggsoda23",
      "body": "Avoidant 100%.",
      "created_utc": 1735936165.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m58o46u",
      "author": "acidinbath",
      "body": "restrictive avoidant formme",
      "created_utc": 1735936218.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m58qvpi",
      "author": "CherrieBomb211",
      "body": "Avoidant and Aversive. Doesn’t help I do have a medical condition that worsened the aversive side of it all.\n\nSo I’m ARFID PLUS. I’m a bonus",
      "created_utc": 1735937061.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m58rndr",
      "author": "Chemical_Ad2267",
      "body": "All three of the above",
      "created_utc": 1735937296.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m58rwza",
      "author": "Cut-Unique",
      "body": "Definitely avoidant, but tbh I've noticed behavior patterns associated with the other two as well.",
      "created_utc": 1735937376.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m58sqfj",
      "author": "Anti-MonitorXXX",
      "body": "Restrictive and avoidant. But I lean more restrictive.",
      "created_utc": 1735937624.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m58ucsb",
      "author": "raddcat_",
      "body": "avoidant + restrictive",
      "created_utc": 1735938114.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m58xdbv",
      "author": "lizardassbitch",
      "body": "mostly restrictive, sometimes avoidant",
      "created_utc": 1735939034.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m58xygb",
      "author": "aelbaum",
      "body": "My daughter is definitely Restrictive. For anyone else who also classifies as restrictive, have you ever been diagnosed with anything or given information as to the cause?",
      "created_utc": 1735939212.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m58z5wn",
      "author": "Euphemia-Alder",
      "body": "ARFID plus! I experience all three.",
      "created_utc": 1735939581.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m58zw3d",
      "author": "LargeBreasts69",
      "body": "Avoidant",
      "created_utc": 1735939803.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m58zzmf",
      "author": "missredshoes_",
      "body": "Plus - avoidant and restrictive (sometimes aversive) 🤦‍♀️",
      "created_utc": 1735939833.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m591u4q",
      "author": "un-pamplemousse",
      "body": "I think Im also avoidant despite having emetophobia. I’m horrified of throwing up but usually I don’t think when I try new foods that’s what I’m worried about, I think I just hate them lol",
      "created_utc": 1735940398.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m592nw7",
      "author": "dmlzr",
      "body": "All three?",
      "created_utc": 1735940643.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5955kb",
      "author": "One_red_boot",
      "body": "My 13yr old has all three",
      "created_utc": 1735941393.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5960h9",
      "author": "d20damage",
      "body": "Avoidant and restrictive",
      "created_utc": 1735941661.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5965es",
      "author": "princessuuke",
      "body": "Avoidant 100%",
      "created_utc": 1735941704.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m596bqr",
      "author": "Enzoid23",
      "body": "Mostly sensory and fear, sometimes its disinterest though. Most of my family rhinks its disinterest (and thus invalid) or fear (invalid) and not usually sensory (tbh probably also invalid) thoufh 😔\n\n*by invalid I mean to my family, not genuinely invalid",
      "created_utc": 1735941759.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m597ncb",
      "author": "EnbySquishmallow22",
      "body": "Avoidant and aversive. It sucks because it makes my diet pretty limited and it has been worse again lately which sucks because for awhile I was actually making some very small progress. And now it's gone again and I have to start all over. Again. 😭",
      "created_utc": 1735942171.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m59bwtm",
      "author": "Shoobledoorp",
      "body": "Arfid plus, yayyyyy",
      "created_utc": 1735943532.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m59dpg3",
      "author": "Sikkemi",
      "body": "I think I relate mostly to avoidant AFRID however I deffinitely also have aversive and restrictive AFRID. Today i ordered my favourite tortilla with NO CHEESE CUBES. Guess what, it had those disgusting textured cubes in it. I had already eaten half of it because it looked like it had nothing unwanted in it. I was super ashamed to tell the people working there so I just ate my fries with ketchup as I always do. And if someone didn’t notice I ABSOLUTELY HATE CHEESE I EVERY TYPE OF WAY!",
      "created_utc": 1735944112.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m59ewco",
      "author": "Complete-Sir-2620",
      "body": "avoidant and aversive",
      "created_utc": 1735944501.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m59hun4",
      "author": "brokengirl89",
      "body": "Aversive/restrictive. I am allergic and intolerant to so many different foods that it’s taken me years to find foods that don’t make me feel really sick after I eat them. It’s a little better now that I’ve figured out I can’t eat alliums or barley, or stevia and that I’m allergic to peaches (alongside my severe lactose intolerance). I can finally eat a meal without feeling super unwell. But sometimes my body just rejects food for no reason that I can tell. Pair that with emetophobia and OCD around contamination and food safety and it’s just easier some days not to eat. Not to mention I hate the feeling of my body digesting food (autistic) and tend to get quite tired after I eat which messes with my productivity. My body and mind really struggle to deal with the reality of needing constant sustenance day after day. I wish I could just eat meal replacements forever.",
      "created_utc": 1735945477.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m59j1w8",
      "author": "Alarow",
      "body": "Only avoidant",
      "created_utc": 1735945878.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m59mxg1",
      "author": "NoriFinn",
      "body": "I have all of them but my fear is more fear of the unknown. If I can’t predict what it will be like that freaks me out",
      "created_utc": 1735947190.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m59nir0",
      "author": "lily_fairy",
      "body": "im doing better overall now but when i was kid i definitely had all 3 types. had sensory issues with all red food and certain textures. had pretty intense emetophobia (fear of throwing up). and i generally did not ever feel that hungry so eating just felt like a chore. i think avoidant was the strongest and most consistent type for me.",
      "created_utc": 1735947393.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m59o4fe",
      "author": "ndlesbian",
      "body": "avoidant and restrictive, more avoidant though and the restrictive is enhanced by my meds decreasing my appetite. \n\nalso being chronically ill and disabled and as a result, tired and fatigued all the time does not help bc I love baking (cooking too, but less so) but I'm always to exhausted to do it",
      "created_utc": 1735947598.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m59raxj",
      "author": "pointlesssoup",
      "body": "all 3 but mostly avoidant and restrictive",
      "created_utc": 1735948667.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m59su5x",
      "author": "No_Soft560",
      "body": "Avoidant. Mostly based on texture, sometimes based on taste.",
      "created_utc": 1735949185.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m59u87h",
      "author": "Professional-Stock-6",
      "body": "Generally restrictive, aversive comes in swinging at times and as it does, I also become avoidant",
      "created_utc": 1735949646.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5a0ku3",
      "author": "mykeuk",
      "body": "Mine's avoidant. I wish I could eat more healthily but the textures are just vile to me",
      "created_utc": 1735951782.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5a188j",
      "author": "AetherDrew43",
      "body": "I think I'm the avoidant type, but also aversive.\n\nI'm not afraid of choking or vomiting, just the thought of putting something that might taste terrible to me is gross.\n\nTextures are also a big ick for me, as well as the way food looks.",
      "created_utc": 1735952006.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5a1ep6",
      "author": "goldfishmuncher",
      "body": "85% avoidant and 15% restrictive. if there are no foods in the house or in my current mind that interest me i don't want to eat, no matter how hungry i am. :(",
      "created_utc": 1735952068.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5a2lea",
      "author": "MysticSnowfang",
      "body": "Avoident and restrictive.\nAlso sometimes the very idea of food makes me revulsed.",
      "created_utc": 1735952475.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5a3ct2",
      "author": "thereaintshitcaptain",
      "body": "Avoidant and aversive. Textures really bother me and I have a fear of choking and vomiting. I also really get uncomfortable by the feeling of fullness",
      "created_utc": 1735952737.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5a5687",
      "author": "FriendlyBeneficial",
      "body": "Avoidant and aversive, but definitely more avoidant.",
      "created_utc": 1735953366.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5a6lru",
      "author": "amh8011",
      "body": "All of the above but I think avoidant came first. I think restrictive and aversive came after due to GI problems. I’m still figuring out what those GI problems are but it’s really hard to eat when everything causes pain.",
      "created_utc": 1735953862.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5a6tlo",
      "author": "Moist_Committee_1056",
      "body": "Avoidant!",
      "created_utc": 1735953938.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5aaurj",
      "author": "power36113",
      "body": "Avoidant and aversive",
      "created_utc": 1735955351.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5abqth",
      "author": "Strawberrylove_",
      "body": "I’m Aversive 😭",
      "created_utc": 1735955666.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5abxf9",
      "author": "SPinc1",
      "body": "Avoidant. A lot of textures, the way something looks, the smell or simply the taste just makes me gag or causes extreme discomfort. A lot of vegetables, all seafood, some fruits, most meat...\n\nBut I found ways around it to try and eat as healthy as I can. I can eat ground beef or chicken nuggets, I can eat home made soups that have been pureed, beans, most dairy, mixed eggs, sausage, bread of course, etc. I try not to eat or drink too much sugar, but I do love salty snacks which are no better.",
      "created_utc": 1735955731.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5ac1qm",
      "author": "TashaT50",
      "body": "ARFID plus: Avoidant & Restrictive with a little but of Aversive mixed in for fun. Avoidant for me includes looks, texture, taste, and smell but I’m not limited to a color like my food isn’t beige. Restrictive is more I have no interest in meals, preparing food is too much work so I won’t bother if I’m the only one eating, I’d be happy to get all my nutrition in a pill, eating meals is exhausting. I’m a snacking grazer so most of the time I get enough calories, and I’ve gotten better over 50+ years of keeping some more nutritious snacks in rotation as well as taking supplements. Over the last few years with a new housemate who helps with shopping and meal prep I’ve gotten better about having two fairly healthy meals a day with yogurts, protein bars, fruit, and cheese, not just junk food for snacking in between meals but I’m still lacking in veggies\n\nLuckily the aversive is pretty limited:\n* Rice which I do sometimes choke on thanks to a car accident \n* All Seafood as well fresh water fish, pretty much anything that grows in water, except rice and cranberries and agar agar powder (vegan gelatin), cause gagging from smell, occasionally vomiting from smell, not being able to eat for up to 6 hours after smelling seafood, and vomiting if I end up eating it because someone thought it’d be cute to hide it in my food to prove I don’t actually have issues eating it. This one was always a problem but I have PTSD from having it literally forced down my throat a number of times by my bio dad. I’ve gotten better to the point where I can sometimes cook seafood for others now and be able to eat when around others eating fish, shellfish, etc. but that’s been less than 10 years (I’m 57) and it’s not something I can rely on. I cannot eat in restaurants that are mostly seafood oriented.",
      "created_utc": 1735955773.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5adeag",
      "author": "minisqueal",
      "body": "all 3 right now",
      "created_utc": 1735956262.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5aeua9",
      "author": "storyofohno",
      "body": "Yes.",
      "created_utc": 1735956782.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5ag5ue",
      "author": "prettyprettythingwow",
      "body": "Plus :(",
      "created_utc": 1735957267.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5akfex",
      "author": "StrawbraryLiberry",
      "body": "Mostly aversive, but I have some avoidant traits going on, especially when I'm stressed.",
      "created_utc": 1735958836.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5am4p7",
      "author": "Current_Skill21z",
      "body": "Aversive. Too many issues that had me hospitalized a couple of times growing up.",
      "created_utc": 1735959464.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5amtuh",
      "author": "nanatella22",
      "body": "Aversive and restrictive.  I did ten months of cbt with my dietician and did so good, especially with the aversive. I'm currently slipping back into the restrictive but it's more depression and sleeping too much to be constitent, which I think will be much easier to get back on track from. I still wish my body would send those hunger cues, I'd love to wake up early and hungry.",
      "created_utc": 1735959730.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5apql0",
      "author": "athey",
      "body": "Avoidant, for sure.  My daughter is a mix of avoidant and restrictive. She just has no hunger cues at all.  She never feels hungry, just shitty when it gets to the point where her body is legitimately suffering from her totally forgetting to eat a single thing. \n\nShe’s 18 now, and I’d love to be able to trust that she can feed herself without me having to pester her, or explicitly make food and put it in front of her…. But when I do that, she just totally forgets to eat.",
      "created_utc": 1735960814.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5au8kc",
      "author": "Lasagan",
      "body": "All",
      "created_utc": 1735962533.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5azci7",
      "author": "Celeste2Kewl",
      "body": "arfid plus",
      "created_utc": 1735964623.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5b0nz0",
      "author": "jessilynn713",
      "body": "Both myself and my son have ARFID. My son would be avoidant. I believe I would be avoidant too, mostly due to sensory for us both.",
      "created_utc": 1735965180.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5b1c2v",
      "author": "Garden-Gremlins",
      "body": "All..",
      "created_utc": 1735965468.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5b2524",
      "author": "InevitablePersimmon6",
      "body": "ARFID+….avoidant and aversive.",
      "created_utc": 1735965817.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5b2pwm",
      "author": "CozmicOwl16",
      "body": "Definitely all three",
      "created_utc": 1735966069.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5b3aa4",
      "author": "wildbortami",
      "body": "Avoidant. I will not eat certain textures of food I know I like. I generally avoid squishy, slimey, gooey types of foods",
      "created_utc": 1735966319.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5b3nf1",
      "author": "lurkingsubz",
      "body": "AFFID plus lol; i experience an equal mix of avoidant and restrictive. for the most part i have a general disinterest in food, but when i *am* hungry, i’m typically overwhelmed with the fear that whatever i eat will make me sick/nauseous. my only current 100% safe food has been goldfish… anything else i’m likely to be met with a dilemma, and even that is starting to get tested. i stood in the gas station for a few minutes debating “will the goldfish make me sick?” when i **needed** food but was terrified i’d just end up vomiting.",
      "created_utc": 1735966480.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5b8lbm",
      "author": "AzorAhaisBaby",
      "body": "Avoidant and restrictive. \n\nMore recently I’ve started having a fear of choking but I don’t think it’s related to arfid.",
      "created_utc": 1735968726.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5beb6v",
      "author": "jason_55904",
      "body": "65/05/30",
      "created_utc": 1735971543.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5bifhc",
      "author": "CounselorGowron",
      "body": "Uhh, all three?! Damn. 😿",
      "created_utc": 1735973772.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5bkeri",
      "author": "apollymi",
      "body": "I'll take ARFID Plus, please. I'd like to feel like I'm vaguely special for managing to hit all three.",
      "created_utc": 1735974904.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5bkgia",
      "author": "sharkprincefishstick",
      "body": "Aversive. I’m terrified of vomiting (myself or others) and restrict a lot of raw foods because of that.",
      "created_utc": 1735974932.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5bl6ai",
      "author": "GaydrianTheRainbow",
      "body": "Mostly avoidant, some restrictive.",
      "created_utc": 1735975351.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5boo1q",
      "author": "Impossible_Tea4154",
      "body": "aversive",
      "created_utc": 1735977503.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5bopb5",
      "author": "midnightfoliage",
      "body": "mostly sensory with a side of aversive. also im autistic",
      "created_utc": 1735977525.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5bpa4g",
      "author": "ilovemuffins09",
      "body": "Aversive 😑",
      "created_utc": 1735977888.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5bt0dr",
      "author": "cookiedanielle",
      "body": "Triple threat",
      "created_utc": 1735980253.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5bv036",
      "author": "SiteRelEnby",
      "body": "All three!\n\nPredominantly texture avoidant, also aversive due to fear of weight gain (have had a few weight problems recently from shitty mental health and tendency to stress eat). Lack of interest particularly whenever I'm focused on something actually important, then I tend to forget to eat. Once forgot to eat anything for ~48hrs because I was focused on a task.",
      "created_utc": 1735981532.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5bvnb2",
      "author": "Snugglebuggle",
      "body": "Currently clawing and fighting my way out of all 3. I’ve lost close to 50lbs in the last 6 months or so. The taste or texture or scent can set me off and actually cause instant vomiting, which has made me afraid to eat because food and how I react to it scares me…which has led to my total disinterest in eating at all. I’m basically surviving off chocolate milk, ensure and a very short list of foods that have extremely consistent texture and taste. I have recently started to force myself to sit down when I get up in the morning and eat something, anything. Dry toast ffs. I just need to stimulate my appetite to want to eat again.",
      "created_utc": 1735981949.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5bwasn",
      "author": "Miller0700",
      "body": "Avoidant",
      "created_utc": 1735982372.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5c2c55",
      "author": "seasaltsunsets",
      "body": "Avoidant and Aversive with the curse of loving to eat food, but never the \"good/healthy\" stuff. Sensory issues and emetophobia are deeply rooted into my problems.",
      "created_utc": 1735986254.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5c57rs",
      "author": "Wishiwereclassier",
      "body": "Avoidant, and absolutely taste-based. Love eating the food I like, but it's all unhealthy stuff. I guess I'm also aversive in that I'm afraid to swallow stuff I don't like, unless I wash it down; I'm convinced I'll gag and throw up. It's like trying to swallow a big, bitter pill without water. Near impossible.",
      "created_utc": 1735988092.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5c968k",
      "author": "Key_Ad5173",
      "body": "Avoidant and aversive",
      "created_utc": 1735990556.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5ca97f",
      "author": "AvgG4m3Enj0y3r",
      "body": "Avoidant and restrictive. Such a damn hell",
      "created_utc": 1735991208.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5cdncn",
      "author": "KonichiwaGato",
      "body": "Avoidant, definitely. There are some foods I'll just look at and hate. Like jelly, the thought of having it in my mouth makes me gag. The taste is fine, the texture is pure evil. \n\nBut maybe also aversive? I don't eat fish fingers because when I was 5 (I'm 27), I ate fish fingers then threw up. The throwing up was unrelated (I was sick), but I still blame fish fingers. Doesn't happen often but it has happened more than once.",
      "created_utc": 1735993159.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5ce82t",
      "author": "Unicorn263",
      "body": "Both avoidant and restrictive; but while I’ve had avoidant traits since I was about 4 or 5, the restrictive traits only surfaced in my 20s, I expect in part due to peer bullying about my childish diet.",
      "created_utc": 1735993477.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5crn0l",
      "author": "Any_Ebb9652",
      "body": "I’m plus",
      "created_utc": 1735999679.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5cth6y",
      "author": "PixiePrism",
      "body": "Avoidant. I really only struggle with foods that are inconsistent such as meat or blueberries (wide variety in quality from one berry to another in one container). Inconsistency makes me gag so I generally avoid those foods, but I have a wide variety of other foods that I can have instead so it really isn't that hard for me until I go to a family function and they still have not bothered to learn a thing about ARFID and give me a hard time.\n\nI also suffer a bit from the aversive ARFID as I am allergic to a lot of foods and I avoid them for fear of an itchy mouth, tight throat, and digestive troubles. I feel that is pretty reasonable though.",
      "created_utc": 1736000423.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5d5m5o",
      "author": "Beautiful_Proposal28",
      "body": "I upgraded from the basic plan to the arfid plus plan for an extra 120,000 dollars ( inpatient treatment lmao)",
      "created_utc": 1736004919.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5d5tgp",
      "author": "TeacherB93",
      "body": "Avoidant 🥲",
      "created_utc": 1736004985.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5daehh",
      "author": "Immediate-Minute-727",
      "body": "Depending on the state of my mental health and anxiety level, i can say all three.",
      "created_utc": 1736006531.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5dkimq",
      "author": "uhhhhdang",
      "body": "i think i am most avoidant and restrictive. the strange thing is that i actually really DO look forward to food! but…. only very very very specific safe foods. like (unfortunately) fast food, my favorite sandwich, etc. but if it isn’t one of those safe foods, and is instead a food i only semi-enjoy and is safe, i’m usually just meh and will eat a small portion to get some nutrients. it feels like if i don’t LOVE a food, i really don’t want to eat it it all that much (even if i am otherwise neutral or even slightly positive toward the food). otherwise, i have plenty of texture and flavor nightmares to avoid 🥲",
      "created_utc": 1736009747.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5docwv",
      "author": "Candid_Emergency9906",
      "body": "avoidant and restrictive",
      "created_utc": 1736010952.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5drocy",
      "author": "conkcluster",
      "body": "both avoidant and aversive i think",
      "created_utc": 1736012000.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5dtqy4",
      "author": "VoidedViewer",
      "body": "Well I relate to all 3.",
      "created_utc": 1736012651.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5dy4f4",
      "author": "Zilaaa",
      "body": "Avoidant and restrictive",
      "created_utc": 1736014010.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5e7a1g",
      "author": "Fabulous-Chemistry74",
      "body": "I have the premium plus.",
      "created_utc": 1736016821.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5e9myt",
      "author": "RoundNectarine2507",
      "body": "Definitely avoidant and restrictive",
      "created_utc": 1736017548.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5eb29f",
      "author": "0GoodVibrations0",
      "body": "Aversive apparently, (didn't know if I actually had ARFID, as I thought it was more a dislike of certain foods but there are many unsafe foods and food groups I don't eat due to fear of vomiting and abdominal pain).\n\nThis is really informative, so thank you.",
      "created_utc": 1736017995.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5eo763",
      "author": "ColorMySoul88",
      "body": "Extremely aversive but I have a mild form of the other two types too.",
      "created_utc": 1736022137.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5ez1r8",
      "author": "Zealousideal_Sport69",
      "body": "avoidant and restrictive 100%",
      "created_utc": 1736025683.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5f8yoo",
      "author": "VexxusVoid",
      "body": "arfid plus, aversive and restrictive.",
      "created_utc": 1736028915.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5fk341",
      "author": "Big-Egg9003",
      "body": "avoidant and restrictive",
      "created_utc": 1736032667.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5fysnt",
      "author": "unicorn_in-training",
      "body": "Avoidant for me as it’s sensory",
      "created_utc": 1736037669.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5ges3b",
      "author": "idekkbruhh",
      "body": "Avoidant and restrictive with nausea on the side",
      "created_utc": 1736043178.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5gh5b8",
      "author": "okaykittycat",
      "body": "Adverse and avoidant here! \n\nI have an incurable stomach disease that causes pain every time I ingest any food so over time I’ve become afraid of eating and textures have always bothered me but to a lesser extent",
      "created_utc": 1736044017.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5h44yp",
      "author": "pinche_diabetica",
      "body": "im def avoidant that later on caused aversive due to how my parents handled it growing up. Like legit I can’t eat in front of people im not close with. And even then I can only *try* to try new foods with my boyfriend. No one else",
      "created_utc": 1736052696.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5h7lvn",
      "author": "Maleficent_Bridge_46",
      "body": "Avoidant, but recently I’ve been restrictive now that I’m actually sick. I just try to eat at normal times so the hunger pain doesn’t bite me in the butt later.",
      "created_utc": 1736054236.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5htjgo",
      "author": "nicolee789",
      "body": "avoidant aversive 💔",
      "created_utc": 1736066372.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5igmf7",
      "author": "serioustransvibes",
      "body": "Mainly avoidant and restrictive but I definitely have some aversive sprinkled in as well.\n\nThat being said, I thought ARFID+ was ARFID combined with anorexia-symptoms?",
      "created_utc": 1736080261.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5iqj1n",
      "author": "Korean_Pathfinder",
      "body": "Why not everything?😅",
      "created_utc": 1736084852.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5izmom",
      "author": "sunnyskiezzz",
      "body": "Restrictive, but I definitely have struggled with avoidant and aversive at different points in my life (avoidant as a child, aversive in my early teens, restrictive in my late teens). It definitely compounds my anorexia-- I see no reason to eat if it's not a safe food I love. Eating food that's just \"okay\" feels insurmountable to me, I find it so much easier to just go hungry.",
      "created_utc": 1736088487.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5jr26n",
      "author": "gir1_from_the_sea",
      "body": "Haha… (all 3)",
      "created_utc": 1736097390.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5jtwws",
      "author": "lilbabydoll2000",
      "body": "arfid plus, it's mostly aversive (emetophobia) and avoidant, but i've had many periods of restrictive too",
      "created_utc": 1736098245.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5k6ocj",
      "author": "Rainyli",
      "body": "Avoidant and sometimes restrictive. Eating often feels like a chore :\")",
      "created_utc": 1736101904.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5ketey",
      "author": "angeldust-22269",
      "body": "avoidant",
      "created_utc": 1736104137.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5kzxw8",
      "author": "Naejakire",
      "body": "Avoidant!",
      "created_utc": 1736110212.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5l90ox",
      "author": "Aggravating_Net6652",
      "body": "Avoidant due to autism. Have made very little progress with attempts at exposure and expanding diet. No amount of trying disgusting food will make it appetizing",
      "created_utc": 1736112769.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5n8xt0",
      "author": "UniqueStrength4611",
      "body": "I’m avoidant but sometimes i feel as if im aversive because of those gut telling like “oh this food is gonna make me throw up” but im not necessarily scared it’s just something i find obvious",
      "created_utc": 1736136259.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5nu44y",
      "author": "Illustrious-Wind762",
      "body": "Lmao, let’s go I got ARFID plus! I mostly deal with restrictive, then avoidant to certain tastes and textures, and around the time of my diagnosis I had a fear of gagging",
      "created_utc": 1736146147.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5pdiq7",
      "author": "brads125",
      "body": "ARFID+ for me 😑 hope to find a solution because it's costing too much physically and mentally",
      "created_utc": 1736175738.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5qd7i1",
      "author": "Cottagecorecult",
      "body": "All three, I have no clue how I am still functioning at this point ✊",
      "created_utc": 1736186598.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5wx0jq",
      "author": "awaythisisthrown19",
      "body": "85% avoidant, 5% aversive and 10% restrictive. \nTextures really freak me out, and a lot of flavors do as well. The fear of something feeling or tasting bad/wrong sends me into a panic. \nA lot of the times, my body just doesn’t tell me when I’m hungry, so it’ll be one meal a day or I’ll forget to eat on occasion. \nI have a condition known as Cyclic Vomiting Syndrome, and the fear of setting off an episode with a food that I don’t know will make me sick or not puts me off anything that’s super ‘out there’ food-wise.",
      "created_utc": 1736275206.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m6g034u",
      "author": "Desperate_Cookie2818",
      "body": "Restrictive.  I have to remind myself to eat actual food.  No issues drinking fluids, just eating.  I do have anxiety, ADHD, and was recently diagnosed with autism at 42 (ha! I wasn’t being bossy!) so those may have been factors.  I have noticed that with my new medications it has become more difficult to eat (no stimulants for the ADHD) and people truly don’t seem to understand or make “helpful” comments like “you need to gain some weight!”.",
      "created_utc": 1736533930.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m6iyxwk",
      "author": "MundaneVillian",
      "body": "Was avoidant of texture my whole but lately it’s all three",
      "created_utc": 1736568654.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mb47iw0",
      "author": "HystericGhost",
      "body": "Avoidant and aversive, I find certain textures offputting and cause gagging, so I'm always worried about vomiting. I also have stomach issues that get triggered randomly so that doesn't help either. Slowly been working of increasing what foods are safe and training myself to handle the ones I struggle with.",
      "created_utc": 1738768500.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mcpdriy",
      "author": "CuckooSpit_06",
      "body": "All three.",
      "created_utc": 1739524554.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mdqhdf5",
      "author": "Few_Elephant3095",
      "body": "Restrictive and avoidant",
      "created_utc": 1740019028.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mei5dbb",
      "author": "Nyvkroft",
      "body": "Late to the party but currently just avoidant. I used to definitely be all three, but the aversion has worn off as times gone on and ever since I started exercising and going to the gym I've become interested in food. Texture still haven't overcome but I'm taking it easy.",
      "created_utc": 1740397994.0,
      "score": 1,
      "context": []
    },
    {
      "id": "meycs09",
      "author": "Jfltws224",
      "body": "All of them lol",
      "created_utc": 1740603647.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mg0vqtl",
      "author": "feistypureheart",
      "body": "Restrictive.  I'm about to go to a buffet and realizing this is not a good situation for me. Haven't been to one in years, I'm going to have to order from the menu.",
      "created_utc": 1741120235.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mlwq83a",
      "author": "Awkward_Buddy7350",
      "body": "Oh I'm restrictive. Well I'm glad I'm not anorexic at least.",
      "created_utc": 1744052171.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mmkaiwz",
      "author": "Radiant-Date3039",
      "body": "I feel like avoidant can lead to aversive in some cases. I actually do vomit and cant keep the food down when my body rejects it, and my stomach can cramp up. I have restrictive too since my only interest in food is that i really really hate starving pains and the weakness and dizziness that come from not eating. ",
      "created_utc": 1744379660.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mmqunpe",
      "author": "WeirdUnion5605",
      "body": "Avoidant 🤢 \nThe other 2 also but mostly avoidant.",
      "created_utc": 1744471398.0,
      "score": 1,
      "context": []
    },
    {
      "id": "moc8tis",
      "author": "cozykorok",
      "body": "I was diagnosed with ARFID in 2020, but sometimes I wonder if that’s what I have. I went to a treatment center because I was severely underweight and needed help. Then they diagnosed me, they asked if it was a texture thing and I was like “no… not really” but they kept telling me that I avoided textures, and every time I would tell them “no I don’t” they would push back and tell me that it’s ARFID. \n\nMy struggle back then was, I would be starving, get food in front of me, and not be able to eat it. I would chew, not be able to swallow/feel like gagging it up. Other times I would be able to eat perfectly fine. \n\nIt’s still like that, but I push through it more now. \n\nI have what I think would be considered “normal” aversions- like I don’t necessarily love the texture of pudding or applesauce. But plenty of “normal” people who don’t have eating disorders say the same thing. \n\nMy mom used to make a stringy meatloaf and it would be so hard to eat. \n\nSmall things like that, but I think any person could have an aversion to it. \n\nMy biggest problem I think is executive dysfunction. \nBut also, sometimes I am starving but the thought of eating makes me gag. \n\nI for sure have food struggles, but sometimes I wonder if it’s ARFID or something else.",
      "created_utc": 1745277217.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mptafsd",
      "author": "sara_12707",
      "body": "all 3…",
      "created_utc": 1746006516.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mquvsm6",
      "author": "Possible_Priority584",
      "body": "I am primarily restrictive, I rarely have enjoyment in food and see it as a total chore to eat. I also have a bit of sensory with certain foods, but in general there is a wide variety of things I can eat but I just have no interest whatsoever in eating",
      "created_utc": 1746524478.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mrcwvqi",
      "author": "Wide_Archer_5823",
      "body": "Avoidant and Restrictive",
      "created_utc": 1746759288.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mua9qlf",
      "author": "National-Resource-29",
      "body": "Avoidant and Restrictive ",
      "created_utc": 1748230654.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mxx29kl",
      "author": "cheetosmunch",
      "body": "Aversive and avoidant :( the aversive part is the worst for me though.",
      "created_utc": 1749999570.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m57870f",
      "author": "boringlesbian",
      "body": "Avoidant/restrictive.",
      "created_utc": 1735920704.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m57a1xe",
      "author": "KennaLikesPizza",
      "body": "I would say 70% aversive and 30% avoidant",
      "created_utc": 1735921273.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m57a4wf",
      "author": "kitkatxxo",
      "body": "avoidant and restrictive for me, ive learned my types over the years and seeing this chart has me like \"yep, spot on\"",
      "created_utc": 1735921298.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m57diey",
      "author": "Peanutbutternmtn2",
      "body": "Definitely avoidant",
      "created_utc": 1735922325.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m57g1j0",
      "author": "Ok-ironic",
      "body": "Avoidant",
      "created_utc": 1735923084.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m57hgaz",
      "author": "throw0OO0away",
      "body": "Avoidant and aversive.",
      "created_utc": 1735923509.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m57hwfc",
      "author": "se7entythree",
      "body": "Mostly avoidant with a hint of restrictive.",
      "created_utc": 1735923641.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m57lgjc",
      "author": "The_True_JEM_Alt",
      "body": "I guess I’m just avoidant.",
      "created_utc": 1735924714.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m57lr2v",
      "author": "ConsistentSteak4915",
      "body": "Avoidant and aversive.",
      "created_utc": 1735924803.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m57sxgk",
      "author": "TheDyingSailor",
      "body": "It’s all 3 right now. At first it started out with avoidant with sensory issues. \n\nI became aversive because I grew up in a household that force fed me till I threw up and was shamed for it since I was obviously doing it on purpose. And now I developed some kind of shame with throwing up or feeling nauseous.\n\nAnd after all the years of having a bad relationship with food and ADHD meaning I get bored of food. My hunger cues diminished and I lost interest in food.",
      "created_utc": 1735926932.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m57yasm",
      "author": "Anonymousherelol",
      "body": "Avoidant and restrictive",
      "created_utc": 1735928517.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m57yn7i",
      "author": "Jihiprinsa",
      "body": "Avoidant and when I get super stressed restrictive",
      "created_utc": 1735928619.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m582rh8",
      "author": "Phoenixtdm",
      "body": "I don’t think I have ARFID I’m just autistic. But I am scared of trying new foods but there’s no reason why I’m scared because  I’m not scared of any negative consequences. And sometimes I feel nauseous at the thought of eating so I don’t eat",
      "created_utc": 1735929839.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m584czk",
      "author": "makinggrace",
      "body": "Unsubscribe me!!!",
      "created_utc": 1735930300.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m587jdr",
      "author": "sofmoth",
      "body": "restrictive and a touch of avoidance. i just never really feel like eating and when i do i have some texture and smell issues. my husband usually has to just bring me food otherwise i won’t eat because i simply don’t feel like it.",
      "created_utc": 1735931222.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m58c5g3",
      "author": "Oceanpelt",
      "body": "avoidant and aversive, autism and random unknown food allergies.",
      "created_utc": 1735932594.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m57keh0",
      "author": "cassiopeia-e",
      "body": "Avoidant and aversive\n\nAversive has the most effect on my life, though",
      "created_utc": 1735924396.0,
      "score": 0,
      "context": []
    },
    {
      "id": "m57mbrh",
      "author": "AltruisticStill1125",
      "body": "i’m avoidant and restrictive mixed",
      "created_utc": 1735924975.0,
      "score": 0,
      "context": []
    },
    {
      "id": "m57pxjo",
      "author": "PercentageWide6608",
      "body": "I'm ARFID+ I would say I'm most avoidant, and restrictive. I do have certain aversions though that I stick by very very strongly. Not as much vomiting anymore as I've basically been forced through exposure therapy with emetophobia because of a vomiting condition I was also dealing with for a while. \n\nI avoid eating most of the time and just don't enjoy it and don't want to do it. When I do inevitably have to eat I have a hard time deciding what to eat because I hate most foods and textures and my safe foods are constantly switching and sometimes I just don't have any at a certain time. I also have IBS and fibromyalgia, so that's where most of the averse consequences come in for me. I worry whatever I might wanna eat will cause my stomach or my body to go into a huge flare up. \n\nThank god for sliced bread because that ended up being my dinner last night.",
      "created_utc": 1735926049.0,
      "score": 0,
      "context": []
    },
    {
      "id": "m57rg8w",
      "author": "BeatnikMona",
      "body": "Mostly avoidant, some aversive",
      "created_utc": 1735926498.0,
      "score": 0,
      "context": []
    },
    {
      "id": "m57xxd1",
      "author": "slowly-rotting-dying",
      "body": "taste + texture based restrictive and avoidant :/",
      "created_utc": 1735928408.0,
      "score": 0,
      "context": []
    },
    {
      "id": "m57xxfa",
      "author": "lilburblue",
      "body": "Avoidant and restrictive.",
      "created_utc": 1735928409.0,
      "score": 0,
      "context": []
    },
    {
      "id": "m57zskg",
      "author": "None",
      "body": "Very very avoidant somewhat restrictive and somewhat aversive but I have gi issues so I think that’s my OCD working OT there. The restrictive comes in when my safe foods start to become boring because other foods are no longer safe because of the above. I just tried to eat pico with chips and someone double dipped and it had guacamole. I can never trust it again unless it’s my own. I will now have to examine it every single time and it becomes annoying and I would rather avoid it.",
      "created_utc": 1735928959.0,
      "score": 0,
      "context": []
    },
    {
      "id": "m580mkg",
      "author": "magdalenq",
      "body": "Aversive and avoidant",
      "created_utc": 1735929206.0,
      "score": 0,
      "context": []
    },
    {
      "id": "m580qzg",
      "author": "Kauuori",
      "body": "Avoidant.",
      "created_utc": 1735929242.0,
      "score": 0,
      "context": []
    },
    {
      "id": "m584uo2",
      "author": "Honeydewskyy20",
      "body": "Avoidant and some aversion but only with certain food items.",
      "created_utc": 1735930442.0,
      "score": 0,
      "context": []
    },
    {
      "id": "m58btzs",
      "author": "DyingLies",
      "body": "I have the avoidant one!",
      "created_utc": 1735932499.0,
      "score": 0,
      "context": []
    },
    {
      "id": "m58fgj0",
      "author": "Individual_Fresh",
      "body": "avoidant mainly, taste/smell but sometimes texture too, i definitely prefer some textures but its not so much that i wont eat because of texture",
      "created_utc": 1735933574.0,
      "score": 0,
      "context": []
    },
    {
      "id": "m58jvsa",
      "author": "BulkyComfortable3040",
      "body": "Definitely avoidant and aversive",
      "created_utc": 1735934907.0,
      "score": 0,
      "context": []
    },
    {
      "id": "m57qcc0",
      "author": "PercentageWide6608",
      "body": "that's what I was thinking Lolll. I didn't sign up for premium how I do I cancel this subscription!!",
      "created_utc": 1735926171.0,
      "score": 82,
      "context": [
        {
          "id": "m57eqm3",
          "author": "podgoricanka93",
          "body": "“ARFID Plus” lol I have the premium version of ARFID",
          "created_utc": 1735922695.0
        }
      ]
    },
    {
      "id": "m5by3sb",
      "author": "oddistrange",
      "body": "C-c-c-combo",
      "created_utc": 1735983545.0,
      "score": 1,
      "context": [
        {
          "id": "m57eqm3",
          "author": "podgoricanka93",
          "body": "“ARFID Plus” lol I have the premium version of ARFID",
          "created_utc": 1735922695.0
        }
      ]
    },
    {
      "id": "m5l97sx",
      "author": "latinforloyalty",
      "body": "Me too.",
      "created_utc": 1736112825.0,
      "score": 1,
      "context": [
        {
          "id": "m57eqm3",
          "author": "podgoricanka93",
          "body": "“ARFID Plus” lol I have the premium version of ARFID",
          "created_utc": 1735922695.0
        }
      ]
    },
    {
      "id": "m579eft",
      "author": "R0da",
      "body": "Yuup.  When food is neutral at best and hostile at worst, what motivation does my body have to want to go back?  I only eat to not die.",
      "created_utc": 1735921075.0,
      "score": 74,
      "context": [
        {
          "id": "m57595a",
          "author": "No_Evidence_19",
          "body": "Very much avoidant and restrictive",
          "created_utc": 1735919789.0
        }
      ]
    },
    {
      "id": "m5775h6",
      "author": "Jolly_Bear_3791",
      "body": "Same here",
      "created_utc": 1735920381.0,
      "score": 3,
      "context": [
        {
          "id": "m57595a",
          "author": "No_Evidence_19",
          "body": "Very much avoidant and restrictive",
          "created_utc": 1735919789.0
        }
      ]
    },
    {
      "id": "m59j9iu",
      "author": "Burned-CocaCola",
      "body": "Same, but mine’s mostly avoidant",
      "created_utc": 1735945949.0,
      "score": 2,
      "context": [
        {
          "id": "m57595a",
          "author": "No_Evidence_19",
          "body": "Very much avoidant and restrictive",
          "created_utc": 1735919789.0
        }
      ]
    },
    {
      "id": "m58on01",
      "author": "shortnsweet33",
      "body": "Same. Certain textures my body will just gag no matter what I do. Even food exposures of repetitively eating the same textured challenge food (lettuce) doing that 3 days a week for 8 weeks means I can now get down 5 tiny bites of lettuce before my body gags… but that’s it lol. \n\nSo frustrating. I love the smells of certain things and the flavors they bring to food but my body won’t let me enjoy them without that reflex. It sucks so much.",
      "created_utc": 1735936379.0,
      "score": 34,
      "context": [
        {
          "id": "m5788cf",
          "author": "Cyber-Cafe",
          "body": "Texture based avoidant. It fucking sucks, because the flavor/color/sight of most food does not bother me at all. But I’m very sensitive to textures in general and food in my mouth is no different.",
          "created_utc": 1735920716.0
        }
      ]
    },
    {
      "id": "m57fa1r",
      "author": "grilledghum",
      "body": "Me too totally agree\nSome foods i just know i wont like the texture of and thats the sole reason i wont try them",
      "created_utc": 1735922857.0,
      "score": 20,
      "context": [
        {
          "id": "m5788cf",
          "author": "Cyber-Cafe",
          "body": "Texture based avoidant. It fucking sucks, because the flavor/color/sight of most food does not bother me at all. But I’m very sensitive to textures in general and food in my mouth is no different.",
          "created_utc": 1735920716.0
        }
      ]
    },
    {
      "id": "m5bkfv2",
      "author": "kelslawpy",
      "body": "Yes, exactly this. I have actually discovered a love of creating fun food combinations for my husband who will eat literally anything. I understand flavors and can cook very well, but I am not meant to know the joy of most of my cooking labors 😭",
      "created_utc": 1735974921.0,
      "score": 4,
      "context": [
        {
          "id": "m5788cf",
          "author": "Cyber-Cafe",
          "body": "Texture based avoidant. It fucking sucks, because the flavor/color/sight of most food does not bother me at all. But I’m very sensitive to textures in general and food in my mouth is no different.",
          "created_utc": 1735920716.0
        }
      ]
    },
    {
      "id": "m5bm5ck",
      "author": "GaydrianTheRainbow",
      "body": "Yes! Texture is my big thing, too. Also flavour to a lesser (but still impactful) extent. But texture is the hardest. I like a wide range of foods. But they have to be prepared in such narrow margins to be acceptable.",
      "created_utc": 1735975943.0,
      "score": 3,
      "context": [
        {
          "id": "m5788cf",
          "author": "Cyber-Cafe",
          "body": "Texture based avoidant. It fucking sucks, because the flavor/color/sight of most food does not bother me at all. But I’m very sensitive to textures in general and food in my mouth is no different.",
          "created_utc": 1735920716.0
        }
      ]
    },
    {
      "id": "m594ak7",
      "author": "Busy_Net_3721",
      "body": "Same both adversive and avoidant and I binge eat too",
      "created_utc": 1735941131.0,
      "score": 7,
      "context": [
        {
          "id": "m574ck8",
          "author": "meowtimegang",
          "body": "I think I am both avoidant and aversive.",
          "created_utc": 1735919506.0
        }
      ]
    },
    {
      "id": "m58gkh5",
      "author": "Callum_Rose",
      "body": "I have both but less so aversion as im aldo a binge eater.",
      "created_utc": 1735933901.0,
      "score": 8,
      "context": [
        {
          "id": "m574ck8",
          "author": "meowtimegang",
          "body": "I think I am both avoidant and aversive.",
          "created_utc": 1735919506.0
        }
      ]
    },
    {
      "id": "m58hsre",
      "author": "Manospondylus_gigas",
      "body": "Samee",
      "created_utc": 1735934269.0,
      "score": 2,
      "context": [
        {
          "id": "m574ck8",
          "author": "meowtimegang",
          "body": "I think I am both avoidant and aversive.",
          "created_utc": 1735919506.0
        }
      ]
    },
    {
      "id": "m58edmt",
      "author": "bbonesoop",
      "body": "i hope you the best with recovering!!🩷",
      "created_utc": 1735933253.0,
      "score": 9,
      "context": [
        {
          "id": "m574j9n",
          "author": "emptyhellebore",
          "body": "All 3 right now.",
          "created_utc": 1735919564.0
        }
      ]
    },
    {
      "id": "m57fxlp",
      "author": "grilledghum",
      "body": "This is fascinating to me ive never heard of someone with emetophobia and anorexia\nI think its good though that it didn’t turn into bulimia for you for that reason",
      "created_utc": 1735923052.0,
      "score": 7,
      "context": [
        {
          "id": "m57dhm6",
          "author": "AdhesivenessOk5534",
          "body": "Aversive and restrictive \n\nI have a phobia of vomiting and I have fucked up hunger signals from the ARFID turning into anorexia when I was 16 \n\nI've recovered from Ana but the ARFID remains",
          "created_utc": 1735922319.0
        }
      ]
    },
    {
      "id": "m5eslbq",
      "author": "None",
      "body": "This is exactly the same as me. When I was talking to a friend that had ARFID, she recognised that she was kinda forced into recovery around that age because she was embarrassed about her picky eating. I think for me, when I hit that point, the pressure to eat made me anorexic. I feel like the lack of interest from ARFID made me “good” at being anorexic and really fuelled it for me. It also stopped me from recovering for a long time because I was attributing all of my eating difficulties to anorexia not knowing ARFID existed",
      "created_utc": 1736023567.0,
      "score": 1,
      "context": [
        {
          "id": "m57dhm6",
          "author": "AdhesivenessOk5534",
          "body": "Aversive and restrictive \n\nI have a phobia of vomiting and I have fucked up hunger signals from the ARFID turning into anorexia when I was 16 \n\nI've recovered from Ana but the ARFID remains",
          "created_utc": 1735922319.0
        }
      ]
    },
    {
      "id": "m5bpbti",
      "author": "ilovemuffins09",
      "body": "Same 🫠",
      "created_utc": 1735977918.0,
      "score": 2,
      "context": [
        {
          "id": "m572lxv",
          "author": "None",
          "body": "I have aversive. History of severe anxiety and panic attacks which I believe predisposed me to ARFID.",
          "created_utc": 1735918958.0
        }
      ]
    },
    {
      "id": "m5h7s6m",
      "author": "Maleficent_Bridge_46",
      "body": "The stomachaches from panic attacks absolutely suck! I wish someone explained to me as a kid what anxiety was, because I always thought I was actually sick. Pretty sure that’s what caused me to get ARFID, too/",
      "created_utc": 1736054318.0,
      "score": 1,
      "context": [
        {
          "id": "m572lxv",
          "author": "None",
          "body": "I have aversive. History of severe anxiety and panic attacks which I believe predisposed me to ARFID.",
          "created_utc": 1735918958.0
        }
      ]
    },
    {
      "id": "m5a1lug",
      "author": "goldfishmuncher",
      "body": "it's rough seeing everyone obsess over food but you know you wouldn't eat anything if it weren't essential. hang in there, you got this <3",
      "created_utc": 1735952136.0,
      "score": 9,
      "context": [
        {
          "id": "m5752vk",
          "author": "Less_Character_8544",
          "body": "Restrictive, definitely",
          "created_utc": 1735919734.0
        }
      ]
    },
    {
      "id": "m58vbls",
      "author": "WolfWhovian",
      "body": "Got the triple combo lol",
      "created_utc": 1735938407.0,
      "score": 4,
      "context": [
        {
          "id": "m57g58x",
          "author": "Nova-Prospekt",
          "body": "Trifecta gamers rise up",
          "created_utc": 1735923115.0
        }
      ]
    },
    {
      "id": "m5apvvm",
      "author": "mykineticromance",
      "body": "I'm realizing I have histamine intolerance issues, and food I've prepared the exact same way and safe by food safety standards can still make me sick. I've had to develop my own rules to avoid a flare up, and half my family thinks I'm overly cautious but my husband has seen it enough to get it.",
      "created_utc": 1735960869.0,
      "score": 1,
      "context": [
        {
          "id": "m5770tp",
          "author": "Armayra",
          "body": "Aversive for sure. Too many times getting sick from food before being able to sort out my allergies left me with trust issues around eating. I tend to refer to it as being betrayed by food.",
          "created_utc": 1735920340.0
        }
      ]
    },
    {
      "id": "mxx2iop",
      "author": "cheetosmunch",
      "body": "Same. I go through periods of time where im good and can eat without the fear of choking and the anxiety. But then I go back into the whole of not being able to eat or swallow anything, barely even water. I’m in the rut right now and I’m so hungry :(",
      "created_utc": 1749999651.0,
      "score": 1,
      "context": [
        {
          "id": "m57d3ag",
          "author": "Knitting-Moose",
          "body": "Aversive babyyyy 😎 i do not want to choke and literally everything hurts to eat at least a little bit",
          "created_utc": 1735922199.0
        }
      ]
    },
    {
      "id": "m5fkai3",
      "author": "Mean_Ad_4762",
      "body": "Oh that is me you described me",
      "created_utc": 1736032739.0,
      "score": 2,
      "context": [
        {
          "id": "m57w9jn",
          "author": "businessgoos3",
          "body": "I always heard ARFID+ was ARFID with symptoms that developed later of body-image based eating disorders (usually AN). The key being that the ARFID distinctly came first, then the body-image ED came after and is closely related to the ARFID because of the existing food restrictions (and sometimes body image issues that come from ARFID).\n\nIf we're using the infographic's definitions, I have ARFID+. If we're using the definition I listed above, I have whatever all 4 types combined would be. I propose the name \"ARFID :(\" because it's just sad, lmao.",
          "created_utc": 1735927921.0
        }
      ]
    },
    {
      "id": "m59xfn0",
      "author": "None",
      "body": "This is interesting isn’t it. A lot of avoidant and restrictive, a handful of aversive only, and some but not many aversive and ___",
      "created_utc": 1735950720.0,
      "score": 2,
      "context": [
        {
          "id": "m57djls",
          "author": "Accomplished-Act-178",
          "body": "This is super interesting..my child has all three",
          "created_utc": 1735922335.0
        }
      ]
    },
    {
      "id": "m5azl67",
      "author": "sweetsunshine530",
      "body": "Same here, it sucks.",
      "created_utc": 1735964724.0,
      "score": 1,
      "context": [
        {
          "id": "m587rdl",
          "author": "HungriestGirl",
          "body": "Im 100% aversive. So much anxiety while eating",
          "created_utc": 1735931288.0
        }
      ]
    },
    {
      "id": "m5gzpjd",
      "author": "lyndziewitharfid",
      "body": "THIS!! mine is a fear of a deadly allergic reaction. it does suck when our brains are constantly telling us food is going to kill us. when i was first diagnosed i couldn’t even drink water",
      "created_utc": 1736050836.0,
      "score": 1,
      "context": [
        {
          "id": "m580atx",
          "author": "ExplanationAny3073",
          "body": "Aversive mostly, but definitely all three, Aversive is what affects my daily life 🥲 it sucks that my brain thinks all food could kill me",
          "created_utc": 1735929110.0
        }
      ]
    },
    {
      "id": "mz8zo53",
      "author": "Queeenhx14",
      "body": "How are you doing?",
      "created_utc": 1750640218.0,
      "score": 1,
      "context": [
        {
          "id": "m57p55m",
          "author": "GobiTheDragon",
          "body": "Aversive 100%, the whole reason I now have a feeding tube is because I was so scared of throwing up I stopped eating and drinking.",
          "created_utc": 1735925814.0
        }
      ]
    },
    {
      "id": "mqv0eg7",
      "author": "Possible_Priority584",
      "body": "I'm exactly the same, it's such a chore, I hate even the thought about any of these things",
      "created_utc": 1746527165.0,
      "score": 1,
      "context": [
        {
          "id": "m58py0l",
          "author": "None",
          "body": "Restrictive. I can eat just about anything these days but it's more natural for me to ignore hunger cues and skip it. I hate planning meals, cooking, touching and storing food, doing dishes, cleaning up food, etc. I'm pretty ambivalent about the act of eating. So I end nearly every day on a caloric deficit. Weed helps with it.",
          "created_utc": 1735936778.0
        }
      ]
    },
    {
      "id": "m5kaoy1",
      "author": "Rainyli",
      "body": "That would fall under avoidant!",
      "created_utc": 1736103000.0,
      "score": 1,
      "context": [
        {
          "id": "m594csl",
          "author": "Naixee",
          "body": "Where's the \"everything taste like shit\" one😭 I swear only like 3 foods max taste good enough to eat. Starting to wonder if my taste buds are the problem. Even tho textures are a huuuge thing as well",
          "created_utc": 1735941150.0
        }
      ]
    },
    {
      "id": "m5k9foh",
      "author": "Rainyli",
      "body": "Here you go! https://64.media.tumblr.com/5ffe27ad56483d5f64d62085a29e4e5d/85da067474dd4334-a2/s1280x1920/115e2fb5d749c61f764c3de91a7239eae4a1c8cc.jpg",
      "created_utc": 1736102651.0,
      "score": 2,
      "context": [
        {
          "id": "m5agckr",
          "author": "Raderg32",
          "body": "Does anyone have this image with a couple more pixels? It would be nice to be able to read what it says.",
          "created_utc": 1735957336.0
        }
      ]
    },
    {
      "id": "m5k8z91",
      "author": "Rainyli",
      "body": "LMAOOO",
      "created_utc": 1736102529.0,
      "score": 2,
      "context": [
        {
          "id": "m5b600g",
          "author": "DisagreeableCompote",
          "body": "Why did I read this at first as “3 types of bread” and I was like ohhh, the white kind, the brown kind, and that repulsive kind my mom used to get that had fucking seeds in it and it made me want to die.",
          "created_utc": 1735967534.0
        }
      ]
    },
    {
      "id": "m5k8gli",
      "author": "Rainyli",
      "body": "Trauma can definitely play a role in ARFID. I think in many cases that would fall under aversive (you try a food, >! gag/throw up !< , and are deterred from eating it in the future) but it depends on the specific details of the trauma.",
      "created_utc": 1736102388.0,
      "score": 1,
      "context": [
        {
          "id": "m5cejs3",
          "author": "spring-sapling",
          "body": "Mostly avoidant, but also trauma related I think? If that's a possibility?",
          "created_utc": 1735993656.0
        }
      ]
    },
    {
      "id": "m59c9wb",
      "author": "grilledghum",
      "body": "Interesting i never thought of it like that, is being afraid of any health issue from food considered aversive arfid??",
      "created_utc": 1735943649.0,
      "score": 2,
      "context": [
        {
          "id": "m57m7s4",
          "author": "sparkletrashtastic",
          "body": "Avoidant and restrictive. Slightly aversive, but more to long term fears like hypertension from too much salty food, cancer from processed meats, tooth decay from sugary drinks and candies. I still eat those things, but doing so comes with a lot of anxiety sometimes.",
          "created_utc": 1735924942.0
        }
      ]
    },
    {
      "id": "m59cph9",
      "author": "grilledghum",
      "body": "I’m sorry about all ur conditions that sounds hard but I can relate I have a slew of other chronic illnesses as well. What happened in your emetophobia exposure therapy? I’m sorta considering it for the future but I feel like it would creep me out too much so I’m curious how bad it is",
      "created_utc": 1735943788.0,
      "score": 2,
      "context": [
        {
          "id": "m57pxjo",
          "author": "PercentageWide6608",
          "body": "I'm ARFID+ I would say I'm most avoidant, and restrictive. I do have certain aversions though that I stick by very very strongly. Not as much vomiting anymore as I've basically been forced through exposure therapy with emetophobia because of a vomiting condition I was also dealing with for a while. \n\nI avoid eating most of the time and just don't enjoy it and don't want to do it. When I do inevitably have to eat I have a hard time deciding what to eat because I hate most foods and textures and my safe foods are constantly switching and sometimes I just don't have any at a certain time. I also have IBS and fibromyalgia, so that's where most of the averse consequences come in for me. I worry whatever I might wanna eat will cause my stomach or my body to go into a huge flare up. \n\nThank god for sliced bread because that ended up being my dinner last night.",
          "created_utc": 1735926049.0
        }
      ]
    },
    {
      "id": "m58foq7",
      "author": "Individual_Fresh",
      "body": "mayybe some restrictive but it could just be when the GI issues act up",
      "created_utc": 1735933641.0,
      "score": 0,
      "context": [
        {
          "id": "m58fgj0",
          "author": "Individual_Fresh",
          "body": "avoidant mainly, taste/smell but sometimes texture too, i definitely prefer some textures but its not so much that i wont eat because of texture",
          "created_utc": 1735933574.0
        }
      ]
    },
    {
      "id": "m57vbbg",
      "author": "TheDyingSailor",
      "body": "If you ever figure this out tell me. This package is too expensive for my lifestyle 🥲",
      "created_utc": 1735927641.0,
      "score": 29,
      "context": [
        {
          "id": "m57eqm3",
          "author": "podgoricanka93",
          "body": "“ARFID Plus” lol I have the premium version of ARFID",
          "created_utc": 1735922695.0
        },
        {
          "id": "m57qcc0",
          "author": "PercentageWide6608",
          "body": "that's what I was thinking Lolll. I didn't sign up for premium how I do I cancel this subscription!!",
          "created_utc": 1735926171.0
        }
      ]
    },
    {
      "id": "m5drarb",
      "author": "wi7dcat",
      "body": "Lololol i’m glad we were all thinking the same thing omfg",
      "created_utc": 1736011881.0,
      "score": 2,
      "context": [
        {
          "id": "m57eqm3",
          "author": "podgoricanka93",
          "body": "“ARFID Plus” lol I have the premium version of ARFID",
          "created_utc": 1735922695.0
        },
        {
          "id": "m57qcc0",
          "author": "PercentageWide6608",
          "body": "that's what I was thinking Lolll. I didn't sign up for premium how I do I cancel this subscription!!",
          "created_utc": 1735926171.0
        }
      ]
    },
    {
      "id": "m58ct4y",
      "author": "Darthcookie",
      "body": "I keep saying there needs to be human “kibble”, something dry, crunchy, salty and nutritious.",
      "created_utc": 1735932789.0,
      "score": 43,
      "context": [
        {
          "id": "m57595a",
          "author": "No_Evidence_19",
          "body": "Very much avoidant and restrictive",
          "created_utc": 1735919789.0
        },
        {
          "id": "m579eft",
          "author": "R0da",
          "body": "Yuup.  When food is neutral at best and hostile at worst, what motivation does my body have to want to go back?  I only eat to not die.",
          "created_utc": 1735921075.0
        }
      ]
    },
    {
      "id": "m5fji7z",
      "author": "Mean_Ad_4762",
      "body": "I long to photosynthesise",
      "created_utc": 1736032465.0,
      "score": 5,
      "context": [
        {
          "id": "m57595a",
          "author": "No_Evidence_19",
          "body": "Very much avoidant and restrictive",
          "created_utc": 1735919789.0
        },
        {
          "id": "m579eft",
          "author": "R0da",
          "body": "Yuup.  When food is neutral at best and hostile at worst, what motivation does my body have to want to go back?  I only eat to not die.",
          "created_utc": 1735921075.0
        }
      ]
    },
    {
      "id": "mquvvbb",
      "author": "Possible_Priority584",
      "body": "Same, exactly same",
      "created_utc": 1746524525.0,
      "score": 1,
      "context": [
        {
          "id": "m57595a",
          "author": "No_Evidence_19",
          "body": "Very much avoidant and restrictive",
          "created_utc": 1735919789.0
        },
        {
          "id": "m579eft",
          "author": "R0da",
          "body": "Yuup.  When food is neutral at best and hostile at worst, what motivation does my body have to want to go back?  I only eat to not die.",
          "created_utc": 1735921075.0
        }
      ]
    },
    {
      "id": "m58u87z",
      "author": "alymars",
      "body": "Yes to all of this. I have physically (uncontrollably) wretched at a table before when placing something in my mouth that is texture wise a no-no. Its so embarrassing",
      "created_utc": 1735938076.0,
      "score": 16,
      "context": [
        {
          "id": "m5788cf",
          "author": "Cyber-Cafe",
          "body": "Texture based avoidant. It fucking sucks, because the flavor/color/sight of most food does not bother me at all. But I’m very sensitive to textures in general and food in my mouth is no different.",
          "created_utc": 1735920716.0
        },
        {
          "id": "m58on01",
          "author": "shortnsweet33",
          "body": "Same. Certain textures my body will just gag no matter what I do. Even food exposures of repetitively eating the same textured challenge food (lettuce) doing that 3 days a week for 8 weeks means I can now get down 5 tiny bites of lettuce before my body gags… but that’s it lol. \n\nSo frustrating. I love the smells of certain things and the flavors they bring to food but my body won’t let me enjoy them without that reflex. It sucks so much.",
          "created_utc": 1735936379.0
        }
      ]
    },
    {
      "id": "m5aa5oh",
      "author": "SPinc1",
      "body": "Lettuce is horrible! I don't understand how people can like it.",
      "created_utc": 1735955105.0,
      "score": 8,
      "context": [
        {
          "id": "m5788cf",
          "author": "Cyber-Cafe",
          "body": "Texture based avoidant. It fucking sucks, because the flavor/color/sight of most food does not bother me at all. But I’m very sensitive to textures in general and food in my mouth is no different.",
          "created_utc": 1735920716.0
        },
        {
          "id": "m58on01",
          "author": "shortnsweet33",
          "body": "Same. Certain textures my body will just gag no matter what I do. Even food exposures of repetitively eating the same textured challenge food (lettuce) doing that 3 days a week for 8 weeks means I can now get down 5 tiny bites of lettuce before my body gags… but that’s it lol. \n\nSo frustrating. I love the smells of certain things and the flavors they bring to food but my body won’t let me enjoy them without that reflex. It sucks so much.",
          "created_utc": 1735936379.0
        }
      ]
    },
    {
      "id": "m5bpgth",
      "author": "meowtimegang",
      "body": "Me too. I binge here and there.",
      "created_utc": 1735978005.0,
      "score": 2,
      "context": [
        {
          "id": "m574ck8",
          "author": "meowtimegang",
          "body": "I think I am both avoidant and aversive.",
          "created_utc": 1735919506.0
        },
        {
          "id": "m594ak7",
          "author": "Busy_Net_3721",
          "body": "Same both adversive and avoidant and I binge eat too",
          "created_utc": 1735941131.0
        }
      ]
    },
    {
      "id": "m5f05hj",
      "author": "emptyhellebore",
      "body": "Thank you so much, wishing the same for you.  💕",
      "created_utc": 1736026041.0,
      "score": 2,
      "context": [
        {
          "id": "m574j9n",
          "author": "emptyhellebore",
          "body": "All 3 right now.",
          "created_utc": 1735919564.0
        },
        {
          "id": "m58edmt",
          "author": "bbonesoop",
          "body": "i hope you the best with recovering!!🩷",
          "created_utc": 1735933253.0
        }
      ]
    },
    {
      "id": "m57gqoj",
      "author": "AdhesivenessOk5534",
      "body": ">that it didn’t turn into bulimia for you for that reason\n\nI've said this hundreds of times. The phobia was the only thing that saved me from bulimia \n\n>This is fascinating to me ive never heard of someone with emetophobia and anorexia\n\nIt started out with the lack of appetite and the fear of eating from the phobia and morphed into a weight thing for some odd reason. It was also enabled by my parents who would give me like a spoonful of food at the dinner table and would drone on and on about how terrible I would look if I got fat. (They were right I gained 100 pounds from meds and I legitimately looked so bad, I've since lost the 100 pounds)",
      "created_utc": 1735923294.0,
      "score": 13,
      "context": [
        {
          "id": "m57dhm6",
          "author": "AdhesivenessOk5534",
          "body": "Aversive and restrictive \n\nI have a phobia of vomiting and I have fucked up hunger signals from the ARFID turning into anorexia when I was 16 \n\nI've recovered from Ana but the ARFID remains",
          "created_utc": 1735922319.0
        },
        {
          "id": "m57fxlp",
          "author": "grilledghum",
          "body": "This is fascinating to me ive never heard of someone with emetophobia and anorexia\nI think its good though that it didn’t turn into bulimia for you for that reason",
          "created_utc": 1735923052.0
        }
      ]
    },
    {
      "id": "m5esupv",
      "author": "None",
      "body": "I wish so much that I could just enjoy a massive plate of food. It feels so awkward eating with friends/partners families or my own at Christmas",
      "created_utc": 1736023653.0,
      "score": 1,
      "context": [
        {
          "id": "m5752vk",
          "author": "Less_Character_8544",
          "body": "Restrictive, definitely",
          "created_utc": 1735919734.0
        },
        {
          "id": "m5a1lug",
          "author": "goldfishmuncher",
          "body": "it's rough seeing everyone obsess over food but you know you wouldn't eat anything if it weren't essential. hang in there, you got this <3",
          "created_utc": 1735952136.0
        }
      ]
    },
    {
      "id": "m5aqkkt",
      "author": "mykineticromance",
      "body": "I'm aversive and avoidant, but I may have a touch of the tism which I blame my avoidance of a lot of dairy products on. My aversion is 100% tied to my emetophobia, a meal can be delicious until I eat a bite too much and then I'm panicking about feeling overly full and worrying it's going to make me sick. I guess I have the restrictive part of it's hard for me to tell when eating is going to make me not hungry vs how much is going to make me feel full and then the tip over into too full comes within like 5 extra grams of food it feels like.",
      "created_utc": 1735961127.0,
      "score": 3,
      "context": [
        {
          "id": "m57djls",
          "author": "Accomplished-Act-178",
          "body": "This is super interesting..my child has all three",
          "created_utc": 1735922335.0
        },
        {
          "id": "m59xfn0",
          "author": "None",
          "body": "This is interesting isn’t it. A lot of avoidant and restrictive, a handful of aversive only, and some but not many aversive and ___",
          "created_utc": 1735950720.0
        }
      ]
    },
    {
      "id": "m5ke02u",
      "author": "Raderg32",
      "body": "Thanks!",
      "created_utc": 1736103909.0,
      "score": 1,
      "context": [
        {
          "id": "m5agckr",
          "author": "Raderg32",
          "body": "Does anyone have this image with a couple more pixels? It would be nice to be able to read what it says.",
          "created_utc": 1735957336.0
        },
        {
          "id": "m5k9foh",
          "author": "Rainyli",
          "body": "Here you go! https://64.media.tumblr.com/5ffe27ad56483d5f64d62085a29e4e5d/85da067474dd4334-a2/s1280x1920/115e2fb5d749c61f764c3de91a7239eae4a1c8cc.jpg",
          "created_utc": 1736102651.0
        }
      ]
    },
    {
      "id": "m59i4w9",
      "author": "FunnelCakeGoblin",
      "body": "Hi, I have emetophobia too. I was just curious, how does it work that you are scared of other people getting sick but not you?",
      "created_utc": 1735945572.0,
      "score": 1,
      "context": [
        {
          "id": "m57m7s4",
          "author": "sparkletrashtastic",
          "body": "Avoidant and restrictive. Slightly aversive, but more to long term fears like hypertension from too much salty food, cancer from processed meats, tooth decay from sugary drinks and candies. I still eat those things, but doing so comes with a lot of anxiety sometimes.",
          "created_utc": 1735924942.0
        },
        {
          "id": "m59c9wb",
          "author": "grilledghum",
          "body": "Interesting i never thought of it like that, is being afraid of any health issue from food considered aversive arfid??",
          "created_utc": 1735943649.0
        }
      ]
    },
    {
      "id": "m5a40vl",
      "author": "sparkletrashtastic",
      "body": "I doubt general concern is. What I get is next level though where it spins on repeat in my brain and can cause severe emotional and mental disturbance if I’m made to eat the thing. As is with all my symptoms, they get worse with stress or other upsets to my schedule (I’m autistic).",
      "created_utc": 1735952966.0,
      "score": 1,
      "context": [
        {
          "id": "m57m7s4",
          "author": "sparkletrashtastic",
          "body": "Avoidant and restrictive. Slightly aversive, but more to long term fears like hypertension from too much salty food, cancer from processed meats, tooth decay from sugary drinks and candies. I still eat those things, but doing so comes with a lot of anxiety sometimes.",
          "created_utc": 1735924942.0
        },
        {
          "id": "m59c9wb",
          "author": "grilledghum",
          "body": "Interesting i never thought of it like that, is being afraid of any health issue from food considered aversive arfid??",
          "created_utc": 1735943649.0
        }
      ]
    },
    {
      "id": "m5a7c53",
      "author": "PercentageWide6608",
      "body": "I didn't really do exposure therapy in a medically traditional sense. Unfortunately I just got really sick for a long time and I could not stop vomiting. At first I would have panic attacks almost every single time I felt it coming on. Then I started getting more and more used to the feeling because I was experiencing it. I was less scared of it because I had dealt with it so much that I sorta become numb to the sensation. \n\nNot sure how it'd work in a traditional sense, but in a weird way it did genuinely really help me stop letting vomiting control my life once I finally got the issue under control and got medicated for my acid reflux issues. I just had dealt with it alot. \n\nMy way isn't something you can exactly try unless you get sick, which would be shitty. I'd say I did kinda exposure therapy myself a bit with spiders by looking at photos first and then slowly transitioning into videos and then once I could handle that I would look in the tank at the zoo and now when I see just a small spider I can kill it when before I would cry. Still freak out over big ones though. I do believe exposing yourself a bit can help. Sucks while you're working on it though.",
      "created_utc": 1735954116.0,
      "score": 2,
      "context": [
        {
          "id": "m57pxjo",
          "author": "PercentageWide6608",
          "body": "I'm ARFID+ I would say I'm most avoidant, and restrictive. I do have certain aversions though that I stick by very very strongly. Not as much vomiting anymore as I've basically been forced through exposure therapy with emetophobia because of a vomiting condition I was also dealing with for a while. \n\nI avoid eating most of the time and just don't enjoy it and don't want to do it. When I do inevitably have to eat I have a hard time deciding what to eat because I hate most foods and textures and my safe foods are constantly switching and sometimes I just don't have any at a certain time. I also have IBS and fibromyalgia, so that's where most of the averse consequences come in for me. I worry whatever I might wanna eat will cause my stomach or my body to go into a huge flare up. \n\nThank god for sliced bread because that ended up being my dinner last night.",
          "created_utc": 1735926049.0
        },
        {
          "id": "m59cph9",
          "author": "grilledghum",
          "body": "I’m sorry about all ur conditions that sounds hard but I can relate I have a slew of other chronic illnesses as well. What happened in your emetophobia exposure therapy? I’m sorta considering it for the future but I feel like it would creep me out too much so I’m curious how bad it is",
          "created_utc": 1735943788.0
        }
      ]
    },
    {
      "id": "m57w74u",
      "author": "PercentageWide6608",
      "body": "Agreed! Dino nuggets aren't cheap!!",
      "created_utc": 1735927902.0,
      "score": 21,
      "context": [
        {
          "id": "m57eqm3",
          "author": "podgoricanka93",
          "body": "“ARFID Plus” lol I have the premium version of ARFID",
          "created_utc": 1735922695.0
        },
        {
          "id": "m57qcc0",
          "author": "PercentageWide6608",
          "body": "that's what I was thinking Lolll. I didn't sign up for premium how I do I cancel this subscription!!",
          "created_utc": 1735926171.0
        },
        {
          "id": "m57vbbg",
          "author": "TheDyingSailor",
          "body": "If you ever figure this out tell me. This package is too expensive for my lifestyle 🥲",
          "created_utc": 1735927641.0
        }
      ]
    },
    {
      "id": "m58vy4e",
      "author": "bassoonwoman",
      "body": "I have OCD and, surprisingly, dealing with that has helped a lot with my ARFID issues",
      "created_utc": 1735938601.0,
      "score": 7,
      "context": [
        {
          "id": "m57eqm3",
          "author": "podgoricanka93",
          "body": "“ARFID Plus” lol I have the premium version of ARFID",
          "created_utc": 1735922695.0
        },
        {
          "id": "m57qcc0",
          "author": "PercentageWide6608",
          "body": "that's what I was thinking Lolll. I didn't sign up for premium how I do I cancel this subscription!!",
          "created_utc": 1735926171.0
        },
        {
          "id": "m57vbbg",
          "author": "TheDyingSailor",
          "body": "If you ever figure this out tell me. This package is too expensive for my lifestyle 🥲",
          "created_utc": 1735927641.0
        }
      ]
    },
    {
      "id": "m5acbgk",
      "author": "Witty_Health3146",
      "body": "Omg I say this a lot! One day my friend sent me “Dawg Food.” I’ve been wanting to try it, but I’ve been nervous. It’s literally kibble for humans, and the calories/protein/etc. looked pretty decent if I remember correctly.",
      "created_utc": 1735955871.0,
      "score": 13,
      "context": [
        {
          "id": "m57595a",
          "author": "No_Evidence_19",
          "body": "Very much avoidant and restrictive",
          "created_utc": 1735919789.0
        },
        {
          "id": "m579eft",
          "author": "R0da",
          "body": "Yuup.  When food is neutral at best and hostile at worst, what motivation does my body have to want to go back?  I only eat to not die.",
          "created_utc": 1735921075.0
        },
        {
          "id": "m58ct4y",
          "author": "Darthcookie",
          "body": "I keep saying there needs to be human “kibble”, something dry, crunchy, salty and nutritious.",
          "created_utc": 1735932789.0
        }
      ]
    },
    {
      "id": "m5blujq",
      "author": "Venus_Ziegenfalle",
      "body": "I've made some before. I tried to make them very protein rich and rich in vitamins. The nutritional values were honestly not bad but I got sick of them so fast 😅 Also they do sell monkey chow that's very similar to the concept of human kibbles so do with that information what you will 😄",
      "created_utc": 1735975759.0,
      "score": 4,
      "context": [
        {
          "id": "m57595a",
          "author": "No_Evidence_19",
          "body": "Very much avoidant and restrictive",
          "created_utc": 1735919789.0
        },
        {
          "id": "m579eft",
          "author": "R0da",
          "body": "Yuup.  When food is neutral at best and hostile at worst, what motivation does my body have to want to go back?  I only eat to not die.",
          "created_utc": 1735921075.0
        },
        {
          "id": "m58ct4y",
          "author": "Darthcookie",
          "body": "I keep saying there needs to be human “kibble”, something dry, crunchy, salty and nutritious.",
          "created_utc": 1735932789.0
        }
      ]
    },
    {
      "id": "m5dczrl",
      "author": "thatsnuckinfutz",
      "body": "for me currently this is tortilla chips until they randomly gross me out in 2-3 business days and then I'm back to eating just handfuls of trail mix",
      "created_utc": 1736007378.0,
      "score": 1,
      "context": [
        {
          "id": "m57595a",
          "author": "No_Evidence_19",
          "body": "Very much avoidant and restrictive",
          "created_utc": 1735919789.0
        },
        {
          "id": "m579eft",
          "author": "R0da",
          "body": "Yuup.  When food is neutral at best and hostile at worst, what motivation does my body have to want to go back?  I only eat to not die.",
          "created_utc": 1735921075.0
        },
        {
          "id": "m58ct4y",
          "author": "Darthcookie",
          "body": "I keep saying there needs to be human “kibble”, something dry, crunchy, salty and nutritious.",
          "created_utc": 1735932789.0
        }
      ]
    },
    {
      "id": "m5gp5d5",
      "author": "MarsupialPristine677",
      "body": "This is my DREAM……",
      "created_utc": 1736046855.0,
      "score": 3,
      "context": [
        {
          "id": "m57595a",
          "author": "No_Evidence_19",
          "body": "Very much avoidant and restrictive",
          "created_utc": 1735919789.0
        },
        {
          "id": "m579eft",
          "author": "R0da",
          "body": "Yuup.  When food is neutral at best and hostile at worst, what motivation does my body have to want to go back?  I only eat to not die.",
          "created_utc": 1735921075.0
        },
        {
          "id": "m5fji7z",
          "author": "Mean_Ad_4762",
          "body": "I long to photosynthesise",
          "created_utc": 1736032465.0
        }
      ]
    },
    {
      "id": "mb8ed1h",
      "author": "Aromatic_Hyena5269",
      "body": "Dang, you nailed it ",
      "created_utc": 1738812884.0,
      "score": 1,
      "context": [
        {
          "id": "m57595a",
          "author": "No_Evidence_19",
          "body": "Very much avoidant and restrictive",
          "created_utc": 1735919789.0
        },
        {
          "id": "m579eft",
          "author": "R0da",
          "body": "Yuup.  When food is neutral at best and hostile at worst, what motivation does my body have to want to go back?  I only eat to not die.",
          "created_utc": 1735921075.0
        },
        {
          "id": "m5fji7z",
          "author": "Mean_Ad_4762",
          "body": "I long to photosynthesise",
          "created_utc": 1736032465.0
        }
      ]
    },
    {
      "id": "m58ykmr",
      "author": "shortnsweet33",
      "body": "Ugh I can sadly relate to this. And people don’t get it. “Oh it’s so small, you won’t even taste it” like the feel of that texture when I chew makes my body react in a way I wish I could prevent but I can’t! It has nothing to do with me not liking the flavor profile of something in many cases. I’m not actively choosing this, why would someone want this?! \n\nAnd the shivers down my spine, the whole sensation is just absolutely awful. I’ve described it as nails on a chalkboard to a friend before because that is how my whole body feels with certain textures whether eating or touching things.",
      "created_utc": 1735939401.0,
      "score": 16,
      "context": [
        {
          "id": "m5788cf",
          "author": "Cyber-Cafe",
          "body": "Texture based avoidant. It fucking sucks, because the flavor/color/sight of most food does not bother me at all. But I’m very sensitive to textures in general and food in my mouth is no different.",
          "created_utc": 1735920716.0
        },
        {
          "id": "m58on01",
          "author": "shortnsweet33",
          "body": "Same. Certain textures my body will just gag no matter what I do. Even food exposures of repetitively eating the same textured challenge food (lettuce) doing that 3 days a week for 8 weeks means I can now get down 5 tiny bites of lettuce before my body gags… but that’s it lol. \n\nSo frustrating. I love the smells of certain things and the flavors they bring to food but my body won’t let me enjoy them without that reflex. It sucks so much.",
          "created_utc": 1735936379.0
        },
        {
          "id": "m58u87z",
          "author": "alymars",
          "body": "Yes to all of this. I have physically (uncontrollably) wretched at a table before when placing something in my mouth that is texture wise a no-no. Its so embarrassing",
          "created_utc": 1735938076.0
        }
      ]
    },
    {
      "id": "m5b6iak",
      "author": "DisagreeableCompote",
      "body": "Same… a strawberry when I was 5 because I was *forced* to eat one and I still remember it like it was yesterday. I physically could not swallow it and it came right back up.\n\nSometimes happens with pills.",
      "created_utc": 1735967766.0,
      "score": 1,
      "context": [
        {
          "id": "m5788cf",
          "author": "Cyber-Cafe",
          "body": "Texture based avoidant. It fucking sucks, because the flavor/color/sight of most food does not bother me at all. But I’m very sensitive to textures in general and food in my mouth is no different.",
          "created_utc": 1735920716.0
        },
        {
          "id": "m58on01",
          "author": "shortnsweet33",
          "body": "Same. Certain textures my body will just gag no matter what I do. Even food exposures of repetitively eating the same textured challenge food (lettuce) doing that 3 days a week for 8 weeks means I can now get down 5 tiny bites of lettuce before my body gags… but that’s it lol. \n\nSo frustrating. I love the smells of certain things and the flavors they bring to food but my body won’t let me enjoy them without that reflex. It sucks so much.",
          "created_utc": 1735936379.0
        },
        {
          "id": "m58u87z",
          "author": "alymars",
          "body": "Yes to all of this. I have physically (uncontrollably) wretched at a table before when placing something in my mouth that is texture wise a no-no. Its so embarrassing",
          "created_utc": 1735938076.0
        }
      ]
    },
    {
      "id": "m5b6ohy",
      "author": "DisagreeableCompote",
      "body": "Omg me either. The smell of it REALLY bothers me too which makes me wonder if I have some kind of scent sensitivity because I’ve never heard anyone else talk about the smell of lettuce .",
      "created_utc": 1735967845.0,
      "score": 3,
      "context": [
        {
          "id": "m5788cf",
          "author": "Cyber-Cafe",
          "body": "Texture based avoidant. It fucking sucks, because the flavor/color/sight of most food does not bother me at all. But I’m very sensitive to textures in general and food in my mouth is no different.",
          "created_utc": 1735920716.0
        },
        {
          "id": "m58on01",
          "author": "shortnsweet33",
          "body": "Same. Certain textures my body will just gag no matter what I do. Even food exposures of repetitively eating the same textured challenge food (lettuce) doing that 3 days a week for 8 weeks means I can now get down 5 tiny bites of lettuce before my body gags… but that’s it lol. \n\nSo frustrating. I love the smells of certain things and the flavors they bring to food but my body won’t let me enjoy them without that reflex. It sucks so much.",
          "created_utc": 1735936379.0
        },
        {
          "id": "m5aa5oh",
          "author": "SPinc1",
          "body": "Lettuce is horrible! I don't understand how people can like it.",
          "created_utc": 1735955105.0
        }
      ]
    },
    {
      "id": "m5kg35f",
      "author": "None",
      "body": "longing marvelous cagey pocket fanatical languid knee retire lunchroom thumb\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
      "created_utc": 1736104491.0,
      "score": 1,
      "context": [
        {
          "id": "m5788cf",
          "author": "Cyber-Cafe",
          "body": "Texture based avoidant. It fucking sucks, because the flavor/color/sight of most food does not bother me at all. But I’m very sensitive to textures in general and food in my mouth is no different.",
          "created_utc": 1735920716.0
        },
        {
          "id": "m58on01",
          "author": "shortnsweet33",
          "body": "Same. Certain textures my body will just gag no matter what I do. Even food exposures of repetitively eating the same textured challenge food (lettuce) doing that 3 days a week for 8 weeks means I can now get down 5 tiny bites of lettuce before my body gags… but that’s it lol. \n\nSo frustrating. I love the smells of certain things and the flavors they bring to food but my body won’t let me enjoy them without that reflex. It sucks so much.",
          "created_utc": 1735936379.0
        },
        {
          "id": "m5aa5oh",
          "author": "SPinc1",
          "body": "Lettuce is horrible! I don't understand how people can like it.",
          "created_utc": 1735955105.0
        }
      ]
    },
    {
      "id": "m59293h",
      "author": "un-pamplemousse",
      "body": "I have always said that my phobia saved me from being bulimic. Glad I’m not alone!",
      "created_utc": 1735940523.0,
      "score": 8,
      "context": [
        {
          "id": "m57dhm6",
          "author": "AdhesivenessOk5534",
          "body": "Aversive and restrictive \n\nI have a phobia of vomiting and I have fucked up hunger signals from the ARFID turning into anorexia when I was 16 \n\nI've recovered from Ana but the ARFID remains",
          "created_utc": 1735922319.0
        },
        {
          "id": "m57fxlp",
          "author": "grilledghum",
          "body": "This is fascinating to me ive never heard of someone with emetophobia and anorexia\nI think its good though that it didn’t turn into bulimia for you for that reason",
          "created_utc": 1735923052.0
        },
        {
          "id": "m57gqoj",
          "author": "AdhesivenessOk5534",
          "body": ">that it didn’t turn into bulimia for you for that reason\n\nI've said this hundreds of times. The phobia was the only thing that saved me from bulimia \n\n>This is fascinating to me ive never heard of someone with emetophobia and anorexia\n\nIt started out with the lack of appetite and the fear of eating from the phobia and morphed into a weight thing for some odd reason. It was also enabled by my parents who would give me like a spoonful of food at the dinner table and would drone on and on about how terrible I would look if I got fat. (They were right I gained 100 pounds from meds and I legitimately looked so bad, I've since lost the 100 pounds)",
          "created_utc": 1735923294.0
        }
      ]
    },
    {
      "id": "m582f5s",
      "author": "Nthorpe1996",
      "body": "The same for me! Every time I’ve said that same thing everyone thinks I’m nuts! My phobia is so bad that it triggers the fight or flight & I end up doing both if I even hear somebody make *THAT* noise! Although I still struggle with the ANA. I can usually just hide behind the arfid though because I’ve gotten the actual diagnosis for it.",
      "created_utc": 1735929739.0,
      "score": 5,
      "context": [
        {
          "id": "m57dhm6",
          "author": "AdhesivenessOk5534",
          "body": "Aversive and restrictive \n\nI have a phobia of vomiting and I have fucked up hunger signals from the ARFID turning into anorexia when I was 16 \n\nI've recovered from Ana but the ARFID remains",
          "created_utc": 1735922319.0
        },
        {
          "id": "m57fxlp",
          "author": "grilledghum",
          "body": "This is fascinating to me ive never heard of someone with emetophobia and anorexia\nI think its good though that it didn’t turn into bulimia for you for that reason",
          "created_utc": 1735923052.0
        },
        {
          "id": "m57gqoj",
          "author": "AdhesivenessOk5534",
          "body": ">that it didn’t turn into bulimia for you for that reason\n\nI've said this hundreds of times. The phobia was the only thing that saved me from bulimia \n\n>This is fascinating to me ive never heard of someone with emetophobia and anorexia\n\nIt started out with the lack of appetite and the fear of eating from the phobia and morphed into a weight thing for some odd reason. It was also enabled by my parents who would give me like a spoonful of food at the dinner table and would drone on and on about how terrible I would look if I got fat. (They were right I gained 100 pounds from meds and I legitimately looked so bad, I've since lost the 100 pounds)",
          "created_utc": 1735923294.0
        }
      ]
    },
    {
      "id": "m5k7j9g",
      "author": "Rainyli",
      "body": "Your parents are fucked up. I'm so sorry you had to go through that, and even more proud of you for recovering. You're doing great 💕",
      "created_utc": 1736102136.0,
      "score": 2,
      "context": [
        {
          "id": "m57dhm6",
          "author": "AdhesivenessOk5534",
          "body": "Aversive and restrictive \n\nI have a phobia of vomiting and I have fucked up hunger signals from the ARFID turning into anorexia when I was 16 \n\nI've recovered from Ana but the ARFID remains",
          "created_utc": 1735922319.0
        },
        {
          "id": "m57fxlp",
          "author": "grilledghum",
          "body": "This is fascinating to me ive never heard of someone with emetophobia and anorexia\nI think its good though that it didn’t turn into bulimia for you for that reason",
          "created_utc": 1735923052.0
        },
        {
          "id": "m57gqoj",
          "author": "AdhesivenessOk5534",
          "body": ">that it didn’t turn into bulimia for you for that reason\n\nI've said this hundreds of times. The phobia was the only thing that saved me from bulimia \n\n>This is fascinating to me ive never heard of someone with emetophobia and anorexia\n\nIt started out with the lack of appetite and the fear of eating from the phobia and morphed into a weight thing for some odd reason. It was also enabled by my parents who would give me like a spoonful of food at the dinner table and would drone on and on about how terrible I would look if I got fat. (They were right I gained 100 pounds from meds and I legitimately looked so bad, I've since lost the 100 pounds)",
          "created_utc": 1735923294.0
        }
      ]
    },
    {
      "id": "m5b8pt2",
      "author": "DisagreeableCompote",
      "body": "I relate to that somewhat… I think my ARFID also led to anorexia through external influence from others…. people used to call me anorexic in school because I was always thin thin, but I also had strange eating habits because of the ARFID, and it transformed into “well if I just *dont eat* there’s no problem…” and then I would simultaneously get compliments on how “anorexic” I looked, which just reinforced my restrictive eating…\n\nand now I struggle with body dysmorphia and fear of gaining weight and restricting when i know the scale says I should actually be trying to gain weight",
      "created_utc": 1735968785.0,
      "score": 1,
      "context": [
        {
          "id": "m57dhm6",
          "author": "AdhesivenessOk5534",
          "body": "Aversive and restrictive \n\nI have a phobia of vomiting and I have fucked up hunger signals from the ARFID turning into anorexia when I was 16 \n\nI've recovered from Ana but the ARFID remains",
          "created_utc": 1735922319.0
        },
        {
          "id": "m57fxlp",
          "author": "grilledghum",
          "body": "This is fascinating to me ive never heard of someone with emetophobia and anorexia\nI think its good though that it didn’t turn into bulimia for you for that reason",
          "created_utc": 1735923052.0
        },
        {
          "id": "m57gqoj",
          "author": "AdhesivenessOk5534",
          "body": ">that it didn’t turn into bulimia for you for that reason\n\nI've said this hundreds of times. The phobia was the only thing that saved me from bulimia \n\n>This is fascinating to me ive never heard of someone with emetophobia and anorexia\n\nIt started out with the lack of appetite and the fear of eating from the phobia and morphed into a weight thing for some odd reason. It was also enabled by my parents who would give me like a spoonful of food at the dinner table and would drone on and on about how terrible I would look if I got fat. (They were right I gained 100 pounds from meds and I legitimately looked so bad, I've since lost the 100 pounds)",
          "created_utc": 1735923294.0
        }
      ]
    },
    {
      "id": "m5a7ps4",
      "author": "PercentageWide6608",
      "body": "I used to throw up at the sound of other people's vomiting.I held my friends hair up over the trash can last night when she was sick and was completely fine. Progress!",
      "created_utc": 1735954249.0,
      "score": 3,
      "context": [
        {
          "id": "m57pxjo",
          "author": "PercentageWide6608",
          "body": "I'm ARFID+ I would say I'm most avoidant, and restrictive. I do have certain aversions though that I stick by very very strongly. Not as much vomiting anymore as I've basically been forced through exposure therapy with emetophobia because of a vomiting condition I was also dealing with for a while. \n\nI avoid eating most of the time and just don't enjoy it and don't want to do it. When I do inevitably have to eat I have a hard time deciding what to eat because I hate most foods and textures and my safe foods are constantly switching and sometimes I just don't have any at a certain time. I also have IBS and fibromyalgia, so that's where most of the averse consequences come in for me. I worry whatever I might wanna eat will cause my stomach or my body to go into a huge flare up. \n\nThank god for sliced bread because that ended up being my dinner last night.",
          "created_utc": 1735926049.0
        },
        {
          "id": "m59cph9",
          "author": "grilledghum",
          "body": "I’m sorry about all ur conditions that sounds hard but I can relate I have a slew of other chronic illnesses as well. What happened in your emetophobia exposure therapy? I’m sorta considering it for the future but I feel like it would creep me out too much so I’m curious how bad it is",
          "created_utc": 1735943788.0
        },
        {
          "id": "m5a7c53",
          "author": "PercentageWide6608",
          "body": "I didn't really do exposure therapy in a medically traditional sense. Unfortunately I just got really sick for a long time and I could not stop vomiting. At first I would have panic attacks almost every single time I felt it coming on. Then I started getting more and more used to the feeling because I was experiencing it. I was less scared of it because I had dealt with it so much that I sorta become numb to the sensation. \n\nNot sure how it'd work in a traditional sense, but in a weird way it did genuinely really help me stop letting vomiting control my life once I finally got the issue under control and got medicated for my acid reflux issues. I just had dealt with it alot. \n\nMy way isn't something you can exactly try unless you get sick, which would be shitty. I'd say I did kinda exposure therapy myself a bit with spiders by looking at photos first and then slowly transitioning into videos and then once I could handle that I would look in the tank at the zoo and now when I see just a small spider I can kill it when before I would cry. Still freak out over big ones though. I do believe exposing yourself a bit can help. Sucks while you're working on it though.",
          "created_utc": 1735954116.0
        }
      ]
    },
    {
      "id": "m5d4r36",
      "author": "SomeTraits",
      "body": "I'm sorry, if this isn't too personal would you mind to share some details? Maybe I could learn about something worth looking into.\n\nThanks :-)",
      "created_utc": 1736004612.0,
      "score": 3,
      "context": [
        {
          "id": "m57eqm3",
          "author": "podgoricanka93",
          "body": "“ARFID Plus” lol I have the premium version of ARFID",
          "created_utc": 1735922695.0
        },
        {
          "id": "m57qcc0",
          "author": "PercentageWide6608",
          "body": "that's what I was thinking Lolll. I didn't sign up for premium how I do I cancel this subscription!!",
          "created_utc": 1735926171.0
        },
        {
          "id": "m57vbbg",
          "author": "TheDyingSailor",
          "body": "If you ever figure this out tell me. This package is too expensive for my lifestyle 🥲",
          "created_utc": 1735927641.0
        },
        {
          "id": "m58vy4e",
          "author": "bassoonwoman",
          "body": "I have OCD and, surprisingly, dealing with that has helped a lot with my ARFID issues",
          "created_utc": 1735938601.0
        }
      ]
    },
    {
      "id": "m5df1j9",
      "author": "podgoricanka93",
      "body": "I also have OCD",
      "created_utc": 1736008033.0,
      "score": 1,
      "context": [
        {
          "id": "m57eqm3",
          "author": "podgoricanka93",
          "body": "“ARFID Plus” lol I have the premium version of ARFID",
          "created_utc": 1735922695.0
        },
        {
          "id": "m57qcc0",
          "author": "PercentageWide6608",
          "body": "that's what I was thinking Lolll. I didn't sign up for premium how I do I cancel this subscription!!",
          "created_utc": 1735926171.0
        },
        {
          "id": "m57vbbg",
          "author": "TheDyingSailor",
          "body": "If you ever figure this out tell me. This package is too expensive for my lifestyle 🥲",
          "created_utc": 1735927641.0
        },
        {
          "id": "m58vy4e",
          "author": "bassoonwoman",
          "body": "I have OCD and, surprisingly, dealing with that has helped a lot with my ARFID issues",
          "created_utc": 1735938601.0
        }
      ]
    },
    {
      "id": "m5b0ger",
      "author": "bubblenuts101",
      "body": "Really! I always make the joke about the food they eat when they are unplugged from the matrix, has all the stuff, just be done with it.\nWould you mind sharing the link for the kibble?",
      "created_utc": 1735965090.0,
      "score": 4,
      "context": [
        {
          "id": "m57595a",
          "author": "No_Evidence_19",
          "body": "Very much avoidant and restrictive",
          "created_utc": 1735919789.0
        },
        {
          "id": "m579eft",
          "author": "R0da",
          "body": "Yuup.  When food is neutral at best and hostile at worst, what motivation does my body have to want to go back?  I only eat to not die.",
          "created_utc": 1735921075.0
        },
        {
          "id": "m58ct4y",
          "author": "Darthcookie",
          "body": "I keep saying there needs to be human “kibble”, something dry, crunchy, salty and nutritious.",
          "created_utc": 1735932789.0
        },
        {
          "id": "m5acbgk",
          "author": "Witty_Health3146",
          "body": "Omg I say this a lot! One day my friend sent me “Dawg Food.” I’ve been wanting to try it, but I’ve been nervous. It’s literally kibble for humans, and the calories/protein/etc. looked pretty decent if I remember correctly.",
          "created_utc": 1735955871.0
        }
      ]
    },
    {
      "id": "m5dobcw",
      "author": "Darthcookie",
      "body": "That’s a surprisingly basic recipe and except for the chicken and beef I think I could handle it. I’m not a big fan of sweet potatoes or sweet corn but I might try a variation and substitute the chicken with another form of vegan protein 🤔",
      "created_utc": 1736010938.0,
      "score": 2,
      "context": [
        {
          "id": "m57595a",
          "author": "No_Evidence_19",
          "body": "Very much avoidant and restrictive",
          "created_utc": 1735919789.0
        },
        {
          "id": "m579eft",
          "author": "R0da",
          "body": "Yuup.  When food is neutral at best and hostile at worst, what motivation does my body have to want to go back?  I only eat to not die.",
          "created_utc": 1735921075.0
        },
        {
          "id": "m58ct4y",
          "author": "Darthcookie",
          "body": "I keep saying there needs to be human “kibble”, something dry, crunchy, salty and nutritious.",
          "created_utc": 1735932789.0
        },
        {
          "id": "m5acbgk",
          "author": "Witty_Health3146",
          "body": "Omg I say this a lot! One day my friend sent me “Dawg Food.” I’ve been wanting to try it, but I’ve been nervous. It’s literally kibble for humans, and the calories/protein/etc. looked pretty decent if I remember correctly.",
          "created_utc": 1735955871.0
        }
      ]
    },
    {
      "id": "m5dp5xy",
      "author": "Darthcookie",
      "body": "Like actual food for primates? I don’t think that’d be very palatable. \n\nI’ve been trying to increase my protein intake but it’s hard given I’m plant based on that front and even picky when it comes to vegan alternatives. \n\nI can’t have vegan burgers everyday as much as I’d like. \n\nI’m gonna try roasting chickpeas and see how that goes. I just need to figure out the right seasoning I think.",
      "created_utc": 1736011207.0,
      "score": 2,
      "context": [
        {
          "id": "m57595a",
          "author": "No_Evidence_19",
          "body": "Very much avoidant and restrictive",
          "created_utc": 1735919789.0
        },
        {
          "id": "m579eft",
          "author": "R0da",
          "body": "Yuup.  When food is neutral at best and hostile at worst, what motivation does my body have to want to go back?  I only eat to not die.",
          "created_utc": 1735921075.0
        },
        {
          "id": "m58ct4y",
          "author": "Darthcookie",
          "body": "I keep saying there needs to be human “kibble”, something dry, crunchy, salty and nutritious.",
          "created_utc": 1735932789.0
        },
        {
          "id": "m5blujq",
          "author": "Venus_Ziegenfalle",
          "body": "I've made some before. I tried to make them very protein rich and rich in vitamins. The nutritional values were honestly not bad but I got sick of them so fast 😅 Also they do sell monkey chow that's very similar to the concept of human kibbles so do with that information what you will 😄",
          "created_utc": 1735975759.0
        }
      ]
    },
    {
      "id": "m5dnsdp",
      "author": "Darthcookie",
      "body": "I’ve pretty much been rotating hummus, spaghetti with tofu bolognese and quesadillas. \n\nIt can get hard when the brand of hummus I like is out of stock. I’ve tried homemade to reduce cost but I hated it 😭",
      "created_utc": 1736010772.0,
      "score": 1,
      "context": [
        {
          "id": "m57595a",
          "author": "No_Evidence_19",
          "body": "Very much avoidant and restrictive",
          "created_utc": 1735919789.0
        },
        {
          "id": "m579eft",
          "author": "R0da",
          "body": "Yuup.  When food is neutral at best and hostile at worst, what motivation does my body have to want to go back?  I only eat to not die.",
          "created_utc": 1735921075.0
        },
        {
          "id": "m58ct4y",
          "author": "Darthcookie",
          "body": "I keep saying there needs to be human “kibble”, something dry, crunchy, salty and nutritious.",
          "created_utc": 1735932789.0
        },
        {
          "id": "m5dczrl",
          "author": "thatsnuckinfutz",
          "body": "for me currently this is tortilla chips until they randomly gross me out in 2-3 business days and then I'm back to eating just handfuls of trail mix",
          "created_utc": 1736007378.0
        }
      ]
    },
    {
      "id": "m5biqby",
      "author": "shortnsweet33",
      "body": "It 100% has a smell!!!",
      "created_utc": 1735973938.0,
      "score": 2,
      "context": [
        {
          "id": "m5788cf",
          "author": "Cyber-Cafe",
          "body": "Texture based avoidant. It fucking sucks, because the flavor/color/sight of most food does not bother me at all. But I’m very sensitive to textures in general and food in my mouth is no different.",
          "created_utc": 1735920716.0
        },
        {
          "id": "m58on01",
          "author": "shortnsweet33",
          "body": "Same. Certain textures my body will just gag no matter what I do. Even food exposures of repetitively eating the same textured challenge food (lettuce) doing that 3 days a week for 8 weeks means I can now get down 5 tiny bites of lettuce before my body gags… but that’s it lol. \n\nSo frustrating. I love the smells of certain things and the flavors they bring to food but my body won’t let me enjoy them without that reflex. It sucks so much.",
          "created_utc": 1735936379.0
        },
        {
          "id": "m5aa5oh",
          "author": "SPinc1",
          "body": "Lettuce is horrible! I don't understand how people can like it.",
          "created_utc": 1735955105.0
        },
        {
          "id": "m5b6ohy",
          "author": "DisagreeableCompote",
          "body": "Omg me either. The smell of it REALLY bothers me too which makes me wonder if I have some kind of scent sensitivity because I’ve never heard anyone else talk about the smell of lettuce .",
          "created_utc": 1735967845.0
        }
      ]
    },
    {
      "id": "m5l2spr",
      "author": "AdhesivenessOk5534",
      "body": "Aww tysm 😊  I appreciate the sentiment",
      "created_utc": 1736111020.0,
      "score": 1,
      "context": [
        {
          "id": "m57dhm6",
          "author": "AdhesivenessOk5534",
          "body": "Aversive and restrictive \n\nI have a phobia of vomiting and I have fucked up hunger signals from the ARFID turning into anorexia when I was 16 \n\nI've recovered from Ana but the ARFID remains",
          "created_utc": 1735922319.0
        },
        {
          "id": "m57fxlp",
          "author": "grilledghum",
          "body": "This is fascinating to me ive never heard of someone with emetophobia and anorexia\nI think its good though that it didn’t turn into bulimia for you for that reason",
          "created_utc": 1735923052.0
        },
        {
          "id": "m57gqoj",
          "author": "AdhesivenessOk5534",
          "body": ">that it didn’t turn into bulimia for you for that reason\n\nI've said this hundreds of times. The phobia was the only thing that saved me from bulimia \n\n>This is fascinating to me ive never heard of someone with emetophobia and anorexia\n\nIt started out with the lack of appetite and the fear of eating from the phobia and morphed into a weight thing for some odd reason. It was also enabled by my parents who would give me like a spoonful of food at the dinner table and would drone on and on about how terrible I would look if I got fat. (They were right I gained 100 pounds from meds and I legitimately looked so bad, I've since lost the 100 pounds)",
          "created_utc": 1735923294.0
        },
        {
          "id": "m5k7j9g",
          "author": "Rainyli",
          "body": "Your parents are fucked up. I'm so sorry you had to go through that, and even more proud of you for recovering. You're doing great 💕",
          "created_utc": 1736102136.0
        }
      ]
    },
    {
      "id": "m6w2ssq",
      "author": "grilledghum",
      "body": "That’s huge progress omg good for you!! Alright sounds like the way to go is just normal life exposure, we’ll see maybe i’ll try that thanks for ur reply",
      "created_utc": 1736755984.0,
      "score": 2,
      "context": [
        {
          "id": "m57pxjo",
          "author": "PercentageWide6608",
          "body": "I'm ARFID+ I would say I'm most avoidant, and restrictive. I do have certain aversions though that I stick by very very strongly. Not as much vomiting anymore as I've basically been forced through exposure therapy with emetophobia because of a vomiting condition I was also dealing with for a while. \n\nI avoid eating most of the time and just don't enjoy it and don't want to do it. When I do inevitably have to eat I have a hard time deciding what to eat because I hate most foods and textures and my safe foods are constantly switching and sometimes I just don't have any at a certain time. I also have IBS and fibromyalgia, so that's where most of the averse consequences come in for me. I worry whatever I might wanna eat will cause my stomach or my body to go into a huge flare up. \n\nThank god for sliced bread because that ended up being my dinner last night.",
          "created_utc": 1735926049.0
        },
        {
          "id": "m59cph9",
          "author": "grilledghum",
          "body": "I’m sorry about all ur conditions that sounds hard but I can relate I have a slew of other chronic illnesses as well. What happened in your emetophobia exposure therapy? I’m sorta considering it for the future but I feel like it would creep me out too much so I’m curious how bad it is",
          "created_utc": 1735943788.0
        },
        {
          "id": "m5a7c53",
          "author": "PercentageWide6608",
          "body": "I didn't really do exposure therapy in a medically traditional sense. Unfortunately I just got really sick for a long time and I could not stop vomiting. At first I would have panic attacks almost every single time I felt it coming on. Then I started getting more and more used to the feeling because I was experiencing it. I was less scared of it because I had dealt with it so much that I sorta become numb to the sensation. \n\nNot sure how it'd work in a traditional sense, but in a weird way it did genuinely really help me stop letting vomiting control my life once I finally got the issue under control and got medicated for my acid reflux issues. I just had dealt with it alot. \n\nMy way isn't something you can exactly try unless you get sick, which would be shitty. I'd say I did kinda exposure therapy myself a bit with spiders by looking at photos first and then slowly transitioning into videos and then once I could handle that I would look in the tank at the zoo and now when I see just a small spider I can kill it when before I would cry. Still freak out over big ones though. I do believe exposing yourself a bit can help. Sucks while you're working on it though.",
          "created_utc": 1735954116.0
        },
        {
          "id": "m5a7ps4",
          "author": "PercentageWide6608",
          "body": "I used to throw up at the sound of other people's vomiting.I held my friends hair up over the trash can last night when she was sick and was completely fine. Progress!",
          "created_utc": 1735954249.0
        }
      ]
    },
    {
      "id": "m5e96g6",
      "author": "bassoonwoman",
      "body": "No worries! Not too personal at all\n\nI did dialectical behavioral therapy to retrain my brain out of negative thinking that I would automatically go into about things, especially feelings. I also did exposure therapy for OCD and I took those tools and applied it to my food issues. I have avoidant and restrictive ARFID, it still bothers me a little but wayyyy less than it used to.",
      "created_utc": 1736017404.0,
      "score": 3,
      "context": [
        {
          "id": "m57eqm3",
          "author": "podgoricanka93",
          "body": "“ARFID Plus” lol I have the premium version of ARFID",
          "created_utc": 1735922695.0
        },
        {
          "id": "m57qcc0",
          "author": "PercentageWide6608",
          "body": "that's what I was thinking Lolll. I didn't sign up for premium how I do I cancel this subscription!!",
          "created_utc": 1735926171.0
        },
        {
          "id": "m57vbbg",
          "author": "TheDyingSailor",
          "body": "If you ever figure this out tell me. This package is too expensive for my lifestyle 🥲",
          "created_utc": 1735927641.0
        },
        {
          "id": "m58vy4e",
          "author": "bassoonwoman",
          "body": "I have OCD and, surprisingly, dealing with that has helped a lot with my ARFID issues",
          "created_utc": 1735938601.0
        },
        {
          "id": "m5d4r36",
          "author": "SomeTraits",
          "body": "I'm sorry, if this isn't too personal would you mind to share some details? Maybe I could learn about something worth looking into.\n\nThanks :-)",
          "created_utc": 1736004612.0
        }
      ]
    },
    {
      "id": "m5e9d9x",
      "author": "bassoonwoman",
      "body": "I believe they're correlated. I did exposure therapy and dialectical behavioral therapy for mine and it helped both issues for me",
      "created_utc": 1736017464.0,
      "score": 1,
      "context": [
        {
          "id": "m57eqm3",
          "author": "podgoricanka93",
          "body": "“ARFID Plus” lol I have the premium version of ARFID",
          "created_utc": 1735922695.0
        },
        {
          "id": "m57qcc0",
          "author": "PercentageWide6608",
          "body": "that's what I was thinking Lolll. I didn't sign up for premium how I do I cancel this subscription!!",
          "created_utc": 1735926171.0
        },
        {
          "id": "m57vbbg",
          "author": "TheDyingSailor",
          "body": "If you ever figure this out tell me. This package is too expensive for my lifestyle 🥲",
          "created_utc": 1735927641.0
        },
        {
          "id": "m58vy4e",
          "author": "bassoonwoman",
          "body": "I have OCD and, surprisingly, dealing with that has helped a lot with my ARFID issues",
          "created_utc": 1735938601.0
        },
        {
          "id": "m5df1j9",
          "author": "podgoricanka93",
          "body": "I also have OCD",
          "created_utc": 1736008033.0
        }
      ]
    },
    {
      "id": "m5b9xsj",
      "author": "Witty_Health3146",
      "body": "Not sure if this is the most cost effective way to get it, but this link below is them directly.\n\nhttps://eatdawgfood.com\n\n~$5.60 a meal for beef. ~$5.36 a meal for chicken. There’s an option to buy both bags too for $19 cheaper than buying the two bags separately. I’m so curious now but I can’t justify spending that if I end up hating it. Maybe one day.",
      "created_utc": 1735969362.0,
      "score": 6,
      "context": [
        {
          "id": "m57595a",
          "author": "No_Evidence_19",
          "body": "Very much avoidant and restrictive",
          "created_utc": 1735919789.0
        },
        {
          "id": "m579eft",
          "author": "R0da",
          "body": "Yuup.  When food is neutral at best and hostile at worst, what motivation does my body have to want to go back?  I only eat to not die.",
          "created_utc": 1735921075.0
        },
        {
          "id": "m58ct4y",
          "author": "Darthcookie",
          "body": "I keep saying there needs to be human “kibble”, something dry, crunchy, salty and nutritious.",
          "created_utc": 1735932789.0
        },
        {
          "id": "m5acbgk",
          "author": "Witty_Health3146",
          "body": "Omg I say this a lot! One day my friend sent me “Dawg Food.” I’ve been wanting to try it, but I’ve been nervous. It’s literally kibble for humans, and the calories/protein/etc. looked pretty decent if I remember correctly.",
          "created_utc": 1735955871.0
        },
        {
          "id": "m5b0ger",
          "author": "bubblenuts101",
          "body": "Really! I always make the joke about the food they eat when they are unplugged from the matrix, has all the stuff, just be done with it.\nWould you mind sharing the link for the kibble?",
          "created_utc": 1735965090.0
        }
      ]
    },
    {
      "id": "m5dt93v",
      "author": "Venus_Ziegenfalle",
      "body": ">Like actual food for primates?\n\nYup 😅\n\nMine was vegan. I used a mix of rice protein powder (90% protein which is crazy), pumpkin seed protein powder for taste, coconut fat and different vegetables.",
      "created_utc": 1736012497.0,
      "score": 2,
      "context": [
        {
          "id": "m57595a",
          "author": "No_Evidence_19",
          "body": "Very much avoidant and restrictive",
          "created_utc": 1735919789.0
        },
        {
          "id": "m579eft",
          "author": "R0da",
          "body": "Yuup.  When food is neutral at best and hostile at worst, what motivation does my body have to want to go back?  I only eat to not die.",
          "created_utc": 1735921075.0
        },
        {
          "id": "m58ct4y",
          "author": "Darthcookie",
          "body": "I keep saying there needs to be human “kibble”, something dry, crunchy, salty and nutritious.",
          "created_utc": 1735932789.0
        },
        {
          "id": "m5blujq",
          "author": "Venus_Ziegenfalle",
          "body": "I've made some before. I tried to make them very protein rich and rich in vitamins. The nutritional values were honestly not bad but I got sick of them so fast 😅 Also they do sell monkey chow that's very similar to the concept of human kibbles so do with that information what you will 😄",
          "created_utc": 1735975759.0
        },
        {
          "id": "m5dp5xy",
          "author": "Darthcookie",
          "body": "Like actual food for primates? I don’t think that’d be very palatable. \n\nI’ve been trying to increase my protein intake but it’s hard given I’m plant based on that front and even picky when it comes to vegan alternatives. \n\nI can’t have vegan burgers everyday as much as I’d like. \n\nI’m gonna try roasting chickpeas and see how that goes. I just need to figure out the right seasoning I think.",
          "created_utc": 1736011207.0
        }
      ]
    },
    {
      "id": "m5dqltr",
      "author": "thatsnuckinfutz",
      "body": "Its rough...my usuals are no longer desirable lol\n\nfor me its been a specific brand of trail mix, string cheese and tortilla chips.\n\ni love cooking/baking but have little to no desire to eat anything i make.",
      "created_utc": 1736011665.0,
      "score": 1,
      "context": [
        {
          "id": "m57595a",
          "author": "No_Evidence_19",
          "body": "Very much avoidant and restrictive",
          "created_utc": 1735919789.0
        },
        {
          "id": "m579eft",
          "author": "R0da",
          "body": "Yuup.  When food is neutral at best and hostile at worst, what motivation does my body have to want to go back?  I only eat to not die.",
          "created_utc": 1735921075.0
        },
        {
          "id": "m58ct4y",
          "author": "Darthcookie",
          "body": "I keep saying there needs to be human “kibble”, something dry, crunchy, salty and nutritious.",
          "created_utc": 1735932789.0
        },
        {
          "id": "m5dczrl",
          "author": "thatsnuckinfutz",
          "body": "for me currently this is tortilla chips until they randomly gross me out in 2-3 business days and then I'm back to eating just handfuls of trail mix",
          "created_utc": 1736007378.0
        },
        {
          "id": "m5dnsdp",
          "author": "Darthcookie",
          "body": "I’ve pretty much been rotating hummus, spaghetti with tofu bolognese and quesadillas. \n\nIt can get hard when the brand of hummus I like is out of stock. I’ve tried homemade to reduce cost but I hated it 😭",
          "created_utc": 1736010772.0
        }
      ]
    },
    {
      "id": "m68t87q",
      "author": "SomeTraits",
      "body": "Thank you very much! \nWas exposure therapy easier for OCD than for ARFID? I'm asking because I tried that for ARFID with my therapist, but it really didn't work out. Gave me a lot of anxiety.",
      "created_utc": 1736439407.0,
      "score": 1,
      "context": [
        {
          "id": "m57eqm3",
          "author": "podgoricanka93",
          "body": "“ARFID Plus” lol I have the premium version of ARFID",
          "created_utc": 1735922695.0
        },
        {
          "id": "m57qcc0",
          "author": "PercentageWide6608",
          "body": "that's what I was thinking Lolll. I didn't sign up for premium how I do I cancel this subscription!!",
          "created_utc": 1735926171.0
        },
        {
          "id": "m57vbbg",
          "author": "TheDyingSailor",
          "body": "If you ever figure this out tell me. This package is too expensive for my lifestyle 🥲",
          "created_utc": 1735927641.0
        },
        {
          "id": "m58vy4e",
          "author": "bassoonwoman",
          "body": "I have OCD and, surprisingly, dealing with that has helped a lot with my ARFID issues",
          "created_utc": 1735938601.0
        },
        {
          "id": "m5d4r36",
          "author": "SomeTraits",
          "body": "I'm sorry, if this isn't too personal would you mind to share some details? Maybe I could learn about something worth looking into.\n\nThanks :-)",
          "created_utc": 1736004612.0
        },
        {
          "id": "m5e96g6",
          "author": "bassoonwoman",
          "body": "No worries! Not too personal at all\n\nI did dialectical behavioral therapy to retrain my brain out of negative thinking that I would automatically go into about things, especially feelings. I also did exposure therapy for OCD and I took those tools and applied it to my food issues. I have avoidant and restrictive ARFID, it still bothers me a little but wayyyy less than it used to.",
          "created_utc": 1736017404.0
        }
      ]
    },
    {
      "id": "m5bicaz",
      "author": "ipaintbadly",
      "body": "I’m super curious too!!",
      "created_utc": 1735973723.0,
      "score": 2,
      "context": [
        {
          "id": "m57595a",
          "author": "No_Evidence_19",
          "body": "Very much avoidant and restrictive",
          "created_utc": 1735919789.0
        },
        {
          "id": "m579eft",
          "author": "R0da",
          "body": "Yuup.  When food is neutral at best and hostile at worst, what motivation does my body have to want to go back?  I only eat to not die.",
          "created_utc": 1735921075.0
        },
        {
          "id": "m58ct4y",
          "author": "Darthcookie",
          "body": "I keep saying there needs to be human “kibble”, something dry, crunchy, salty and nutritious.",
          "created_utc": 1735932789.0
        },
        {
          "id": "m5acbgk",
          "author": "Witty_Health3146",
          "body": "Omg I say this a lot! One day my friend sent me “Dawg Food.” I’ve been wanting to try it, but I’ve been nervous. It’s literally kibble for humans, and the calories/protein/etc. looked pretty decent if I remember correctly.",
          "created_utc": 1735955871.0
        },
        {
          "id": "m5b0ger",
          "author": "bubblenuts101",
          "body": "Really! I always make the joke about the food they eat when they are unplugged from the matrix, has all the stuff, just be done with it.\nWould you mind sharing the link for the kibble?",
          "created_utc": 1735965090.0
        },
        {
          "id": "m5b9xsj",
          "author": "Witty_Health3146",
          "body": "Not sure if this is the most cost effective way to get it, but this link below is them directly.\n\nhttps://eatdawgfood.com\n\n~$5.60 a meal for beef. ~$5.36 a meal for chicken. There’s an option to buy both bags too for $19 cheaper than buying the two bags separately. I’m so curious now but I can’t justify spending that if I end up hating it. Maybe one day.",
          "created_utc": 1735969362.0
        }
      ]
    },
    {
      "id": "m5cey75",
      "author": "bubblenuts101",
      "body": "Thank you. I'll have a look. I know what you mean, I love it when places sell samples so you can at least try before you commit to something - it also makes me feel like they are more confident in their products.",
      "created_utc": 1735993871.0,
      "score": 2,
      "context": [
        {
          "id": "m57595a",
          "author": "No_Evidence_19",
          "body": "Very much avoidant and restrictive",
          "created_utc": 1735919789.0
        },
        {
          "id": "m579eft",
          "author": "R0da",
          "body": "Yuup.  When food is neutral at best and hostile at worst, what motivation does my body have to want to go back?  I only eat to not die.",
          "created_utc": 1735921075.0
        },
        {
          "id": "m58ct4y",
          "author": "Darthcookie",
          "body": "I keep saying there needs to be human “kibble”, something dry, crunchy, salty and nutritious.",
          "created_utc": 1735932789.0
        },
        {
          "id": "m5acbgk",
          "author": "Witty_Health3146",
          "body": "Omg I say this a lot! One day my friend sent me “Dawg Food.” I’ve been wanting to try it, but I’ve been nervous. It’s literally kibble for humans, and the calories/protein/etc. looked pretty decent if I remember correctly.",
          "created_utc": 1735955871.0
        },
        {
          "id": "m5b0ger",
          "author": "bubblenuts101",
          "body": "Really! I always make the joke about the food they eat when they are unplugged from the matrix, has all the stuff, just be done with it.\nWould you mind sharing the link for the kibble?",
          "created_utc": 1735965090.0
        },
        {
          "id": "m5b9xsj",
          "author": "Witty_Health3146",
          "body": "Not sure if this is the most cost effective way to get it, but this link below is them directly.\n\nhttps://eatdawgfood.com\n\n~$5.60 a meal for beef. ~$5.36 a meal for chicken. There’s an option to buy both bags too for $19 cheaper than buying the two bags separately. I’m so curious now but I can’t justify spending that if I end up hating it. Maybe one day.",
          "created_utc": 1735969362.0
        }
      ]
    },
    {
      "id": "m696p6b",
      "author": "bassoonwoman",
      "body": "I wouldn't say it's easy at all. Exposure therapy is literally fighting your mental health. I think it just is difficult and anxiety inducing at first. That's kinda the whole thing. ARFID is fear and anxiety around eating and you just kinda have to work through it. It took me doing it regularly for years for it to work. Like once a week at first, then a few times a week, etc. It takes time. Everything takes time.",
      "created_utc": 1736443339.0,
      "score": 2,
      "context": [
        {
          "id": "m57eqm3",
          "author": "podgoricanka93",
          "body": "“ARFID Plus” lol I have the premium version of ARFID",
          "created_utc": 1735922695.0
        },
        {
          "id": "m57qcc0",
          "author": "PercentageWide6608",
          "body": "that's what I was thinking Lolll. I didn't sign up for premium how I do I cancel this subscription!!",
          "created_utc": 1735926171.0
        },
        {
          "id": "m57vbbg",
          "author": "TheDyingSailor",
          "body": "If you ever figure this out tell me. This package is too expensive for my lifestyle 🥲",
          "created_utc": 1735927641.0
        },
        {
          "id": "m58vy4e",
          "author": "bassoonwoman",
          "body": "I have OCD and, surprisingly, dealing with that has helped a lot with my ARFID issues",
          "created_utc": 1735938601.0
        },
        {
          "id": "m5d4r36",
          "author": "SomeTraits",
          "body": "I'm sorry, if this isn't too personal would you mind to share some details? Maybe I could learn about something worth looking into.\n\nThanks :-)",
          "created_utc": 1736004612.0
        },
        {
          "id": "m5e96g6",
          "author": "bassoonwoman",
          "body": "No worries! Not too personal at all\n\nI did dialectical behavioral therapy to retrain my brain out of negative thinking that I would automatically go into about things, especially feelings. I also did exposure therapy for OCD and I took those tools and applied it to my food issues. I have avoidant and restrictive ARFID, it still bothers me a little but wayyyy less than it used to.",
          "created_utc": 1736017404.0
        },
        {
          "id": "m68t87q",
          "author": "SomeTraits",
          "body": "Thank you very much! \nWas exposure therapy easier for OCD than for ARFID? I'm asking because I tried that for ARFID with my therapist, but it really didn't work out. Gave me a lot of anxiety.",
          "created_utc": 1736439407.0
        }
      ]
    },
    {
      "id": "m69h90s",
      "author": "SomeTraits",
      "body": "Thank you very much - it means a lot to me. So I'm not failing, it's just that it takes a lot of time. Got it.",
      "created_utc": 1736446380.0,
      "score": 2,
      "context": [
        {
          "id": "m57eqm3",
          "author": "podgoricanka93",
          "body": "“ARFID Plus” lol I have the premium version of ARFID",
          "created_utc": 1735922695.0
        },
        {
          "id": "m57qcc0",
          "author": "PercentageWide6608",
          "body": "that's what I was thinking Lolll. I didn't sign up for premium how I do I cancel this subscription!!",
          "created_utc": 1735926171.0
        },
        {
          "id": "m57vbbg",
          "author": "TheDyingSailor",
          "body": "If you ever figure this out tell me. This package is too expensive for my lifestyle 🥲",
          "created_utc": 1735927641.0
        },
        {
          "id": "m58vy4e",
          "author": "bassoonwoman",
          "body": "I have OCD and, surprisingly, dealing with that has helped a lot with my ARFID issues",
          "created_utc": 1735938601.0
        },
        {
          "id": "m5d4r36",
          "author": "SomeTraits",
          "body": "I'm sorry, if this isn't too personal would you mind to share some details? Maybe I could learn about something worth looking into.\n\nThanks :-)",
          "created_utc": 1736004612.0
        },
        {
          "id": "m5e96g6",
          "author": "bassoonwoman",
          "body": "No worries! Not too personal at all\n\nI did dialectical behavioral therapy to retrain my brain out of negative thinking that I would automatically go into about things, especially feelings. I also did exposure therapy for OCD and I took those tools and applied it to my food issues. I have avoidant and restrictive ARFID, it still bothers me a little but wayyyy less than it used to.",
          "created_utc": 1736017404.0
        },
        {
          "id": "m68t87q",
          "author": "SomeTraits",
          "body": "Thank you very much! \nWas exposure therapy easier for OCD than for ARFID? I'm asking because I tried that for ARFID with my therapist, but it really didn't work out. Gave me a lot of anxiety.",
          "created_utc": 1736439407.0
        },
        {
          "id": "m696p6b",
          "author": "bassoonwoman",
          "body": "I wouldn't say it's easy at all. Exposure therapy is literally fighting your mental health. I think it just is difficult and anxiety inducing at first. That's kinda the whole thing. ARFID is fear and anxiety around eating and you just kinda have to work through it. It took me doing it regularly for years for it to work. Like once a week at first, then a few times a week, etc. It takes time. Everything takes time.",
          "created_utc": 1736443339.0
        }
      ]
    },
    {
      "id": "m69laob",
      "author": "bassoonwoman",
      "body": "You're not failing! I'm glad you reached out, you've got this!",
      "created_utc": 1736447547.0,
      "score": 2,
      "context": [
        {
          "id": "m57eqm3",
          "author": "podgoricanka93",
          "body": "“ARFID Plus” lol I have the premium version of ARFID",
          "created_utc": 1735922695.0
        },
        {
          "id": "m57qcc0",
          "author": "PercentageWide6608",
          "body": "that's what I was thinking Lolll. I didn't sign up for premium how I do I cancel this subscription!!",
          "created_utc": 1735926171.0
        },
        {
          "id": "m57vbbg",
          "author": "TheDyingSailor",
          "body": "If you ever figure this out tell me. This package is too expensive for my lifestyle 🥲",
          "created_utc": 1735927641.0
        },
        {
          "id": "m58vy4e",
          "author": "bassoonwoman",
          "body": "I have OCD and, surprisingly, dealing with that has helped a lot with my ARFID issues",
          "created_utc": 1735938601.0
        },
        {
          "id": "m5d4r36",
          "author": "SomeTraits",
          "body": "I'm sorry, if this isn't too personal would you mind to share some details? Maybe I could learn about something worth looking into.\n\nThanks :-)",
          "created_utc": 1736004612.0
        },
        {
          "id": "m5e96g6",
          "author": "bassoonwoman",
          "body": "No worries! Not too personal at all\n\nI did dialectical behavioral therapy to retrain my brain out of negative thinking that I would automatically go into about things, especially feelings. I also did exposure therapy for OCD and I took those tools and applied it to my food issues. I have avoidant and restrictive ARFID, it still bothers me a little but wayyyy less than it used to.",
          "created_utc": 1736017404.0
        },
        {
          "id": "m68t87q",
          "author": "SomeTraits",
          "body": "Thank you very much! \nWas exposure therapy easier for OCD than for ARFID? I'm asking because I tried that for ARFID with my therapist, but it really didn't work out. Gave me a lot of anxiety.",
          "created_utc": 1736439407.0
        },
        {
          "id": "m696p6b",
          "author": "bassoonwoman",
          "body": "I wouldn't say it's easy at all. Exposure therapy is literally fighting your mental health. I think it just is difficult and anxiety inducing at first. That's kinda the whole thing. ARFID is fear and anxiety around eating and you just kinda have to work through it. It took me doing it regularly for years for it to work. Like once a week at first, then a few times a week, etc. It takes time. Everything takes time.",
          "created_utc": 1736443339.0
        },
        {
          "id": "m69h90s",
          "author": "SomeTraits",
          "body": "Thank you very much - it means a lot to me. So I'm not failing, it's just that it takes a lot of time. Got it.",
          "created_utc": 1736446380.0
        }
      ]
    }
  ]
}