{
  "id": "1hun7q1",
  "subreddit": "ARFID",
  "author": "abcnews_au",
  "created_utc": 1736126805.0,
  "title": "ARFID is almost as common as anorexia, but most people don't know it",
  "selftext": "",
  "url": "https://www.abc.net.au/news/2025-01-06/eating-disorder-arfid-picky-eating/104648840",
  "score": 648,
  "num_comments": 37,
  "comments": [
    {
      "id": "m5mi2d7",
      "author": "abcnews_au",
      "body": "Please let us know how we did on this piece about ARFID.",
      "created_utc": 1736127133.0,
      "score": 203,
      "context": []
    },
    {
      "id": "m5mhst5",
      "author": "abcnews_au",
      "body": "# From the article:\n\n**Warning: This article contains content about eating disorders that may be distressing for some readers.**\n\nAvoidant Restrictive Food Intake Disorder, or ARFID, is an eating disorder almost as common as anorexia nervosa in Australia.\n\nBut it's much less understood.\n\nARFID is a newly recognised eating disorder, which became an official diagnosis for adults and children in 2013.\n\nFor 12-year-old Alex\\*, the diagnosis came as a relief after years bouncing around the medical system.\n\nHis mother Jess said Alex was extremely restrictive about what he would eat from a young age. He measured very low on the growth chart and was often unwell.\n\nhttps://preview.redd.it/vrbq8its0abe1.jpeg?width=862&format=pjpg&auto=webp&s=a8f189d1cb878cb69f941991240a914cf7a386c1\n\n  \n*^(Jess says her son Alex was always a restrictive eater. (ABC News: Patrick Stone))*\n\n\"I got really worried about it when he was about 12 months \\[old\\] and I started talking to the maternal child health nurse and the GP,\" Jess said.\n\nWhen Alex was four years old, he ate just two foods for a whole year — two-minute noodles and peanut butter on toast.\n\n\"Everyone kept reassuring me that it was just a phase, and he would grow out of it. I had to push really hard to get any sort of blood tests done,\" Jess said.\n\nTests showed nutritional deficiencies, and Alex has been on medically required supplements ever since.\n\nAfter a lifetime of struggling with food avoidance, Alex is relieved his condition has a name.\n\n\"It was a rollercoaster of emotions trying to figure out what was happening,\" he said.\n\n\"It's definitely made it a lot easier for everyone to understand.\"\n\n# What exactly is ARFID?\n\nBefore being officially recognised in 2013, ARFID symptoms were included in infant and early childhood feeding disorders.\n\nIt's estimated to affect between 1 and 3 per cent of the population.\n\nProfessor of psychiatry at Harvard Medical School, Jennifer Thomas, is one of the world's leading experts in ARFID.\n\nShe said people with ARFID tended to restrict food for sensory reasons such as texture, smell or taste.\n\n\"Or they're very afraid of something bad happening after they eat … like vomiting or choking, or that they have a low interest in eating,\" she said.\n\nBy contrast, anorexia nervosa and bulimia nervosa usually involve a fixation on weight and body image.\n\n \"It has to be causing pretty severe problems for the individual to rise to the level of ARFID, as opposed to just normative, picky eating,\" Professor Thomas said.\n\nSymptoms can include being underweight, lack of growth and nutrient deficiencies.\n\nThe diagnostic criteria also includes psycho-social impacts, such as if a person can't play, study, work, or spend time away from home — meaning it's not limited to those who are underweight.",
      "created_utc": 1736127043.0,
      "score": 111,
      "context": []
    },
    {
      "id": "m5mpu65",
      "author": "misspokenautumn",
      "body": "I really appreciate that news outlets are talking about it.\n\nAs a child, I tried to figure out what was wrong with me. There was nothing that I could find that matched to my experience. It was very lonely. I truly thought it was just me. Years later, I found that it was finally given a name. Today, I see this. \n\nI'm so glad youth that have this struggle nowadays can actually find information on the condition, and community. Articles that bring awareness and assure us that there's others like us really make a difference.",
      "created_utc": 1736129710.0,
      "score": 113,
      "context": []
    },
    {
      "id": "m5mvqnd",
      "author": "angelneliel",
      "body": "For years I thought I had anorexia but without the weight fixation/body image issues. I didn't relate to what I read online. For years I was Googling the wrong thing. \n\nGlad it's being talked about more! It needs to become more well known. Not all eating disorders revolve around weight fixations and body image. Wish I had known about this when I was much younger.",
      "created_utc": 1736131675.0,
      "score": 72,
      "context": []
    },
    {
      "id": "m5mxpwc",
      "author": "Neocactus",
      "body": "I've been saying this for a while.\n\nI didn't know ARFID was a thing until I was like 20 years old because Reddit algorithm recommended this sub to me. I just thought I was an alien.\n\nNow when I talk about ARFID with other people, like half the time their mind is blown and they're like \"Oh shit, I think I or my brother/girlfriend/friend/etc. deals with this!\"\n\nIt's just dismissed as picky eating, and picky eating--especially in adults--is very much a taboo… for some fuckin reason.",
      "created_utc": 1736132358.0,
      "score": 55,
      "context": []
    },
    {
      "id": "m5mwjau",
      "author": "purple_bin",
      "body": "thank you for spreading awareness!! this was well done :D",
      "created_utc": 1736131947.0,
      "score": 18,
      "context": []
    },
    {
      "id": "m5nmths",
      "author": "idekkbruhh",
      "body": "No way… I always thought we were rare 😭",
      "created_utc": 1736142220.0,
      "score": 17,
      "context": []
    },
    {
      "id": "m5nq0ru",
      "author": "ChaoticMornings",
      "body": "Remember a couple of years ago I tried to sign up for a clinic that treats people with an eating disorder.\nI told them I had problems around food, but not anorexia/boulimia related.\n\nI had never heard about ARFID before, and I guess neither had they.\n\nI first heard about it when a politician mentioned it existed and that it should be widely known.",
      "created_utc": 1736143880.0,
      "score": 13,
      "context": []
    },
    {
      "id": "m5no6if",
      "author": "FourMillionBees",
      "body": "Thanks for covering this ABC! I was pleasantly surprised when i opened ABC news this morning and saw this article :)\n\nReally nice to see this being talked about in the public sphere and raising awareness about this condition!",
      "created_utc": 1736142913.0,
      "score": 11,
      "context": []
    },
    {
      "id": "m5o8fik",
      "author": "Fit-Cauliflower-9229",
      "body": "And the medical files absolutely don’t know how to manage it. I had to do everything myself 😞",
      "created_utc": 1736155201.0,
      "score": 7,
      "context": []
    },
    {
      "id": "m5odx5b",
      "author": "MSchumacher47",
      "body": "Was very pleasantly surprised by this article and also to hear it featured in news bulletins throughout the day (certainly on the radio at least). It did a really nice job of portraying ARFID in an manner that was non-judgemental and compassionate and I think introduced it quite well for those that are unaware of the condition.\n\nI think there's definitely an opportunity to expand on this- while children with ARFID are starting to achieve some form of recognition from medical professionals and educators (and this is a truly amazing and wonderful thing), it's been a different experience for those of us in adulthood who have grown up knowing we have a genuine condition but never being able to explain what it is (and so often being dismissed as just a 'picky eater').\n\nIf there are ever any plans for the ABC to do a follow up or expansion on this I would be more than willing to help contribute (as someone with ARFID who has had the condition since I was a toddler (now 30), and who lives and has grown up in regional Australia, where support systems are if anything even harder to come across with few, if any, specialists easily accessible).",
      "created_utc": 1736158782.0,
      "score": 5,
      "context": []
    },
    {
      "id": "m5opxhr",
      "author": "1carus_x",
      "body": "I think it's really great overall, but one paragraph mentions that parents can't cause it which ig is generally true, but I think how they can make it worse by traumatizing the child",
      "created_utc": 1736165734.0,
      "score": 5,
      "context": []
    },
    {
      "id": "m5ob03z",
      "author": "m24b77",
      "body": "A really great article, I’m pleasantly surprised.",
      "created_utc": 1736156891.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m5r9ccw",
      "author": "ITriedSoHard419-68",
      "body": "When I was in residential treatment, nearly a third of the total patient population had ARFID. Which was a real problem because we only had one ARFID specialist. \n\nThe only thing about ARFID that isn’t common is acknowledgement. Thank you for helping with that.",
      "created_utc": 1736196114.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m5sgzee",
      "author": "Domestic_Fox",
      "body": "I am 40. I have adhd and am autistic. You wouldn’t know unless you knew me and I told you I guess. I’m just “quirky”. I also have arfid which sucks. Also I’ve had binge eating disorder which was taken care of as well as it could be with vyvanse. So two eating disorders and two neurodiversities. It’s changed over the years from picky eating for most of it, to complete lack of interest in eating and down right hating cooking and food. \n\nI know why, I’m a mom of two (with varying degrees of the same diagnoses as me) and cooking is slowly killing me. I was actually sitting  in my kitchen minutes ago googling “cooking for my family is killing me” “arfid adult getting worse with motherhood” etc etc. \n\nI cook 3 dinners a night and don’t eat any of them. By the time i would be able to eat I am so disgusted or exhausted by food I just don’t eat. Being a mother and feeling a biological need to feed my kids but also having no support system, two eating disorders and being physically incapable of being “good” at all that is necessary to feed people, planning, buying, cooking etc…\n\nI am suffocating. But I don’t get a day off even if we eat out for dinner because I’m still cooking something everyday. I can cook and I don’t think I’m horrible at it, but it is fighting my brain and my body every single day and if I didn’t say it enough times…it is killing me.\n\n\nI rambled and don’t have a point aside to say, if you know a mom like me please help her. Because some days it’s not as hard, but on a night like tonight. I feel like I’m going to have a heart attack thinking about all the food I’m going to cook, then go to bed hungry. \n\nMore research needs to be done on people like me. Late diagnosed, doing her absolute fucking best, but crumbling under the pressure of having these issues, and feeding her children who also have these issues. \n\nAlso yes I’ve done therapy, but the biggest thing someone like me needs is someone to love them enough to be their hype man. I don’t have any family and very few friends who have their own lives and things going on. But feed them, don’t ask them what they want, they don’t know. Go shopping with them, make it silly. Play with their kids while they cook. Cook with them. Cook for them. \n\nI don’t know sorry. It’s a rough time and while I know why I am this way, it doesn’t change the fact that the sun will rise and I will need to feed people.",
      "created_utc": 1736209594.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m5r7ath",
      "author": "Nic406",
      "body": "Thanks for making this more well known!",
      "created_utc": 1736195530.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m5rlagb",
      "author": "ghastlypxl",
      "body": "I’m definitely grateful the news is picking up on this and we can get the name out there. I’ve been struggling with my symptoms more and more with stress and the solution people give me, “Just eat,” feels awful when I’d LOVE to.\n\nI’ve cried in front of a plate of food I used to be able to stomach when I’ve felt particularly bad. I’ve internally berated myself for not being able to just do it but I’ll become physically sick. More understanding about the condition would go a long way to increase visibility and accessibility of necessary supports, so thank you.",
      "created_utc": 1736199531.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m5otdd0",
      "author": "lappydappydoda",
      "body": "Epic - thank you.",
      "created_utc": 1736167422.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5rzhxf",
      "author": "nietbeschikbaar",
      "body": "Pretty sure that most of us are adults and our ARFID isn’t that bad that we ever got hospitalized. These articles are always about kids and extreme cases.",
      "created_utc": 1736203854.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5s6ord",
      "author": "Far-Application-858",
      "body": "I wish I could send this to my mom and be like “See?? I’m not being picky! I’m not fucking crazy!”",
      "created_utc": 1736206182.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5uc4uh",
      "author": "Gaymer7437",
      "body": "Amazing article \n\n\n\n\n I'm sending it to my boyfriend because he cannot conceptualize my relationship with food at all. He's trying to understand but he loves food and is passionate about eating and enjoys eating, and I'm none of those things because of my eating disorder. I'm also sending this to people who do understand it so that they can send it to people who don't understand it that they talk to. I've never been formally diagnosed and I've never got good treatment but I've managed to make my ARFID mild now as an adult (compared to when I was a child) because my mom had the good sense to operate under the \"fed is best\" School of thought like mentioned in the article with the Tim tams, and that actually gave me a healthy relationship with food despite my sensory sensitivities.",
      "created_utc": 1736237519.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5mrth9",
      "author": "tibblendribblen7",
      "body": "I cant speak for everyone but I think the article was great. Thank you",
      "created_utc": 1736130345.0,
      "score": 104,
      "context": [
        {
          "id": "m5mi2d7",
          "author": "abcnews_au",
          "body": "Please let us know how we did on this piece about ARFID.",
          "created_utc": 1736127133.0
        }
      ]
    },
    {
      "id": "m5noob9",
      "author": "lizardgal10",
      "body": "Really nicely done piece, the overall tone was very professional and respectful. Not always the case with topics like this. I would’ve liked to see more about how it can impact adults and what sets it apart from typical picky eating, as I think that’s where a lot of the lack of understanding lies. Maybe something to cover in a future article?",
      "created_utc": 1736143170.0,
      "score": 71,
      "context": [
        {
          "id": "m5mi2d7",
          "author": "abcnews_au",
          "body": "Please let us know how we did on this piece about ARFID.",
          "created_utc": 1736127133.0
        }
      ]
    },
    {
      "id": "m5n3bts",
      "author": "pkmn-sinnoh",
      "body": "Thank you for writing the article. I think you’ve captured what many struggles people face when dealing with ARFID. It’s really great to see an article that encourages awareness.",
      "created_utc": 1736134272.0,
      "score": 32,
      "context": [
        {
          "id": "m5mi2d7",
          "author": "abcnews_au",
          "body": "Please let us know how we did on this piece about ARFID.",
          "created_utc": 1736127133.0
        }
      ]
    },
    {
      "id": "m5od7yn",
      "author": "Athyrical",
      "body": "Really empathetic and a good representation of the struggle both parents and children go through with ARFID. I appreciated how you gave the child space to say how forcefeeding and denying him food traumatized him. That's people's go-to approach for regular picky eating, so it's so important to show how counterproductive it is when treating ARFID.\n\nWell done! Thank you for this.",
      "created_utc": 1736158330.0,
      "score": 12,
      "context": [
        {
          "id": "m5mi2d7",
          "author": "abcnews_au",
          "body": "Please let us know how we did on this piece about ARFID.",
          "created_utc": 1736127133.0
        }
      ]
    },
    {
      "id": "m5rxkhw",
      "author": "luteyla",
      "body": "I have a theory that Michael Jackson had arfid. Read all the things his mother said and his friends said. All same thing that arfid parents say. I started a thread but didn't get much attention. Please help parents know about it and this theory can get it more viral. My post: [https://www.reddit.com/r/ARFID/comments/1bjh0dm/did\\_michael\\_jackson\\_had\\_arfid/](https://www.reddit.com/r/ARFID/comments/1bjh0dm/did_michael_jackson_had_arfid/)\n\nI can't forget that almost 5 year old kid, holding mother's hand, going from school back to home. Very very skinny, weak. Mother asks, 'there were fries right, why didn't you eat'. and the child looks away, silent. I felt so sorry for both the kid and the mother.",
      "created_utc": 1736203247.0,
      "score": 5,
      "context": [
        {
          "id": "m5mi2d7",
          "author": "abcnews_au",
          "body": "Please let us know how we did on this piece about ARFID.",
          "created_utc": 1736127133.0
        }
      ]
    },
    {
      "id": "m5vbbd2",
      "author": "SprintsAC",
      "body": "It's been wrote in such an amazing way.\n\n\nIf you're ever looking for more stories around how medical systems treat ARFID sufferers, I'd be glad to share mine with you!",
      "created_utc": 1736257196.0,
      "score": 1,
      "context": [
        {
          "id": "m5mi2d7",
          "author": "abcnews_au",
          "body": "Please let us know how we did on this piece about ARFID.",
          "created_utc": 1736127133.0
        }
      ]
    },
    {
      "id": "m5zie01",
      "author": "writicks",
      "body": "as someone who works in journalism (audience engagement!) and who has arfid, thank you for this comment 💙",
      "created_utc": 1736304138.0,
      "score": 1,
      "context": [
        {
          "id": "m5mi2d7",
          "author": "abcnews_au",
          "body": "Please let us know how we did on this piece about ARFID.",
          "created_utc": 1736127133.0
        }
      ]
    },
    {
      "id": "m68e65j",
      "author": "sophie-au",
      "body": "Thank you for shining a light on ARFID.\n\nI have a few friends with EDs and even they were not aware of ARFID.\n\nI just wish I had known about it years ago. It could have saved us a lot of stress.\n\nI’m pursuing a diagnosis for my son, who I think developed fear type ARFID because of his food allergies and fear developed from accidental exposure.(And it’s not even life threatening FAs.)\n\nI knew his behaviour wasn’t normal, and it was affecting his growth and development, but I didn’t know how to articulate it or what to do other than “keeping trying.”\n\nIt was only by chance around 2019, when I was on a Qantas flight that I found out about it. I was browsing the documentary section and came upon one from NZ, “The Truth About Fussy Eaters.” \n\nI watched Jake Thompson’s story with ARFID and saw many parallels. It scared the crap out of me, but at least we had an explanation and a name.\n\nWhen it finished, I made my husband stop what he was doing and watch it too.\n\nWhen we returned to Sydney, we asked our GP for advice. She and her colleagues weren’t sure how to proceed. But we received a referral for a paediatric dietitian operating out of the same practice as his immunologist. \n\nShe saw him once in early Jan 2020… and then COVID hit and everything “non essential” went into lockdown. There was no Telehealth available to us at that time to continue.\n\nShortly afterwards, my mum died of cancer when my sister and I weren’t able to be there for her.\n\nWe moved back home to Perth a while later, and other more pressing health and financial issues took place. \n\nSo he’s finally having an assessment next week!🤞 \n\nI hope more people are able to get help earlier as a result.",
      "created_utc": 1736434780.0,
      "score": 1,
      "context": [
        {
          "id": "m5mi2d7",
          "author": "abcnews_au",
          "body": "Please let us know how we did on this piece about ARFID.",
          "created_utc": 1736127133.0
        }
      ]
    },
    {
      "id": "m5n37tr",
      "author": "iamacraftyhooker",
      "body": "Another one not associated with weight fixation/body image is psychogenic loss of appetite. Where psychological factors like anxiety, and stress can cause issues with eating.\n\nIt's in the ICD 10, but not yet in the DSM so it's not really recognized in North America and a few other countries.",
      "created_utc": 1736134232.0,
      "score": 26,
      "context": [
        {
          "id": "m5mvqnd",
          "author": "angelneliel",
          "body": "For years I thought I had anorexia but without the weight fixation/body image issues. I didn't relate to what I read online. For years I was Googling the wrong thing. \n\nGlad it's being talked about more! It needs to become more well known. Not all eating disorders revolve around weight fixations and body image. Wish I had known about this when I was much younger.",
          "created_utc": 1736131675.0
        }
      ]
    },
    {
      "id": "m5ucs84",
      "author": "Gaymer7437",
      "body": "I was constantly underweight and my doctor ended up sending me to an eating disorder clinic where they sent me home because I clearly didn't have anorexia, orthorexia or bulimia and that was all they recognized / treated. \n\n\nReading the notes from that clinic as an adult and when they had me \"walk [them] through a day of food\" I responded that I ate Mac and cheese 5-8 times a day: breakfast, lunch, dinner, and snacking as much as I was allowed in between mealtimes. they wrote about how I did not like my weight because I knew I was underweight and I wanted to gain weight that I just didn't know how. I talked about getting stomach aches after big meals and being afraid of throwing up after eating too much.",
      "created_utc": 1736237933.0,
      "score": 1,
      "context": [
        {
          "id": "m5mvqnd",
          "author": "angelneliel",
          "body": "For years I thought I had anorexia but without the weight fixation/body image issues. I didn't relate to what I read online. For years I was Googling the wrong thing. \n\nGlad it's being talked about more! It needs to become more well known. Not all eating disorders revolve around weight fixations and body image. Wish I had known about this when I was much younger.",
          "created_utc": 1736131675.0
        }
      ]
    },
    {
      "id": "m5rlvlx",
      "author": "ghastlypxl",
      "body": "I had this experience, too! Someone at work was, “Holy crap my cousin (or aunt, I can’t remember) might have this!” And was talking about the years they’d spent in and out of hospitals, being given IBS medications, trying oodles of things when they’re all ineffective. It’s such a relief to put a proper name to something we’ve experienced.",
      "created_utc": 1736199701.0,
      "score": 5,
      "context": [
        {
          "id": "m5mxpwc",
          "author": "Neocactus",
          "body": "I've been saying this for a while.\n\nI didn't know ARFID was a thing until I was like 20 years old because Reddit algorithm recommended this sub to me. I just thought I was an alien.\n\nNow when I talk about ARFID with other people, like half the time their mind is blown and they're like \"Oh shit, I think I or my brother/girlfriend/friend/etc. deals with this!\"\n\nIt's just dismissed as picky eating, and picky eating--especially in adults--is very much a taboo… for some fuckin reason.",
          "created_utc": 1736132358.0
        }
      ]
    },
    {
      "id": "m6hu1l5",
      "author": "None",
      "body": "My daughter is 21 and has ARFID. We have taken her to Melrose Center in MN to get an evaluation. They emotionally traumatized her so much that it has really set her back. They treated her as if she had Anorexia, which is nothing like ARFID. We are trying to find her a program that has ideas that help specifically with ARFID. ",
      "created_utc": 1736554162.0,
      "score": 1,
      "context": [
        {
          "id": "m5mi2d7",
          "author": "abcnews_au",
          "body": "Please let us know how we did on this piece about ARFID.",
          "created_utc": 1736127133.0
        },
        {
          "id": "m5vbbd2",
          "author": "SprintsAC",
          "body": "It's been wrote in such an amazing way.\n\n\nIf you're ever looking for more stories around how medical systems treat ARFID sufferers, I'd be glad to share mine with you!",
          "created_utc": 1736257196.0
        }
      ]
    },
    {
      "id": "m5qr7hs",
      "author": "meitanteis",
      "body": "do you happen to know what the difference would be between arfid (restrictive subtype would be most similar, i think) and psychogenic loss of appetite?",
      "created_utc": 1736190871.0,
      "score": 6,
      "context": [
        {
          "id": "m5mvqnd",
          "author": "angelneliel",
          "body": "For years I thought I had anorexia but without the weight fixation/body image issues. I didn't relate to what I read online. For years I was Googling the wrong thing. \n\nGlad it's being talked about more! It needs to become more well known. Not all eating disorders revolve around weight fixations and body image. Wish I had known about this when I was much younger.",
          "created_utc": 1736131675.0
        },
        {
          "id": "m5n37tr",
          "author": "iamacraftyhooker",
          "body": "Another one not associated with weight fixation/body image is psychogenic loss of appetite. Where psychological factors like anxiety, and stress can cause issues with eating.\n\nIt's in the ICD 10, but not yet in the DSM so it's not really recognized in North America and a few other countries.",
          "created_utc": 1736134232.0
        }
      ]
    },
    {
      "id": "m6i3mqp",
      "author": "SprintsAC",
      "body": "I'm sorry, it sounds rough.\n\n\nI'd try asking on here if you haven't already.",
      "created_utc": 1736557413.0,
      "score": 1,
      "context": [
        {
          "id": "m5mi2d7",
          "author": "abcnews_au",
          "body": "Please let us know how we did on this piece about ARFID.",
          "created_utc": 1736127133.0
        },
        {
          "id": "m5vbbd2",
          "author": "SprintsAC",
          "body": "It's been wrote in such an amazing way.\n\n\nIf you're ever looking for more stories around how medical systems treat ARFID sufferers, I'd be glad to share mine with you!",
          "created_utc": 1736257196.0
        },
        {
          "id": "m6hu1l5",
          "author": "None",
          "body": "My daughter is 21 and has ARFID. We have taken her to Melrose Center in MN to get an evaluation. They emotionally traumatized her so much that it has really set her back. They treated her as if she had Anorexia, which is nothing like ARFID. We are trying to find her a program that has ideas that help specifically with ARFID. ",
          "created_utc": 1736554162.0
        }
      ]
    },
    {
      "id": "m5qzulc",
      "author": "iamacraftyhooker",
      "body": "There doesn't seem to be specific diagnostic criteria avaliable for psychogenic loss of appetite, so it's hard to say for certain.\n\nThis is what I can find for restrictive ARFID.  \n>Individuals who experience restrictive ARFID may show signs of little-to-no interest in food. This type can make one forget to eat altogether, show signs of a low appetite or get extremely distracted during mealtime. Another symptom of restrictive ARFID includes extreme pickiness of foods, resulting in limited intake.\n\nI would guess that consistency would be the major factor. Psychogenic loss of appetite is consistent for all foods during certain emotional states, and is non existent during other states. Food/eating also isn't the cause of the stress, but is secondary to it.\n\nWith ARFID the pickiness and low appetite will be consistent. Forgetting, and distraction would be situational based instead of emotionally based.\n\nI get periods related to stress where I can't eat anything. When I try to eat food that I typically like I get nauseated and struggle to swallow it. When my mental health is doing well I still often tend to have a low appetite, but don't dislike many foods.\n\nMy kid deals with both. There are periods of stress where she struggles to eat her safe foods, but during good times she has a fairly limited diet. It's partly a texture thing, but she also has issues with presentation and trying new foods. The foods cause the stress of eating.",
      "created_utc": 1736193367.0,
      "score": 2,
      "context": [
        {
          "id": "m5mvqnd",
          "author": "angelneliel",
          "body": "For years I thought I had anorexia but without the weight fixation/body image issues. I didn't relate to what I read online. For years I was Googling the wrong thing. \n\nGlad it's being talked about more! It needs to become more well known. Not all eating disorders revolve around weight fixations and body image. Wish I had known about this when I was much younger.",
          "created_utc": 1736131675.0
        },
        {
          "id": "m5n37tr",
          "author": "iamacraftyhooker",
          "body": "Another one not associated with weight fixation/body image is psychogenic loss of appetite. Where psychological factors like anxiety, and stress can cause issues with eating.\n\nIt's in the ICD 10, but not yet in the DSM so it's not really recognized in North America and a few other countries.",
          "created_utc": 1736134232.0
        },
        {
          "id": "m5qr7hs",
          "author": "meitanteis",
          "body": "do you happen to know what the difference would be between arfid (restrictive subtype would be most similar, i think) and psychogenic loss of appetite?",
          "created_utc": 1736190871.0
        }
      ]
    },
    {
      "id": "m5r04yb",
      "author": "meitanteis",
      "body": "thanks for the insight!",
      "created_utc": 1736193450.0,
      "score": 2,
      "context": [
        {
          "id": "m5mvqnd",
          "author": "angelneliel",
          "body": "For years I thought I had anorexia but without the weight fixation/body image issues. I didn't relate to what I read online. For years I was Googling the wrong thing. \n\nGlad it's being talked about more! It needs to become more well known. Not all eating disorders revolve around weight fixations and body image. Wish I had known about this when I was much younger.",
          "created_utc": 1736131675.0
        },
        {
          "id": "m5n37tr",
          "author": "iamacraftyhooker",
          "body": "Another one not associated with weight fixation/body image is psychogenic loss of appetite. Where psychological factors like anxiety, and stress can cause issues with eating.\n\nIt's in the ICD 10, but not yet in the DSM so it's not really recognized in North America and a few other countries.",
          "created_utc": 1736134232.0
        },
        {
          "id": "m5qr7hs",
          "author": "meitanteis",
          "body": "do you happen to know what the difference would be between arfid (restrictive subtype would be most similar, i think) and psychogenic loss of appetite?",
          "created_utc": 1736190871.0
        },
        {
          "id": "m5qzulc",
          "author": "iamacraftyhooker",
          "body": "There doesn't seem to be specific diagnostic criteria avaliable for psychogenic loss of appetite, so it's hard to say for certain.\n\nThis is what I can find for restrictive ARFID.  \n>Individuals who experience restrictive ARFID may show signs of little-to-no interest in food. This type can make one forget to eat altogether, show signs of a low appetite or get extremely distracted during mealtime. Another symptom of restrictive ARFID includes extreme pickiness of foods, resulting in limited intake.\n\nI would guess that consistency would be the major factor. Psychogenic loss of appetite is consistent for all foods during certain emotional states, and is non existent during other states. Food/eating also isn't the cause of the stress, but is secondary to it.\n\nWith ARFID the pickiness and low appetite will be consistent. Forgetting, and distraction would be situational based instead of emotionally based.\n\nI get periods related to stress where I can't eat anything. When I try to eat food that I typically like I get nauseated and struggle to swallow it. When my mental health is doing well I still often tend to have a low appetite, but don't dislike many foods.\n\nMy kid deals with both. There are periods of stress where she struggles to eat her safe foods, but during good times she has a fairly limited diet. It's partly a texture thing, but she also has issues with presentation and trying new foods. The foods cause the stress of eating.",
          "created_utc": 1736193367.0
        }
      ]
    }
  ]
}