{
  "id": "1hvcpni",
  "subreddit": "ARFID",
  "author": "bl0bbyfish",
  "created_utc": 1736204745.0,
  "title": "Annie’s Mac and cheese :(",
  "selftext": "Annie’s Mac and cheese has been a staple of my diet for YEARS. Recently they changed their recipe and it’s “now cheesier”. I was willing to give it a shot but OH MY GOSH!! This new Mac and cheese is awful. I could SMELL a difference when making it. And the taste was terrible because it was so bland. It seems like they didn’t even try to make it taste similar. I was so upset that I left a review on their website, as many people did once they changed their recipe. What’s upsetting me even more now is that it seems like they’ve partnered with influenster so that people are leaving incentivized reviews in order to boost their ratings online instead of making their loyal customers happy again. Sorry for the rant, I’m just frustrated…",
  "url": "https://www.reddit.com/gallery/1hvcpni",
  "score": 264,
  "num_comments": 79,
  "comments": [
    {
      "id": "m5s6fek",
      "author": "throwaway_185051108",
      "body": "I hate when companies change recipes. I’m sorry, was there a whole lobby of people demanding that Annie’s be cheesier?? I’ve never heard that complaint in my life!! Anyone I know who wants it to be cheesier just adds some grated parmesan on top if they feel like it. \n\nWhenever I see a company change recipes for seemingly no reason, I just suspect they’re cutting costs somewhere. In this economy, no company is improving their product just for the sake of it. In this economy, no company would ever INCREASE costs to make their product taste better unless they’re planning a reason for an even bigger price jump. There’s always money involved. \n\nI’m sorry you lost your safe food, OP. Annie’s is a big one for me too and this is so disappointing to see :(",
      "created_utc": 1736206097.0,
      "score": 199,
      "context": []
    },
    {
      "id": "m5sizks",
      "author": "Amazing_Duck_8298",
      "body": "The Trader Joe's white cheddar shells are made by Annie's. The recipe is slightly different, but they taste much more similar to the original than the new version. They are a bit runnier and waterier, and the cheese taste isn't as rich. Making them with more butter and less milk than the box says helps.",
      "created_utc": 1736210258.0,
      "score": 59,
      "context": []
    },
    {
      "id": "m5s3lno",
      "author": "Tallem00",
      "body": "I feel the exact same way about one of my safe foods but it doesn't look like anybody else agrees with me 🙃🙃\n\n>!(It's the frozen Walmart brand nuggets. I already bought a giant expensive bag)!<",
      "created_utc": 1736205171.0,
      "score": 48,
      "context": []
    },
    {
      "id": "m5s3rjl",
      "author": "rigbees",
      "body": "noooo this was my first ever safe food!!! i haven’t tried the new one yet 😭😭😭",
      "created_utc": 1736205224.0,
      "score": 39,
      "context": []
    },
    {
      "id": "m5shlu9",
      "author": "halcyonfire",
      "body": "I can understand how frustrating this is! I remember how confused I was when I got a container of my favorite salsa that had a new & “improved” recipe and it was so much worse that I couldn’t finish it. Blech! I hate it when they change a proven formula. \n\nI know this doesn’t solve the issue with Annie’s, but have you ever tried making your own mac and cheese before? It’s actually super easy and sooo much better than anything you can buy in a box. The great thing is that you can use just about any cheese or noodles and tailor it to what you already like. \n\nHere’s my recipe:\n\n\n-1 tablespoon butter, melted on low in pan used for noodles \n\n-1 tablespoon flour, mixed into melted butter until paste like\n\n-1/2 cup milk, add slowly and mix into roux (flour/butter mixture), make sure to stir regularly and keep from sticking to pan\n\n-1 cup cheese, whatever kind you like (I use regular cheddar but white cheddar is great too), added to béchamel sauce (butter, flour, milk mixture) until melted. Add noodles & salt and enjoy! \n\nThis is enough for about 8 oz of pasta, so you can tweak the ratios as needed. Just a warning, though, once you try home made it’s hard to go back. \n\nI hope you find something that can replace Annie’s for you, I know how hard it can be to feel like a safe food has been taken away!",
      "created_utc": 1736209799.0,
      "score": 18,
      "context": []
    },
    {
      "id": "m5s7lc3",
      "author": "Spottedpetal",
      "body": "The same thing happened to me!! I hatee this new one it tastes like burnt butter but I used to love this",
      "created_utc": 1736206483.0,
      "score": 13,
      "context": []
    },
    {
      "id": "m5sejlc",
      "author": "alchem0",
      "body": "i’m sorry😭 i still have beef with kraft lmao",
      "created_utc": 1736208790.0,
      "score": 11,
      "context": []
    },
    {
      "id": "m5s7e6k",
      "author": "Lylli-Rose",
      "body": "Did the bunny shape change?",
      "created_utc": 1736206419.0,
      "score": 10,
      "context": []
    },
    {
      "id": "m5sul0j",
      "author": "lilburblue",
      "body": "God they’re awful now. The mouth feel is significantly more slimy and the flavor is more like a bland milky roux than cheese. \n\nWhen these changed my partner called me from the store knowing I’d be so disappointed. Slowly they’ve changed the box Mac n Cheeses and they’ve all gotten really gross.",
      "created_utc": 1736214102.0,
      "score": 10,
      "context": []
    },
    {
      "id": "m5sg4z7",
      "author": "iamtheultimateshoe",
      "body": "i remember when that happened to my bagel bites. “new and improved tomato sauce” my ass",
      "created_utc": 1736209315.0,
      "score": 9,
      "context": []
    },
    {
      "id": "m5sgomb",
      "author": "Nic406",
      "body": "Omg I’ve just recently remembered how much I loved eating these as a kid and now it’s back in my pantry as a staple. Currently surviving on just this and spaghetti with tomato sauce\n\nGood thing I don’t remember the old recipe at all",
      "created_utc": 1736209494.0,
      "score": 8,
      "context": []
    },
    {
      "id": "m5t70qd",
      "author": "Consistent-Baker4522",
      "body": "I hate the new Annie’s",
      "created_utc": 1736218379.0,
      "score": 8,
      "context": []
    },
    {
      "id": "m5s707x",
      "author": "Idkhow_dude",
      "body": "Has this change been made to the variety packs as well? I bought some from Costco last week and it looked and tasted the same.",
      "created_utc": 1736206289.0,
      "score": 7,
      "context": []
    },
    {
      "id": "m5siw16",
      "author": "Euphemia-Alder",
      "body": "I’m glad it’s not just me! Everyone raves about how good Annie’s is but it doesn’t taste like how I remember it from childhood",
      "created_utc": 1736210226.0,
      "score": 8,
      "context": []
    },
    {
      "id": "m5s9pgm",
      "author": "bubble-buddy2",
      "body": "I know!!!!! I'm so sad too!!!",
      "created_utc": 1736207185.0,
      "score": 5,
      "context": []
    },
    {
      "id": "m5snwit",
      "author": "None",
      "body": "I was wondering why all of a sudden I started to get crazy painful indigestion from Annie’s! 😭",
      "created_utc": 1736211885.0,
      "score": 6,
      "context": []
    },
    {
      "id": "m5szjs7",
      "author": "VegetableComplex5213",
      "body": "I lost it as a safe food because it takes like straight up soap now",
      "created_utc": 1736215786.0,
      "score": 5,
      "context": []
    },
    {
      "id": "m5saen8",
      "author": "barcode_bf",
      "body": "OH NO. this is terrible to hear. also one of my (very few) safe foods but I haven't had it in the house in a long time. I guess maybe ill try it because I COULD like it. ugh. why do companies do this",
      "created_utc": 1736207419.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m5tg9yb",
      "author": "midnightfoliage",
      "body": "exact same experience. im glad more people are contacting them about it bc im actually devastated.",
      "created_utc": 1736221638.0,
      "score": 4,
      "context": []
    },
    {
      "id": "m5tkt4u",
      "author": "Speakerluv",
      "body": "Same exact thing happened to me. This was one of my safe foods. We have two boxes sitting in the cabinet because I don’t even want to taste it again",
      "created_utc": 1736223408.0,
      "score": 4,
      "context": []
    },
    {
      "id": "m5yj68m",
      "author": "jojubrius",
      "body": "so good to know!! the purple box annie’s has been a staple safe food for me since i was a kid. i am now in my 30s and every time i buy it i can’t finish more than a few bites and have to make my partner eat the whole thing for me 😭 \ni had of course assumed i am the problem and randomly my brain decided it tasted different than i remember 😅",
      "created_utc": 1736292330.0,
      "score": 5,
      "context": []
    },
    {
      "id": "m5tbu1l",
      "author": "imhereforthemeta",
      "body": "I am really reliant on the vegan Mac for lunch and sadly it’s extremely rare to find in stores. I’m so sorry a safe food is ruined for you",
      "created_utc": 1736220057.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m5thpt1",
      "author": "makinggrace",
      "body": "Oh no!!",
      "created_utc": 1736222186.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m5tx5c2",
      "author": "lavenderbleudilly",
      "body": "No!! I took a break after eating it too often and they changed it!?!?",
      "created_utc": 1736228933.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m5us99j",
      "author": "abigailthefail",
      "body": "i haven’t ever tried this one, but my all time favorite white cheddar mac and cheese is the panera stuff that you can get at the grocery store (it tastes way different than what you get at an actual panera restaurant) it’s sooo good",
      "created_utc": 1736248019.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m5wvzu1",
      "author": "neverbloomagain",
      "body": "im worried about the reviews that you've noticed!! ive been left a few on websites (target, annie's) and even DMed annie's through twitter lol. the case for months was that when you sorted the reviews by recent on the two \"cheesier\" flavors, they were literally all 1 star! i really hope they're not trying to bury that. \n\nif what you're saying about them trying to offset it is true, i guess the plus side is that they noticed we all hate the new versions. i'm SO hoping that sales reflect that and that they'll have no choice but to change it back. i know if they do, i'll be buying like 15 boxes immediately haha.",
      "created_utc": 1736274913.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m61y4f6",
      "author": "Clean-Chipmunk2934",
      "body": "NO Way ITS MY #1 SAFE DINNER R U KIDDING",
      "created_utc": 1736346915.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m6h6uq9",
      "author": "Specific_Future_776",
      "body": "i get called insane ( mostly joking don’t worry) when i say i can smell when things aren’t good or have chnaged recipe. for instance i can smell when bread is a couple days away from going bad and i also smelt the difference between the old cherry coke recipe and the new one it’s just like my nose knows lol",
      "created_utc": 1736546524.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m5tm9m6",
      "author": "wrathfulradish",
      "body": "I haven't been able to enjoy mac and cheese since Annie's cut their whole wheat line :(",
      "created_utc": 1736224008.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m5tvuph",
      "author": "doofykidforthewin",
      "body": "Oh no. This is one of my kid's only safe foods.",
      "created_utc": 1736228300.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m5utsbz",
      "author": "Calicojerk",
      "body": "Amy’s changed their tofu scramble BOX and it took me a month to finally pop it in the microwave. It was annoying enough when they changed the slice of tomato to a puree that was hard to toss out from the rest of the food.",
      "created_utc": 1736248923.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m5wcdun",
      "author": "xanaxQc",
      "body": "Ugh, I def hear you. I've lost *soooo* many of my safe foods bc the company did something to the recipe. 😭 If it ain't broke, don't fix it!! ",
      "created_utc": 1736269215.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m5wxnwi",
      "author": "XxBeefCorexX",
      "body": "This hurt me too. I loved Annie’s since I was a child.",
      "created_utc": 1736275391.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m6377xf",
      "author": "Resident_Ad4935",
      "body": "Oh hell nah 😭 I’m gonna stick w my other safe foods now",
      "created_utc": 1736360674.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m6dxxn8",
      "author": "joshb44231",
      "body": "Annie’s was a safe food of mine for years too. I noticed around 2014-2015 it started tasting bad, when General Mills bought the company.",
      "created_utc": 1736508720.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m7ffkhn",
      "author": "Choice_Oil6506",
      "body": "Wow, I feel so seen. Annie’s Mac and cheese has been my number one food since I was 3 years old. It’s so disgusting now and have yet to find a decent replacement.",
      "created_utc": 1737022369.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m5thexr",
      "author": "AncientRow7140",
      "body": "They’re all “slightly tweaking things” , I had to just start making things at home with up to par ingredients:(",
      "created_utc": 1736222070.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m5tw260",
      "author": "corn_breath",
      "body": "As mostly a lurker trying to better stepson’s eating, I wonder if you could expand on why something being bland makes it terrible. To me, for someone struggling to eat because the vast majority of foods have a repulsive flavor or texture to them, for something to just be bland would still make it way better than most foods. Like bland food is like elevator music or an economy car. I wouldn’t seek it out, but it’s way better than actively agitating music or a car that breaks down constantly. I’m not trying say you’re wrong to feel bland food is terrible. I’m more just trying to understand better.",
      "created_utc": 1736228401.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5w794f",
      "author": "003145",
      "body": "Would adding more cheese to it help?",
      "created_utc": 1736267709.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5z0g2o",
      "author": "animusd",
      "body": "In canada kraft dinner did a similar thing now it's horrid even my neice hates it and she's not a picky eater but the generic brands are similar to the original luckily for me",
      "created_utc": 1736298001.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m6gu54j",
      "author": "jackass-noir",
      "body": "feeling this! i made a post abt this earlier and the recommendations i got were to add more milk/butter so it’s more soupy and then cook the  down so the texture is like how it used to be\n\nsending strength my friend",
      "created_utc": 1736542693.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m7ijfif",
      "author": "dog-princess",
      "body": "i mentioned on another thread but at costco or other wholesalers (or online), there's an organic 12 pack variety (4 cheddar, 4 white cheddar, 4 classic mac) that originally was just slightly better than the regular. however, since the recipe change, it now is WAY better since it uses the original formula and composition still, and it's what i've been doing for months since they switched gears. i highly highly recommend getting it as to get a taste of what you're missing out on; it's 16 usd iirc which isnt bad as far as annie's goes!",
      "created_utc": 1737060615.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mb09tmj",
      "author": "teriyakichicken",
      "body": "Ok is it just me or did your batch smell of vinegar?! I just made one of the new boxes and all I can smell is vinegar and it tastes off.. I hope I’m not poisoning myself 😳",
      "created_utc": 1738709646.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5xteky",
      "author": "Hippo_29",
      "body": "Companies change shit like this up because they've now added cancer to it. \n\nYou're welcome.",
      "created_utc": 1736284538.0,
      "score": 0,
      "context": []
    },
    {
      "id": "m5svre9",
      "author": "WindermerePeaks1",
      "body": "this exactly. it’s everywhere now, companies are changing things even when there’s no complaints so they can make more money. it’s sad",
      "created_utc": 1736214496.0,
      "score": 30,
      "context": [
        {
          "id": "m5s6fek",
          "author": "throwaway_185051108",
          "body": "I hate when companies change recipes. I’m sorry, was there a whole lobby of people demanding that Annie’s be cheesier?? I’ve never heard that complaint in my life!! Anyone I know who wants it to be cheesier just adds some grated parmesan on top if they feel like it. \n\nWhenever I see a company change recipes for seemingly no reason, I just suspect they’re cutting costs somewhere. In this economy, no company is improving their product just for the sake of it. In this economy, no company would ever INCREASE costs to make their product taste better unless they’re planning a reason for an even bigger price jump. There’s always money involved. \n\nI’m sorry you lost your safe food, OP. Annie’s is a big one for me too and this is so disappointing to see :(",
          "created_utc": 1736206097.0
        }
      ]
    },
    {
      "id": "m5vb3re",
      "author": "bl0bbyfish",
      "body": "Thank you so much! I'll try the parm trick in the future but thinking about it does make me shiver a little bit because I don't usually add stuff to my Mac and cheese! And yeah, they're probably saving like ten cents per box!",
      "created_utc": 1736257113.0,
      "score": 8,
      "context": [
        {
          "id": "m5s6fek",
          "author": "throwaway_185051108",
          "body": "I hate when companies change recipes. I’m sorry, was there a whole lobby of people demanding that Annie’s be cheesier?? I’ve never heard that complaint in my life!! Anyone I know who wants it to be cheesier just adds some grated parmesan on top if they feel like it. \n\nWhenever I see a company change recipes for seemingly no reason, I just suspect they’re cutting costs somewhere. In this economy, no company is improving their product just for the sake of it. In this economy, no company would ever INCREASE costs to make their product taste better unless they’re planning a reason for an even bigger price jump. There’s always money involved. \n\nI’m sorry you lost your safe food, OP. Annie’s is a big one for me too and this is so disappointing to see :(",
          "created_utc": 1736206097.0
        }
      ]
    },
    {
      "id": "m5vb6o5",
      "author": "bl0bbyfish",
      "body": "Thank you! I'll definitely try this",
      "created_utc": 1736257145.0,
      "score": 8,
      "context": [
        {
          "id": "m5sizks",
          "author": "Amazing_Duck_8298",
          "body": "The Trader Joe's white cheddar shells are made by Annie's. The recipe is slightly different, but they taste much more similar to the original than the new version. They are a bit runnier and waterier, and the cheese taste isn't as rich. Making them with more butter and less milk than the box says helps.",
          "created_utc": 1736210258.0
        }
      ]
    },
    {
      "id": "m5shvp3",
      "author": "FreddyPlayz",
      "body": "Tyson also changed their chicken nuggets, I’m so mad 😭",
      "created_utc": 1736209891.0,
      "score": 27,
      "context": [
        {
          "id": "m5s3lno",
          "author": "Tallem00",
          "body": "I feel the exact same way about one of my safe foods but it doesn't look like anybody else agrees with me 🙃🙃\n\n>!(It's the frozen Walmart brand nuggets. I already bought a giant expensive bag)!<",
          "created_utc": 1736205171.0
        }
      ]
    },
    {
      "id": "m5s4o79",
      "author": "bl0bbyfish",
      "body": "I’m sorry that’s happening to you! It’s such a shame that more people don’t understand that we CAN’T move on 😅 no matter how hard we want to",
      "created_utc": 1736205519.0,
      "score": 16,
      "context": [
        {
          "id": "m5s3lno",
          "author": "Tallem00",
          "body": "I feel the exact same way about one of my safe foods but it doesn't look like anybody else agrees with me 🙃🙃\n\n>!(It's the frozen Walmart brand nuggets. I already bought a giant expensive bag)!<",
          "created_utc": 1736205171.0
        }
      ]
    },
    {
      "id": "m5z5dn9",
      "author": "deandratb",
      "body": "I relate to this so much, I'm sorry you're dealing with it. I've never been able to eat beef, but even into adulthood the one kind of chicken I could still stand was those Burger King crown-shaped 'tenders' (which I think were probably just nuggets really). As a young adult I survived homelessness partly through plasma donation and they were a cheap source of protein when I really needed it. It must have been 15 years ago now that they changed to a different kind, and I haven't been able to eat them since--I'm still devastated and mad at them about that, because their fries got worse too and they used to be my safe fast-food place.",
      "created_utc": 1736299649.0,
      "score": 2,
      "context": [
        {
          "id": "m5s3lno",
          "author": "Tallem00",
          "body": "I feel the exact same way about one of my safe foods but it doesn't look like anybody else agrees with me 🙃🙃\n\n>!(It's the frozen Walmart brand nuggets. I already bought a giant expensive bag)!<",
          "created_utc": 1736205171.0
        }
      ]
    },
    {
      "id": "m5s4ajq",
      "author": "bl0bbyfish",
      "body": "I don’t want to tell you not to because you could like it!! But I would be afraid that you might feel the same way :(",
      "created_utc": 1736205396.0,
      "score": 16,
      "context": [
        {
          "id": "m5s3rjl",
          "author": "rigbees",
          "body": "noooo this was my first ever safe food!!! i haven’t tried the new one yet 😭😭😭",
          "created_utc": 1736205224.0
        }
      ]
    },
    {
      "id": "m5tgie3",
      "author": "cheeselemurs",
      "body": "Wow good eye!",
      "created_utc": 1736221727.0,
      "score": 5,
      "context": [
        {
          "id": "m5s7e6k",
          "author": "Lylli-Rose",
          "body": "Did the bunny shape change?",
          "created_utc": 1736206419.0
        }
      ]
    },
    {
      "id": "m5vcn1c",
      "author": "bl0bbyfish",
      "body": "\"New and improved\" to me only means \"new and we improved on ways to cut costs\" 😭",
      "created_utc": 1736257706.0,
      "score": 8,
      "context": [
        {
          "id": "m5sg4z7",
          "author": "iamtheultimateshoe",
          "body": "i remember when that happened to my bagel bites. “new and improved tomato sauce” my ass",
          "created_utc": 1736209315.0
        }
      ]
    },
    {
      "id": "m5vbd52",
      "author": "bl0bbyfish",
      "body": "Should we start a club??!?",
      "created_utc": 1736257214.0,
      "score": 5,
      "context": [
        {
          "id": "m5t70qd",
          "author": "Consistent-Baker4522",
          "body": "I hate the new Annie’s",
          "created_utc": 1736218379.0
        }
      ]
    },
    {
      "id": "m5vb9tl",
      "author": "bl0bbyfish",
      "body": "I'm not exactly sure!",
      "created_utc": 1736257179.0,
      "score": 1,
      "context": [
        {
          "id": "m5s707x",
          "author": "Idkhow_dude",
          "body": "Has this change been made to the variety packs as well? I bought some from Costco last week and it looked and tasted the same.",
          "created_utc": 1736206289.0
        }
      ]
    },
    {
      "id": "m5vbf4e",
      "author": "bl0bbyfish",
      "body": "I'm sorry to hear that!",
      "created_utc": 1736257237.0,
      "score": 1,
      "context": [
        {
          "id": "m5snwit",
          "author": "None",
          "body": "I was wondering why all of a sudden I started to get crazy painful indigestion from Annie’s! 😭",
          "created_utc": 1736211885.0
        }
      ]
    },
    {
      "id": "m69u9qy",
      "author": "tvdinnertray",
      "body": "be VERY careful trying it if you do, i kid you not it’s hands down the worst boxed mac and cheese i’ve had since the new recipe, no one in my household would even try to eat it, it smelt rancid",
      "created_utc": 1736450127.0,
      "score": 1,
      "context": [
        {
          "id": "m5saen8",
          "author": "barcode_bf",
          "body": "OH NO. this is terrible to hear. also one of my (very few) safe foods but I haven't had it in the house in a long time. I guess maybe ill try it because I COULD like it. ugh. why do companies do this",
          "created_utc": 1736207419.0
        }
      ]
    },
    {
      "id": "m5vbkcx",
      "author": "bl0bbyfish",
      "body": "I bought a few with the old recipe and I don't know when to eat them or if I should just look at them forever",
      "created_utc": 1736257293.0,
      "score": 3,
      "context": [
        {
          "id": "m5tkt4u",
          "author": "Speakerluv",
          "body": "Same exact thing happened to me. This was one of my safe foods. We have two boxes sitting in the cabinet because I don’t even want to taste it again",
          "created_utc": 1736223408.0
        }
      ]
    },
    {
      "id": "m5yt3xs",
      "author": "bl0bbyfish",
      "body": "Awwweeee I’m sorry! But I love a supportive vacuum partner! I hope to find one of my own one day because I have a hard time finishing meals sometimes too!",
      "created_utc": 1736295599.0,
      "score": 3,
      "context": [
        {
          "id": "m5yj68m",
          "author": "jojubrius",
          "body": "so good to know!! the purple box annie’s has been a staple safe food for me since i was a kid. i am now in my 30s and every time i buy it i can’t finish more than a few bites and have to make my partner eat the whole thing for me 😭 \ni had of course assumed i am the problem and randomly my brain decided it tasted different than i remember 😅",
          "created_utc": 1736292330.0
        }
      ]
    },
    {
      "id": "m5vchzf",
      "author": "bl0bbyfish",
      "body": "They're sneaky too because they're now doing some promotion which makes the box look like the older one without the \"Cheesier\" sign. If you see corn starch in the ingredients, know it's the new one",
      "created_utc": 1736257653.0,
      "score": 2,
      "context": [
        {
          "id": "m5tx5c2",
          "author": "lavenderbleudilly",
          "body": "No!! I took a break after eating it too often and they changed it!?!?",
          "created_utc": 1736228933.0
        }
      ]
    },
    {
      "id": "m5vccbu",
      "author": "bl0bbyfish",
      "body": "Thanks for the recommendation!",
      "created_utc": 1736257593.0,
      "score": 2,
      "context": [
        {
          "id": "m5us99j",
          "author": "abigailthefail",
          "body": "i haven’t ever tried this one, but my all time favorite white cheddar mac and cheese is the panera stuff that you can get at the grocery store (it tastes way different than what you get at an actual panera restaurant) it’s sooo good",
          "created_utc": 1736248019.0
        }
      ]
    },
    {
      "id": "m5wwosu",
      "author": "neverbloomagain",
      "body": "oh my gosh i see it. this probably sounds dramatic, but i want to cry haha. they're trying to bury us",
      "created_utc": 1736275113.0,
      "score": 3,
      "context": [
        {
          "id": "m5wvzu1",
          "author": "neverbloomagain",
          "body": "im worried about the reviews that you've noticed!! ive been left a few on websites (target, annie's) and even DMed annie's through twitter lol. the case for months was that when you sorted the reviews by recent on the two \"cheesier\" flavors, they were literally all 1 star! i really hope they're not trying to bury that. \n\nif what you're saying about them trying to offset it is true, i guess the plus side is that they noticed we all hate the new versions. i'm SO hoping that sales reflect that and that they'll have no choice but to change it back. i know if they do, i'll be buying like 15 boxes immediately haha.",
          "created_utc": 1736274913.0
        }
      ]
    },
    {
      "id": "m6htz6u",
      "author": "bl0bbyfish",
      "body": "No I totally get that!!! You just know! People are weirded out when I ask them if they know the smell of ants (the bug haha) but ants have a distinct smell imo",
      "created_utc": 1736554139.0,
      "score": 2,
      "context": [
        {
          "id": "m6h6uq9",
          "author": "Specific_Future_776",
          "body": "i get called insane ( mostly joking don’t worry) when i say i can smell when things aren’t good or have chnaged recipe. for instance i can smell when bread is a couple days away from going bad and i also smelt the difference between the old cherry coke recipe and the new one it’s just like my nose knows lol",
          "created_utc": 1736546524.0
        }
      ]
    },
    {
      "id": "m60sfll",
      "author": "Darillium-",
      "body": "Costco chocolate muffins, most recently\n\nI can still eat them, they’re just different now :(",
      "created_utc": 1736326087.0,
      "score": 1,
      "context": [
        {
          "id": "m5wcdun",
          "author": "xanaxQc",
          "body": "Ugh, I def hear you. I've lost *soooo* many of my safe foods bc the company did something to the recipe. 😭 If it ain't broke, don't fix it!! ",
          "created_utc": 1736269215.0
        }
      ]
    },
    {
      "id": "m5ubi1r",
      "author": "Gaymer7437",
      "body": "I definitely prefer bland foods but I have found that what other people consider to be bland I find perfectly full of flavor and what I consider who you bland doesn't have flavor. A lot of things other people find perfectly full of flavor I find to be too intense. It's like my scale is shifted but there is still a thing as too bland for me.",
      "created_utc": 1736237115.0,
      "score": 3,
      "context": [
        {
          "id": "m5tw260",
          "author": "corn_breath",
          "body": "As mostly a lurker trying to better stepson’s eating, I wonder if you could expand on why something being bland makes it terrible. To me, for someone struggling to eat because the vast majority of foods have a repulsive flavor or texture to them, for something to just be bland would still make it way better than most foods. Like bland food is like elevator music or an economy car. I wouldn’t seek it out, but it’s way better than actively agitating music or a car that breaks down constantly. I’m not trying say you’re wrong to feel bland food is terrible. I’m more just trying to understand better.",
          "created_utc": 1736228401.0
        }
      ]
    },
    {
      "id": "m5vca6e",
      "author": "bl0bbyfish",
      "body": "I guess it's more a nostalgic and consistency thing. My mom made it for me as a child and then I started to make it by myself as I got older. I'm really good at messing up simple recipes but I could always make the Mac and cheese the same as she did. I'm so familiar with the taste at this song. If I were to make another analogy out of yours, it's like listening to your favorite song and then the artist takes the song off and only replaces it with the worst remix you can imagine! The parts that you loved in that song are mostly gone even though it's still called Song (Remix)",
      "created_utc": 1736257570.0,
      "score": 3,
      "context": [
        {
          "id": "m5tw260",
          "author": "corn_breath",
          "body": "As mostly a lurker trying to better stepson’s eating, I wonder if you could expand on why something being bland makes it terrible. To me, for someone struggling to eat because the vast majority of foods have a repulsive flavor or texture to them, for something to just be bland would still make it way better than most foods. Like bland food is like elevator music or an economy car. I wouldn’t seek it out, but it’s way better than actively agitating music or a car that breaks down constantly. I’m not trying say you’re wrong to feel bland food is terrible. I’m more just trying to understand better.",
          "created_utc": 1736228401.0
        }
      ]
    },
    {
      "id": "m5wlrwr",
      "author": "throwaway_185051108",
      "body": "Oh yeah, I wasn’t suggesting you do the parm thing at ALL haha the different texture makes me feel weird and I don’t like when things are super cheesy 😖 Just sucks that they had to change it for no reason. Hope the rest of your safe foods remain untouched in 2025 🤞",
      "created_utc": 1736271963.0,
      "score": 4,
      "context": [
        {
          "id": "m5s6fek",
          "author": "throwaway_185051108",
          "body": "I hate when companies change recipes. I’m sorry, was there a whole lobby of people demanding that Annie’s be cheesier?? I’ve never heard that complaint in my life!! Anyone I know who wants it to be cheesier just adds some grated parmesan on top if they feel like it. \n\nWhenever I see a company change recipes for seemingly no reason, I just suspect they’re cutting costs somewhere. In this economy, no company is improving their product just for the sake of it. In this economy, no company would ever INCREASE costs to make their product taste better unless they’re planning a reason for an even bigger price jump. There’s always money involved. \n\nI’m sorry you lost your safe food, OP. Annie’s is a big one for me too and this is so disappointing to see :(",
          "created_utc": 1736206097.0
        },
        {
          "id": "m5vb3re",
          "author": "bl0bbyfish",
          "body": "Thank you so much! I'll try the parm trick in the future but thinking about it does make me shiver a little bit because I don't usually add stuff to my Mac and cheese! And yeah, they're probably saving like ten cents per box!",
          "created_utc": 1736257113.0
        }
      ]
    },
    {
      "id": "m5yjmbe",
      "author": "jojubrius",
      "body": "warning: i tried adding some parm into mine a couple weeks ago and the way it added the cheese-stringers icked me out even more on top of the taste of the new recipe 💔 \ni even tried making the sauce in a separate pan and stirring it in like a roux but to no avail.",
      "created_utc": 1736292478.0,
      "score": 1,
      "context": [
        {
          "id": "m5s6fek",
          "author": "throwaway_185051108",
          "body": "I hate when companies change recipes. I’m sorry, was there a whole lobby of people demanding that Annie’s be cheesier?? I’ve never heard that complaint in my life!! Anyone I know who wants it to be cheesier just adds some grated parmesan on top if they feel like it. \n\nWhenever I see a company change recipes for seemingly no reason, I just suspect they’re cutting costs somewhere. In this economy, no company is improving their product just for the sake of it. In this economy, no company would ever INCREASE costs to make their product taste better unless they’re planning a reason for an even bigger price jump. There’s always money involved. \n\nI’m sorry you lost your safe food, OP. Annie’s is a big one for me too and this is so disappointing to see :(",
          "created_utc": 1736206097.0
        },
        {
          "id": "m5vb3re",
          "author": "bl0bbyfish",
          "body": "Thank you so much! I'll try the parm trick in the future but thinking about it does make me shiver a little bit because I don't usually add stuff to my Mac and cheese! And yeah, they're probably saving like ten cents per box!",
          "created_utc": 1736257113.0
        }
      ]
    },
    {
      "id": "m5shzlg",
      "author": "Tallem00",
      "body": "Nooooo!! I was gonna try those now that I'm out of the Walmart ones 😭",
      "created_utc": 1736209927.0,
      "score": 6,
      "context": [
        {
          "id": "m5s3lno",
          "author": "Tallem00",
          "body": "I feel the exact same way about one of my safe foods but it doesn't look like anybody else agrees with me 🙃🙃\n\n>!(It's the frozen Walmart brand nuggets. I already bought a giant expensive bag)!<",
          "created_utc": 1736205171.0
        },
        {
          "id": "m5shvp3",
          "author": "FreddyPlayz",
          "body": "Tyson also changed their chicken nuggets, I’m so mad 😭",
          "created_utc": 1736209891.0
        }
      ]
    },
    {
      "id": "m5swkg5",
      "author": "Just_Smurfin_Around",
      "body": "they changed their popcorn chicken as well...texture and taste are totally different :(",
      "created_utc": 1736214771.0,
      "score": 7,
      "context": [
        {
          "id": "m5s3lno",
          "author": "Tallem00",
          "body": "I feel the exact same way about one of my safe foods but it doesn't look like anybody else agrees with me 🙃🙃\n\n>!(It's the frozen Walmart brand nuggets. I already bought a giant expensive bag)!<",
          "created_utc": 1736205171.0
        },
        {
          "id": "m5shvp3",
          "author": "FreddyPlayz",
          "body": "Tyson also changed their chicken nuggets, I’m so mad 😭",
          "created_utc": 1736209891.0
        }
      ]
    },
    {
      "id": "m5woynn",
      "author": "power36113",
      "body": "I grew up eating Tyson nuggets (early to mid 2000s, born in 96) and I remember when I moved out in 2016 and got my own place and made chicken nuggets, they tasted a little different. I think they started playing with the recipe in the mid 2010s. I used to LOVE them. Now I’m afraid of them.",
      "created_utc": 1736272873.0,
      "score": 5,
      "context": [
        {
          "id": "m5s3lno",
          "author": "Tallem00",
          "body": "I feel the exact same way about one of my safe foods but it doesn't look like anybody else agrees with me 🙃🙃\n\n>!(It's the frozen Walmart brand nuggets. I already bought a giant expensive bag)!<",
          "created_utc": 1736205171.0
        },
        {
          "id": "m5shvp3",
          "author": "FreddyPlayz",
          "body": "Tyson also changed their chicken nuggets, I’m so mad 😭",
          "created_utc": 1736209891.0
        }
      ]
    },
    {
      "id": "m5sd0bo",
      "author": "rigbees",
      "body": "i’ll most def try it at some point, i’m hoping for the best 🤞",
      "created_utc": 1736208279.0,
      "score": 9,
      "context": [
        {
          "id": "m5s3rjl",
          "author": "rigbees",
          "body": "noooo this was my first ever safe food!!! i haven’t tried the new one yet 😭😭😭",
          "created_utc": 1736205224.0
        },
        {
          "id": "m5s4ajq",
          "author": "bl0bbyfish",
          "body": "I don’t want to tell you not to because you could like it!! But I would be afraid that you might feel the same way :(",
          "created_utc": 1736205396.0
        }
      ]
    },
    {
      "id": "m5wd0zh",
      "author": "xanaxQc",
      "body": "That sounds exactly how it is. 😔 So disappointing, every time.",
      "created_utc": 1736269403.0,
      "score": 1,
      "context": [
        {
          "id": "m5sg4z7",
          "author": "iamtheultimateshoe",
          "body": "i remember when that happened to my bagel bites. “new and improved tomato sauce” my ass",
          "created_utc": 1736209315.0
        },
        {
          "id": "m5vcn1c",
          "author": "bl0bbyfish",
          "body": "\"New and improved\" to me only means \"new and we improved on ways to cut costs\" 😭",
          "created_utc": 1736257706.0
        }
      ]
    },
    {
      "id": "m5vyanp",
      "author": "Speakerluv",
      "body": "I ate the last box not knowing the recipe changed",
      "created_utc": 1736265034.0,
      "score": 1,
      "context": [
        {
          "id": "m5tkt4u",
          "author": "Speakerluv",
          "body": "Same exact thing happened to me. This was one of my safe foods. We have two boxes sitting in the cabinet because I don’t even want to taste it again",
          "created_utc": 1736223408.0
        },
        {
          "id": "m5vbkcx",
          "author": "bl0bbyfish",
          "body": "I bought a few with the old recipe and I don't know when to eat them or if I should just look at them forever",
          "created_utc": 1736257293.0
        }
      ]
    },
    {
      "id": "m5ytqwc",
      "author": "jojubrius",
      "body": "LMAO vacuum partner is the perfect term, i will absolutely be using that in the future! he def saves me a lot of guilt i used to carry around regarding food waste.",
      "created_utc": 1736295808.0,
      "score": 3,
      "context": [
        {
          "id": "m5yj68m",
          "author": "jojubrius",
          "body": "so good to know!! the purple box annie’s has been a staple safe food for me since i was a kid. i am now in my 30s and every time i buy it i can’t finish more than a few bites and have to make my partner eat the whole thing for me 😭 \ni had of course assumed i am the problem and randomly my brain decided it tasted different than i remember 😅",
          "created_utc": 1736292330.0
        },
        {
          "id": "m5yt3xs",
          "author": "bl0bbyfish",
          "body": "Awwweeee I’m sorry! But I love a supportive vacuum partner! I hope to find one of my own one day because I have a hard time finishing meals sometimes too!",
          "created_utc": 1736295599.0
        }
      ]
    },
    {
      "id": "m5wd48a",
      "author": "lavenderbleudilly",
      "body": "Thank you for this. Ugh!!",
      "created_utc": 1736269430.0,
      "score": 1,
      "context": [
        {
          "id": "m5tx5c2",
          "author": "lavenderbleudilly",
          "body": "No!! I took a break after eating it too often and they changed it!?!?",
          "created_utc": 1736228933.0
        },
        {
          "id": "m5vchzf",
          "author": "bl0bbyfish",
          "body": "They're sneaky too because they're now doing some promotion which makes the box look like the older one without the \"Cheesier\" sign. If you see corn starch in the ingredients, know it's the new one",
          "created_utc": 1736257653.0
        }
      ]
    },
    {
      "id": "mapp58b",
      "author": "Specific_Future_776",
      "body": "i actually do! the smell of ants is just them you know😂 i have a good sense of smell anyway but i feel like arfid heightened it😂",
      "created_utc": 1738576813.0,
      "score": 1,
      "context": [
        {
          "id": "m6h6uq9",
          "author": "Specific_Future_776",
          "body": "i get called insane ( mostly joking don’t worry) when i say i can smell when things aren’t good or have chnaged recipe. for instance i can smell when bread is a couple days away from going bad and i also smelt the difference between the old cherry coke recipe and the new one it’s just like my nose knows lol",
          "created_utc": 1736546524.0
        },
        {
          "id": "m6htz6u",
          "author": "bl0bbyfish",
          "body": "No I totally get that!!! You just know! People are weirded out when I ask them if they know the smell of ants (the bug haha) but ants have a distinct smell imo",
          "created_utc": 1736554139.0
        }
      ]
    },
    {
      "id": "m5vypgo",
      "author": "corn_breath",
      "body": "So would you say it's not that the new version is terrible; what's terrible is that the old Annie's is gone? In other words, if old Annie's remained and you one day tried another mac box that tasted like new Annie's, you wouldn't describe it as terrible?",
      "created_utc": 1736265156.0,
      "score": 1,
      "context": [
        {
          "id": "m5tw260",
          "author": "corn_breath",
          "body": "As mostly a lurker trying to better stepson’s eating, I wonder if you could expand on why something being bland makes it terrible. To me, for someone struggling to eat because the vast majority of foods have a repulsive flavor or texture to them, for something to just be bland would still make it way better than most foods. Like bland food is like elevator music or an economy car. I wouldn’t seek it out, but it’s way better than actively agitating music or a car that breaks down constantly. I’m not trying say you’re wrong to feel bland food is terrible. I’m more just trying to understand better.",
          "created_utc": 1736228401.0
        },
        {
          "id": "m5vca6e",
          "author": "bl0bbyfish",
          "body": "I guess it's more a nostalgic and consistency thing. My mom made it for me as a child and then I started to make it by myself as I got older. I'm really good at messing up simple recipes but I could always make the Mac and cheese the same as she did. I'm so familiar with the taste at this song. If I were to make another analogy out of yours, it's like listening to your favorite song and then the artist takes the song off and only replaces it with the worst remix you can imagine! The parts that you loved in that song are mostly gone even though it's still called Song (Remix)",
          "created_utc": 1736257570.0
        }
      ]
    },
    {
      "id": "m5sip8y",
      "author": "FreddyPlayz",
      "body": "Lmao well I guess it’s good that I said something before you bought another big bag 😂\n\nUnless you’ve never had then before, maybe worth a shot, and they sell different sized bags (though I don’t really like them)",
      "created_utc": 1736210165.0,
      "score": 11,
      "context": [
        {
          "id": "m5s3lno",
          "author": "Tallem00",
          "body": "I feel the exact same way about one of my safe foods but it doesn't look like anybody else agrees with me 🙃🙃\n\n>!(It's the frozen Walmart brand nuggets. I already bought a giant expensive bag)!<",
          "created_utc": 1736205171.0
        },
        {
          "id": "m5shvp3",
          "author": "FreddyPlayz",
          "body": "Tyson also changed their chicken nuggets, I’m so mad 😭",
          "created_utc": 1736209891.0
        },
        {
          "id": "m5shzlg",
          "author": "Tallem00",
          "body": "Nooooo!! I was gonna try those now that I'm out of the Walmart ones 😭",
          "created_utc": 1736209927.0
        }
      ]
    }
  ]
}