{
  "id": "1hwrfo6",
  "subreddit": "ARFID",
  "author": "Little_Bit_87",
  "created_utc": 1736361623.0,
  "title": "Marijuana and ARFID",
  "selftext": "So have any of you tried to help manage your condition with marijuana. When I had medical issues in my 20s I was prescribed Percocet like it was vitamins. A doctor suggested I try marijuana. Since then I've used marijuana just for the munchies. A lot of time when my ARFID makes even my safe foods repulsive I'll get stoned to get the motivation to eat. Has anyone else used this method? Am I making the right choice doing this? Will it cause more issues with my ARFID? My ARFID is mostly sensory triggered. \n\nUpdate: Thank you all for your kind and insightful comments and support. I have tried to respond and like every comment. I am putting my phone down because I have been typing for over an hour. So if your comment isn't liked or whatnot please know I will get to it ❤️❤️❤️❤️ and again a big thanks to everyone. ",
  "url": "https://www.reddit.com/r/ARFID/comments/1hwrfo6/marijuana_and_arfid/",
  "score": 101,
  "num_comments": 87,
  "comments": [
    {
      "id": "m63c5qc",
      "author": "acrobatic_lion",
      "body": "Cannabis works to increase your appetite and make eating easier… until it doesn’t. And then you’re really screwed, because it can feel like a crutch that suddenly stops working. \n\nIn my experience, it’s okay to use cannabis for this purpose short term/intermittently — but NOT to develop a reliance on cannabis to eat. Because there always comes a day when even the cannabis doesn’t help, and then im really shit out of luck.",
      "created_utc": 1736362089.0,
      "score": 121,
      "context": []
    },
    {
      "id": "m63duxu",
      "author": "jojubrius",
      "body": "I’ve been self medicating for appetite w weed since HS & have zero shame about it. (i live in oregon so daily usage is super normalized here for the most part)\n\nFor years doctors, psychiatrists, and therapists have advised I try to avoid weed because of their outdated knowledge on weed and bipolar ii— that is until i dropped down to like 90lbs and they all said something to the effect of “wow even as a cannabis user??” and i haven’t heard a peep from them about weed ever since 🥰",
      "created_utc": 1736362576.0,
      "score": 34,
      "context": []
    },
    {
      "id": "m63bbfp",
      "author": "tiictacs",
      "body": "so it helps me eat and i do it all the time but my issues are not very sensory so it might be different",
      "created_utc": 1736361848.0,
      "score": 9,
      "context": []
    },
    {
      "id": "m63d7z4",
      "author": "shitz_brickz",
      "body": "It helps me eat food I already like, but I have actually found alcohol suppresses the sensory issues much more, which is the major issue for me. Goes both ways, I have eaten food and gotten violently ill once I sobered up but still had the food in me, I have also eaten food I was previously afraid to try and now am able to eat small portions of while sober.",
      "created_utc": 1736362393.0,
      "score": 8,
      "context": []
    },
    {
      "id": "m63i6c2",
      "author": "ResurgentClusterfuck",
      "body": "It works for me, but ARFID isn't the only condition I have that's helped by cannabis \n\nFor some people, it can stop working, have an opposite effect, or cause CHS",
      "created_utc": 1736363822.0,
      "score": 7,
      "context": []
    },
    {
      "id": "m63itub",
      "author": "None",
      "body": "it's my go to when i'm struggling.  i also have health issues that cause chronic nausea, so it's really a life saver for me.  i take tolerance breaks sometimes and that can be rough, but it's worth it to me!",
      "created_utc": 1736364013.0,
      "score": 7,
      "context": []
    },
    {
      "id": "m63dv4s",
      "author": "None",
      "body": "Marijuana is the best solution I ever found. I am currently taking a break from it for allergy season and I am dropping weight again",
      "created_utc": 1736362578.0,
      "score": 6,
      "context": []
    },
    {
      "id": "m63c6qy",
      "author": "None",
      "body": "I live in a place where it’s legal and yes absolutely. It’s been detrimental to my recovery. I just can’t get hungry without it. I’m so glad you mentioned it.",
      "created_utc": 1736362097.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m63j54x",
      "author": "Krystali3n",
      "body": "I mean use it if you like it, but in my experience it doesn’t help with ARFID. I smoke daily and it does help with appetite but I feel like it would make texture issues worse, if anything. If you try it for ARFID specifically, get a heavy indica because sativa can make you anxious and overthink.",
      "created_utc": 1736364105.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m64a09e",
      "author": "VisceraGrind",
      "body": "I don't have any problems with weed, just be careful about how much. Some people can handle themselves and some can't (like myself). Weed can help with a lot of things including an increase in appetite for those that need it. I know it's a bit annoying to hear, but if you are going to use weed as a benefit, please monitor your cognition/memory and mood overtime. \n\nThe community surrounding weed can be a little overzealous with it because of how much harm the criminalization of it has done, but it doesn't \\*not\\* have side effects, just like any medication/substance you put into your body. It's not black (dare program) or white (what lots of stoners like myself would've said), it's grey much like everything in life. If it works for you and it doesn't impact your daily life negatively, go for it!\n\nIf people notice changes in you and you don't believe so, I'd take into consideration what the people around you are saying because it IS a slow burn in terms of the negative side of things popping up. Kind of like losing weight, if you look in the mirror every day for a couple months (for those of us with body image issues anyways) you might not think you've made much progress, but when you look back to where you started you've actually made more progress than you thought. It's similar to the negative affects of weed. I personally didn't notice it or even listen to people around me until it got bad. But, I'm also mentally ill, I have bipolar disorder.\n\n  \nAt the end of the day: cost and benefit analysis. If the benefits outweigh the costs, go for it. If not, I'd stop while you're ahead. Physical weed withdrawals aren't very fun, didn't even know they were a thing until a month ago LOL.",
      "created_utc": 1736371905.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m67bybh",
      "author": "Miserable-Coffee",
      "body": "Helps until you end up relying on it",
      "created_utc": 1736417697.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m63h17d",
      "author": "Blujay12",
      "body": "DO NOT.\n\nIt works, for a while, full regular appetite, wider tastes, but then you need it to be able to eat at all.\n\nI still can't eat in the first half of the day without being sick, work lunches are obviously difficult, and now it barely works, if it ever does. Most I get is a light dinner, even optimal conditions I'm eating a fair bit less than I did before I did anything, which was far from excess in the first place lol\n\nI got maybe 4-5 months of doing this, before it went neutralish, coasted like that for another 5-6 or so, and now it's a year later, trying to whittle down my addiction, and fix my body.",
      "created_utc": 1736363492.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m63lz55",
      "author": "killrtaco",
      "body": "Helps my appetite and my attention span. Smoke every day throughout the day as needed. My life has significantly improved in the 4 years I've been doing so.",
      "created_utc": 1736364925.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m64aqs9",
      "author": "MoodOk8885",
      "body": "Withdrawals make it worse in my experience",
      "created_utc": 1736372121.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m64gfxc",
      "author": "AdhesivenessOk5534",
      "body": "I've been starting to use weed again for the appetite stimulation and nausea and anxiety suppression \n\nLike someone else said there's no shame in it \n\nFood is vital do what you have to do",
      "created_utc": 1736373759.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m64k2f9",
      "author": "The_Spicy_Sage",
      "body": "It helped calm my nausea so I could eat",
      "created_utc": 1736374840.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m64l0k2",
      "author": "benisahappyguy2",
      "body": "I do. I have to be super careful tho and still force myself to eat most things bc otherwise after a while I could only eat when I was stoned. Cutting back once your at that point is the literal fucking worst",
      "created_utc": 1736375129.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m64qh9m",
      "author": "_FirstOfHerName_",
      "body": "I smoked weed for ten years and it did nothing to help me overcome ARFID. Then I quit weed and worked on my eating. I more than tripled my number of safe foods and tolerate so many more textures too!\n\nMight be unrelated but I did have one lone acid trip right before my eating improved exponentially...",
      "created_utc": 1736376828.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m64tlj3",
      "author": "None",
      "body": "I've been using cannabis to stimulate appetite for over a decade. It's been the only thing for me to provide consistent and effective relief.  Everyone's response  is different and different strains create variable responses, which is key to remember. Don't abuse it, don't consume a ton of it all day every day, and stay away from street drugs because I've personally known people harmed/killed by cannabis they and their dealer thought was safe (laced). Aquire it legally, get a green card if possible. And never lie to your physicians about using it.",
      "created_utc": 1736377837.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m655e63",
      "author": "lavenderbleudilly",
      "body": "I have used marijuana to try new foods! Instead of relying for appetite, I try to use it to encourage exploration. That’s where it had the list long term benefit for me. Especially with new veggies and fruits.",
      "created_utc": 1736381796.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m66hpwy",
      "author": "74126",
      "body": "in my experience doing this, i quickly was only able to eat when i was high and when it stopped helping with my appetite i barely ate for like a month before i had to take a long break. i was also smoking pretty heavy though so theres a fair chance i was just overdoing it. if ur gonna do it just make sure ur eating sober and being responsible with ur weed intake i guess",
      "created_utc": 1736399808.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m66p390",
      "author": "gunswithkids",
      "body": "i self medicated before i was of the smoking age in my state (21) staring at age 16 and the long term effects on my short term memory and overall wellbeing are horrifying. however i did technically ‘recover’ from ARFID because i would get ridiculously stoned and order doordash i’ve never tried during COVID lol",
      "created_utc": 1736403548.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m66wjjw",
      "author": "Skvllix",
      "body": "i use the juana ALL the time it does WONDERS for my arfid ESPECIALLY the few times it gets really bad",
      "created_utc": 1736407805.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m68a0az",
      "author": "feistymummy",
      "body": "Yes!! During Covid I started eating a lot more gummies out of boredom and noticed if I was at a restaurant, I would be willing to try my husbands food if he offered it. I gained 30 lbs 😆and was adding a lot of new foods! Now I just smoke before bed and have a bedtime snack to keep that in check BUT if I have a company dinner to go to, I take half a gummy or so to keep me more normal around food in public.",
      "created_utc": 1736433396.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m69dcr7",
      "author": "vEGAN_cHONKER",
      "body": "Yes however smoking makes me gag like crazy and throw up 🥲 i hate the taste and can't use my taste buds at all (close my nose) I really wish it doesn't because it also helps with my ARFID w munchies",
      "created_utc": 1736445251.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m6a2gvn",
      "author": "KillTheInc",
      "body": "Results may vary. I had some delta 9 THC for fun one day, and I get really bad munchies. I decided I wanted to fix myself some rice, but I didn't realize I was out of ketchup until it was almost done. I like to mix ketchup into my rice. I tried eating it anyway, and I couldn't finish it. Being high intensifies all sensory experiences for me, both good and bad.",
      "created_utc": 1736452504.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m6a8fi1",
      "author": "blubbelblubbel",
      "body": "for me it makes my arfid worse. there‘s nothing quite like having the perfect munchie food but this rarely happens as I can‘t really tell in advance what I‘m gonna crave.\n\nweed hightens my sensitivity towards sensory input even more (I‘m autistic too) and with my mouth being all dry, tastes being slightly different than sober and the intensity of the textures being more, eating enough gets harder than it already is.",
      "created_utc": 1736454251.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m6dhs4b",
      "author": "Snugglebuggle",
      "body": "My weed tolerance is so high I’m about to try and quit for a month so that edibles can finally work again. A psychiatrist prescribed me Olanzepine 8 years ago to encourage my appetite. It was like weed munchies on crack. Everything looked good to eat and it had to go in my mouth.  I put on 80lbs, so beware. I need my olanzepine dose increased now because it’s no longer effective and my ARFID has been in overdrive the last year because of it.",
      "created_utc": 1736498721.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m6ehwyk",
      "author": "Miquelissa",
      "body": "I treat arfid and multiple other disabilities with weed, daily use cbd and thc is essential, only smoking will cause thc imbalance that most here complain about, I use cbd cbn and cbg tincture from Cannariver and smoke high grade flowers about a gram a day, AND high concentration thc tincture as well, honestly the only way to live im doing this treatment for 2 years now with no break and yes i still get hungry and still get high.",
      "created_utc": 1736517473.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m6etib2",
      "author": "Beginning_Comfort176",
      "body": "i am prescribed medical cannabis for anxiety and depression. i often use it to help with my appetite if im having a bad day x",
      "created_utc": 1736521441.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m6lem9i",
      "author": "acidinbath",
      "body": "yeah i can’t eat at all if im not high it just helps with not thinking about it so hard couldn’t imagine life without weed",
      "created_utc": 1736612389.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m6me9jm",
      "author": "Neocactus",
      "body": "Long and the short of it: weed/weed products increases my appetite, and alongside it, my anxiety.\n\nSo I just eat more of the same junk is usually how it goes.",
      "created_utc": 1736623489.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m63ejba",
      "author": "MyMoreOriginalName",
      "body": "This was my experience with it as well. it helped initially but the more I used it, the less it worked and now it doesn't do anything for my hunger at all. In fact, for a bit, I used it as a way to numb the hunger so I wouldn't have to eat as much and well you can probably guess how well that all went",
      "created_utc": 1736362771.0,
      "score": 25,
      "context": [
        {
          "id": "m63c5qc",
          "author": "acrobatic_lion",
          "body": "Cannabis works to increase your appetite and make eating easier… until it doesn’t. And then you’re really screwed, because it can feel like a crutch that suddenly stops working. \n\nIn my experience, it’s okay to use cannabis for this purpose short term/intermittently — but NOT to develop a reliance on cannabis to eat. Because there always comes a day when even the cannabis doesn’t help, and then im really shit out of luck.",
          "created_utc": 1736362089.0
        }
      ]
    },
    {
      "id": "m63e0jj",
      "author": "Little_Bit_87",
      "body": "Yeah tolerance is definitely a fear of mine. There are countless ways to suppress apatite, but not much out there that increases apatite.",
      "created_utc": 1736362621.0,
      "score": 4,
      "context": [
        {
          "id": "m63c5qc",
          "author": "acrobatic_lion",
          "body": "Cannabis works to increase your appetite and make eating easier… until it doesn’t. And then you’re really screwed, because it can feel like a crutch that suddenly stops working. \n\nIn my experience, it’s okay to use cannabis for this purpose short term/intermittently — but NOT to develop a reliance on cannabis to eat. Because there always comes a day when even the cannabis doesn’t help, and then im really shit out of luck.",
          "created_utc": 1736362089.0
        }
      ]
    },
    {
      "id": "m63e31n",
      "author": "jojubrius",
      "body": "second this!! i’ve used weed to stimulate appetite since i was a teenager but now in my mid-30s wisdom i have to take tolerance breaks every couple months because of diminishing returns 🙃",
      "created_utc": 1736362641.0,
      "score": 6,
      "context": [
        {
          "id": "m63c5qc",
          "author": "acrobatic_lion",
          "body": "Cannabis works to increase your appetite and make eating easier… until it doesn’t. And then you’re really screwed, because it can feel like a crutch that suddenly stops working. \n\nIn my experience, it’s okay to use cannabis for this purpose short term/intermittently — but NOT to develop a reliance on cannabis to eat. Because there always comes a day when even the cannabis doesn’t help, and then im really shit out of luck.",
          "created_utc": 1736362089.0
        }
      ]
    },
    {
      "id": "m64mrir",
      "author": "vulcanfeminist",
      "body": "In addition to this, in my experience, when I rely on weed for appetite when I stop using weed I literally can't eat at all and then I end up way worse off",
      "created_utc": 1736375666.0,
      "score": 6,
      "context": [
        {
          "id": "m63c5qc",
          "author": "acrobatic_lion",
          "body": "Cannabis works to increase your appetite and make eating easier… until it doesn’t. And then you’re really screwed, because it can feel like a crutch that suddenly stops working. \n\nIn my experience, it’s okay to use cannabis for this purpose short term/intermittently — but NOT to develop a reliance on cannabis to eat. Because there always comes a day when even the cannabis doesn’t help, and then im really shit out of luck.",
          "created_utc": 1736362089.0
        }
      ]
    },
    {
      "id": "m654jdf",
      "author": "39dayou",
      "body": "i agree !! for me it was super helpful until my tolerance shot up and i became a bit dependent on it yet it wouldn’t work anymore because of the high tolerance. i’m on a break atm and planning to go back cuz it rlly does help me entirely w the anxieties and lack of appetite. it’s just abt knowing when to take breaks or how much u personally need :)",
      "created_utc": 1736381506.0,
      "score": 3,
      "context": [
        {
          "id": "m63c5qc",
          "author": "acrobatic_lion",
          "body": "Cannabis works to increase your appetite and make eating easier… until it doesn’t. And then you’re really screwed, because it can feel like a crutch that suddenly stops working. \n\nIn my experience, it’s okay to use cannabis for this purpose short term/intermittently — but NOT to develop a reliance on cannabis to eat. Because there always comes a day when even the cannabis doesn’t help, and then im really shit out of luck.",
          "created_utc": 1736362089.0
        }
      ]
    },
    {
      "id": "m67zkal",
      "author": "lurkingsubz",
      "body": "i used it so much to boost my appetite that smoking has actually effectively killed it. i cannot eat when i’m high anymore. if i’m hungry, i better eat NOW and smoke LATER, because my appetite will completely go away until i come back down, it’s like it’s blocking my hunger cues.",
      "created_utc": 1736429615.0,
      "score": 1,
      "context": [
        {
          "id": "m63c5qc",
          "author": "acrobatic_lion",
          "body": "Cannabis works to increase your appetite and make eating easier… until it doesn’t. And then you’re really screwed, because it can feel like a crutch that suddenly stops working. \n\nIn my experience, it’s okay to use cannabis for this purpose short term/intermittently — but NOT to develop a reliance on cannabis to eat. Because there always comes a day when even the cannabis doesn’t help, and then im really shit out of luck.",
          "created_utc": 1736362089.0
        }
      ]
    },
    {
      "id": "m6ei4xd",
      "author": "Miquelissa",
      "body": "Not my experience sad for you tho, im 2 years into medical treatment with tinctures and flowers and never been better 🫡 still eat very little food varieties but at least i eat lol",
      "created_utc": 1736517553.0,
      "score": 1,
      "context": [
        {
          "id": "m63c5qc",
          "author": "acrobatic_lion",
          "body": "Cannabis works to increase your appetite and make eating easier… until it doesn’t. And then you’re really screwed, because it can feel like a crutch that suddenly stops working. \n\nIn my experience, it’s okay to use cannabis for this purpose short term/intermittently — but NOT to develop a reliance on cannabis to eat. Because there always comes a day when even the cannabis doesn’t help, and then im really shit out of luck.",
          "created_utc": 1736362089.0
        }
      ]
    },
    {
      "id": "m71lvj9",
      "author": "floorigami",
      "body": "To echo this, I use it for certain meals I want to eat but know I'll need help eating. This week that has been ham and bean soup. Beans are hard for me. Sometimes I need it to eat anything. Only if my anxiety is extra bad. I have a tendency to become very dependent on cannabis (used it soooo much in my late teens and early 20s) that I am really having to reshape my relationship with it now and see it as medicine.",
      "created_utc": 1736827030.0,
      "score": 1,
      "context": [
        {
          "id": "m63c5qc",
          "author": "acrobatic_lion",
          "body": "Cannabis works to increase your appetite and make eating easier… until it doesn’t. And then you’re really screwed, because it can feel like a crutch that suddenly stops working. \n\nIn my experience, it’s okay to use cannabis for this purpose short term/intermittently — but NOT to develop a reliance on cannabis to eat. Because there always comes a day when even the cannabis doesn’t help, and then im really shit out of luck.",
          "created_utc": 1736362089.0
        }
      ]
    },
    {
      "id": "m63h101",
      "author": "Little_Bit_87",
      "body": "Yeah I tell my doctors I smoke, but never say a word about it to anyone in mental health lol I'm not about to listen to another speech. I've done it both ways and know what works and what doesn't. \n\nAlso HELLO DOWN THERE lol I'm your northern neighbor (small town 15 miles NE of Seattle)",
      "created_utc": 1736363491.0,
      "score": 5,
      "context": [
        {
          "id": "m63duxu",
          "author": "jojubrius",
          "body": "I’ve been self medicating for appetite w weed since HS & have zero shame about it. (i live in oregon so daily usage is super normalized here for the most part)\n\nFor years doctors, psychiatrists, and therapists have advised I try to avoid weed because of their outdated knowledge on weed and bipolar ii— that is until i dropped down to like 90lbs and they all said something to the effect of “wow even as a cannabis user??” and i haven’t heard a peep from them about weed ever since 🥰",
          "created_utc": 1736362576.0
        }
      ]
    },
    {
      "id": "m63oqcj",
      "author": "Laetiporus1",
      "body": "My teen daughter self medicated with weed and carts for mental health issues and she developed cannabis hyperemesis and got down to 80 pounds. For her weed and carts didn’t stimulate her appetite. A year later quitting  and she’s gained ten pounds. \n\nIt’s interesting how people can be affected differently by the same thing.",
      "created_utc": 1736365722.0,
      "score": 8,
      "context": [
        {
          "id": "m63duxu",
          "author": "jojubrius",
          "body": "I’ve been self medicating for appetite w weed since HS & have zero shame about it. (i live in oregon so daily usage is super normalized here for the most part)\n\nFor years doctors, psychiatrists, and therapists have advised I try to avoid weed because of their outdated knowledge on weed and bipolar ii— that is until i dropped down to like 90lbs and they all said something to the effect of “wow even as a cannabis user??” and i haven’t heard a peep from them about weed ever since 🥰",
          "created_utc": 1736362576.0
        }
      ]
    },
    {
      "id": "m63cmsh",
      "author": "Little_Bit_87",
      "body": "It seems to be working and most specialists keep saying if it works do it. But I think they are speaking to things like having cake for breakfast lol. I'm just worried I might be making it worse by using weed to cope with my disorder.",
      "created_utc": 1736362224.0,
      "score": 4,
      "context": [
        {
          "id": "m63bbfp",
          "author": "tiictacs",
          "body": "so it helps me eat and i do it all the time but my issues are not very sensory so it might be different",
          "created_utc": 1736361848.0
        }
      ]
    },
    {
      "id": "m63gbuk",
      "author": "Little_Bit_87",
      "body": "THIS! I have issues that don't allow me to drink much. New Year's is one of the special occasions that I do. One New Year's i had 4 glasses of champagne instead of my usual half glass. I was drunk and told I just ate a bell pepper and I didn't gag. I ran to the kitchen and tried every different veggie there was. My friend quickly cooked me up a sheet pan of zucchini and asparagus. I ate the whole 20\"x20\" sheet pan of veggies. Then I tried broccoli cooked and raw with ranch. It didn't make me gag or freak out but then I tried an onion and it was game over. My stomach definitely didn't like me the next day 🤣",
      "created_utc": 1736363289.0,
      "score": 5,
      "context": [
        {
          "id": "m63d7z4",
          "author": "shitz_brickz",
          "body": "It helps me eat food I already like, but I have actually found alcohol suppresses the sensory issues much more, which is the major issue for me. Goes both ways, I have eaten food and gotten violently ill once I sobered up but still had the food in me, I have also eaten food I was previously afraid to try and now am able to eat small portions of while sober.",
          "created_utc": 1736362393.0
        }
      ]
    },
    {
      "id": "m63izgk",
      "author": "Little_Bit_87",
      "body": "Lol same that's how I found it was helping with ARFID.",
      "created_utc": 1736364059.0,
      "score": 3,
      "context": [
        {
          "id": "m63i6c2",
          "author": "ResurgentClusterfuck",
          "body": "It works for me, but ARFID isn't the only condition I have that's helped by cannabis \n\nFor some people, it can stop working, have an opposite effect, or cause CHS",
          "created_utc": 1736363822.0
        }
      ]
    },
    {
      "id": "m661m2q",
      "author": "Big-Formal408",
      "body": "I have GI issues that cause extreme chronic nausea and vomiting in addition to ARFID too and weed has literally saved my life with how it can reduce nausea and stimulate appetite. It also helps with my general anxiety surrounding food and allows me to eat a little more freely. I get zofran and promethazine prescribed every month but my GI issues already include terrible constipation so I really try to avoid the zofran and go with the promethazine if I'm okay with potentially feeling drowsy and able to keep the pill down. And then I can take a promethazine suppository if neither one is working. That being said, I have to take zofran almost daily when I stop smoking and it sucks!!!",
      "created_utc": 1736393033.0,
      "score": 3,
      "context": [
        {
          "id": "m63itub",
          "author": "None",
          "body": "it's my go to when i'm struggling.  i also have health issues that cause chronic nausea, so it's really a life saver for me.  i take tolerance breaks sometimes and that can be rough, but it's worth it to me!",
          "created_utc": 1736364013.0
        }
      ]
    },
    {
      "id": "m63jx0m",
      "author": "Little_Bit_87",
      "body": "When I switched from Kaiser to the VA I asked for a prescription for zofran. I had only gotten them 10 at a time my whole life. To make matters even better I didn't have to fight for me. I was asked if I had nausea and I said yes and he asked if it could be related to another issues we weren't working on and I said no and he prescribed it. When I got it in the mail it was the whole bottle the pharmacy uses to fill a prescription. 30 count with 4 refills!",
      "created_utc": 1736364326.0,
      "score": 2,
      "context": [
        {
          "id": "m63itub",
          "author": "None",
          "body": "it's my go to when i'm struggling.  i also have health issues that cause chronic nausea, so it's really a life saver for me.  i take tolerance breaks sometimes and that can be rough, but it's worth it to me!",
          "created_utc": 1736364013.0
        }
      ]
    },
    {
      "id": "m63hj9j",
      "author": "Little_Bit_87",
      "body": "Sorry to hear that, allergies are the worst! I hope it hasn't been too bad this year for you. Sending positive antihistamine vibes your way.",
      "created_utc": 1736363638.0,
      "score": 2,
      "context": [
        {
          "id": "m63dv4s",
          "author": "None",
          "body": "Marijuana is the best solution I ever found. I am currently taking a break from it for allergy season and I am dropping weight again",
          "created_utc": 1736362578.0
        }
      ]
    },
    {
      "id": "m63k4z1",
      "author": "Little_Bit_87",
      "body": "Lol why does everyone like sativa these days. I'm indacouch all the way!",
      "created_utc": 1736364390.0,
      "score": 1,
      "context": [
        {
          "id": "m63j54x",
          "author": "Krystali3n",
          "body": "I mean use it if you like it, but in my experience it doesn’t help with ARFID. I smoke daily and it does help with appetite but I feel like it would make texture issues worse, if anything. If you try it for ARFID specifically, get a heavy indica because sativa can make you anxious and overthink.",
          "created_utc": 1736364105.0
        }
      ]
    },
    {
      "id": "m63j1q1",
      "author": "None",
      "body": "it depends fully on the individual",
      "created_utc": 1736364077.0,
      "score": 5,
      "context": [
        {
          "id": "m63h17d",
          "author": "Blujay12",
          "body": "DO NOT.\n\nIt works, for a while, full regular appetite, wider tastes, but then you need it to be able to eat at all.\n\nI still can't eat in the first half of the day without being sick, work lunches are obviously difficult, and now it barely works, if it ever does. Most I get is a light dinner, even optimal conditions I'm eating a fair bit less than I did before I did anything, which was far from excess in the first place lol\n\nI got maybe 4-5 months of doing this, before it went neutralish, coasted like that for another 5-6 or so, and now it's a year later, trying to whittle down my addiction, and fix my body.",
          "created_utc": 1736363492.0
        }
      ]
    },
    {
      "id": "m63i2we",
      "author": "Little_Bit_87",
      "body": "This is a concern for me. I've been lucky with high use (for chronic pain) for years, it hasn't stopped working for the munchies. In fact I don't know I'm high till I get the munchies because I no longer get the \"high\" feeling anymore.",
      "created_utc": 1736363795.0,
      "score": 2,
      "context": [
        {
          "id": "m63h17d",
          "author": "Blujay12",
          "body": "DO NOT.\n\nIt works, for a while, full regular appetite, wider tastes, but then you need it to be able to eat at all.\n\nI still can't eat in the first half of the day without being sick, work lunches are obviously difficult, and now it barely works, if it ever does. Most I get is a light dinner, even optimal conditions I'm eating a fair bit less than I did before I did anything, which was far from excess in the first place lol\n\nI got maybe 4-5 months of doing this, before it went neutralish, coasted like that for another 5-6 or so, and now it's a year later, trying to whittle down my addiction, and fix my body.",
          "created_utc": 1736363492.0
        }
      ]
    },
    {
      "id": "m63ocxq",
      "author": "Little_Bit_87",
      "body": "I'm so glad it has been so good for you. Keep it up. Also since you mentioned attention span, now is the time to unclench your jaw 🤣 IYKYK",
      "created_utc": 1736365614.0,
      "score": 1,
      "context": [
        {
          "id": "m63lz55",
          "author": "killrtaco",
          "body": "Helps my appetite and my attention span. Smoke every day throughout the day as needed. My life has significantly improved in the 4 years I've been doing so.",
          "created_utc": 1736364925.0
        }
      ]
    },
    {
      "id": "m682po6",
      "author": "Little_Bit_87",
      "body": "Luckily I have never experienced them with weed, caffeine on the other hand lol you'd think I was kicking heroin not soda lol",
      "created_utc": 1736430804.0,
      "score": 1,
      "context": [
        {
          "id": "m64aqs9",
          "author": "MoodOk8885",
          "body": "Withdrawals make it worse in my experience",
          "created_utc": 1736372121.0
        }
      ]
    },
    {
      "id": "m64tv06",
      "author": "BuildingOk6614",
      "body": "This is my experience as well 😞\nAs well as the fact that not all strains will give you the munchies.",
      "created_utc": 1736377924.0,
      "score": 6,
      "context": [
        {
          "id": "m63c5qc",
          "author": "acrobatic_lion",
          "body": "Cannabis works to increase your appetite and make eating easier… until it doesn’t. And then you’re really screwed, because it can feel like a crutch that suddenly stops working. \n\nIn my experience, it’s okay to use cannabis for this purpose short term/intermittently — but NOT to develop a reliance on cannabis to eat. Because there always comes a day when even the cannabis doesn’t help, and then im really shit out of luck.",
          "created_utc": 1736362089.0
        },
        {
          "id": "m63ejba",
          "author": "MyMoreOriginalName",
          "body": "This was my experience with it as well. it helped initially but the more I used it, the less it worked and now it doesn't do anything for my hunger at all. In fact, for a bit, I used it as a way to numb the hunger so I wouldn't have to eat as much and well you can probably guess how well that all went",
          "created_utc": 1736362771.0
        }
      ]
    },
    {
      "id": "m63hpxa",
      "author": "severedspearhead",
      "body": "Having a very high CBD strain helps more with hunger than high THC strains. CBD generally is the thing which helps with hunger (along with how the terpenes work as well). I use cannabis for ARFID but i make sure to take regular T breaks and take only enough to get hungry not high. Miritazipine as a prescription drug is also something i use for sleep and appetite and my doctor prescribed it to me. Between both of those my ARFID is like 65-70% handled. And I'm making slow progress with weight gain",
      "created_utc": 1736363691.0,
      "score": 15,
      "context": [
        {
          "id": "m63c5qc",
          "author": "acrobatic_lion",
          "body": "Cannabis works to increase your appetite and make eating easier… until it doesn’t. And then you’re really screwed, because it can feel like a crutch that suddenly stops working. \n\nIn my experience, it’s okay to use cannabis for this purpose short term/intermittently — but NOT to develop a reliance on cannabis to eat. Because there always comes a day when even the cannabis doesn’t help, and then im really shit out of luck.",
          "created_utc": 1736362089.0
        },
        {
          "id": "m63e0jj",
          "author": "Little_Bit_87",
          "body": "Yeah tolerance is definitely a fear of mine. There are countless ways to suppress apatite, but not much out there that increases apatite.",
          "created_utc": 1736362621.0
        }
      ]
    },
    {
      "id": "m681ykm",
      "author": "Little_Bit_87",
      "body": "Yeah luckily for me taking a break is easy. For whatever the reason to motivate it, I just stop. Only issue I have is if I smell it I miss it, but I don't partake unless I've reached my objective. Unfortunately I never get the high/stoned feeling back, but I do it anyways for my health.",
      "created_utc": 1736430527.0,
      "score": 1,
      "context": [
        {
          "id": "m63c5qc",
          "author": "acrobatic_lion",
          "body": "Cannabis works to increase your appetite and make eating easier… until it doesn’t. And then you’re really screwed, because it can feel like a crutch that suddenly stops working. \n\nIn my experience, it’s okay to use cannabis for this purpose short term/intermittently — but NOT to develop a reliance on cannabis to eat. Because there always comes a day when even the cannabis doesn’t help, and then im really shit out of luck.",
          "created_utc": 1736362089.0
        },
        {
          "id": "m654jdf",
          "author": "39dayou",
          "body": "i agree !! for me it was super helpful until my tolerance shot up and i became a bit dependent on it yet it wouldn’t work anymore because of the high tolerance. i’m on a break atm and planning to go back cuz it rlly does help me entirely w the anxieties and lack of appetite. it’s just abt knowing when to take breaks or how much u personally need :)",
          "created_utc": 1736381506.0
        }
      ]
    },
    {
      "id": "m653vpg",
      "author": "itmeonetwothree",
      "body": "I am SO blessed with my psychiatrist whose main goal is for me to be off meds and has unofficially recommended microdosing for my depression. It makes me so sad that everyone doesn’t have a mental health provider like her.",
      "created_utc": 1736381283.0,
      "score": 3,
      "context": [
        {
          "id": "m63duxu",
          "author": "jojubrius",
          "body": "I’ve been self medicating for appetite w weed since HS & have zero shame about it. (i live in oregon so daily usage is super normalized here for the most part)\n\nFor years doctors, psychiatrists, and therapists have advised I try to avoid weed because of their outdated knowledge on weed and bipolar ii— that is until i dropped down to like 90lbs and they all said something to the effect of “wow even as a cannabis user??” and i haven’t heard a peep from them about weed ever since 🥰",
          "created_utc": 1736362576.0
        },
        {
          "id": "m63h101",
          "author": "Little_Bit_87",
          "body": "Yeah I tell my doctors I smoke, but never say a word about it to anyone in mental health lol I'm not about to listen to another speech. I've done it both ways and know what works and what doesn't. \n\nAlso HELLO DOWN THERE lol I'm your northern neighbor (small town 15 miles NE of Seattle)",
          "created_utc": 1736363491.0
        }
      ]
    },
    {
      "id": "m63cumj",
      "author": "tiictacs",
      "body": "i get what you’re saying, but weed can be medicinal it’s a point of view kind of thing",
      "created_utc": 1736362288.0,
      "score": 5,
      "context": [
        {
          "id": "m63bbfp",
          "author": "tiictacs",
          "body": "so it helps me eat and i do it all the time but my issues are not very sensory so it might be different",
          "created_utc": 1736361848.0
        },
        {
          "id": "m63cmsh",
          "author": "Little_Bit_87",
          "body": "It seems to be working and most specialists keep saying if it works do it. But I think they are speaking to things like having cake for breakfast lol. I'm just worried I might be making it worse by using weed to cope with my disorder.",
          "created_utc": 1736362224.0
        }
      ]
    },
    {
      "id": "m64f6yi",
      "author": "ResurgentClusterfuck",
      "body": "I've found that certain strains are *amazing* for making me want to eat even when nothing else worked\n\nLike I didn't gain weight on Depo or even on antidepressants, but I'll drop weight without cannabis (I am underweight and have been all my life)",
      "created_utc": 1736373397.0,
      "score": 2,
      "context": [
        {
          "id": "m63i6c2",
          "author": "ResurgentClusterfuck",
          "body": "It works for me, but ARFID isn't the only condition I have that's helped by cannabis \n\nFor some people, it can stop working, have an opposite effect, or cause CHS",
          "created_utc": 1736363822.0
        },
        {
          "id": "m63izgk",
          "author": "Little_Bit_87",
          "body": "Lol same that's how I found it was helping with ARFID.",
          "created_utc": 1736364059.0
        }
      ]
    },
    {
      "id": "m63km6z",
      "author": "None",
      "body": "i use zofran sometimes for really severe nausea but my nausea is daily :( and daily zofran can cause constipation unfortunately. it’s a great medication though and has been a live-safer for sure",
      "created_utc": 1736364527.0,
      "score": 4,
      "context": [
        {
          "id": "m63itub",
          "author": "None",
          "body": "it's my go to when i'm struggling.  i also have health issues that cause chronic nausea, so it's really a life saver for me.  i take tolerance breaks sometimes and that can be rough, but it's worth it to me!",
          "created_utc": 1736364013.0
        },
        {
          "id": "m63jx0m",
          "author": "Little_Bit_87",
          "body": "When I switched from Kaiser to the VA I asked for a prescription for zofran. I had only gotten them 10 at a time my whole life. To make matters even better I didn't have to fight for me. I was asked if I had nausea and I said yes and he asked if it could be related to another issues we weren't working on and I said no and he prescribed it. When I got it in the mail it was the whole bottle the pharmacy uses to fill a prescription. 30 count with 4 refills!",
          "created_utc": 1736364326.0
        }
      ]
    },
    {
      "id": "m63i00n",
      "author": "None",
      "body": "Thanks, it's the combination of allergies and asthma. I know that it's just December and January (maybe part of February). So it's a tradeoff between eating and breathing. I can't get away with not breathing but I can get away with eating less for a couple months",
      "created_utc": 1736363772.0,
      "score": 6,
      "context": [
        {
          "id": "m63dv4s",
          "author": "None",
          "body": "Marijuana is the best solution I ever found. I am currently taking a break from it for allergy season and I am dropping weight again",
          "created_utc": 1736362578.0
        },
        {
          "id": "m63hj9j",
          "author": "Little_Bit_87",
          "body": "Sorry to hear that, allergies are the worst! I hope it hasn't been too bad this year for you. Sending positive antihistamine vibes your way.",
          "created_utc": 1736363638.0
        }
      ]
    },
    {
      "id": "m63mmnn",
      "author": "Little_Bit_87",
      "body": "I totally agree, but also see both sides. While it is different for everyone the only absolute is nothing is good in high quantities for extended period. Hell even over hydrating can be bad.",
      "created_utc": 1736365114.0,
      "score": 2,
      "context": [
        {
          "id": "m63h17d",
          "author": "Blujay12",
          "body": "DO NOT.\n\nIt works, for a while, full regular appetite, wider tastes, but then you need it to be able to eat at all.\n\nI still can't eat in the first half of the day without being sick, work lunches are obviously difficult, and now it barely works, if it ever does. Most I get is a light dinner, even optimal conditions I'm eating a fair bit less than I did before I did anything, which was far from excess in the first place lol\n\nI got maybe 4-5 months of doing this, before it went neutralish, coasted like that for another 5-6 or so, and now it's a year later, trying to whittle down my addiction, and fix my body.",
          "created_utc": 1736363492.0
        },
        {
          "id": "m63j1q1",
          "author": "None",
          "body": "it depends fully on the individual",
          "created_utc": 1736364077.0
        }
      ]
    },
    {
      "id": "m63lfvc",
      "author": "Blujay12",
      "body": "Sure, but letting people run themselves into the ground all while covering our ears and saying \"it's natural, it's non-addictive, it's perfectly healthy\", when you have thousands of stories like mine.\n\nI'm not trying to demonize it or anything, but the ignorance to the negatives led me to where I'm at, I'd rather not see more people burn out (HAH) like me.",
      "created_utc": 1736364770.0,
      "score": 2,
      "context": [
        {
          "id": "m63h17d",
          "author": "Blujay12",
          "body": "DO NOT.\n\nIt works, for a while, full regular appetite, wider tastes, but then you need it to be able to eat at all.\n\nI still can't eat in the first half of the day without being sick, work lunches are obviously difficult, and now it barely works, if it ever does. Most I get is a light dinner, even optimal conditions I'm eating a fair bit less than I did before I did anything, which was far from excess in the first place lol\n\nI got maybe 4-5 months of doing this, before it went neutralish, coasted like that for another 5-6 or so, and now it's a year later, trying to whittle down my addiction, and fix my body.",
          "created_utc": 1736363492.0
        },
        {
          "id": "m63j1q1",
          "author": "None",
          "body": "it depends fully on the individual",
          "created_utc": 1736364077.0
        }
      ]
    },
    {
      "id": "m63jkae",
      "author": "Blujay12",
      "body": "Yeah you're already 3 steps up the ladder then, that's your red flashing DEFCON alarm system, if you can't tell when you've started and you've stopped, you NEED a full tolerance break week minimum, not only just to reset that dependancy/tolerance, but also just in general while you still can.\n\nOnce you're getting in that range, it starts to become an issue of getting withdrawl symptoms, even ignoring your new dependancy, especially if you have depression, or ASD/ADHD, your brain will rely on it for serotonin. That's the stage I'm at, I'm closer to the alcoholics that quit cold turkey. Stomach pains in the range of 6-8, migraines, mood swings, somehow WORSE brain fog.\n\nI'm not trying to scare you, but I kinda am? Because nobody scared me enough, and I got cocky \"since it's totally not addictive, it's natural, and it's safe!\"\n\nIf you end up getting withdrawl and can't do a proper tolerance break, best I can offer is to give yourself a start time that moves later and later in the evening, and then try and alternate days, with that time expanding over time.",
      "created_utc": 1736364225.0,
      "score": 0,
      "context": [
        {
          "id": "m63h17d",
          "author": "Blujay12",
          "body": "DO NOT.\n\nIt works, for a while, full regular appetite, wider tastes, but then you need it to be able to eat at all.\n\nI still can't eat in the first half of the day without being sick, work lunches are obviously difficult, and now it barely works, if it ever does. Most I get is a light dinner, even optimal conditions I'm eating a fair bit less than I did before I did anything, which was far from excess in the first place lol\n\nI got maybe 4-5 months of doing this, before it went neutralish, coasted like that for another 5-6 or so, and now it's a year later, trying to whittle down my addiction, and fix my body.",
          "created_utc": 1736363492.0
        },
        {
          "id": "m63i2we",
          "author": "Little_Bit_87",
          "body": "This is a concern for me. I've been lucky with high use (for chronic pain) for years, it hasn't stopped working for the munchies. In fact I don't know I'm high till I get the munchies because I no longer get the \"high\" feeling anymore.",
          "created_utc": 1736363795.0
        }
      ]
    },
    {
      "id": "m66gf5f",
      "author": "MyMoreOriginalName",
      "body": "Yup, and when it did work like that I always had a hard time finding the same strain I mightve had last week because my stores didn't often get the same stuff every week. Sorry to hear you're going through this too. It definitely sucks 😔",
      "created_utc": 1736399200.0,
      "score": 4,
      "context": [
        {
          "id": "m63c5qc",
          "author": "acrobatic_lion",
          "body": "Cannabis works to increase your appetite and make eating easier… until it doesn’t. And then you’re really screwed, because it can feel like a crutch that suddenly stops working. \n\nIn my experience, it’s okay to use cannabis for this purpose short term/intermittently — but NOT to develop a reliance on cannabis to eat. Because there always comes a day when even the cannabis doesn’t help, and then im really shit out of luck.",
          "created_utc": 1736362089.0
        },
        {
          "id": "m63ejba",
          "author": "MyMoreOriginalName",
          "body": "This was my experience with it as well. it helped initially but the more I used it, the less it worked and now it doesn't do anything for my hunger at all. In fact, for a bit, I used it as a way to numb the hunger so I wouldn't have to eat as much and well you can probably guess how well that all went",
          "created_utc": 1736362771.0
        },
        {
          "id": "m64tv06",
          "author": "BuildingOk6614",
          "body": "This is my experience as well 😞\nAs well as the fact that not all strains will give you the munchies.",
          "created_utc": 1736377924.0
        }
      ]
    },
    {
      "id": "m63j4vu",
      "author": "kissedbyvampires",
      "body": "can second the miritazipine thing. got prescribed it a couple years ago for my depression and it made me gain 10lbs in a month because of the appetite inducing side effect. first month is the worst, and then it levels out. should mention i lost a ton of weight because of my depression and the medication put me back at my baseline weight. \n\ni have never been so hungry before in my life. even the strongest munchies from cannabis i’ve had can’t compete to the medication. like i said though, it goes to manageable levels after a month or so. i cried because i never felt full the first month and that was like with 4-5 meals a day.",
      "created_utc": 1736364103.0,
      "score": 7,
      "context": [
        {
          "id": "m63c5qc",
          "author": "acrobatic_lion",
          "body": "Cannabis works to increase your appetite and make eating easier… until it doesn’t. And then you’re really screwed, because it can feel like a crutch that suddenly stops working. \n\nIn my experience, it’s okay to use cannabis for this purpose short term/intermittently — but NOT to develop a reliance on cannabis to eat. Because there always comes a day when even the cannabis doesn’t help, and then im really shit out of luck.",
          "created_utc": 1736362089.0
        },
        {
          "id": "m63e0jj",
          "author": "Little_Bit_87",
          "body": "Yeah tolerance is definitely a fear of mine. There are countless ways to suppress apatite, but not much out there that increases apatite.",
          "created_utc": 1736362621.0
        },
        {
          "id": "m63hpxa",
          "author": "severedspearhead",
          "body": "Having a very high CBD strain helps more with hunger than high THC strains. CBD generally is the thing which helps with hunger (along with how the terpenes work as well). I use cannabis for ARFID but i make sure to take regular T breaks and take only enough to get hungry not high. Miritazipine as a prescription drug is also something i use for sleep and appetite and my doctor prescribed it to me. Between both of those my ARFID is like 65-70% handled. And I'm making slow progress with weight gain",
          "created_utc": 1736363691.0
        }
      ]
    },
    {
      "id": "m63ig69",
      "author": "Little_Bit_87",
      "body": "Yeah I definitely lean towards high CBD as it seems to help better for anxiety.",
      "created_utc": 1736363900.0,
      "score": 1,
      "context": [
        {
          "id": "m63c5qc",
          "author": "acrobatic_lion",
          "body": "Cannabis works to increase your appetite and make eating easier… until it doesn’t. And then you’re really screwed, because it can feel like a crutch that suddenly stops working. \n\nIn my experience, it’s okay to use cannabis for this purpose short term/intermittently — but NOT to develop a reliance on cannabis to eat. Because there always comes a day when even the cannabis doesn’t help, and then im really shit out of luck.",
          "created_utc": 1736362089.0
        },
        {
          "id": "m63e0jj",
          "author": "Little_Bit_87",
          "body": "Yeah tolerance is definitely a fear of mine. There are countless ways to suppress apatite, but not much out there that increases apatite.",
          "created_utc": 1736362621.0
        },
        {
          "id": "m63hpxa",
          "author": "severedspearhead",
          "body": "Having a very high CBD strain helps more with hunger than high THC strains. CBD generally is the thing which helps with hunger (along with how the terpenes work as well). I use cannabis for ARFID but i make sure to take regular T breaks and take only enough to get hungry not high. Miritazipine as a prescription drug is also something i use for sleep and appetite and my doctor prescribed it to me. Between both of those my ARFID is like 65-70% handled. And I'm making slow progress with weight gain",
          "created_utc": 1736363691.0
        }
      ]
    },
    {
      "id": "m63eug9",
      "author": "Little_Bit_87",
      "body": "It definitely is. I am so glad I used it for pain because I would have ended up addicted to pills if I didn't. But one of my constant fears is that I'm doing something that I'm doing something that enforces ARFID because I have worked insanely hard for minimal improvement.",
      "created_utc": 1736362858.0,
      "score": 2,
      "context": [
        {
          "id": "m63bbfp",
          "author": "tiictacs",
          "body": "so it helps me eat and i do it all the time but my issues are not very sensory so it might be different",
          "created_utc": 1736361848.0
        },
        {
          "id": "m63cmsh",
          "author": "Little_Bit_87",
          "body": "It seems to be working and most specialists keep saying if it works do it. But I think they are speaking to things like having cake for breakfast lol. I'm just worried I might be making it worse by using weed to cope with my disorder.",
          "created_utc": 1736362224.0
        },
        {
          "id": "m63cumj",
          "author": "tiictacs",
          "body": "i get what you’re saying, but weed can be medicinal it’s a point of view kind of thing",
          "created_utc": 1736362288.0
        }
      ]
    },
    {
      "id": "m63lvkl",
      "author": "Little_Bit_87",
      "body": "I just use it when it gets bad. Luckily it has lasted me 5 months so far. But thank you for the warning I never knew that about it.",
      "created_utc": 1736364896.0,
      "score": 3,
      "context": [
        {
          "id": "m63itub",
          "author": "None",
          "body": "it's my go to when i'm struggling.  i also have health issues that cause chronic nausea, so it's really a life saver for me.  i take tolerance breaks sometimes and that can be rough, but it's worth it to me!",
          "created_utc": 1736364013.0
        },
        {
          "id": "m63jx0m",
          "author": "Little_Bit_87",
          "body": "When I switched from Kaiser to the VA I asked for a prescription for zofran. I had only gotten them 10 at a time my whole life. To make matters even better I didn't have to fight for me. I was asked if I had nausea and I said yes and he asked if it could be related to another issues we weren't working on and I said no and he prescribed it. When I got it in the mail it was the whole bottle the pharmacy uses to fill a prescription. 30 count with 4 refills!",
          "created_utc": 1736364326.0
        },
        {
          "id": "m63km6z",
          "author": "None",
          "body": "i use zofran sometimes for really severe nausea but my nausea is daily :( and daily zofran can cause constipation unfortunately. it’s a great medication though and has been a live-safer for sure",
          "created_utc": 1736364527.0
        }
      ]
    },
    {
      "id": "m63ism6",
      "author": "Little_Bit_87",
      "body": "I feel you there. When I tell people the wet season is my allergy season they laugh. And the asthma coughing fits in the winter has everyone looking at you like you have the plague 🤣",
      "created_utc": 1736364003.0,
      "score": 1,
      "context": [
        {
          "id": "m63dv4s",
          "author": "None",
          "body": "Marijuana is the best solution I ever found. I am currently taking a break from it for allergy season and I am dropping weight again",
          "created_utc": 1736362578.0
        },
        {
          "id": "m63hj9j",
          "author": "Little_Bit_87",
          "body": "Sorry to hear that, allergies are the worst! I hope it hasn't been too bad this year for you. Sending positive antihistamine vibes your way.",
          "created_utc": 1736363638.0
        },
        {
          "id": "m63i00n",
          "author": "None",
          "body": "Thanks, it's the combination of allergies and asthma. I know that it's just December and January (maybe part of February). So it's a tradeoff between eating and breathing. I can't get away with not breathing but I can get away with eating less for a couple months",
          "created_utc": 1736363772.0
        }
      ]
    },
    {
      "id": "m63mh95",
      "author": "None",
      "body": "it just seems a bit like you are demonizing it with the all caps “DO NOT” when there are thousands of stories (like mine) that support it being useful. it truly is a case by case situation and scare tactics like that aren’t helpful imo\n\nedited to say i was polite and stating my point and you block me after getting the last word in?  wow.  mature!",
      "created_utc": 1736365071.0,
      "score": 3,
      "context": [
        {
          "id": "m63h17d",
          "author": "Blujay12",
          "body": "DO NOT.\n\nIt works, for a while, full regular appetite, wider tastes, but then you need it to be able to eat at all.\n\nI still can't eat in the first half of the day without being sick, work lunches are obviously difficult, and now it barely works, if it ever does. Most I get is a light dinner, even optimal conditions I'm eating a fair bit less than I did before I did anything, which was far from excess in the first place lol\n\nI got maybe 4-5 months of doing this, before it went neutralish, coasted like that for another 5-6 or so, and now it's a year later, trying to whittle down my addiction, and fix my body.",
          "created_utc": 1736363492.0
        },
        {
          "id": "m63j1q1",
          "author": "None",
          "body": "it depends fully on the individual",
          "created_utc": 1736364077.0
        },
        {
          "id": "m63lfvc",
          "author": "Blujay12",
          "body": "Sure, but letting people run themselves into the ground all while covering our ears and saying \"it's natural, it's non-addictive, it's perfectly healthy\", when you have thousands of stories like mine.\n\nI'm not trying to demonize it or anything, but the ignorance to the negatives led me to where I'm at, I'd rather not see more people burn out (HAH) like me.",
          "created_utc": 1736364770.0
        }
      ]
    },
    {
      "id": "m63lhqt",
      "author": "Little_Bit_87",
      "body": "I do have T breaks when needed. When I lived in a not legal state I threw away my vape pen at the rest stop before the state line. Went 2 years. Plus I do it for employment and asthma. Even after 2 years I didn't get the high back. Even after moving I had been a heavy smoker for years and going cold turkey like that I had no signs of withdrawal psychologically or physically. The only thing I dealt with in the 2 years was when I smelt it I missed it but I worked at a school and couldn't risk getting a charge so I never did.",
      "created_utc": 1736364786.0,
      "score": 2,
      "context": [
        {
          "id": "m63h17d",
          "author": "Blujay12",
          "body": "DO NOT.\n\nIt works, for a while, full regular appetite, wider tastes, but then you need it to be able to eat at all.\n\nI still can't eat in the first half of the day without being sick, work lunches are obviously difficult, and now it barely works, if it ever does. Most I get is a light dinner, even optimal conditions I'm eating a fair bit less than I did before I did anything, which was far from excess in the first place lol\n\nI got maybe 4-5 months of doing this, before it went neutralish, coasted like that for another 5-6 or so, and now it's a year later, trying to whittle down my addiction, and fix my body.",
          "created_utc": 1736363492.0
        },
        {
          "id": "m63i2we",
          "author": "Little_Bit_87",
          "body": "This is a concern for me. I've been lucky with high use (for chronic pain) for years, it hasn't stopped working for the munchies. In fact I don't know I'm high till I get the munchies because I no longer get the \"high\" feeling anymore.",
          "created_utc": 1736363795.0
        },
        {
          "id": "m63jkae",
          "author": "Blujay12",
          "body": "Yeah you're already 3 steps up the ladder then, that's your red flashing DEFCON alarm system, if you can't tell when you've started and you've stopped, you NEED a full tolerance break week minimum, not only just to reset that dependancy/tolerance, but also just in general while you still can.\n\nOnce you're getting in that range, it starts to become an issue of getting withdrawl symptoms, even ignoring your new dependancy, especially if you have depression, or ASD/ADHD, your brain will rely on it for serotonin. That's the stage I'm at, I'm closer to the alcoholics that quit cold turkey. Stomach pains in the range of 6-8, migraines, mood swings, somehow WORSE brain fog.\n\nI'm not trying to scare you, but I kinda am? Because nobody scared me enough, and I got cocky \"since it's totally not addictive, it's natural, and it's safe!\"\n\nIf you end up getting withdrawl and can't do a proper tolerance break, best I can offer is to give yourself a start time that moves later and later in the evening, and then try and alternate days, with that time expanding over time.",
          "created_utc": 1736364225.0
        }
      ]
    },
    {
      "id": "m66jhzx",
      "author": "BuildingOk6614",
      "body": "Yes that’s my same problem too is getting more of what ever strain worked. I’m considering trying to quit now to see if that would be more help now that my tolerance is too high.",
      "created_utc": 1736400665.0,
      "score": 3,
      "context": [
        {
          "id": "m63c5qc",
          "author": "acrobatic_lion",
          "body": "Cannabis works to increase your appetite and make eating easier… until it doesn’t. And then you’re really screwed, because it can feel like a crutch that suddenly stops working. \n\nIn my experience, it’s okay to use cannabis for this purpose short term/intermittently — but NOT to develop a reliance on cannabis to eat. Because there always comes a day when even the cannabis doesn’t help, and then im really shit out of luck.",
          "created_utc": 1736362089.0
        },
        {
          "id": "m63ejba",
          "author": "MyMoreOriginalName",
          "body": "This was my experience with it as well. it helped initially but the more I used it, the less it worked and now it doesn't do anything for my hunger at all. In fact, for a bit, I used it as a way to numb the hunger so I wouldn't have to eat as much and well you can probably guess how well that all went",
          "created_utc": 1736362771.0
        },
        {
          "id": "m64tv06",
          "author": "BuildingOk6614",
          "body": "This is my experience as well 😞\nAs well as the fact that not all strains will give you the munchies.",
          "created_utc": 1736377924.0
        },
        {
          "id": "m66gf5f",
          "author": "MyMoreOriginalName",
          "body": "Yup, and when it did work like that I always had a hard time finding the same strain I mightve had last week because my stores didn't often get the same stuff every week. Sorry to hear you're going through this too. It definitely sucks 😔",
          "created_utc": 1736399200.0
        }
      ]
    },
    {
      "id": "m6816fy",
      "author": "Little_Bit_87",
      "body": "That's because strains are no longer strains anymore the way they're \"creating\" new strains isn't the same causing all the labels to be pointless these days. Current studies are saying that current genetics have become so muddy that there really isn't a pure indica or sativa anymore. Some researchers even ventured to say that the difference is so small that anyone who feels a drastic difference it's probably a psychological artifact.",
      "created_utc": 1736430234.0,
      "score": 3,
      "context": [
        {
          "id": "m63c5qc",
          "author": "acrobatic_lion",
          "body": "Cannabis works to increase your appetite and make eating easier… until it doesn’t. And then you’re really screwed, because it can feel like a crutch that suddenly stops working. \n\nIn my experience, it’s okay to use cannabis for this purpose short term/intermittently — but NOT to develop a reliance on cannabis to eat. Because there always comes a day when even the cannabis doesn’t help, and then im really shit out of luck.",
          "created_utc": 1736362089.0
        },
        {
          "id": "m63ejba",
          "author": "MyMoreOriginalName",
          "body": "This was my experience with it as well. it helped initially but the more I used it, the less it worked and now it doesn't do anything for my hunger at all. In fact, for a bit, I used it as a way to numb the hunger so I wouldn't have to eat as much and well you can probably guess how well that all went",
          "created_utc": 1736362771.0
        },
        {
          "id": "m64tv06",
          "author": "BuildingOk6614",
          "body": "This is my experience as well 😞\nAs well as the fact that not all strains will give you the munchies.",
          "created_utc": 1736377924.0
        },
        {
          "id": "m66gf5f",
          "author": "MyMoreOriginalName",
          "body": "Yup, and when it did work like that I always had a hard time finding the same strain I mightve had last week because my stores didn't often get the same stuff every week. Sorry to hear you're going through this too. It definitely sucks 😔",
          "created_utc": 1736399200.0
        }
      ]
    },
    {
      "id": "m63nc3h",
      "author": "Little_Bit_87",
      "body": "Yeah, unfortunately I was unable to tolerate it's side effects and it didn't do a thing for my depression. Odd that I didn't get the munchies on it.",
      "created_utc": 1736365318.0,
      "score": 5,
      "context": [
        {
          "id": "m63c5qc",
          "author": "acrobatic_lion",
          "body": "Cannabis works to increase your appetite and make eating easier… until it doesn’t. And then you’re really screwed, because it can feel like a crutch that suddenly stops working. \n\nIn my experience, it’s okay to use cannabis for this purpose short term/intermittently — but NOT to develop a reliance on cannabis to eat. Because there always comes a day when even the cannabis doesn’t help, and then im really shit out of luck.",
          "created_utc": 1736362089.0
        },
        {
          "id": "m63e0jj",
          "author": "Little_Bit_87",
          "body": "Yeah tolerance is definitely a fear of mine. There are countless ways to suppress apatite, but not much out there that increases apatite.",
          "created_utc": 1736362621.0
        },
        {
          "id": "m63hpxa",
          "author": "severedspearhead",
          "body": "Having a very high CBD strain helps more with hunger than high THC strains. CBD generally is the thing which helps with hunger (along with how the terpenes work as well). I use cannabis for ARFID but i make sure to take regular T breaks and take only enough to get hungry not high. Miritazipine as a prescription drug is also something i use for sleep and appetite and my doctor prescribed it to me. Between both of those my ARFID is like 65-70% handled. And I'm making slow progress with weight gain",
          "created_utc": 1736363691.0
        },
        {
          "id": "m63j4vu",
          "author": "kissedbyvampires",
          "body": "can second the miritazipine thing. got prescribed it a couple years ago for my depression and it made me gain 10lbs in a month because of the appetite inducing side effect. first month is the worst, and then it levels out. should mention i lost a ton of weight because of my depression and the medication put me back at my baseline weight. \n\ni have never been so hungry before in my life. even the strongest munchies from cannabis i’ve had can’t compete to the medication. like i said though, it goes to manageable levels after a month or so. i cried because i never felt full the first month and that was like with 4-5 meals a day.",
          "created_utc": 1736364103.0
        }
      ]
    },
    {
      "id": "m63fhed",
      "author": "tiictacs",
      "body": "i got my med card for other mental issues but it ended up helping me with food a lot. i think it can be a very helpful tool for some and if it helps you then it helps you \nthat’s just my opinion though of course",
      "created_utc": 1736363043.0,
      "score": 2,
      "context": [
        {
          "id": "m63bbfp",
          "author": "tiictacs",
          "body": "so it helps me eat and i do it all the time but my issues are not very sensory so it might be different",
          "created_utc": 1736361848.0
        },
        {
          "id": "m63cmsh",
          "author": "Little_Bit_87",
          "body": "It seems to be working and most specialists keep saying if it works do it. But I think they are speaking to things like having cake for breakfast lol. I'm just worried I might be making it worse by using weed to cope with my disorder.",
          "created_utc": 1736362224.0
        },
        {
          "id": "m63cumj",
          "author": "tiictacs",
          "body": "i get what you’re saying, but weed can be medicinal it’s a point of view kind of thing",
          "created_utc": 1736362288.0
        },
        {
          "id": "m63eug9",
          "author": "Little_Bit_87",
          "body": "It definitely is. I am so glad I used it for pain because I would have ended up addicted to pills if I didn't. But one of my constant fears is that I'm doing something that I'm doing something that enforces ARFID because I have worked insanely hard for minimal improvement.",
          "created_utc": 1736362858.0
        }
      ]
    },
    {
      "id": "m63ja1t",
      "author": "None",
      "body": "People do treat the coughing differently post 2020",
      "created_utc": 1736364144.0,
      "score": 2,
      "context": [
        {
          "id": "m63dv4s",
          "author": "None",
          "body": "Marijuana is the best solution I ever found. I am currently taking a break from it for allergy season and I am dropping weight again",
          "created_utc": 1736362578.0
        },
        {
          "id": "m63hj9j",
          "author": "Little_Bit_87",
          "body": "Sorry to hear that, allergies are the worst! I hope it hasn't been too bad this year for you. Sending positive antihistamine vibes your way.",
          "created_utc": 1736363638.0
        },
        {
          "id": "m63i00n",
          "author": "None",
          "body": "Thanks, it's the combination of allergies and asthma. I know that it's just December and January (maybe part of February). So it's a tradeoff between eating and breathing. I can't get away with not breathing but I can get away with eating less for a couple months",
          "created_utc": 1736363772.0
        },
        {
          "id": "m63ism6",
          "author": "Little_Bit_87",
          "body": "I feel you there. When I tell people the wet season is my allergy season they laugh. And the asthma coughing fits in the winter has everyone looking at you like you have the plague 🤣",
          "created_utc": 1736364003.0
        }
      ]
    },
    {
      "id": "m63n0rz",
      "author": "Blujay12",
      "body": "I don't think Devil's advocate arm chair arguments like this where you're just gonna run me in a circle for 10 comments, are helpful either, but here we are.",
      "created_utc": 1736365227.0,
      "score": -2,
      "context": [
        {
          "id": "m63h17d",
          "author": "Blujay12",
          "body": "DO NOT.\n\nIt works, for a while, full regular appetite, wider tastes, but then you need it to be able to eat at all.\n\nI still can't eat in the first half of the day without being sick, work lunches are obviously difficult, and now it barely works, if it ever does. Most I get is a light dinner, even optimal conditions I'm eating a fair bit less than I did before I did anything, which was far from excess in the first place lol\n\nI got maybe 4-5 months of doing this, before it went neutralish, coasted like that for another 5-6 or so, and now it's a year later, trying to whittle down my addiction, and fix my body.",
          "created_utc": 1736363492.0
        },
        {
          "id": "m63j1q1",
          "author": "None",
          "body": "it depends fully on the individual",
          "created_utc": 1736364077.0
        },
        {
          "id": "m63lfvc",
          "author": "Blujay12",
          "body": "Sure, but letting people run themselves into the ground all while covering our ears and saying \"it's natural, it's non-addictive, it's perfectly healthy\", when you have thousands of stories like mine.\n\nI'm not trying to demonize it or anything, but the ignorance to the negatives led me to where I'm at, I'd rather not see more people burn out (HAH) like me.",
          "created_utc": 1736364770.0
        },
        {
          "id": "m63mh95",
          "author": "None",
          "body": "it just seems a bit like you are demonizing it with the all caps “DO NOT” when there are thousands of stories (like mine) that support it being useful. it truly is a case by case situation and scare tactics like that aren’t helpful imo\n\nedited to say i was polite and stating my point and you block me after getting the last word in?  wow.  mature!",
          "created_utc": 1736365071.0
        }
      ]
    },
    {
      "id": "m63ndve",
      "author": "Blujay12",
      "body": "Hell yeah! I'm glad it works out great then! I just know the smoking community by large is pretty awful at the whole \"effects on your body and health\" part, especially long term.\n\nI'd rather be an annoying over-explainer than the dude going \"maaaan it's great! everyone should try it! it's different for everyone, so don't think about anything!!!\"",
      "created_utc": 1736365332.0,
      "score": 2,
      "context": [
        {
          "id": "m63h17d",
          "author": "Blujay12",
          "body": "DO NOT.\n\nIt works, for a while, full regular appetite, wider tastes, but then you need it to be able to eat at all.\n\nI still can't eat in the first half of the day without being sick, work lunches are obviously difficult, and now it barely works, if it ever does. Most I get is a light dinner, even optimal conditions I'm eating a fair bit less than I did before I did anything, which was far from excess in the first place lol\n\nI got maybe 4-5 months of doing this, before it went neutralish, coasted like that for another 5-6 or so, and now it's a year later, trying to whittle down my addiction, and fix my body.",
          "created_utc": 1736363492.0
        },
        {
          "id": "m63i2we",
          "author": "Little_Bit_87",
          "body": "This is a concern for me. I've been lucky with high use (for chronic pain) for years, it hasn't stopped working for the munchies. In fact I don't know I'm high till I get the munchies because I no longer get the \"high\" feeling anymore.",
          "created_utc": 1736363795.0
        },
        {
          "id": "m63jkae",
          "author": "Blujay12",
          "body": "Yeah you're already 3 steps up the ladder then, that's your red flashing DEFCON alarm system, if you can't tell when you've started and you've stopped, you NEED a full tolerance break week minimum, not only just to reset that dependancy/tolerance, but also just in general while you still can.\n\nOnce you're getting in that range, it starts to become an issue of getting withdrawl symptoms, even ignoring your new dependancy, especially if you have depression, or ASD/ADHD, your brain will rely on it for serotonin. That's the stage I'm at, I'm closer to the alcoholics that quit cold turkey. Stomach pains in the range of 6-8, migraines, mood swings, somehow WORSE brain fog.\n\nI'm not trying to scare you, but I kinda am? Because nobody scared me enough, and I got cocky \"since it's totally not addictive, it's natural, and it's safe!\"\n\nIf you end up getting withdrawl and can't do a proper tolerance break, best I can offer is to give yourself a start time that moves later and later in the evening, and then try and alternate days, with that time expanding over time.",
          "created_utc": 1736364225.0
        },
        {
          "id": "m63lhqt",
          "author": "Little_Bit_87",
          "body": "I do have T breaks when needed. When I lived in a not legal state I threw away my vape pen at the rest stop before the state line. Went 2 years. Plus I do it for employment and asthma. Even after 2 years I didn't get the high back. Even after moving I had been a heavy smoker for years and going cold turkey like that I had no signs of withdrawal psychologically or physically. The only thing I dealt with in the 2 years was when I smelt it I missed it but I worked at a school and couldn't risk getting a charge so I never did.",
          "created_utc": 1736364786.0
        }
      ]
    },
    {
      "id": "m66k5ae",
      "author": "MyMoreOriginalName",
      "body": "Well I wish you good luck. I've been cutting it out slowly myself, and while I haven't fully kicked it, I can at least say I'm worlds better than I was when I fully dependant on it. so it's absolutely doable",
      "created_utc": 1736400987.0,
      "score": 4,
      "context": [
        {
          "id": "m63c5qc",
          "author": "acrobatic_lion",
          "body": "Cannabis works to increase your appetite and make eating easier… until it doesn’t. And then you’re really screwed, because it can feel like a crutch that suddenly stops working. \n\nIn my experience, it’s okay to use cannabis for this purpose short term/intermittently — but NOT to develop a reliance on cannabis to eat. Because there always comes a day when even the cannabis doesn’t help, and then im really shit out of luck.",
          "created_utc": 1736362089.0
        },
        {
          "id": "m63ejba",
          "author": "MyMoreOriginalName",
          "body": "This was my experience with it as well. it helped initially but the more I used it, the less it worked and now it doesn't do anything for my hunger at all. In fact, for a bit, I used it as a way to numb the hunger so I wouldn't have to eat as much and well you can probably guess how well that all went",
          "created_utc": 1736362771.0
        },
        {
          "id": "m64tv06",
          "author": "BuildingOk6614",
          "body": "This is my experience as well 😞\nAs well as the fact that not all strains will give you the munchies.",
          "created_utc": 1736377924.0
        },
        {
          "id": "m66gf5f",
          "author": "MyMoreOriginalName",
          "body": "Yup, and when it did work like that I always had a hard time finding the same strain I mightve had last week because my stores didn't often get the same stuff every week. Sorry to hear you're going through this too. It definitely sucks 😔",
          "created_utc": 1736399200.0
        },
        {
          "id": "m66jhzx",
          "author": "BuildingOk6614",
          "body": "Yes that’s my same problem too is getting more of what ever strain worked. I’m considering trying to quit now to see if that would be more help now that my tolerance is too high.",
          "created_utc": 1736400665.0
        }
      ]
    },
    {
      "id": "m63yj9j",
      "author": "kissedbyvampires",
      "body": "feel yeah on the antidepressants thing. i get all the rare side effects and none of them help. have they tested your vitamin B12, D3, and/or ferritin levels? vitamin deficiencies are common in ARFID and can worsen depression symptoms significantly. i have low levels of all of those and i believe it’s part of the reason medication doesn’t help me.",
      "created_utc": 1736368590.0,
      "score": 4,
      "context": [
        {
          "id": "m63c5qc",
          "author": "acrobatic_lion",
          "body": "Cannabis works to increase your appetite and make eating easier… until it doesn’t. And then you’re really screwed, because it can feel like a crutch that suddenly stops working. \n\nIn my experience, it’s okay to use cannabis for this purpose short term/intermittently — but NOT to develop a reliance on cannabis to eat. Because there always comes a day when even the cannabis doesn’t help, and then im really shit out of luck.",
          "created_utc": 1736362089.0
        },
        {
          "id": "m63e0jj",
          "author": "Little_Bit_87",
          "body": "Yeah tolerance is definitely a fear of mine. There are countless ways to suppress apatite, but not much out there that increases apatite.",
          "created_utc": 1736362621.0
        },
        {
          "id": "m63hpxa",
          "author": "severedspearhead",
          "body": "Having a very high CBD strain helps more with hunger than high THC strains. CBD generally is the thing which helps with hunger (along with how the terpenes work as well). I use cannabis for ARFID but i make sure to take regular T breaks and take only enough to get hungry not high. Miritazipine as a prescription drug is also something i use for sleep and appetite and my doctor prescribed it to me. Between both of those my ARFID is like 65-70% handled. And I'm making slow progress with weight gain",
          "created_utc": 1736363691.0
        },
        {
          "id": "m63j4vu",
          "author": "kissedbyvampires",
          "body": "can second the miritazipine thing. got prescribed it a couple years ago for my depression and it made me gain 10lbs in a month because of the appetite inducing side effect. first month is the worst, and then it levels out. should mention i lost a ton of weight because of my depression and the medication put me back at my baseline weight. \n\ni have never been so hungry before in my life. even the strongest munchies from cannabis i’ve had can’t compete to the medication. like i said though, it goes to manageable levels after a month or so. i cried because i never felt full the first month and that was like with 4-5 meals a day.",
          "created_utc": 1736364103.0
        },
        {
          "id": "m63nc3h",
          "author": "Little_Bit_87",
          "body": "Yeah, unfortunately I was unable to tolerate it's side effects and it didn't do a thing for my depression. Odd that I didn't get the munchies on it.",
          "created_utc": 1736365318.0
        }
      ]
    },
    {
      "id": "m65qyih",
      "author": "miab2020",
      "body": "Had the same experience!! Had super high hopes but ended up with bad side effects and no appetite stimulation. But like everyone else is saying, my weed tolerance is insanely high and I can’t eat very much without it.",
      "created_utc": 1736389162.0,
      "score": 2,
      "context": [
        {
          "id": "m63c5qc",
          "author": "acrobatic_lion",
          "body": "Cannabis works to increase your appetite and make eating easier… until it doesn’t. And then you’re really screwed, because it can feel like a crutch that suddenly stops working. \n\nIn my experience, it’s okay to use cannabis for this purpose short term/intermittently — but NOT to develop a reliance on cannabis to eat. Because there always comes a day when even the cannabis doesn’t help, and then im really shit out of luck.",
          "created_utc": 1736362089.0
        },
        {
          "id": "m63e0jj",
          "author": "Little_Bit_87",
          "body": "Yeah tolerance is definitely a fear of mine. There are countless ways to suppress apatite, but not much out there that increases apatite.",
          "created_utc": 1736362621.0
        },
        {
          "id": "m63hpxa",
          "author": "severedspearhead",
          "body": "Having a very high CBD strain helps more with hunger than high THC strains. CBD generally is the thing which helps with hunger (along with how the terpenes work as well). I use cannabis for ARFID but i make sure to take regular T breaks and take only enough to get hungry not high. Miritazipine as a prescription drug is also something i use for sleep and appetite and my doctor prescribed it to me. Between both of those my ARFID is like 65-70% handled. And I'm making slow progress with weight gain",
          "created_utc": 1736363691.0
        },
        {
          "id": "m63j4vu",
          "author": "kissedbyvampires",
          "body": "can second the miritazipine thing. got prescribed it a couple years ago for my depression and it made me gain 10lbs in a month because of the appetite inducing side effect. first month is the worst, and then it levels out. should mention i lost a ton of weight because of my depression and the medication put me back at my baseline weight. \n\ni have never been so hungry before in my life. even the strongest munchies from cannabis i’ve had can’t compete to the medication. like i said though, it goes to manageable levels after a month or so. i cried because i never felt full the first month and that was like with 4-5 meals a day.",
          "created_utc": 1736364103.0
        },
        {
          "id": "m63nc3h",
          "author": "Little_Bit_87",
          "body": "Yeah, unfortunately I was unable to tolerate it's side effects and it didn't do a thing for my depression. Odd that I didn't get the munchies on it.",
          "created_utc": 1736365318.0
        }
      ]
    },
    {
      "id": "m63nzsp",
      "author": "Little_Bit_87",
      "body": "Over-explaining can be annoying in some situations, but it's benefits outweigh the negative. Some people might not know about it. Regardless if it helps someone at the time it will come up years later in a google search and help someone else.",
      "created_utc": 1736365508.0,
      "score": 2,
      "context": [
        {
          "id": "m63h17d",
          "author": "Blujay12",
          "body": "DO NOT.\n\nIt works, for a while, full regular appetite, wider tastes, but then you need it to be able to eat at all.\n\nI still can't eat in the first half of the day without being sick, work lunches are obviously difficult, and now it barely works, if it ever does. Most I get is a light dinner, even optimal conditions I'm eating a fair bit less than I did before I did anything, which was far from excess in the first place lol\n\nI got maybe 4-5 months of doing this, before it went neutralish, coasted like that for another 5-6 or so, and now it's a year later, trying to whittle down my addiction, and fix my body.",
          "created_utc": 1736363492.0
        },
        {
          "id": "m63i2we",
          "author": "Little_Bit_87",
          "body": "This is a concern for me. I've been lucky with high use (for chronic pain) for years, it hasn't stopped working for the munchies. In fact I don't know I'm high till I get the munchies because I no longer get the \"high\" feeling anymore.",
          "created_utc": 1736363795.0
        },
        {
          "id": "m63jkae",
          "author": "Blujay12",
          "body": "Yeah you're already 3 steps up the ladder then, that's your red flashing DEFCON alarm system, if you can't tell when you've started and you've stopped, you NEED a full tolerance break week minimum, not only just to reset that dependancy/tolerance, but also just in general while you still can.\n\nOnce you're getting in that range, it starts to become an issue of getting withdrawl symptoms, even ignoring your new dependancy, especially if you have depression, or ASD/ADHD, your brain will rely on it for serotonin. That's the stage I'm at, I'm closer to the alcoholics that quit cold turkey. Stomach pains in the range of 6-8, migraines, mood swings, somehow WORSE brain fog.\n\nI'm not trying to scare you, but I kinda am? Because nobody scared me enough, and I got cocky \"since it's totally not addictive, it's natural, and it's safe!\"\n\nIf you end up getting withdrawl and can't do a proper tolerance break, best I can offer is to give yourself a start time that moves later and later in the evening, and then try and alternate days, with that time expanding over time.",
          "created_utc": 1736364225.0
        },
        {
          "id": "m63lhqt",
          "author": "Little_Bit_87",
          "body": "I do have T breaks when needed. When I lived in a not legal state I threw away my vape pen at the rest stop before the state line. Went 2 years. Plus I do it for employment and asthma. Even after 2 years I didn't get the high back. Even after moving I had been a heavy smoker for years and going cold turkey like that I had no signs of withdrawal psychologically or physically. The only thing I dealt with in the 2 years was when I smelt it I missed it but I worked at a school and couldn't risk getting a charge so I never did.",
          "created_utc": 1736364786.0
        },
        {
          "id": "m63ndve",
          "author": "Blujay12",
          "body": "Hell yeah! I'm glad it works out great then! I just know the smoking community by large is pretty awful at the whole \"effects on your body and health\" part, especially long term.\n\nI'd rather be an annoying over-explainer than the dude going \"maaaan it's great! everyone should try it! it's different for everyone, so don't think about anything!!!\"",
          "created_utc": 1736365332.0
        }
      ]
    },
    {
      "id": "m66lmjh",
      "author": "BuildingOk6614",
      "body": "Thank you 😊 Odd, random, and probably totally coincidental, but I ordered a pair of these Calmers ear bud things, and just got them yesterday. Instructions say to wear them as much as possible the first 24hrs, I went all day today without smoking and less anxiety! I don’t think I’ll ever take them off if this continues to weirdly help somehow. Though of course this doesn’t help at all with my eating habits but who knows",
      "created_utc": 1736401736.0,
      "score": 4,
      "context": [
        {
          "id": "m63c5qc",
          "author": "acrobatic_lion",
          "body": "Cannabis works to increase your appetite and make eating easier… until it doesn’t. And then you’re really screwed, because it can feel like a crutch that suddenly stops working. \n\nIn my experience, it’s okay to use cannabis for this purpose short term/intermittently — but NOT to develop a reliance on cannabis to eat. Because there always comes a day when even the cannabis doesn’t help, and then im really shit out of luck.",
          "created_utc": 1736362089.0
        },
        {
          "id": "m63ejba",
          "author": "MyMoreOriginalName",
          "body": "This was my experience with it as well. it helped initially but the more I used it, the less it worked and now it doesn't do anything for my hunger at all. In fact, for a bit, I used it as a way to numb the hunger so I wouldn't have to eat as much and well you can probably guess how well that all went",
          "created_utc": 1736362771.0
        },
        {
          "id": "m64tv06",
          "author": "BuildingOk6614",
          "body": "This is my experience as well 😞\nAs well as the fact that not all strains will give you the munchies.",
          "created_utc": 1736377924.0
        },
        {
          "id": "m66gf5f",
          "author": "MyMoreOriginalName",
          "body": "Yup, and when it did work like that I always had a hard time finding the same strain I mightve had last week because my stores didn't often get the same stuff every week. Sorry to hear you're going through this too. It definitely sucks 😔",
          "created_utc": 1736399200.0
        },
        {
          "id": "m66jhzx",
          "author": "BuildingOk6614",
          "body": "Yes that’s my same problem too is getting more of what ever strain worked. I’m considering trying to quit now to see if that would be more help now that my tolerance is too high.",
          "created_utc": 1736400665.0
        },
        {
          "id": "m66k5ae",
          "author": "MyMoreOriginalName",
          "body": "Well I wish you good luck. I've been cutting it out slowly myself, and while I haven't fully kicked it, I can at least say I'm worlds better than I was when I fully dependant on it. so it's absolutely doable",
          "created_utc": 1736400987.0
        }
      ]
    },
    {
      "id": "m67y7cb",
      "author": "Little_Bit_87",
      "body": "My B12 is always good but my ferritin and iron fluctuate a lot. D3 is ALWAYS low but.... I live in Washington State, we only get our vitamin D when tourists bring it with them 🤣 Because of my sensory issues I am hyper aware of my body and tell immediately when somethings off so I usually have supplements on hand and take them right away. It always freaks my new partners out when they find the prenatal vitamins for the first time lol",
      "created_utc": 1736429091.0,
      "score": 3,
      "context": [
        {
          "id": "m63c5qc",
          "author": "acrobatic_lion",
          "body": "Cannabis works to increase your appetite and make eating easier… until it doesn’t. And then you’re really screwed, because it can feel like a crutch that suddenly stops working. \n\nIn my experience, it’s okay to use cannabis for this purpose short term/intermittently — but NOT to develop a reliance on cannabis to eat. Because there always comes a day when even the cannabis doesn’t help, and then im really shit out of luck.",
          "created_utc": 1736362089.0
        },
        {
          "id": "m63e0jj",
          "author": "Little_Bit_87",
          "body": "Yeah tolerance is definitely a fear of mine. There are countless ways to suppress apatite, but not much out there that increases apatite.",
          "created_utc": 1736362621.0
        },
        {
          "id": "m63hpxa",
          "author": "severedspearhead",
          "body": "Having a very high CBD strain helps more with hunger than high THC strains. CBD generally is the thing which helps with hunger (along with how the terpenes work as well). I use cannabis for ARFID but i make sure to take regular T breaks and take only enough to get hungry not high. Miritazipine as a prescription drug is also something i use for sleep and appetite and my doctor prescribed it to me. Between both of those my ARFID is like 65-70% handled. And I'm making slow progress with weight gain",
          "created_utc": 1736363691.0
        },
        {
          "id": "m63j4vu",
          "author": "kissedbyvampires",
          "body": "can second the miritazipine thing. got prescribed it a couple years ago for my depression and it made me gain 10lbs in a month because of the appetite inducing side effect. first month is the worst, and then it levels out. should mention i lost a ton of weight because of my depression and the medication put me back at my baseline weight. \n\ni have never been so hungry before in my life. even the strongest munchies from cannabis i’ve had can’t compete to the medication. like i said though, it goes to manageable levels after a month or so. i cried because i never felt full the first month and that was like with 4-5 meals a day.",
          "created_utc": 1736364103.0
        },
        {
          "id": "m63nc3h",
          "author": "Little_Bit_87",
          "body": "Yeah, unfortunately I was unable to tolerate it's side effects and it didn't do a thing for my depression. Odd that I didn't get the munchies on it.",
          "created_utc": 1736365318.0
        },
        {
          "id": "m63yj9j",
          "author": "kissedbyvampires",
          "body": "feel yeah on the antidepressants thing. i get all the rare side effects and none of them help. have they tested your vitamin B12, D3, and/or ferritin levels? vitamin deficiencies are common in ARFID and can worsen depression symptoms significantly. i have low levels of all of those and i believe it’s part of the reason medication doesn’t help me.",
          "created_utc": 1736368590.0
        }
      ]
    },
    {
      "id": "m67z54u",
      "author": "Little_Bit_87",
      "body": "For me lamotrigine has helped some, but it's a more dangerous option. The next step is TMS therapy because we have run out of approved drugs to try covered under the VA and Kaiser.",
      "created_utc": 1736429454.0,
      "score": 1,
      "context": [
        {
          "id": "m63c5qc",
          "author": "acrobatic_lion",
          "body": "Cannabis works to increase your appetite and make eating easier… until it doesn’t. And then you’re really screwed, because it can feel like a crutch that suddenly stops working. \n\nIn my experience, it’s okay to use cannabis for this purpose short term/intermittently — but NOT to develop a reliance on cannabis to eat. Because there always comes a day when even the cannabis doesn’t help, and then im really shit out of luck.",
          "created_utc": 1736362089.0
        },
        {
          "id": "m63e0jj",
          "author": "Little_Bit_87",
          "body": "Yeah tolerance is definitely a fear of mine. There are countless ways to suppress apatite, but not much out there that increases apatite.",
          "created_utc": 1736362621.0
        },
        {
          "id": "m63hpxa",
          "author": "severedspearhead",
          "body": "Having a very high CBD strain helps more with hunger than high THC strains. CBD generally is the thing which helps with hunger (along with how the terpenes work as well). I use cannabis for ARFID but i make sure to take regular T breaks and take only enough to get hungry not high. Miritazipine as a prescription drug is also something i use for sleep and appetite and my doctor prescribed it to me. Between both of those my ARFID is like 65-70% handled. And I'm making slow progress with weight gain",
          "created_utc": 1736363691.0
        },
        {
          "id": "m63j4vu",
          "author": "kissedbyvampires",
          "body": "can second the miritazipine thing. got prescribed it a couple years ago for my depression and it made me gain 10lbs in a month because of the appetite inducing side effect. first month is the worst, and then it levels out. should mention i lost a ton of weight because of my depression and the medication put me back at my baseline weight. \n\ni have never been so hungry before in my life. even the strongest munchies from cannabis i’ve had can’t compete to the medication. like i said though, it goes to manageable levels after a month or so. i cried because i never felt full the first month and that was like with 4-5 meals a day.",
          "created_utc": 1736364103.0
        },
        {
          "id": "m63nc3h",
          "author": "Little_Bit_87",
          "body": "Yeah, unfortunately I was unable to tolerate it's side effects and it didn't do a thing for my depression. Odd that I didn't get the munchies on it.",
          "created_utc": 1736365318.0
        },
        {
          "id": "m65qyih",
          "author": "miab2020",
          "body": "Had the same experience!! Had super high hopes but ended up with bad side effects and no appetite stimulation. But like everyone else is saying, my weed tolerance is insanely high and I can’t eat very much without it.",
          "created_utc": 1736389162.0
        }
      ]
    },
    {
      "id": "m6cyfg7",
      "author": "UtahMama4",
      "body": "My doc reminded me today that the last time my D levels were checked they were at a measly 12! I haven’t been taking my supplements (iron or Vit D). 😬 I should try to get back on them. We lived in Washington for 4 years when my husband was in the military. Beautiful state but soooo gloomy!",
      "created_utc": 1736487660.0,
      "score": 1,
      "context": [
        {
          "id": "m63c5qc",
          "author": "acrobatic_lion",
          "body": "Cannabis works to increase your appetite and make eating easier… until it doesn’t. And then you’re really screwed, because it can feel like a crutch that suddenly stops working. \n\nIn my experience, it’s okay to use cannabis for this purpose short term/intermittently — but NOT to develop a reliance on cannabis to eat. Because there always comes a day when even the cannabis doesn’t help, and then im really shit out of luck.",
          "created_utc": 1736362089.0
        },
        {
          "id": "m63e0jj",
          "author": "Little_Bit_87",
          "body": "Yeah tolerance is definitely a fear of mine. There are countless ways to suppress apatite, but not much out there that increases apatite.",
          "created_utc": 1736362621.0
        },
        {
          "id": "m63hpxa",
          "author": "severedspearhead",
          "body": "Having a very high CBD strain helps more with hunger than high THC strains. CBD generally is the thing which helps with hunger (along with how the terpenes work as well). I use cannabis for ARFID but i make sure to take regular T breaks and take only enough to get hungry not high. Miritazipine as a prescription drug is also something i use for sleep and appetite and my doctor prescribed it to me. Between both of those my ARFID is like 65-70% handled. And I'm making slow progress with weight gain",
          "created_utc": 1736363691.0
        },
        {
          "id": "m63j4vu",
          "author": "kissedbyvampires",
          "body": "can second the miritazipine thing. got prescribed it a couple years ago for my depression and it made me gain 10lbs in a month because of the appetite inducing side effect. first month is the worst, and then it levels out. should mention i lost a ton of weight because of my depression and the medication put me back at my baseline weight. \n\ni have never been so hungry before in my life. even the strongest munchies from cannabis i’ve had can’t compete to the medication. like i said though, it goes to manageable levels after a month or so. i cried because i never felt full the first month and that was like with 4-5 meals a day.",
          "created_utc": 1736364103.0
        },
        {
          "id": "m63nc3h",
          "author": "Little_Bit_87",
          "body": "Yeah, unfortunately I was unable to tolerate it's side effects and it didn't do a thing for my depression. Odd that I didn't get the munchies on it.",
          "created_utc": 1736365318.0
        },
        {
          "id": "m63yj9j",
          "author": "kissedbyvampires",
          "body": "feel yeah on the antidepressants thing. i get all the rare side effects and none of them help. have they tested your vitamin B12, D3, and/or ferritin levels? vitamin deficiencies are common in ARFID and can worsen depression symptoms significantly. i have low levels of all of those and i believe it’s part of the reason medication doesn’t help me.",
          "created_utc": 1736368590.0
        },
        {
          "id": "m67y7cb",
          "author": "Little_Bit_87",
          "body": "My B12 is always good but my ferritin and iron fluctuate a lot. D3 is ALWAYS low but.... I live in Washington State, we only get our vitamin D when tourists bring it with them 🤣 Because of my sensory issues I am hyper aware of my body and tell immediately when somethings off so I usually have supplements on hand and take them right away. It always freaks my new partners out when they find the prenatal vitamins for the first time lol",
          "created_utc": 1736429091.0
        }
      ]
    }
  ]
}