{
  "id": "1hx0r1i",
  "subreddit": "ARFID",
  "author": "Imerris",
  "created_utc": 1736385341.0,
  "title": "Kid was admitted to PICU",
  "selftext": "*** *UPDATE * ***\nMy kid was released. F/U is in a week and they will see how child is doing then and re-evaluate. \nNow to just keep kiddo on a eating every 2 hours schedule.  Ahh.... like a newborn.  Thank you all so much for the advice, and love. I appreciate it more than you know. This has been so scary, and you all helped me through the last couple of days.\n\n\n\n\n\n\nI just need a hug and a place to rant.\nI have a child, 16, who was admitted yesterday due to hr in the 40s. They have lost 5lbs in the last month despite progress at home. They have been eating consistently and more over the last 3 weeks. We all though that the doctor at the appointment yesterday was going to tell us and child gained weight and be happy. Instead I was pulled back and told that child had to be admitted. RN walked us to the children's hospital that is connected right after.\nChild lost more weight  from admit check to this am, same scale, scrubs,  etc.\n\n\n\n\nThis sucks. I am trying so hard to keep it together while I am with my kid... but this just sucks.\nChild is under eating disorder protocols at the hospital and it is like prison.  No devices at all, restricted visitation, very strict diet with time limits and more. \n\n\n\nThere is just so much. Please tell me it is going to be okay. We have been working so hard with the care team, and I am afraid this will just make my child's anxiety worse.  Plus, school is back and they are not going, so more stress. 😭😭😭",
  "url": "https://www.reddit.com/r/ARFID/comments/1hx0r1i/kid_was_admitted_to_picu/",
  "score": 84,
  "num_comments": 41,
  "comments": [
    {
      "id": "m65sp5m",
      "author": "Amekyras",
      "body": "Talk to the psychiatrist if possible and make sure they understand that there's a difference between ARFID and anorexia nervosa, far too many people refuse to acknowledge it even though it's obvious. There's no good reason to try to treat someone for a weight or shape-based eating disorder if they don't actually have that disorder, it can simply make things worse. That being said, there's a significant amount of comorbidity of course. Sending hugs.",
      "created_utc": 1736389787.0,
      "score": 94,
      "context": []
    },
    {
      "id": "m65y9vh",
      "author": "listlessgod",
      "body": "I was admitted inpatient for the first time around their age, and it was really terrifying for me. Visit them as often as you can, bring things to keep your kid occupied (the boredom is the worst part after the intense treatment protocols and being watched all the time). I know they can’t have devices, but things like books, journals, art supplies, etc if they’re allowed. When you’re there, try to bring a sense of normalcy to your kid. \n\nDuring visits, try to assure your kid that their health is more important than school. They can always catch up later. Some schools will even send work in, it could help keep your kids mind off of treatment at least and give them something to do that will help their anxiety (This is something usually coordinated with their guidance counselor). Try to act lighthearted and positive. Kids are sensitive to their parent’s emotions. \n\nMy mom always acted very stressed, and it made me feel like a burden and always brought my already low mood down even lower. I know she was just worried about me, but the stress was contagious. My sister would just joke around with me and keep me company and it always helped and took my mind off of the situation. Lastly, your child will be okay! Yes, it is stressful for you both, but they are in good hands. It may be intense, but it’s for the long term benefit of your kid.",
      "created_utc": 1736391787.0,
      "score": 41,
      "context": []
    },
    {
      "id": "m65j6af",
      "author": "JoChiCat",
      "body": "This whole situation sucks so bad, and you and your kid are doing an amazing job at pushing through it. Those hospital protocols sound rough, I hope they’ll loosen up given time!",
      "created_utc": 1736386444.0,
      "score": 13,
      "context": []
    },
    {
      "id": "m662m8d",
      "author": "Mother_Goat1541",
      "body": "Hugs. Mine was never admitted but I work in peds and PICU, and the treatment protocol for ED patients is so horrific I refuse to accept those patients because it’s so triggering. I would rather care for a dying child than subject one to those protocols. Of course the goal is medical stabilization but I know that protocol wouldn’t be beneficial long term for me, or my child.",
      "created_utc": 1736393413.0,
      "score": 11,
      "context": []
    },
    {
      "id": "m6628s7",
      "author": "qwfmzx",
      "body": "Sorry to hear what you and your family are going through. I was recently hospitalized for a month in an intensive ED facility. I was the only adult with ARFID, they didn't allow adolescents to have electronics. The facility held an ARFID meal group every week where I got to interact with the adolescents who had ARFID (there was only 2). One of them was hospitalized on the unit with me and the other was doing an outpatient program. The teen who had ARFID and was with me on the unit told me about how it sucked not having a phone, he felt alone due to the other children there grappling with other EDs he couldn't grasp. \n\nYou should explain to your child's care team how isolating of an experience they are putting her through. She can't really relate to the people he's hospitalized with. I understand not allowing him to use his phone in front of other kids who are in there but you should try to work something out with the staff for her to have private time on her phone or to contact you. Also if watching a show helps distract her from focusing on her food you should push that narrative to get her electronics maybe? If they say no then ask if she can read during mealtimes or do another distracting activity. \n\nAlso BUY HER FIDGETS!! She is probably going through programming and therapy sessions, having nee-doh, putty, or small stuffie will give her something else to focus on when things get super tough. I made a lot of bracelets when I was in there, and finished some lego sets. Goodluck!!!!",
      "created_utc": 1736393271.0,
      "score": 12,
      "context": []
    },
    {
      "id": "m65luye",
      "author": "Key-Kiwi7969",
      "body": "I am so sorry. This is so tough on us parents. Sending you love, hugs and YES it IS going to be alright ❤️",
      "created_utc": 1736387367.0,
      "score": 4,
      "context": []
    },
    {
      "id": "m676k8e",
      "author": "midnightfoliage",
      "body": "i was in a very similar situation to your child. i dont have much advice beyond being there for them and being an advocate every moment you can. \n\ni was admitted because of long term orthostatic blood pressure and then nearly fainting. was on the children's ward on ed protocol for 8 days and also ended up losing weight. it was so so hard being on a regular ed protocol unable to choose safe foods. \n\ni hope hospital protocols have improved since the diagnosis was changed from SED to ARFID, and more understood.",
      "created_utc": 1736414185.0,
      "score": 5,
      "context": []
    },
    {
      "id": "m69ji7r",
      "author": "olivia_swanborn",
      "body": "God do i wish my parents and doctors cared this much about my health. Even when things are going badly at least ur kid knows he has a supportive parent who’s doing everything they can to help their kid. I hope u and ur child continue to work through their recovery and they become healthy in all aspects",
      "created_utc": 1736447029.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m66e821",
      "author": "madfrawgs",
      "body": "At least you're a caring parent who's TRYING. \n\nI'm the step mom of a soon to be 13yr old who's bio mom refuses to take her probably AFRID son to a specialist because .... literally she has no reason. We can afford it. His dad or I can take him. She likes the attention her son's conditions gets her. It's so messed up. I feel so bad for him. \n\nWe only have them 4-5 nights a month, so there's nothing we can really do to help him or improve his habits. \n\nSo, congrats to you, random stranger, for at least trying to help your kid. You're doing better than you even know.",
      "created_utc": 1736398205.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m6731xq",
      "author": "NoButterOnlyRage",
      "body": "I don't have much good advice to share as I haven't really been in this situation (well, i have been in similar situation to your child, but not as extreme), but sending hugs and hope for you. Keep being strong.  \n  \nCan you send things like books or anything to the child? I was in a normal hospital (no special eating disorder protocols to my knowledge, so probably a different experience) for my health deteriorating from ARFID and I was really glad to have my parents bring my favourite book to the hospital, as well as a flask of my favourite coffee. I don't know if they let you do anything similar to that? But it was very nice to have comforting items with me when I couldn't access anything at home.",
      "created_utc": 1736411886.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m6arech",
      "author": "SprintsAC",
      "body": "I just want to say that your focus here shows you're a great parent (some honestly will leave their kids in the hospital, as bad as it sounds & not care much)\n\n\nTry to push for visitation as much as possible & like others have said, advocate about how your kid's ARFID works.",
      "created_utc": 1736459812.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m6i4a5g",
      "author": "drosekelley",
      "body": "I am a mom of a 13 yo and we were in the hospital last year, on a feeding tube and probably the same protocol. It was intense and scary at first. But I also felt relieved that she was finally getting expert care. I spent the most I have ever spent at target buying slippers, blankets, stuffies, board games, etc to keep us comfortable. I lived in the hospital with her for 2 weeks. We were in a different town bc there aren’t good treatment options where we live. We stayed there for 4 months while she was in treatment (not at the hospital). She is doing SO much better these days and is weight restored and eats pretty normally. There are still plenty of challenges, but nothing like those dark days leading up to the hospital. Please reach out if I can support you! I know how lonely it can be. You’re doing a great job.",
      "created_utc": 1736557636.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m6l5b04",
      "author": "Pink_heels_28",
      "body": "Please look into Equip Health after discharge <3",
      "created_utc": 1736609342.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m65t1yp",
      "author": "Imerris",
      "body": "She has been seeing a specialist for this that their focus is ed. Thank you though.",
      "created_utc": 1736389914.0,
      "score": 18,
      "context": [
        {
          "id": "m65sp5m",
          "author": "Amekyras",
          "body": "Talk to the psychiatrist if possible and make sure they understand that there's a difference between ARFID and anorexia nervosa, far too many people refuse to acknowledge it even though it's obvious. There's no good reason to try to treat someone for a weight or shape-based eating disorder if they don't actually have that disorder, it can simply make things worse. That being said, there's a significant amount of comorbidity of course. Sending hugs.",
          "created_utc": 1736389787.0
        }
      ]
    },
    {
      "id": "m66lgkq",
      "author": "Imerris",
      "body": "😭😭😭\nOmg Thank you for your detailed reply with suggestions based on your experience.  \nI am doing my best to keep it together when I am with my child. I don't want them to feel like a burden, ever. \nI just got back from a late visit. We played yahtzee and uno. \n\n\n\nDo you still struggle with arfid? You said, \"first time\", what  was the main factor for subsequent visits? Is there something more I can be doing for them at home when we do get to go home?",
      "created_utc": 1736401653.0,
      "score": 14,
      "context": [
        {
          "id": "m65y9vh",
          "author": "listlessgod",
          "body": "I was admitted inpatient for the first time around their age, and it was really terrifying for me. Visit them as often as you can, bring things to keep your kid occupied (the boredom is the worst part after the intense treatment protocols and being watched all the time). I know they can’t have devices, but things like books, journals, art supplies, etc if they’re allowed. When you’re there, try to bring a sense of normalcy to your kid. \n\nDuring visits, try to assure your kid that their health is more important than school. They can always catch up later. Some schools will even send work in, it could help keep your kids mind off of treatment at least and give them something to do that will help their anxiety (This is something usually coordinated with their guidance counselor). Try to act lighthearted and positive. Kids are sensitive to their parent’s emotions. \n\nMy mom always acted very stressed, and it made me feel like a burden and always brought my already low mood down even lower. I know she was just worried about me, but the stress was contagious. My sister would just joke around with me and keep me company and it always helped and took my mind off of the situation. Lastly, your child will be okay! Yes, it is stressful for you both, but they are in good hands. It may be intense, but it’s for the long term benefit of your kid.",
          "created_utc": 1736391787.0
        }
      ]
    },
    {
      "id": "m65jcop",
      "author": "Imerris",
      "body": "Thanks.",
      "created_utc": 1736386507.0,
      "score": 1,
      "context": [
        {
          "id": "m65j6af",
          "author": "JoChiCat",
          "body": "This whole situation sucks so bad, and you and your kid are doing an amazing job at pushing through it. Those hospital protocols sound rough, I hope they’ll loosen up given time!",
          "created_utc": 1736386444.0
        }
      ]
    },
    {
      "id": "m66mr2q",
      "author": "Imerris",
      "body": "They are pretty concerned with making sure that my child is not expending more calories than they are burning. Bed rest is proving quite difficult with my ADHD child.",
      "created_utc": 1736402314.0,
      "score": 5,
      "context": [
        {
          "id": "m662m8d",
          "author": "Mother_Goat1541",
          "body": "Hugs. Mine was never admitted but I work in peds and PICU, and the treatment protocol for ED patients is so horrific I refuse to accept those patients because it’s so triggering. I would rather care for a dying child than subject one to those protocols. Of course the goal is medical stabilization but I know that protocol wouldn’t be beneficial long term for me, or my child.",
          "created_utc": 1736393413.0
        }
      ]
    },
    {
      "id": "m6937lp",
      "author": "throw0OO0away",
      "body": "Genuine question: How do you go about refusing triggering assignments without coming across as an asshole? I’ve considered doing this but I’m scared someone will call HR or try and get me fired if I do this. \n\nContext: I’ve (I work in healthcare) had patients with psychiatric conditions and I despise our psych protocols. While I work on a medical floor and don’t see many psych patients, we still get some here and there. I hate our protocols to the point where I’d refuse the assignment for the same reasons you stated. Even if I made their day or did everything I could, I still feel horrible knowing that I participated in the broken system. \n\nI’ve also had some nasty experiences as a psych patient myself which makes the situation even more charged.",
      "created_utc": 1736442320.0,
      "score": 3,
      "context": [
        {
          "id": "m662m8d",
          "author": "Mother_Goat1541",
          "body": "Hugs. Mine was never admitted but I work in peds and PICU, and the treatment protocol for ED patients is so horrific I refuse to accept those patients because it’s so triggering. I would rather care for a dying child than subject one to those protocols. Of course the goal is medical stabilization but I know that protocol wouldn’t be beneficial long term for me, or my child.",
          "created_utc": 1736393413.0
        }
      ]
    },
    {
      "id": "m66mbqm",
      "author": "Imerris",
      "body": "Thank you so much for your reply. Thank you for the recommendations and for sharing your experiences.  \n\n\nRight now, they are being pretty strict with most of the protocols.  It is supposed to lessen as time passes. Since my child is in PICU, there isn't much interaction with other children. Only once a day with other kids from the children's hospital.  No other ED patients.",
      "created_utc": 1736402095.0,
      "score": 3,
      "context": [
        {
          "id": "m6628s7",
          "author": "qwfmzx",
          "body": "Sorry to hear what you and your family are going through. I was recently hospitalized for a month in an intensive ED facility. I was the only adult with ARFID, they didn't allow adolescents to have electronics. The facility held an ARFID meal group every week where I got to interact with the adolescents who had ARFID (there was only 2). One of them was hospitalized on the unit with me and the other was doing an outpatient program. The teen who had ARFID and was with me on the unit told me about how it sucked not having a phone, he felt alone due to the other children there grappling with other EDs he couldn't grasp. \n\nYou should explain to your child's care team how isolating of an experience they are putting her through. She can't really relate to the people he's hospitalized with. I understand not allowing him to use his phone in front of other kids who are in there but you should try to work something out with the staff for her to have private time on her phone or to contact you. Also if watching a show helps distract her from focusing on her food you should push that narrative to get her electronics maybe? If they say no then ask if she can read during mealtimes or do another distracting activity. \n\nAlso BUY HER FIDGETS!! She is probably going through programming and therapy sessions, having nee-doh, putty, or small stuffie will give her something else to focus on when things get super tough. I made a lot of bracelets when I was in there, and finished some lego sets. Goodluck!!!!",
          "created_utc": 1736393271.0
        }
      ]
    },
    {
      "id": "m65p3t5",
      "author": "Imerris",
      "body": "😭😭😭\nThanks. I am really struggling to keep it together.  Thanks for giving me some hope.",
      "created_utc": 1736388504.0,
      "score": 3,
      "context": [
        {
          "id": "m65luye",
          "author": "Key-Kiwi7969",
          "body": "I am so sorry. This is so tough on us parents. Sending you love, hugs and YES it IS going to be alright ❤️",
          "created_utc": 1736387367.0
        }
      ]
    },
    {
      "id": "m6807a4",
      "author": "Imerris",
      "body": "We are fortunate that my child's doctor is an adolescent specialist and specializes in ED. She is a pretty fantastic and down to earth doctor.",
      "created_utc": 1736429862.0,
      "score": 3,
      "context": [
        {
          "id": "m676k8e",
          "author": "midnightfoliage",
          "body": "i was in a very similar situation to your child. i dont have much advice beyond being there for them and being an advocate every moment you can. \n\ni was admitted because of long term orthostatic blood pressure and then nearly fainting. was on the children's ward on ed protocol for 8 days and also ended up losing weight. it was so so hard being on a regular ed protocol unable to choose safe foods. \n\ni hope hospital protocols have improved since the diagnosis was changed from SED to ARFID, and more understood.",
          "created_utc": 1736414185.0
        }
      ]
    },
    {
      "id": "m66n0li",
      "author": "Imerris",
      "body": "Thank you so much. \nTbh I feel like a complete failure, and over the last 8 months, I have questioned if i caused this or if I am making it worse in any way. I am trying so hard to research and listen to the RD and listen to my kid.\n\n\n\nParenting is hard.",
      "created_utc": 1736402450.0,
      "score": 4,
      "context": [
        {
          "id": "m66e821",
          "author": "madfrawgs",
          "body": "At least you're a caring parent who's TRYING. \n\nI'm the step mom of a soon to be 13yr old who's bio mom refuses to take her probably AFRID son to a specialist because .... literally she has no reason. We can afford it. His dad or I can take him. She likes the attention her son's conditions gets her. It's so messed up. I feel so bad for him. \n\nWe only have them 4-5 nights a month, so there's nothing we can really do to help him or improve his habits. \n\nSo, congrats to you, random stranger, for at least trying to help your kid. You're doing better than you even know.",
          "created_utc": 1736398205.0
        }
      ]
    },
    {
      "id": "m67ztrz",
      "author": "Imerris",
      "body": "I have been to the store so many times, lol. She now has 2 more blankets. 1 really soft throw, which I washed last night, and one twin size quilt because she hates the scratchy hospital blankets. Multiple games, and some markers. I am trying to take things that would make her comfortable,  but I am also trying not to overwhelm her with stuff.",
      "created_utc": 1736429716.0,
      "score": 2,
      "context": [
        {
          "id": "m6731xq",
          "author": "NoButterOnlyRage",
          "body": "I don't have much good advice to share as I haven't really been in this situation (well, i have been in similar situation to your child, but not as extreme), but sending hugs and hope for you. Keep being strong.  \n  \nCan you send things like books or anything to the child? I was in a normal hospital (no special eating disorder protocols to my knowledge, so probably a different experience) for my health deteriorating from ARFID and I was really glad to have my parents bring my favourite book to the hospital, as well as a flask of my favourite coffee. I don't know if they let you do anything similar to that? But it was very nice to have comforting items with me when I couldn't access anything at home.",
          "created_utc": 1736411886.0
        }
      ]
    },
    {
      "id": "m6p09bb",
      "author": "Imerris",
      "body": "Thanks. I will look into it.",
      "created_utc": 1736655189.0,
      "score": 1,
      "context": [
        {
          "id": "m6l5b04",
          "author": "Pink_heels_28",
          "body": "Please look into Equip Health after discharge <3",
          "created_utc": 1736609342.0
        }
      ]
    },
    {
      "id": "m69a6j0",
      "author": "eighteencarps",
      "body": "I don’t want to be dismissive, but I’ve found many ED specialists who don’t understand ARFID. Especially if they’re doing standard ED protocol, like taking away someone’s forms of communication, it sounds like they might not understand…",
      "created_utc": 1736444347.0,
      "score": 17,
      "context": [
        {
          "id": "m65sp5m",
          "author": "Amekyras",
          "body": "Talk to the psychiatrist if possible and make sure they understand that there's a difference between ARFID and anorexia nervosa, far too many people refuse to acknowledge it even though it's obvious. There's no good reason to try to treat someone for a weight or shape-based eating disorder if they don't actually have that disorder, it can simply make things worse. That being said, there's a significant amount of comorbidity of course. Sending hugs.",
          "created_utc": 1736389787.0
        },
        {
          "id": "m65t1yp",
          "author": "Imerris",
          "body": "She has been seeing a specialist for this that their focus is ed. Thank you though.",
          "created_utc": 1736389914.0
        }
      ]
    },
    {
      "id": "m66p7tz",
      "author": "listlessgod",
      "body": "Aww it sounds like you guys had fun! The reasons for being sent back hopefully won’t apply to them, but it was a mix of different things. I was extremely depressed and anxious and not very motivated to keep up with my treatment plan the first time around. I had a very stressful home environment. The second visit was better, I got away from the bad environment and was just sick of being so unwell all the time. \n\nMy mom tried her best and I don’t blame her fully, but she didn’t really understand. She would force me to eat and threaten to ground me or bring me back to the hospital if I didn’t finish and it had the opposite effect. She wasn’t the main factor of my home environment being bad, she was in a failing marriage and it was mostly the constant arguing and using my “condition” as a weapon against each other. They blamed each other, which is silly because I was born this way as far as I’m aware. My step father was actually much worse in that regard but I’ve forgiven him as well. \n\nI kept losing weight and hiding food and I was very resistant to getting better. Part of it might have been to be rebellious tbh, I was just so angry at the time even though it was really only hurting myself. My second visit, she took the time to understand better and was very supportive and kept me on track. She encouraged me, but didn’t force me. She didn’t threaten me either. I had my ups and downs, but it was much better after that and I stayed out of the hospital and made continuous progress. My parents also finally divorced, which was hard, but my environment was much better. \n\nThe real trouble started when I moved away from home as an adult. During my early 20s, my arfid got worse. I couldn’t eat at all and I no longer had a support system or anyone holding me accountable. I was picky before, but eating itself felt gross to me. I was paranoid about everything I ate making me sick, I couldn’t eat more than a fistful of food or I thought my stomach would tear. \n\nHonestly, I don’t know why it got worse suddenly. My only guess is that it happened around when covid struck, and I was having a lot of GI issues as well so it may have been stress piling up. It was easier for me to just fall into bad habits, and I didn’t really take it that seriously until my health started really failing and then I admitted myself when I realized I couldn’t do it alone. \n\nI am doing a lot better now though. I’ve found this sort of balance with my arfid where I force myself to eat more and have some variety, but I don’t push it so far that I’m stressing myself out too much. I learned to do it all myself too. I think it’s really important when your kid leaves the hospital that they have a good support system in place. Being forced to eat never helps, and motivation is extremely important. Positive reinforcement and encouragement, saying you’re proud of them when they finish a difficult meal, not getting angry with them for symptoms but comforting them instead etc.\n\n It’s a lot to deal with seeing someone you love suffer. But being someone they can come to for support instead of being ashamed to let them know they’re struggling goes a long way. I was terrified to tell my parents when I was struggling for the longest time. Yes, they got better about that, but not before I ended up in the hospital again. Honestly, I’m not a parent myself. I can’t imagine how hard it must be for you. I only have experience being a difficult child lol. I do know that it’s difficult for everyone involved. I know you want to do right by your child, and that is enough mostly. There’s no such thing as being a perfect parent, just doing your best. As long as your child feels safe and loved and you’re taking the time to understand what they’re going through, I have faith that you’ll do an amazing job.",
      "created_utc": 1736403615.0,
      "score": 3,
      "context": [
        {
          "id": "m65y9vh",
          "author": "listlessgod",
          "body": "I was admitted inpatient for the first time around their age, and it was really terrifying for me. Visit them as often as you can, bring things to keep your kid occupied (the boredom is the worst part after the intense treatment protocols and being watched all the time). I know they can’t have devices, but things like books, journals, art supplies, etc if they’re allowed. When you’re there, try to bring a sense of normalcy to your kid. \n\nDuring visits, try to assure your kid that their health is more important than school. They can always catch up later. Some schools will even send work in, it could help keep your kids mind off of treatment at least and give them something to do that will help their anxiety (This is something usually coordinated with their guidance counselor). Try to act lighthearted and positive. Kids are sensitive to their parent’s emotions. \n\nMy mom always acted very stressed, and it made me feel like a burden and always brought my already low mood down even lower. I know she was just worried about me, but the stress was contagious. My sister would just joke around with me and keep me company and it always helped and took my mind off of the situation. Lastly, your child will be okay! Yes, it is stressful for you both, but they are in good hands. It may be intense, but it’s for the long term benefit of your kid.",
          "created_utc": 1736391787.0
        },
        {
          "id": "m66lgkq",
          "author": "Imerris",
          "body": "😭😭😭\nOmg Thank you for your detailed reply with suggestions based on your experience.  \nI am doing my best to keep it together when I am with my child. I don't want them to feel like a burden, ever. \nI just got back from a late visit. We played yahtzee and uno. \n\n\n\nDo you still struggle with arfid? You said, \"first time\", what  was the main factor for subsequent visits? Is there something more I can be doing for them at home when we do get to go home?",
          "created_utc": 1736401653.0
        }
      ]
    },
    {
      "id": "m65ju87",
      "author": "JoChiCat",
      "body": "Are they at least allowing books/games/art supplies, that kind of entertainment? I understand the no-device rule, but at 16 that would have been a nightmare to deal with.",
      "created_utc": 1736386676.0,
      "score": 3,
      "context": [
        {
          "id": "m65j6af",
          "author": "JoChiCat",
          "body": "This whole situation sucks so bad, and you and your kid are doing an amazing job at pushing through it. Those hospital protocols sound rough, I hope they’ll loosen up given time!",
          "created_utc": 1736386444.0
        },
        {
          "id": "m65jcop",
          "author": "Imerris",
          "body": "Thanks.",
          "created_utc": 1736386507.0
        }
      ]
    },
    {
      "id": "m68qd12",
      "author": "Mother_Goat1541",
      "body": "Yes. Being forced to sit in bed all day with nothing to do and nobody to talk to is not therapeutic to me. Yes, the medical stabilization is more important short term, but these protocols are extremely short sighted and don’t do much for the psychological needs of these kids. I feel for you and your child.",
      "created_utc": 1736438549.0,
      "score": 6,
      "context": [
        {
          "id": "m662m8d",
          "author": "Mother_Goat1541",
          "body": "Hugs. Mine was never admitted but I work in peds and PICU, and the treatment protocol for ED patients is so horrific I refuse to accept those patients because it’s so triggering. I would rather care for a dying child than subject one to those protocols. Of course the goal is medical stabilization but I know that protocol wouldn’t be beneficial long term for me, or my child.",
          "created_utc": 1736393413.0
        },
        {
          "id": "m66mr2q",
          "author": "Imerris",
          "body": "They are pretty concerned with making sure that my child is not expending more calories than they are burning. Bed rest is proving quite difficult with my ADHD child.",
          "created_utc": 1736402314.0
        }
      ]
    },
    {
      "id": "m69ar4q",
      "author": "Mother_Goat1541",
      "body": "I have made it well known to my supervisors that these assignments trigger my PTSD, due to personal experience and that of my kids, and that these are the only assignments I see that make me feel we are harming patients more than helping them. I have a “no ED assignments” note next to my name on the staffing list. It’s the only assignment I will refuse. Another nurse refuses assignments in a certain room (she had a parent commit suicide in this room).",
      "created_utc": 1736444511.0,
      "score": 4,
      "context": [
        {
          "id": "m662m8d",
          "author": "Mother_Goat1541",
          "body": "Hugs. Mine was never admitted but I work in peds and PICU, and the treatment protocol for ED patients is so horrific I refuse to accept those patients because it’s so triggering. I would rather care for a dying child than subject one to those protocols. Of course the goal is medical stabilization but I know that protocol wouldn’t be beneficial long term for me, or my child.",
          "created_utc": 1736393413.0
        },
        {
          "id": "m6937lp",
          "author": "throw0OO0away",
          "body": "Genuine question: How do you go about refusing triggering assignments without coming across as an asshole? I’ve considered doing this but I’m scared someone will call HR or try and get me fired if I do this. \n\nContext: I’ve (I work in healthcare) had patients with psychiatric conditions and I despise our psych protocols. While I work on a medical floor and don’t see many psych patients, we still get some here and there. I hate our protocols to the point where I’d refuse the assignment for the same reasons you stated. Even if I made their day or did everything I could, I still feel horrible knowing that I participated in the broken system. \n\nI’ve also had some nasty experiences as a psych patient myself which makes the situation even more charged.",
          "created_utc": 1736442320.0
        }
      ]
    },
    {
      "id": "m66nsie",
      "author": "qwfmzx",
      "body": "Thank you for the reward it's my first one ❤️, I also got cut off when I was editing the pronouns in my comment so sorry about that. If you ever want someone to talk to my DMS are open! My heart goes out to your daughter, being a 16 year old girl was so hard and having ARFID makes it so much harder. I wouldn't be where I am without the support from my mother (and my dad too I guess 🙄🤣) food FBT helped a lot.",
      "created_utc": 1736402857.0,
      "score": 5,
      "context": [
        {
          "id": "m6628s7",
          "author": "qwfmzx",
          "body": "Sorry to hear what you and your family are going through. I was recently hospitalized for a month in an intensive ED facility. I was the only adult with ARFID, they didn't allow adolescents to have electronics. The facility held an ARFID meal group every week where I got to interact with the adolescents who had ARFID (there was only 2). One of them was hospitalized on the unit with me and the other was doing an outpatient program. The teen who had ARFID and was with me on the unit told me about how it sucked not having a phone, he felt alone due to the other children there grappling with other EDs he couldn't grasp. \n\nYou should explain to your child's care team how isolating of an experience they are putting her through. She can't really relate to the people he's hospitalized with. I understand not allowing him to use his phone in front of other kids who are in there but you should try to work something out with the staff for her to have private time on her phone or to contact you. Also if watching a show helps distract her from focusing on her food you should push that narrative to get her electronics maybe? If they say no then ask if she can read during mealtimes or do another distracting activity. \n\nAlso BUY HER FIDGETS!! She is probably going through programming and therapy sessions, having nee-doh, putty, or small stuffie will give her something else to focus on when things get super tough. I made a lot of bracelets when I was in there, and finished some lego sets. Goodluck!!!!",
          "created_utc": 1736393271.0
        },
        {
          "id": "m66mbqm",
          "author": "Imerris",
          "body": "Thank you so much for your reply. Thank you for the recommendations and for sharing your experiences.  \n\n\nRight now, they are being pretty strict with most of the protocols.  It is supposed to lessen as time passes. Since my child is in PICU, there isn't much interaction with other children. Only once a day with other kids from the children's hospital.  No other ED patients.",
          "created_utc": 1736402095.0
        }
      ]
    },
    {
      "id": "m6avept",
      "author": "midnightfoliage",
      "body": "then you should be in good hands <3 best wishes",
      "created_utc": 1736461035.0,
      "score": 2,
      "context": [
        {
          "id": "m676k8e",
          "author": "midnightfoliage",
          "body": "i was in a very similar situation to your child. i dont have much advice beyond being there for them and being an advocate every moment you can. \n\ni was admitted because of long term orthostatic blood pressure and then nearly fainting. was on the children's ward on ed protocol for 8 days and also ended up losing weight. it was so so hard being on a regular ed protocol unable to choose safe foods. \n\ni hope hospital protocols have improved since the diagnosis was changed from SED to ARFID, and more understood.",
          "created_utc": 1736414185.0
        },
        {
          "id": "m6807a4",
          "author": "Imerris",
          "body": "We are fortunate that my child's doctor is an adolescent specialist and specializes in ED. She is a pretty fantastic and down to earth doctor.",
          "created_utc": 1736429862.0
        }
      ]
    },
    {
      "id": "m69eijk",
      "author": "madfrawgs",
      "body": "It is. \n\nBut at least you're trying <3",
      "created_utc": 1736445587.0,
      "score": 2,
      "context": [
        {
          "id": "m66e821",
          "author": "madfrawgs",
          "body": "At least you're a caring parent who's TRYING. \n\nI'm the step mom of a soon to be 13yr old who's bio mom refuses to take her probably AFRID son to a specialist because .... literally she has no reason. We can afford it. His dad or I can take him. She likes the attention her son's conditions gets her. It's so messed up. I feel so bad for him. \n\nWe only have them 4-5 nights a month, so there's nothing we can really do to help him or improve his habits. \n\nSo, congrats to you, random stranger, for at least trying to help your kid. You're doing better than you even know.",
          "created_utc": 1736398205.0
        },
        {
          "id": "m66n0li",
          "author": "Imerris",
          "body": "Thank you so much. \nTbh I feel like a complete failure, and over the last 8 months, I have questioned if i caused this or if I am making it worse in any way. I am trying so hard to research and listen to the RD and listen to my kid.\n\n\n\nParenting is hard.",
          "created_utc": 1736402450.0
        }
      ]
    },
    {
      "id": "m69ffi6",
      "author": "madfrawgs",
      "body": "Actually, if you happen to have any resources, or links, I would REALLY appreciate them. Being the step mom (who is legit hated by the bio mom), we don't see them much, and since we live in a somewhat rural area, I'm at such a loss for where I can even turn to, even to try to get pointers and guidance on how talk to him and support him through his issues. I joined this sub in a desperate attempt to find something and gain some understanding. \n\nI just feel so bad for him and I too feel like a failure.",
      "created_utc": 1736445852.0,
      "score": 2,
      "context": [
        {
          "id": "m66e821",
          "author": "madfrawgs",
          "body": "At least you're a caring parent who's TRYING. \n\nI'm the step mom of a soon to be 13yr old who's bio mom refuses to take her probably AFRID son to a specialist because .... literally she has no reason. We can afford it. His dad or I can take him. She likes the attention her son's conditions gets her. It's so messed up. I feel so bad for him. \n\nWe only have them 4-5 nights a month, so there's nothing we can really do to help him or improve his habits. \n\nSo, congrats to you, random stranger, for at least trying to help your kid. You're doing better than you even know.",
          "created_utc": 1736398205.0
        },
        {
          "id": "m66n0li",
          "author": "Imerris",
          "body": "Thank you so much. \nTbh I feel like a complete failure, and over the last 8 months, I have questioned if i caused this or if I am making it worse in any way. I am trying so hard to research and listen to the RD and listen to my kid.\n\n\n\nParenting is hard.",
          "created_utc": 1736402450.0
        }
      ]
    },
    {
      "id": "m683yz9",
      "author": "NoButterOnlyRage",
      "body": "Blankets, perfect. I remember the blankets sucking at the hospital when I went, so you're doing great!!! Good ideas with the games and markers. I think you're doing great, trying not to overwhelm her. Do make sure to ask her if she needs/wants anything more, when I was in hospital my parents kept asking me and it might've droned on a bit sure but their concern was much appreciated from me lol. You are very strong, I wish the best for you",
      "created_utc": 1736431264.0,
      "score": 2,
      "context": [
        {
          "id": "m6731xq",
          "author": "NoButterOnlyRage",
          "body": "I don't have much good advice to share as I haven't really been in this situation (well, i have been in similar situation to your child, but not as extreme), but sending hugs and hope for you. Keep being strong.  \n  \nCan you send things like books or anything to the child? I was in a normal hospital (no special eating disorder protocols to my knowledge, so probably a different experience) for my health deteriorating from ARFID and I was really glad to have my parents bring my favourite book to the hospital, as well as a flask of my favourite coffee. I don't know if they let you do anything similar to that? But it was very nice to have comforting items with me when I couldn't access anything at home.",
          "created_utc": 1736411886.0
        },
        {
          "id": "m67ztrz",
          "author": "Imerris",
          "body": "I have been to the store so many times, lol. She now has 2 more blankets. 1 really soft throw, which I washed last night, and one twin size quilt because she hates the scratchy hospital blankets. Multiple games, and some markers. I am trying to take things that would make her comfortable,  but I am also trying not to overwhelm her with stuff.",
          "created_utc": 1736429716.0
        }
      ]
    },
    {
      "id": "m69maqf",
      "author": "harpyoftheshore",
      "body": "Yeah, like many, many doctors understand every ED as diet-culture motivated, and that actively sabotaged my access to treatment because I didn't think I was possible that I had an ED (because it's never been about wanting to lose weight). If someone tried using that framework, it wouldn't be effective treatment. Like I understand taking someone's phone if they're viewing \"pro ana\" content on their socials, but if the problem is \"I don't like eating\" or \"I find this exhausting and repetitive\" or \"I don't like the texture of this food, if I eat it I'll throw up and I'd just rather not eat than deal with all of that\" taking someone's phone is at best ineffective and at worst going to reinforce anxiety around food, putting MORE pressure on them. I don't think the hardcore isolation protocol is the move here",
      "created_utc": 1736447833.0,
      "score": 6,
      "context": [
        {
          "id": "m65sp5m",
          "author": "Amekyras",
          "body": "Talk to the psychiatrist if possible and make sure they understand that there's a difference between ARFID and anorexia nervosa, far too many people refuse to acknowledge it even though it's obvious. There's no good reason to try to treat someone for a weight or shape-based eating disorder if they don't actually have that disorder, it can simply make things worse. That being said, there's a significant amount of comorbidity of course. Sending hugs.",
          "created_utc": 1736389787.0
        },
        {
          "id": "m65t1yp",
          "author": "Imerris",
          "body": "She has been seeing a specialist for this that their focus is ed. Thank you though.",
          "created_utc": 1736389914.0
        },
        {
          "id": "m69a6j0",
          "author": "eighteencarps",
          "body": "I don’t want to be dismissive, but I’ve found many ED specialists who don’t understand ARFID. Especially if they’re doing standard ED protocol, like taking away someone’s forms of communication, it sounds like they might not understand…",
          "created_utc": 1736444347.0
        }
      ]
    },
    {
      "id": "m6c0z2p",
      "author": "Imerris",
      "body": "Thank you for your input and concern.  I don't feel like that is the case with this doctor.",
      "created_utc": 1736474756.0,
      "score": 1,
      "context": [
        {
          "id": "m65sp5m",
          "author": "Amekyras",
          "body": "Talk to the psychiatrist if possible and make sure they understand that there's a difference between ARFID and anorexia nervosa, far too many people refuse to acknowledge it even though it's obvious. There's no good reason to try to treat someone for a weight or shape-based eating disorder if they don't actually have that disorder, it can simply make things worse. That being said, there's a significant amount of comorbidity of course. Sending hugs.",
          "created_utc": 1736389787.0
        },
        {
          "id": "m65t1yp",
          "author": "Imerris",
          "body": "She has been seeing a specialist for this that their focus is ed. Thank you though.",
          "created_utc": 1736389914.0
        },
        {
          "id": "m69a6j0",
          "author": "eighteencarps",
          "body": "I don’t want to be dismissive, but I’ve found many ED specialists who don’t understand ARFID. Especially if they’re doing standard ED protocol, like taking away someone’s forms of communication, it sounds like they might not understand…",
          "created_utc": 1736444347.0
        }
      ]
    },
    {
      "id": "m67z1dv",
      "author": "Imerris",
      "body": "Wow. Again, thank you for your reply. I am blown away with your response. You give me hope. I am not capable of making a thorough response at this moment. \nJust, thank you.",
      "created_utc": 1736429414.0,
      "score": 3,
      "context": [
        {
          "id": "m65y9vh",
          "author": "listlessgod",
          "body": "I was admitted inpatient for the first time around their age, and it was really terrifying for me. Visit them as often as you can, bring things to keep your kid occupied (the boredom is the worst part after the intense treatment protocols and being watched all the time). I know they can’t have devices, but things like books, journals, art supplies, etc if they’re allowed. When you’re there, try to bring a sense of normalcy to your kid. \n\nDuring visits, try to assure your kid that their health is more important than school. They can always catch up later. Some schools will even send work in, it could help keep your kids mind off of treatment at least and give them something to do that will help their anxiety (This is something usually coordinated with their guidance counselor). Try to act lighthearted and positive. Kids are sensitive to their parent’s emotions. \n\nMy mom always acted very stressed, and it made me feel like a burden and always brought my already low mood down even lower. I know she was just worried about me, but the stress was contagious. My sister would just joke around with me and keep me company and it always helped and took my mind off of the situation. Lastly, your child will be okay! Yes, it is stressful for you both, but they are in good hands. It may be intense, but it’s for the long term benefit of your kid.",
          "created_utc": 1736391787.0
        },
        {
          "id": "m66lgkq",
          "author": "Imerris",
          "body": "😭😭😭\nOmg Thank you for your detailed reply with suggestions based on your experience.  \nI am doing my best to keep it together when I am with my child. I don't want them to feel like a burden, ever. \nI just got back from a late visit. We played yahtzee and uno. \n\n\n\nDo you still struggle with arfid? You said, \"first time\", what  was the main factor for subsequent visits? Is there something more I can be doing for them at home when we do get to go home?",
          "created_utc": 1736401653.0
        },
        {
          "id": "m66p7tz",
          "author": "listlessgod",
          "body": "Aww it sounds like you guys had fun! The reasons for being sent back hopefully won’t apply to them, but it was a mix of different things. I was extremely depressed and anxious and not very motivated to keep up with my treatment plan the first time around. I had a very stressful home environment. The second visit was better, I got away from the bad environment and was just sick of being so unwell all the time. \n\nMy mom tried her best and I don’t blame her fully, but she didn’t really understand. She would force me to eat and threaten to ground me or bring me back to the hospital if I didn’t finish and it had the opposite effect. She wasn’t the main factor of my home environment being bad, she was in a failing marriage and it was mostly the constant arguing and using my “condition” as a weapon against each other. They blamed each other, which is silly because I was born this way as far as I’m aware. My step father was actually much worse in that regard but I’ve forgiven him as well. \n\nI kept losing weight and hiding food and I was very resistant to getting better. Part of it might have been to be rebellious tbh, I was just so angry at the time even though it was really only hurting myself. My second visit, she took the time to understand better and was very supportive and kept me on track. She encouraged me, but didn’t force me. She didn’t threaten me either. I had my ups and downs, but it was much better after that and I stayed out of the hospital and made continuous progress. My parents also finally divorced, which was hard, but my environment was much better. \n\nThe real trouble started when I moved away from home as an adult. During my early 20s, my arfid got worse. I couldn’t eat at all and I no longer had a support system or anyone holding me accountable. I was picky before, but eating itself felt gross to me. I was paranoid about everything I ate making me sick, I couldn’t eat more than a fistful of food or I thought my stomach would tear. \n\nHonestly, I don’t know why it got worse suddenly. My only guess is that it happened around when covid struck, and I was having a lot of GI issues as well so it may have been stress piling up. It was easier for me to just fall into bad habits, and I didn’t really take it that seriously until my health started really failing and then I admitted myself when I realized I couldn’t do it alone. \n\nI am doing a lot better now though. I’ve found this sort of balance with my arfid where I force myself to eat more and have some variety, but I don’t push it so far that I’m stressing myself out too much. I learned to do it all myself too. I think it’s really important when your kid leaves the hospital that they have a good support system in place. Being forced to eat never helps, and motivation is extremely important. Positive reinforcement and encouragement, saying you’re proud of them when they finish a difficult meal, not getting angry with them for symptoms but comforting them instead etc.\n\n It’s a lot to deal with seeing someone you love suffer. But being someone they can come to for support instead of being ashamed to let them know they’re struggling goes a long way. I was terrified to tell my parents when I was struggling for the longest time. Yes, they got better about that, but not before I ended up in the hospital again. Honestly, I’m not a parent myself. I can’t imagine how hard it must be for you. I only have experience being a difficult child lol. I do know that it’s difficult for everyone involved. I know you want to do right by your child, and that is enough mostly. There’s no such thing as being a perfect parent, just doing your best. As long as your child feels safe and loved and you’re taking the time to understand what they’re going through, I have faith that you’ll do an amazing job.",
          "created_utc": 1736403615.0
        }
      ]
    },
    {
      "id": "m65orfc",
      "author": "Imerris",
      "body": "Yes. She has been coloring, and they gave her some cards and a lego set",
      "created_utc": 1736388383.0,
      "score": 9,
      "context": [
        {
          "id": "m65j6af",
          "author": "JoChiCat",
          "body": "This whole situation sucks so bad, and you and your kid are doing an amazing job at pushing through it. Those hospital protocols sound rough, I hope they’ll loosen up given time!",
          "created_utc": 1736386444.0
        },
        {
          "id": "m65jcop",
          "author": "Imerris",
          "body": "Thanks.",
          "created_utc": 1736386507.0
        },
        {
          "id": "m65ju87",
          "author": "JoChiCat",
          "body": "Are they at least allowing books/games/art supplies, that kind of entertainment? I understand the no-device rule, but at 16 that would have been a nightmare to deal with.",
          "created_utc": 1736386676.0
        }
      ]
    },
    {
      "id": "m66orqe",
      "author": "Imerris",
      "body": "It's fine. I typically try to avoid using identifying pronouns for my kids anyway. I figure it is probably safer. 🤷‍♀️\nI appreciate your offer. Having others who have gone through this and can answer my questions is helpful.",
      "created_utc": 1736403378.0,
      "score": 3,
      "context": [
        {
          "id": "m6628s7",
          "author": "qwfmzx",
          "body": "Sorry to hear what you and your family are going through. I was recently hospitalized for a month in an intensive ED facility. I was the only adult with ARFID, they didn't allow adolescents to have electronics. The facility held an ARFID meal group every week where I got to interact with the adolescents who had ARFID (there was only 2). One of them was hospitalized on the unit with me and the other was doing an outpatient program. The teen who had ARFID and was with me on the unit told me about how it sucked not having a phone, he felt alone due to the other children there grappling with other EDs he couldn't grasp. \n\nYou should explain to your child's care team how isolating of an experience they are putting her through. She can't really relate to the people he's hospitalized with. I understand not allowing him to use his phone in front of other kids who are in there but you should try to work something out with the staff for her to have private time on her phone or to contact you. Also if watching a show helps distract her from focusing on her food you should push that narrative to get her electronics maybe? If they say no then ask if she can read during mealtimes or do another distracting activity. \n\nAlso BUY HER FIDGETS!! She is probably going through programming and therapy sessions, having nee-doh, putty, or small stuffie will give her something else to focus on when things get super tough. I made a lot of bracelets when I was in there, and finished some lego sets. Goodluck!!!!",
          "created_utc": 1736393271.0
        },
        {
          "id": "m66mbqm",
          "author": "Imerris",
          "body": "Thank you so much for your reply. Thank you for the recommendations and for sharing your experiences.  \n\n\nRight now, they are being pretty strict with most of the protocols.  It is supposed to lessen as time passes. Since my child is in PICU, there isn't much interaction with other children. Only once a day with other kids from the children's hospital.  No other ED patients.",
          "created_utc": 1736402095.0
        },
        {
          "id": "m66nsie",
          "author": "qwfmzx",
          "body": "Thank you for the reward it's my first one ❤️, I also got cut off when I was editing the pronouns in my comment so sorry about that. If you ever want someone to talk to my DMS are open! My heart goes out to your daughter, being a 16 year old girl was so hard and having ARFID makes it so much harder. I wouldn't be where I am without the support from my mother (and my dad too I guess 🙄🤣) food FBT helped a lot.",
          "created_utc": 1736402857.0
        }
      ]
    },
    {
      "id": "m6c06de",
      "author": "Imerris",
      "body": "Thank you!",
      "created_utc": 1736474483.0,
      "score": 2,
      "context": [
        {
          "id": "m6731xq",
          "author": "NoButterOnlyRage",
          "body": "I don't have much good advice to share as I haven't really been in this situation (well, i have been in similar situation to your child, but not as extreme), but sending hugs and hope for you. Keep being strong.  \n  \nCan you send things like books or anything to the child? I was in a normal hospital (no special eating disorder protocols to my knowledge, so probably a different experience) for my health deteriorating from ARFID and I was really glad to have my parents bring my favourite book to the hospital, as well as a flask of my favourite coffee. I don't know if they let you do anything similar to that? But it was very nice to have comforting items with me when I couldn't access anything at home.",
          "created_utc": 1736411886.0
        },
        {
          "id": "m67ztrz",
          "author": "Imerris",
          "body": "I have been to the store so many times, lol. She now has 2 more blankets. 1 really soft throw, which I washed last night, and one twin size quilt because she hates the scratchy hospital blankets. Multiple games, and some markers. I am trying to take things that would make her comfortable,  but I am also trying not to overwhelm her with stuff.",
          "created_utc": 1736429716.0
        },
        {
          "id": "m683yz9",
          "author": "NoButterOnlyRage",
          "body": "Blankets, perfect. I remember the blankets sucking at the hospital when I went, so you're doing great!!! Good ideas with the games and markers. I think you're doing great, trying not to overwhelm her. Do make sure to ask her if she needs/wants anything more, when I was in hospital my parents kept asking me and it might've droned on a bit sure but their concern was much appreciated from me lol. You are very strong, I wish the best for you",
          "created_utc": 1736431264.0
        }
      ]
    },
    {
      "id": "m66qfy7",
      "author": "qwfmzx",
      "body": "I really admire that approach 🥰 I also believe it's safer.",
      "created_utc": 1736404286.0,
      "score": 2,
      "context": [
        {
          "id": "m6628s7",
          "author": "qwfmzx",
          "body": "Sorry to hear what you and your family are going through. I was recently hospitalized for a month in an intensive ED facility. I was the only adult with ARFID, they didn't allow adolescents to have electronics. The facility held an ARFID meal group every week where I got to interact with the adolescents who had ARFID (there was only 2). One of them was hospitalized on the unit with me and the other was doing an outpatient program. The teen who had ARFID and was with me on the unit told me about how it sucked not having a phone, he felt alone due to the other children there grappling with other EDs he couldn't grasp. \n\nYou should explain to your child's care team how isolating of an experience they are putting her through. She can't really relate to the people he's hospitalized with. I understand not allowing him to use his phone in front of other kids who are in there but you should try to work something out with the staff for her to have private time on her phone or to contact you. Also if watching a show helps distract her from focusing on her food you should push that narrative to get her electronics maybe? If they say no then ask if she can read during mealtimes or do another distracting activity. \n\nAlso BUY HER FIDGETS!! She is probably going through programming and therapy sessions, having nee-doh, putty, or small stuffie will give her something else to focus on when things get super tough. I made a lot of bracelets when I was in there, and finished some lego sets. Goodluck!!!!",
          "created_utc": 1736393271.0
        },
        {
          "id": "m66mbqm",
          "author": "Imerris",
          "body": "Thank you so much for your reply. Thank you for the recommendations and for sharing your experiences.  \n\n\nRight now, they are being pretty strict with most of the protocols.  It is supposed to lessen as time passes. Since my child is in PICU, there isn't much interaction with other children. Only once a day with other kids from the children's hospital.  No other ED patients.",
          "created_utc": 1736402095.0
        },
        {
          "id": "m66nsie",
          "author": "qwfmzx",
          "body": "Thank you for the reward it's my first one ❤️, I also got cut off when I was editing the pronouns in my comment so sorry about that. If you ever want someone to talk to my DMS are open! My heart goes out to your daughter, being a 16 year old girl was so hard and having ARFID makes it so much harder. I wouldn't be where I am without the support from my mother (and my dad too I guess 🙄🤣) food FBT helped a lot.",
          "created_utc": 1736402857.0
        },
        {
          "id": "m66orqe",
          "author": "Imerris",
          "body": "It's fine. I typically try to avoid using identifying pronouns for my kids anyway. I figure it is probably safer. 🤷‍♀️\nI appreciate your offer. Having others who have gone through this and can answer my questions is helpful.",
          "created_utc": 1736403378.0
        }
      ]
    }
  ]
}