{
  "id": "1hxfvqd",
  "subreddit": "ARFID",
  "author": "DifferentIsPossble",
  "created_utc": 1736438144.0,
  "title": "I'm losing all my Japanese food safe foods and it's gonna drive me insane",
  "selftext": "Japanese food has been a favorite of mine for sensory reasons for ages. I don't know why, but a lot of dishes are just pleasing to the palate in ways I can't really explain. \n\nJust lost one again. \n\nThis time, it's raw salmon. I've always liked the taste, the texture, the springiness. With rice and soy sauce? Always an easy pleaser in poke bowls, sushi, etc.\n\nShit Brain: you know that's flesh right? That's flesh. If you bit into a living dish that's what it'd be like. That's flesh. \n\nAugh. \n\nI really really really really REALLY REALLY hope this isn't the start of something bigger and worse. I've been decently functional for the last x many years. But safe foods are suddenly getting pointed at by Shit Brain and I HOPE it's not a trend.\n\nNot particularly looking for advice, but I won't ban it either. Just. Idk. I want someone to get it. ",
  "url": "https://www.reddit.com/r/ARFID/comments/1hxfvqd/im_losing_all_my_japanese_food_safe_foods_and_its/",
  "score": 99,
  "num_comments": 33,
  "comments": [
    {
      "id": "m68qoqd",
      "author": "OpheliaJade2382",
      "body": "I get it too. Losing a safe food is so devastating",
      "created_utc": 1736438647.0,
      "score": 59,
      "context": []
    },
    {
      "id": "m690a9b",
      "author": "angeltay",
      "body": "I lost sushi the same way! My repulsion has always been cooked meat for the taste and texture. I could handle the taste and texture of sushi for a few years, though. Until my brain did the same thing: ~~”That was flesh. That thing used to be alive. You ate blood vessels and shit. You’re gross.”~~",
      "created_utc": 1736441469.0,
      "score": 21,
      "context": []
    },
    {
      "id": "m69clgq",
      "author": "aloevera678",
      "body": "Have the bowl without the salmon! You could try replacing it with another protein that you enjoy maybe. I love sushi but I never get fish for this reason! I’ll get veggie or chicken based sushi",
      "created_utc": 1736445035.0,
      "score": 11,
      "context": []
    },
    {
      "id": "m69lkmc",
      "author": "FlemFatale",
      "body": "Instant ramen is one of my safe foods. I used to eat multiple flavours, and last year, it went down to 6. Now I'm down to 2 and had one last night, and it tasted weird, so I think I'm gonna lose that flavour soon.  \nI really can't afford to lose another (semi) substantial (all my others are snacks really) safe food right now. I lost one a couple of months ago that has made quite a few others also be weird for me.  \nSuch a pain in the arse.",
      "created_utc": 1736447627.0,
      "score": 8,
      "context": []
    },
    {
      "id": "m6ag2ea",
      "author": "AnonDxde",
      "body": "That is how I lost the ability to eat all meat. I could still eat fish for a little while, but I’m slowly losing the ability to. For the same reason. I’m sorry.",
      "created_utc": 1736456480.0,
      "score": 6,
      "context": []
    },
    {
      "id": "m69q8wm",
      "author": "mackingcheesee",
      "body": "I experience this too, and the only way I can move past it is taking a huge break from that food, even if it’s months to a year. I know you said no advice but yeah I just want you to know it’s pretty “normal” for ARFID havers but those moments aren’t permanent and to just give it some time! I’ve taken breaks from previously safe foods, and then I feel sick of it and don’t force myself to eat it and make myself feel worse but then after a long time has passed I grow to love it again. ",
      "created_utc": 1736448965.0,
      "score": 5,
      "context": []
    },
    {
      "id": "m6a437p",
      "author": "Euphemia-Alder",
      "body": "I was the same way. I primarily ate Japanese food for 10-15 years and then all of a sudden I started to get repulsed by it. I cannot eat sushi anymore or seafood for that matter, developed an allergy to rice, and find I’m super averse to it. I’m giving myself a break from eating it to see if that can reset my brain into liking it again! \n\nYou’re not alone. It’s distressing and can be really scary to lose safe foods (I cried when I found out about the rice allergy).",
      "created_utc": 1736452974.0,
      "score": 4,
      "context": []
    },
    {
      "id": "m6acqun",
      "author": "Fearless_Nope",
      "body": "hey OP, i’m not an sort of professional but the specific way you’re describing how your brain is ruining food for you sounds a lot like OCD..                      \nplease take that with a grain of salt, again i’m just a person who reads the DSM5 for fun. zero credentials. \n\nbut i would suggest not trying to suppress those thoughts, trying not to think about it is only going to make you think about more. \n\nfor example if we were listening to a song, and i asked you to “focus on the guitar”- you could probably pick the guitar out from all the other instruments, right?                                                             \nbut, what if i also said “there’s a good drum solo coming up”- you could probably swap over and pick out the drum now. \n\nyou don’t try to ignore the guitar, or the bass, or the keyboardist, you just focused on the drums and the guitar melody faded into the background. \n\nit’s hard to catch yourself in the middle of a thought, it’s possible over time though.                         \nbut avoiding foods is only gonna reinforce this habit unfortunately, i always revisit old safe foods over time just to double to check- sometimes i win, mostly i lose, but a win is a win no matter what. \n\ni know this was long winded, but i dunno, i hope something in this can be of use.                                       \ni wish you the best of luck",
      "created_utc": 1736455516.0,
      "score": 4,
      "context": []
    },
    {
      "id": "m6aux0c",
      "author": "prettyprettythingwow",
      "body": "Hey I couldn’t read most of this because I can’t handle meat at all. But that sounds like OCD overlapping with ARFID. It’s why I originally stopped eating meat, same sort of realizations, same horrific intrusive thoughts and flashes of images.",
      "created_utc": 1736460883.0,
      "score": 5,
      "context": []
    },
    {
      "id": "m6aqwym",
      "author": "Fantastic_Sector_282",
      "body": "Sorry for your loss. :(\n\nSkip if you're not looking for advice. Much love to you. \n\nIf it helps, live and very recently live fish have a slightly different texture than most sushi filets by the time they are served, and most fish is flash frozen for shipping which also alters the texture and makes it safer to eat than chomping into a live critter. Brains are weird and maybe knowing that could help?\n\nSome folks make false tuna using tomato slices, if you ever want to pursue an adjacent texture.",
      "created_utc": 1736459669.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m6bgdsp",
      "author": "amstarcasanova",
      "body": "Exactly the same for me, it's like one bite of tuna and my brain is like ew fleshy poor animal. Especially if it hits directly in between two teeth a certain way and it squishes 🤮 immediately want to vomit.",
      "created_utc": 1736467889.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m6dfuvu",
      "author": "InterestingPie1592",
      "body": "This might sound crazy but when you think these intrusive thoughts you should do a repetitive motion. For example press down on your baby finger. Every time you think it do that same action. Make it an action you don’t do much. Then do a new action and think positive thoughts about the dish. For example press your index finger. Make sure it’s consistent. Do it for a few weeks and you should be able to train your thoughts to appear from your motions just like a Pavlov dog 😅. Once that’s definitely set try the fish again doing the happy motion (pressing your index finger) and seeing if that works. \n\nIt can take a while especially for more stubborn brains but it can work. I loved spag bol but then my brain made spaghetti out to look like worms/maggots when my husband joked it once looked raw and wriggling. Took me a few weeks but I did fix it. Granted I don’t have ARFID I have quite severe OCD but the two conditions can overlap. \n\nJust a thought to try.",
      "created_utc": 1736497494.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m6dhble",
      "author": "dontsummondemons",
      "body": "no I get it, Topokki is currently my main safe food and I’m absolutely dreading the day my brain goes on the warpath and I just stop liking it 😭",
      "created_utc": 1736498428.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m6idbfy",
      "author": "crochetsweetie",
      "body": "when i lose one i give myself quite a while, 6 months to a year, if not seeing or eating it. after that time i revisit it, and i almost always start enjoying it again! maybe that could be something you try?",
      "created_utc": 1736560709.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m6a66vc",
      "author": "kwaqiswhack",
      "body": "My Shit Brain did the exact same thing to me with chicken!!! I stopped eating it for probably about a year, and then slowly came back to it. Now I eat it constantly!!  Idk why our shit brains are like this, but I feel for you. Time and distance may help.",
      "created_utc": 1736453598.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m6is1rl",
      "author": "Flownique",
      "body": "The good news is that CBT and meds are really effective at treating intrusive thoughts. You won’t be magically cured or anything but it’ll really help. Look up “ cognitive distortions exercises “ and give it a try.",
      "created_utc": 1736566025.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m68uk15",
      "author": "DifferentIsPossble",
      "body": "Thanks, man. I'm hoping if I cool it on the salmon for a few months I can reset the brainweird?",
      "created_utc": 1736439799.0,
      "score": 25,
      "context": [
        {
          "id": "m68qoqd",
          "author": "OpheliaJade2382",
          "body": "I get it too. Losing a safe food is so devastating",
          "created_utc": 1736438647.0
        }
      ]
    },
    {
      "id": "m691bjy",
      "author": "DifferentIsPossble",
      "body": "LITERALLY. I'm hoping I can just cool it on the salmon for a few months or as long as it takes for Shit Brain to get distracted. Thank? God? for adhd?",
      "created_utc": 1736441768.0,
      "score": 8,
      "context": [
        {
          "id": "m690a9b",
          "author": "angeltay",
          "body": "I lost sushi the same way! My repulsion has always been cooked meat for the taste and texture. I could handle the taste and texture of sushi for a few years, though. Until my brain did the same thing: ~~”That was flesh. That thing used to be alive. You ate blood vessels and shit. You’re gross.”~~",
          "created_utc": 1736441469.0
        }
      ]
    },
    {
      "id": "m69d48l",
      "author": "DifferentIsPossble",
      "body": "That's the plan for next time! Luckily this time it only kicked in as I was well into the salmon section so I could fairly easily just set it aside with some buffer rice bc of the nature of the poke bowl.",
      "created_utc": 1736445184.0,
      "score": 7,
      "context": [
        {
          "id": "m69clgq",
          "author": "aloevera678",
          "body": "Have the bowl without the salmon! You could try replacing it with another protein that you enjoy maybe. I love sushi but I never get fish for this reason! I’ll get veggie or chicken based sushi",
          "created_utc": 1736445035.0
        }
      ]
    },
    {
      "id": "m6a14dp",
      "author": "DifferentIsPossble",
      "body": "I'm so sorry, man. That absolutely blows. I'm in a slightly better situation rn but I've been where you are and lost my One Food. Idk what to say other than drink lots of electrolytes if you can and hang in there?",
      "created_utc": 1736452111.0,
      "score": 3,
      "context": [
        {
          "id": "m69lkmc",
          "author": "FlemFatale",
          "body": "Instant ramen is one of my safe foods. I used to eat multiple flavours, and last year, it went down to 6. Now I'm down to 2 and had one last night, and it tasted weird, so I think I'm gonna lose that flavour soon.  \nI really can't afford to lose another (semi) substantial (all my others are snacks really) safe food right now. I lost one a couple of months ago that has made quite a few others also be weird for me.  \nSuch a pain in the arse.",
          "created_utc": 1736447627.0
        }
      ]
    },
    {
      "id": "m6dorpp",
      "author": "Oribeun",
      "body": "I totally get it, my safe food mainly consists of pasta and noodles.\nEvery time I find noodles I actually really like, there wil come a moment -be it in three weeks or three years- that the ingredients are canged up and even the slightest change makes them taste off to me.\nThis happens over and over again.",
      "created_utc": 1736503232.0,
      "score": 2,
      "context": [
        {
          "id": "m69lkmc",
          "author": "FlemFatale",
          "body": "Instant ramen is one of my safe foods. I used to eat multiple flavours, and last year, it went down to 6. Now I'm down to 2 and had one last night, and it tasted weird, so I think I'm gonna lose that flavour soon.  \nI really can't afford to lose another (semi) substantial (all my others are snacks really) safe food right now. I lost one a couple of months ago that has made quite a few others also be weird for me.  \nSuch a pain in the arse.",
          "created_utc": 1736447627.0
        }
      ]
    },
    {
      "id": "m6a0wix",
      "author": "DifferentIsPossble",
      "body": "I didn't say no advice, just ambivalent honestly? But I appreciate it.\n\nI just hope it's not a trend of my body rejecting foods now.",
      "created_utc": 1736452048.0,
      "score": 3,
      "context": [
        {
          "id": "m69q8wm",
          "author": "mackingcheesee",
          "body": "I experience this too, and the only way I can move past it is taking a huge break from that food, even if it’s months to a year. I know you said no advice but yeah I just want you to know it’s pretty “normal” for ARFID havers but those moments aren’t permanent and to just give it some time! I’ve taken breaks from previously safe foods, and then I feel sick of it and don’t force myself to eat it and make myself feel worse but then after a long time has passed I grow to love it again. ",
          "created_utc": 1736448965.0
        }
      ]
    },
    {
      "id": "m6axgm7",
      "author": "DifferentIsPossble",
      "body": "Honestly, I get pretty serious intrusive thoughts but none of the other clinical stuff for OCD. It's most likely an autism thing, per a psychiatrist that tried the OCD route on me. Thanks for the advice though!",
      "created_utc": 1736461668.0,
      "score": 3,
      "context": [
        {
          "id": "m6aux0c",
          "author": "prettyprettythingwow",
          "body": "Hey I couldn’t read most of this because I can’t handle meat at all. But that sounds like OCD overlapping with ARFID. It’s why I originally stopped eating meat, same sort of realizations, same horrific intrusive thoughts and flashes of images.",
          "created_utc": 1736460883.0
        }
      ]
    },
    {
      "id": "m6b9lae",
      "author": "DifferentIsPossble",
      "body": "Huh, that actually does help, thank you. How much different is it than a salmon piece for sushi or poke, if you don't mind saying?",
      "created_utc": 1736465601.0,
      "score": 2,
      "context": [
        {
          "id": "m6aqwym",
          "author": "Fantastic_Sector_282",
          "body": "Sorry for your loss. :(\n\nSkip if you're not looking for advice. Much love to you. \n\nIf it helps, live and very recently live fish have a slightly different texture than most sushi filets by the time they are served, and most fish is flash frozen for shipping which also alters the texture and makes it safer to eat than chomping into a live critter. Brains are weird and maybe knowing that could help?\n\nSome folks make false tuna using tomato slices, if you ever want to pursue an adjacent texture.",
          "created_utc": 1736459669.0
        }
      ]
    },
    {
      "id": "m6c9r4d",
      "author": "Sugacookiemonsta",
      "body": "It's worked for me! It was eggs for me for several months. Just the smell would make me gag. I still have some bad days but I can crave them now. I only like them when I personally cook them a certain way though. Thing is, I didn't have any issues with them before all of a sudden, I couldn't tolerate the thought of eating them. So now that goes and comes. Hopefully you will gain salmon back but at least for me, one that aversion started, it's never fully gone away.",
      "created_utc": 1736477790.0,
      "score": 7,
      "context": [
        {
          "id": "m68qoqd",
          "author": "OpheliaJade2382",
          "body": "I get it too. Losing a safe food is so devastating",
          "created_utc": 1736438647.0
        },
        {
          "id": "m68uk15",
          "author": "DifferentIsPossble",
          "body": "Thanks, man. I'm hoping if I cool it on the salmon for a few months I can reset the brainweird?",
          "created_utc": 1736439799.0
        }
      ]
    },
    {
      "id": "m6idcwb",
      "author": "crochetsweetie",
      "body": "that works for me all the time!",
      "created_utc": 1736560723.0,
      "score": 2,
      "context": [
        {
          "id": "m68qoqd",
          "author": "OpheliaJade2382",
          "body": "I get it too. Losing a safe food is so devastating",
          "created_utc": 1736438647.0
        },
        {
          "id": "m68uk15",
          "author": "DifferentIsPossble",
          "body": "Thanks, man. I'm hoping if I cool it on the salmon for a few months I can reset the brainweird?",
          "created_utc": 1736439799.0
        }
      ]
    },
    {
      "id": "m69cu62",
      "author": "angeltay",
      "body": "I’m praying for the return of salmon to your safe foods list!! 🙏🤞🫡",
      "created_utc": 1736445104.0,
      "score": 8,
      "context": [
        {
          "id": "m690a9b",
          "author": "angeltay",
          "body": "I lost sushi the same way! My repulsion has always been cooked meat for the taste and texture. I could handle the taste and texture of sushi for a few years, though. Until my brain did the same thing: ~~”That was flesh. That thing used to be alive. You ate blood vessels and shit. You’re gross.”~~",
          "created_utc": 1736441469.0
        },
        {
          "id": "m691bjy",
          "author": "DifferentIsPossble",
          "body": "LITERALLY. I'm hoping I can just cool it on the salmon for a few months or as long as it takes for Shit Brain to get distracted. Thank? God? for adhd?",
          "created_utc": 1736441768.0
        }
      ]
    },
    {
      "id": "m69e23j",
      "author": "aloevera678",
      "body": "So unfortunate though. I get this way with basically all meat and eggs too :( Some months it’s totally fine and then one day I’m like omg this is literal flesh",
      "created_utc": 1736445455.0,
      "score": 3,
      "context": [
        {
          "id": "m69clgq",
          "author": "aloevera678",
          "body": "Have the bowl without the salmon! You could try replacing it with another protein that you enjoy maybe. I love sushi but I never get fish for this reason! I’ll get veggie or chicken based sushi",
          "created_utc": 1736445035.0
        },
        {
          "id": "m69d48l",
          "author": "DifferentIsPossble",
          "body": "That's the plan for next time! Luckily this time it only kicked in as I was well into the salmon section so I could fairly easily just set it aside with some buffer rice bc of the nature of the poke bowl.",
          "created_utc": 1736445184.0
        }
      ]
    },
    {
      "id": "m6aib5m",
      "author": "FlemFatale",
      "body": "Thanks, random internet friend!  \nIt's not all too bad, as if I'm away from home and have a distraction or it's obviously time to eat (I mainly forget, because I don't feel hunger that much) then it is easier as long as there are lots of distractions.  \nI'm definitely trying, though, and have GP support, so that is one good thing!  \nI hope it gets better for you as well though, it fucking sucks when you lose safe foods either way!",
      "created_utc": 1736457137.0,
      "score": 2,
      "context": [
        {
          "id": "m69lkmc",
          "author": "FlemFatale",
          "body": "Instant ramen is one of my safe foods. I used to eat multiple flavours, and last year, it went down to 6. Now I'm down to 2 and had one last night, and it tasted weird, so I think I'm gonna lose that flavour soon.  \nI really can't afford to lose another (semi) substantial (all my others are snacks really) safe food right now. I lost one a couple of months ago that has made quite a few others also be weird for me.  \nSuch a pain in the arse.",
          "created_utc": 1736447627.0
        },
        {
          "id": "m6a14dp",
          "author": "DifferentIsPossble",
          "body": "I'm so sorry, man. That absolutely blows. I'm in a slightly better situation rn but I've been where you are and lost my One Food. Idk what to say other than drink lots of electrolytes if you can and hang in there?",
          "created_utc": 1736452111.0
        }
      ]
    },
    {
      "id": "m6e0rzy",
      "author": "FlemFatale",
      "body": "Oh yeah! That as well.  \nI can't eat freddos (chocolate bar in the UK) anymore since they changed the shape, the wrapper, and the ingredients.",
      "created_utc": 1736510240.0,
      "score": 2,
      "context": [
        {
          "id": "m69lkmc",
          "author": "FlemFatale",
          "body": "Instant ramen is one of my safe foods. I used to eat multiple flavours, and last year, it went down to 6. Now I'm down to 2 and had one last night, and it tasted weird, so I think I'm gonna lose that flavour soon.  \nI really can't afford to lose another (semi) substantial (all my others are snacks really) safe food right now. I lost one a couple of months ago that has made quite a few others also be weird for me.  \nSuch a pain in the arse.",
          "created_utc": 1736447627.0
        },
        {
          "id": "m6dorpp",
          "author": "Oribeun",
          "body": "I totally get it, my safe food mainly consists of pasta and noodles.\nEvery time I find noodles I actually really like, there wil come a moment -be it in three weeks or three years- that the ingredients are canged up and even the slightest change makes them taste off to me.\nThis happens over and over again.",
          "created_utc": 1736503232.0
        }
      ]
    },
    {
      "id": "m6bfbq3",
      "author": "prettyprettythingwow",
      "body": "Gotcha, I also have autism, but my OCD is called “pure O” because I don’t really have rituals, just lots of thought processes and paralyzation or avoidance. Just reminded me of that exactly!",
      "created_utc": 1736467535.0,
      "score": 2,
      "context": [
        {
          "id": "m6aux0c",
          "author": "prettyprettythingwow",
          "body": "Hey I couldn’t read most of this because I can’t handle meat at all. But that sounds like OCD overlapping with ARFID. It’s why I originally stopped eating meat, same sort of realizations, same horrific intrusive thoughts and flashes of images.",
          "created_utc": 1736460883.0
        },
        {
          "id": "m6axgm7",
          "author": "DifferentIsPossble",
          "body": "Honestly, I get pretty serious intrusive thoughts but none of the other clinical stuff for OCD. It's most likely an autism thing, per a psychiatrist that tried the OCD route on me. Thanks for the advice though!",
          "created_utc": 1736461668.0
        }
      ]
    },
    {
      "id": "m6hfra0",
      "author": "abitbuzzed",
      "body": "Pure O is a thing?? Bc if so, I think that's me. Thoughts like OP's are a HUGE part of my ARFID, and my recent neuropsych assessment said subclinical OCD but not enough for a diagnosis bc I don't have \"delusions\" associated with the obsessive thinking -- like, nothing about the thoughts is fantastical, so it can't be OCD. That sounded bizarre to me but what you're saying would make a lot of sense for me.",
      "created_utc": 1736549342.0,
      "score": 1,
      "context": [
        {
          "id": "m6aux0c",
          "author": "prettyprettythingwow",
          "body": "Hey I couldn’t read most of this because I can’t handle meat at all. But that sounds like OCD overlapping with ARFID. It’s why I originally stopped eating meat, same sort of realizations, same horrific intrusive thoughts and flashes of images.",
          "created_utc": 1736460883.0
        },
        {
          "id": "m6axgm7",
          "author": "DifferentIsPossble",
          "body": "Honestly, I get pretty serious intrusive thoughts but none of the other clinical stuff for OCD. It's most likely an autism thing, per a psychiatrist that tried the OCD route on me. Thanks for the advice though!",
          "created_utc": 1736461668.0
        },
        {
          "id": "m6bfbq3",
          "author": "prettyprettythingwow",
          "body": "Gotcha, I also have autism, but my OCD is called “pure O” because I don’t really have rituals, just lots of thought processes and paralyzation or avoidance. Just reminded me of that exactly!",
          "created_utc": 1736467535.0
        }
      ]
    },
    {
      "id": "m6ii4f3",
      "author": "prettyprettythingwow",
      "body": "Yes, the majority of the field agrees it is a thing. It’s an easier way to understand the version of OCD. What we do see is that the “rituals” exist they’re just often only happening in my brain or directing behavior. So maybe we don’t check a doorknob, but we walk a certain way down the sidewalk because it “just feels wrong” and that’s often connected to something else that day. That’s not a good example. We’d also sometimes classify some of my responses as rituals because I fall into a comfort task to avoid the bad feeling that come from ocd causing me to avoid the undesired thing. In contamination OCD, I find I have rituals they’re just not noticeable or visible particularly. For example, I realized that if I touched something dirty, even if I washed my hands, the tips of those fingers would be contaminated for me. Or like I’d try to move something gross with just one finger trip or use just my nails to move a napkin. Then, indefinitely until like a shower maybe, I would kind of quarantine that finger without putting much thought into it. I starting trying to be really present in what I’m doing and I noticed I hold things weird and then I was like wait, that’s ocd! Forcing myself to fully grip things is still not something I can totally do. Picking through and examining food is another type of ritual. “Delusions” are also just magical thinking in OCD. Like if I don’t touch anything with my finger that I used to open the car door, nothing else will be infected. Even if I’ve washed it, it’s still dirty. Now, if my dog licked that finger it feels neutral again and is “clean” but not clean for my mouth. There are levels. These levels are also delusional to the degree that we take them in OCD. Same with like if I eat a weird piece of rice or a bug something bad will happen is a delusion/magical thinking. Same thing if it’s more defined, like if I eat a bad piece of rice it will give me a disease. Another good delusion of mine is that I would like to say “but obviously that’s not going to happen.” But my brain says WHAT IF IT DOES and then I’d be a liar or possibly have caused this to happen because I brought attention to it. Just…trust me, there are delusions lol. Just not always the typical ones.",
      "created_utc": 1736562387.0,
      "score": 2,
      "context": [
        {
          "id": "m6aux0c",
          "author": "prettyprettythingwow",
          "body": "Hey I couldn’t read most of this because I can’t handle meat at all. But that sounds like OCD overlapping with ARFID. It’s why I originally stopped eating meat, same sort of realizations, same horrific intrusive thoughts and flashes of images.",
          "created_utc": 1736460883.0
        },
        {
          "id": "m6axgm7",
          "author": "DifferentIsPossble",
          "body": "Honestly, I get pretty serious intrusive thoughts but none of the other clinical stuff for OCD. It's most likely an autism thing, per a psychiatrist that tried the OCD route on me. Thanks for the advice though!",
          "created_utc": 1736461668.0
        },
        {
          "id": "m6bfbq3",
          "author": "prettyprettythingwow",
          "body": "Gotcha, I also have autism, but my OCD is called “pure O” because I don’t really have rituals, just lots of thought processes and paralyzation or avoidance. Just reminded me of that exactly!",
          "created_utc": 1736467535.0
        },
        {
          "id": "m6hfra0",
          "author": "abitbuzzed",
          "body": "Pure O is a thing?? Bc if so, I think that's me. Thoughts like OP's are a HUGE part of my ARFID, and my recent neuropsych assessment said subclinical OCD but not enough for a diagnosis bc I don't have \"delusions\" associated with the obsessive thinking -- like, nothing about the thoughts is fantastical, so it can't be OCD. That sounded bizarre to me but what you're saying would make a lot of sense for me.",
          "created_utc": 1736549342.0
        }
      ]
    }
  ]
}