{
  "id": "1hzb1q4",
  "subreddit": "ARFID",
  "author": "blaiiiiir",
  "created_utc": 1736643995.0,
  "title": "does anyone else get really annoyed/upset when people refer to ARFID as “picky eating”?",
  "selftext": "It just seems so dismissive, idk how to explain it. Like for example, I see so many videos on tiktok of people posting about their kids eating habits that are *unmistakably* ARFID and then go on to just say “they’re the pickiest eater”. It’s just so trivializing and makes me so upset. ARFID is so much more than just “picky eating” and it drives me crazy when people fail to acknowledge it",
  "url": "https://www.reddit.com/r/ARFID/comments/1hzb1q4/does_anyone_else_get_really_annoyedupset_when/",
  "score": 243,
  "num_comments": 26,
  "comments": [
    {
      "id": "m6o6e7s",
      "author": "Sunny-the-Human",
      "body": "It certainly can be annoying, but I also try to be forgiving about it since the vast majority of people have no clue what ARFID even is. They’re likely trying their best to describe the problem in terms they understand more easily. It only truly bothers me when I explain what ARFID is and then others continue to minimize it as if their food will somehow be the holy exception to not affect my *eating disorder* in the slightest.",
      "created_utc": 1736644341.0,
      "score": 81,
      "context": []
    },
    {
      "id": "m6of6dv",
      "author": "intelligence_spiral",
      "body": "Im newly diagnosed and ive been explaining it to my family as “kinda a picky eating disorder” Oops. Can anyone give me advice on how to describe Arfid properly?",
      "created_utc": 1736647349.0,
      "score": 29,
      "context": []
    },
    {
      "id": "m6oexr5",
      "author": "esteemed-colleague",
      "body": "For me it’s the way they say it, usually dismissively with a tinge of judgement.",
      "created_utc": 1736647271.0,
      "score": 11,
      "context": []
    },
    {
      "id": "m6oiu8k",
      "author": "ManicMaenads",
      "body": "Picky eating makes it sound like it's a choice, or that it's about preferences - while for ARFID it's very much not something we're choosing to do.\n\nI would love to be able to eat any type of food whenever, that would make my life so much easier. Unfortunately, despite my best efforts, some foods make me dry-heave and vomit when I force myself to eat it anyhow.\n\nI'm not deciding to vomit and dry-heave out of spite or as some sort of insult or control thing, my body is doing it against my will and I'm ashamed and humiliated that it happens at all.\n\nNot trying to be \"picky\". My body just sucks at tolerating specific smells, textures, and flavours.",
      "created_utc": 1736648632.0,
      "score": 24,
      "context": []
    },
    {
      "id": "m6ogszv",
      "author": "Mac-And-Cheesy-43",
      "body": "I use picky eating sometimes, mainly because I sometimes don’t feel like trying to make a reason why I’m not eating and I’m not ready to launch into the ED discussion. Same reason I sometimes say ”I don’t handle people well”. It’s not 100 percent correct but it’s than going into technical terminology that may be more loaded than I want to put up with, and often has a lot more relatability that way.",
      "created_utc": 1736647917.0,
      "score": 9,
      "context": []
    },
    {
      "id": "m6ofgie",
      "author": "Culvingg",
      "body": "No, hell I’ll tell people I’m a picky eater before I tell them I have arfid.",
      "created_utc": 1736647446.0,
      "score": 16,
      "context": []
    },
    {
      "id": "m6otwxr",
      "author": "CSMom74",
      "body": "Well keep in mind that this disorder didn't have an official name until several years ago. Before that there was no other name that they called it, and that's what pretty much everyone just called it. Picky eating. There's not enough awareness or publicity about this disorder that anyone would know better. I wouldn't think too much of it.",
      "created_utc": 1736652675.0,
      "score": 9,
      "context": []
    },
    {
      "id": "m6ofrzx",
      "author": "Maxusam",
      "body": "No, it’s not a well known disorder yet. I didn’t even know about it until I needed to. :(",
      "created_utc": 1736647556.0,
      "score": 4,
      "context": []
    },
    {
      "id": "m6prmvc",
      "author": "Used_Platform_3114",
      "body": "Yep. They wouldn’t call someone with hip problems a “picky walker”.",
      "created_utc": 1736669497.0,
      "score": 8,
      "context": []
    },
    {
      "id": "m6phdze",
      "author": "StrawbraryLiberry",
      "body": "Yeah, it makes me really angry. \n\nI worked extremely hard not to be picky, and unfortunately, I will always be prone to ARFID- it's not like we choose this. (I'm pretty sure it's a genetic thing & stress thing.) \n\nI don't choose to buy food and then be physically incapable of eating it. I don't choose to make dinner and be so disgusted by it I almost give up eating anything. \n\nThis isn't fun, and it has had serious health implications for me. \n\nIt's not benign. It's not something I chose. It's not something I can control, because I have absolutely tried. \n\nIt's easy for them to call people picky when they don't deal with this crap.",
      "created_utc": 1736663415.0,
      "score": 4,
      "context": []
    },
    {
      "id": "m6r4cr9",
      "author": "NSBJenni",
      "body": "If ARFID is just picky eating then a migraine is just a headache.  It’s not a perfect analogy but gets the point across.  (maybe)",
      "created_utc": 1736694555.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m6rtjyf",
      "author": "okconcussion",
      "body": "unfortunately i feel like this is the quintessential ARFID experience",
      "created_utc": 1736702380.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m6ryd9m",
      "author": "DullSport382",
      "body": "Yea, it particularly upsets me that the term is still used in research. I want to do a phd looking at arfid and there are ones advertised with picky eating as the title rather than the disorder name. I get that it’s not really well known as a disorder but it feels like minimising the experience to say picky eating.",
      "created_utc": 1736703779.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m6vwggw",
      "author": "Prior-Payment6962",
      "body": "It's insanely annoying, not to mention insensitive. Even my dad, who calls everyone a snowflake gets upset on my behalf when it's referred to as \"picky eating\". My growth is stunted due to malnourishment. I grew up eating mashed potatoes and ice cream breakfast lunch and dinner. I still have panic attacks over feeling full. I starve myself for days on end because the feeling of anything in my stomach makes me want to curl into a ball and cry. My body has suffered so much because of this \"quirk\" of mine.",
      "created_utc": 1736752074.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m6rgal6",
      "author": "purplechunkymonkey",
      "body": "ARFID is not well known. I only knew of it because of this sub. My daughter was diagnosed as a difficult feeder by her pediatrician. She does not eat a typical picky eater diet. And even for ARFID, she eats fairly healthy. She has severe anxiety about food. Her psychiatrist agrees that it's ARFID.",
      "created_utc": 1736698489.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m6s31d6",
      "author": "missredshoes_",
      "body": "Yes!",
      "created_utc": 1736705078.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m6u4d34",
      "author": "Domestic_Fox",
      "body": "If someone calls me or someone I love, like my kids, a picky eater, I simply say, “it’s arfid” then they normally say what? And I say “it’s arfid. It’s an eating disorder. If they try to backtrack, or worse double down I just repeat, “it’s an eating disorder. No one wants to have an eating disorder it’s terribly detrimental to their health mentally and physically”",
      "created_utc": 1736726675.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m74q37y",
      "author": "Pretend-Ostrich-9602",
      "body": "Yess!! I remember being young and being constantly picked on by my siblings. “When we were your age, we ate what mom and dad made and we didn’t have a choice. But mom and dad baby you because you’re ‘too picky’. You’re just ungrateful.” Usually said whenever I was made a different simple meal like spaghetti as opposed to what they were eating for dinner. I don’t blame them bc they didn’t know any better and from the outside it did look like special treatment especially bc they were never offered the same thing but it was really frustrating. Because I grew up telling myself “why do you need to be so picky?? You are a burden. You cause unnecessary inconvenience to mom and dad by FORCING them to make you a different meal. Just get over it and stop being so picky and ungrateful.” But then when I tried to eat what they were eating I would feel a pit in my stomach until my anxiety started bubbling up and I could do nothing but cry because I was so frightened. Ppl telling me I could change and that I was being irrational when it felt like something I couldn’t control put so much guilt and shame on my shoulders and I shouldn’t have felt like such an inconvenience at such a young age.\n\nWhich is why, while I do understand that they don’t always mean harm by just chalking it up to “being picky” and that a lot of people don’t even know what arfid is, I also am sometimes annoyed by it because it’s caused so much confusion and self hatred for me personally.",
      "created_utc": 1736876617.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m75yeyc",
      "author": "None",
      "body": "I've been a 'picky eater' all my life, it drives me crazy. Everyone acts like I'm choosing this but really I cry often over it. I'm coming to terms that it's not me, I'm not making this choice and that it is a disorder. \nBeing told I am just a picky eater who needs to just try food really ruins the rest of my day.",
      "created_utc": 1736889989.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m6ogf5m",
      "author": "kittysparkles85",
      "body": "It's an eating disorder. That's it because that's what it is.",
      "created_utc": 1736647784.0,
      "score": 25,
      "context": [
        {
          "id": "m6of6dv",
          "author": "intelligence_spiral",
          "body": "Im newly diagnosed and ive been explaining it to my family as “kinda a picky eating disorder” Oops. Can anyone give me advice on how to describe Arfid properly?",
          "created_utc": 1736647349.0
        }
      ]
    },
    {
      "id": "m6oijdc",
      "author": "weinthenolababy",
      "body": "I say “selective eating” instead of picky eating. To me picky sounds like you’re being childish and you could eat it but you just don’t wanna.",
      "created_utc": 1736648532.0,
      "score": 34,
      "context": [
        {
          "id": "m6of6dv",
          "author": "intelligence_spiral",
          "body": "Im newly diagnosed and ive been explaining it to my family as “kinda a picky eating disorder” Oops. Can anyone give me advice on how to describe Arfid properly?",
          "created_utc": 1736647349.0
        }
      ]
    },
    {
      "id": "m6w043h",
      "author": "uhohitslilbboy",
      "body": "I describe in two ways. One: it presents similar to anorexia, but focused on taste and texture and hygiene instead of weight or calories. \n\nTwo: my brain doesn’t register food as food. It registers it as poison. My body doesn’t want me to eat poison. So it’s trying to keep me safe.",
      "created_utc": 1736754302.0,
      "score": 4,
      "context": [
        {
          "id": "m6of6dv",
          "author": "intelligence_spiral",
          "body": "Im newly diagnosed and ive been explaining it to my family as “kinda a picky eating disorder” Oops. Can anyone give me advice on how to describe Arfid properly?",
          "created_utc": 1736647349.0
        }
      ]
    },
    {
      "id": "m6r3vtf",
      "author": "NSBJenni",
      "body": "To me, selective makes it sounds like you’re making a choice; selecting something, or not.",
      "created_utc": 1736694396.0,
      "score": 13,
      "context": [
        {
          "id": "m6of6dv",
          "author": "intelligence_spiral",
          "body": "Im newly diagnosed and ive been explaining it to my family as “kinda a picky eating disorder” Oops. Can anyone give me advice on how to describe Arfid properly?",
          "created_utc": 1736647349.0
        },
        {
          "id": "m6oijdc",
          "author": "weinthenolababy",
          "body": "I say “selective eating” instead of picky eating. To me picky sounds like you’re being childish and you could eat it but you just don’t wanna.",
          "created_utc": 1736648532.0
        }
      ]
    },
    {
      "id": "m6t3iw4",
      "author": "Rogue_Spirit",
      "body": "It’s not really selective for many of us.",
      "created_utc": 1736715422.0,
      "score": 2,
      "context": [
        {
          "id": "m6of6dv",
          "author": "intelligence_spiral",
          "body": "Im newly diagnosed and ive been explaining it to my family as “kinda a picky eating disorder” Oops. Can anyone give me advice on how to describe Arfid properly?",
          "created_utc": 1736647349.0
        },
        {
          "id": "m6oijdc",
          "author": "weinthenolababy",
          "body": "I say “selective eating” instead of picky eating. To me picky sounds like you’re being childish and you could eat it but you just don’t wanna.",
          "created_utc": 1736648532.0
        }
      ]
    },
    {
      "id": "m6zaoti",
      "author": "intelligence_spiral",
      "body": "Ok, thanks! I have the lack of interest type of arfid so its not driven by fear for me necessarily. Interesting to learn about, thanks :)",
      "created_utc": 1736800372.0,
      "score": 2,
      "context": [
        {
          "id": "m6of6dv",
          "author": "intelligence_spiral",
          "body": "Im newly diagnosed and ive been explaining it to my family as “kinda a picky eating disorder” Oops. Can anyone give me advice on how to describe Arfid properly?",
          "created_utc": 1736647349.0
        },
        {
          "id": "m6w043h",
          "author": "uhohitslilbboy",
          "body": "I describe in two ways. One: it presents similar to anorexia, but focused on taste and texture and hygiene instead of weight or calories. \n\nTwo: my brain doesn’t register food as food. It registers it as poison. My body doesn’t want me to eat poison. So it’s trying to keep me safe.",
          "created_utc": 1736754302.0
        }
      ]
    },
    {
      "id": "m6taqz2",
      "author": "weinthenolababy",
      "body": "I’m just saying the term that I prefer. You may prefer a different one and that’s okay.",
      "created_utc": 1736717568.0,
      "score": 4,
      "context": [
        {
          "id": "m6of6dv",
          "author": "intelligence_spiral",
          "body": "Im newly diagnosed and ive been explaining it to my family as “kinda a picky eating disorder” Oops. Can anyone give me advice on how to describe Arfid properly?",
          "created_utc": 1736647349.0
        },
        {
          "id": "m6oijdc",
          "author": "weinthenolababy",
          "body": "I say “selective eating” instead of picky eating. To me picky sounds like you’re being childish and you could eat it but you just don’t wanna.",
          "created_utc": 1736648532.0
        },
        {
          "id": "m6t3iw4",
          "author": "Rogue_Spirit",
          "body": "It’s not really selective for many of us.",
          "created_utc": 1736715422.0
        }
      ]
    }
  ]
}