{
  "id": "1i3fv5r",
  "subreddit": "ARFID",
  "author": "vEGAN_cHONKER",
  "created_utc": 1737118997.0,
  "title": "child size meals at restaurants",
  "selftext": "I'm 17 and I'm never allowed to get child size dishes at restaurants, they tell me im not young enough, which I think is so stupid cuz for one I'm legally still a child and 2 I CAN NEVER FINISH A NORMAL SIZED MEAL AND END UP HAVING TO LEAVE HALF, obviously the children's portions are smaller and less expensive, which means I don't have to pay for food that I can't finish, and when I explain they just shrug and say it's the rules. Fuck capitalism, I hate restaurants.",
  "url": "https://www.reddit.com/r/ARFID/comments/1i3fv5r/child_size_meals_at_restaurants/",
  "score": 102,
  "num_comments": 34,
  "comments": [
    {
      "id": "m7mf7rq",
      "author": "Entire-Vermicelli-74",
      "body": "I’m 26 and always get kids meals but have to do for takeout/delivery. I hate wasting food and my ARFID doesn’t allow me to have leftovers so I find it so wasteful to have to get full size meals when we dine-in!",
      "created_utc": 1737119618.0,
      "score": 89,
      "context": []
    },
    {
      "id": "m7mybhg",
      "author": "_purbleplace",
      "body": "I’m 21 and usually just ask for “the smallest portion of (insert safe food)” and they’ll say “we have the kids version, is that okay?” and I’ll say yes. I try to make it sound like I ate before getting there or something and usually they don’t care too much",
      "created_utc": 1737126224.0,
      "score": 59,
      "context": []
    },
    {
      "id": "m7mfm42",
      "author": "Miquelissa",
      "body": "I think its because its cheaper on purpose bc of kids, but still they should give you an option unless is a bad restaurant 😅",
      "created_utc": 1737119772.0,
      "score": 25,
      "context": []
    },
    {
      "id": "m7n6bpv",
      "author": "MultiFandomShipperr",
      "body": "I don't understand why they're gatekeeping child meals. I know they are not getting paid enough to care",
      "created_utc": 1737128656.0,
      "score": 20,
      "context": []
    },
    {
      "id": "m7mwqxn",
      "author": "giraffemoo",
      "body": "I am annoyed by this too! \n\nI have a fun story that kind of relates... I was on a date a long time ago and I was able to order the kids portion of chicken strips. It came in a cardboard car! Like a kiddie meal. I was embarrassed but we just laughed about it (the date was an old friend).",
      "created_utc": 1737125731.0,
      "score": 12,
      "context": []
    },
    {
      "id": "m7o2b2w",
      "author": "twatwater",
      "body": "I just don’t take no for an answer. I say, okay, then I don’t want anything. And suddenly they change their minds. :)",
      "created_utc": 1737137863.0,
      "score": 9,
      "context": []
    },
    {
      "id": "m7nub4f",
      "author": "kitty_kosmonaut",
      "body": "I know, it's absurd. Kids meals are the perfect size, better value, and usually food I can actually eat. Plus, sometimes you get a toy! I see no downsides to this haha.     \n\nSome restaurants will let me (a grown-ass woman) order a kids meal if I ask nicely, especially if I'm dining with someone getting a full entree. Never had an issue getting a kids meal for takeout though.",
      "created_utc": 1737135578.0,
      "score": 6,
      "context": []
    },
    {
      "id": "m7n0hc2",
      "author": "None",
      "body": "I always get them. I don’t care. I don’t a lot first and sometimes I just want chicken tenders!!!",
      "created_utc": 1737126894.0,
      "score": 7,
      "context": []
    },
    {
      "id": "m7o4z7y",
      "author": "MoistyCheeks",
      "body": "I think about the scene in “After Life” by Ricky Gervais on Netflix. He takes his nephew to a restaurant and they both get children’s meals, the waitress complains. Ricky then explains to the waitress that it is cheaper, because the portions are smaller, not because they need a safe space for kids. The scene was very funny, and it just goes to show how silly the rules are. https://youtu.be/Q7FxpK_yC0U?si=72TWlbNr0Pnj—SD",
      "created_utc": 1737138621.0,
      "score": 7,
      "context": []
    },
    {
      "id": "m7mh9os",
      "author": "pendigedig",
      "body": "You can at least do it for takeout!",
      "created_utc": 1737120412.0,
      "score": 6,
      "context": []
    },
    {
      "id": "m7ow255",
      "author": "prettyprettythingwow",
      "body": "I’ve never been denied, that’s so strange. Sometimes, I just order several sides, though, and take the extras home. The extras are rarely eaten, but I feel better if they sit in the fridge for a few days 😂",
      "created_utc": 1737146568.0,
      "score": 5,
      "context": []
    },
    {
      "id": "m7pl2v2",
      "author": "OnlineCounselor",
      "body": "May I introduce you to the “bariatric meal card”! (This is not an affiliate link, I get nothing from sharing this):\n\nhttps://a.co/d/3csxnnc\n\nIt’s not guaranteed it will be accepted and it depends on how you morally feel about it…but it’s an option.\n\nI had bariatric surgery 19 years ago and have since developed ARFID. When I first had surgery, I was given something like this because I could hardly eat any amount of food and eating out was almost pointless. Since then, these cards have become more readily available and even though this would be a bit of a sneaky way to get around it, it’s something that they wouldn’t be able to ask about as it’s medical related. \n\nI’ve never found one that doesn’t say “surgical procedure,” so like I said, it depends on your comfort level.",
      "created_utc": 1737154225.0,
      "score": 6,
      "context": []
    },
    {
      "id": "m7ny34x",
      "author": "CTx7567",
      "body": "On my birthday i go to Red Robin and get the kids mac n cheese and my mom calls ahead and talks to the manager and explains im a teen but love the mac n cheese",
      "created_utc": 1737136651.0,
      "score": 4,
      "context": []
    },
    {
      "id": "m7oswh9",
      "author": "Grabagear",
      "body": "They might not let you have a kids meal, but usually if you ask for dessert to be served at the same time as mains, they'll do that. I've done it in a fair few restaurants because I didn't like any mains. Or you can do the same thing for a couple of starters.",
      "created_utc": 1737145619.0,
      "score": 4,
      "context": []
    },
    {
      "id": "m7n35w8",
      "author": "madeleine59",
      "body": "you probably should work on eating more incrementally, assuming youre not getting enough calories and your stomach has shrunk to accommodate",
      "created_utc": 1737127706.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m7niot5",
      "author": "FlemFatale",
      "body": "I'm 35 and still get kids' meals. If that's all you want, that's all you want. I don't understand why anyone has a problem with it...",
      "created_utc": 1737132228.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m7nkss1",
      "author": "StrawbraryLiberry",
      "body": "Any hate towards restaurants has my seal of approval. \n\nBut besides that, I agree. I understand massive portions can be a cultural thing, but I can't eat that much. It's kind of overwhelming to be served so much. It would be really nice if they offered smaller portions even for adults! Some people might really appreciate the option for cheaper & less. \n\nI thought people were allowed to order kids meals! They should be if that's what they want.",
      "created_utc": 1737132830.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m7nljlj",
      "author": "Lylli-Rose",
      "body": "I would cry",
      "created_utc": 1737133040.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m7odeww",
      "author": "gladtobbrown",
      "body": "i’m 22 and relate, last time i went out i asked if i could they said no but they do have smaller portions for some meals. i ended up getting a full plate and it lasted me for 4 dinners !",
      "created_utc": 1737141053.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m7qjqrv",
      "author": "mykineticromance",
      "body": "It's stupid they won't let you order the kid's meal, but if they have food I can eat (or can ask for modifications so I can eat it) on the normal menu, I'll order it then take the leftovers home in a box. All sit down places in my country will have cardboard or styrofoam boxes to take leftovers home, and I always do when I order a full size meal.",
      "created_utc": 1737166304.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m7qy31b",
      "author": "TashaT50",
      "body": "As others have mentioned kid’s meals are frequently loss leaders where the restaurant loses money on those servings. Ask if you can order off the lunch menu as meals tend to be smaller and cheaper. Ask for 1/2 servings but offer to pay full price - I’m willing to pay for the larger serving but don’t want it sitting in front of me - or I’ll request they put half in a to go container before bringing the meal out as it’s less stressful to me - I bring insulated lunch bags with me when I go out. Ask to talk with a manager as sometimes they will work something out with the kids meal by tacking on a few dollars.",
      "created_utc": 1737171834.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m7nm6y9",
      "author": "Lylli-Rose",
      "body": "I would cry",
      "created_utc": 1737133226.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m7p8n16",
      "author": "CozmicOwl16",
      "body": "That’s why we get take out.  I’m 44 and i love a kids meal.",
      "created_utc": 1737150330.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m8244py",
      "author": "soadfreak1214",
      "body": "I have been turned down in the past as well.  Recently a friend told me her mother has to eat small portions because she had a surgery on her stomach.  Her doctor told her it could technically fall under disability discrimination if you have a medical reason for asking for a kids meal in the U.S.  I am not sure how accurate that is but I feel if you mention you have a medical reason for it some of them would change their tune.  Especially if you ask to talk to a manager if they still say no.",
      "created_utc": 1737324601.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m7rvtt0",
      "author": "NoButterOnlyRage",
      "body": "Suuuch a stupid arbitary rule",
      "created_utc": 1737189509.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m84a61f",
      "author": "Gaymer7437",
      "body": "I usually order like two side dishes for myself if I can't get a kids portion. Or an appetizer as a meal because appetizers are smaller than entrees",
      "created_utc": 1737352168.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m7nmfoa",
      "author": "Mean_Mango6955",
      "body": "This. If you do take out/ drive up order, you can just get the kids meal",
      "created_utc": 1737133296.0,
      "score": 22,
      "context": [
        {
          "id": "m7mf7rq",
          "author": "Entire-Vermicelli-74",
          "body": "I’m 26 and always get kids meals but have to do for takeout/delivery. I hate wasting food and my ARFID doesn’t allow me to have leftovers so I find it so wasteful to have to get full size meals when we dine-in!",
          "created_utc": 1737119618.0
        }
      ]
    },
    {
      "id": "m7o6eak",
      "author": "sugaredsnickerdoodle",
      "body": "I believe I heard someone else say in a similar discussion that it's because the kid's meals are only put on the menu in the first place with the expectation that there will be adults bringing the child in and paying for full-sized meals. I think they said kid's meals are kind of a monetary loss, but if you don't offer them you lose out on the customers who have families and can't leave their kids at home. I agree though that it is ridiculous, if I as an adult customer come in and order just an appetizer and a drink, in many places that'd be essentially the same price if not a dollar or so more than a kid's meal. So why can I order an appetizer but not a kid's meal if they're the same price? It's not like kids meals are full-sized meals at reduced price, it's not an amusement park ticket. It's a reduced size meal for an appropriate price.",
      "created_utc": 1737139028.0,
      "score": 19,
      "context": [
        {
          "id": "m7n6bpv",
          "author": "MultiFandomShipperr",
          "body": "I don't understand why they're gatekeeping child meals. I know they are not getting paid enough to care",
          "created_utc": 1737128656.0
        }
      ]
    },
    {
      "id": "m7oynnv",
      "author": "Anfie22",
      "body": "Exactly. If they still refuse to serve you, then leave. Don't give them your dollar if they do not want it.",
      "created_utc": 1737147337.0,
      "score": 8,
      "context": [
        {
          "id": "m7o2b2w",
          "author": "twatwater",
          "body": "I just don’t take no for an answer. I say, okay, then I don’t want anything. And suddenly they change their minds. :)",
          "created_utc": 1737137863.0
        }
      ]
    },
    {
      "id": "mc9qry5",
      "author": "Lylli-Rose",
      "body": "Often at restaurants kids sizes are normal portions for adults and an adult portion could feed 2-3",
      "created_utc": 1739314786.0,
      "score": 1,
      "context": [
        {
          "id": "m7n35w8",
          "author": "madeleine59",
          "body": "you probably should work on eating more incrementally, assuming youre not getting enough calories and your stomach has shrunk to accommodate",
          "created_utc": 1737127706.0
        }
      ]
    },
    {
      "id": "m7o6ex9",
      "author": "LowRhubarb5668",
      "body": "Most often the problem is at sit down/full service type restaurants where for the restaurant management/servers the problem is the lower cost of the kids meals versus the adult entrees which is still stupid. They tend to have less of a problem if you’re with at least a few other people or get the kids meal as takeout. I also like to leave a slightly higher tip (in the US) when the server is able to accommodate me and not fight me when I have ended up at a sit down/full service type restaurant.",
      "created_utc": 1737139032.0,
      "score": 5,
      "context": [
        {
          "id": "m7niot5",
          "author": "FlemFatale",
          "body": "I'm 35 and still get kids' meals. If that's all you want, that's all you want. I don't understand why anyone has a problem with it...",
          "created_utc": 1737132228.0
        }
      ]
    },
    {
      "id": "m7odkbp",
      "author": "gladtobbrown",
      "body": "i brought home the rest and put it in an airtight container. i also have a weirdness with old food so i like leftovers to go in a sealed container.",
      "created_utc": 1737141097.0,
      "score": 3,
      "context": [
        {
          "id": "m7odeww",
          "author": "gladtobbrown",
          "body": "i’m 22 and relate, last time i went out i asked if i could they said no but they do have smaller portions for some meals. i ended up getting a full plate and it lasted me for 4 dinners !",
          "created_utc": 1737141053.0
        }
      ]
    },
    {
      "id": "m7o9pzz",
      "author": "MrsMickeyKnox",
      "body": "Some places don't price kids meals to be profitable on their own. One restaurant I worked at offered half-price employee meals, except the steaks and kids meals- because half-off would mean they'd lose money on that dish. \nMost places don't care about you or what you're eating. It's just about the bottom-line.",
      "created_utc": 1737139981.0,
      "score": 7,
      "context": [
        {
          "id": "m7n6bpv",
          "author": "MultiFandomShipperr",
          "body": "I don't understand why they're gatekeeping child meals. I know they are not getting paid enough to care",
          "created_utc": 1737128656.0
        },
        {
          "id": "m7o6eak",
          "author": "sugaredsnickerdoodle",
          "body": "I believe I heard someone else say in a similar discussion that it's because the kid's meals are only put on the menu in the first place with the expectation that there will be adults bringing the child in and paying for full-sized meals. I think they said kid's meals are kind of a monetary loss, but if you don't offer them you lose out on the customers who have families and can't leave their kids at home. I agree though that it is ridiculous, if I as an adult customer come in and order just an appetizer and a drink, in many places that'd be essentially the same price if not a dollar or so more than a kid's meal. So why can I order an appetizer but not a kid's meal if they're the same price? It's not like kids meals are full-sized meals at reduced price, it's not an amusement park ticket. It's a reduced size meal for an appropriate price.",
          "created_utc": 1737139028.0
        }
      ]
    },
    {
      "id": "m7oxh93",
      "author": "FlemFatale",
      "body": "Yeah, this is true, and I do agree.  \nI always tip if the servers are good and obviously trying, I'm not in the US though, and do thi know that the tipping culture over there is a bit ridiculous, but still do tip well depending on service.",
      "created_utc": 1737146988.0,
      "score": 3,
      "context": [
        {
          "id": "m7niot5",
          "author": "FlemFatale",
          "body": "I'm 35 and still get kids' meals. If that's all you want, that's all you want. I don't understand why anyone has a problem with it...",
          "created_utc": 1737132228.0
        },
        {
          "id": "m7o6ex9",
          "author": "LowRhubarb5668",
          "body": "Most often the problem is at sit down/full service type restaurants where for the restaurant management/servers the problem is the lower cost of the kids meals versus the adult entrees which is still stupid. They tend to have less of a problem if you’re with at least a few other people or get the kids meal as takeout. I also like to leave a slightly higher tip (in the US) when the server is able to accommodate me and not fight me when I have ended up at a sit down/full service type restaurant.",
          "created_utc": 1737139032.0
        }
      ]
    }
  ]
}