{
  "id": "1i5y92v",
  "subreddit": "ARFID",
  "author": "AnachronisticCog",
  "created_utc": 1737400370.0,
  "title": "Does anyone else lose their appetite when cooking for themselves?",
  "selftext": "Hi!\n\nI recently started living alone again and I realized that when I cook for myself, the act of watching the food cook and waiting for it to be done makes me lose my appetite and not want to eat.\n\nHowever, if I can get food within a few minutes of when I notice the signs of hunger, it is easier (but not always *easy*) to stomach the food and get it down.\n\nI don’t know what is causing this but I want to be able to cook food for myself because it is cheaper and healthier than eating out all the time.\n\nIf anyone has any tips that might make it easier, I’m here for it. If you also experience this, please let me know so I don’t feel so alone.\n\nThank you so much!!",
  "url": "https://www.reddit.com/r/ARFID/comments/1i5y92v/does_anyone_else_lose_their_appetite_when_cooking/",
  "score": 124,
  "num_comments": 26,
  "comments": [
    {
      "id": "m87ncn5",
      "author": "prettyprettythingwow",
      "body": "Yes! Yes yes yes. I do MUCH better when I can eat something delivered or something someone else cooks for me. I can really only do pre-packaged foods otherwise. I can't even manage a microwave at this point. It is HORRIBLE. I miss real food so much, and there are some things I would eat that are safe and would be prepared and nutritious. But, I find myself unhappily (most of the time) eating a cold pop tart. I have a problem with Uncrustables even, because I have to thaw them, and by the time they're thawed, I might not want them anymore, and then they go stale in the fridge. Just...ugh....",
      "created_utc": 1737400851.0,
      "score": 25,
      "context": []
    },
    {
      "id": "m87s36k",
      "author": "divinAPEtion",
      "body": "Me!! I have tried to figure this one out for many years. I think for me it comes down to two things: one, by the time the food is done I'm sort of sick of smelling it, feeling it, etc. but with prepared food, I don't taste or smell it until I'm about to eat it. \n\n\n\n\nTwo, sometimes I just really don't want to know how the sausage is made. When someone else makes me an omlette I see an omlette. When I make me an omlette, I see raw eggs. I like that the middle step of ingredients transforming is invisible to me and the final result is more than the sum of its parts. \n\n\nI definitely am nowhere near having this mastered, but two tips that help me are: choosing recipes with a rest period or enough time away to reset my brain, and leaning heavily into the world of spices, right down to understanding how to best utilize their flavors (whether they are fat, water or alcohol soluable, etc). With my best buddy MSG and a palette of spices, a heavy hand can give me that restaurant \"oomph\" I need for it to feel appealing! ",
      "created_utc": 1737402140.0,
      "score": 15,
      "context": []
    },
    {
      "id": "m87ncv1",
      "author": "eatmangolive",
      "body": "Same problem here. I usually don't notice I'm hungry until my stomach hurts, and then I need food immediately, so it's easier to make something fast or order rather than cook and lose appetite in the process. \n\nI'm proud of myself when I cook a few hours in advance and actually eat a whole plate of what I make. I also have a problem with leftovers, so timing has to be perfect.\n\nSmall steps.",
      "created_utc": 1737400853.0,
      "score": 11,
      "context": []
    },
    {
      "id": "m87pvtl",
      "author": "JadeVampyre",
      "body": "I don't like to cook my own chicken or prepare my own salads and sandwiches. They never taste right. But I love salads/sandwiches from restaurants. 🤷🏽‍♀️",
      "created_utc": 1737401544.0,
      "score": 9,
      "context": []
    },
    {
      "id": "m87mrqn",
      "author": "Striking_Dentist_562",
      "body": "Yes, I cannot for whatever reason eat my own food. I used to be able to, you know within safe food restrictions. But I can’t anymore I really wish I could figure out why but I just can’t.",
      "created_utc": 1737400694.0,
      "score": 16,
      "context": []
    },
    {
      "id": "m881nvk",
      "author": "marv-cow",
      "body": "this is an issue that has been a huge hurdle for me too!!\n\none thing that’s helped me is meal prepping. I make a dozen or so meals on sunday just during the afternoon or something, portion them out into tupperware that I can just microwave later in the week (or re-heat in the oven for better quality if I have planned well enough that I don’t need to eat *right now* lol). \n\nI usually will make chicken breasts some way (fried, broiled, baked, strips, etc) and some sort of side. I actually really enjoy cooking and baking so it’s nice to have some time set apart weekly to do it. however, I often don’t eat one of my meal prepped meals on the day that I make them all b/c idk it’s just too much or something. but I figure if I set myself up for success the rest of the week, it’s okay to have snacks one day lol\n\nalso this would work with salad or sandwiches or something that doesn’t need to be warmed up, but might take some prep work too!! like sometimes I will do raw veggies or apple slices for my side, and I will just cut them up and portion them out ahead of time that way, when hunger strikes, I just need to open the fridge and grab a container — no prep needed! or if you order pizza one night and have extra, portion them out into containers easy to grab and go for future days!",
      "created_utc": 1737404770.0,
      "score": 6,
      "context": []
    },
    {
      "id": "m89agai",
      "author": "Bulky_Influence_4914",
      "body": "Yes. I can never eat what I cook. Like literally seeing the food raw and it looks disgusting to me, and if meat is involved, i cut off all the gristle, fat, tendons whatever with surgical precision. so by the time it's ready, i'm totally grossed out.",
      "created_utc": 1737417398.0,
      "score": 6,
      "context": []
    },
    {
      "id": "m87wy8k",
      "author": "throw0OO0away",
      "body": "Yes. This just happened to me last night. \n\nI have GI dysmotility and I’m feeding tube dependent. I can still eat but can’t sustain myself with oral intake alone. I made a box of Kraft Mac n Cheese on the stove. During, I realized that I genuinely cannot remember the last time I used the stove. I finished making the box, lost my appetite, and regretted making it. I only got through 3-4oz  (amount you’d expect in an Easy Mac) before calling it quits. Now, the leftovers are sitting in the fridge and I know damn well it’ll never get touched again.",
      "created_utc": 1737403465.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m88ef9q",
      "author": "FlemFatale",
      "body": "Oh yeah. If I recognise I'm hungry, I need to eat now (or within about 20 mins), or I will not be hungry by the time it's done.",
      "created_utc": 1737408156.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m87vo0x",
      "author": "TheMadHatterWasHere",
      "body": "I feel like I get less hungry/sated when I cook for myself. Has to go pretty fast, or I will stop being hungry. Mostendays I cook for a few nights, and then I can slowly take stuff out of the freezer to eat, when I need to.",
      "created_utc": 1737403110.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m8b8xb4",
      "author": "SprintsAC",
      "body": "Would it be worth meal prepping after a meal & then being able to microwave the premade meals whenever needed?",
      "created_utc": 1737443365.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m8co5hi",
      "author": "giraffemoo",
      "body": "Yes, sometimes I only have spoons for one thing, either cooking or eating. I used to just order delivery but my partner will cook for me now which is helpful.",
      "created_utc": 1737469415.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m8jne5c",
      "author": "Mean_Ad_4762",
      "body": "yes and it extends to finding it harder to eat i'm alone / lonely in general\n\nhas taken me a while to realise it is related to depression, in my case, as a result of loneliness. or a feeling of insecurity in my relationships.\n\ni just feel a very visceral disgust for food when i'm too aware of the fact that the meal will only be cooked if i do it myself, nobody there to share it with or cook for or with, nobody to witness me eating so what is the point.",
      "created_utc": 1737558210.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m89nlpp",
      "author": "restingstatue",
      "body": "Yes and specifically much worse with meat, eggs, or anything inedible raw. I don't know what to do about it except have ready to eat safe foods or order out. \n\nFor me, I think it is because of food trauma. Due to poverty and my upbringing, I have been exposed to bad meat and eggs, whether off or legit gone bad. I have also had sensory issues where there are unknown bits or things like veins, arteries, that greatly disturb me.\n\nSometimes these thoughts are conscious and sometimes they're subconscious. I get overly sensitive to seeing if the foods are off and doubting myself. Does this smell/taste weird? Is the texture weird? Could this have been mishandled by myself, a family member, or earlier in the food process?  Or even if I know it is safe to eat, sometimes I'll think it is low quality and has a bad flavor. For example, too game-y or freezer burn.\n\nI don't have any solutions but I commiserate!",
      "created_utc": 1737421518.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m8ee2sp",
      "author": "demraxy",
      "body": "there’s multiple foods that i can’t watch get prepared for me. like i know what’s in it but if i ignore it then its fine. like i love my moms tuna casserole but as soon as i watched her add tuna to it while making it i wouldn’t touch it after that. usually when i cook for myself its plain pasta but im sure if i tried to cook chicken or make stir fry i would loose my appetite fast. sadly the only tip i have so far is having someone else make the food or help with the parts that you find triggering. not very helpful when you live alone. ",
      "created_utc": 1737487017.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m8i3mvy",
      "author": "jintana",
      "body": "Yes, and when waiting for it, and when interrupted en route to it\n\nIt costs spoons to process all that in a healthy ish manner",
      "created_utc": 1737532136.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m8ki5j8",
      "author": "sliverofmasc",
      "body": "No cook. Only eat. 😩 \n\nHate that feeling. \n\nHate it so much.",
      "created_utc": 1737566773.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m89qskz",
      "author": "ThrowItAllAway003",
      "body": "I’ve had this problem with chicken specifically since pregnancy. That baby is almost 4 now and I still have trouble eating chicken I’ve cooked.",
      "created_utc": 1737422520.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m9pscdz",
      "author": "cominguplavender___",
      "body": "This is a huge problem for me, and I figured out the best way to get around it was to make dinner the day before (things like stir fry or other foods that would be good the next day), and then eat things like snack plates, cereal, bagels, oats, eggs, or other things that don’t require a lot of cooking for breakfast and lunch. Between school and work it’s best for my schedule anyways!",
      "created_utc": 1738102167.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m885o7a",
      "author": "No-Ferret5362",
      "body": "I pop it in the air fryer at the first sign of hunger. If I wait too long, the nausea appears. I hope the texture change won’t be a challenge for you",
      "created_utc": 1737405851.0,
      "score": 8,
      "context": [
        {
          "id": "m87ncn5",
          "author": "prettyprettythingwow",
          "body": "Yes! Yes yes yes. I do MUCH better when I can eat something delivered or something someone else cooks for me. I can really only do pre-packaged foods otherwise. I can't even manage a microwave at this point. It is HORRIBLE. I miss real food so much, and there are some things I would eat that are safe and would be prepared and nutritious. But, I find myself unhappily (most of the time) eating a cold pop tart. I have a problem with Uncrustables even, because I have to thaw them, and by the time they're thawed, I might not want them anymore, and then they go stale in the fridge. Just...ugh....",
          "created_utc": 1737400851.0
        }
      ]
    },
    {
      "id": "m89esdz",
      "author": "DrG2390",
      "body": "I recently read a study that says you get just as much fulfillment out of looking at pictures of food as you do eating food. There were some people in one of the weight loss subreddits, I forget which one, who used that for cravings for unhealthy food. This is merely an educated guess on my part, but it could be that for some reason your brain is getting the same fulfillment it usually would from eating as it does watching the food cook. \n\nAs for a solution I’m not sure… if there’s money for it takeout is always an option. I know when I lose my appetite I just rely on smoothies and supplements so I don’t miss out on the nutrients I need.",
      "created_utc": 1737418769.0,
      "score": 4,
      "context": [
        {
          "id": "m87mrqn",
          "author": "Striking_Dentist_562",
          "body": "Yes, I cannot for whatever reason eat my own food. I used to be able to, you know within safe food restrictions. But I can’t anymore I really wish I could figure out why but I just can’t.",
          "created_utc": 1737400694.0
        }
      ]
    },
    {
      "id": "m8f69sv",
      "author": "AnachronisticCog",
      "body": "I was thinking about this but looking at food after eating makes me nauseous. Lol. But, I do eat leftovers sometimes. I have a hard time with leftovers too. The texture is never the same.",
      "created_utc": 1737494678.0,
      "score": 2,
      "context": [
        {
          "id": "m8b8xb4",
          "author": "SprintsAC",
          "body": "Would it be worth meal prepping after a meal & then being able to microwave the premade meals whenever needed?",
          "created_utc": 1737443365.0
        }
      ]
    },
    {
      "id": "m88xnhr",
      "author": "prettyprettythingwow",
      "body": "For uncrustables? I definitely could not eat those toasted or warm.",
      "created_utc": 1737413459.0,
      "score": 3,
      "context": [
        {
          "id": "m87ncn5",
          "author": "prettyprettythingwow",
          "body": "Yes! Yes yes yes. I do MUCH better when I can eat something delivered or something someone else cooks for me. I can really only do pre-packaged foods otherwise. I can't even manage a microwave at this point. It is HORRIBLE. I miss real food so much, and there are some things I would eat that are safe and would be prepared and nutritious. But, I find myself unhappily (most of the time) eating a cold pop tart. I have a problem with Uncrustables even, because I have to thaw them, and by the time they're thawed, I might not want them anymore, and then they go stale in the fridge. Just...ugh....",
          "created_utc": 1737400851.0
        },
        {
          "id": "m885o7a",
          "author": "No-Ferret5362",
          "body": "I pop it in the air fryer at the first sign of hunger. If I wait too long, the nausea appears. I hope the texture change won’t be a challenge for you",
          "created_utc": 1737405851.0
        }
      ]
    },
    {
      "id": "m89i0yd",
      "author": "Striking_Dentist_562",
      "body": "Interesting, I mean the budget is kinda there. But I have additional issues such as unbalanced hormones that we all know can be fixed by diet. So it’s really mentally taxing know what’s best but really not being able to do it. Like this week I have had a lot of Taco Bell. Why because at least I’m eating. I have adhd too and my meds make my appetite non existent. I have been on glp-1 shots in the past both wegovy and mounjaro just depending on what’s available. And it gave me odd food aversions. Which it’s like cool didn’t need any more of that. \nI’m unsure about the whole cooking because I also can’t seem to throw like a pizza in and eat it. Not at home. I can at work just not at home",
      "created_utc": 1737419774.0,
      "score": 3,
      "context": [
        {
          "id": "m87mrqn",
          "author": "Striking_Dentist_562",
          "body": "Yes, I cannot for whatever reason eat my own food. I used to be able to, you know within safe food restrictions. But I can’t anymore I really wish I could figure out why but I just can’t.",
          "created_utc": 1737400694.0
        },
        {
          "id": "m89esdz",
          "author": "DrG2390",
          "body": "I recently read a study that says you get just as much fulfillment out of looking at pictures of food as you do eating food. There were some people in one of the weight loss subreddits, I forget which one, who used that for cravings for unhealthy food. This is merely an educated guess on my part, but it could be that for some reason your brain is getting the same fulfillment it usually would from eating as it does watching the food cook. \n\nAs for a solution I’m not sure… if there’s money for it takeout is always an option. I know when I lose my appetite I just rely on smoothies and supplements so I don’t miss out on the nutrients I need.",
          "created_utc": 1737418769.0
        }
      ]
    },
    {
      "id": "m89jayq",
      "author": "DrG2390",
      "body": "That’s fair… my husband eats Taco Bell just about every day. It’s actually considered one of the healthiest fast food restaurants out there, so there’s that at least. No judgement here. I can understand the intense mental chaos that comes with knowing what to do but being unable to do it. Before I got healthy I would literally lay in bed fantasizing about all the various exercises I could be doing and looking at pictures of healthy foods because I thought I could make myself like them that way. Didn’t quite work, but maybe it kind of gave my brain the push it needed to shift my cravings. Honestly I think if you like vanilla milkshakes or any kind of milkshake, you’d be able to get away with fairlife protein shakes. They have a bunch of protein, but they don’t taste chalky and weird like other protein shakes. I also always tell people about Gruns gummies because they’re whole food fruit and vegetable supplements that taste like a berry flavored gummy bear. Plus since they’re whole food based instead of extract based your body reacts as if you actually ate fruits and vegetables! You’d also likely benefit from a combination prebiotic/probiotic/postbiotic/digestive enzyme supplement to help your gut microbiome. Since you’re on glp-1’s you might also see a benefit to adding akkermansia. It’s something that helps your body produce glp-1 naturally, and would be a great bandaid if you couldn’t find any injections in time for your next one. A lot cheaper too.",
      "created_utc": 1737420172.0,
      "score": 2,
      "context": [
        {
          "id": "m87mrqn",
          "author": "Striking_Dentist_562",
          "body": "Yes, I cannot for whatever reason eat my own food. I used to be able to, you know within safe food restrictions. But I can’t anymore I really wish I could figure out why but I just can’t.",
          "created_utc": 1737400694.0
        },
        {
          "id": "m89esdz",
          "author": "DrG2390",
          "body": "I recently read a study that says you get just as much fulfillment out of looking at pictures of food as you do eating food. There were some people in one of the weight loss subreddits, I forget which one, who used that for cravings for unhealthy food. This is merely an educated guess on my part, but it could be that for some reason your brain is getting the same fulfillment it usually would from eating as it does watching the food cook. \n\nAs for a solution I’m not sure… if there’s money for it takeout is always an option. I know when I lose my appetite I just rely on smoothies and supplements so I don’t miss out on the nutrients I need.",
          "created_utc": 1737418769.0
        },
        {
          "id": "m89i0yd",
          "author": "Striking_Dentist_562",
          "body": "Interesting, I mean the budget is kinda there. But I have additional issues such as unbalanced hormones that we all know can be fixed by diet. So it’s really mentally taxing know what’s best but really not being able to do it. Like this week I have had a lot of Taco Bell. Why because at least I’m eating. I have adhd too and my meds make my appetite non existent. I have been on glp-1 shots in the past both wegovy and mounjaro just depending on what’s available. And it gave me odd food aversions. Which it’s like cool didn’t need any more of that. \nI’m unsure about the whole cooking because I also can’t seem to throw like a pizza in and eat it. Not at home. I can at work just not at home",
          "created_utc": 1737419774.0
        }
      ]
    },
    {
      "id": "m8abojw",
      "author": "Striking_Dentist_562",
      "body": "I appreciate all the advice. I’m not on GLP-1 anymore. Way to expensive I started back when it was $25 a month. I am currently taking a whole range of vitamins. D3, b complex, magnesium. And I had trace minerals back into my water. I have heard others talk about the fair life protein shakes. I’m not a big dairy drinker. But thankfully my safe foods tend to be high in protein.",
      "created_utc": 1737429211.0,
      "score": 1,
      "context": [
        {
          "id": "m87mrqn",
          "author": "Striking_Dentist_562",
          "body": "Yes, I cannot for whatever reason eat my own food. I used to be able to, you know within safe food restrictions. But I can’t anymore I really wish I could figure out why but I just can’t.",
          "created_utc": 1737400694.0
        },
        {
          "id": "m89esdz",
          "author": "DrG2390",
          "body": "I recently read a study that says you get just as much fulfillment out of looking at pictures of food as you do eating food. There were some people in one of the weight loss subreddits, I forget which one, who used that for cravings for unhealthy food. This is merely an educated guess on my part, but it could be that for some reason your brain is getting the same fulfillment it usually would from eating as it does watching the food cook. \n\nAs for a solution I’m not sure… if there’s money for it takeout is always an option. I know when I lose my appetite I just rely on smoothies and supplements so I don’t miss out on the nutrients I need.",
          "created_utc": 1737418769.0
        },
        {
          "id": "m89i0yd",
          "author": "Striking_Dentist_562",
          "body": "Interesting, I mean the budget is kinda there. But I have additional issues such as unbalanced hormones that we all know can be fixed by diet. So it’s really mentally taxing know what’s best but really not being able to do it. Like this week I have had a lot of Taco Bell. Why because at least I’m eating. I have adhd too and my meds make my appetite non existent. I have been on glp-1 shots in the past both wegovy and mounjaro just depending on what’s available. And it gave me odd food aversions. Which it’s like cool didn’t need any more of that. \nI’m unsure about the whole cooking because I also can’t seem to throw like a pizza in and eat it. Not at home. I can at work just not at home",
          "created_utc": 1737419774.0
        },
        {
          "id": "m89jayq",
          "author": "DrG2390",
          "body": "That’s fair… my husband eats Taco Bell just about every day. It’s actually considered one of the healthiest fast food restaurants out there, so there’s that at least. No judgement here. I can understand the intense mental chaos that comes with knowing what to do but being unable to do it. Before I got healthy I would literally lay in bed fantasizing about all the various exercises I could be doing and looking at pictures of healthy foods because I thought I could make myself like them that way. Didn’t quite work, but maybe it kind of gave my brain the push it needed to shift my cravings. Honestly I think if you like vanilla milkshakes or any kind of milkshake, you’d be able to get away with fairlife protein shakes. They have a bunch of protein, but they don’t taste chalky and weird like other protein shakes. I also always tell people about Gruns gummies because they’re whole food fruit and vegetable supplements that taste like a berry flavored gummy bear. Plus since they’re whole food based instead of extract based your body reacts as if you actually ate fruits and vegetables! You’d also likely benefit from a combination prebiotic/probiotic/postbiotic/digestive enzyme supplement to help your gut microbiome. Since you’re on glp-1’s you might also see a benefit to adding akkermansia. It’s something that helps your body produce glp-1 naturally, and would be a great bandaid if you couldn’t find any injections in time for your next one. A lot cheaper too.",
          "created_utc": 1737420172.0
        }
      ]
    }
  ]
}