{
  "id": "1i8wckh",
  "subreddit": "ARFID",
  "author": "LetsNotDoThatEver",
  "created_utc": 1737728174.0,
  "title": "ARFID Short Film",
  "selftext": "Hey guys, I also have ARFID and I am a film student and we were tasked with making a documentary around the theme of food which was obviously triggering. But I ended up turning it into a short film all about my struggles with ARFID and having an eating disorder that fairly unknown and having to go through all that trauma at a young age, as well as the sensory and frightening experience of having ARFID. \n\nAbsolutely no obligation that anyone watches this but I thought if anyone is going to feel seen by this it’s going to you guys and I wish this was something that I could’ve seen when I was at my worse to know someone understands.",
  "url": "https://vimeo.com/1044063573",
  "score": 95,
  "num_comments": 6,
  "comments": [
    {
      "id": "m927nq8",
      "author": "Athyrical",
      "body": "Really good work on this. Firstly, I really like the way you shot the food. I felt like it conveys what foods feel like to ARFID sufferers. Like how goopy or slimy or chunky stuff is, and how what others see as food can end up looking like slop to us. It was deeply emotional and gripping what you did, especially with the smashing the crackers. That hit hard for me. I also tried to be funny and fun because I hated feeling like a burden and wanted it all to STOP. That bit was so real. \n\nSecondly, the animation and more creative stuff you did worked wonderfully to show what that pain and discomfort feels like. When someone is like \"try this, it's so good!\" and I know I should like it but I'm just too terrified, it feels like I'm being covered in clay like that one animation you did. The tongue covered in honey was good too, I feel like it conveyed well what it feels like when the texture on something sucks.\n\nAnyway, I'm rambling, but great job! I related to it a lot and felt represented by it. Wishing you the best (and an a+) :)",
      "created_utc": 1737792895.0,
      "score": 5,
      "context": []
    },
    {
      "id": "m8yyf1k",
      "author": "bruh_bruh_yup",
      "body": "awesome film. relatable. well shot & narrated.",
      "created_utc": 1737749474.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m8zty87",
      "author": "Fungusofgoo",
      "body": "Wow! This is incredible, well done. I feel the feeling that the food gives in the video is very relatable.",
      "created_utc": 1737758549.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m90en0c",
      "author": "DoctorFurious",
      "body": "This is beautiful. Thank you.",
      "created_utc": 1737765141.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m90etur",
      "author": "I-just-need-friends",
      "body": "I enjoyed your short. Really well done. Hope your class and instructor like it too!",
      "created_utc": 1737765205.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m984v48",
      "author": "two_ells",
      "body": "Thank you for sharing. What a tremendous job. I feel like I've gained some insight into my own sons struggles, perspectives I've never thought about before.",
      "created_utc": 1737871671.0,
      "score": 1,
      "context": []
    }
  ]
}