{
  "id": "1iatjwe",
  "subreddit": "ARFID",
  "author": "kristen_hewa",
  "created_utc": 1737933539.0,
  "title": "Anyone else overweight because of their “safe” foods?",
  "selftext": "There are almost zero fruits or vegetables I can eat and the things that give me the least anxiety are crunchy things like chips or frozen stuff like ice cream. I’m super afraid of developing some random allergy to something I eat which takes out a ton of food options (and I have several actual food allergies as well) \n\nSuper frustrating because I want to be and eat more healthy but it’s impossible when some days I can only get myself to eat Pringles and drink Boost 🤦🏻‍♀️ ",
  "url": "https://www.reddit.com/r/ARFID/comments/1iatjwe/anyone_else_overweight_because_of_their_safe_foods/",
  "score": 295,
  "num_comments": 107,
  "comments": [
    {
      "id": "m9cw3ew",
      "author": "LittleBitOdd",
      "body": "Very",
      "created_utc": 1737934517.0,
      "score": 124,
      "context": []
    },
    {
      "id": "m9dbncz",
      "author": "Psychoartist_Tess",
      "body": "Yepp… my safe foods are all very carb heavy. Mac and cheese, eggo waffles, Dino nuggets…. I get a lot of exercise, but I just can’t seem to make up for the crap that I eat. :( and changing my diet to be healthier seems impossible.",
      "created_utc": 1737939144.0,
      "score": 62,
      "context": []
    },
    {
      "id": "m9ctnkf",
      "author": "Maxusam",
      "body": "I’m overweight, but it’s more from drinking too many juice drinks, protein shakes and smoothies + being overweight before ARFID (mine kicked in when I hit 30) + not exercising properly because I’m too tired and hungry.",
      "created_utc": 1737933788.0,
      "score": 56,
      "context": []
    },
    {
      "id": "m9dfmb2",
      "author": "Tallem00",
      "body": "Unfortunately yes. 0 safe fruits and veggies",
      "created_utc": 1737940287.0,
      "score": 34,
      "context": []
    },
    {
      "id": "m9dmg9j",
      "author": "SunnyCynic",
      "body": "I was getting there but I’ll be honest, I start taking that off brand ozempic shit and got it under control. I’m at my goal weight and still eating my safe foods, but weighing them out and counting calories",
      "created_utc": 1737942411.0,
      "score": 20,
      "context": []
    },
    {
      "id": "m9d22wc",
      "author": "Isadum",
      "body": "I’m a sugar and carb addict 😩",
      "created_utc": 1737936316.0,
      "score": 13,
      "context": []
    },
    {
      "id": "m9d4yhs",
      "author": "PolsBrokenAGlass",
      "body": "If you like crunchy textures I would recommend something like apple chips or banana chips (if you’re not allergic). They’re very addictive and it doesn’t feel like you’re eating fruit!!",
      "created_utc": 1737937150.0,
      "score": 7,
      "context": []
    },
    {
      "id": "m9cy0oh",
      "author": "None",
      "body": "not overweight but a little chubby/approaching overweight. apparently i intake a little over my required calorie intake (200 calories a day). i also don't really exercise due to exhaustion. most of my safe foods are just carbs or sugar with no nutrients... it absolutely sucks lmao",
      "created_utc": 1737935093.0,
      "score": 22,
      "context": []
    },
    {
      "id": "m9defu9",
      "author": "HezaLeNormandy",
      "body": "Yup. And no one understands. I have told people before that the food that I can’t have is like eating shit and they just say I have to force myself so I can lose weight.",
      "created_utc": 1737939926.0,
      "score": 15,
      "context": []
    },
    {
      "id": "m9dtnil",
      "author": "Doedemm",
      "body": "Im on the way there. My diet mostly consists of pancakes, mac and cheese, Gushers, and ice cream. \n\nI’ve been trying to incorporate healthier alternatives like protein pancakes instead of normal ones. I’m also working on getting fruit in me by drinking homemade smoothies and I take a multivitamin. This always happens when the semester starts. I get stressed out so I eat only my safe foods. Eventually, I’ll get back on track.",
      "created_utc": 1737944588.0,
      "score": 5,
      "context": []
    },
    {
      "id": "m9e61hr",
      "author": "Honeydewskyy20",
      "body": "I am and it’s because of that why my doctor didn’t believe when I said I had food aversions. I went to the doctor in 2023 just for a well being check. Yes I’m overweight. My primary diet consisted of only French fries. I had to cut it out and started eating avocado with low carb toast (my newest safe food). Ended up losing 80lbs. Went back to the doctor in 2024 to her saying I was severely malnourished. She told me I need to intake protein, which is the hardest thing to do. Meat textures are the hardest for me and I am still focusing on lower carb food options so beans aren’t really it for me. Anyways, I have my yearly appointment in may…haven’t really made any progress with protein…I try but then I get disgusted easily.",
      "created_utc": 1737948476.0,
      "score": 7,
      "context": []
    },
    {
      "id": "m9czgh2",
      "author": "NorthStarMidnightSky",
      "body": "I am morbidly obese despite being active, largely in part to the limited foods I eat. I also cannot find a doctor who will accept ARFID as an acceptable cause. I do try and have been trying, but I just cannot force myself to eat foods I don't like. \n\nI've been told I actually also don't eat enough to lose weight. It's all so contradictory. I wish I could find a weight loss plan I could actually follow.",
      "created_utc": 1737935525.0,
      "score": 30,
      "context": []
    },
    {
      "id": "m9eibd3",
      "author": "younglink164",
      "body": "Yes! It kind of annoys me how much being underweight seems to be part of the criteria for having arfid when you look online. Like guess what make nice easy consistent safe foods- carbs! I basically ate nothing but grilled cheese and French fries until I graduated college and shockingly that didn't do wonders for my weight. I've been trying to eat healthier but man my brain does not like the texture and crunch of so many fruits and veggies and I can't eat meat so I wind up having to eat a lot to feel full so it's just an endless cycle",
      "created_utc": 1737953200.0,
      "score": 9,
      "context": []
    },
    {
      "id": "m9dr1a0",
      "author": "the_YellowRanger",
      "body": "I was, but i found a smoothie i absolutely love that gets me a decent amount of my nutrients. I use milk, yogurt, Keifer, spinach, frozen mango, frozen passion fruit, hemp and flax seeds and drink it for breakfast every day. My dad got sick in the fall (he's ok now) and my nerves still have not recovered. I have a slightly different problem now, I have lost all interest in food besides my smoothie. I've lost 5lbs which would be great if it was happening in a healthy way. I barely eat lunch and my dinners are small and processed. I dont eat dessert anymore either.",
      "created_utc": 1737943833.0,
      "score": 5,
      "context": []
    },
    {
      "id": "m9fx080",
      "author": "ConsiderationJumpy34",
      "body": "I’m still young, and my metabolism is still fast, so no, I’m actually more on the underweight side. My ARFID restricts my entire ability to eat, meaning if I don’t have a safe food available , I’ll probably unfortunately skip a meal. But just because I’m skinny doesn’t mean I’m not severely out of shape. I can barely go up two flights of stairs without getting out of breath. I’ve been taking small steps at exercising and stretching, though. That’s helped me a lot. The eating thing is something I’m really struggling to get ahold of.",
      "created_utc": 1737981133.0,
      "score": 4,
      "context": []
    },
    {
      "id": "m9ea0cw",
      "author": "HourDimension1040",
      "body": "yeah this is the whole reason I started looking for other ppl on this site. I’ve gained a bunch of weight the last four years and can’t seem to make any lasting differences because all my safe foods are calorie dense.",
      "created_utc": 1737949907.0,
      "score": 8,
      "context": []
    },
    {
      "id": "m9e4t21",
      "author": "elfinglamour",
      "body": "The way I've tried to combat this is finding foods I like that involve a sauce, so things like pasta bake, butter chicken (pretty much any kind of curry), chili and making the sauce myself with a bunch of vegetables in it and then blending it with an immersion blender till it's totally smooth.  \nMy issues are mostly texture based so this works for me but might not for anyone who has issues with flavours, especially if you can't do tomato since most sauces start with a tomato base.",
      "created_utc": 1737948047.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m9fncho",
      "author": "tobeasloth",
      "body": "It’s definitely difficult, especially because recently my family have discouraged me eating safe foods because ‘I’ll get fat’ and ‘I don’t exercise’ (I’m a wheelchair user). I’ve recently realised their views are unfair and unkind but it still hurts, especially knowing that my weight is more important to them than my relationship with food. \n\nI’ve started making my own smoothies at lunch, sometimes even pretending I’m hosting a ‘smoothie show’ as silly as it sounds. This had made it a fun activity with a tasty same-texture-every-time outcome, and its helped with getting more vitamins and variety in my diet.",
      "created_utc": 1737976318.0,
      "score": 4,
      "context": []
    },
    {
      "id": "m9jf5us",
      "author": "EnvironmentalAge9671",
      "body": "i feel you. i'm overweight and i wish i could shed some points off or just eat \"healthier\" but it just doesn't feel possible to me.",
      "created_utc": 1738018823.0,
      "score": 5,
      "context": []
    },
    {
      "id": "m9empub",
      "author": "deadfliesinsummer",
      "body": "definitely. when i wanted to focus on my health i changed my safe foods to non-carby alternatives and my old safe foods became unsafe. my exploration zone has been almost exclusively veg and meat since then, it’s scary but it’s helped. used to only eat pasta",
      "created_utc": 1737955135.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m9f185t",
      "author": "kinkbongcrazybasin",
      "body": "Almost all of my safe foods are processed beige carbs, so I'm obese and have to lose weight in order to get SRS. Thankfully, I lost 60 lbs last year though, so I'm no longer morbidly obese.",
      "created_utc": 1737962786.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m9heyoi",
      "author": "dlprsn",
      "body": "yes! arfid, emetophobia and binge eating is quite the combination🫠 my safe foods are carbs - most forms of potato, pasta, rice, bread, noodles. also a big snacker with mainly crisps (chips if ur not in the uk) bc of the crunch. i wish i was even a little more healthy but its so difficult",
      "created_utc": 1737998515.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m9hkxso",
      "author": "yellowstar93",
      "body": "Yes. I managed to make progress by slowly expanding the foods I can eat, focusing especially on protein because it increases satiety. Finally being able to eat chicken and learning to cook it at home was a huge game changer for me. Eggs and protein shakes too. I found I can eat veggies when they're cooked with a teriyaki sauce. Calorie counting helped me lose weight along with focusing on high protein foods.",
      "created_utc": 1738000169.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m9e9x0w",
      "author": "OverlordSheepie",
      "body": "My antipsychotic medication makes me gain weight, but all my safe foods are unhealthy and fattening. The only reason I'm not overweight now is because I am prescribed a stimulant and I don't eat often.\n\nNot diagnosed officially with ARFID but I have an extremely narrow and restricted diet.",
      "created_utc": 1737949873.0,
      "score": 5,
      "context": []
    },
    {
      "id": "m9emex2",
      "author": "Amazing-Cellist3672",
      "body": "I was underweight until I was around 28, and didn't enjoy eating even foods I could tolerate. At some point that changed; I started overeating my safe foods (heavy on refined carbs and sugar). Now I'm 48 and about 50 pounds overweight. I like to eat now but I have still got a very limited diet.",
      "created_utc": 1737954995.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m9fuj3i",
      "author": "Automatic_Parsley833",
      "body": "I haven’t lost any weight in a minute, despite being a fitness junkie (mostly because my ADHD makes me have the energy of a thousand suns, but at all the wrong times—so my solution is to “go to the gym,” even if it’s in the middle of the dead of the night).\n\nWith that said, I’ve been trying to swap out less processed, more whole versions of my “safe” foods. It’s not a perfect science, but it’s making a difference when it comes to not adding onto my weight. For instance, peanut butter is one of my safe foods but is high in sugar, so I get a less processed one with only natural sugars. It’s a hard adjustment at first, but my issues with ARFID are mostly texture so luckily swapping has been a lot easier than I imagine it can be for some. Still, worth considering. Every little bit helps!\n\nEdit: also, like many of us (I assume)—many of my safe foods are “fast food.” However, I began to make homemade versions, which cuts the calories and other excess by a lot. I like Taco Bell, but getting low sodium black beans for instance is a better choice, and things like that.",
      "created_utc": 1737980007.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m9gigwu",
      "author": "georgecostanzalvr",
      "body": "I also have 0 safe fruits and veggies. Apples used to be my go to but I suddenly became allergic to them and it’s really fucked up my diet. My weight fluctuates, but I notice that doing ‘little’ things like drinking water instead of soda/juice or not finishing the entire treat makes a huge difference. Also, adding more protein and fiber into my diet where I can so I stay full longer has been super helpful.",
      "created_utc": 1737989101.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m9hfvvv",
      "author": "fish_in_business",
      "body": "Yep. My safe foods are almost all junk food. I also have a physical condition that makes exercise difficult, so that in combination with my eating makes me overweight lol",
      "created_utc": 1737998773.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m9htihv",
      "author": "RutabagaLow2578",
      "body": "My safe food is mainly chip like items and I am thin but I have a beer belly",
      "created_utc": 1738002535.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m9nt61t",
      "author": "nietbeschikbaar",
      "body": "Yep, I love white bread and (almost) anything made from potatoes.",
      "created_utc": 1738082523.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m9o7js3",
      "author": "Pale_Yesterday_1269",
      "body": "Yes. Me. I live off of crunchy carbs and food hyperfocusing. Currently I am 30lbs heavier than I was in June. I’m having a hard time with it but I’m trying to turn it around.",
      "created_utc": 1738086557.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m9rddle",
      "author": "Altruistic-Funny574",
      "body": "Yup! My safe foods are potato chips, mini tater tots, gluten free chicken nuggets, peanut butter Chex cereal with soy milk, rice, noodles with olive oil and canned chicken. That’s 98% of what I’ll eat.",
      "created_utc": 1738120155.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m9xd5rj",
      "author": "Warm-Display7719",
      "body": "I’m underweight cause I barely have any safe foods and I can’t eat them too much cause then I’d start disliking them :( ARFID is so difficult for us, I’m so tired. My body is so ugly and skinny I feel so awful",
      "created_utc": 1738197739.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m9d2dmr",
      "author": "DisastrousFlower",
      "body": "absolutely. weight gain from meds and having a kid.",
      "created_utc": 1737936405.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m9ey8lo",
      "author": "DatCopyCat",
      "body": "Yup. That's why I don't understand the \"weight loss\" part of the diagnose in the DMS-V. \nI was severely underweight during my childhood. Growing up and becoming an adult, I was autonomous in my food choices and it was the super salty and sweet food. Combined to hormonal change, I gained weight quickly. I guess it's a challenge a lot of us are facing but ignores because of the \"weight loss\" part of the official diagnosis.",
      "created_utc": 1737961057.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m9e07p6",
      "author": "SPinc1",
      "body": "Yes. My diet is not too bad, but I think I eat too many corn tortillas and bread as it's my way of eating other, healthier things on them. But I have been overweight my whole life, so I'm not sure what's going on.",
      "created_utc": 1737946574.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m9et7rh",
      "author": "Quirkykiwi",
      "body": "Yeah I'm about 20 lbs overweight and I also have some other health issues because of it. I haaaaate proteins those are most of my fear foods, and that's a big struggle",
      "created_utc": 1737958331.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m9f0jic",
      "author": "huskutNL",
      "body": "lol yes",
      "created_utc": 1737962383.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m9f6hh5",
      "author": "acoatofwhiteprimer",
      "body": "I'm underweight, but skinny fat. I have a pot belly from my shitty diet",
      "created_utc": 1737965963.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m9fb3ej",
      "author": "BluuFennec",
      "body": "A little bit, yeah...",
      "created_utc": 1737968890.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m9fdfsm",
      "author": "SuccessPutrid7349",
      "body": "Yep!",
      "created_utc": 1737970380.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m9fkk1e",
      "author": "sleepy-girl29",
      "body": "yes. i eat mostly bread",
      "created_utc": 1737974734.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m9fozxs",
      "author": "Squirrel_Worth",
      "body": "Yep. Combination of safe foods and other medical conditions/medications. \n\nMine are all carb, high fat, high calorie foods which leave me hungry. I’ll drink smooth fruit juice but no fruit or veg.",
      "created_utc": 1737977224.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m9h035c",
      "author": "TheRealAmayan",
      "body": "I can only eat spinach if I can properly mix it into something else like a sandwich or a smoothie. I don't like mushy/cooked spinach. I usually just think I'm eating a leaf. Which probably sounds dumb, but my inner child says leaves are okay lol\n\nOther than that everything I eat is garbage. 🫠",
      "created_utc": 1737994358.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m9h7qol",
      "author": "gorymaggots",
      "body": "YES! Not much overweight but still overweight. I do eat fruit from time to time but my safe foods are fries, pizza, chips and chocolate.",
      "created_utc": 1737996496.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m9hjqk8",
      "author": "euphoria110",
      "body": "Yes",
      "created_utc": 1737999841.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m9hxf6g",
      "author": "geekgeek2019",
      "body": "Hello! I also have pcos which makes it worse",
      "created_utc": 1738003616.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m9ifr7d",
      "author": "throwaway1981_x",
      "body": "Unfortunately yes. (tried dieting, skipping meals etc. I never last). Some fruits are OK though I don't eat enough.",
      "created_utc": 1738008749.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m9iz775",
      "author": "Hey-how_are-you",
      "body": "I have a similar issue. I freeze grapes so they are less chewy. Refrigerated apples are a good place to start. They are crisp and crunchy. Apples are my #1 safe fruit. \n\nThe food allergy struggle is so real.",
      "created_utc": 1738014202.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m9jz8c7",
      "author": "CherryPickerKill",
      "body": "Yes. Sugared coffee and bread. Potatoes don't help either.",
      "created_utc": 1738025231.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m9nph2k",
      "author": "gnomeslinger",
      "body": "Past tense yeah. Wasn’t super large but still a fair amount overweight. Had to go gluten free due to broken stomach and lost ~30kg in 4 months due to all my set foods being gone 🫠",
      "created_utc": 1738081490.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m9qqsj4",
      "author": "c0224v2609",
      "body": "Yes. And I’ve got the body shape of a human-sized grape.",
      "created_utc": 1738112760.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m9rhmtz",
      "author": "Ninjetteh",
      "body": "Yes. I have limited foods I eat, but of the ones I like, I really do enjoy eating them! And I feel like they're mostly carbs, of course. My husband jokes I've sold my soul to the sugar companies, cause I have a major sweet tooth. Idk if it's the ADHD, or lack of sleep, or both, but I also find that I eat out of boredom, and when I'm tired 😅\n\nI have lost weight before, counting calories and making exercise a regular thing. I got down from obese to overweight, although Covid and having a baby threw that out the window (for now). During that time I started some habits I've kept: drinking protein shakes pretty much every day (my favourite is Premiere Protein in chocolate), because I definitely lack on that, and also eating Fibre One bars, because I also need more fibre. I take omega-3 supplements, because I won't touch seafood at all. I'd really like to know if I'm malnourished/deficient in anything, but my doctor seemed uninterested in pursuing anything, so I'm doing what I can.",
      "created_utc": 1738121639.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m9rwz8m",
      "author": "racheltheangel222",
      "body": "yuuuup",
      "created_utc": 1738127713.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m9u9dn4",
      "author": "Lilmisssylvia",
      "body": "Absolutely! All my safe foods are carbs and sweets. Makes it nearly impossible to lose weight.",
      "created_utc": 1738166366.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m9vobit",
      "author": "Apprehensive_Log4909",
      "body": "I quite overweight due to my safe foods as well.",
      "created_utc": 1738180308.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ma7szi0",
      "author": "None",
      "body": "hi! i am a nutritionist i love this question, you are not alone at all!! some thoughts: have you tried making your own ice cream with frozen banana in the blender, you can mix with ice cream! have you tried making your own crispy potatoes? do you like carrots? do you have an air fryer and a blender? if not, start there! that would help you get crispy with the airfryer and cold/blended textures with the blender!!",
      "created_utc": 1738340407.0,
      "score": 1,
      "context": []
    },
    {
      "id": "maf4mkz",
      "author": "crochetsweetie",
      "body": "oh yeah, very. my weight fluctuates *very* fast, i gain 20lbs in less then a month sometimes",
      "created_utc": 1738436171.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m9elj9o",
      "author": "Phoenixtdm",
      "body": "If you develop a random allergy then just don’t eat that food anymore",
      "created_utc": 1737954600.0,
      "score": -5,
      "context": []
    },
    {
      "id": "m9cxhev",
      "author": "kristen_hewa",
      "body": "I love the bluntness hahaha",
      "created_utc": 1737934936.0,
      "score": 26,
      "context": [
        {
          "id": "m9cw3ew",
          "author": "LittleBitOdd",
          "body": "Very",
          "created_utc": 1737934517.0
        }
      ]
    },
    {
      "id": "m9frglw",
      "author": "Spacial_Parting",
      "body": "Same bruh",
      "created_utc": 1737978519.0,
      "score": 3,
      "context": [
        {
          "id": "m9cw3ew",
          "author": "LittleBitOdd",
          "body": "Very",
          "created_utc": 1737934517.0
        }
      ]
    },
    {
      "id": "m9cxj7n",
      "author": "kristen_hewa",
      "body": "The tired/hungry thing is killer for sure",
      "created_utc": 1737934951.0,
      "score": 26,
      "context": [
        {
          "id": "m9ctnkf",
          "author": "Maxusam",
          "body": "I’m overweight, but it’s more from drinking too many juice drinks, protein shakes and smoothies + being overweight before ARFID (mine kicked in when I hit 30) + not exercising properly because I’m too tired and hungry.",
          "created_utc": 1737933788.0
        }
      ]
    },
    {
      "id": "m9h1x17",
      "author": "breadplane",
      "body": "Wait, ARFID can show up that late? I’m showing signs of it and have been for a couple years, but I used to be able to eat anything you put in front of me. Are you telling me I’m not just insane?",
      "created_utc": 1737994873.0,
      "score": 6,
      "context": [
        {
          "id": "m9ctnkf",
          "author": "Maxusam",
          "body": "I’m overweight, but it’s more from drinking too many juice drinks, protein shakes and smoothies + being overweight before ARFID (mine kicked in when I hit 30) + not exercising properly because I’m too tired and hungry.",
          "created_utc": 1737933788.0
        }
      ]
    },
    {
      "id": "m9eup8m",
      "author": "Quirkykiwi",
      "body": "I feel kinda different on here because I love most fruits and vegetables, my fear foods are mainly proteins and fats - which makes it so hard to feel satiated and nourished and I'm always so tired :( 💓",
      "created_utc": 1737959112.0,
      "score": 14,
      "context": [
        {
          "id": "m9dfmb2",
          "author": "Tallem00",
          "body": "Unfortunately yes. 0 safe fruits and veggies",
          "created_utc": 1737940287.0
        }
      ]
    },
    {
      "id": "m9fj605",
      "author": "dhcirkekcheia",
      "body": "They have such varied textures, AND veg tastes like green, AND fruits give me “oh this is it I’m dying” acid reflux. Even if they didn’t, they have to be exactly the right kind of ripe!",
      "created_utc": 1737973914.0,
      "score": 7,
      "context": [
        {
          "id": "m9dfmb2",
          "author": "Tallem00",
          "body": "Unfortunately yes. 0 safe fruits and veggies",
          "created_utc": 1737940287.0
        }
      ]
    },
    {
      "id": "m9h5g5b",
      "author": "rain0ld",
      "body": "Wow i thought i was the only one with this. No veggies only potatos and no fruits 😔",
      "created_utc": 1737995865.0,
      "score": 7,
      "context": [
        {
          "id": "m9dfmb2",
          "author": "Tallem00",
          "body": "Unfortunately yes. 0 safe fruits and veggies",
          "created_utc": 1737940287.0
        }
      ]
    },
    {
      "id": "ma7uddn",
      "author": "None",
      "body": "im a nutritionist, have you thought about other fruits and veg that are not 'typical' in your grocery store. think of where your family is from (for example i am greek so there are some different veg that i like more familiar to greek culture). also, if you like ice cream or smoothies, you can play around with some safe foods that way in a blender so adding orange juice to some vanilla ice cream for example :)",
      "created_utc": 1738340793.0,
      "score": 2,
      "context": [
        {
          "id": "m9dfmb2",
          "author": "Tallem00",
          "body": "Unfortunately yes. 0 safe fruits and veggies",
          "created_utc": 1737940287.0
        }
      ]
    },
    {
      "id": "m9euhaq",
      "author": "Quirkykiwi",
      "body": "Ah man. I was on it for 3 months and was really making progress, but my side effects were ruining my life I had to stop. I'm jealous but extremely happy for you",
      "created_utc": 1737958994.0,
      "score": 5,
      "context": [
        {
          "id": "m9dmg9j",
          "author": "SunnyCynic",
          "body": "I was getting there but I’ll be honest, I start taking that off brand ozempic shit and got it under control. I’m at my goal weight and still eating my safe foods, but weighing them out and counting calories",
          "created_utc": 1737942411.0
        }
      ]
    },
    {
      "id": "m9hxjfs",
      "author": "geekgeek2019",
      "body": "What’s the off brand ozempic if u don’t mind? And did u get it w a doc?",
      "created_utc": 1738003648.0,
      "score": 1,
      "context": [
        {
          "id": "m9dmg9j",
          "author": "SunnyCynic",
          "body": "I was getting there but I’ll be honest, I start taking that off brand ozempic shit and got it under control. I’m at my goal weight and still eating my safe foods, but weighing them out and counting calories",
          "created_utc": 1737942411.0
        }
      ]
    },
    {
      "id": "m9rdwc8",
      "author": "Altruistic-Funny574",
      "body": "I bought dried strawberries to eat with my cereal, it’s okay SOMETIMES.",
      "created_utc": 1738120333.0,
      "score": 2,
      "context": [
        {
          "id": "m9d4yhs",
          "author": "PolsBrokenAGlass",
          "body": "If you like crunchy textures I would recommend something like apple chips or banana chips (if you’re not allergic). They’re very addictive and it doesn’t feel like you’re eating fruit!!",
          "created_utc": 1737937150.0
        }
      ]
    },
    {
      "id": "m9dd7i1",
      "author": "gh0stflowers",
      "body": "this is the one... i'm overweight just enough to be considered chubby, especially bc i'm under 5'0 so being anything over like 120lb is noticeable on a small frame but i usually eat only my calorie intake or less most days. i got a gym membership recently but it's so hard to fuel my body to work out, it often gives me headaches and i feel exhausted from only a little activity afterward. my safe foods are also carbs and sugary things.",
      "created_utc": 1737939579.0,
      "score": 9,
      "context": [
        {
          "id": "m9cy0oh",
          "author": "None",
          "body": "not overweight but a little chubby/approaching overweight. apparently i intake a little over my required calorie intake (200 calories a day). i also don't really exercise due to exhaustion. most of my safe foods are just carbs or sugar with no nutrients... it absolutely sucks lmao",
          "created_utc": 1737935093.0
        }
      ]
    },
    {
      "id": "m9cybew",
      "author": "kristen_hewa",
      "body": "My primary safe food used to be ice cream. My doctors gave me so much shit for that",
      "created_utc": 1737935184.0,
      "score": 5,
      "context": [
        {
          "id": "m9cy0oh",
          "author": "None",
          "body": "not overweight but a little chubby/approaching overweight. apparently i intake a little over my required calorie intake (200 calories a day). i also don't really exercise due to exhaustion. most of my safe foods are just carbs or sugar with no nutrients... it absolutely sucks lmao",
          "created_utc": 1737935093.0
        }
      ]
    },
    {
      "id": "m9e3djj",
      "author": "elfinglamour",
      "body": "The exercise exhaustion is so real, I'm ok with just walking but anything more strenuous and my body is like nope not enough fuel for that enjoy being lightheaded and nauseous.",
      "created_utc": 1737947565.0,
      "score": 2,
      "context": [
        {
          "id": "m9cy0oh",
          "author": "None",
          "body": "not overweight but a little chubby/approaching overweight. apparently i intake a little over my required calorie intake (200 calories a day). i also don't really exercise due to exhaustion. most of my safe foods are just carbs or sugar with no nutrients... it absolutely sucks lmao",
          "created_utc": 1737935093.0
        }
      ]
    },
    {
      "id": "m9kmij2",
      "author": "DrG2390",
      "body": "Can you swallow pills? Perfect amino makes an amazing protein supplement that has me finally getting enough protein every day.\n\nIf you like vanilla milkshakes, Fairlife Core Protein is also good for getting enough protein and it tastes exactly like a regular vanilla shake.",
      "created_utc": 1738032776.0,
      "score": 3,
      "context": [
        {
          "id": "m9e61hr",
          "author": "Honeydewskyy20",
          "body": "I am and it’s because of that why my doctor didn’t believe when I said I had food aversions. I went to the doctor in 2023 just for a well being check. Yes I’m overweight. My primary diet consisted of only French fries. I had to cut it out and started eating avocado with low carb toast (my newest safe food). Ended up losing 80lbs. Went back to the doctor in 2024 to her saying I was severely malnourished. She told me I need to intake protein, which is the hardest thing to do. Meat textures are the hardest for me and I am still focusing on lower carb food options so beans aren’t really it for me. Anyways, I have my yearly appointment in may…haven’t really made any progress with protein…I try but then I get disgusted easily.",
          "created_utc": 1737948476.0
        }
      ]
    },
    {
      "id": "m9czsav",
      "author": "kristen_hewa",
      "body": "Have you tried the calorie in calorie out thing? Literally just counting calories and keeping track of what you’re burning in exercise. Have you had your thyroid labs drawn?",
      "created_utc": 1737935622.0,
      "score": 8,
      "context": [
        {
          "id": "m9czgh2",
          "author": "NorthStarMidnightSky",
          "body": "I am morbidly obese despite being active, largely in part to the limited foods I eat. I also cannot find a doctor who will accept ARFID as an acceptable cause. I do try and have been trying, but I just cannot force myself to eat foods I don't like. \n\nI've been told I actually also don't eat enough to lose weight. It's all so contradictory. I wish I could find a weight loss plan I could actually follow.",
          "created_utc": 1737935525.0
        }
      ]
    },
    {
      "id": "m9twpir",
      "author": "kristen_hewa",
      "body": "Have you tried any small exercises? I’ve been doing these arm exercises with five pound weights literally just while at my desk and i’ve gained some muscle and even though I know I haven’t done much, just doing something makes me feel like I’m getting somewhere!",
      "created_utc": 1738162619.0,
      "score": 1,
      "context": [
        {
          "id": "m9jf5us",
          "author": "EnvironmentalAge9671",
          "body": "i feel you. i'm overweight and i wish i could shed some points off or just eat \"healthier\" but it just doesn't feel possible to me.",
          "created_utc": 1738018823.0
        }
      ]
    },
    {
      "id": "m9kol9n",
      "author": "DrG2390",
      "body": "I did the same thing! I feel like I’m the only one on here who’s managed to do that and keep the weight off. I’m finally at my ideal weight and managing fine!",
      "created_utc": 1738033463.0,
      "score": 2,
      "context": [
        {
          "id": "m9empub",
          "author": "deadfliesinsummer",
          "body": "definitely. when i wanted to focus on my health i changed my safe foods to non-carby alternatives and my old safe foods became unsafe. my exploration zone has been almost exclusively veg and meat since then, it’s scary but it’s helped. used to only eat pasta",
          "created_utc": 1737955135.0
        }
      ]
    },
    {
      "id": "m9pr4w1",
      "author": "cominguplavender___",
      "body": "If you don’t mind me asking, did you find the psychotics increased your appetite or just made you gain weight in general? I’ve got a referral to be put back on medication next week and i’m worried about having similar side effects",
      "created_utc": 1738101821.0,
      "score": 2,
      "context": [
        {
          "id": "m9e9x0w",
          "author": "OverlordSheepie",
          "body": "My antipsychotic medication makes me gain weight, but all my safe foods are unhealthy and fattening. The only reason I'm not overweight now is because I am prescribed a stimulant and I don't eat often.\n\nNot diagnosed officially with ARFID but I have an extremely narrow and restricted diet.",
          "created_utc": 1737949873.0
        }
      ]
    },
    {
      "id": "m9tx5wq",
      "author": "kristen_hewa",
      "body": "Gahhh my worst fear is suddenly becoming allergic to something which is like 90% of my ARFID",
      "created_utc": 1738162760.0,
      "score": 1,
      "context": [
        {
          "id": "m9gigwu",
          "author": "georgecostanzalvr",
          "body": "I also have 0 safe fruits and veggies. Apples used to be my go to but I suddenly became allergic to them and it’s really fucked up my diet. My weight fluctuates, but I notice that doing ‘little’ things like drinking water instead of soda/juice or not finishing the entire treat makes a huge difference. Also, adding more protein and fiber into my diet where I can so I stay full longer has been super helpful.",
          "created_utc": 1737989101.0
        }
      ]
    },
    {
      "id": "m9twh0w",
      "author": "kristen_hewa",
      "body": "Saaaame with the potatoes. I can’t always eat certain things made with them but in general potatoes are always pretty safe choice for me",
      "created_utc": 1738162545.0,
      "score": 1,
      "context": [
        {
          "id": "m9nt61t",
          "author": "nietbeschikbaar",
          "body": "Yep, I love white bread and (almost) anything made from potatoes.",
          "created_utc": 1738082523.0
        }
      ]
    },
    {
      "id": "m9twcyr",
      "author": "kristen_hewa",
      "body": "I hope you get to your goal! If you ever find any low calorie crunchy carbs let me know 😂",
      "created_utc": 1738162511.0,
      "score": 1,
      "context": [
        {
          "id": "m9o7js3",
          "author": "Pale_Yesterday_1269",
          "body": "Yes. Me. I live off of crunchy carbs and food hyperfocusing. Currently I am 30lbs heavier than I was in June. I’m having a hard time with it but I’m trying to turn it around.",
          "created_utc": 1738086557.0
        }
      ]
    },
    {
      "id": "ma8nw6b",
      "author": "kristen_hewa",
      "body": "Banana is one of the foods I’m not comfortable with right now 😅 also no on the carrots",
      "created_utc": 1738349010.0,
      "score": 1,
      "context": [
        {
          "id": "ma7szi0",
          "author": "None",
          "body": "hi! i am a nutritionist i love this question, you are not alone at all!! some thoughts: have you tried making your own ice cream with frozen banana in the blender, you can mix with ice cream! have you tried making your own crispy potatoes? do you like carrots? do you have an air fryer and a blender? if not, start there! that would help you get crispy with the airfryer and cold/blended textures with the blender!!",
          "created_utc": 1738340407.0
        }
      ]
    },
    {
      "id": "m9cxxvv",
      "author": "Maxusam",
      "body": "I think there is also something to be said for the starvation effects, if we aren’t eating properly our bodies go into a mode where it tries to hold onto whatever it can. I’ve also found that my stomach has shrunk, like I get full too quick, In haven’t finished a full plate of food in years - and then snack badly.",
      "created_utc": 1737935071.0,
      "score": 16,
      "context": [
        {
          "id": "m9ctnkf",
          "author": "Maxusam",
          "body": "I’m overweight, but it’s more from drinking too many juice drinks, protein shakes and smoothies + being overweight before ARFID (mine kicked in when I hit 30) + not exercising properly because I’m too tired and hungry.",
          "created_utc": 1737933788.0
        },
        {
          "id": "m9cxj7n",
          "author": "kristen_hewa",
          "body": "The tired/hungry thing is killer for sure",
          "created_utc": 1737934951.0
        }
      ]
    },
    {
      "id": "m9h53xf",
      "author": "SecretaryZone",
      "body": "I'm suspicious I might have it too, it became noticable for me a few years ago at 42.",
      "created_utc": 1737995770.0,
      "score": 4,
      "context": [
        {
          "id": "m9ctnkf",
          "author": "Maxusam",
          "body": "I’m overweight, but it’s more from drinking too many juice drinks, protein shakes and smoothies + being overweight before ARFID (mine kicked in when I hit 30) + not exercising properly because I’m too tired and hungry.",
          "created_utc": 1737933788.0
        },
        {
          "id": "m9h1x17",
          "author": "breadplane",
          "body": "Wait, ARFID can show up that late? I’m showing signs of it and have been for a couple years, but I used to be able to eat anything you put in front of me. Are you telling me I’m not just insane?",
          "created_utc": 1737994873.0
        }
      ]
    },
    {
      "id": "m9hfxko",
      "author": "Maxusam",
      "body": "You’re not insane. 💜 I used to have a quite varied diet, I loved cooking and eating but when I hit 30, my interest in food just disappeared.",
      "created_utc": 1737998786.0,
      "score": 3,
      "context": [
        {
          "id": "m9ctnkf",
          "author": "Maxusam",
          "body": "I’m overweight, but it’s more from drinking too many juice drinks, protein shakes and smoothies + being overweight before ARFID (mine kicked in when I hit 30) + not exercising properly because I’m too tired and hungry.",
          "created_utc": 1737933788.0
        },
        {
          "id": "m9h1x17",
          "author": "breadplane",
          "body": "Wait, ARFID can show up that late? I’m showing signs of it and have been for a couple years, but I used to be able to eat anything you put in front of me. Are you telling me I’m not just insane?",
          "created_utc": 1737994873.0
        }
      ]
    },
    {
      "id": "m9mmh2i",
      "author": "XxLexxyXx",
      "body": "Yep! I developed mine after trauma. I am in my 30s. Before I used to love trying new foods. I even lived abroad for 2 years.",
      "created_utc": 1738068833.0,
      "score": 3,
      "context": [
        {
          "id": "m9ctnkf",
          "author": "Maxusam",
          "body": "I’m overweight, but it’s more from drinking too many juice drinks, protein shakes and smoothies + being overweight before ARFID (mine kicked in when I hit 30) + not exercising properly because I’m too tired and hungry.",
          "created_utc": 1737933788.0
        },
        {
          "id": "m9h1x17",
          "author": "breadplane",
          "body": "Wait, ARFID can show up that late? I’m showing signs of it and have been for a couple years, but I used to be able to eat anything you put in front of me. Are you telling me I’m not just insane?",
          "created_utc": 1737994873.0
        }
      ]
    },
    {
      "id": "m9weu70",
      "author": "greychick",
      "body": "You're not insane! I used to be look up binge eaters anonymous and help for overeating and now i can't even finish a small fry as my meal! 😭",
      "created_utc": 1738187463.0,
      "score": 2,
      "context": [
        {
          "id": "m9ctnkf",
          "author": "Maxusam",
          "body": "I’m overweight, but it’s more from drinking too many juice drinks, protein shakes and smoothies + being overweight before ARFID (mine kicked in when I hit 30) + not exercising properly because I’m too tired and hungry.",
          "created_utc": 1737933788.0
        },
        {
          "id": "m9h1x17",
          "author": "breadplane",
          "body": "Wait, ARFID can show up that late? I’m showing signs of it and have been for a couple years, but I used to be able to eat anything you put in front of me. Are you telling me I’m not just insane?",
          "created_utc": 1737994873.0
        }
      ]
    },
    {
      "id": "m9evdw0",
      "author": "Tallem00",
      "body": "I've barely even got any proteins. It's mostly carbs for me 🥲",
      "created_utc": 1737959482.0,
      "score": 6,
      "context": [
        {
          "id": "m9dfmb2",
          "author": "Tallem00",
          "body": "Unfortunately yes. 0 safe fruits and veggies",
          "created_utc": 1737940287.0
        },
        {
          "id": "m9eup8m",
          "author": "Quirkykiwi",
          "body": "I feel kinda different on here because I love most fruits and vegetables, my fear foods are mainly proteins and fats - which makes it so hard to feel satiated and nourished and I'm always so tired :( 💓",
          "created_utc": 1737959112.0
        }
      ]
    },
    {
      "id": "ma7ts4q",
      "author": "None",
      "body": "hi im a nutritionist :) have you tried proteins and fats that are more in the fruits/veg category like lentils, beans, chickpeas (so like hummus for example), pea protein powder, avocado, peanut butter or nut butters, or drizzling your veg with olive oil or avocado oil?!",
      "created_utc": 1738340629.0,
      "score": 2,
      "context": [
        {
          "id": "m9dfmb2",
          "author": "Tallem00",
          "body": "Unfortunately yes. 0 safe fruits and veggies",
          "created_utc": 1737940287.0
        },
        {
          "id": "m9eup8m",
          "author": "Quirkykiwi",
          "body": "I feel kinda different on here because I love most fruits and vegetables, my fear foods are mainly proteins and fats - which makes it so hard to feel satiated and nourished and I'm always so tired :( 💓",
          "created_utc": 1737959112.0
        }
      ]
    },
    {
      "id": "m9jjgsr",
      "author": "EMJK96",
      "body": "The green taste!!! No one I know gets this!",
      "created_utc": 1738020167.0,
      "score": 5,
      "context": [
        {
          "id": "m9dfmb2",
          "author": "Tallem00",
          "body": "Unfortunately yes. 0 safe fruits and veggies",
          "created_utc": 1737940287.0
        },
        {
          "id": "m9fj605",
          "author": "dhcirkekcheia",
          "body": "They have such varied textures, AND veg tastes like green, AND fruits give me “oh this is it I’m dying” acid reflux. Even if they didn’t, they have to be exactly the right kind of ripe!",
          "created_utc": 1737973914.0
        }
      ]
    },
    {
      "id": "m9rds3r",
      "author": "Altruistic-Funny574",
      "body": "I can do canned beans in a corn tortilla shell SOMETIMES. Otherwise I’ll eat a peeled apple if it’s in small amounts or apple sauce. That’s it!",
      "created_utc": 1738120293.0,
      "score": 3,
      "context": [
        {
          "id": "m9dfmb2",
          "author": "Tallem00",
          "body": "Unfortunately yes. 0 safe fruits and veggies",
          "created_utc": 1737940287.0
        },
        {
          "id": "m9h5g5b",
          "author": "rain0ld",
          "body": "Wow i thought i was the only one with this. No veggies only potatos and no fruits 😔",
          "created_utc": 1737995865.0
        }
      ]
    },
    {
      "id": "ma7uq3u",
      "author": "Tallem00",
      "body": "I'm very very closed off when it comes to trying new foods, if none of that stuff is safe rn, it's unlikely that it ever would be 🤷‍♀️",
      "created_utc": 1738340892.0,
      "score": 1,
      "context": [
        {
          "id": "m9dfmb2",
          "author": "Tallem00",
          "body": "Unfortunately yes. 0 safe fruits and veggies",
          "created_utc": 1737940287.0
        },
        {
          "id": "ma7uddn",
          "author": "None",
          "body": "im a nutritionist, have you thought about other fruits and veg that are not 'typical' in your grocery store. think of where your family is from (for example i am greek so there are some different veg that i like more familiar to greek culture). also, if you like ice cream or smoothies, you can play around with some safe foods that way in a blender so adding orange juice to some vanilla ice cream for example :)",
          "created_utc": 1738340793.0
        }
      ]
    },
    {
      "id": "m9f3kpz",
      "author": "gingertea7",
      "body": "What kind of side effects did you experience?",
      "created_utc": 1737964199.0,
      "score": 2,
      "context": [
        {
          "id": "m9dmg9j",
          "author": "SunnyCynic",
          "body": "I was getting there but I’ll be honest, I start taking that off brand ozempic shit and got it under control. I’m at my goal weight and still eating my safe foods, but weighing them out and counting calories",
          "created_utc": 1737942411.0
        },
        {
          "id": "m9euhaq",
          "author": "Quirkykiwi",
          "body": "Ah man. I was on it for 3 months and was really making progress, but my side effects were ruining my life I had to stop. I'm jealous but extremely happy for you",
          "created_utc": 1737958994.0
        }
      ]
    },
    {
      "id": "m9ih0vt",
      "author": "dimensionalspirit",
      "body": "im assuming semaglutide from an alternative seller",
      "created_utc": 1738009108.0,
      "score": 3,
      "context": [
        {
          "id": "m9dmg9j",
          "author": "SunnyCynic",
          "body": "I was getting there but I’ll be honest, I start taking that off brand ozempic shit and got it under control. I’m at my goal weight and still eating my safe foods, but weighing them out and counting calories",
          "created_utc": 1737942411.0
        },
        {
          "id": "m9hxjfs",
          "author": "geekgeek2019",
          "body": "What’s the off brand ozempic if u don’t mind? And did u get it w a doc?",
          "created_utc": 1738003648.0
        }
      ]
    },
    {
      "id": "mc3892u",
      "author": "SunnyCynic",
      "body": "Other commenter is correct. It’s semaglutide and I got it from Eden.",
      "created_utc": 1739228830.0,
      "score": 1,
      "context": [
        {
          "id": "m9dmg9j",
          "author": "SunnyCynic",
          "body": "I was getting there but I’ll be honest, I start taking that off brand ozempic shit and got it under control. I’m at my goal weight and still eating my safe foods, but weighing them out and counting calories",
          "created_utc": 1737942411.0
        },
        {
          "id": "m9hxjfs",
          "author": "geekgeek2019",
          "body": "What’s the off brand ozempic if u don’t mind? And did u get it w a doc?",
          "created_utc": 1738003648.0
        }
      ]
    },
    {
      "id": "m9cznwn",
      "author": "None",
      "body": "that's awful. i once cried in front of my primary care doctor because she was minimizing my legitimate health concerns to my diet. it's very easy to feel not seen or heard in medical conversations.",
      "created_utc": 1737935586.0,
      "score": 9,
      "context": [
        {
          "id": "m9cy0oh",
          "author": "None",
          "body": "not overweight but a little chubby/approaching overweight. apparently i intake a little over my required calorie intake (200 calories a day). i also don't really exercise due to exhaustion. most of my safe foods are just carbs or sugar with no nutrients... it absolutely sucks lmao",
          "created_utc": 1737935093.0
        },
        {
          "id": "m9cybew",
          "author": "kristen_hewa",
          "body": "My primary safe food used to be ice cream. My doctors gave me so much shit for that",
          "created_utc": 1737935184.0
        }
      ]
    },
    {
      "id": "m9mebz6",
      "author": "Honeydewskyy20",
      "body": "I’m gonna go ahead and try to fairlife brand. Everyone in here talks about it but I’ve been put off by them for some time due to a bad experience with one of them. But I am trying and I’m do want to make any excuses. I also have no issues swallowing pills. Are you getting perfect amino directly from the site? I just looked into that too. \n\nI realize I was extremely vague in what I wrote. After my doctor told me I had to cut down carbs (and I knew this), my diet then consisted mostly of avocado and low carb toast and easily I could make it through the day with it. After seeing my doctor in 2024 and she said what she did, I tried to do a lot better with variety and tried to up my proteins. I do have protein powders and I’ve used Atkin shakes. I also eat eggs but most often, I’m still comfortable with eating avocado and low carb toast. I’m also a paramedic on 24hr shifts so in some cases where it’s too time consuming to try with variety, I have been fine with making it through with bread, Atkin shakes, nuts, or in extreme cases, I’ll just by some fries from somewhere. At home, I still eggs. Like I said, my main issue is meat textures. I worked my way back up to those “Real Good” chicken nuggets that are like 3g of carbs and 25g of protein which is perfect because I am still trying to lose weight, but I ended up getting disgusted. I am still willing to keep trying them though.",
      "created_utc": 1738065145.0,
      "score": 1,
      "context": [
        {
          "id": "m9e61hr",
          "author": "Honeydewskyy20",
          "body": "I am and it’s because of that why my doctor didn’t believe when I said I had food aversions. I went to the doctor in 2023 just for a well being check. Yes I’m overweight. My primary diet consisted of only French fries. I had to cut it out and started eating avocado with low carb toast (my newest safe food). Ended up losing 80lbs. Went back to the doctor in 2024 to her saying I was severely malnourished. She told me I need to intake protein, which is the hardest thing to do. Meat textures are the hardest for me and I am still focusing on lower carb food options so beans aren’t really it for me. Anyways, I have my yearly appointment in may…haven’t really made any progress with protein…I try but then I get disgusted easily.",
          "created_utc": 1737948476.0
        },
        {
          "id": "m9kmij2",
          "author": "DrG2390",
          "body": "Can you swallow pills? Perfect amino makes an amazing protein supplement that has me finally getting enough protein every day.\n\nIf you like vanilla milkshakes, Fairlife Core Protein is also good for getting enough protein and it tastes exactly like a regular vanilla shake.",
          "created_utc": 1738032776.0
        }
      ]
    },
    {
      "id": "m9dp94z",
      "author": "NorthStarMidnightSky",
      "body": "Sigh. You sound like every doctor and dietician I've ever dealt with. Blood work is normal. ARFID makes calorie counting and counteracting with exercise extremely difficult. I struggle daily to eat anything, let alone plan, count, and keep track of it. If the only thing I can eat that day is more calories than I exercised, should I skip it and not eat?\n\nAnd when I don't have the energy to exercise, should I still not eat?\n\nI've been told I need to eat more calories, but have no idea how to do that in a healthy way when I'm stuck with whatever I can get myself to consume.",
      "created_utc": 1737943275.0,
      "score": 2,
      "context": [
        {
          "id": "m9czgh2",
          "author": "NorthStarMidnightSky",
          "body": "I am morbidly obese despite being active, largely in part to the limited foods I eat. I also cannot find a doctor who will accept ARFID as an acceptable cause. I do try and have been trying, but I just cannot force myself to eat foods I don't like. \n\nI've been told I actually also don't eat enough to lose weight. It's all so contradictory. I wish I could find a weight loss plan I could actually follow.",
          "created_utc": 1737935525.0
        },
        {
          "id": "m9czsav",
          "author": "kristen_hewa",
          "body": "Have you tried the calorie in calorie out thing? Literally just counting calories and keeping track of what you’re burning in exercise. Have you had your thyroid labs drawn?",
          "created_utc": 1737935622.0
        }
      ]
    },
    {
      "id": "m9q5kgl",
      "author": "OverlordSheepie",
      "body": "I'd say both. But the thing I remember the most was the insatiable hunger I felt. I could eat and eat and never get full. It was concerning to my family. \n\nIt may also slow down metabolism but I don't know of any studies at the moment that prove it. Just anecdotal.",
      "created_utc": 1738106098.0,
      "score": 2,
      "context": [
        {
          "id": "m9e9x0w",
          "author": "OverlordSheepie",
          "body": "My antipsychotic medication makes me gain weight, but all my safe foods are unhealthy and fattening. The only reason I'm not overweight now is because I am prescribed a stimulant and I don't eat often.\n\nNot diagnosed officially with ARFID but I have an extremely narrow and restricted diet.",
          "created_utc": 1737949873.0
        },
        {
          "id": "m9pr4w1",
          "author": "cominguplavender___",
          "body": "If you don’t mind me asking, did you find the psychotics increased your appetite or just made you gain weight in general? I’ve got a referral to be put back on medication next week and i’m worried about having similar side effects",
          "created_utc": 1738101821.0
        }
      ]
    },
    {
      "id": "m9fnqai",
      "author": "soft_seraphim",
      "body": "Even worse if I hadn't eaten for such a long time so when I do actually eat I feel like I'm going to puke. And I'm sitting here trying not to vomit, with trembling arms, headache and overall tiredness from not eating for so long. Very miserable feeling.",
      "created_utc": 1737976530.0,
      "score": 6,
      "context": [
        {
          "id": "m9ctnkf",
          "author": "Maxusam",
          "body": "I’m overweight, but it’s more from drinking too many juice drinks, protein shakes and smoothies + being overweight before ARFID (mine kicked in when I hit 30) + not exercising properly because I’m too tired and hungry.",
          "created_utc": 1737933788.0
        },
        {
          "id": "m9cxj7n",
          "author": "kristen_hewa",
          "body": "The tired/hungry thing is killer for sure",
          "created_utc": 1737934951.0
        },
        {
          "id": "m9cxxvv",
          "author": "Maxusam",
          "body": "I think there is also something to be said for the starvation effects, if we aren’t eating properly our bodies go into a mode where it tries to hold onto whatever it can. I’ve also found that my stomach has shrunk, like I get full too quick, In haven’t finished a full plate of food in years - and then snack badly.",
          "created_utc": 1737935071.0
        }
      ]
    },
    {
      "id": "m9cy6q1",
      "author": "kristen_hewa",
      "body": "Agreed",
      "created_utc": 1737935144.0,
      "score": 2,
      "context": [
        {
          "id": "m9ctnkf",
          "author": "Maxusam",
          "body": "I’m overweight, but it’s more from drinking too many juice drinks, protein shakes and smoothies + being overweight before ARFID (mine kicked in when I hit 30) + not exercising properly because I’m too tired and hungry.",
          "created_utc": 1737933788.0
        },
        {
          "id": "m9cxj7n",
          "author": "kristen_hewa",
          "body": "The tired/hungry thing is killer for sure",
          "created_utc": 1737934951.0
        },
        {
          "id": "m9cxxvv",
          "author": "Maxusam",
          "body": "I think there is also something to be said for the starvation effects, if we aren’t eating properly our bodies go into a mode where it tries to hold onto whatever it can. I’ve also found that my stomach has shrunk, like I get full too quick, In haven’t finished a full plate of food in years - and then snack badly.",
          "created_utc": 1737935071.0
        }
      ]
    },
    {
      "id": "m9ew0wc",
      "author": "Quirkykiwi",
      "body": "Same girl same",
      "created_utc": 1737959832.0,
      "score": 2,
      "context": [
        {
          "id": "m9dfmb2",
          "author": "Tallem00",
          "body": "Unfortunately yes. 0 safe fruits and veggies",
          "created_utc": 1737940287.0
        },
        {
          "id": "m9eup8m",
          "author": "Quirkykiwi",
          "body": "I feel kinda different on here because I love most fruits and vegetables, my fear foods are mainly proteins and fats - which makes it so hard to feel satiated and nourished and I'm always so tired :( 💓",
          "created_utc": 1737959112.0
        },
        {
          "id": "m9evdw0",
          "author": "Tallem00",
          "body": "I've barely even got any proteins. It's mostly carbs for me 🥲",
          "created_utc": 1737959482.0
        }
      ]
    },
    {
      "id": "m9l2nwd",
      "author": "lostinthemoss1",
      "body": "I despise the green taste",
      "created_utc": 1738038660.0,
      "score": 5,
      "context": [
        {
          "id": "m9dfmb2",
          "author": "Tallem00",
          "body": "Unfortunately yes. 0 safe fruits and veggies",
          "created_utc": 1737940287.0
        },
        {
          "id": "m9fj605",
          "author": "dhcirkekcheia",
          "body": "They have such varied textures, AND veg tastes like green, AND fruits give me “oh this is it I’m dying” acid reflux. Even if they didn’t, they have to be exactly the right kind of ripe!",
          "created_utc": 1737973914.0
        },
        {
          "id": "m9jjgsr",
          "author": "EMJK96",
          "body": "The green taste!!! No one I know gets this!",
          "created_utc": 1738020167.0
        }
      ]
    },
    {
      "id": "m9kly8v",
      "author": "DrG2390",
      "body": "There’s also a probiotic out there called akkermansia that stimulates the same hormones ozempic does without the side effects. Both my husband and I use it.",
      "created_utc": 1738032589.0,
      "score": 3,
      "context": [
        {
          "id": "m9dmg9j",
          "author": "SunnyCynic",
          "body": "I was getting there but I’ll be honest, I start taking that off brand ozempic shit and got it under control. I’m at my goal weight and still eating my safe foods, but weighing them out and counting calories",
          "created_utc": 1737942411.0
        },
        {
          "id": "m9hxjfs",
          "author": "geekgeek2019",
          "body": "What’s the off brand ozempic if u don’t mind? And did u get it w a doc?",
          "created_utc": 1738003648.0
        },
        {
          "id": "m9ih0vt",
          "author": "dimensionalspirit",
          "body": "im assuming semaglutide from an alternative seller",
          "created_utc": 1738009108.0
        }
      ]
    },
    {
      "id": "m9d01t3",
      "author": "kristen_hewa",
      "body": "I’ve done the same! Being told to lose weight and suggested diet plans is NOT what I’m looking for and it’s super demeaning to be told that after basically pouring my heart out to a doctor",
      "created_utc": 1737935700.0,
      "score": 13,
      "context": [
        {
          "id": "m9cy0oh",
          "author": "None",
          "body": "not overweight but a little chubby/approaching overweight. apparently i intake a little over my required calorie intake (200 calories a day). i also don't really exercise due to exhaustion. most of my safe foods are just carbs or sugar with no nutrients... it absolutely sucks lmao",
          "created_utc": 1737935093.0
        },
        {
          "id": "m9cybew",
          "author": "kristen_hewa",
          "body": "My primary safe food used to be ice cream. My doctors gave me so much shit for that",
          "created_utc": 1737935184.0
        },
        {
          "id": "m9cznwn",
          "author": "None",
          "body": "that's awful. i once cried in front of my primary care doctor because she was minimizing my legitimate health concerns to my diet. it's very easy to feel not seen or heard in medical conversations.",
          "created_utc": 1737935586.0
        }
      ]
    },
    {
      "id": "m9lcu5j",
      "author": "geogren",
      "body": "Have you tried looking into it being something not food related? I know PCOS can cause weight gain even if you aren’t eating enough.",
      "created_utc": 1738043162.0,
      "score": 1,
      "context": [
        {
          "id": "m9czgh2",
          "author": "NorthStarMidnightSky",
          "body": "I am morbidly obese despite being active, largely in part to the limited foods I eat. I also cannot find a doctor who will accept ARFID as an acceptable cause. I do try and have been trying, but I just cannot force myself to eat foods I don't like. \n\nI've been told I actually also don't eat enough to lose weight. It's all so contradictory. I wish I could find a weight loss plan I could actually follow.",
          "created_utc": 1737935525.0
        },
        {
          "id": "m9czsav",
          "author": "kristen_hewa",
          "body": "Have you tried the calorie in calorie out thing? Literally just counting calories and keeping track of what you’re burning in exercise. Have you had your thyroid labs drawn?",
          "created_utc": 1737935622.0
        },
        {
          "id": "m9dp94z",
          "author": "NorthStarMidnightSky",
          "body": "Sigh. You sound like every doctor and dietician I've ever dealt with. Blood work is normal. ARFID makes calorie counting and counteracting with exercise extremely difficult. I struggle daily to eat anything, let alone plan, count, and keep track of it. If the only thing I can eat that day is more calories than I exercised, should I skip it and not eat?\n\nAnd when I don't have the energy to exercise, should I still not eat?\n\nI've been told I need to eat more calories, but have no idea how to do that in a healthy way when I'm stuck with whatever I can get myself to consume.",
          "created_utc": 1737943275.0
        }
      ]
    },
    {
      "id": "m9hh7c1",
      "author": "Maxusam",
      "body": "When I’m feeling like that, I try to just eat a little (crackers, loaf cake, yogurt) or a protein shake to try and get your digestive system moving. Then I try something bigger a little later - like stretching my stomach out if that makes sense?",
      "created_utc": 1737999141.0,
      "score": 3,
      "context": [
        {
          "id": "m9ctnkf",
          "author": "Maxusam",
          "body": "I’m overweight, but it’s more from drinking too many juice drinks, protein shakes and smoothies + being overweight before ARFID (mine kicked in when I hit 30) + not exercising properly because I’m too tired and hungry.",
          "created_utc": 1737933788.0
        },
        {
          "id": "m9cxj7n",
          "author": "kristen_hewa",
          "body": "The tired/hungry thing is killer for sure",
          "created_utc": 1737934951.0
        },
        {
          "id": "m9cxxvv",
          "author": "Maxusam",
          "body": "I think there is also something to be said for the starvation effects, if we aren’t eating properly our bodies go into a mode where it tries to hold onto whatever it can. I’ve also found that my stomach has shrunk, like I get full too quick, In haven’t finished a full plate of food in years - and then snack badly.",
          "created_utc": 1737935071.0
        },
        {
          "id": "m9fnqai",
          "author": "soft_seraphim",
          "body": "Even worse if I hadn't eaten for such a long time so when I do actually eat I feel like I'm going to puke. And I'm sitting here trying not to vomit, with trembling arms, headache and overall tiredness from not eating for so long. Very miserable feeling.",
          "created_utc": 1737976530.0
        }
      ]
    }
  ]
}