{
  "id": "1ihht83",
  "subreddit": "ARFID",
  "author": "Ovshy",
  "created_utc": 1738676240.0,
  "title": "I’m gonna lose my mind",
  "selftext": "My sister keeps nitpicking over my food choices, trying to scare me over foods that I feel comfortable with. Instant noodles is my one of my biggest safest food, and she constantly nitpicks about it. Nothing I eat is healthy, I know that’s not good for my body but most of my safe foods is just junk food.",
  "url": "https://i.redd.it/qqtep5l4l4he1.jpeg",
  "score": 146,
  "num_comments": 39,
  "comments": [
    {
      "id": "max56v4",
      "author": "Agile-Army-4166",
      "body": "Lord i hate images like this. Also an avid instant noodle eater and there is no way of changing that. I try to add healthy things to my diet but what people don’t understand is we can’t just take things out of our diet because they’re unhealthy. We’re already struggling to find meals that we can eat, healthy or not, and removing unhealthy ones would leave many of us with nothing to eat.\n\nEven some of the foods i eat that i think are healthy end up being harmful in some way when i google them. It’s exhausting.",
      "created_utc": 1738676632.0,
      "score": 98,
      "context": []
    },
    {
      "id": "maxep3c",
      "author": "milkisterrifying",
      "body": "“You know what’s more unhealthy? Not eating.”",
      "created_utc": 1738679894.0,
      "score": 78,
      "context": []
    },
    {
      "id": "max6l1u",
      "author": "RozGhul",
      "body": "Bruh why does she careeee, people are just so ✨exhausting✨",
      "created_utc": 1738677126.0,
      "score": 40,
      "context": []
    },
    {
      "id": "max4njl",
      "author": "MaleficentSwan0223",
      "body": "I don’t eat noodles but all my safe foods are unhealthy and I have less than 10 so can’t really afford to drop it. \nI’ve accepted that I’ll probably get cancer and heart disease early but it’s certainly better than not eating now and dying of starvation in a few months time. ",
      "created_utc": 1738676442.0,
      "score": 29,
      "context": []
    },
    {
      "id": "max86yt",
      "author": "inappropriatepeaches",
      "body": "stuff likes this makes me so upset! like you know what else is bad for my health? not eating! it’s always a good idea to try to eat healthier foods, but if instant noodles is all you can get in, that’s so much better than nothing.",
      "created_utc": 1738677687.0,
      "score": 25,
      "context": []
    },
    {
      "id": "maxj3d8",
      "author": "inshort53",
      "body": "Not eating anything is worse. End of discussion",
      "created_utc": 1738681303.0,
      "score": 26,
      "context": []
    },
    {
      "id": "maxntlj",
      "author": "FrontlineYeen",
      "body": "I hate this so much, sometimes my parents will call me and just basically say “you are going to die cause of your diet”.\n\nThanks, really helped, and made me feel better. My ARFID is cured.",
      "created_utc": 1738682755.0,
      "score": 24,
      "context": []
    },
    {
      "id": "maxte25",
      "author": "foenixxfyre",
      "body": "\"Yes, thank you. I know there's sodium in it. I don't eat enough otherwise for this to be a problem.\"",
      "created_utc": 1738684385.0,
      "score": 15,
      "context": []
    },
    {
      "id": "maxjx5f",
      "author": "None",
      "body": "Tell her you're going to reduce communication with her if she doesn't stop doing this. It's not okay. She's said her peace, you know her stance, and she doesn't need to keep badgering you. It's completely not helpful and actually quite harmful.",
      "created_utc": 1738681563.0,
      "score": 13,
      "context": []
    },
    {
      "id": "maxyg36",
      "author": "purplechunkymonkey",
      "body": "My daughter's pediatrician says that ramen twice a week is acceptable. Cereal with milk, even the sugary stuff, is better because it has added nutrients. \n\nIf you feel that the sodium is too much, don't use the seasoning pouch. Instead us a low sodium or no salt added broth.",
      "created_utc": 1738685838.0,
      "score": 11,
      "context": []
    },
    {
      "id": "mazdb22",
      "author": "kaki024",
      "body": "Not eating at all will actually kill me. I’d rather eat noodles and take a risk of dying, than the guarantee of starving",
      "created_utc": 1738700089.0,
      "score": 8,
      "context": []
    },
    {
      "id": "mazzosw",
      "author": "Jealous-Ant-6197",
      "body": "Not eating at all has been linked to a definite risk of death",
      "created_utc": 1738706552.0,
      "score": 8,
      "context": []
    },
    {
      "id": "maxqh0i",
      "author": "Hanhula",
      "body": "Send her a screenshot of the side effects of some of the stronger medical treatments out there. Sometimes, to survive, we have to do things that aren't necessarily the best for our bodies. ARFID has some treatments, sure, but we need to eat before we can even consider tackling those!",
      "created_utc": 1738683540.0,
      "score": 6,
      "context": []
    },
    {
      "id": "maz68w3",
      "author": "lemonadelemons",
      "body": "I've definitely had experiences like this. I would drink a nutrition shake every morning before ballet class and usually come in with my nutrition shake. My ballet instructor would tell me that I'm ruining my body by drinking them and they were unhealthy for me and constantly try to get me to eat other foods. Eventually I had to tell him I had an eating disorder and he just told me I needed to eat a boiled Apple every morning.",
      "created_utc": 1738698062.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mb184e4",
      "author": "Autismsaurus",
      "body": "My dad does this too. He's constantly sending me articles about gut microbiomes and how unhealthy foods trash it and cause a million other body and health problems.  It doesn't help.\n\nIt's like they think we're clueless about nutrition and that if they just inform us that it's not healthy to eat spaghettios for every meal, we will learn to eat \"well\".",
      "created_utc": 1738720883.0,
      "score": 5,
      "context": []
    },
    {
      "id": "maytfsn",
      "author": "TheMelonSystem",
      "body": "I dare you to say “would you rather I don’t eat anything?” /j\n\nSeriously, tho. The fact that you’ve found something you CAN eat is a good thing. Never forget that ❤️",
      "created_utc": 1738694488.0,
      "score": 3,
      "context": []
    },
    {
      "id": "maz3s75",
      "author": "Many_Listen_2640",
      "body": "If I never ate instant chicken noodles again I would be dead by starvation before I had the chance to die from heart failure lol. Also starvation causes heart issues anyway so anything is better than nothing. People don't understand that if we can't eat our preferred food we will literally just not eat until we get sick.",
      "created_utc": 1738697367.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mazges7",
      "author": "quetsies",
      "body": "starvation works faster than whatever demon food these people decide to attack for the week",
      "created_utc": 1738700996.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mazxgql",
      "author": "CherryPickerKill",
      "body": "Sounds controlling and anxiety-inducing. I would block her until she understands or start sending her stuff that makes her uncomfortable. Everyone's habits and lifestyle can be criticized.",
      "created_utc": 1738705909.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mb3kee6",
      "author": "XxLexxyXx",
      "body": "Sounds like some boundaries need to be set. I hate attention grabbing headlines like this. That is just a picture, that could be sensationalized BS. Show me the actual article with the study, from a credible news source and medical journal. It is actually really hard to link specific behaviors with specific health outcomes. Correlation does not equal causation. I actually looked into this more and yeah that image doesn't capture the full story. [Link 1 to a study from 2017](https://pmc.ncbi.nlm.nih.gov/articles/PMC5381724/) [Link 2 to only an abstract](https://pubmed.ncbi.nlm.nih.gov/24114476/)  I HIGHLY doubt you are eating so much that it is going to make a real difference in your health. As long as you go to the doctor and your labs are fine and you feel pretty alright, you are fine. \n\n  \nIt isn't the noodles that are the problem, it is the sodium, more specifically the MSG. But again, you are not going to combust tomorrow because you ate ramen noodles this week. You will, however, not do well at all if you starve yourself. \n\n  \nI would say if she continues to send you passive aggressive fear mongering images about food, you need to tell her you are going to block her and not respond to her messages. If she is going to be rude, she gets to have limited access to you. \n\n  \nBetter yet, ask her why she thinks it is okay or appropriate to comment on your diet? You could always be petty back and comment on something in her lifestyle. \n\n  \nStuff like this just pisses me off. I am not interested in being made to feel bad for what I eat. I refuse to demonize food. Food is food. It has no morality.",
      "created_utc": 1738760634.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mayaq6c",
      "author": "None",
      "body": "who cares about what they think? i barely trust anything from nutrition sources these days because of just how often it changes. the general consensus is that eating something is better than not eating at all. the research around dietary restrictions and health issues is very fickle. you're much more likely to catch cancer by smoking. \neat what you have to, don't starve yourself.",
      "created_utc": 1738689285.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mb00qxo",
      "author": "Mayatar",
      "body": "News to asian people who tend to live longer and healthier... I bet this article barely touches portionsize and added chemicals.",
      "created_utc": 1738706867.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mb0gzox",
      "author": "fifibunkin",
      "body": "The they can’t stop me from eating one of my last remaining safe foods. I swear this pmo so much.",
      "created_utc": 1738711982.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mb144lb",
      "author": "boo-raspberry",
      "body": "When people do stuff like this, honestly it really irritates me, so Ill usually respond with. \"Well its better than not eating\"  \n\nBut if you want to be productive you could maybe express that her doing this isnt going to make you want to or feel comfortable exploring other foods and that, at most, all she'll do is shrink the pool of safe foods you CAN eat.",
      "created_utc": 1738719599.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mb1gpa8",
      "author": "puppysecretary",
      "body": "People expect us to not eat ramen? In THIS economy?",
      "created_utc": 1738723691.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mb25894",
      "author": "blxoom",
      "body": "INHALING OXYGEN LINKED TO DEATH",
      "created_utc": 1738732826.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mb8ahd9",
      "author": "anilucy",
      "body": "Instant noodles is the one thing I will always make when I am too lazy to make anything else or if I’m so stressed from college that I literally do not have the time to sit and make a meal or go out for food",
      "created_utc": 1738811501.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mbd21h0",
      "author": "None",
      "body": "It's so patronising when people who don't have a clue what we go through try and comment on our habits. Just remember, eating nothing is significantly more unhealthy than eating what people consider junk. Literally everything can be unhealthy for you. When I was like 14 - 15, my mom used to try to pressure me into eating meat because I ate nothing but junk. But processed meat is just as unhealthy as the shit I was eating. I hate diet culture because, even if it has good intentions, it just ends up hurting a lot of people with its toxicity. Please do try and diversify your pallet, but do it in a safe way, and don't worry about what you can eat because it's not something you can control, and stressing about it is just going to cause more harm.",
      "created_utc": 1738876071.0,
      "score": 1,
      "context": []
    },
    {
      "id": "maxswli",
      "author": "angelneliel",
      "body": "Anything in excess can be unhealthy. Even the healthiest of foods.\n\nI don't see how fear mongering (the post OP's family member sent them) and shame will help anybody with an eating disorder recover.  If you aren't on the ED person's medical team, keep your opinions to yourself.\n\nOP, I would highly recommend blocking messages from your sister if this is a repeated occurrence and they keep crossing your boundaries.",
      "created_utc": 1738684246.0,
      "score": 28,
      "context": [
        {
          "id": "max56v4",
          "author": "Agile-Army-4166",
          "body": "Lord i hate images like this. Also an avid instant noodle eater and there is no way of changing that. I try to add healthy things to my diet but what people don’t understand is we can’t just take things out of our diet because they’re unhealthy. We’re already struggling to find meals that we can eat, healthy or not, and removing unhealthy ones would leave many of us with nothing to eat.\n\nEven some of the foods i eat that i think are healthy end up being harmful in some way when i google them. It’s exhausting.",
          "created_utc": 1738676632.0
        }
      ]
    },
    {
      "id": "mb035v1",
      "author": "MustProtectTheFairy",
      "body": "This. Doctors would rather you consume *something* rather than *nothing*.\n\nOP, tell your sister that her approach is only making the issue worse, not better. The scare tactic only works to raise anxiety, not lessen, so does she want you to be healthy or not?\n\nIf yes, then lay off the scare and let you figure it out. At least you're eating something.",
      "created_utc": 1738707593.0,
      "score": 18,
      "context": [
        {
          "id": "maxep3c",
          "author": "milkisterrifying",
          "body": "“You know what’s more unhealthy? Not eating.”",
          "created_utc": 1738679894.0
        }
      ]
    },
    {
      "id": "mb82f2c",
      "author": "Myis",
      "body": "My kid (he’s an adult now) ate nothing but raisin bread for lunch 4 years straight",
      "created_utc": 1738808758.0,
      "score": 2,
      "context": [
        {
          "id": "maxep3c",
          "author": "milkisterrifying",
          "body": "“You know what’s more unhealthy? Not eating.”",
          "created_utc": 1738679894.0
        }
      ]
    },
    {
      "id": "maxns94",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1738682744.0,
      "score": -53,
      "context": [
        {
          "id": "max6l1u",
          "author": "RozGhul",
          "body": "Bruh why does she careeee, people are just so ✨exhausting✨",
          "created_utc": 1738677126.0
        }
      ]
    },
    {
      "id": "mb408v2",
      "author": "heartoffiction",
      "body": "My parents told me while I was packing for college that they thought I’d starve because I didn’t know how to make any food like hmmmm who was responsible for teaching me how to do that the last 18 years…",
      "created_utc": 1738766232.0,
      "score": 2,
      "context": [
        {
          "id": "maxntlj",
          "author": "FrontlineYeen",
          "body": "I hate this so much, sometimes my parents will call me and just basically say “you are going to die cause of your diet”.\n\nThanks, really helped, and made me feel better. My ARFID is cured.",
          "created_utc": 1738682755.0
        }
      ]
    },
    {
      "id": "mb058dh",
      "author": "zephalephadingong",
      "body": "It's the sodium.  Instant ramen has a truly insane amount of salt in it.\n\nOf course you can get around that by using half the packet, or mitigate it by drinking more water.  Plus having too much sodium in your diet is still better then not eating",
      "created_utc": 1738708228.0,
      "score": 5,
      "context": [
        {
          "id": "mb00qxo",
          "author": "Mayatar",
          "body": "News to asian people who tend to live longer and healthier... I bet this article barely touches portionsize and added chemicals.",
          "created_utc": 1738706867.0
        }
      ]
    },
    {
      "id": "maxqrg2",
      "author": "RozGhul",
      "body": "If she cares about her sibling, she'd know more about ARFID and that sometimes any food is better than no food. Nobody thinks instant noodles are healthy. Sometimes that's all we can stomach.",
      "created_utc": 1738683625.0,
      "score": 45,
      "context": [
        {
          "id": "max6l1u",
          "author": "RozGhul",
          "body": "Bruh why does she careeee, people are just so ✨exhausting✨",
          "created_utc": 1738677126.0
        },
        {
          "id": "maxns94",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1738682744.0
        }
      ]
    },
    {
      "id": "maytkm3",
      "author": "TheMelonSystem",
      "body": "Are you aware that you’re in an ARFID sub?",
      "created_utc": 1738694526.0,
      "score": 13,
      "context": [
        {
          "id": "max6l1u",
          "author": "RozGhul",
          "body": "Bruh why does she careeee, people are just so ✨exhausting✨",
          "created_utc": 1738677126.0
        },
        {
          "id": "maxns94",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1738682744.0
        }
      ]
    },
    {
      "id": "mb0g7z9",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1738711726.0,
      "score": -10,
      "context": [
        {
          "id": "max6l1u",
          "author": "RozGhul",
          "body": "Bruh why does she careeee, people are just so ✨exhausting✨",
          "created_utc": 1738677126.0
        },
        {
          "id": "maxns94",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1738682744.0
        },
        {
          "id": "maxqrg2",
          "author": "RozGhul",
          "body": "If she cares about her sibling, she'd know more about ARFID and that sometimes any food is better than no food. Nobody thinks instant noodles are healthy. Sometimes that's all we can stomach.",
          "created_utc": 1738683625.0
        }
      ]
    },
    {
      "id": "mb0mlaa",
      "author": "RozGhul",
      "body": "If she cared about her sibling, she'd know more about ARFID and that sometimes any food is better than no food. Nobody thinks instant noodles are healthy. Sometimes that's all we can stomach.",
      "created_utc": 1738713865.0,
      "score": 6,
      "context": [
        {
          "id": "max6l1u",
          "author": "RozGhul",
          "body": "Bruh why does she careeee, people are just so ✨exhausting✨",
          "created_utc": 1738677126.0
        },
        {
          "id": "maxns94",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1738682744.0
        },
        {
          "id": "maxqrg2",
          "author": "RozGhul",
          "body": "If she cares about her sibling, she'd know more about ARFID and that sometimes any food is better than no food. Nobody thinks instant noodles are healthy. Sometimes that's all we can stomach.",
          "created_utc": 1738683625.0
        },
        {
          "id": "mb0g7z9",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1738711726.0
        }
      ]
    },
    {
      "id": "mb2r1ir",
      "author": "Fabulous_Gur3712",
      "body": "Again, \"why does she care\" does 2 things;\n\n1) implies the sister DOES care\n\n2) implies it's weird for a sister to care",
      "created_utc": 1738744560.0,
      "score": -4,
      "context": [
        {
          "id": "max6l1u",
          "author": "RozGhul",
          "body": "Bruh why does she careeee, people are just so ✨exhausting✨",
          "created_utc": 1738677126.0
        },
        {
          "id": "maxns94",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1738682744.0
        },
        {
          "id": "maxqrg2",
          "author": "RozGhul",
          "body": "If she cares about her sibling, she'd know more about ARFID and that sometimes any food is better than no food. Nobody thinks instant noodles are healthy. Sometimes that's all we can stomach.",
          "created_utc": 1738683625.0
        },
        {
          "id": "mb0g7z9",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1738711726.0
        },
        {
          "id": "mb0mlaa",
          "author": "RozGhul",
          "body": "If she cared about her sibling, she'd know more about ARFID and that sometimes any food is better than no food. Nobody thinks instant noodles are healthy. Sometimes that's all we can stomach.",
          "created_utc": 1738713865.0
        }
      ]
    },
    {
      "id": "mb3qu8k",
      "author": "RozGhul",
      "body": "The person is eating. That's all that should matter. This person just sending an article about noodles being bad for you comes off as the sibling acting better than. It's the equivalent of a backhanded compliment that nobody asked for.\n\nGet off this sub if you're not willing to understand ARFID.",
      "created_utc": 1738763054.0,
      "score": 4,
      "context": [
        {
          "id": "max6l1u",
          "author": "RozGhul",
          "body": "Bruh why does she careeee, people are just so ✨exhausting✨",
          "created_utc": 1738677126.0
        },
        {
          "id": "maxns94",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1738682744.0
        },
        {
          "id": "maxqrg2",
          "author": "RozGhul",
          "body": "If she cares about her sibling, she'd know more about ARFID and that sometimes any food is better than no food. Nobody thinks instant noodles are healthy. Sometimes that's all we can stomach.",
          "created_utc": 1738683625.0
        },
        {
          "id": "mb0g7z9",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1738711726.0
        },
        {
          "id": "mb0mlaa",
          "author": "RozGhul",
          "body": "If she cared about her sibling, she'd know more about ARFID and that sometimes any food is better than no food. Nobody thinks instant noodles are healthy. Sometimes that's all we can stomach.",
          "created_utc": 1738713865.0
        },
        {
          "id": "mb2r1ir",
          "author": "Fabulous_Gur3712",
          "body": "Again, \"why does she care\" does 2 things;\n\n1) implies the sister DOES care\n\n2) implies it's weird for a sister to care",
          "created_utc": 1738744560.0
        }
      ]
    }
  ]
}