{
  "id": "1iipnpm",
  "subreddit": "ARFID",
  "author": "xernpostz",
  "created_utc": 1738802032.0,
  "title": "The hate for processed foods",
  "selftext": "i see too many people rant about how arfid isn't a \"real\" disorder because people with it only eat \"processed junk.\" that people will eat if they're given a variety of foods rather than given access to what they like. does this not just infuriate y'all? i don't eat processed foods solely because they taste good, i eat them because it's the same texture and flavor every time. not to mention it's not only processed foods. i like black beans and rice, those two are fairly consistent with overall texture and flavor as well. \n\ni think the problem is very rooted in how not only are processed foods cheap, but they're familiar and similar each time you have them. a huge fear factor for me is having too many different textures and flavors on the same plate. i always eat pretty much one dish of the same flavor and texture because that's what i'm used to. unfortunately, usually the only foods that do this are processed. i don't understand what people don't get about that. \n\n(ps. i know it's probably weird i don't have any post history, i deleted my reddit account yesterday and started clean. i was actually pretty active on this sub before.) ",
  "url": "https://www.reddit.com/r/ARFID/comments/1iipnpm/the_hate_for_processed_foods/",
  "score": 160,
  "num_comments": 34,
  "comments": [
    {
      "id": "mb7js5x",
      "author": "blackmetalwarlock",
      "body": "People think that eating disorders are all about body image, and have no idea just how different each eating disorder really can be.",
      "created_utc": 1738802715.0,
      "score": 131,
      "context": []
    },
    {
      "id": "mb9f8rp",
      "author": "TheWeirdWriter",
      "body": "That is why this is one of my favorite images, even though it is referring to kids. It just sums up all these feelings so efficiently.\n\nhttps://preview.redd.it/hgtoh2z6bhhe1.jpeg?width=943&format=pjpg&auto=webp&s=2e56cbfd49a3e703307b703915e31180a59ff3d9",
      "created_utc": 1738830307.0,
      "score": 76,
      "context": []
    },
    {
      "id": "mb84vyz",
      "author": "scully3968",
      "body": "Wow, this post has made me realize something. With orthorexia being fashionable and all the media attention dedicated to talking about how bad processed foods are, I think I actually feel as bad about my diet now as I do about my body from my body image issues.\n\nThere's so much shame around not being able to eat a \"good\" diet. I think maybe I'd be energetic and less depressed and my acne would go away if only I could eat like I should. I should probably work on letting all of that guilt go.",
      "created_utc": 1738809585.0,
      "score": 38,
      "context": []
    },
    {
      "id": "mb86srm",
      "author": "lemonadelemons",
      "body": "I think it's silly that people would assume that people with ARFID only eat processed foods. I eat a lot of fresh fruit And some vegetables as my safe foods. I do eat a lot of processed food because of the texture consistencies and the sameness of taste, but I definitely have those fresh foods in there.\n\nHowever, I do do a lot better on liquid foods.",
      "created_utc": 1738810235.0,
      "score": 27,
      "context": []
    },
    {
      "id": "mb9t6o0",
      "author": "NoButterOnlyRage",
      "body": "It's really dumb that people assume ARFID is always the same. My safest foods are mostly vegetables and meats so that's \"whole\" food and healthy and whatever... which makes me feel a bit like I don't have ARFID because people treat me like I am just making \"healthy food choices\" most of the time. It's similar for weight, I've seen people online mocking a person with ARFID who was overweight because \"If they really had ARFID they wouldn't be able to eat enough to be like that\" which is just so stupid lol.   \nI generally don't like the hate on processed food because, whilst health concerns are valid and understandable, people always make it into a morals thing. You are not morally \"bad\" or \"greedy\" because you eat processed or unhealthy food. It's just food , which says nothing about your personality or morals.....",
      "created_utc": 1738838884.0,
      "score": 10,
      "context": []
    },
    {
      "id": "mb7lr92",
      "author": "angelneliel",
      "body": "These people infuriate me as well. I haven't exactly seen word for word what you're describing (that ARFID isn't a real disorder); but I have seen the rhetoric online about how picky eaters are choosing to be picky and how \"annoying\" and terrible people these people must be for asking for accommodations. \n\nSomebody sending a plate back is major social faux-pas apparently. Having dietary requests is a major social faux-pas. Inconveniencing anybody, even inconveniencing nobody, when it revolves around food, somebody will have a nasty opinion about it, and plenty of other nasties will agree.\n\nAnd they always use picky eating and traits as an insult, especially to anybody who disagrees with them. \n\nTotally ignorant and disgusting. I dream of very violent things happening for these people. Oh–and I hope they have to live with a pebble in their shoe every single day of their life.",
      "created_utc": 1738803353.0,
      "score": 30,
      "context": []
    },
    {
      "id": "mb91xjl",
      "author": "Angelangepange",
      "body": "Yes, so angry. Because I worked on it people often don't think about me as someone with arfid and I hear stuff like \"but how can a person think that's good? How can one be eating only that?\" Dude it's not about it being good, it's about it not making me gag 😑   \nIt's not a real choice that we make.   \nWe just don't have options.   \nIt's as if everything else is rotten.   \n    \nYesterday I was watching a video about art and this woman in it started doing comparisons with fast food over and over and I couldn't even listen to her anymore even tho I was interested in the beginning. I can't even remember what the comparison was about. But obviously the fast food was negative.",
      "created_utc": 1738822818.0,
      "score": 10,
      "context": []
    },
    {
      "id": "mb95n7m",
      "author": "geekgeek2019",
      "body": "Ugh I hate it.\nSo many instances when I’m having these “processed food” and someone goes “oh it’s not healthy for you”\n\nBuddy is it healthy that I starve then?",
      "created_utc": 1738824759.0,
      "score": 10,
      "context": []
    },
    {
      "id": "mb7uk3f",
      "author": "Deep_Willingness6071",
      "body": "I know what you mean! Beans and rice are good choices though. Sometimes I question whether not I have ARFID because I mostly stick to sweets, but the thing they all have in common is they’re easy to swallow and have similar textures (like ice cream and yogurt) and if they weren’t good textures, I wouldn’t eat them. \n\nIf you can, I’d blend a lot of fruits and veggies into a smoothie (with an avocado, blue berries and a banana and milk, that adds up 170 calories and 20+ g of protein) and that’ll shut up anybody complaining about your “processed” diet. Just an idea though.",
      "created_utc": 1738806176.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mbd3yer",
      "author": "isucktoesforbitcoin",
      "body": "i have arfid and i go the exact opposite i hate over processed foods because they taste fake and plastic like to me and i get comments from people asking if im dieting because i eat so much veggies and asking if i ever eat a cheeseburger or “have a cheat day” because i have such aversions to processed foods like chips and deli meats. i always think it so interesting how two people can have a similar illness or disorder and have two very different experiences from it but also have the same experience of questioning and being “different” from others",
      "created_utc": 1738876593.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mbay4op",
      "author": "Montymania94",
      "body": "I personally won't touch processed meat bc of incidents with gristle and fat. Meat in general is a no-go for me. I also have trouble with the texture of nuts.\n\nMy main diet is fruits, veggies, and beans, plus some vegetarian stuff like breaded mushroom filets. Pastas and breads are lovely. I like some processed stuff, like crackers, but not as much as I like my rabbit food lol!\n\nARFID is extremely misunderstood, for sure. What makes me wanna puke is someone else's safe food; that's just how it is.",
      "created_utc": 1738855053.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mb8wlgt",
      "author": "Daddysissues14",
      "body": "I actually prefer less processed food. Real bread and fruits and veggies. Fast food gives me icks because it always looks like someone who hates you made your food. It’s not consistent or like when I was younger so I don’t like it. Meats are often a problem for me. Any tendon or gristle ends that part of the meal for me. I can not swallow a bit with that in it.",
      "created_utc": 1738820227.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mb7oh3k",
      "author": "APleasantMartini",
      "body": "I hate it too.",
      "created_utc": 1738804228.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mbcbu3a",
      "author": "Anonymity013",
      "body": "Processed foods last forever, this helps with fear of becoming ill for me. I’m terrified of mouldy food.\nProcessed food tastes the same every time like others have mentioned. Many people with ARFID are very sensitive to taste and appearance of food.\nProcessed food is easy to prep. This helps with a lack of interest in food.\nThat is one reason for each of the three main types of this disorder.",
      "created_utc": 1738868862.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mbcxjpl",
      "author": "professional_sexy",
      "body": "For me, when my arfid is flaring up, I get really paranoid about food going bad or tasting moldy. I try to lean on healthy frozen meals or processed foods that at least have protein, fiber, etc. \n\nAt the end of the day, fed is best! Last year, I lost 70 lbs in less than six months. I think people also struggle to understand that arfid can look different person to person and day to day. My husband doesn't always get it, but he tries. My question to the haters is what is the harm in people seeking support from like-minded individuals, and why be mean and invalidating about it when you don't have experience with it??",
      "created_utc": 1738874850.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mbfkh60",
      "author": "Peanutbutternmtn2",
      "body": "Absolutely right. I know one reason I can’t eat berries, is I tried them, and they tasted fine, up until I got some seeds in a couple of them and it just ruined the idea of them for me forever.",
      "created_utc": 1738906040.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mbiy91s",
      "author": "Bulky_Influence_4914",
      "body": "we love it because of consistency",
      "created_utc": 1738954935.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mbutzx1",
      "author": "Korean_Pathfinder",
      "body": "If it's all you can eat then by all means do it,  but processed food are definitely bad for you. This coming from a guy who eats a lot of processed foods. I know it's slowly killing me, but I have no other options.",
      "created_utc": 1739117741.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mcr8yr1",
      "author": "DroBoww",
      "body": "It pisses me off, makes me feel like i'm subhuman and just shows how ignorant and stupid some people can be",
      "created_utc": 1739551999.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mb7kdt3",
      "author": "xernpostz",
      "body": "too true. infuriating that not enough research has been dedicated to arfid despite having been discovered over a decade ago.",
      "created_utc": 1738802909.0,
      "score": 27,
      "context": [
        {
          "id": "mb7js5x",
          "author": "blackmetalwarlock",
          "body": "People think that eating disorders are all about body image, and have no idea just how different each eating disorder really can be.",
          "created_utc": 1738802715.0
        }
      ]
    },
    {
      "id": "mb8lk64",
      "author": "xernpostz",
      "body": "every person with arfid is built different and making those generalizations often does nothing but add to the pile of misinformation. i once saw a video that claimed the diagnostic criteria has to include eating processed foods, which is false and dumb. \n\ni like strawberries and tangerines from time to time, though i much prefer drinking ensures.",
      "created_utc": 1738815569.0,
      "score": 16,
      "context": [
        {
          "id": "mb86srm",
          "author": "lemonadelemons",
          "body": "I think it's silly that people would assume that people with ARFID only eat processed foods. I eat a lot of fresh fruit And some vegetables as my safe foods. I do eat a lot of processed food because of the texture consistencies and the sameness of taste, but I definitely have those fresh foods in there.\n\nHowever, I do do a lot better on liquid foods.",
          "created_utc": 1738810235.0
        }
      ]
    },
    {
      "id": "mbcqjdk",
      "author": "independentchickpea",
      "body": "My diet when I'm struggling is mostly chicken nuggets and fresh fruit. It's not the worst, it gets me protein and good stuff, but it can feel like a kick in the gut when I see these messages about processed food. I know thar 90% of my diet is whole foods, but when I need shakes or nuggets to round out my protein and calories, I feel like a failure....? And this is after two rounds of treatment and being in recovery for years. But I do go back to processed foods to avoid any texture issues and ensuing nausea cycle.\n\nIt's tough.",
      "created_utc": 1738872925.0,
      "score": 5,
      "context": [
        {
          "id": "mb86srm",
          "author": "lemonadelemons",
          "body": "I think it's silly that people would assume that people with ARFID only eat processed foods. I eat a lot of fresh fruit And some vegetables as my safe foods. I do eat a lot of processed food because of the texture consistencies and the sameness of taste, but I definitely have those fresh foods in there.\n\nHowever, I do do a lot better on liquid foods.",
          "created_utc": 1738810235.0
        }
      ]
    },
    {
      "id": "mb9y07l",
      "author": "Oribeun",
      "body": "I am overweight but malnourished. \nI stopped trying to explain the fact that, in my case, those two things are unrelated because people just cannot get their head around it.",
      "created_utc": 1738841544.0,
      "score": 7,
      "context": [
        {
          "id": "mb9t6o0",
          "author": "NoButterOnlyRage",
          "body": "It's really dumb that people assume ARFID is always the same. My safest foods are mostly vegetables and meats so that's \"whole\" food and healthy and whatever... which makes me feel a bit like I don't have ARFID because people treat me like I am just making \"healthy food choices\" most of the time. It's similar for weight, I've seen people online mocking a person with ARFID who was overweight because \"If they really had ARFID they wouldn't be able to eat enough to be like that\" which is just so stupid lol.   \nI generally don't like the hate on processed food because, whilst health concerns are valid and understandable, people always make it into a morals thing. You are not morally \"bad\" or \"greedy\" because you eat processed or unhealthy food. It's just food , which says nothing about your personality or morals.....",
          "created_utc": 1738838884.0
        }
      ]
    },
    {
      "id": "mb9vyjk",
      "author": "Oribeun",
      "body": "Where I live, dietary requests as in allergies are never a problem, most restaurants even say on their menus that if you have any allergies, the chef cook will be more than happy to come up with an alternative and no one has any problem with it.\nBut when I say that I can't eat something because I have an *other* strong physical reaction towards that food, such as vomiting, then I'm considered a pain and picky.\nBoth are negative physical reactions, but the different reactions to them make absolutely no sense to me.\n\nSo, of course, I simply have several allergies when I'm out to eat (which I do, I just expanded the list with other items) and no one cares and I can eat something I can actually eat.",
      "created_utc": 1738840448.0,
      "score": 6,
      "context": [
        {
          "id": "mb7lr92",
          "author": "angelneliel",
          "body": "These people infuriate me as well. I haven't exactly seen word for word what you're describing (that ARFID isn't a real disorder); but I have seen the rhetoric online about how picky eaters are choosing to be picky and how \"annoying\" and terrible people these people must be for asking for accommodations. \n\nSomebody sending a plate back is major social faux-pas apparently. Having dietary requests is a major social faux-pas. Inconveniencing anybody, even inconveniencing nobody, when it revolves around food, somebody will have a nasty opinion about it, and plenty of other nasties will agree.\n\nAnd they always use picky eating and traits as an insult, especially to anybody who disagrees with them. \n\nTotally ignorant and disgusting. I dream of very violent things happening for these people. Oh–and I hope they have to live with a pebble in their shoe every single day of their life.",
          "created_utc": 1738803353.0
        }
      ]
    },
    {
      "id": "mb7t38l",
      "author": "xernpostz",
      "body": "ive seen articles on arfid where a lot of people think it's a joke or not real. or worse yet, saying that people can't have it unless it's what their idea of it is in their head. \n\nit's unfortunate because food is such a major part of our society. we talk and bond and have conversations over food. we're just the outliers and people seem to really hate that. it's immensely frustrating.",
      "created_utc": 1738805703.0,
      "score": 5,
      "context": [
        {
          "id": "mb7lr92",
          "author": "angelneliel",
          "body": "These people infuriate me as well. I haven't exactly seen word for word what you're describing (that ARFID isn't a real disorder); but I have seen the rhetoric online about how picky eaters are choosing to be picky and how \"annoying\" and terrible people these people must be for asking for accommodations. \n\nSomebody sending a plate back is major social faux-pas apparently. Having dietary requests is a major social faux-pas. Inconveniencing anybody, even inconveniencing nobody, when it revolves around food, somebody will have a nasty opinion about it, and plenty of other nasties will agree.\n\nAnd they always use picky eating and traits as an insult, especially to anybody who disagrees with them. \n\nTotally ignorant and disgusting. I dream of very violent things happening for these people. Oh–and I hope they have to live with a pebble in their shoe every single day of their life.",
          "created_utc": 1738803353.0
        }
      ]
    },
    {
      "id": "mb94lor",
      "author": "xernpostz",
      "body": "that really sucks. we need to foster more positive emotions for food, anyways. food is fuel for the body. eating any fuel is better than none at all. \n\nshaming people for eating fast food and processed food does nothing but cause more disordered eating and shame people who can't eat much else.",
      "created_utc": 1738824201.0,
      "score": 4,
      "context": [
        {
          "id": "mb91xjl",
          "author": "Angelangepange",
          "body": "Yes, so angry. Because I worked on it people often don't think about me as someone with arfid and I hear stuff like \"but how can a person think that's good? How can one be eating only that?\" Dude it's not about it being good, it's about it not making me gag 😑   \nIt's not a real choice that we make.   \nWe just don't have options.   \nIt's as if everything else is rotten.   \n    \nYesterday I was watching a video about art and this woman in it started doing comparisons with fast food over and over and I couldn't even listen to her anymore even tho I was interested in the beginning. I can't even remember what the comparison was about. But obviously the fast food was negative.",
          "created_utc": 1738822818.0
        }
      ]
    },
    {
      "id": "mb7w3iy",
      "author": "xernpostz",
      "body": "we are born naturally liking two flavors in our palettes, sweet and salty. funnily enough, that's my diet and a lot of arfid diets that ive seen. i think we just genetically don't grow out of that limited palette. i too will eat anything sweet. \n\nthanks for the awesome recipe, ill try it out when i can!",
      "created_utc": 1738806669.0,
      "score": 3,
      "context": [
        {
          "id": "mb7uk3f",
          "author": "Deep_Willingness6071",
          "body": "I know what you mean! Beans and rice are good choices though. Sometimes I question whether not I have ARFID because I mostly stick to sweets, but the thing they all have in common is they’re easy to swallow and have similar textures (like ice cream and yogurt) and if they weren’t good textures, I wouldn’t eat them. \n\nIf you can, I’d blend a lot of fruits and veggies into a smoothie (with an avocado, blue berries and a banana and milk, that adds up 170 calories and 20+ g of protein) and that’ll shut up anybody complaining about your “processed” diet. Just an idea though.",
          "created_utc": 1738806176.0
        }
      ]
    },
    {
      "id": "mb8zxv7",
      "author": "xernpostz",
      "body": "processed isn't exclusively fast food, though i see what you mean. fast food definitely isn't consistent for me either. processed foods also include snacks and sweets and other packaged products you can find in the grocery store - baked goods, ice cream, crackers, so on and so forth... \n\nbread is absolutely a banger though. i love grilled cheese sandwiches.",
      "created_utc": 1738821824.0,
      "score": 2,
      "context": [
        {
          "id": "mb8wlgt",
          "author": "Daddysissues14",
          "body": "I actually prefer less processed food. Real bread and fruits and veggies. Fast food gives me icks because it always looks like someone who hates you made your food. It’s not consistent or like when I was younger so I don’t like it. Meats are often a problem for me. Any tendon or gristle ends that part of the meal for me. I can not swallow a bit with that in it.",
          "created_utc": 1738820227.0
        }
      ]
    },
    {
      "id": "mbfm53i",
      "author": "xernpostz",
      "body": "yeah no, seeds suck. i also don't like the weird starchy stuff you can peel off of the inside of bananas and oranges.",
      "created_utc": 1738906780.0,
      "score": 1,
      "context": [
        {
          "id": "mbfkh60",
          "author": "Peanutbutternmtn2",
          "body": "Absolutely right. I know one reason I can’t eat berries, is I tried them, and they tasted fine, up until I got some seeds in a couple of them and it just ruined the idea of them for me forever.",
          "created_utc": 1738906040.0
        }
      ]
    },
    {
      "id": "mb7lfkd",
      "author": "blackmetalwarlock",
      "body": "I know right?",
      "created_utc": 1738803247.0,
      "score": 6,
      "context": [
        {
          "id": "mb7js5x",
          "author": "blackmetalwarlock",
          "body": "People think that eating disorders are all about body image, and have no idea just how different each eating disorder really can be.",
          "created_utc": 1738802715.0
        },
        {
          "id": "mb7kdt3",
          "author": "xernpostz",
          "body": "too true. infuriating that not enough research has been dedicated to arfid despite having been discovered over a decade ago.",
          "created_utc": 1738802909.0
        }
      ]
    },
    {
      "id": "mba2cdg",
      "author": "NoButterOnlyRage",
      "body": "It's so stupid.. I'm sorry you have to deal with people like that",
      "created_utc": 1738843704.0,
      "score": 4,
      "context": [
        {
          "id": "mb9t6o0",
          "author": "NoButterOnlyRage",
          "body": "It's really dumb that people assume ARFID is always the same. My safest foods are mostly vegetables and meats so that's \"whole\" food and healthy and whatever... which makes me feel a bit like I don't have ARFID because people treat me like I am just making \"healthy food choices\" most of the time. It's similar for weight, I've seen people online mocking a person with ARFID who was overweight because \"If they really had ARFID they wouldn't be able to eat enough to be like that\" which is just so stupid lol.   \nI generally don't like the hate on processed food because, whilst health concerns are valid and understandable, people always make it into a morals thing. You are not morally \"bad\" or \"greedy\" because you eat processed or unhealthy food. It's just food , which says nothing about your personality or morals.....",
          "created_utc": 1738838884.0
        },
        {
          "id": "mb9y07l",
          "author": "Oribeun",
          "body": "I am overweight but malnourished. \nI stopped trying to explain the fact that, in my case, those two things are unrelated because people just cannot get their head around it.",
          "created_utc": 1738841544.0
        }
      ]
    },
    {
      "id": "mbaw9bh",
      "author": "Montymania94",
      "body": "Idk why you got downvoted. Having to lie about an allergy isn't ideal, but it's better than puking all over the place, or not being able to eat at all if something isn't right.\n\nAnd, just to be clear, I do have allergies; the main two being artificial sweetners and banana peppers. If saying you have an allergy helps, then idgaf.\n\nTbh, it means cooks will get more experience handling allergens properly, which then makes eating out somewhat safer for many.",
      "created_utc": 1738854497.0,
      "score": 7,
      "context": [
        {
          "id": "mb7lr92",
          "author": "angelneliel",
          "body": "These people infuriate me as well. I haven't exactly seen word for word what you're describing (that ARFID isn't a real disorder); but I have seen the rhetoric online about how picky eaters are choosing to be picky and how \"annoying\" and terrible people these people must be for asking for accommodations. \n\nSomebody sending a plate back is major social faux-pas apparently. Having dietary requests is a major social faux-pas. Inconveniencing anybody, even inconveniencing nobody, when it revolves around food, somebody will have a nasty opinion about it, and plenty of other nasties will agree.\n\nAnd they always use picky eating and traits as an insult, especially to anybody who disagrees with them. \n\nTotally ignorant and disgusting. I dream of very violent things happening for these people. Oh–and I hope they have to live with a pebble in their shoe every single day of their life.",
          "created_utc": 1738803353.0
        },
        {
          "id": "mb9vyjk",
          "author": "Oribeun",
          "body": "Where I live, dietary requests as in allergies are never a problem, most restaurants even say on their menus that if you have any allergies, the chef cook will be more than happy to come up with an alternative and no one has any problem with it.\nBut when I say that I can't eat something because I have an *other* strong physical reaction towards that food, such as vomiting, then I'm considered a pain and picky.\nBoth are negative physical reactions, but the different reactions to them make absolutely no sense to me.\n\nSo, of course, I simply have several allergies when I'm out to eat (which I do, I just expanded the list with other items) and no one cares and I can eat something I can actually eat.",
          "created_utc": 1738840448.0
        }
      ]
    },
    {
      "id": "mb7wwiw",
      "author": "Deep_Willingness6071",
      "body": "Oh neat, I didn’t know that about palletes but sweets are the best. \nOf course, I hope you like it 😊",
      "created_utc": 1738806929.0,
      "score": 1,
      "context": [
        {
          "id": "mb7uk3f",
          "author": "Deep_Willingness6071",
          "body": "I know what you mean! Beans and rice are good choices though. Sometimes I question whether not I have ARFID because I mostly stick to sweets, but the thing they all have in common is they’re easy to swallow and have similar textures (like ice cream and yogurt) and if they weren’t good textures, I wouldn’t eat them. \n\nIf you can, I’d blend a lot of fruits and veggies into a smoothie (with an avocado, blue berries and a banana and milk, that adds up 170 calories and 20+ g of protein) and that’ll shut up anybody complaining about your “processed” diet. Just an idea though.",
          "created_utc": 1738806176.0
        },
        {
          "id": "mb7w3iy",
          "author": "xernpostz",
          "body": "we are born naturally liking two flavors in our palettes, sweet and salty. funnily enough, that's my diet and a lot of arfid diets that ive seen. i think we just genetically don't grow out of that limited palette. i too will eat anything sweet. \n\nthanks for the awesome recipe, ill try it out when i can!",
          "created_utc": 1738806669.0
        }
      ]
    },
    {
      "id": "mbazjwr",
      "author": "Oribeun",
      "body": "Did I get downvoted? I'm on my phone so I can't see that, maybe someone has really strong opinions about lying about something that absolutely doesn't hurt anybody else and adds no extra problems cause I already have allergies I have to take into account? I would love to know.\n\nPeople around me know I have a lot of food allergies and there are too many for someone else to remember which ones they were exactly so nobody notices when I add a few extra.\n\nI didn't think about a chance for learning for cooks, that's a good point! I've noticed that any cook with a heart for their job will love a good challenge and most of them take great pride in making a dish that is still tasty. Everybody wins :)",
      "created_utc": 1738855471.0,
      "score": 4,
      "context": [
        {
          "id": "mb7lr92",
          "author": "angelneliel",
          "body": "These people infuriate me as well. I haven't exactly seen word for word what you're describing (that ARFID isn't a real disorder); but I have seen the rhetoric online about how picky eaters are choosing to be picky and how \"annoying\" and terrible people these people must be for asking for accommodations. \n\nSomebody sending a plate back is major social faux-pas apparently. Having dietary requests is a major social faux-pas. Inconveniencing anybody, even inconveniencing nobody, when it revolves around food, somebody will have a nasty opinion about it, and plenty of other nasties will agree.\n\nAnd they always use picky eating and traits as an insult, especially to anybody who disagrees with them. \n\nTotally ignorant and disgusting. I dream of very violent things happening for these people. Oh–and I hope they have to live with a pebble in their shoe every single day of their life.",
          "created_utc": 1738803353.0
        },
        {
          "id": "mb9vyjk",
          "author": "Oribeun",
          "body": "Where I live, dietary requests as in allergies are never a problem, most restaurants even say on their menus that if you have any allergies, the chef cook will be more than happy to come up with an alternative and no one has any problem with it.\nBut when I say that I can't eat something because I have an *other* strong physical reaction towards that food, such as vomiting, then I'm considered a pain and picky.\nBoth are negative physical reactions, but the different reactions to them make absolutely no sense to me.\n\nSo, of course, I simply have several allergies when I'm out to eat (which I do, I just expanded the list with other items) and no one cares and I can eat something I can actually eat.",
          "created_utc": 1738840448.0
        },
        {
          "id": "mbaw9bh",
          "author": "Montymania94",
          "body": "Idk why you got downvoted. Having to lie about an allergy isn't ideal, but it's better than puking all over the place, or not being able to eat at all if something isn't right.\n\nAnd, just to be clear, I do have allergies; the main two being artificial sweetners and banana peppers. If saying you have an allergy helps, then idgaf.\n\nTbh, it means cooks will get more experience handling allergens properly, which then makes eating out somewhat safer for many.",
          "created_utc": 1738854497.0
        }
      ]
    }
  ]
}