{
  "id": "1ilh1r2",
  "subreddit": "ARFID",
  "author": "hero1107",
  "created_utc": 1739114606.0,
  "title": "Is it just me who decides mid-chew that I don’t want to eat a food anymore?",
  "selftext": "Not sure if it’s an ARFID thing or just me thing lol.\n\nBut even with safe foods, sometimes I’ll be chewing and just mid-chewing I’ll realize, “oh, ew actually I don’t want this in my mouth I need it out now”. Then I have to spit out what I’m eating and can’t finish the rest. My body and throat physically won’t let me swallow what I’m chewing on. Sometimes I start to feel nauseous. \n\nWhen it happens it makes me worry that I’m starting to dislike a safe food which is alarming. After a few days, I can usually go back to the meal/food and have no issue eating it again. Is this just me? \n\nEdit: I am SO glad and relieved that others can relate, but also feel for you all because this sucks. It makes me feel better to be able to associate this with ARFID and I’m not alone. ",
  "url": "https://www.reddit.com/r/ARFID/comments/1ilh1r2/is_it_just_me_who_decides_midchew_that_i_dont/",
  "score": 314,
  "num_comments": 64,
  "comments": [
    {
      "id": "mbumhqc",
      "author": "Weary-Toast",
      "body": "This for sure happens to me. I force myself to finish the bite but am usually done eating when it happens.",
      "created_utc": 1739115528.0,
      "score": 65,
      "context": []
    },
    {
      "id": "mbusvpp",
      "author": "saltyandsmoky",
      "body": "I call it the Danger Bite",
      "created_utc": 1739117412.0,
      "score": 50,
      "context": []
    },
    {
      "id": "mbuvmgu",
      "author": "undercovercatman",
      "body": "This happens to me a lot, mainly with meat 😭 sometimes I’ll just hit a spot that doesn’t hit right or has a weird texture and suddenly I can’t eat any more of that part of my meal no matter how hungry I am, it’s sooo annoying",
      "created_utc": 1739118213.0,
      "score": 35,
      "context": []
    },
    {
      "id": "mbuny6m",
      "author": "boringlesbian",
      "body": "All the time. I will also spit out what is in my mouth. I get nauseous and dizzy and need to rinse out my mouth. Sometimes, I will never be able to eat that food again. Other times, I can go back to it after a while.\n\nIt really sucks when I can’t find anything else that I can eat after that, usually for several hours or until the next day.",
      "created_utc": 1739115962.0,
      "score": 21,
      "context": []
    },
    {
      "id": "mbulbgf",
      "author": "wfpinky",
      "body": "Omg this actually happened to me recently! I’m working with a nutritionist and we recently started easing into aversion therapy/exercises. I wanted to try carrots so we developed a plan to do so. I didn’t hate it (didn’t love it though) and my anxiety was relatively low considering the circumstances. So I considered it a win and planned on trying again to see if I did better the second time around. Yesterday I tried to eat the same carrots again and reminded my brain “hey we like this now so don’t freak out”.  So tell me why mid-chew my brain was like, “nope spit it out”…I’m annoyed. This shit is so frustrating.",
      "created_utc": 1739115174.0,
      "score": 22,
      "context": []
    },
    {
      "id": "mbv1l90",
      "author": "TheGekkou",
      "body": "This has been happening to me for so long that it was my first relation to maybe having AFRID.\n\nI can make myself a meal that I typically will enjoy, be excited for a bite, then the moment I start chewing I decide I can't stand it any more. I usually force myself to try and eat a second bite to not waste my food, but realize it's hopeless and I'm just torturing myself so I throw out the meal and just don't eat.",
      "created_utc": 1739119904.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mbuoy9z",
      "author": "KatsaridaReign",
      "body": "Happened to me yesterday! Sometimes when that happens I can't finish the meal. I'm off of food in general and especially that food for days, and sometimes it's no longer a safe food.\n\nThankfully yesterday I was able to finish my meal.",
      "created_utc": 1739116258.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mbuu384",
      "author": "BuildingOk6614",
      "body": "Yup! Happens to me a lot actually which can be disappointing when i genuinely think I’m enjoying the food and then suddenly it taste like cardboard and I have to spit it out and can’t finish it or even think of eating it again for a few days.",
      "created_utc": 1739117769.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mbuk2ic",
      "author": "Dmdel24",
      "body": "It's happened to me before too, but I get over it quickly too",
      "created_utc": 1739114790.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mbuw23g",
      "author": "ArcherFawkes",
      "body": "Definitely felt this before. I used to choke food down when I was still living with my parents because \"it's a waste\" etc etc. Even when I usually get back to the leftovers in a few hours, my parents hated leftovers and assumed I wouldn't touch it, so they threw my leftovers away (I always told them but they never listen). Textures are a pain in the ass when they hit you the wrong way.",
      "created_utc": 1739118337.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mbv4v6u",
      "author": "flexystephy",
      "body": "I've never been diagnosed with arfid but have strong indicators i have it, I do this is gotta spit it out ASAP, the mealmgoes innthebtrash bc i knowni wont like it tomorrow and I really hate when it's a safe food because those are few to begin with and even fewer when you include lactose intolerance, I've been in this rut with my safe foods the past six mos and only had my period once and it was after Thanksgiving bc i actually ate enough, it's difficult dining out bc I may hate what I wanted shortly before",
      "created_utc": 1739120819.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mbvhgc6",
      "author": "snail6925",
      "body": "this was when I first started researching arfid. it happens less now but not never.",
      "created_utc": 1739124334.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mbvk80n",
      "author": "tittylamp",
      "body": "happens to me a lot. sometimes the textures just get really overwhelming and its a struggle to finish chewing and swallow",
      "created_utc": 1739125102.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mbvki1q",
      "author": "StrawbraryLiberry",
      "body": "Oh yeah, that does happen to me.",
      "created_utc": 1739125180.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mbvmav8",
      "author": "NorthStarMidnightSky",
      "body": "Nope, this happens to me all the time. A meal I'm enjoying suddenly hits a hard stop and I either have to drink a lot of water to get the last bite down, or discretely spit it out.\n\nWith wine or champagne, I get one sip that I can swallow. I go for a second and my throat literally won't let me swallow it. I fake a lot of sips at weddings. \n\nI also have safe foods that become inedible for a while and then become available again. It's why I hate when people ask me what my safe foods are because that changes.",
      "created_utc": 1739125681.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mbwvtfx",
      "author": "iambaby6969",
      "body": "ill literally be so hungry and excited for my safe food and then i give it a simple look and become disgusted :(. i can eventually eat it again but it ruins my appetite for a good 12-24 hours.",
      "created_utc": 1739138687.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mbvtx5v",
      "author": "nietbeschikbaar",
      "body": "Never, whatever I’ve put on my plate I,ll finish even when I feel full.",
      "created_utc": 1739127797.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mbw0bu3",
      "author": "theowlsbrain",
      "body": "I definitely do. I try to power through it if I can and eat quickly to get it over with but sometimes it's overwhelming nausea and just too much. Sometimes I tell myself it's just that specific portion or something that's bad and it helps me over that aversion the next time I'm eating the same food.",
      "created_utc": 1739129578.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mbw4ddo",
      "author": "goldfishmuncher",
      "body": "i've done this a ton",
      "created_utc": 1739130710.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mbwchk8",
      "author": "crown-jewel",
      "body": "It doesn’t happen often, but I distinctly remember when I was younger eating Doritos. I was halfway through the bag, mid-chew when I remember thinking, “why am I eating this, I actually don’t like this.” Threw the rest of the bag away and haven’t had them since 😅",
      "created_utc": 1739133056.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mbwqeo6",
      "author": "rilo_cat",
      "body": "happens to me all the time. i go to the bathroom & spit it in the toilet, or discreetly spit it into a napkin at the table, if need be.",
      "created_utc": 1739137098.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mbwx25m",
      "author": "Sylveon_synth",
      "body": "Unfortunately",
      "created_utc": 1739139062.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mbx25ax",
      "author": "Beverchakus",
      "body": "Happens to me too.",
      "created_utc": 1739140636.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mbx6zdp",
      "author": "rings-no-bells",
      "body": "Super common occurrence for me! I’ll be mid-bite when I realize I absolutely cannot eat this right now. I’ll spit it out and will not touch the rest. \n\nI’ve found the best and easiest way for me to keep my safe foods as safe foods is to be forgiving with myself. I won’t try to force myself to eat it. If I don’t want it and feel that I can’t possibly chew one more time, my body is telling me in the clearest way possible, I do not want it. If I’m still hungry after this, I’ll eat something that is still a safe food but very different to what I had just attempted to eat. Example being I can’t eat a croissant right now so I’ll eat fruit or mac cheese. \n\nI find that I’ll have little to no aversive feelings towards the safe food I wasn’t able to eat, and be able to eat it (happily) later that day",
      "created_utc": 1739142201.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mbx8ofs",
      "author": "fierymtnsunrise",
      "body": "Yes! This is the worst. Trying to explain it to my family makes me feel like a crazy person. 😒My therapist has called it a \"food lock.\" She recommended I try \"deconstructed\" meals.\n\nSo if we make something like a rice bowl we'll have the rice, protein, veggies, and toppings all separate and each person gets to build their plate however they want to.\n\nI have 2 kids (10 and 13) so this has helped me not feel isolated by normalizing different ways to make a meal, so I can have all the ingredients separate if I need to. It's also been helpful with encouraging food exploration with my kids, because they get to control where and how much a new food ends up on their plate.\n\nThis has helped me quite a bit, I hope helps someone else. 😊",
      "created_utc": 1739142779.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mbxdhrj",
      "author": "Zenosparadox1",
      "body": "Yes, I experience this, too.  Difficult when it happens in public.",
      "created_utc": 1739144440.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mbxdr4h",
      "author": "crustil",
      "body": "This definitely happens to me! Sometimes I spit it out, sometimes I won't. Just depends on how close I am to gagging 😅😅",
      "created_utc": 1739144526.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mbxgcy4",
      "author": "Permission707",
      "body": "This happens to me especially with mac n cheese and bagels for some reason. Sometimes other foods too but there’s a 50/50 chance with those two I’ll just have to either swallow quickly or spit out. I try to swallow quickly and stop eating it because if I spit it out I’ll probably puke",
      "created_utc": 1739145347.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mbxq87w",
      "author": "sketchnscribble",
      "body": "This happens to me if a food requires \"too much chewing\". Like, there is a magical limit to how much chewing I am willing to tolerate from a food item until I am like \"nope, I'm out.\"",
      "created_utc": 1739148544.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mbxxsmw",
      "author": "whatdoidonowdamnit",
      "body": "It’s not just you. It happened to me TODAY with oatmeal. The same exact make and model of oatmeal I have been eating for my entire life. A solid 34 years of eating Maple and Brown Sugar Quaker Oats oatmeal from the packet and I puked halfway through it.",
      "created_utc": 1739150846.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mby9wip",
      "author": "teal_hair_dont_care",
      "body": "Yes I always cringe when waiters take my\nplates away cause theres an 80% chance I chewed something and my throat closed up halfway through and I had to spit it into a napkin",
      "created_utc": 1739155380.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mbyjmuj",
      "author": "Honeydewskyy20",
      "body": "That was me today. I have been trying a lot with meat and I’ve been doing good. I’ve been eating chicken lately and today midbite through a chicken tender I got extremely grossed out. Eventually I said out loud, I need to stop doing this to myself, I’m never gonna like chicken. So I’m back with the gross feelings of meat again.",
      "created_utc": 1739158695.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mbylmuh",
      "author": "Skeptikmo",
      "body": "Happens to me all the time, I go from ooh yum to fighting not to puke lol",
      "created_utc": 1739159437.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mbyshm8",
      "author": "Itchy-Ball3276",
      "body": "Trying a liquid diet is very helpful ",
      "created_utc": 1739162137.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mbysrtg",
      "author": "SirLlama123",
      "body": "that happens to me so much, even with like chicken nuggets if the meat is slightly wrong texture i’m just done eating for the day",
      "created_utc": 1739162256.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mbytr1o",
      "author": "IHaveNoUsernameSorry",
      "body": "Yes!",
      "created_utc": 1739162673.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mc0zakd",
      "author": "GaydrianTheRainbow",
      "body": "Absolutely. It doesn’t happen super often, but when it does, it can be hard to keep eating anything for a while.",
      "created_utc": 1739201021.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mc1bbub",
      "author": "fifibunkin",
      "body": "Yes absolutely. It’s very annoying and if I continue to try to eat it it makes me feel like I’m going to throw up.",
      "created_utc": 1739204648.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mc1hlu5",
      "author": "BrokenHeart1935",
      "body": "This happens to my wife all the time. And unfortunately for her, that usually makes the safe food off limits for quite a long time 😔",
      "created_utc": 1739206461.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mc2hyhq",
      "author": "JustbyLlama",
      "body": "I absolutely do this. If I can manage to swallow it, I won’t be eating anymore. But I rarely manage to swallow the food.",
      "created_utc": 1739217068.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mc4emu6",
      "author": "None",
      "body": "Happened today. Happens all the time. I hate wasting too",
      "created_utc": 1739243907.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mc4zvki",
      "author": "bokeleaf",
      "body": "Me !!!!",
      "created_utc": 1739252283.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mc5f3fm",
      "author": "Lil-Miss-Anthropy",
      "body": "Yeah kinda. The texture of chewed up food grosses me out, even if it was chewed by my own mouth. Sometimes it feels like a race to eat my meal before the ick sets in.",
      "created_utc": 1739260482.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mc7un98",
      "author": "LegendK4Y",
      "body": "MEEEE",
      "created_utc": 1739295781.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mca162f",
      "author": "goldfishmuncher",
      "body": "i've cried to my therapist about this before",
      "created_utc": 1739318125.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mcd57op",
      "author": "Primary-Count5497",
      "body": "This happens to me toooo its so baddd 😭",
      "created_utc": 1739368357.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mcgkgor",
      "author": "Meowzabubbers",
      "body": "Some days I just can't eat much, even my safe foods, and just have to listen to my body. As long as I'm still drinking fluids (and sometimes force myself to have a small protein shake to get *some* nutrients), I'm okay-ish.\n\nI get real upset sometimes when it's a food I actually enjoy but for whatever reason I can't eat it, but as someone else already said, ya can't force it or the safe food may no longer be safe anymore.",
      "created_utc": 1739403904.0,
      "score": 1,
      "context": []
    },
    {
      "id": "md7ls24",
      "author": "ccf1709",
      "body": "Even if food is safe and tastes good, I shut down and lose my appetite if I need to chew a lot. I feel like all the moisture leaves my mouth and that I won’t be able to fully swallow. Very stressful",
      "created_utc": 1739775040.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mc2y4wp",
      "author": "Acrobatic-Diet9180",
      "body": "if i force myself i will vomit and then safe food = ruined",
      "created_utc": 1739223971.0,
      "score": 6,
      "context": [
        {
          "id": "mbumhqc",
          "author": "Weary-Toast",
          "body": "This for sure happens to me. I force myself to finish the bite but am usually done eating when it happens.",
          "created_utc": 1739115528.0
        }
      ]
    },
    {
      "id": "mbvkbov",
      "author": "tittylamp",
      "body": "the highway to the danger bite",
      "created_utc": 1739125130.0,
      "score": 12,
      "context": [
        {
          "id": "mbusvpp",
          "author": "saltyandsmoky",
          "body": "I call it the Danger Bite",
          "created_utc": 1739117412.0
        }
      ]
    },
    {
      "id": "mbuucxu",
      "author": "BuildingOk6614",
      "body": "I like this lol using it",
      "created_utc": 1739117847.0,
      "score": 4,
      "context": [
        {
          "id": "mbusvpp",
          "author": "saltyandsmoky",
          "body": "I call it the Danger Bite",
          "created_utc": 1739117412.0
        }
      ]
    },
    {
      "id": "mc384o3",
      "author": "CommunistBarabbas",
      "body": "love that!! 😂",
      "created_utc": 1739228767.0,
      "score": 2,
      "context": [
        {
          "id": "mbusvpp",
          "author": "saltyandsmoky",
          "body": "I call it the Danger Bite",
          "created_utc": 1739117412.0
        }
      ]
    },
    {
      "id": "mhplkom",
      "author": "ThatGirlDidTheThing",
      "body": "I’m literally on a vacation, it’s 3:17am. I’m starving so bad I can’t sleep. I’m over here researching people’s arfid stories because I’m so overwhelmed and feel so defeated. I’m just trying to figure out how to eat so I can sleep. It has lowkey ruined my entire trip. I’m in the bathroom crying right now cause I just want this to be fine already. I read “danger bite” and started laughing through my tears. 🖤 Thank you because I’m so lonely about it and so sad. But this makes me realize I’m not alone… and also makes me laugh 😅",
      "created_utc": 1741936896.0,
      "score": 1,
      "context": [
        {
          "id": "mbusvpp",
          "author": "saltyandsmoky",
          "body": "I call it the Danger Bite",
          "created_utc": 1739117412.0
        }
      ]
    },
    {
      "id": "mbvxdtz",
      "author": "hero1107",
      "body": "I’m a vegetarian for this reason! I’m terrified of meat and the texture is the worst part, all types of meat. So it’s easier to stay away completely. I feel you!",
      "created_utc": 1739128761.0,
      "score": 10,
      "context": [
        {
          "id": "mbuvmgu",
          "author": "undercovercatman",
          "body": "This happens to me a lot, mainly with meat 😭 sometimes I’ll just hit a spot that doesn’t hit right or has a weird texture and suddenly I can’t eat any more of that part of my meal no matter how hungry I am, it’s sooo annoying",
          "created_utc": 1739118213.0
        }
      ]
    },
    {
      "id": "mbw0n75",
      "author": "theowlsbrain",
      "body": "This is one of the reasons I prefer overcooked meat sometimes, it just feels less weird T_T",
      "created_utc": 1739129666.0,
      "score": 7,
      "context": [
        {
          "id": "mbuvmgu",
          "author": "undercovercatman",
          "body": "This happens to me a lot, mainly with meat 😭 sometimes I’ll just hit a spot that doesn’t hit right or has a weird texture and suddenly I can’t eat any more of that part of my meal no matter how hungry I am, it’s sooo annoying",
          "created_utc": 1739118213.0
        }
      ]
    },
    {
      "id": "mebzqcv",
      "author": "handicrappi",
      "body": "For this reason my gf loves the vegetarian substitute meat I cook. Most of the taste comes from the seasoning (for the things we eat) and vegetarian meat is made from soy beans or other plant mush. It's a perfectly uniform texture with no bad surprises. This is not vegetarian propaganda lol just something that helped my gf add some foods to her rotation.",
      "created_utc": 1740314698.0,
      "score": 2,
      "context": [
        {
          "id": "mbuvmgu",
          "author": "undercovercatman",
          "body": "This happens to me a lot, mainly with meat 😭 sometimes I’ll just hit a spot that doesn’t hit right or has a weird texture and suddenly I can’t eat any more of that part of my meal no matter how hungry I am, it’s sooo annoying",
          "created_utc": 1739118213.0
        }
      ]
    },
    {
      "id": "mbuma3q",
      "author": "hero1107",
      "body": "Literally! I’ll tell myself “this is a food you like and eat all the time, it tastes the same and nothing is different” but suddenly my brain is just like “nah it’s weird get it out”. I wish you luck on your journey and I’m proud of you for trying carrots!",
      "created_utc": 1739115465.0,
      "score": 19,
      "context": [
        {
          "id": "mbulbgf",
          "author": "wfpinky",
          "body": "Omg this actually happened to me recently! I’m working with a nutritionist and we recently started easing into aversion therapy/exercises. I wanted to try carrots so we developed a plan to do so. I didn’t hate it (didn’t love it though) and my anxiety was relatively low considering the circumstances. So I considered it a win and planned on trying again to see if I did better the second time around. Yesterday I tried to eat the same carrots again and reminded my brain “hey we like this now so don’t freak out”.  So tell me why mid-chew my brain was like, “nope spit it out”…I’m annoyed. This shit is so frustrating.",
          "created_utc": 1739115174.0
        }
      ]
    },
    {
      "id": "mbvxks7",
      "author": "hero1107",
      "body": "Yes! It’s the texture first that bothers me then taste follows.",
      "created_utc": 1739128813.0,
      "score": 2,
      "context": [
        {
          "id": "mbvk80n",
          "author": "tittylamp",
          "body": "happens to me a lot. sometimes the textures just get really overwhelming and its a struggle to finish chewing and swallow",
          "created_utc": 1739125102.0
        }
      ]
    },
    {
      "id": "mc55rya",
      "author": "notmickiswear",
      "body": "You might be in the wrong Reddit my friend",
      "created_utc": 1739255227.0,
      "score": 1,
      "context": [
        {
          "id": "mbvtx5v",
          "author": "nietbeschikbaar",
          "body": "Never, whatever I’ve put on my plate I,ll finish even when I feel full.",
          "created_utc": 1739127797.0
        }
      ]
    },
    {
      "id": "mc8hj23",
      "author": "hero1107",
      "body": "Yesssss exactly",
      "created_utc": 1739302143.0,
      "score": 2,
      "context": [
        {
          "id": "mc5f3fm",
          "author": "Lil-Miss-Anthropy",
          "body": "Yeah kinda. The texture of chewed up food grosses me out, even if it was chewed by my own mouth. Sometimes it feels like a race to eat my meal before the ick sets in.",
          "created_utc": 1739260482.0
        }
      ]
    },
    {
      "id": "mc5olgq",
      "author": "Weary-Toast",
      "body": "I get that. For me if I get the urge to spit out the food it’s already gone lol. These are the foods I’ll work with my nutritionist to work on adding back in.",
      "created_utc": 1739266439.0,
      "score": 1,
      "context": [
        {
          "id": "mbumhqc",
          "author": "Weary-Toast",
          "body": "This for sure happens to me. I force myself to finish the bite but am usually done eating when it happens.",
          "created_utc": 1739115528.0
        },
        {
          "id": "mc2y4wp",
          "author": "Acrobatic-Diet9180",
          "body": "if i force myself i will vomit and then safe food = ruined",
          "created_utc": 1739223971.0
        }
      ]
    },
    {
      "id": "mbwzurq",
      "author": "hero1107",
      "body": "Yes this too! When I did eat meat it had to be so overcooked and dry or I wouldn’t want it.",
      "created_utc": 1739139916.0,
      "score": 6,
      "context": [
        {
          "id": "mbuvmgu",
          "author": "undercovercatman",
          "body": "This happens to me a lot, mainly with meat 😭 sometimes I’ll just hit a spot that doesn’t hit right or has a weird texture and suddenly I can’t eat any more of that part of my meal no matter how hungry I am, it’s sooo annoying",
          "created_utc": 1739118213.0
        },
        {
          "id": "mbw0n75",
          "author": "theowlsbrain",
          "body": "This is one of the reasons I prefer overcooked meat sometimes, it just feels less weird T_T",
          "created_utc": 1739129666.0
        }
      ]
    },
    {
      "id": "mc5zfos",
      "author": "nietbeschikbaar",
      "body": "I can assure you that I’m not. I know my safe foods, why would I wast them.",
      "created_utc": 1739272916.0,
      "score": 1,
      "context": [
        {
          "id": "mbvtx5v",
          "author": "nietbeschikbaar",
          "body": "Never, whatever I’ve put on my plate I,ll finish even when I feel full.",
          "created_utc": 1739127797.0
        },
        {
          "id": "mc55rya",
          "author": "notmickiswear",
          "body": "You might be in the wrong Reddit my friend",
          "created_utc": 1739255227.0
        }
      ]
    },
    {
      "id": "mc76mwy",
      "author": "notmickiswear",
      "body": "People with ARFID aren’t “wasting” food on purpose.",
      "created_utc": 1739288981.0,
      "score": 1,
      "context": [
        {
          "id": "mbvtx5v",
          "author": "nietbeschikbaar",
          "body": "Never, whatever I’ve put on my plate I,ll finish even when I feel full.",
          "created_utc": 1739127797.0
        },
        {
          "id": "mc55rya",
          "author": "notmickiswear",
          "body": "You might be in the wrong Reddit my friend",
          "created_utc": 1739255227.0
        },
        {
          "id": "mc5zfos",
          "author": "nietbeschikbaar",
          "body": "I can assure you that I’m not. I know my safe foods, why would I wast them.",
          "created_utc": 1739272916.0
        }
      ]
    }
  ]
}