{
  "id": "1isr56c",
  "subreddit": "ARFID",
  "author": "Buzzythebear33",
  "created_utc": 1739922675.0,
  "title": "Just had to explain to a doctor what arfid was",
  "selftext": "Title says it all. I had to explain to my neurologist what arfid was bc she had never heard of it before.\nI wish more people understood it, and how I’m not just being fussy, I genuinely can’t eat. ",
  "url": "https://www.reddit.com/r/ARFID/comments/1isr56c/just_had_to_explain_to_a_doctor_what_arfid_was/",
  "score": 131,
  "num_comments": 20,
  "comments": [
    {
      "id": "mdj6ldv",
      "author": "MaleficentSwan0223",
      "body": "I’ve never met a doctor that’s heard of it but luckily the last doctor I had was happy to Google it and was willing to listen to how it affected me. Like you, I wish there was just some awareness. ",
      "created_utc": 1739926324.0,
      "score": 62,
      "context": []
    },
    {
      "id": "mdiyjdt",
      "author": "Ready-Outside-3491",
      "body": "Ugh. I feel your pain. If it’s any sentiment, she specialized in a different field, so I wouldn’t expect it to be known. Heck, I don’t know how many people have told me it’s made up.. 🙄",
      "created_utc": 1739923767.0,
      "score": 14,
      "context": []
    },
    {
      "id": "mdja2ne",
      "author": "Extra-Region-2414",
      "body": "My sons ped had never heard of it and basically dismissed it and prescribed him an antidepressant.",
      "created_utc": 1739927454.0,
      "score": 13,
      "context": []
    },
    {
      "id": "mdj7d7c",
      "author": "Busy_Nothing4060",
      "body": "my gp googled arfid questionarre in front of me and had me answer the questions and that’s how i was professionally diagnosed (if a gp even counts) \n\ni’ve known i have it for a long time though and don’t really care, mostly just thought it was funny in a horrified at the medical system way\n\nit is a great counterpoint for people who argue against self suspecting/diagnosing",
      "created_utc": 1739926574.0,
      "score": 16,
      "context": []
    },
    {
      "id": "mdkeyhg",
      "author": "Neocactus",
      "body": "This is part of the reason I haven't been to a doctor in a long long while (maybe like 12yrs or so now)",
      "created_utc": 1739942364.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mdlcmhx",
      "author": "Jen__44",
      "body": "I mean its a relatively recent diagnosis so thats not surprising really, plus not exactly something theyre gonna specialise in",
      "created_utc": 1739961160.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mdjwdci",
      "author": "R0da",
      "body": "Hopefully they have a new tool in their toolbelt?",
      "created_utc": 1739934975.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mdk627b",
      "author": "Neroli23",
      "body": "I had to tell my therapist about it",
      "created_utc": 1739938603.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mdk8n53",
      "author": "Hanhula",
      "body": "I've explained it to a few doctors, but the best discussion I had was with my dermatologist. They'd had an inpatient with ARFID and the hospital had been educated on ARFID due to them, so when he found out I had it, we had a really good conversation. Apparently most folk hadn't heard of it in the medical community until the past few years, but knowledge has been rapidly spreading in the last 2 years in Australia. We're also seeing more mainstream news articles.\n\nI'm really hopeful that with more activism and more prevalent knowledge, our struggles become more well known and we start to see progress in treatment!",
      "created_utc": 1739939642.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mdlzv4a",
      "author": "angelneliel",
      "body": "My current doctor was hesitant to let me be weighed (I don't own a scale, useless purchase I find) and I had to explain that my eating disorder had nothing to do with body image issues. Glad he was sensitive about it though for others with body related EDs.",
      "created_utc": 1739971912.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mdm6jfb",
      "author": "zootzootzootzootzoo",
      "body": "My psychiatrist immediately said I wasn’t skinny enough to have arfid. I haven’t brought it up again.",
      "created_utc": 1739974224.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mdnhtob",
      "author": "theowlsbrain",
      "body": "It's in my psych file as \"thinks they may have an atypical eating disorder\" literally nobody I've asked in the field knows anything about it around where I live at least.",
      "created_utc": 1739987740.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mdpv4f6",
      "author": "power36113",
      "body": "I went to the gastroenterologist recently and when I said I had ARFID, I was fully prepared to explain it but much to my amazement, they knew what it was! As they should, being that it is almost entirely gastro-related.",
      "created_utc": 1740011611.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mdqkqx9",
      "author": "pippinclogs5817",
      "body": "I’m a dietitian (specializing in neuro-affirming care) and I once had to explain ARFID to another dietitian! Which just baffled me at the time. Its unfortunate but pretty common for medical professionals to not know of it or to have wild preconceived ideas of how it presents and treatment",
      "created_utc": 1740020215.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mdu7j21",
      "author": "Maleficent-Poem-751",
      "body": "I’ve had to explain it to my therapist.\nMy THERAPIST 😭",
      "created_utc": 1740073760.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mdxdkup",
      "author": "r0ckchalk",
      "body": "None of my doctors have ever heard of it, but god bless the nutritionist I’m seeing!! She was younger, which I suspect is why she was familiar with it. She’s the one who educated *me* on it!! It’s the first time I have ever spoken about ARFID to another human being who a)knew what I was talking about and b) knew how to treat it! I can’t tell you how happy that made me.",
      "created_utc": 1740108598.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mdj6qp3",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1739926371.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mdn3f04",
      "author": "katie1010101",
      "body": "Same, until I went to my eye doctor recently. Apparently your blood sugar can *affect your vision, and my glasses prescription was changing pretty significantly. After some talking to him, he told blood sugar can change your prescription. I said “oh that makes sense, I’d been really struggling to eat, previously” and he immediately asked if I had ARFID. I was shocked that he just immediately knew what I meant. This was also shortly before I got married (and I’m a 30 yo woman), so a lot people just assumed I was trying to get thin for the wedding and went overboard. Not this guy, he knew 🙌\n\nI cried in my car after the appointment because it was just such a relief to be seen (pun intended). I didn’t even know my eyesight was being affected by my ARFID. I don’t know why I’m rambling. Just wanted to share a positive story and some info!\n\nEdit: fixing typos. It was a late night, my brain is drained!",
      "created_utc": 1739983872.0,
      "score": 8,
      "context": [
        {
          "id": "mdj6ldv",
          "author": "MaleficentSwan0223",
          "body": "I’ve never met a doctor that’s heard of it but luckily the last doctor I had was happy to Google it and was willing to listen to how it affected me. Like you, I wish there was just some awareness. ",
          "created_utc": 1739926324.0
        }
      ]
    },
    {
      "id": "mdl9t3w",
      "author": "bewarethelemurs",
      "body": "My psychiatrist literally opened the dsm-v in front of me when I brought it up to him, and we went over the diagnostic criteria one by one because he wasn’t familiar with it, so can relate",
      "created_utc": 1739959494.0,
      "score": 7,
      "context": [
        {
          "id": "mdj7d7c",
          "author": "Busy_Nothing4060",
          "body": "my gp googled arfid questionarre in front of me and had me answer the questions and that’s how i was professionally diagnosed (if a gp even counts) \n\ni’ve known i have it for a long time though and don’t really care, mostly just thought it was funny in a horrified at the medical system way\n\nit is a great counterpoint for people who argue against self suspecting/diagnosing",
          "created_utc": 1739926574.0
        }
      ]
    },
    {
      "id": "mdnie86",
      "author": "theowlsbrain",
      "body": "My psychiatrist didn't even Google it when I brought it up T_T it's just noted as \"patient thinks they have an atypical eating disorder\" in my file. I had acces to a psychiatrist and many other diagnoses. But a lot of us genuinely don't have any acces to being formally diagnosed with arfid.",
      "created_utc": 1739987890.0,
      "score": 4,
      "context": [
        {
          "id": "mdj7d7c",
          "author": "Busy_Nothing4060",
          "body": "my gp googled arfid questionarre in front of me and had me answer the questions and that’s how i was professionally diagnosed (if a gp even counts) \n\ni’ve known i have it for a long time though and don’t really care, mostly just thought it was funny in a horrified at the medical system way\n\nit is a great counterpoint for people who argue against self suspecting/diagnosing",
          "created_utc": 1739926574.0
        }
      ]
    },
    {
      "id": "mdpogka",
      "author": "TheCrazyOutcast",
      "body": "ARFID is a newish disorder so if anyone became a doctor before 2012-2013 then they most likely would never have heard or studied it before.",
      "created_utc": 1740009499.0,
      "score": 3,
      "context": [
        {
          "id": "mdj6qp3",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1739926371.0
        }
      ]
    }
  ]
}