{
  "id": "1itdac9",
  "subreddit": "ARFID",
  "author": "Fizzabl",
  "created_utc": 1739991198.0,
  "title": "My parents cured ARFID everybody",
  "selftext": "I still live with my parents as an adult and on the very rare occasion we have the same meal, of course we still don't. They bulk up their plates with four or five piles of different veg while I'm left with just the meat and potato.\n\nAnd yet I'm the one called greedy when I'm still hungry afterwards? \"Well if you just ate what we ate\"\n\nWOW. HOW DIDN'T I THINK OF THAT? THANK YOU SO MUCH!\n\nI'm so sick of other people's opinions I just wish I could live on my own and do it myself.",
  "url": "https://www.reddit.com/r/ARFID/comments/1itdac9/my_parents_cured_arfid_everybody/",
  "score": 297,
  "num_comments": 35,
  "comments": [
    {
      "id": "mdnwb1e",
      "author": "Greedy_Carrot3748",
      "body": "Here I am reading this thinking you had the cure",
      "created_utc": 1739991614.0,
      "score": 249,
      "context": []
    },
    {
      "id": "mdnxmvl",
      "author": "Desert_Fairy",
      "body": "Yeah, family is probably the worst part of ARFID. If you are lucky you get a parent who sees that you are trying and works with you. \n\nIf not, they are the biggest bullies you will ever encounter and you have to be around them for 2 out of 3 meals every day. \n\nThis is how most of us develop social anxiety.",
      "created_utc": 1739991972.0,
      "score": 89,
      "context": []
    },
    {
      "id": "mdo0drd",
      "author": "runnawaycucumber",
      "body": "My family is the reason why I have so many triggers and why both my psychiatrist and therapist have directly told me that I'm basically fucked lmao. Abuse comes in many forms and food based abuse is unfortunately common. Your parents suck and they should stfu (respectfully). I used to hoard jars of peanut butter that I'd hide in tampon boxes in my bathroom and would eat it by the spoonful when things got rough with my parents, do you have a similar thing you could do?",
      "created_utc": 1739992711.0,
      "score": 37,
      "context": []
    },
    {
      "id": "mdrk2t1",
      "author": "None",
      "body": "I'm a parent of a kid with ARFID, I'd definitely never call her greedy! That would be the last thing I'd think. \n\nI'm trying to get tips from this community, so far my approach is basically to stock up on the things she does eat and let her eat them whenever she wants, invite her for dinner but don't expect her to come or eat, even if I serve her a separate meal of things she does like. \n\nAny other tips?!",
      "created_utc": 1740035469.0,
      "score": 13,
      "context": []
    },
    {
      "id": "mdo5ily",
      "author": "Slow_Saboteur",
      "body": "I am twice your age and my family is like \"why won't you eat with us?\"\n\nNope.",
      "created_utc": 1739994087.0,
      "score": 18,
      "context": []
    },
    {
      "id": "mdpa7qb",
      "author": "donkiluminate",
      "body": "As a parent of a kiddo with ARFID, I’m sorry.    This type of stuff makes me so angry.  It took years of dr appointments and multiple second, third, fourth, etc opinions.  \n\nSeveral years later I still get visceral reactions reactions when I think of junior’s pediatrician flippantly saying “He’ll eat when he gets hungry.   Kids are only picky these days because parents give them access to anything they want”. Guess what doc!  He doesn’t eat when he’s hungry!  I’m sorry your cancer didn’t stop after your amputation.  \n\nNo, I’m not harboring any bitterness.",
      "created_utc": 1740005101.0,
      "score": 21,
      "context": []
    },
    {
      "id": "mdoana4",
      "author": "kidfromdc",
      "body": "My parents are pretty good about helping and making sure I have safe foods, whether they make it part of the rest of the family dinner or I need to make something else. Extended family on the other hand????? Yeah no. Had dinner with them one night and only ate a single baked potato with butter and salt. Spent the night there and was miserable and starving",
      "created_utc": 1739995456.0,
      "score": 6,
      "context": []
    },
    {
      "id": "mdord10",
      "author": "hotaru-chan45",
      "body": "Yeah a lot of my safe foods aren’t great for me so it’s not ideal for my health. Get told to change my diet and I look at them like, wow. So easy! Thank you. Not like I’d have to waste a ton of money trying a bunch of new and healthy food or anything just to see if I can tolerate any of it. 🙄 \n\nIncredibly frustrating. I wish I could eat “normally” but the reality is that I can’t.",
      "created_utc": 1739999903.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mdqcadm",
      "author": "sliverofmasc",
      "body": "I came in thinking they said \"just eat it\". \n\nMy mum will offer me things she's cooked, and sometimes I jump at it (her potato pie 😩🙏) but other times I'm like \"mmm no thanks...\"\n\nMeanwhile, me and my eldest are eating my albeit very poor attempts at home made karaage chicken tenders, but he's Lovin' It :tm: so we're winning. 🤷\n\nAlso my youngest will only eat \"real chicken\" (nuggies or chilli chicken strips) and I mean.... both chickens are good.",
      "created_utc": 1740017278.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mdpi05n",
      "author": "RamblingRose63",
      "body": "Let them know it's actually alot more strange to force someone to do something they don't want to masked behind the words it's good for you than it is for you to have an eating issue",
      "created_utc": 1740007450.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mdsrfyy",
      "author": "SimplyMermaid88",
      "body": "My SIL literally hates my guts because I have ARFID.",
      "created_utc": 1740058320.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mdsvbkm",
      "author": "Nooshy1978",
      "body": "I Facebook follow a young kid with ARFID and you wouldn't believe what people say to a child, it's abusive. I'm so sorry about your parents.",
      "created_utc": 1740059702.0,
      "score": 1,
      "context": []
    },
    {
      "id": "me827fv",
      "author": "Ready-Ad-5660",
      "body": "The only time I can ‘consume’ peas is by putting them in bread sauce during a roast and swallowing the whole thing so I don’t taste them 🤢",
      "created_utc": 1740255546.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mdrdx4b",
      "author": "Langrisser_John",
      "body": "You talk like that but try being on the other side of the fence raising you your entire life having to be a short order chef because you don't (can't) (but from their perspective \"won't\") eat what everyone else is, or at least enough of it to be sated. It's hard as fuck for both of you. Have some damn empathy for them too. If they won't work it out and talk it out or goto therapy over your condition, that's also understandable because it is so rare of a condition most normies will think it's unicorn farts and pixie dust, but you know it's real for you and enough people that it's globally recognized since 2013 as it's own disorder apart from sensory issues with food.",
      "created_utc": 1740032178.0,
      "score": 0,
      "context": []
    },
    {
      "id": "mdz17z1",
      "author": "Kelamar13",
      "body": "This is why my kids DONT have arfid. I’m 100% certain that if you’re not forced to eat things you don’t like, and don’t have any issues regarding 🤢, you won’t develop it in the first place. My arfid came from poor parenting concerning food, and emetophobia.",
      "created_utc": 1740138170.0,
      "score": -1,
      "context": []
    },
    {
      "id": "mdodqta",
      "author": "Fizzabl",
      "body": "Very sorry 😂 you can always try my dad's other method \"just pinch your nose and you won't taste it\"",
      "created_utc": 1739996285.0,
      "score": 106,
      "context": [
        {
          "id": "mdnwb1e",
          "author": "Greedy_Carrot3748",
          "body": "Here I am reading this thinking you had the cure",
          "created_utc": 1739991614.0
        }
      ]
    },
    {
      "id": "mdp23xe",
      "author": "boytoy421",
      "body": "God what i wouldn't give for like a pill to make it go away. I just want to be able to eat a fuckin salad yo",
      "created_utc": 1740002798.0,
      "score": 25,
      "context": [
        {
          "id": "mdnwb1e",
          "author": "Greedy_Carrot3748",
          "body": "Here I am reading this thinking you had the cure",
          "created_utc": 1739991614.0
        }
      ]
    },
    {
      "id": "mdo0xzg",
      "author": "LexRex12",
      "body": "This is exactly my experience like I probably would not be that bothered by my ARFID if I didn’t have to deal with the parents bulling",
      "created_utc": 1739992862.0,
      "score": 14,
      "context": [
        {
          "id": "mdnxmvl",
          "author": "Desert_Fairy",
          "body": "Yeah, family is probably the worst part of ARFID. If you are lucky you get a parent who sees that you are trying and works with you. \n\nIf not, they are the biggest bullies you will ever encounter and you have to be around them for 2 out of 3 meals every day. \n\nThis is how most of us develop social anxiety.",
          "created_utc": 1739991972.0
        }
      ]
    },
    {
      "id": "mdvoob2",
      "author": "thicketcosplay",
      "body": "I am lucky because my mother, who I still live with, mostly understands. We both just make our own food now and never eat together except for special occasions, where we still make different dishes as part of the meal. We've come to an understanding and it works. \n\nHowever, when I was a kid, we used to go visit family in Europe at least once a year because my parents wanted me to know my grandparents and cousins. THEY were the worst. I have realized I have some form of PTSD from having to eat around them. \n\nI visited for the first time in nearly a decade, and my mental health just crashed from having to eat around them. I was carrying around a backpack of snacks with me everywhere I went because I was so scared of having to rely on them for my food. I was 27 and fully capable of caring for myself, it just terrified me to the point of making me act like a child again. \n\nMy grandparents are long gone but they were the worst when I eS a kid, as they survived WW2 and had their own issues with food and food waste that clashed with my ARFID. I think my family members who still lived around them into their later years picked up on that and it distorted their views of food as well. My mom tried hard to explain ARFID to all of them, but I don't think it ever fully stuck.",
      "created_utc": 1740088370.0,
      "score": 3,
      "context": [
        {
          "id": "mdnxmvl",
          "author": "Desert_Fairy",
          "body": "Yeah, family is probably the worst part of ARFID. If you are lucky you get a parent who sees that you are trying and works with you. \n\nIf not, they are the biggest bullies you will ever encounter and you have to be around them for 2 out of 3 meals every day. \n\nThis is how most of us develop social anxiety.",
          "created_utc": 1739991972.0
        }
      ]
    },
    {
      "id": "mdtsnmg",
      "author": "QueenSlothie",
      "body": "I suggest easing new foods into her plate without being forceful and without judgement. Just say \"hey can I make you a side of a couple small bits of what I'm eating? You don't need to try it at all! Just play with it.\" \n\nGetting comfortable around food was a huge help for me to try new things. It starts with letting me touch it and tear it apart with my fingers, that kinda stuff. Then to smell, then to pressing it to the lips, then, finally, when ready and enough exposure has happened, maybe put a tiny tiny nibble in the mouth. \n\nI think it's a very harmful rhetoric we've learned \"don't play with your food\" when we, as a species, probably learned to play with food for natural selection and it's how we learn is through our senses. \n\nI think its definitely helpful to just simply make sure she eats in general, and my mother did the same and Im so grateful because my dad was not like this so it made my mom's house my safe haven with my eating. However, there is an extent where this can become enabling if you dont try to introduce new foods or textures to their plate. Not to say they have to try things, never, just to expose them to new things will help mediate the fear of food over time. At first it will be extremely challenging, and it doesn't even have to happen every meal just once in a while. Maybe ask her \"what is something we can work toward you trying?\" And see what she says. For me, I want to be able to take a full bite of steak which is a trigger food for me. Then just allow them to take it in their own time. Allow them to just let it sit on their plate, even if they don't touch it, it can be helpful just to even see it's there. Over time, at least for me, i began to expose myself further. \n\nI also began to be more comfortable with food in my relationship since he is not judgemental and is super supportive in me simply wanting to try something. He'll never ask me, I offer and say \"I want to try this if you get it, is that okay?\" But that took me a very long time to get there.",
      "created_utc": 1740069664.0,
      "score": 7,
      "context": [
        {
          "id": "mdrk2t1",
          "author": "None",
          "body": "I'm a parent of a kid with ARFID, I'd definitely never call her greedy! That would be the last thing I'd think. \n\nI'm trying to get tips from this community, so far my approach is basically to stock up on the things she does eat and let her eat them whenever she wants, invite her for dinner but don't expect her to come or eat, even if I serve her a separate meal of things she does like. \n\nAny other tips?!",
          "created_utc": 1740035469.0
        }
      ]
    },
    {
      "id": "mdyq7q8",
      "author": "jbreezy30",
      "body": "I’m so sorry you have to deal with this 😔",
      "created_utc": 1740132031.0,
      "score": 1,
      "context": [
        {
          "id": "mdsrfyy",
          "author": "SimplyMermaid88",
          "body": "My SIL literally hates my guts because I have ARFID.",
          "created_utc": 1740058320.0
        }
      ]
    },
    {
      "id": "mdt7hn4",
      "author": "Fizzabl",
      "body": "I used to get recommended a couple and one child (it was vids of the parent making their lunchbox) just had the comments going \"HE ATE THE CHEESE! HE ATE THE GRAPES!\" and the other was your experience, absolutely horrible things!!",
      "created_utc": 1740063634.0,
      "score": 3,
      "context": [
        {
          "id": "mdsvbkm",
          "author": "Nooshy1978",
          "body": "I Facebook follow a young kid with ARFID and you wouldn't believe what people say to a child, it's abusive. I'm so sorry about your parents.",
          "created_utc": 1740059702.0
        }
      ]
    },
    {
      "id": "mdp1zhk",
      "author": "SprintsAC",
      "body": "Your Dad has a weird viewpoint on food in general if that's a trick he actually uses. 😅",
      "created_utc": 1740002764.0,
      "score": 33,
      "context": [
        {
          "id": "mdnwb1e",
          "author": "Greedy_Carrot3748",
          "body": "Here I am reading this thinking you had the cure",
          "created_utc": 1739991614.0
        },
        {
          "id": "mdodqta",
          "author": "Fizzabl",
          "body": "Very sorry 😂 you can always try my dad's other method \"just pinch your nose and you won't taste it\"",
          "created_utc": 1739996285.0
        }
      ]
    },
    {
      "id": "mdqchjp",
      "author": "sliverofmasc",
      "body": "That was the worst because 90% of the time for me, it was the texture. 😭\n\nNow I swallow some food with water and just... don't taste it on purpose??",
      "created_utc": 1740017345.0,
      "score": 22,
      "context": [
        {
          "id": "mdnwb1e",
          "author": "Greedy_Carrot3748",
          "body": "Here I am reading this thinking you had the cure",
          "created_utc": 1739991614.0
        },
        {
          "id": "mdodqta",
          "author": "Fizzabl",
          "body": "Very sorry 😂 you can always try my dad's other method \"just pinch your nose and you won't taste it\"",
          "created_utc": 1739996285.0
        }
      ]
    },
    {
      "id": "mdz9q0w",
      "author": "Lil-Miss-Anthropy",
      "body": "Darn it, my biggest problem is textures",
      "created_utc": 1740141986.0,
      "score": 2,
      "context": [
        {
          "id": "mdnwb1e",
          "author": "Greedy_Carrot3748",
          "body": "Here I am reading this thinking you had the cure",
          "created_utc": 1739991614.0
        },
        {
          "id": "mdodqta",
          "author": "Fizzabl",
          "body": "Very sorry 😂 you can always try my dad's other method \"just pinch your nose and you won't taste it\"",
          "created_utc": 1739996285.0
        }
      ]
    },
    {
      "id": "mdvf26y",
      "author": "None",
      "body": "Thanks, that's helpful",
      "created_utc": 1740085678.0,
      "score": 2,
      "context": [
        {
          "id": "mdrk2t1",
          "author": "None",
          "body": "I'm a parent of a kid with ARFID, I'd definitely never call her greedy! That would be the last thing I'd think. \n\nI'm trying to get tips from this community, so far my approach is basically to stock up on the things she does eat and let her eat them whenever she wants, invite her for dinner but don't expect her to come or eat, even if I serve her a separate meal of things she does like. \n\nAny other tips?!",
          "created_utc": 1740035469.0
        },
        {
          "id": "mdtsnmg",
          "author": "QueenSlothie",
          "body": "I suggest easing new foods into her plate without being forceful and without judgement. Just say \"hey can I make you a side of a couple small bits of what I'm eating? You don't need to try it at all! Just play with it.\" \n\nGetting comfortable around food was a huge help for me to try new things. It starts with letting me touch it and tear it apart with my fingers, that kinda stuff. Then to smell, then to pressing it to the lips, then, finally, when ready and enough exposure has happened, maybe put a tiny tiny nibble in the mouth. \n\nI think it's a very harmful rhetoric we've learned \"don't play with your food\" when we, as a species, probably learned to play with food for natural selection and it's how we learn is through our senses. \n\nI think its definitely helpful to just simply make sure she eats in general, and my mother did the same and Im so grateful because my dad was not like this so it made my mom's house my safe haven with my eating. However, there is an extent where this can become enabling if you dont try to introduce new foods or textures to their plate. Not to say they have to try things, never, just to expose them to new things will help mediate the fear of food over time. At first it will be extremely challenging, and it doesn't even have to happen every meal just once in a while. Maybe ask her \"what is something we can work toward you trying?\" And see what she says. For me, I want to be able to take a full bite of steak which is a trigger food for me. Then just allow them to take it in their own time. Allow them to just let it sit on their plate, even if they don't touch it, it can be helpful just to even see it's there. Over time, at least for me, i began to expose myself further. \n\nI also began to be more comfortable with food in my relationship since he is not judgemental and is super supportive in me simply wanting to try something. He'll never ask me, I offer and say \"I want to try this if you get it, is that okay?\" But that took me a very long time to get there.",
          "created_utc": 1740069664.0
        }
      ]
    },
    {
      "id": "mf0c25q",
      "author": "SimplyMermaid88",
      "body": "Thank you for your kind words.",
      "created_utc": 1740626020.0,
      "score": 1,
      "context": [
        {
          "id": "mdsrfyy",
          "author": "SimplyMermaid88",
          "body": "My SIL literally hates my guts because I have ARFID.",
          "created_utc": 1740058320.0
        },
        {
          "id": "mdyq7q8",
          "author": "jbreezy30",
          "body": "I’m so sorry you have to deal with this 😔",
          "created_utc": 1740132031.0
        }
      ]
    },
    {
      "id": "me28p0u",
      "author": "Eve-7260",
      "body": "i use this trick haha",
      "created_utc": 1740173788.0,
      "score": 1,
      "context": [
        {
          "id": "mdnwb1e",
          "author": "Greedy_Carrot3748",
          "body": "Here I am reading this thinking you had the cure",
          "created_utc": 1739991614.0
        },
        {
          "id": "mdodqta",
          "author": "Fizzabl",
          "body": "Very sorry 😂 you can always try my dad's other method \"just pinch your nose and you won't taste it\"",
          "created_utc": 1739996285.0
        },
        {
          "id": "mdp1zhk",
          "author": "SprintsAC",
          "body": "Your Dad has a weird viewpoint on food in general if that's a trick he actually uses. 😅",
          "created_utc": 1740002764.0
        }
      ]
    },
    {
      "id": "mds9629",
      "author": "luteyla",
      "body": "But different textures can be obtained with the same ingredients. If you like smooth you blend it. If you like crunchy, you deep fry. I'm sorry if I'm being inconsiderate. Just trying to understand.",
      "created_utc": 1740050327.0,
      "score": 0,
      "context": [
        {
          "id": "mdnwb1e",
          "author": "Greedy_Carrot3748",
          "body": "Here I am reading this thinking you had the cure",
          "created_utc": 1739991614.0
        },
        {
          "id": "mdodqta",
          "author": "Fizzabl",
          "body": "Very sorry 😂 you can always try my dad's other method \"just pinch your nose and you won't taste it\"",
          "created_utc": 1739996285.0
        },
        {
          "id": "mdqchjp",
          "author": "sliverofmasc",
          "body": "That was the worst because 90% of the time for me, it was the texture. 😭\n\nNow I swallow some food with water and just... don't taste it on purpose??",
          "created_utc": 1740017345.0
        }
      ]
    },
    {
      "id": "me28w4k",
      "author": "SprintsAC",
      "body": "Does it actually work? I've never tried to & curious.\n\nMy ARFID isn't exactly sensory related, but a different subform.",
      "created_utc": 1740173844.0,
      "score": 1,
      "context": [
        {
          "id": "mdnwb1e",
          "author": "Greedy_Carrot3748",
          "body": "Here I am reading this thinking you had the cure",
          "created_utc": 1739991614.0
        },
        {
          "id": "mdodqta",
          "author": "Fizzabl",
          "body": "Very sorry 😂 you can always try my dad's other method \"just pinch your nose and you won't taste it\"",
          "created_utc": 1739996285.0
        },
        {
          "id": "mdp1zhk",
          "author": "SprintsAC",
          "body": "Your Dad has a weird viewpoint on food in general if that's a trick he actually uses. 😅",
          "created_utc": 1740002764.0
        },
        {
          "id": "me28p0u",
          "author": "Eve-7260",
          "body": "i use this trick haha",
          "created_utc": 1740173788.0
        }
      ]
    },
    {
      "id": "mduc9n3",
      "author": "___disaster___",
      "body": "different things have different texture when blended. with crunchiness it is. even more silly. below this type of crunch things have  v a s t l y  different textures. some things can't be deep fried to achieve this. what are you trying to \"understand\" by this comment? bc that's a thing that i can't understand",
      "created_utc": 1740075033.0,
      "score": 6,
      "context": [
        {
          "id": "mdnwb1e",
          "author": "Greedy_Carrot3748",
          "body": "Here I am reading this thinking you had the cure",
          "created_utc": 1739991614.0
        },
        {
          "id": "mdodqta",
          "author": "Fizzabl",
          "body": "Very sorry 😂 you can always try my dad's other method \"just pinch your nose and you won't taste it\"",
          "created_utc": 1739996285.0
        },
        {
          "id": "mdqchjp",
          "author": "sliverofmasc",
          "body": "That was the worst because 90% of the time for me, it was the texture. 😭\n\nNow I swallow some food with water and just... don't taste it on purpose??",
          "created_utc": 1740017345.0
        },
        {
          "id": "mds9629",
          "author": "luteyla",
          "body": "But different textures can be obtained with the same ingredients. If you like smooth you blend it. If you like crunchy, you deep fry. I'm sorry if I'm being inconsiderate. Just trying to understand.",
          "created_utc": 1740050327.0
        }
      ]
    },
    {
      "id": "mdx6i4d",
      "author": "r0ckchalk",
      "body": "Found OPs dad 😂",
      "created_utc": 1740106213.0,
      "score": 4,
      "context": [
        {
          "id": "mdnwb1e",
          "author": "Greedy_Carrot3748",
          "body": "Here I am reading this thinking you had the cure",
          "created_utc": 1739991614.0
        },
        {
          "id": "mdodqta",
          "author": "Fizzabl",
          "body": "Very sorry 😂 you can always try my dad's other method \"just pinch your nose and you won't taste it\"",
          "created_utc": 1739996285.0
        },
        {
          "id": "mdqchjp",
          "author": "sliverofmasc",
          "body": "That was the worst because 90% of the time for me, it was the texture. 😭\n\nNow I swallow some food with water and just... don't taste it on purpose??",
          "created_utc": 1740017345.0
        },
        {
          "id": "mds9629",
          "author": "luteyla",
          "body": "But different textures can be obtained with the same ingredients. If you like smooth you blend it. If you like crunchy, you deep fry. I'm sorry if I'm being inconsiderate. Just trying to understand.",
          "created_utc": 1740050327.0
        }
      ]
    },
    {
      "id": "me29qx6",
      "author": "Eve-7260",
      "body": "heck yeah!! i took a psych/bio course that explained the reason behind this lol. our smell and taste sensory are connected!\n\nyou should try it with a food you already like!! just try not to smell it at all before.\n\ni have multiple subtypes and use this trick aggressively. arfid lifesaver!! just try not to get caught doing it lol",
      "created_utc": 1740174087.0,
      "score": 1,
      "context": [
        {
          "id": "mdnwb1e",
          "author": "Greedy_Carrot3748",
          "body": "Here I am reading this thinking you had the cure",
          "created_utc": 1739991614.0
        },
        {
          "id": "mdodqta",
          "author": "Fizzabl",
          "body": "Very sorry 😂 you can always try my dad's other method \"just pinch your nose and you won't taste it\"",
          "created_utc": 1739996285.0
        },
        {
          "id": "mdp1zhk",
          "author": "SprintsAC",
          "body": "Your Dad has a weird viewpoint on food in general if that's a trick he actually uses. 😅",
          "created_utc": 1740002764.0
        },
        {
          "id": "me28p0u",
          "author": "Eve-7260",
          "body": "i use this trick haha",
          "created_utc": 1740173788.0
        },
        {
          "id": "me28w4k",
          "author": "SprintsAC",
          "body": "Does it actually work? I've never tried to & curious.\n\nMy ARFID isn't exactly sensory related, but a different subform.",
          "created_utc": 1740173844.0
        }
      ]
    },
    {
      "id": "mdukps1",
      "author": "luteyla",
      "body": "my daughter wouldn't eat lentil soup because of texture but if I puree, she likes it. green beans are impossible but if I roast them in the oven with panko crumbs and parmesan, she likes them crunchy. of course i can't make the same for everything. but when  it works, i am very happy.",
      "created_utc": 1740077317.0,
      "score": 2,
      "context": [
        {
          "id": "mdnwb1e",
          "author": "Greedy_Carrot3748",
          "body": "Here I am reading this thinking you had the cure",
          "created_utc": 1739991614.0
        },
        {
          "id": "mdodqta",
          "author": "Fizzabl",
          "body": "Very sorry 😂 you can always try my dad's other method \"just pinch your nose and you won't taste it\"",
          "created_utc": 1739996285.0
        },
        {
          "id": "mdqchjp",
          "author": "sliverofmasc",
          "body": "That was the worst because 90% of the time for me, it was the texture. 😭\n\nNow I swallow some food with water and just... don't taste it on purpose??",
          "created_utc": 1740017345.0
        },
        {
          "id": "mds9629",
          "author": "luteyla",
          "body": "But different textures can be obtained with the same ingredients. If you like smooth you blend it. If you like crunchy, you deep fry. I'm sorry if I'm being inconsiderate. Just trying to understand.",
          "created_utc": 1740050327.0
        },
        {
          "id": "mduc9n3",
          "author": "___disaster___",
          "body": "different things have different texture when blended. with crunchiness it is. even more silly. below this type of crunch things have  v a s t l y  different textures. some things can't be deep fried to achieve this. what are you trying to \"understand\" by this comment? bc that's a thing that i can't understand",
          "created_utc": 1740075033.0
        }
      ]
    },
    {
      "id": "mdvcngb",
      "author": "___disaster___",
      "body": "i mean yeah it changes the texture, sometimes for the better. but it can't work for everything. blending beans is gonna make them better for me but they're never gonna be good without addition of something that changes their texture bc it makes me literally nauseous.",
      "created_utc": 1740085002.0,
      "score": 4,
      "context": [
        {
          "id": "mdnwb1e",
          "author": "Greedy_Carrot3748",
          "body": "Here I am reading this thinking you had the cure",
          "created_utc": 1739991614.0
        },
        {
          "id": "mdodqta",
          "author": "Fizzabl",
          "body": "Very sorry 😂 you can always try my dad's other method \"just pinch your nose and you won't taste it\"",
          "created_utc": 1739996285.0
        },
        {
          "id": "mdqchjp",
          "author": "sliverofmasc",
          "body": "That was the worst because 90% of the time for me, it was the texture. 😭\n\nNow I swallow some food with water and just... don't taste it on purpose??",
          "created_utc": 1740017345.0
        },
        {
          "id": "mds9629",
          "author": "luteyla",
          "body": "But different textures can be obtained with the same ingredients. If you like smooth you blend it. If you like crunchy, you deep fry. I'm sorry if I'm being inconsiderate. Just trying to understand.",
          "created_utc": 1740050327.0
        },
        {
          "id": "mduc9n3",
          "author": "___disaster___",
          "body": "different things have different texture when blended. with crunchiness it is. even more silly. below this type of crunch things have  v a s t l y  different textures. some things can't be deep fried to achieve this. what are you trying to \"understand\" by this comment? bc that's a thing that i can't understand",
          "created_utc": 1740075033.0
        },
        {
          "id": "mdukps1",
          "author": "luteyla",
          "body": "my daughter wouldn't eat lentil soup because of texture but if I puree, she likes it. green beans are impossible but if I roast them in the oven with panko crumbs and parmesan, she likes them crunchy. of course i can't make the same for everything. but when  it works, i am very happy.",
          "created_utc": 1740077317.0
        }
      ]
    }
  ]
}