{
  "id": "1itgebn",
  "subreddit": "ARFID",
  "author": "tarotluver",
  "created_utc": 1739998654.0,
  "title": "Anyone else randomly get the ick from food you normally love?",
  "selftext": "If you asked me two months ago id say my favorite food is pizza. Now I just get overwhelmed by the thought of the cheese in particular that I cannot enjoy it. Ordered takeout from a restaurant with my bf and got Mac and cheese. The second it was in my lap I got grossed out by it and couldn’t eat more than 2 bites. I got overwhelmed by the cheese again. I felt so bad.",
  "url": "https://www.reddit.com/r/ARFID/comments/1itgebn/anyone_else_randomly_get_the_ick_from_food_you/",
  "score": 84,
  "num_comments": 30,
  "comments": [
    {
      "id": "mdorcg8",
      "author": "Angelangepange",
      "body": "Yes, if I suddenly focus too much on the texture of food while I chew it all starts getting disgusting ):",
      "created_utc": 1739999899.0,
      "score": 31,
      "context": []
    },
    {
      "id": "mdoojfj",
      "author": "SmileGuideTVuwu",
      "body": "Yes, it sucks! For me its mashed potatos - I used to  use them as a filler food when I hadn't eatin much in a day but now its like the texture or something is not sitting well with me, I'm sorry you're having this issue :(",
      "created_utc": 1739999147.0,
      "score": 12,
      "context": []
    },
    {
      "id": "mdpdns6",
      "author": "GaydrianTheRainbow",
      "body": "Yeah, I cycle through which foods I can tolerate very frequently. Often it’s taste, even more often it is texture. Suddenly it just becomes Not Food.",
      "created_utc": 1740006115.0,
      "score": 11,
      "context": []
    },
    {
      "id": "mdpbnjn",
      "author": "BluuFennec",
      "body": "This happened to me recently, actually. My ARFID is mild, so I have a lot more safe foods than most folks here, but for a period of, like, three months I couldn't barely stand to eat at all even when it was my usual safe foods and it was a pain trying to figure out what I could still eat.",
      "created_utc": 1740005519.0,
      "score": 7,
      "context": []
    },
    {
      "id": "mdqveow",
      "author": "Applegirl2021",
      "body": "Eggs. I will vacillate between loving them and craving them and then finding them so repulsive to the point of vomiting at the smell. There is very little warning of when the switch will happen and it’s exactly as fun and expensive as it sounds. So yeah, I definitely feel your pain and am wishing you safe food stability!",
      "created_utc": 1740024078.0,
      "score": 6,
      "context": []
    },
    {
      "id": "mdozy09",
      "author": "None",
      "body": "Hot dogs are always a hit or miss for me 😭",
      "created_utc": 1740002200.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mdpbsh6",
      "author": "painful_love_1818",
      "body": "YES its genuinely depressing how often it happens to me :(",
      "created_utc": 1740005559.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mdrnffv",
      "author": "buggiesmile",
      "body": "For me it happens if I eat it too much. Happened with bologna, cinnamon raisin granola bars, salami, and angel hair pasta. I can eat them all again now but I try to be more careful. \n\nOn occasion it can be something else, I bite into something and it has something gross inside (a mini bell pepper that was slimy inside traumatized me for a while. I eat them again but break them open) or like I eat something and it tastes off. Ate a warm hard boiled egg once (was in my lunch box all day) nothing wrong with it but it being room temperature messed with the taste and I couldn’t eat hard boiled eggs for a while. \n\nI also have a weird thing with boiled cabbage where it disagrees with me after I’m like partway through eating the portion. I think it’s the sliminess\n\n\nI’m sure I’m missing some others but yeah it happens to me for varying reasons and it drives me nuts. Frustrating to loose some of your few safe foods",
      "created_utc": 1740037383.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mdqlqog",
      "author": "MultiFandomShipperr",
      "body": "I cycle between foods I can eat so sometimes something is top of my list and other times I'll cry if I have to eat it.",
      "created_utc": 1740020561.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mdrtean",
      "author": "emotionalaries",
      "body": "omg yes, I get obsessed & fixated on a food & then all the sudden I can’t stand. I had a phase of frosted sunday poptarts for like 6 to 8 months, like multiple poptarts every day & then one day I just could not stand them anymore, I have not had one in probably 4 or 5 years now. this also happened with the walmart brand of loft house cookies but I like them again",
      "created_utc": 1740040976.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mdtvmt6",
      "author": "AshleysTheGirl",
      "body": "Yess this happens to me all the time and I hate it :( One day a certain food is all I feel up to eating and then another day it's the one thing I could not stand to eat. There are very few foods where I never fluctuate between loving them and feeling sick even thinking about them",
      "created_utc": 1740070481.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mdp354f",
      "author": "WindermerePeaks1",
      "body": "yes",
      "created_utc": 1740003082.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mdt7ypn",
      "author": "runnawaycucumber",
      "body": "If I eat a safe food too often for too long it will permanently stop being safe, there's so many foods I've completely stopped being able to eat because of it",
      "created_utc": 1740063778.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mdre08u",
      "author": "Phoenixtdm",
      "body": "Yes I don’t have ARFID but I’ve always gotten sick of safe foods growing up",
      "created_utc": 1740032223.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mdqispk",
      "author": "Sophia_HJ22",
      "body": "ALL THE DAMN TIME!! I can still remember the first food I 'went off' ( Broccoli ), when I was about 5 - I haven't eaten the stuff since. There's loads of other stuff I could name but it would take a while!",
      "created_utc": 1740019524.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mdqsw3w",
      "author": "r0ckchalk",
      "body": "Yep. Usually I’ll eat the same thing every day for 6 months straight then all of the sudden there’s no way I can eat it. Then I have to find something else to eat for the next 6 months. I always swear my taste buds change, but I think it’s really my brain changing.",
      "created_utc": 1740023132.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mdr609y",
      "author": "NoBalance1897",
      "body": "all the time! i go thru phases with different foods that i will eat nonstop for months and then one day i suddenly can’t stand it and won’t touch it for atleast for a few months. but i usually end up coming back to the food within a few months/years",
      "created_utc": 1740028434.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mdrogwb",
      "author": "lilliweasel",
      "body": "Potatoes, I only used to eat roast potatoes and chips, but since having dental implants the whole mouth feel of potatoes has changed and I struggle to eat them at all",
      "created_utc": 1740038000.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mdrow69",
      "author": "Queenofwands1212",
      "body": "I used to love smoked salmon. I haven’t eaten it in a long time and needed to eat a package I had in my fridge before it expired. I was eating it and I literally could not stomach the texture and taste. So I chewed and spit it because I still wanted to feel like I ate it but I didn’t want to swallow it. Obviously very disordered of me. Seems like my safe foods have dwindled down to a list of 5 things",
      "created_utc": 1740038252.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mduceul",
      "author": "z3phir_demon",
      "body": "What my poor partner has to put up with!! I'll say I love a certain food one week and then a month later, I dislike it. Months later, I love it again.",
      "created_utc": 1740075073.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mdv80rb",
      "author": "Violet_Mermaid",
      "body": "I go in cycles. Like I usually love the hillside farm snack trays with the meat cheese and crackers, but right now all of that disgusts me. I’ll probably be able to eat it again after a few months.",
      "created_utc": 1740083723.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mdzkf53",
      "author": "Itscatpicstime",
      "body": "Yes, it’s basically my life. I find a food I like, then it’s most of what I eat while I try to find another food I like. \n\nBy two weeks, I’m burned out on it, by 4 weeks, I’m disgusted. Then I’ll like it again in a few months to years. Rinse and repeat. It’s exhausting.",
      "created_utc": 1740145967.0,
      "score": 1,
      "context": []
    },
    {
      "id": "me0ffuw",
      "author": "vonoddly",
      "body": "If I chew anything for too long it happens. I definitely go through phases where something suddenly isn’t right but it doesn’t happen all the time.",
      "created_utc": 1740155347.0,
      "score": 1,
      "context": []
    },
    {
      "id": "me62k2l",
      "author": "NorthStarMidnightSky",
      "body": "oh yeah. I've got that with cheese, especially, where when it's in for me, it's in. But then it goes out and all things with cheese are compete inedible.",
      "created_utc": 1740234476.0,
      "score": 1,
      "context": []
    },
    {
      "id": "men5ipe",
      "author": "FatimahCh",
      "body": "Yep. I feel like my senses just get tired and I crave to be able to eat normal. \n\nMy body just chooses to shut down and not eat or binge on sweets anyway.\n\nI am not enjoying food much. My arfid is more mild, but I am... tired of food. Sometimes I wish I could be magically fed without food entering my mouth",
      "created_utc": 1740454476.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ms322y3",
      "author": "Willing-Ad9868",
      "body": "YEP! McDonald’s cheeseburger and French fries are my ultimate safe food, no matter how icky I feel I can eat that",
      "created_utc": 1747141396.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mdrtnta",
      "author": "emotionalaries",
      "body": "I would be devastated if I couldn’t have mashed potatoes, I’m so sorry you struggling with them",
      "created_utc": 1740041141.0,
      "score": 3,
      "context": [
        {
          "id": "mdoojfj",
          "author": "SmileGuideTVuwu",
          "body": "Yes, it sucks! For me its mashed potatos - I used to  use them as a filler food when I hadn't eatin much in a day but now its like the texture or something is not sitting well with me, I'm sorry you're having this issue :(",
          "created_utc": 1739999147.0
        }
      ]
    },
    {
      "id": "mdru21o",
      "author": "emotionalaries",
      "body": "my brother has diagnosed ARFID & it’s not horrible but more than mild. dino nuggets have been lost entirely no point in trying, and he stopped eating the ham & crackers in lunchables (his main food source.)",
      "created_utc": 1740041387.0,
      "score": 3,
      "context": [
        {
          "id": "mdpbnjn",
          "author": "BluuFennec",
          "body": "This happened to me recently, actually. My ARFID is mild, so I have a lot more safe foods than most folks here, but for a period of, like, three months I couldn't barely stand to eat at all even when it was my usual safe foods and it was a pain trying to figure out what I could still eat.",
          "created_utc": 1740005519.0
        }
      ]
    },
    {
      "id": "mdru7oo",
      "author": "emotionalaries",
      "body": "on a positive note eggs are getting crazy expensive right now, kinda glad I’m not interested in them currently cause that bird flu has got these egg prices through the roof :(",
      "created_utc": 1740041484.0,
      "score": 1,
      "context": [
        {
          "id": "mdqveow",
          "author": "Applegirl2021",
          "body": "Eggs. I will vacillate between loving them and craving them and then finding them so repulsive to the point of vomiting at the smell. There is very little warning of when the switch will happen and it’s exactly as fun and expensive as it sounds. So yeah, I definitely feel your pain and am wishing you safe food stability!",
          "created_utc": 1740024078.0
        }
      ]
    },
    {
      "id": "mdrtkuk",
      "author": "emotionalaries",
      "body": "same, I think it’s a combination of how tolerant i am of eating them & my mood lol. i bath my hotdogs in ketchup",
      "created_utc": 1740041089.0,
      "score": 2,
      "context": [
        {
          "id": "mdozy09",
          "author": "None",
          "body": "Hot dogs are always a hit or miss for me 😭",
          "created_utc": 1740002200.0
        }
      ]
    }
  ]
}