{
  "id": "1ivwo6h",
  "subreddit": "ARFID",
  "author": "verylongeyebags",
  "created_utc": 1740268362.0,
  "title": "Got tricked into eating a different type of ravioli",
  "selftext": "So my parents made ravioli for dinner and it had butternut squash in it. It tasted vaguely like cinnamon and I like cinnamon so it wasn't *too* bad, but looking at the inside of the ravioli and seeing the texture made it x1000 worse. I asked her why it tasted weirdly like cinnamon and she just started laughing and she bet my dad that I would be able to tell the difference right away. It wasn't even so much the taste as much as it was the fact that they bought it because my mom bet my dad I would be able to tell the difference. I'm so fucking glad it wasn't so bad to cause me to have a really bad reaction, but I ended up throwing the rest out anyway because it hurt my feelings. (Plus, seeing the texture of the cheese didn't help)",
  "url": "https://www.reddit.com/r/ARFID/comments/1ivwo6h/got_tricked_into_eating_a_different_type_of/",
  "score": 195,
  "num_comments": 33,
  "comments": [
    {
      "id": "meadafy",
      "author": "pwhlb",
      "body": "They don’t even realize that all they’re doing is making a new fear food, even if you liked how it tasted. Any chance of you enjoying and wanting to eat it in the future is gone when they’re deceptive about having you try it.",
      "created_utc": 1740283659.0,
      "score": 159,
      "context": []
    },
    {
      "id": "me9n6za",
      "author": "WindermerePeaks1",
      "body": ":/ that sounds awful",
      "created_utc": 1740273961.0,
      "score": 49,
      "context": []
    },
    {
      "id": "me9p2zm",
      "author": "rabbit7891",
      "body": "butternut squash & ravioli are two foods i cannot eat due to arfid so i feel for you. this is a huge betrayal of trust on your moms part",
      "created_utc": 1740274634.0,
      "score": 73,
      "context": []
    },
    {
      "id": "me9sq9i",
      "author": "youngdeathnotice",
      "body": "I would probably start making my own food in that situation. That’s such a messed up thing to do if they know you have an ED :/// do you think you’ll ever retry the food on your terms? Especially since you said you weren’t minding it until the negative association. If not, I completely understand that too 🤍",
      "created_utc": 1740275930.0,
      "score": 27,
      "context": []
    },
    {
      "id": "mea97l4",
      "author": "Parkinginspaghetti",
      "body": "My mom teases me when she makes food modifications like “I had to put this to the side for you”, and stuff like that so I know it hurts to feel that betrayal when all of a sudden “I didn’t think you would notice” comes up. We find something we are comfortable eating and we move on<3. Hope things get better for you",
      "created_utc": 1740282069.0,
      "score": 23,
      "context": []
    },
    {
      "id": "meazvpx",
      "author": "Itscatpicstime",
      "body": "This is why I was kind of annoyed when people were praising that recent episode of Abbott Elementary, because one character tricks the other into eating something and he ends up liking it and it’s framed as a good thing.\n\nIt’s just horrible to do to someone. If I eat something I don’t like or didn’t expect, I’m often off all food for *days.* It pisses me off that people don’t take this seriously and act like it’s a joke. Food is already so stressful with ARFID, and they only make it that much harder.\n\nI’m sorry op 🖤",
      "created_utc": 1740294296.0,
      "score": 33,
      "context": []
    },
    {
      "id": "mecf2d4",
      "author": "Rogue_Spirit",
      "body": "They’re making things worse and they need to understand that",
      "created_utc": 1740320816.0,
      "score": 8,
      "context": []
    },
    {
      "id": "mebll1o",
      "author": "Infamous_Ad_7864",
      "body": "My parents constantly would try to \"prove\" that I wasn't really THAT picky by hiding random ingredients I hated in foods I liked. I could always tell it was different, and it just made me too uncomfortable to even try the new food. I've had so many random foods forced on me that I still haven't been able to try in earnest because my first exposure to them was either being lied to about them or having them shoved in my mouth against my will",
      "created_utc": 1740307001.0,
      "score": 18,
      "context": []
    },
    {
      "id": "mea99tc",
      "author": "I_heart_DPP",
      "body": "I am really sorry they did this to you.  It was very wrong.\n\nI hope this doesn't mess up regular raviolis for you.  Just check inside every time while giving them a dirty look.",
      "created_utc": 1740282092.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mec0x6w",
      "author": "anyanuts",
      "body": "i'm sorry. this really sucks. here for u💕",
      "created_utc": 1740315234.0,
      "score": 5,
      "context": []
    },
    {
      "id": "meahxie",
      "author": "sugaredsnickerdoodle",
      "body": "I am honestly happy to try new foods if I have an idea of what it is and a sense of control, having things snuck into my food just makes me not trust any food ever coming from that person again :/",
      "created_utc": 1740285580.0,
      "score": 9,
      "context": []
    },
    {
      "id": "meejrt5",
      "author": "Burnilde",
      "body": "Do they even understand anything about ARFID? How absolutely detrimental this behavior is to you? They could set you back in a big way but all they care about is making bets with each other? Absolutely disgusting of them, I'm so sorry.",
      "created_utc": 1740343644.0,
      "score": 4,
      "context": []
    },
    {
      "id": "meaknh0",
      "author": "Quirky_Description",
      "body": "I used to really hate lentils. Years ago when I was a little kid (between 3 and 5), I was sat at the table and told I had to eat at least 10 spoonfuls of lentils. I remember staring at this thing that apparently people ate but wasn't edible to me. I remember running to the bathroom as my gag reflex went into overdrive and my parents frustration at my \"over reaction.\" I hated lentils after that. Could not stand them. Even as I slowly started to accept beans as a safe food, lentils weren't edible. It wasn't until a little over 20 years later that I was able to consider lentils as food.\n\nYour parents messed up big time by tricking you. They should have taken it slow and openly.  Even if the food is ruined for you now, I hope one day you'll be able to consider trying it again in small doses. I also hope this hasn't ruined ravioli for you as a whole. A part of why I used to hate meal times was because I felt the need to inspect every bit of my food.",
      "created_utc": 1740286733.0,
      "score": 8,
      "context": []
    },
    {
      "id": "mecoib9",
      "author": "Sure-Lecture-2542",
      "body": "This whole thing seems really strange to me. What type of ravioli did your mom say it was? Literally anyone would be able to tell the difference in butternut squash ravioli, from say.. beef or cheese. That’s a whole different dish. Who wouldn’t notice that? I’d even say that I would be concerned about a person that didn’t notice. Anybody would. \nSo I guess I just don’t understand why your mom would expect you to NOT notice to the point of laughing that you did and betting your dad?",
      "created_utc": 1740323957.0,
      "score": 3,
      "context": []
    },
    {
      "id": "meb3qi5",
      "author": "Isadum",
      "body": "It genuinely is such a betrayal when people trick you. I really wish there was a way to have people know how it feels to have arfid. It’s not just being picky it’s so much more than that.",
      "created_utc": 1740296484.0,
      "score": 4,
      "context": []
    },
    {
      "id": "med43au",
      "author": "demraxy",
      "body": "betting on your food sensitivities is fucked up. i hope they realize they’re only making things worse. so sorry homie.",
      "created_utc": 1740328660.0,
      "score": 4,
      "context": []
    },
    {
      "id": "meb7q2d",
      "author": "Angelangepange",
      "body": "I'm really sorry they did this to you. People really don't understand how serious this is. 😑   \nIt's not fun to possibly have your entire day ruined if not getting a new fear for the amusement of others.",
      "created_utc": 1740298790.0,
      "score": 4,
      "context": []
    },
    {
      "id": "med5h2q",
      "author": "kwink8",
      "body": "It’s so wild to me when people don’t think someone would notice a difference in their regular foods. Like do other people not actually taste things? I would also notice cinnamon right away lmao",
      "created_utc": 1740329071.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mefuft5",
      "author": "citykittycat",
      "body": "This is so hurtful, I can’t understand someone doing this when they know you have arfid/food issues.",
      "created_utc": 1740358484.0,
      "score": 1,
      "context": []
    },
    {
      "id": "med43ji",
      "author": "rainbowsootsprite",
      "body": "this paired with my pda would send me off the rails ☠️ i hate being lied to, tricked or forced to do something so this deception would lead to a meltdown lmao.",
      "created_utc": 1740328662.0,
      "score": 0,
      "context": []
    },
    {
      "id": "me9ghz9",
      "author": "No_Tailor_9572",
      "body": "If it was fine without looking at it though why not take the win of a new food & eat it",
      "created_utc": 1740271656.0,
      "score": -43,
      "context": []
    },
    {
      "id": "med6vu2",
      "author": "codeinesjukebox",
      "body": "this!!! i don't get why this stuff is funny to other people. i doubt any of us get joy out of disliking certain textures, so why do they enjoy watching us suffer? :(",
      "created_utc": 1740329479.0,
      "score": 36,
      "context": [
        {
          "id": "meadafy",
          "author": "pwhlb",
          "body": "They don’t even realize that all they’re doing is making a new fear food, even if you liked how it tasted. Any chance of you enjoying and wanting to eat it in the future is gone when they’re deceptive about having you try it.",
          "created_utc": 1740283659.0
        }
      ]
    },
    {
      "id": "me9zes0",
      "author": "Yalsas",
      "body": "Funnily enough those are two foods I can stomach. But I understand the betrayal. My mom once added grape jelly to our chicken. Wouldn't tell me what it was, but her and my dad kept laughing as I was trying to play it off. \n\nSaw the opened jelly after the fact",
      "created_utc": 1740278366.0,
      "score": 15,
      "context": [
        {
          "id": "me9p2zm",
          "author": "rabbit7891",
          "body": "butternut squash & ravioli are two foods i cannot eat due to arfid so i feel for you. this is a huge betrayal of trust on your moms part",
          "created_utc": 1740274634.0
        }
      ]
    },
    {
      "id": "med7q69",
      "author": "minisqueal",
      "body": "This 1000%. I find it so exhausting how played down what we deal with is, at least in my experience im treated like im just being picky or like im just trying to be difficult, or that I simply don’t like the taste of something. sadly a lot of this judgement comes from fellow people in ARFID community, I always get a lot of comments about “ are you SURE you have arfid and dont just have picky eating tendencies “ or “ maybe you just have food anxiety not arfid! “ but that never changes how huge of a struggle I PERSONALLY have to go through over food. It’s not all visible. That makes people so much more prone to ignorance and judgment just with every other invisible or more “ subtle appearing “ disorders and diseases. Breaks my heart for everyone involved honestly.",
      "created_utc": 1740329724.0,
      "score": 5,
      "context": [
        {
          "id": "meazvpx",
          "author": "Itscatpicstime",
          "body": "This is why I was kind of annoyed when people were praising that recent episode of Abbott Elementary, because one character tricks the other into eating something and he ends up liking it and it’s framed as a good thing.\n\nIt’s just horrible to do to someone. If I eat something I don’t like or didn’t expect, I’m often off all food for *days.* It pisses me off that people don’t take this seriously and act like it’s a joke. Food is already so stressful with ARFID, and they only make it that much harder.\n\nI’m sorry op 🖤",
          "created_utc": 1740294296.0
        }
      ]
    },
    {
      "id": "me9hdat",
      "author": "Hanhula",
      "body": "Because that's not how every type of ARFID works, we can't just do that. They clearly could tell something was wrong with it, and learning what exactly was both a betrayal of trust and confirmation that the food was Wrong.\n\nIt's an eating disorder, not pickiness.",
      "created_utc": 1740271951.0,
      "score": 51,
      "context": [
        {
          "id": "me9ghz9",
          "author": "No_Tailor_9572",
          "body": "If it was fine without looking at it though why not take the win of a new food & eat it",
          "created_utc": 1740271656.0
        }
      ]
    },
    {
      "id": "me9h9u0",
      "author": "oddistrange",
      "body": "I think it's mostly that people who are supposed to be very important in their life think that this is something that is shallow and superficial enough for them to be able to trick OP. It just feels gross and it can really sour any appetite you may have had when eating is already a high stress activity for many of us here.",
      "created_utc": 1740271918.0,
      "score": 24,
      "context": [
        {
          "id": "me9ghz9",
          "author": "No_Tailor_9572",
          "body": "If it was fine without looking at it though why not take the win of a new food & eat it",
          "created_utc": 1740271656.0
        }
      ]
    },
    {
      "id": "me9kjge",
      "author": "verylongeyebags",
      "body": "The thing is, it probably *could* have been a new safe food, but with the betrayal of trust combined with seeing the texture of the cheese and even just *knowing* it was different made it taste worse and completely ruined it for me. Now thinking about having to eat it again stresses me out and makes me feel sick. If I had been told what was in it beforehand and could try it on my own terms, I probably would've kept eating",
      "created_utc": 1740273037.0,
      "score": 24,
      "context": [
        {
          "id": "me9ghz9",
          "author": "No_Tailor_9572",
          "body": "If it was fine without looking at it though why not take the win of a new food & eat it",
          "created_utc": 1740271656.0
        }
      ]
    },
    {
      "id": "me9i4bl",
      "author": "No_Tailor_9572",
      "body": "I know it's a disorder I literally have it but I don't understand how if it doesn't make you gag why you can't eat it like what else would stop you physically",
      "created_utc": 1740272205.0,
      "score": -30,
      "context": [
        {
          "id": "me9ghz9",
          "author": "No_Tailor_9572",
          "body": "If it was fine without looking at it though why not take the win of a new food & eat it",
          "created_utc": 1740271656.0
        },
        {
          "id": "me9hdat",
          "author": "Hanhula",
          "body": "Because that's not how every type of ARFID works, we can't just do that. They clearly could tell something was wrong with it, and learning what exactly was both a betrayal of trust and confirmation that the food was Wrong.\n\nIt's an eating disorder, not pickiness.",
          "created_utc": 1740271951.0
        }
      ]
    },
    {
      "id": "mekrd31",
      "author": "watdoyoumead",
      "body": "Did it have squash AND cheese? Because that's an abomination regardless of ARFID.",
      "created_utc": 1740427690.0,
      "score": 1,
      "context": [
        {
          "id": "me9ghz9",
          "author": "No_Tailor_9572",
          "body": "If it was fine without looking at it though why not take the win of a new food & eat it",
          "created_utc": 1740271656.0
        },
        {
          "id": "me9kjge",
          "author": "verylongeyebags",
          "body": "The thing is, it probably *could* have been a new safe food, but with the betrayal of trust combined with seeing the texture of the cheese and even just *knowing* it was different made it taste worse and completely ruined it for me. Now thinking about having to eat it again stresses me out and makes me feel sick. If I had been told what was in it beforehand and could try it on my own terms, I probably would've kept eating",
          "created_utc": 1740273037.0
        }
      ]
    },
    {
      "id": "me9j0fa",
      "author": "Hanhula",
      "body": "You don't have to have a gag reaction to not be able to eat something, my dude. Your brain can just consider it unacceptable to continue, and you can be unable to do so. There's more than 1 type of ARFID and they all manifest differently.\n\nWhile OP could probably try and work up to having that as a safe food, tricking someone into eating something can be really awful for actually helping ARFID in a tonne of cases, too. So the parents might have just ruined any chance of that with their BS too.",
      "created_utc": 1740272512.0,
      "score": 27,
      "context": [
        {
          "id": "me9ghz9",
          "author": "No_Tailor_9572",
          "body": "If it was fine without looking at it though why not take the win of a new food & eat it",
          "created_utc": 1740271656.0
        },
        {
          "id": "me9hdat",
          "author": "Hanhula",
          "body": "Because that's not how every type of ARFID works, we can't just do that. They clearly could tell something was wrong with it, and learning what exactly was both a betrayal of trust and confirmation that the food was Wrong.\n\nIt's an eating disorder, not pickiness.",
          "created_utc": 1740271951.0
        },
        {
          "id": "me9i4bl",
          "author": "No_Tailor_9572",
          "body": "I know it's a disorder I literally have it but I don't understand how if it doesn't make you gag why you can't eat it like what else would stop you physically",
          "created_utc": 1740272205.0
        }
      ]
    },
    {
      "id": "me9jpc4",
      "author": "owlbaby75",
      "body": "Because our brain literally won't let us. It's not a conscious decision not to eat it. It is a subconscious level, and we can't physically force ourselves. If it was on the conscious level, we could. When it's an action from the conscious level of your brain, you have the ability to change the direction of your brain. When it's from the subconscious, your brain dictates your action, and there is no changing it.",
      "created_utc": 1740272748.0,
      "score": 18,
      "context": [
        {
          "id": "me9ghz9",
          "author": "No_Tailor_9572",
          "body": "If it was fine without looking at it though why not take the win of a new food & eat it",
          "created_utc": 1740271656.0
        },
        {
          "id": "me9hdat",
          "author": "Hanhula",
          "body": "Because that's not how every type of ARFID works, we can't just do that. They clearly could tell something was wrong with it, and learning what exactly was both a betrayal of trust and confirmation that the food was Wrong.\n\nIt's an eating disorder, not pickiness.",
          "created_utc": 1740271951.0
        },
        {
          "id": "me9i4bl",
          "author": "No_Tailor_9572",
          "body": "I know it's a disorder I literally have it but I don't understand how if it doesn't make you gag why you can't eat it like what else would stop you physically",
          "created_utc": 1740272205.0
        }
      ]
    },
    {
      "id": "meblvlz",
      "author": "Infamous_Ad_7864",
      "body": "My brain sees Betrayal Foods as if they were Styrofoam. It doesn't matter how much I was able to eat it prior to the betrayal, as soon as I'm aware? It's like its Not Food to my brain",
      "created_utc": 1740307171.0,
      "score": 5,
      "context": [
        {
          "id": "me9ghz9",
          "author": "No_Tailor_9572",
          "body": "If it was fine without looking at it though why not take the win of a new food & eat it",
          "created_utc": 1740271656.0
        },
        {
          "id": "me9hdat",
          "author": "Hanhula",
          "body": "Because that's not how every type of ARFID works, we can't just do that. They clearly could tell something was wrong with it, and learning what exactly was both a betrayal of trust and confirmation that the food was Wrong.\n\nIt's an eating disorder, not pickiness.",
          "created_utc": 1740271951.0
        },
        {
          "id": "me9i4bl",
          "author": "No_Tailor_9572",
          "body": "I know it's a disorder I literally have it but I don't understand how if it doesn't make you gag why you can't eat it like what else would stop you physically",
          "created_utc": 1740272205.0
        }
      ]
    },
    {
      "id": "mej5c91",
      "author": "oh-botherWTP",
      "body": "If I get my safe food and it looks 2% different than usual I can't eat it. My brain tells me I will collapse and puke. Trust me, I wish that weren't the case but here we are.",
      "created_utc": 1740411242.0,
      "score": 1,
      "context": [
        {
          "id": "me9ghz9",
          "author": "No_Tailor_9572",
          "body": "If it was fine without looking at it though why not take the win of a new food & eat it",
          "created_utc": 1740271656.0
        },
        {
          "id": "me9hdat",
          "author": "Hanhula",
          "body": "Because that's not how every type of ARFID works, we can't just do that. They clearly could tell something was wrong with it, and learning what exactly was both a betrayal of trust and confirmation that the food was Wrong.\n\nIt's an eating disorder, not pickiness.",
          "created_utc": 1740271951.0
        },
        {
          "id": "me9i4bl",
          "author": "No_Tailor_9572",
          "body": "I know it's a disorder I literally have it but I don't understand how if it doesn't make you gag why you can't eat it like what else would stop you physically",
          "created_utc": 1740272205.0
        }
      ]
    }
  ]
}