{
  "id": "1iz2702",
  "subreddit": "ARFID",
  "author": "lebofsky318",
  "created_utc": 1740614247.0,
  "title": "Being called a “picky eater”",
  "selftext": "I am 23 and started showing symptoms of ARFID when I was 3. My whole life I have been called a picky eater or been told I eat like a child. Even my own family, partner’s family, and extended family make fun of my eating habits. I try to explain that it is really difficult for me to change my habits and I will get severe anxiety for certain foods and start to gag. They just tell me to get over it and I’m weak. Do I have a right to be upset when people call me a picky eater? I hate that term, it’s not like I chose to be this way. ",
  "url": "https://www.reddit.com/r/ARFID/comments/1iz2702/being_called_a_picky_eater/",
  "score": 96,
  "num_comments": 11,
  "comments": [
    {
      "id": "mezd1o1",
      "author": "runnawaycucumber",
      "body": "Even if you don't have ARFID you have a right to be upset when someone insults something about you that you can't control. Any form of bullying when it comes to food is completely unacceptable and can cause so many negative issues. Your feelings are completely valid",
      "created_utc": 1740614354.0,
      "score": 56,
      "context": []
    },
    {
      "id": "mezf3aa",
      "author": "Ky3031",
      "body": "I’m 23 and also stopped eating most foods at 3. I could have written this post. You are 100% correct to feel upset when they call you a picky eater. You know yourself more than they do, let their comments reflect badly on them and not you. \n\nAt the end of the day, they can’t even give you the respect to take time to understand it, and that shows a lot about them.",
      "created_utc": 1740615032.0,
      "score": 25,
      "context": []
    },
    {
      "id": "mezr0ad",
      "author": "MMTardis",
      "body": "Picky eater implies choice, whereas people with this eating disorder can and will starve in the absence of their safe foods.",
      "created_utc": 1740618889.0,
      "score": 21,
      "context": []
    },
    {
      "id": "mezk4iw",
      "author": "JelloOfLife",
      "body": "I’m 24, sounds like we have a pretty similar experience.\n\nI own who I allow to talk to me. I’m great, If the people around me can’t accept who I am and need to belittle me by calling me a “picky eater” or saying “you should just try a bite” then they don’t deserve to be around me.\n\nOwn your space, life with ARFID is hard enough, don’t put up with that shit.",
      "created_utc": 1740616660.0,
      "score": 7,
      "context": []
    },
    {
      "id": "mf0009a",
      "author": "shadyprincess",
      "body": "I'm 26 and have been treating this in therapy for a while. I could probably write word for word what you posted, sad to see it's such a common experience\n\nIt's hard, but learning that this says more about how human beings in general have this fucked up habit than it does about you helps. it's really hard going against something that is basically the status quo, but people really *are* fucking weirdos for this. what we eat is our business and nobody else's.\n\nI used to bawl at the term picky eater, then hated it, now sometimes I use it because its just the easiest way to explain it. Therapy has really helped, because it lowers my anxiety and makes it easier to eat. I've also been to psychiatrists that focus on ED and the medicine has helped out a lot!\n\nIt's a journey, but I promise there's a version of you that can actually be ok with all this family drama shit that comes with ARFID lol",
      "created_utc": 1740621862.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mf03s65",
      "author": "angelneliel",
      "body": "Your family does not sound very nice.",
      "created_utc": 1740623148.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mf3gbsx",
      "author": "shitz_brickz",
      "body": "I got so fed up with friends/family that I just devolve right into the bad faith arguments. I'll look around the room and grab something and ask them to eat it - a crayon for example. I tell them I made the crayon with my grandmother's recipe that's been handed down for generations, plenty of people that I know love them. Even a kid will eat a crayon without being forced to. If they are willing to eat a crayon I'll eat whatever it is that we are arguing about (never ends up going that direction). When they admit they are too weak to eat what a 3yo is willing to eat, they shouldn't be criticizing me.",
      "created_utc": 1740674793.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mf6k9t7",
      "author": "Sure-Lecture-2542",
      "body": "Such a common complaint. Everyone with ARFID hates being called picky. I honestly don’t really get it. It’s not a derogatory term. I wouldn’t care a bit if someone called me picky about eating or anything else. But it definitely seems to be a sensitivity. \n\nI’m sure your family loves you. You should definitely speak up about how this is hurting you. In fact, IMO what will help this situation most, is a lot more honest and open communication. There is ARFID specific therapy available online and even includes the whole family in a lot of situations.",
      "created_utc": 1740708542.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mf6zvu3",
      "author": "Kelly8989",
      "body": "You do ha have a right to be upset! Tell them nicely how you feel when they say that and maybe show them info on ARFID too. You can take screenshots from this group or Facebook or send them website info like this https://www.webmd.com/mental-health/eating-disorders/what-is-arfid",
      "created_utc": 1740714149.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mfcd3l3",
      "author": "Dykeryy",
      "body": "I just tell them to go fuck themselves. I dealt with bullying and abuse because of ARFID for years, so now I refuse to be even remotely nice to people who are rude about it. They get one chance to listen to my explanation that it's an eating disorder, not a preference. But if they don't listen the first time, i'll make it clear exactly where they can shove their opinions.",
      "created_utc": 1740785781.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mf0s45y",
      "author": "Funkmastertech",
      "body": "This is great advice for pretty much everything. Don’t like the way people talk to you? Cut em out fuck it. Eventually they’ll ask “Why don’t you come around anymore?” and you can just say “Because you’re an asshole.” Then they’ll get mad and never realize the hypocrisy of their actions and that’s when you learn people are dumb as fuck lol.",
      "created_utc": 1740632325.0,
      "score": 3,
      "context": [
        {
          "id": "mezk4iw",
          "author": "JelloOfLife",
          "body": "I’m 24, sounds like we have a pretty similar experience.\n\nI own who I allow to talk to me. I’m great, If the people around me can’t accept who I am and need to belittle me by calling me a “picky eater” or saying “you should just try a bite” then they don’t deserve to be around me.\n\nOwn your space, life with ARFID is hard enough, don’t put up with that shit.",
          "created_utc": 1740616660.0
        }
      ]
    }
  ]
}