{
  "id": "1j1y6oz",
  "subreddit": "ARFID",
  "author": "NoButterOnlyRage",
  "created_utc": 1740941421.0,
  "title": "Wish people understood it’s not a choice",
  "selftext": "Tonight I put basically all my salmon in the trash because I physically can NOT make myself eat. It's fucking hell. And I can't control that. If I could flip a switch and magically be cured of ARFID, and able to eat food I used to love such a salmon, I would immediately flip it. But that doesn't exist. I'm stuck in this hell where I have to do the most painful thing over and over and over again without any breaks. I fucking hate living with this disorder. And people think I intentionally am this way. FUCK that",
  "url": "https://www.reddit.com/r/ARFID/comments/1j1y6oz/wish_people_understood_its_not_a_choice/",
  "score": 255,
  "num_comments": 11,
  "comments": [
    {
      "id": "mfng7px",
      "author": "playgroundprincess",
      "body": "i could've wrote this myself with the french toast my mom tried to make me eat yesterday.. it ended with me just throwing it in the trash when she wasn’t looking so i didn’t get my stuff taken\n\ni hope people understand that what we have is a disorder and not a choice. if more awareness is shown on it, then maybe more people would be more understanding!!",
      "created_utc": 1740942224.0,
      "score": 37,
      "context": []
    },
    {
      "id": "mfnerrb",
      "author": "Archillected",
      "body": "I feel you bro, its not fun one bit",
      "created_utc": 1740941803.0,
      "score": 31,
      "context": []
    },
    {
      "id": "mfnlro1",
      "author": "Practical-Dealer2379",
      "body": "I throw away so much food. I'm trying to help myself by introducing new food but I just get so disgusted and angry and just throw everything away. \n\nThe guilt from the waste sucks too.",
      "created_utc": 1740943846.0,
      "score": 22,
      "context": []
    },
    {
      "id": "mfnnnmp",
      "author": "imhereforthemeta",
      "body": "I never explain unless I feel safe with someone. If I say “I have an eating disorder” which is true. they all get too scared to challenge my decisions. It’s nuclear and people will worry you are trying to starve yourself but that’s their problem. Sometimes it’s worth it to get someone off your back",
      "created_utc": 1740944404.0,
      "score": 15,
      "context": []
    },
    {
      "id": "mfo4fni",
      "author": "luteyla",
      "body": "With some people it happens like a switch is turned on. I wish we knew how.",
      "created_utc": 1740949440.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mfpj9h4",
      "author": "Infinite_Corn",
      "body": "I feel you :( I miss being able to enjoy foods that I once enjoyed. I’m now stuck eating the same meals everyday.",
      "created_utc": 1740966053.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mfo8t5p",
      "author": "Smooth_System3208",
      "body": "It is such a difficult condition to live with",
      "created_utc": 1740950776.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mfpvhm2",
      "author": "ccf1709",
      "body": "The disconnect between my body and brain when it comes to food is tormenting. I didn’t think my life would be like this when I was growing up :/",
      "created_utc": 1740970260.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mg1g5x4",
      "author": "heranoori",
      "body": "I recently discovered that I had an eating disorder since I was a child, but it has only evolved in this way two years ago. I suddenly turned from a person who eats a lot of kinds completely far from being \"picky\" to someone who barely eating. I hate when he looks at me as a \"picky eater\". I am starving while they look at me like i am a child who is ungrateful and likes attention.",
      "created_utc": 1741125891.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mfnn1bx",
      "author": "RamblingRose63",
      "body": "Ohk so here are some things that will help you. \n\n\n1. Perspective \nCalm down so you can hear me out:\n\nIf you had cancer would you be worried about what another mofo thought of how you get by everyday? \n\n\n2. Bloodwork and vitamin mineral panel so you can create a regimen to help you get what you need omega 3 etc so that when you can't eat that salmon you can feel better about how you're body is going to get nutrients at least. \n\n3. Figure out what it is that is stopping you from the safe food. Figure out how to mitigate it. Get creative. I've started forcing myself to eat meat even though I've had an aversion when I've loved chicken and turkey and ham but I've forced myself with seasonings and nothing bad happened showing myself the bad thoughst I think actually didn't happen by being brave once showed me I could be brave again. I basically got tired of the pain of hunger and just downed it and treated myself with my favorite glass of juice so the last thing my pallet reminded me was juice and I was over it. I also took bigger bites of green beans to help with the gamey taste. Idk why having something sweet triggers my brain to recover from the freak out I have in the moment. I like to keep my favorite cookies near too. Several bites of food then my cookie repeat. You can get creative it's not gonna be easy but neither is living like this.\n\nEdit to add\n\nPlease stop throwing food away and find a way to donate it or give it to someone 🙏 let them know you had someone. Buy you lunch or idk but please try to give it to someone that will help with guilt. I do that now and it's helped me alot with the way I view myself. \n\nHope aby of this helps. Here if you ever want to talk through stuff",
      "created_utc": 1740944217.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mfnob5g",
      "author": "RamblingRose63",
      "body": "Can you walk me through what about the French toast turned you off understanding others arfid has really helped me with mine. If it triggers you please don't feel obligated to answer",
      "created_utc": 1740944598.0,
      "score": 9,
      "context": [
        {
          "id": "mfng7px",
          "author": "playgroundprincess",
          "body": "i could've wrote this myself with the french toast my mom tried to make me eat yesterday.. it ended with me just throwing it in the trash when she wasn’t looking so i didn’t get my stuff taken\n\ni hope people understand that what we have is a disorder and not a choice. if more awareness is shown on it, then maybe more people would be more understanding!!",
          "created_utc": 1740942224.0
        }
      ]
    }
  ]
}