{
  "id": "1j21tpw",
  "subreddit": "ARFID",
  "author": "Kawichi",
  "created_utc": 1740950516.0,
  "title": "I wish there was more support for children with ARFID",
  "selftext": "Many children around the world probably have ARFID, but the adults put it off as \"picky\". When I was younger, I would not eat a lot of things. I was often called picky . I even had to take those Flintstones vitamins to survive. Some textures made/make me sick to the core (not to the point of vomiting). I wish children with ARFID stop getting labels such as \"picky\" and get the help they need. I FORGOT TO ADD TEENS AND ADULTS TOO",
  "url": "https://www.reddit.com/r/ARFID/comments/1j21tpw/i_wish_there_was_more_support_for_children_with/",
  "score": 120,
  "num_comments": 15,
  "comments": [
    {
      "id": "mfo8o18",
      "author": "wmdggur",
      "body": "I agree with you but i think it shouldn’t be just children but also teens and adults.",
      "created_utc": 1740950733.0,
      "score": 48,
      "context": []
    },
    {
      "id": "mfo9c35",
      "author": "xernpostz",
      "body": "teens and adults also deserve resources, but i agree children have it pretty bad. the poor education surrounding ARFID leads to too many parents brushing it off or force feeding their kids which actively makes things worse. also kids can be cruel, at times i was actively made fun of in my childhood for being frail/eating certain things \"weirdly\"",
      "created_utc": 1740950939.0,
      "score": 33,
      "context": []
    },
    {
      "id": "mfoc0vi",
      "author": "BrokenHeart1935",
      "body": "Sadly, there are very few support places or people for adults with ARFID. \nMy 41 year old wife has a severe case of it, but we can’t find care anywhere. \n\nThat being said, I get what you’re saying about maybe kids in other parts of the world.",
      "created_utc": 1740951762.0,
      "score": 20,
      "context": []
    },
    {
      "id": "mfoe21c",
      "author": "Dykeryy",
      "body": "Unfortunately the world views children as property rather than people, so there will likely be support/acceptance for adults with ARFID long before children.",
      "created_utc": 1740952381.0,
      "score": 18,
      "context": []
    },
    {
      "id": "mfoh47d",
      "author": "Slow_Saboteur",
      "body": "I still take flintstone vitamins to survive",
      "created_utc": 1740953333.0,
      "score": 9,
      "context": []
    },
    {
      "id": "mfpfpgw",
      "author": "ryniha",
      "body": "As the mom of a 7 year old with ARFID, I agree. There are no clinics or specialty services near us within a 3 hour radius who will work with him until he’s 10. His pediatrician is amazing and so are his dietitians but he’s on a 100% liquid diet and it’s hard. 😅",
      "created_utc": 1740964853.0,
      "score": 7,
      "context": []
    },
    {
      "id": "mfpitoe",
      "author": "slowly-rotting-dying",
      "body": "i actually was diagnosed with ARFID at 7, but the refeeding therapy that was done to me made it exponentially worse, traumatized me, and permanently wrecked my relationship with food, especially because my abusive parents would frequently beat me if i did not eat. I feel terrible that there are undiagnosed kids but im honestly not sure if its worth it to get diagnosed young until there are better methods of treating ARFID than just force feeding.",
      "created_utc": 1740965905.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mfqb2zn",
      "author": "doofykidforthewin",
      "body": "Agree. And also just that there was real effective help available. I'm fighting and losing this battle with my 5yr old. Professionals seem out of ideas too.",
      "created_utc": 1740976084.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mfomm8q",
      "author": "Ready-Outside-3491",
      "body": "I agree, I also feel like I read this exact same post wording and all a few days ago. Perhaps I dreamt it.",
      "created_utc": 1740955064.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mfosczb",
      "author": "isawolf123",
      "body": "Man the amount of health issues i wouldn’t have right now if i had seen a nutritionist as a kid 🤦🏽",
      "created_utc": 1740956914.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mfq8bm6",
      "author": "Spaced-Cowboy",
      "body": "I’m the support. I’m wholesome as fuck.",
      "created_utc": 1740974946.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mfsrdmq",
      "author": "booksncatsn",
      "body": "When my daughter  developed it ( sudden onset), we ended up in the emergency room because she was too scared to take her antibiotics after a month of symptoms. ( it took doctors way too long to prescribe them). I asked the emergency  Dr if there were any feeding clinics because  I was struggling to piece together therapy for her. He said there wasn't.  \n\nMonths later I was able to get a referral for a feeding clinic, and I made a point to let them know that there was not a lot of knowledge  of their clinic amongst doctors. Our family Dr did not know, the ER doctor did not know, and the GI Dr did not know. \n\nTherapy sooner would have helped a LOT.",
      "created_utc": 1741018231.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mfp7xnu",
      "author": "Kawichi",
      "body": "I edited them in ",
      "created_utc": 1740962181.0,
      "score": 2,
      "context": [
        {
          "id": "mfo9c35",
          "author": "xernpostz",
          "body": "teens and adults also deserve resources, but i agree children have it pretty bad. the poor education surrounding ARFID leads to too many parents brushing it off or force feeding their kids which actively makes things worse. also kids can be cruel, at times i was actively made fun of in my childhood for being frail/eating certain things \"weirdly\"",
          "created_utc": 1740950939.0
        }
      ]
    },
    {
      "id": "mfxpfsz",
      "author": "Annarasumanara-",
      "body": "Why is age 10 the minimum??",
      "created_utc": 1741081901.0,
      "score": 1,
      "context": [
        {
          "id": "mfpfpgw",
          "author": "ryniha",
          "body": "As the mom of a 7 year old with ARFID, I agree. There are no clinics or specialty services near us within a 3 hour radius who will work with him until he’s 10. His pediatrician is amazing and so are his dietitians but he’s on a 100% liquid diet and it’s hard. 😅",
          "created_utc": 1740964853.0
        }
      ]
    },
    {
      "id": "mfzmj5e",
      "author": "ryniha",
      "body": "I wish I knew. The Emily Program. Their closest facility to me is 1.5 hours away in Cleveland OH.. they won’t work with him until he’s 10. Their Atlanta location accepts 8 year olds.. but I live in Ohio so 😅🤦🏼‍♀️   They told me is was something to do with the logic center of the brain but if one location works with younger kids I don’t see why they all can’t.",
      "created_utc": 1741107691.0,
      "score": 1,
      "context": [
        {
          "id": "mfpfpgw",
          "author": "ryniha",
          "body": "As the mom of a 7 year old with ARFID, I agree. There are no clinics or specialty services near us within a 3 hour radius who will work with him until he’s 10. His pediatrician is amazing and so are his dietitians but he’s on a 100% liquid diet and it’s hard. 😅",
          "created_utc": 1740964853.0
        },
        {
          "id": "mfxpfsz",
          "author": "Annarasumanara-",
          "body": "Why is age 10 the minimum??",
          "created_utc": 1741081901.0
        }
      ]
    }
  ]
}