{
  "id": "1j2cz9m",
  "subreddit": "ARFID",
  "author": "None",
  "created_utc": 1740985521.0,
  "title": "I was told that having ARFID is insulting to the poor..",
  "selftext": "I’m sorry if this is a TW to anyone. I just need a place to vent about it. I was told by a close friend, that my ARFID is an insult to those who are “impoverished and starving” because they would be happy to have any food offered to them. Sadly this isn’t the first time I’ve been told things like this. I’ve also been made to feel like I’m “unappreciative of my wealth” simply because I have a hard time picking out things from the grocery store. How do I politely respond to snarky remarks like this? Or does anyone have any advice about what to say? Also I’m by no means “wealthy”.. not that that matters. Just wanted to clarify that. ",
  "url": "https://www.reddit.com/r/ARFID/comments/1j2cz9m/i_was_told_that_having_arfid_is_insulting_to_the/",
  "score": 342,
  "num_comments": 125,
  "comments": [
    {
      "id": "mfqwwcv",
      "author": "Perchance09",
      "body": "It's so weird how people act like those who are poor can't have disabilities, allergies, preferences, likes, and dislikes. They're human too. I personally believe it's actually insulting to the poor to insinuate that they don't have dislikes, preferences, or special needs just because they are financially weak. That's so dehumanising, at least in my view.",
      "created_utc": 1740987226.0,
      "score": 447,
      "context": []
    },
    {
      "id": "mfqufvu",
      "author": "40earthlikeplanets",
      "body": "I have ARFID and faced serious food insecurity before. I didn't become happy to have any food unfortunately. I just started eating only when safe foods were available, became malnourished and severely underweight. I'm so so thankful not to be in that situation anymore. But this disorder is not a choice. It doesn't only target those who have the means to be choosy",
      "created_utc": 1740985781.0,
      "score": 238,
      "context": []
    },
    {
      "id": "mfqw4mm",
      "author": "xernpostz",
      "body": "op ive lived in poverty my whole life and this is just a blatantly uneducated take. my mom tried to introduce me to a variety of foods growing up but it narrowed over the years regardless. i would've starved had she not provided my safe foods to me. and considering ive seen people here who are beginning to starve because they can no longer afford safe foods...arfid is clearly not a \"rich person problem\".",
      "created_utc": 1740986760.0,
      "score": 97,
      "context": []
    },
    {
      "id": "mfqvnqx",
      "author": "blackgirlwhiteboard",
      "body": "I just asked the poor & they said it's cool.",
      "created_utc": 1740986487.0,
      "score": 61,
      "context": []
    },
    {
      "id": "mfqutc9",
      "author": "skycotton",
      "body": "I mean I'm poor as shit and I'd rather starve than have food I didn't like. I've gone days without eating because of it. I've seen many similar stories, many much more extreme. I also grew up poor as shit. I don't think your friend fully understands that some people die from this. it's a disorder that doesn't go away just because you're desperate.",
      "created_utc": 1740985996.0,
      "score": 112,
      "context": []
    },
    {
      "id": "mfqvyq9",
      "author": "umadhatter_",
      "body": "While growing up, we were sometimes very poor and had very limited choices when it came to getting food. My ARFID did not care. In fact it made it worse because my mother couldn’t understand why I didn’t eat and pushed harder to get me to eat what she made, as not to waste food. We couldn’t afford to cater to my “pickiness”. \n\nUsing your money to help with your disability is not insulting the less fortunate. Ask them, would someone getting an electric wheelchair be an insult to a poorer person only being able to afford a manual wheelchair? Is it insulting for someone to get laser eye surgery when I can barely afford glasses?",
      "created_utc": 1740986665.0,
      "score": 48,
      "context": []
    },
    {
      "id": "mfr3t2t",
      "author": "Naejakire",
      "body": "\"By that logic, food allergies, eating disorders, and chronic illnesses are all ‘insults’ too. That’s not how medical conditions work. Arfid is a medical condition, not a preference or privilege\"",
      "created_utc": 1740991571.0,
      "score": 35,
      "context": []
    },
    {
      "id": "mfr10fq",
      "author": "CrazyCatLushie",
      "body": "I’m too disabled to work and as a result I live in abject poverty on government disability supports. I’m talking well below the poverty line, less than $15k a year in a place with high cost of living. Respectfully, I think your friend should let us poor people speak for ourselves; I certainly didn’t ask her to invalidate others’ experiences while coming to my defence!\n\nI *still* can’t eat things that aren’t “safe” even when I’m in the throes of a diabetic low and have no other options. ARFID isn’t a choice - it doesn’t care if you’re rich or poor and it certainly doesn’t require moral judgment.",
      "created_utc": 1740989757.0,
      "score": 26,
      "context": []
    },
    {
      "id": "mfr4din",
      "author": "Lunaspoona",
      "body": "I grew up being told that there's starving kids in Africa.\n\nI used to reply, well send it to them then. \n\nMe eating something I don't like isn't going to stop them from starving is it.",
      "created_utc": 1740991944.0,
      "score": 23,
      "context": []
    },
    {
      "id": "mfqx1z1",
      "author": "kohlphelie",
      "body": "I have ARFID and I've been poor. Your friend doesn't understand ARFID. I'll literally starve before eating something I am unable to eat.",
      "created_utc": 1740987321.0,
      "score": 19,
      "context": []
    },
    {
      "id": "mfqygr0",
      "author": "Leticia_the_bookworm",
      "body": "I'm very sorry, OP :/ I had a very religious aunt who said similar things all the time too. \"It's a sin to waste food God gives you\", \"what about all the homeless kids who dig the trash for food?\" and the like. She implied to my mother numerous times that, if she would just leave me hungry for a while, I'd end up eating anything. Yeah, no. I've gone hungry for a full day several times, as a very young child, and still couldn't eat my unsafe foods. People don't understand how fear-based disorders like ARFID or phobias work. I'd literally starve to death before doing it.\n\nYou have a real disorder that you did not choose to have. You are doing your best to take care of yourself within your means. Taking time to choose foods you can eat and buying more expensive items is NOT being dismissive of anyone. You are just trying to stay alive. I'm sorry you had to deal with this :/",
      "created_utc": 1740988182.0,
      "score": 15,
      "context": []
    },
    {
      "id": "mfra5x9",
      "author": "Angelangepange",
      "body": "What's insulting to the poor is the attitude \"baggers can't be choosers\".    \nOn top of the fact that people who are poor and have arfid do exist, people should also have the right to not eat something just because they are starving and the fact that people think it means you are not actually hungry is really perverse.   \n    \nThis attitude is so creepy.    \n     \nIt's all just an excuse to pretend that poverty is a personal failure instead of a situation that one finds themselves in because of society.",
      "created_utc": 1740995690.0,
      "score": 12,
      "context": []
    },
    {
      "id": "mfr5avb",
      "author": "First-Butterscotch-3",
      "body": "I've been starving and I have been starved and neither made me eat food I couldn't \n\nIgnore the idiot - it's east to do and will enrich your life",
      "created_utc": 1740992547.0,
      "score": 11,
      "context": []
    },
    {
      "id": "mfr5i1a",
      "author": "piefanart",
      "body": "thats funny cause ive never been anything but poor in my entire life, and most of my 'safe foods' are poor people food. like potatos and freezer meals. \n\n  \nas a kid i struggled with malnutrition which ultimately stunted my growth because i wouldnt eat most foods. we were on food stamps.",
      "created_utc": 1740992677.0,
      "score": 13,
      "context": []
    },
    {
      "id": "mfqz1cw",
      "author": "Long-Ad449",
      "body": "Just tell them to get fucked and move on with your day. ARFID is essentially a mental health issue, so it is what it is.",
      "created_utc": 1740988530.0,
      "score": 8,
      "context": []
    },
    {
      "id": "mfquw2w",
      "author": "everydaygremlin",
      "body": "yeah, no. they're wrong. not sure if there's really a polite way to respond to that, unfortunately. find some way to reverse it back at them, maybe?",
      "created_utc": 1740986040.0,
      "score": 25,
      "context": []
    },
    {
      "id": "mfr52yh",
      "author": "61114311536123511",
      "body": "Lol wtf. There's no response to that beyond \"fuck this\" and no longer engaging with that person. Just. Ew. Fucking pain Olympics bullshit.",
      "created_utc": 1740992404.0,
      "score": 7,
      "context": []
    },
    {
      "id": "mfrguqu",
      "author": "Scorpiodancer123",
      "body": "This person is an arsehole and not your friend.  Bet they wouldn't say that to a bulimic who's vomiting up \"good food.\"",
      "created_utc": 1740999813.0,
      "score": 7,
      "context": []
    },
    {
      "id": "mfscs09",
      "author": "black_flame919",
      "body": "I have a roommate with food insecurity trauma and they’ve made me feel soo ashamed about food waste. I already had a guilt complex about it but they’ve made it so much worse by pointing it out and drawing attention to it. The most egregious comment was when they said they couldn’t remember the last time they had the “”luxury”” of wasting food. I tried to impress upon them how much I literally can’t eat things and they tried to be like “well I can’t sometimes either but I force myself to” like… okay but I’ve literally been so stressed about eating I’ve had a functional (non-epileptic) seizure. Like, I have a disorder that converts stress into physical symptoms and I was so stressed about food waste I had a *seizure.* it’s not a fucking luxury I actually hate it so maybe shut the fuck up??",
      "created_utc": 1741013649.0,
      "score": 8,
      "context": []
    },
    {
      "id": "mfr6vpb",
      "author": "None",
      "body": "The one thing I found works is to bring it back to something they can understand a bit more, unfortunately this is an issue with their ignorance so it's difficult. I have had some success with \"would you say the same to someone with anorexia?\"",
      "created_utc": 1740993569.0,
      "score": 6,
      "context": []
    },
    {
      "id": "mfr9vfw",
      "author": "7-5NoHits",
      "body": "This drives me nuts when it comes up. One person eating a narrow range of things has zero impact on food security. Poverty and hunger are serious issues that need to be addressed. These issues are not going to be solved by people pathetically using them as a cover to insult people that annoy them.\n\nAlso I highly doubt this person would be willing to say, move into a much smaller or less comfortable house/apartment because \"poor people would be grateful to have any roof over their head.\" Point could apply to any other middle to upper class privilege.",
      "created_utc": 1740995504.0,
      "score": 6,
      "context": []
    },
    {
      "id": "mfrx49x",
      "author": "Euphemia-Alder",
      "body": "Something you could say, which is polite but gets the point across, is “what’s a weird/odd thing to say to someone.” Or if you want to be direct but still polite imo you could say something like “that’s ignorant/you’re ignorant/ (my personal favorite which is more snarky) your ignorance is showing.” \n\nFor context, I lived in my car during COVID, I’ve lived directly on the street (would go to different apartment complexes and sleep in the chairs by the pool), and couch surfed. I promise you, ARFID isn’t a wealthy privilege thing. Every person has their own journey with food. Ours just looks different from the norm and because of that people want to find fault and blame and shame us for it. \n\nIf this friend doesn’t come around after you tell them off politely or otherwise, I don’t think they’re really a friend",
      "created_utc": 1741007751.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mfs9g05",
      "author": "KittyKate10778",
      "body": "fun fact i get like $1500 in disablity $23 in food stamps and a $130 grocery gift card from my mental health group housnig that also takes $1039 of my check for \"cost of care\" aka rent. guess who still has arfid and can barely afford their groceries because they are so limited? me. guess who is probs going to have to pay out of pocket for eating disorder treatment despite my very limited income because medicare doesnt cover medical nutrition therapy and having medicaid as a secondary is a headache and a half? me. your friend can stfu and fuck off. idk if im \"poor\" but i sure as shit aint comfortable either. i put at least $100 in savings away each month because i want to move 3 hrs away from where i currently live and im probs going to have to use said savings to pay out of pocket for my eating disorder treatment. idk its not insulting to me. \n\nalso side note i feel like by saying its insulting ppl are implying that we chose to be picky that we choose to have a limited diet. you want to know where my arfid comes from? being autistic with sensory issues on top of having a fear of throwing up because i had a years worth of cyclical vomiting episodes before i got diagnosed with eosinophilic esophagitis. im terrified of getting sick and im terrified of bad sensory experiences which ended up with me being terrified of food. you know the thing we need to survive. like it doesnt matter how much wealth i have unless i get treatment im always going to be terrified of new foods because the root cause/fear isnt the food its getting sick/having a bad sensory experience and the only thing that wealth can change about that is getting treatment not the fear in and of itself",
      "created_utc": 1741012494.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mft7yn8",
      "author": "ezb_zeb",
      "body": "I would respond to these insensitive comments by saying that's not how poverty or medical conditions work and leave it at that. People saying this are wrong. Would they criticize someone with a gluten allergy in the same way?",
      "created_utc": 1741022942.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mfta6ii",
      "author": "Pretend-Ostrich-9602",
      "body": "That’s so funny because I literally HAVE ARFID BECAUSE i grew up poor and impoverished. A childhood of dumpster diving at times and living off of cheap junk food like frozen pizzas, fast food, spam, spaghettios. It made me develop a severe anxiety towards any food deemed gross or off putting in my brain. \n\nIt’s honestly kinda ironic cuz as someone who was poor it’s actually almost more insulting to insinuate that you should be grateful because there are people out there that would die to eat even the grossest of foods because no. It wasn’t a luxury. I wasnt grateful to be eating cold canned spaghettios every day. No one deserves to have to eat something they don’t enjoy. Not poor people, not wealthy people. It is not being selfish or greedy to not want to eat something that you know will make you feel sick… not for anybody.",
      "created_utc": 1741023585.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mfx3ey6",
      "author": "Akumu9K",
      "body": "Jeeez I guess my sensory issues from autism are an insult to deaf and blind people then I guess, thats such a fucking dumb thing to say ngl, your friend is being ableist.",
      "created_utc": 1741068705.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mfr0h1x",
      "author": "fruitysquidward",
      "body": "isnt any ED \"an insult to the poor\"? anorexics throw away food, bulimics binge eat and purge it, etc. ppl are just dicks honestly that was only said to u to try and make u feel like shit for a literal mental disorder. its not ur fault u have ARFID and anybody that malicious and close minded shouldnt be wasting ur time",
      "created_utc": 1740989421.0,
      "score": 7,
      "context": []
    },
    {
      "id": "mfre1p8",
      "author": "BeatnikMona",
      "body": "I grew up poor with ARFID. I’d wager that most of my safe foods are relatively cheap.",
      "created_utc": 1740998131.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mfs031i",
      "author": "R0da",
      "body": "Goddamn, even ignoring the stupid idea that poor people won't feel the effects of arfid because *they're just so hungy* 🥺-\n\nHow the fuck is having a disorder the same thing as expressing an offensive opinion???? \n\n*OH your asthma is so insulting to people who get stuck in high altitudes who would love to be breathing your dense air~*\n\nCome on. There's room in the world for more than one kind of struggle",
      "created_utc": 1741009015.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mftti5e",
      "author": "oliviaroseart",
      "body": "Asking me to eat something I cannot eat is like asking someone to eat a plastic cup: I don’t and have never viewed many foods as being edible. I have never tried to eat things that are not edible and I have been this way since I was an infant. It’s not a choice, but it’s also a lot more significant than being selective or having difficulty choosing foods. \n\nIn situations where I don’t have access to things that are edible for me, I cannot eat and have become dangerously underweight. If I had a gun to my head, I still couldn’t eat most things and have never tried to, literally not once. It’s not a good thing, it has serious negative consequences.\n\nI am surprised by how common it seems to be, I have never met anyone else with similar feelings towards food in my life. I hate to say that it does make me feel a little hesitant about how it being defined by other people or what is being diagnosed as ARFID. Even in online spaces, I have never really heard of anyone else who feels the same and I still don’t quite think I know if it is the same thing as whatever I was born with.",
      "created_utc": 1741029081.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mfudzmh",
      "author": "No-Marionberry-8278",
      "body": "This is horse shit. I’ve been below the poverty line my entire life and have struggled with Arfid my entire life. Your friend is 💩",
      "created_utc": 1741034901.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mfwoj2j",
      "author": "jorwyn",
      "body": "I grew up very poor and have ARFID. I bet there are things you'd happily give me I wouldn't have been able to eat no matter how hungry I was. \n\nThis sounds so much like my mom telling me all the time, \"There are children starving in Africa\" when she was trying to force me to eat things. Okay, so send the food to them? I'm not the one keeping them from having food!",
      "created_utc": 1741061797.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mg0ywkk",
      "author": "Preppy_Hippie",
      "body": "That’s literally as dumb as telling a kid to finish their meal “because there are starving kids in (add country here).” Basically they just recycled this idea because they are annoyed with you because they don’t understand and can’t relate to this problem. There’s really no talking to someone who thinks their experience is universal and the ultimate authority. FU is honesty the only valid response IMHO.",
      "created_utc": 1741121100.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mfra71b",
      "author": "CynicismNostalgia",
      "body": "I would say yes I'm aware, and I even recognise that I likely wouldn't have ARFID if I had grew up in an impoverished country, although I did grow up in 1st world poverty. \n\nThat being said, I know without a doubt that if I was dropped into a foreign country with no safe foods now,, with my ARFID fully established, I'd starve to death. \n\nWithout a doubt. I've mentioned this to a few friends who have broached the topic, they seem to get it. It's apples and oranges and not to be compared.",
      "created_utc": 1740995710.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mfrb6t1",
      "author": "Hanhula",
      "body": "Oh, they think a medical condition is offensive? Ask them if they think cancer sufferers are offensive to hairdressers, or if someone using a wheelchair is offensive to runners.\n\nThey're not a friend if they think badly of you. You aren't obligated to respond politely, and you shouldn't. Point out how offensive it is and walk away, for a more polite response.",
      "created_utc": 1740996343.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mfrbas0",
      "author": "Susim-the-Housecat",
      "body": "Starving it out doesn’t work with ARFIDs. That’s what makes it a disorder! When I was 7 I went on school camp for a week and didn’t eat at all, not even after I coughed up blood. I would have died before I ate toast that was a bit too pale. Because it’s literally not a choice.",
      "created_utc": 1740996412.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mfrblea",
      "author": "throwawaypatien",
      "body": "I hate it when people give the \"there are people out there far worse off than you\" argument for anything. \n\nLike, do they seriously think it's gonna help? It just makes me feel worse!",
      "created_utc": 1740996601.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mfrdjrc",
      "author": "tacticalcop",
      "body": "wait until they figure out i am the poor lol",
      "created_utc": 1740997819.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mfrdrxp",
      "author": "BisonNaive9771",
      "body": "I think when ppl say “a poor/improvished/hungry person would eat that food if offered” insinuates that the the person with ARFID is making a CHOICE to not eat that food. Which i think is really ignorant of what ARFID actually is and how intensely it affects ppl.",
      "created_utc": 1740997961.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mfrhdml",
      "author": "Jealous-Ant-6197",
      "body": "I lost 10 kilos when a few years ago because there was never food I could eat. The main reason I got one of the jobs I worked was just for food, because the little at home was not food I'd eat. So because of arfid and poverty, i found myself working 20hrs a week at in school during finals so I could eat",
      "created_utc": 1741000121.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mfrod0r",
      "author": "AetherDrew43",
      "body": "I'd happily give foods I don't like to poor people.",
      "created_utc": 1741003840.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mfruupx",
      "author": "lionessrampant25",
      "body": "I don’t have ARFID. It’s not a choice. I see that everyday with my kiddo. It’s not a choice. BUT he is so much happier (and mentally health) because I am giving him choice over his food.\n\nI’m very lucky we have a vitamin he will take and a chocolate milkshake I can get in him for lots of calories. If he ever loses foods again and starts losing weight there are gtube options over forcing him to eat food he just can’t get in his mouth without panic and sensory overload.\n\nThere are poor folks with ARFID too. Do not be ashamed. You have done nothing wrong. 💖",
      "created_utc": 1741006760.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mfry04f",
      "author": "boringlesbian",
      "body": "Shit, I was homeless and still had ARFID. I had to go to food banks, where you do not get to pick what they give you, in order to get food sometimes. I guess I was an insult to myself?\n\nAsk them if they would tell that to someone with anorexia or bulimia? Ask them why having an eating disorder is an insult to poor people but rich people not using their money to feed those poor people isn’t?",
      "created_utc": 1741008130.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mfsho8e",
      "author": "Known-Salamander-821",
      "body": "As someone who is the poor literally have gone weeks without food to pay rent whoever told you that has no idea what they are talking about. And probably has never experienced actual poverty to even have an understanding or valued opinion on the matter.",
      "created_utc": 1741015282.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mfsttkj",
      "author": "DenseAstronomer3631",
      "body": "Tell this to my son, he would starve, and I can tell you, yeah, it really sucks because he's more expensive to feed than the average kid, and I'm broke af. I, however, understand that my son will get dangerously dehydrated and refuse to eat if he doesn't have any safe foods/drinks around, so those become higher priorities. Luckily, he also loves toast and ramen",
      "created_utc": 1741018938.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mfsuhs3",
      "author": "runnawaycucumber",
      "body": "Ex poor person here, uh no? The fuck? I grew up below the poverty line, a 1$ can of spaghetti-o's was considered a luxury to me. Being poor didn't stop me from barfing anytime I was forced to eat something that I couldn't handle, being poor didn't cure my ARFID and being poor didn't mean that I appreciated the foods I had. If anything, growing up in poverty exasperated my symptoms even worse lmao. Your friend seriously sucks and you can tell them that they're very disliked by a complete stranger on the internet lmao",
      "created_utc": 1741019131.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mfsusrg",
      "author": "Speed_Plastic",
      "body": "I've been told things only the lines of this too and it's hurtful, I have been on the position where a food bank would have been a great thing to have gone to financially but I didn't want to waste 75% of a gift so I spent money I didn't have on food I would eat. \n\nMaybe try \"you know I heard that before and yet my medical condition needs more then guilt to be better\" \n\nPeople in general have assumptions about how the best way to live is, do what's best for you",
      "created_utc": 1741019217.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mfswhn8",
      "author": "isawolf123",
      "body": "This is like saying if someone was dyslexic, it’s an insult to all people who can’t read, just because they have dyslexia 🤦🏽",
      "created_utc": 1741019689.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mft6xyo",
      "author": "Taxouck",
      "body": "The amount of times my parents finger-wagged at me about starving kids in Africa when I was a kid and couldn't eat what was on my plate...",
      "created_utc": 1741022648.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mfztivn",
      "author": "Prometheus-is-vulcan",
      "body": "An interesting idea (not healthy, do not try) for those who can eat certain foods, but are unable to eat others would be to only have foods at home, that they cant eat and eat nothing else. \n\nHow many days of starving would it take until the survival instinct take over?\n\nWith the most repulsive (disgusting) foods, i guess i would need over a week. \n\n\nSo, yeah. Its not just being a \"picky eater\".",
      "created_utc": 1741109628.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mg2r5mz",
      "author": "PhilosopherTypical15",
      "body": "I wouldn’t call that a close friend. That’s kind of gaslighty.",
      "created_utc": 1741140756.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mfu88ey",
      "author": "Lil-Miss-Anthropy",
      "body": "Who do these people think they are 😂🤣 My habits have no bearing on other people's financial situation. Wtf? I'd ask them \"I'm glad you care about people living in poverty. So what have you done to help the poor recently?\" I bet you they're gonna get reeeal silent.",
      "created_utc": 1741033287.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mfu8d6y",
      "author": "Lil-Miss-Anthropy",
      "body": "These are the same kind of people who get mad about people getting abortions just because infertility exists",
      "created_utc": 1741033324.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mfupngq",
      "author": "lavenderbleudilly",
      "body": "There are “poor” folks who have arfid.",
      "created_utc": 1741038207.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mfrtd1p",
      "author": "madfrawgs",
      "body": "Your friend’s comments are misguided, but probably come from a place of uneducated concern.\n\nI’m not going to lie, I used something similar over the years to try to get our oldest kid to eat more variety (he’s 12 and only eats 3 brand specific foods), simply because I thought it was just picky eating. Once it was clear there’s something more to it, I started digging around to see what I could find, and found ARFID, several resources, and this community. Lurking here has given me SO MUCH understanding to what he’s going through, and it’s helped me as a parent not feel like a complete failure.\n\nThis is still a pretty newly-named-to -science diagnosis, a lot of dietitians and doctors are still unaware of it, your friend probably is too. Invite them to read some of the information you have about ARFID, and show them that this is a legitimate eating disorder, not just picky eating on a whim. If they still don’t get it, do give them some time. It took me a little while to come to terms with it, even through I now knew it wasn’t something he could control. If they STILL don’t leave it, I donno. Just limit contact when food is involved, or in general, I guess, so avoid unneeded stress for an already stressful disorder. I’m not saying unfriend them, just limit contact. Take care of yourself.",
      "created_utc": 1741006110.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mfrtvu2",
      "author": "Interesting-Error859",
      "body": "Omg can people start suggesting poor people will take whatever, beg, eat it even if it makes them sick like theyre a medieval peasant 😭😭",
      "created_utc": 1741006332.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mfseifa",
      "author": "SprintsAC",
      "body": "I'm so sorry. Imagine having that little amount of empathy that you try to trivialise an eating disorder this way.\n\n\n\nI wouldn't consider someone like this as a friend in all honesty.",
      "created_utc": 1741014233.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mfsjy0i",
      "author": "bblulz",
      "body": "i grew up with food insecurity and a “kitchen is closed” rule. i used to be so skinny bc i legitimately couldn’t keep down most of the food that was given to me. was given tiny portions to reduce waste but i couldn’t even eat those. i actually almost died when i was like 2 bc i wouldn’t eat",
      "created_utc": 1741016014.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mfsw02g",
      "author": "ConsistentSteak4915",
      "body": "Umm. Tell your dumb friend that your picking eating allows for poor and impoverished to have more food. Thats so illogical. I have found that most people that have questioned my food choices and anxieties over eating are generally those who have problems with eating too much. I personally believe it’s out of jealousy and insecurity on their part. It’s their problem not yours. They should focus more on themselves.",
      "created_utc": 1741019552.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mft3b5y",
      "author": "MyMoreOriginalName",
      "body": "No. Just no. I've lived in poverty all my life, I have lived through serious food insecurity as well, and I can tell you ARFID is none of those things And in fact, I'd argue that being poor only exacerbates my issues. Also this person is very much looking at ARFID as if it was just picky eating, which is something we get a lot, but isn't entirely true. in reality ARFID (and other eating disorders) are deeply rooted in multifaceted issues, from disability to trauma. To call it picky eating would be largely misrepresenting the truth. your friend needs to do a little more research and have a little more compassion because I don't think he fully understands what ARFID is and how it can show itself. Granted I think people misrepresent people with eating disorders in general. Not enough people are willing to educate themselves and delve into why we have these struggles.",
      "created_utc": 1741021614.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mftd24z",
      "author": "WaterFnord",
      "body": "Wild how anyone would even consider making this argument when their own privilege can be endlessly framed in similar ways. It’s so intellectually lazy I almost feel bad for them",
      "created_utc": 1741024416.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mfttqvl",
      "author": "ControlOk8832",
      "body": "Best to just ignore people who are like that since they’re losers and losers don’t deserve attention or they’re idiots who also don’t deserve attention",
      "created_utc": 1741029151.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mftw7jb",
      "author": "Gmschaafs",
      "body": "That’s news to me! I guess I’m insulting myself because I haven’t worked in a while and I’m god damn poor. Let me apologize to myself",
      "created_utc": 1741029864.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mfty5y4",
      "author": "crochetsweetie",
      "body": "that friend sounds like an idiot who doesn’t understand psychology or sociology, nor the current economy",
      "created_utc": 1741030424.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mfu0f8l",
      "author": "NoBalance1897",
      "body": "hey so this is definitely not a friend!! friends don’t ever try to make you feel bad about food preferences or things you struggle with personally. also find it very weird that OP’s friend is trying to put OP and poor people in some sort of competition. in no way OP is unappreciative of their financial stability just bc of food preferences due to ARFID. very sorry your “friend” made you feel bad about food, ik it can be very upsetting",
      "created_utc": 1741031071.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mfuk453",
      "author": "___disaster___",
      "body": "seriously???? \n\nmy favorite arfid-related joke recently is that it's good that I have a relapse bc at least I'm gonna be able to afford rent!",
      "created_utc": 1741036622.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mfuohzh",
      "author": "InsuranceInitial7726",
      "body": "I mean realistically if I was born in a 3rd world country with AFRID I’d probably be dead. So they aren’t wrong but I recognize my privilege with food availability in my country.",
      "created_utc": 1741037874.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mfuqw9d",
      "author": "closetgeekasaurus",
      "body": "Yeah, poor person with ARFID here- there have been days I’ve literally just gone without eating bc I can’t afford or have access to my safe food. Despite there being other food in the house, I can’t eat it. I’ll panic and cry and vomit before I can even try. People need to stop using this strawman logic as if poor people aren’t real people with their own diverse experiences and needs. \nYou having ARFID is not an insult to anyone impoverished. You have a health condition. Taking care of your health condition is not an insult to anyone, and to imply so is honestly kind of ableist, regardless of how “severe” the health condition is. Your friend needs to take step back and figure out why they feel the need to try and diminish you for something out of your control- especially when shame is the complete wrong approach to helping any mental health disorder, but especially ARFID.",
      "created_utc": 1741038565.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mfurtss",
      "author": "Whatever_you_say5",
      "body": "It absolutely demeaning to “the poor” to make statements like this, like we aren’t human enough to have disorders, preferences, dislikes, etc. The only “privilege” in your situation may be that you can afford safe foods whenever you need them. I’d say that ARFID is a real mental health disorder and you can’t choose to have or not have it if you are poor. Just like a poor person can’t choose if they are bipolar or not. I’d also say that it is dehumanizing to act like those who are poor are not capable of having likes and dislikes and would eat anything like a starving animal if given the chance",
      "created_utc": 1741038834.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mfut2o7",
      "author": "janetsnakehole319",
      "body": "I told a girl in high school that I was depressed and she said essentially the same thing. She kept talking about her boyfriend who had suffered from poverty and abuse and I was like ok I can't control my brain though?????",
      "created_utc": 1741039195.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mfuz673",
      "author": "SuddenAce",
      "body": "People shame others and do whatever they shamed people for without thinking about it. If it helps I grew up very poor, still have/had arfid since I was 5. Just do what’s best for you and realize that a lot of the time other peoples opinions don’t matter.",
      "created_utc": 1741041004.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mfvfcia",
      "author": "bunnylo",
      "body": "you can tell your friend that they shouldn’t be speaking about things they know nothing about. i’m poor. i’ve been in poverty for a good portion of my life, literally times I didn’t have money for food. i’ve ALWAYS had ARFID. the whole point of ARFID is you can be starving and still not willing to eat certain things. you unwillingly starve because it’s the safer option than whatever the unsafe food is. my husband and I joke about how if society crumbled and we were living in a post apocalyptic world, i’d be so fucked and basically could only eat like dry cereal because I will NOT eat canned beans.",
      "created_utc": 1741046165.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mfvnifl",
      "author": "Flowcomp",
      "body": "Your friend’s comment was incredibly hurtful and insensitive.   “Snarky” isn’t the right word.  It’s rude.\n\nYes, there are people in the world living in poverty.  There are people starving.   But…your diagnosis is *real*.   The challenges of living with ARFID are real.  Someone in life will always have things worse than you, but that’s no reason to minimize your experience!   \n\nHow do you respond to rudeness?   “What an interesting thing to say!”  And move on.\n\nHow will you respond to a friend that says such awful things to you?",
      "created_utc": 1741048845.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mfvu8ri",
      "author": "angemarval",
      "body": "I have ARFID and have starved, it’s possible to have ARFID while living in poverty. They’re projecting, they’re ignorant too.",
      "created_utc": 1741051077.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mfvukbo",
      "author": "angemarval",
      "body": "😢, so many of us live in poverty or/and with food insecurity 🫠🇺🇸",
      "created_utc": 1741051185.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mfvwnvr",
      "author": "Eve-7260",
      "body": "I’m low-income and I have ARFID lol ur good. I’m picky when I don’t have much options haha 😅😅😅",
      "created_utc": 1741051896.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mfw27yo",
      "author": "K0rra_22",
      "body": "Jesus! Unless you are actively throwing away food you buy then it’s not a problem. Even if you are you bought it! \n\nNow if it’s food other people offer you then it’s slightly more complicated. But if they can’t accept “No thank you” and “It’s disordered eating I can’t really control it” then they are crappy friends who wanna feel better than you.",
      "created_utc": 1741053778.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mfw3of6",
      "author": "Conscious-Studio8111",
      "body": "Hi. I grew up poor & abused! Ya know the whole deal; free lunch program kid, food withheld as punishment, and sharing a happy meal between parent & me for a whole day’s worth of meals. \n\nI would starve before I put certain foods in my body, and I didn’t care how little money we had for food. Or how few options we had. \n\nI still had AFRID then, still have it now. It’s stupid to assume that “being poor” and ARFID don’t have overlap.",
      "created_utc": 1741054276.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mfwkl0u",
      "author": "Dazzling-Okra-3346",
      "body": "1. Embrace the let them theory. People are going to think what they want. Sometimes you may change someone's mind, and sometimes you can't. Let it happen.\n2. This is a close friend? Is this friendship valuable to you? I would personally evaluate this friendship. I'm not saying stop being friends I'd just evaluate if your friend dismisses other important things you have going on.\n3. If this friend is someone you want to remain close to I would let them know that many people have ARFID. According to her logic those with ED's, whether it is binge eating, anorexia, bulimia, etc, then she is also calling those people selfish. I am aware that ARFID is not necessarily an ED, btw, still according to her reasoning that is what she is saying. Or she is simply refusing to believe people have this. \n4.  What would I say to a rude comment? I would tell them that they are just simply wrong and move on. You don't need to justify yourself to someone that isn't willing to listen to you first.",
      "created_utc": 1741060248.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mfwsk30",
      "author": "marzzyy__",
      "body": "lmfao I make less than 10k a year, wth does anyone’s income have to do with their disability 😭",
      "created_utc": 1741063494.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mfwso1i",
      "author": "GaydrianTheRainbow",
      "body": "I’m on disability and poor and have ARFID and it sucks, yes. I’m sure it also sucks for people with more money, as more money would Help with navigating ARFID but would by no means make it not suck. But like, poor people living below the poverty line can indeed also have ARFID and you aren’t insulting us by being less poor or even rich and having ARFID? That is a wild take.",
      "created_utc": 1741063543.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mfxtgf1",
      "author": "MsChateau",
      "body": "That doesn’t sound like a very good friend",
      "created_utc": 1741084330.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mfyfgts",
      "author": "krankity-krab",
      "body": "my mom always told me this growing up. i’m sorry, that’s so shitty.",
      "created_utc": 1741094598.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mfzcn0q",
      "author": "liz-faults",
      "body": "As someone who grew up poor no it's not i would of starved myself rather than eat certain foods and I did starve myself cause I couldn't muster a want for it.",
      "created_utc": 1741104986.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mfzzr4q",
      "author": "None",
      "body": "i am poor and have been struggling w buying food for a long time. i still can only buy my safe foods like…",
      "created_utc": 1741111346.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mg0l6zj",
      "author": "Jumpy-Bike4004",
      "body": "The amount of money my poor single mom self wastes on my autistic son’s ARFID choices is out of control lol he would 1000000% rather starve and die than eat something other than his safe foods…yet loves to play with food and have food in front of him. Every single night we make a peanut butter and jelly sandwich for him to fall asleep with… I try my best to eat it most nights, but that’s just one example. We have no wealth over here and ARFID costs us a whole lot of money. Lots and lots of practice foods for (daily) feeding therapy, too. It’s not like you’re doing what my son does. You buy only what you will eat, which is fantastic. I also spend a crap ton on things like beef liver capsules to hide in my son’s food. All of this to say, your friend doesn’t get it and shouldn’t make snarky remarks regarding things she doesn’t understand at all.",
      "created_utc": 1741117308.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mg0tsmq",
      "author": "plastickghost",
      "body": "hate to break it to your friend, but i’m currently homeless and have had to break down meals to one a day (sometimes not at all) due to financial hardship. i work 40 hours a week at a physically demanding job. if there’s food in front of me that i can’t do, i simply won’t eat it. my mental illness doesn’t change because of my financial status, as yours doesn’t change because of someone else’s either. take care of yourself and do what keeps you happy and healthy.",
      "created_utc": 1741119697.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mg21ao5",
      "author": "Lemongrab_01",
      "body": "I grew up in a low income household and I consider myself a picky easter (at this point as I don’t have a diagnosis) but I will not eat any food that i don’t like, i’ve been told “we are to poor for you to be picky” because i won’t eat it if i don’t want to try or don’t like it or any other following things that would make me reject it. The point is that everyone has limits to rejecting food despite income, plus it’s not like people who struggle with what food they do and don’t like choose to have the trait.",
      "created_utc": 1741132347.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mg2nuht",
      "author": "sliverofmasc",
      "body": "It's insulting that the food available at food banks and stuff aren't ARFID, dietary, allergen friendly at all.\n\nOr disabled friendly. You get a huge box of vegetables often that you have to chop up and prepare the day you get it or it goes bad.\n\nIt's horrible. They're so crucial, but like, they're doing \"healthy meals\" and crap, and meanwhile, I can't eat half of it.\n\nIt's usually close to expiry, or quick sale, or lots of food prep involved. \n\nSee, whoever is saying this to you thinks that ARFID is a *choice*.\n\nThat's like saying I'm choosing to have nausea and gastrointestinal pain if the food isn't correct, or no hunger response to a meal that should, in theory, be \"delicious\".\n\nOr choosing to be lactose intolerant 🙃 like who chooses that?",
      "created_utc": 1741139644.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mgezqym",
      "author": "FeelingEye9426",
      "body": " Have arfid and grew up in poverty. Actually it’s the main reason I struggle with arfid!",
      "created_utc": 1741302161.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mgiocod",
      "author": "CharleneParlene",
      "body": "I could be starving and still wouldn't eat what I wouldn't eat when I'm not starving. \n\nARFID ruins my life.",
      "created_utc": 1741359355.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mgpv9dm",
      "author": "General-State-334",
      "body": "I've been poor enough to get down to 85 lbs (from 115) and have to shoplift food and still couldn't manage to eat foods that weren't safe. \nThe just won't go down.  ",
      "created_utc": 1741456873.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mgxxynb",
      "author": "None",
      "body": "Tell her to let them eat cake :p\n\n\nI'm not sure if I have this disorder or not as just found out about it today (it could be OCD that I actually have) but I totally don't get how anyone can come to that conclusion. It's insane. ",
      "created_utc": 1741566016.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mrcwqqi",
      "author": "Wide_Archer_5823",
      "body": "Maybe tell then it's a DISORDER!!!!",
      "created_utc": 1746759231.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mfu0w6w",
      "author": "shitz_brickz",
      "body": "\"In honor of the poor who get sick from not eating, I'm going to eat food until I am sick\" really is not the message people think it is.",
      "created_utc": 1741031204.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mfu87cf",
      "author": "Clayr_Bayr",
      "body": "I know people who have trauma induced ARFID due to extreme food insecurity, so I’d say the opposite is true.\n\nI’m serious, apart from Autism and abuse, food insecurity trauma is one of the bigger causes of ARFID. Poverty is literally one of the causes.",
      "created_utc": 1741033278.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mftrk5m",
      "author": "None",
      "body": "The one and only Tipi I went to, invited by a friend, when I asked if it was okay to use a chair, the Elder Auntie told me that it was a bitch seat, implying that the weak willed use them. I looked straight at her and then turned away. I have a connective tissue disorder and chronic pain (along with arfid). I went and spoke with the Elder Uncle and he said it was okay to use a chair.\nI did not feel welcome as an outsider and I left immediately after we broke the circle in the morning.",
      "created_utc": 1741028521.0,
      "score": 0,
      "context": []
    },
    {
      "id": "mfu3lvx",
      "author": "Far-Application-858",
      "body": "You can tell them that poor people have AFRID too and explain about how hard it is to find safe foods especially when you’re poor. \n\n(I have ARFID and I’m poor)",
      "created_utc": 1741031974.0,
      "score": 0,
      "context": []
    },
    {
      "id": "mfqzv4v",
      "author": "None",
      "body": "THANK YOU!!!!",
      "created_utc": 1740989039.0,
      "score": 86,
      "context": [
        {
          "id": "mfqwwcv",
          "author": "Perchance09",
          "body": "It's so weird how people act like those who are poor can't have disabilities, allergies, preferences, likes, and dislikes. They're human too. I personally believe it's actually insulting to the poor to insinuate that they don't have dislikes, preferences, or special needs just because they are financially weak. That's so dehumanising, at least in my view.",
          "created_utc": 1740987226.0
        }
      ]
    },
    {
      "id": "mfr4cg0",
      "author": "Naejakire",
      "body": "Exactly.. It's as if they don't \"deserve\" to be able to manage their health issues, which is so fucked up. Poor people are human beings with likes, dislikes, allergies, health issues and everyone deserves to exist with dignity.",
      "created_utc": 1740991924.0,
      "score": 67,
      "context": [
        {
          "id": "mfqwwcv",
          "author": "Perchance09",
          "body": "It's so weird how people act like those who are poor can't have disabilities, allergies, preferences, likes, and dislikes. They're human too. I personally believe it's actually insulting to the poor to insinuate that they don't have dislikes, preferences, or special needs just because they are financially weak. That's so dehumanising, at least in my view.",
          "created_utc": 1740987226.0
        }
      ]
    },
    {
      "id": "mfrj27n",
      "author": "Commercial_Debt_6789",
      "body": "This. When I was using the food bank, I wasn't picking up items I didn't like.",
      "created_utc": 1741001081.0,
      "score": 60,
      "context": [
        {
          "id": "mfqwwcv",
          "author": "Perchance09",
          "body": "It's so weird how people act like those who are poor can't have disabilities, allergies, preferences, likes, and dislikes. They're human too. I personally believe it's actually insulting to the poor to insinuate that they don't have dislikes, preferences, or special needs just because they are financially weak. That's so dehumanising, at least in my view.",
          "created_utc": 1740987226.0
        }
      ]
    },
    {
      "id": "mftlzqu",
      "author": "Taurus420Spirit",
      "body": "I'm a poor, underweight/ malnourished person with ARFID, and it's not offensive. It's just silly for a person to say that to OP! \n\nThey need to get mad at the billionaires for wealth hoarding and making food expensive AF, not people with ARFID!",
      "created_utc": 1741026959.0,
      "score": 41,
      "context": [
        {
          "id": "mfqwwcv",
          "author": "Perchance09",
          "body": "It's so weird how people act like those who are poor can't have disabilities, allergies, preferences, likes, and dislikes. They're human too. I personally believe it's actually insulting to the poor to insinuate that they don't have dislikes, preferences, or special needs just because they are financially weak. That's so dehumanising, at least in my view.",
          "created_utc": 1740987226.0
        }
      ]
    },
    {
      "id": "mfy20l3",
      "author": "Long_Injury_2628",
      "body": "Seriously. I try to take food to the homeless people that just keep getting shuffled from place to place until a new “no loitering” sign appears and I always order it all plain but add condiments to the bag and I’ve had more than one remember me for that because there was something that they didn’t like or couldn’t tolerate on a sandwich etc that made it inedible for them.",
      "created_utc": 1741088974.0,
      "score": 3,
      "context": [
        {
          "id": "mfqwwcv",
          "author": "Perchance09",
          "body": "It's so weird how people act like those who are poor can't have disabilities, allergies, preferences, likes, and dislikes. They're human too. I personally believe it's actually insulting to the poor to insinuate that they don't have dislikes, preferences, or special needs just because they are financially weak. That's so dehumanising, at least in my view.",
          "created_utc": 1740987226.0
        }
      ]
    },
    {
      "id": "mg5vi66",
      "author": "Punkrabbit666",
      "body": "When I barely had any food I would still not eat it if not a safe food, it’s just worst for poor people",
      "created_utc": 1741189681.0,
      "score": 1,
      "context": [
        {
          "id": "mfqwwcv",
          "author": "Perchance09",
          "body": "It's so weird how people act like those who are poor can't have disabilities, allergies, preferences, likes, and dislikes. They're human too. I personally believe it's actually insulting to the poor to insinuate that they don't have dislikes, preferences, or special needs just because they are financially weak. That's so dehumanising, at least in my view.",
          "created_utc": 1740987226.0
        }
      ]
    },
    {
      "id": "mfs0rqi",
      "author": "Kawichi",
      "body": "100th upvote",
      "created_utc": 1741009299.0,
      "score": 0,
      "context": [
        {
          "id": "mfqwwcv",
          "author": "Perchance09",
          "body": "It's so weird how people act like those who are poor can't have disabilities, allergies, preferences, likes, and dislikes. They're human too. I personally believe it's actually insulting to the poor to insinuate that they don't have dislikes, preferences, or special needs just because they are financially weak. That's so dehumanising, at least in my view.",
          "created_utc": 1740987226.0
        }
      ]
    },
    {
      "id": "mfse1va",
      "author": "Named_users",
      "body": "Same here. I lived on ramen noodles as a kid. Sure my mom cooked a big meal once a month when she got her food stamps and before she sold the rest but I would be sitting there gagging and begging for ramen. I now keep so much food in the house for my kids - all the snacks, home cooked meals, packed lunches. I still have to have ramen for dinner while my kids eat what I cooked sometimes",
      "created_utc": 1741014077.0,
      "score": 25,
      "context": [
        {
          "id": "mfqufvu",
          "author": "40earthlikeplanets",
          "body": "I have ARFID and faced serious food insecurity before. I didn't become happy to have any food unfortunately. I just started eating only when safe foods were available, became malnourished and severely underweight. I'm so so thankful not to be in that situation anymore. But this disorder is not a choice. It doesn't only target those who have the means to be choosy",
          "created_utc": 1740985781.0
        }
      ]
    },
    {
      "id": "mfr0ad7",
      "author": "fruitysquidward",
      "body": "LMAOOO",
      "created_utc": 1740989305.0,
      "score": 14,
      "context": [
        {
          "id": "mfqvnqx",
          "author": "blackgirlwhiteboard",
          "body": "I just asked the poor & they said it's cool.",
          "created_utc": 1740986487.0
        }
      ]
    },
    {
      "id": "mfsv2zh",
      "author": "runnawaycucumber",
      "body": "This \\^\\^\\^ I'll refuse beef, pork or bell peppers even if it's between life and death for me because they're trigger foods and I legit CANNOT FORCE MYSELF TO EAT THEM, financial insecurity doesn't negate a mental health or physical health disorder/diagnosis",
      "created_utc": 1741019296.0,
      "score": 11,
      "context": [
        {
          "id": "mfqutc9",
          "author": "skycotton",
          "body": "I mean I'm poor as shit and I'd rather starve than have food I didn't like. I've gone days without eating because of it. I've seen many similar stories, many much more extreme. I also grew up poor as shit. I don't think your friend fully understands that some people die from this. it's a disorder that doesn't go away just because you're desperate.",
          "created_utc": 1740985996.0
        }
      ]
    },
    {
      "id": "mg3dfck",
      "author": "heartoffiction",
      "body": "My boyfriend is extremely understanding and supportive of me having this disorder but the other day I mentioned how I’d starve if I was in a survival situation because I wouldn’t eat the food if I was desperate and he got really serious and freaked out about how much that scared him- he’d never realized that’s how bad it is and that’s how it works",
      "created_utc": 1741148429.0,
      "score": 2,
      "context": [
        {
          "id": "mfqutc9",
          "author": "skycotton",
          "body": "I mean I'm poor as shit and I'd rather starve than have food I didn't like. I've gone days without eating because of it. I've seen many similar stories, many much more extreme. I also grew up poor as shit. I don't think your friend fully understands that some people die from this. it's a disorder that doesn't go away just because you're desperate.",
          "created_utc": 1740985996.0
        }
      ]
    },
    {
      "id": "mfs40gz",
      "author": "RamblingRose63",
      "body": "This",
      "created_utc": 1741010554.0,
      "score": 5,
      "context": [
        {
          "id": "mfqvyq9",
          "author": "umadhatter_",
          "body": "While growing up, we were sometimes very poor and had very limited choices when it came to getting food. My ARFID did not care. In fact it made it worse because my mother couldn’t understand why I didn’t eat and pushed harder to get me to eat what she made, as not to waste food. We couldn’t afford to cater to my “pickiness”. \n\nUsing your money to help with your disability is not insulting the less fortunate. Ask them, would someone getting an electric wheelchair be an insult to a poorer person only being able to afford a manual wheelchair? Is it insulting for someone to get laser eye surgery when I can barely afford glasses?",
          "created_utc": 1740986665.0
        }
      ]
    },
    {
      "id": "mfr44at",
      "author": "Naejakire",
      "body": "Also, I've been poor or in situations where I didn't have safe food and I had to starve in some instances. Does anyone want to starve? No. It's not a choice. If it were a choice, I'd LOVE to be able to eat what's available to me. For example - outdoor school in 6th grade. I literally collapsed because there were no safe foods and we were there for 5 days. 5 days of no eating and being super active. Finally, they found me a cup of fruit cocktail and I ate that. It's not easy and I'd gamble that people with ARFID have a higher chance of starving than a typical person. Poor people have options still if they're resourceful.. Imagine being homeless AND having ARFID where someone hands you a sandwich you can't eat. It would just be an added challenge. It's NOT a choice.",
      "created_utc": 1740991774.0,
      "score": 18,
      "context": [
        {
          "id": "mfr3t2t",
          "author": "Naejakire",
          "body": "\"By that logic, food allergies, eating disorders, and chronic illnesses are all ‘insults’ too. That’s not how medical conditions work. Arfid is a medical condition, not a preference or privilege\"",
          "created_utc": 1740991571.0
        }
      ]
    },
    {
      "id": "mfxokid",
      "author": "Annarasumanara-",
      "body": "As an african child, I approve this message lol.",
      "created_utc": 1741081384.0,
      "score": 5,
      "context": [
        {
          "id": "mfr4din",
          "author": "Lunaspoona",
          "body": "I grew up being told that there's starving kids in Africa.\n\nI used to reply, well send it to them then. \n\nMe eating something I don't like isn't going to stop them from starving is it.",
          "created_utc": 1740991944.0
        }
      ]
    },
    {
      "id": "mftin4w",
      "author": "Autismsaurus",
      "body": "If you put your food in the trash, then the kids who dig through the trash can eat it, and everybody wins!",
      "created_utc": 1741026011.0,
      "score": 4,
      "context": [
        {
          "id": "mfqygr0",
          "author": "Leticia_the_bookworm",
          "body": "I'm very sorry, OP :/ I had a very religious aunt who said similar things all the time too. \"It's a sin to waste food God gives you\", \"what about all the homeless kids who dig the trash for food?\" and the like. She implied to my mother numerous times that, if she would just leave me hungry for a while, I'd end up eating anything. Yeah, no. I've gone hungry for a full day several times, as a very young child, and still couldn't eat my unsafe foods. People don't understand how fear-based disorders like ARFID or phobias work. I'd literally starve to death before doing it.\n\nYou have a real disorder that you did not choose to have. You are doing your best to take care of yourself within your means. Taking time to choose foods you can eat and buying more expensive items is NOT being dismissive of anyone. You are just trying to stay alive. I'm sorry you had to deal with this :/",
          "created_utc": 1740988182.0
        }
      ]
    },
    {
      "id": "mfxotk1",
      "author": "Annarasumanara-",
      "body": "Ooh the sleeping in pool chairs thing is smart! ",
      "created_utc": 1741081536.0,
      "score": 2,
      "context": [
        {
          "id": "mfrx49x",
          "author": "Euphemia-Alder",
          "body": "Something you could say, which is polite but gets the point across, is “what’s a weird/odd thing to say to someone.” Or if you want to be direct but still polite imo you could say something like “that’s ignorant/you’re ignorant/ (my personal favorite which is more snarky) your ignorance is showing.” \n\nFor context, I lived in my car during COVID, I’ve lived directly on the street (would go to different apartment complexes and sleep in the chairs by the pool), and couch surfed. I promise you, ARFID isn’t a wealthy privilege thing. Every person has their own journey with food. Ours just looks different from the norm and because of that people want to find fault and blame and shame us for it. \n\nIf this friend doesn’t come around after you tell them off politely or otherwise, I don’t think they’re really a friend",
          "created_utc": 1741007751.0
        }
      ]
    },
    {
      "id": "mg3p9sh",
      "author": "Nearby-Bat6663",
      "body": "Honestly probably. Just say you're a little sensitive and your body won't learn to process it if you aren't exposed to it or that it's all in your head. I'm lactose intolerant (obviously not the same but an expensive inconvenience) and I have had people tell me I need to drink more lactose so my body will adjust. None of them in a medical profession of course",
      "created_utc": 1741153442.0,
      "score": 2,
      "context": [
        {
          "id": "mft7yn8",
          "author": "ezb_zeb",
          "body": "I would respond to these insensitive comments by saying that's not how poverty or medical conditions work and leave it at that. People saying this are wrong. Would they criticize someone with a gluten allergy in the same way?",
          "created_utc": 1741022942.0
        }
      ]
    },
    {
      "id": "mfurbxp",
      "author": "closetgeekasaurus",
      "body": "This is exactly how I’ve explained it to other people before. My brain just simply doesn’t view most foods as edible/food. It’s impossible for me to eat it, no matter how hungry I am",
      "created_utc": 1741038690.0,
      "score": 3,
      "context": [
        {
          "id": "mftti5e",
          "author": "oliviaroseart",
          "body": "Asking me to eat something I cannot eat is like asking someone to eat a plastic cup: I don’t and have never viewed many foods as being edible. I have never tried to eat things that are not edible and I have been this way since I was an infant. It’s not a choice, but it’s also a lot more significant than being selective or having difficulty choosing foods. \n\nIn situations where I don’t have access to things that are edible for me, I cannot eat and have become dangerously underweight. If I had a gun to my head, I still couldn’t eat most things and have never tried to, literally not once. It’s not a good thing, it has serious negative consequences.\n\nI am surprised by how common it seems to be, I have never met anyone else with similar feelings towards food in my life. I hate to say that it does make me feel a little hesitant about how it being defined by other people or what is being diagnosed as ARFID. Even in online spaces, I have never really heard of anyone else who feels the same and I still don’t quite think I know if it is the same thing as whatever I was born with.",
          "created_utc": 1741029081.0
        }
      ]
    },
    {
      "id": "mfusdfh",
      "author": "Whatever_you_say5",
      "body": "It’s giving the people who throw half eaten bagels out the car to houseless people thinking that means something",
      "created_utc": 1741038993.0,
      "score": 1,
      "context": [
        {
          "id": "mfurtss",
          "author": "Whatever_you_say5",
          "body": "It absolutely demeaning to “the poor” to make statements like this, like we aren’t human enough to have disorders, preferences, dislikes, etc. The only “privilege” in your situation may be that you can afford safe foods whenever you need them. I’d say that ARFID is a real mental health disorder and you can’t choose to have or not have it if you are poor. Just like a poor person can’t choose if they are bipolar or not. I’d also say that it is dehumanizing to act like those who are poor are not capable of having likes and dislikes and would eat anything like a starving animal if given the chance",
          "created_utc": 1741038834.0
        }
      ]
    },
    {
      "id": "mfzzu3u",
      "author": "None",
      "body": "which tend to be more expensive and make me poorer.",
      "created_utc": 1741111370.0,
      "score": 1,
      "context": [
        {
          "id": "mfzzr4q",
          "author": "None",
          "body": "i am poor and have been struggling w buying food for a long time. i still can only buy my safe foods like…",
          "created_utc": 1741111346.0
        }
      ]
    },
    {
      "id": "mfrq5e1",
      "author": "Sconebad",
      "body": "Also, it’s not like foods that we eat are typically expensive in any way. I could eat ramen noodles all day everyday for pennies.",
      "created_utc": 1741004693.0,
      "score": 58,
      "context": [
        {
          "id": "mfqwwcv",
          "author": "Perchance09",
          "body": "It's so weird how people act like those who are poor can't have disabilities, allergies, preferences, likes, and dislikes. They're human too. I personally believe it's actually insulting to the poor to insinuate that they don't have dislikes, preferences, or special needs just because they are financially weak. That's so dehumanising, at least in my view.",
          "created_utc": 1740987226.0
        },
        {
          "id": "mfqzv4v",
          "author": "None",
          "body": "THANK YOU!!!!",
          "created_utc": 1740989039.0
        }
      ]
    },
    {
      "id": "mfrul31",
      "author": "Oribeun",
      "body": "I wish you could have that choice here.\nMy ex-girlfriend was in need of using a food bank, and I often went with her to pick it up and thus see what the offered food was.\nHere you just get a couple of bags, around two with drie foods like pasta, rice etc. Then a third bag with either meat, fish (vegetarian) or halal, and a fourth bag with vegetables.\nIt always heavily varied what the options were that week and I noticed so much food that wasn't eaten or just kept gathering dust in a cupboard without using it.\n\nA bit had to do with compatibility. There would, for example, be a huge, plain block of tofu, but nothing accompanied with it to make an actual dish out of it. The same went for meal packages but no ingredients to make that meal.\nIf people were able to choose, then there wouldn't be so much left over, and the people who did find a use for it would be able to have an extra portion.",
      "created_utc": 1741006642.0,
      "score": 25,
      "context": [
        {
          "id": "mfqwwcv",
          "author": "Perchance09",
          "body": "It's so weird how people act like those who are poor can't have disabilities, allergies, preferences, likes, and dislikes. They're human too. I personally believe it's actually insulting to the poor to insinuate that they don't have dislikes, preferences, or special needs just because they are financially weak. That's so dehumanising, at least in my view.",
          "created_utc": 1740987226.0
        },
        {
          "id": "mfrj27n",
          "author": "Commercial_Debt_6789",
          "body": "This. When I was using the food bank, I wasn't picking up items I didn't like.",
          "created_utc": 1741001081.0
        }
      ]
    },
    {
      "id": "mfz2qi8",
      "author": "Euphemia-Alder",
      "body": "Gotta do whatcha gotta do! But thanks! Being a teen and homeless leads to finding creative ways to sleep. But you have to be careful because a lot of complexes have security or people will call the cops. So never the same place twice in a week don’t let it become a pattern :)",
      "created_utc": 1741102214.0,
      "score": 1,
      "context": [
        {
          "id": "mfrx49x",
          "author": "Euphemia-Alder",
          "body": "Something you could say, which is polite but gets the point across, is “what’s a weird/odd thing to say to someone.” Or if you want to be direct but still polite imo you could say something like “that’s ignorant/you’re ignorant/ (my personal favorite which is more snarky) your ignorance is showing.” \n\nFor context, I lived in my car during COVID, I’ve lived directly on the street (would go to different apartment complexes and sleep in the chairs by the pool), and couch surfed. I promise you, ARFID isn’t a wealthy privilege thing. Every person has their own journey with food. Ours just looks different from the norm and because of that people want to find fault and blame and shame us for it. \n\nIf this friend doesn’t come around after you tell them off politely or otherwise, I don’t think they’re really a friend",
          "created_utc": 1741007751.0
        },
        {
          "id": "mfxotk1",
          "author": "Annarasumanara-",
          "body": "Ooh the sleeping in pool chairs thing is smart! ",
          "created_utc": 1741081536.0
        }
      ]
    },
    {
      "id": "mfv749i",
      "author": "oliviaroseart",
      "body": "Does it affect a lot of foods for you? And has it always been that way? I don’t really know why I can’t eat most foods but it is like very, very deeply ingrained. Just as one example, I have never even tried any form of meat (red meat, poultry, pork, fish, etc) in my entire life and my parents are not vegetarian. Not just that, it’s most foods but that entire food group has never computed as food. (I’m 37 so I don’t think I will grow out of it haha)",
      "created_utc": 1741043467.0,
      "score": 1,
      "context": [
        {
          "id": "mftti5e",
          "author": "oliviaroseart",
          "body": "Asking me to eat something I cannot eat is like asking someone to eat a plastic cup: I don’t and have never viewed many foods as being edible. I have never tried to eat things that are not edible and I have been this way since I was an infant. It’s not a choice, but it’s also a lot more significant than being selective or having difficulty choosing foods. \n\nIn situations where I don’t have access to things that are edible for me, I cannot eat and have become dangerously underweight. If I had a gun to my head, I still couldn’t eat most things and have never tried to, literally not once. It’s not a good thing, it has serious negative consequences.\n\nI am surprised by how common it seems to be, I have never met anyone else with similar feelings towards food in my life. I hate to say that it does make me feel a little hesitant about how it being defined by other people or what is being diagnosed as ARFID. Even in online spaces, I have never really heard of anyone else who feels the same and I still don’t quite think I know if it is the same thing as whatever I was born with.",
          "created_utc": 1741029081.0
        },
        {
          "id": "mfurbxp",
          "author": "closetgeekasaurus",
          "body": "This is exactly how I’ve explained it to other people before. My brain just simply doesn’t view most foods as edible/food. It’s impossible for me to eat it, no matter how hungry I am",
          "created_utc": 1741038690.0
        }
      ]
    },
    {
      "id": "mfv881h",
      "author": "oliviaroseart",
      "body": "I just have never come across anyone else in life who has felt similarly, and it is something that you kinda are forced to explain a lot to others so it’s just strange that it seems like a lot of people experience it? I don’t think I’d even heard of other people having a similar thing until very recently (on Reddit really). Not suggesting that it’s not possible, it’s a relief in some ways. I wish I had known when I was younger that I wasn’t alone.\n\nEdit for grammar/clarity",
      "created_utc": 1741043823.0,
      "score": 1,
      "context": [
        {
          "id": "mftti5e",
          "author": "oliviaroseart",
          "body": "Asking me to eat something I cannot eat is like asking someone to eat a plastic cup: I don’t and have never viewed many foods as being edible. I have never tried to eat things that are not edible and I have been this way since I was an infant. It’s not a choice, but it’s also a lot more significant than being selective or having difficulty choosing foods. \n\nIn situations where I don’t have access to things that are edible for me, I cannot eat and have become dangerously underweight. If I had a gun to my head, I still couldn’t eat most things and have never tried to, literally not once. It’s not a good thing, it has serious negative consequences.\n\nI am surprised by how common it seems to be, I have never met anyone else with similar feelings towards food in my life. I hate to say that it does make me feel a little hesitant about how it being defined by other people or what is being diagnosed as ARFID. Even in online spaces, I have never really heard of anyone else who feels the same and I still don’t quite think I know if it is the same thing as whatever I was born with.",
          "created_utc": 1741029081.0
        },
        {
          "id": "mfurbxp",
          "author": "closetgeekasaurus",
          "body": "This is exactly how I’ve explained it to other people before. My brain just simply doesn’t view most foods as edible/food. It’s impossible for me to eat it, no matter how hungry I am",
          "created_utc": 1741038690.0
        }
      ]
    },
    {
      "id": "mg3e6qt",
      "author": "Annarasumanara-",
      "body": "I hope I never have to use this, but if I do I will be forever be blessing you for this idea! ❤️",
      "created_utc": 1741148721.0,
      "score": 2,
      "context": [
        {
          "id": "mfrx49x",
          "author": "Euphemia-Alder",
          "body": "Something you could say, which is polite but gets the point across, is “what’s a weird/odd thing to say to someone.” Or if you want to be direct but still polite imo you could say something like “that’s ignorant/you’re ignorant/ (my personal favorite which is more snarky) your ignorance is showing.” \n\nFor context, I lived in my car during COVID, I’ve lived directly on the street (would go to different apartment complexes and sleep in the chairs by the pool), and couch surfed. I promise you, ARFID isn’t a wealthy privilege thing. Every person has their own journey with food. Ours just looks different from the norm and because of that people want to find fault and blame and shame us for it. \n\nIf this friend doesn’t come around after you tell them off politely or otherwise, I don’t think they’re really a friend",
          "created_utc": 1741007751.0
        },
        {
          "id": "mfxotk1",
          "author": "Annarasumanara-",
          "body": "Ooh the sleeping in pool chairs thing is smart! ",
          "created_utc": 1741081536.0
        },
        {
          "id": "mfz2qi8",
          "author": "Euphemia-Alder",
          "body": "Gotta do whatcha gotta do! But thanks! Being a teen and homeless leads to finding creative ways to sleep. But you have to be careful because a lot of complexes have security or people will call the cops. So never the same place twice in a week don’t let it become a pattern :)",
          "created_utc": 1741102214.0
        }
      ]
    },
    {
      "id": "mg7dlt5",
      "author": "Euphemia-Alder",
      "body": "Same! Hope you sincerely never need it. But you gotta do what you gotta do. Glad to have helped anyone in this situation! ♥️",
      "created_utc": 1741204851.0,
      "score": 2,
      "context": [
        {
          "id": "mfrx49x",
          "author": "Euphemia-Alder",
          "body": "Something you could say, which is polite but gets the point across, is “what’s a weird/odd thing to say to someone.” Or if you want to be direct but still polite imo you could say something like “that’s ignorant/you’re ignorant/ (my personal favorite which is more snarky) your ignorance is showing.” \n\nFor context, I lived in my car during COVID, I’ve lived directly on the street (would go to different apartment complexes and sleep in the chairs by the pool), and couch surfed. I promise you, ARFID isn’t a wealthy privilege thing. Every person has their own journey with food. Ours just looks different from the norm and because of that people want to find fault and blame and shame us for it. \n\nIf this friend doesn’t come around after you tell them off politely or otherwise, I don’t think they’re really a friend",
          "created_utc": 1741007751.0
        },
        {
          "id": "mfxotk1",
          "author": "Annarasumanara-",
          "body": "Ooh the sleeping in pool chairs thing is smart! ",
          "created_utc": 1741081536.0
        },
        {
          "id": "mfz2qi8",
          "author": "Euphemia-Alder",
          "body": "Gotta do whatcha gotta do! But thanks! Being a teen and homeless leads to finding creative ways to sleep. But you have to be careful because a lot of complexes have security or people will call the cops. So never the same place twice in a week don’t let it become a pattern :)",
          "created_utc": 1741102214.0
        },
        {
          "id": "mg3e6qt",
          "author": "Annarasumanara-",
          "body": "I hope I never have to use this, but if I do I will be forever be blessing you for this idea! ❤️",
          "created_utc": 1741148721.0
        }
      ]
    }
  ]
}