{
  "id": "1j3j0n7",
  "subreddit": "ARFID",
  "author": "Additional_Bread_861",
  "created_utc": 1741116048.0,
  "title": "The “You know, there are starving people in other countries” guilt trip.",
  "selftext": "I grew up with this guilt trip, big time, and it wasn’t until very recently that I discovered ARFID exists across different populations. Because healthcare isn’t as accessible in developing nations, there isn’t good data on how often it occurs. \n\nBut we do know it exacerbates existing malnutrition, and in young children is considered “failure to thrive” in other cultures. So next time someone tries this with you, remember that it’s not some purely “first world problem”. It exists across many cultures, and often impacts them more severely than food-secure countries.  ",
  "url": "https://www.reddit.com/r/ARFID/comments/1j3j0n7/the_you_know_there_are_starving_people_in_other/",
  "score": 228,
  "num_comments": 21,
  "comments": [
    {
      "id": "mg0jz96",
      "author": "Rabbid0Luigi",
      "body": "People say that like if I ate the (insert here food I don't like) then children in Africa would magically get food. Not wasting food is much more about not buying more than you need and not putting more than you can eat on your plate than just eat whatever because some people wish they could have it",
      "created_utc": 1741116968.0,
      "score": 111,
      "context": []
    },
    {
      "id": "mg0ny3j",
      "author": "ifmwwihobahb",
      "body": "Ever since I was a kid. It sort of sounds dehumanizing to the ‘starving kids in Africa’ anyway. Oh yeah? If you’re so worried then go help them instead of using them as an argument against an eating disorder I couldn’t just stop myself from having. Seriously.",
      "created_utc": 1741118070.0,
      "score": 69,
      "context": []
    },
    {
      "id": "mg0qcjz",
      "author": "Gaymer7437",
      "body": "Would my dad gave me that BS as a child I told him that instead of buying me food I won't eat he should donate to causes helping children in Africa get food If he's so concerned about it.",
      "created_utc": 1741118737.0,
      "score": 26,
      "context": []
    },
    {
      "id": "mg0y84n",
      "author": "xernpostz",
      "body": "this comment is almost always a savior complex. sure janet, me eating my food in a capitalist developed country is going to help the starving kids in africa. it's a false equivalency and makes 0 fucking sense.",
      "created_utc": 1741120918.0,
      "score": 24,
      "context": []
    },
    {
      "id": "mg119oq",
      "author": "PompyPom",
      "body": "I tell them I already donate as much as I can to various charities and provide food/goods to food banks. If they’re so concerned about starving kids they can do the same.",
      "created_utc": 1741121753.0,
      "score": 9,
      "context": []
    },
    {
      "id": "mg3pfxp",
      "author": "rats0nvenus",
      "body": "As if kids in Africa don’t… also experience arfid? Because they’re literally humans- why are people so stupid and think if you go to a third world country they don’t experience what we do too??",
      "created_utc": 1741153522.0,
      "score": 7,
      "context": []
    },
    {
      "id": "mg54vlo",
      "author": "fearless-ivy",
      "body": "I’m Brazilian - there are starving children right across the street, no need to think about Africa. Truth is, there are plenty of starving children (and adults) all around the world. You finishing or not finishing your plate won’t grant any of them a meal, and that argument is just straight up stupid. The person that says that is clearly trying to embarrass you, so try your best to embarrass them back. “Oh, I know there are starving children in Africa, I always donate to actionaid. What have you been doing to help?”",
      "created_utc": 1741181063.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mg1ltln",
      "author": "Homrabsexual",
      "body": "I’ve only had this said to me once by my father and my response was putting said food into an envelope(I was 4). He just sighed and let me leave the table",
      "created_utc": 1741127537.0,
      "score": 9,
      "context": []
    },
    {
      "id": "mg2ojce",
      "author": "MagnoliaEvergreen",
      "body": "My response to that is always something like \"OK, so go give this to them if you're that concerned\"",
      "created_utc": 1741139874.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mg4g0o1",
      "author": "Angelangepange",
      "body": "Funny how they think this comment will make you eat. Do you think the starving kids will be happy to know I gorged myself to the point of feeling sick instead of just sharing with them?",
      "created_utc": 1741168797.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mg5eiul",
      "author": "JelloOfLife",
      "body": "“Well maybe you should stop bothering me and go make them food they actually want instead of wasting food you knew I wouldn’t want here.”",
      "created_utc": 1741184447.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mg5xjef",
      "author": "SleepySleepersn",
      "body": "people tried to guilt me with this and I think I'm just too neurodivergent for that lol I'd just think \"okay? why are u wasting this food on me then?\" lmao",
      "created_utc": 1741190267.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mg96tl3",
      "author": "Fluffaykitties",
      "body": "I used to say “well send it to the kids in Africa then!” and my mom would get so pissed lol.",
      "created_utc": 1741224868.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mg3wvx0",
      "author": "buggiesmile",
      "body": "Mom used this to get me to eat quinoa. I still fucking hate quinoa.",
      "created_utc": 1741157292.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mg7lyeq",
      "author": "AllStitchedTogether",
      "body": "I've never understood that point. There are literally starving people in our own country too. But my inability to eat this broccoli isn't going to change that fact. I just don't buy broccoli  now.",
      "created_utc": 1741207158.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mg7ui8e",
      "author": "hajisaurus",
      "body": "Th argument is so dumb. The person who made food no one is going to eat is the one who made the mistake here, not the person who won’t be guilt tripped into eating it. The availability of food here doesn’t impact food insecurity two continents away.",
      "created_utc": 1741209511.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mg81jf4",
      "author": "Sure-Lecture-2542",
      "body": "This is so, so dumb. We can’t all be the hero of every issue. \nAll the people who don’t have an eating disorder can worry about that problem. FFS",
      "created_utc": 1741211429.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mg9hltq",
      "author": "Rinny-ThePooh",
      "body": "I do this to myself now, I have to remind myself if I end up eating too much I won’t get any nutrients anyways. And I highly doubt the malnourished children in third world countries want me to force feed myself 😭",
      "created_utc": 1741228599.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mgb47zb",
      "author": "SPinc1",
      "body": "Personally I always took it as a, \"I need to be grateful about the food I have\". It does one well to look beneath you at those who have way, way less than you, be thankful and try to be better each day. Arfid sucks, but we are above it.",
      "created_utc": 1741257574.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mh14wk6",
      "author": "Leather-Hovercraft61",
      "body": "A coworker said this once to me in our cafeteria. He said think about the starving people in India. Another coworker, from India, sat next to us. Coworker 2 was so upset and layed into coworker 1. It was hilarious.",
      "created_utc": 1741618789.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mg0o87p",
      "author": "ifmwwihobahb",
      "body": "Besides, there are impoverished families starving in practically every country. There are children starving a neighborhood away. It always struck me as idiotic",
      "created_utc": 1741118147.0,
      "score": 32,
      "context": [
        {
          "id": "mg0ny3j",
          "author": "ifmwwihobahb",
          "body": "Ever since I was a kid. It sort of sounds dehumanizing to the ‘starving kids in Africa’ anyway. Oh yeah? If you’re so worried then go help them instead of using them as an argument against an eating disorder I couldn’t just stop myself from having. Seriously.",
          "created_utc": 1741118070.0
        }
      ]
    }
  ]
}