{
  "id": "1j61apf",
  "subreddit": "ARFID",
  "author": "ColdAd2606",
  "created_utc": 1741384194.0,
  "title": "Will doctors allow me a feeding tube?",
  "selftext": "F 5'3 and 74 pound) I'm at the point were I'm begining to feel my body fail me. Im struggling now to think at all, I have severe insomnia and I also struggle at night to move or lift my blanket. I'm struggling to carry everyday things suddenly that anyone can handle and my muscles seem to struggle reacting when I want to move them like my joints are paralyzed to obey with the rest of my body. The last time I visited my doctor they told me my pulse was pretty low.\n\n My visions blurry often and I swear constantly or freeze up constantly. I feel so horrible all the time now. I feel too weak to go downstairs even. I don't do my hobbies anymore, I can't do my college assignments, and I can't feel my own feelings or process anything around me from how decade my mind is at this point and my kidneys and chest hurt often now especially at night. \n\nI asked my parents if I could get a feeding tube and insulted me saying they won't give some random person a feeding tube without a good reason. My experience with a lot of doctors make me feel like I'm being ignored too which proves their point. I can't move forward. \n\n(I have an appointment for a nutritionist and also a swallow study but everything is taking so long... I don't get to see a nutritionist for another 5 weeks.)",
  "url": "https://www.reddit.com/r/ARFID/comments/1j61apf/will_doctors_allow_me_a_feeding_tube/",
  "score": 109,
  "num_comments": 41,
  "comments": [
    {
      "id": "mgl4hdv",
      "author": "Jaded-Banana6205",
      "body": "You need to go to the ER.\n\nETA: you have a severe eating disorder and your body is shutting down. Chances are very high you'd need to be supervised with an NGT and IV for nourishment. You need serious,,specialized medical and psychiatric help. I know several people with ARFID who have long term feeding tubes. But you won't last 5 weeks for the nutritionist. The fact that your doctors are unconcerned by your weight is alarming.",
      "created_utc": 1741385657.0,
      "score": 312,
      "context": []
    },
    {
      "id": "mglqrvw",
      "author": "SylviaPellicore",
      "body": "You need immediate medical attention. The way your body is feeling right now is a sign your organs may starting to shut down. Please go to the emergency department. If your parents won’t take you, call 911 or your local equivalent. \n\nYou can’t wait 5 weeks.\n\nI’m sorry that your parents and doctors aren’t taking you seriously.",
      "created_utc": 1741393083.0,
      "score": 134,
      "context": []
    },
    {
      "id": "mglrs5l",
      "author": "WillingAnxiety",
      "body": "Go to the ER. Immediately. I'm so sorry your parents and doctors haven't been helping. They've all failed you and you need to force someone to help you. The ER is your best bet right now.",
      "created_utc": 1741393431.0,
      "score": 85,
      "context": []
    },
    {
      "id": "mglv5mv",
      "author": "JustbyLlama",
      "body": "OP, you need to go to the hospital. You need to tell them what is going on. You need to tell them your background on your relationship with your parents and you need to do it now. I’m very concerned for you based on your post history.",
      "created_utc": 1741394600.0,
      "score": 57,
      "context": []
    },
    {
      "id": "mglvaz4",
      "author": "sh115",
      "body": "OP please go to the ER immediately. Or if you don’t want to do that and you’re in college, go to whatever sort of urgent care center is available through your college health services. \n\nGiven your weight/height and the symptoms you’re describing, there is a decent chance that you’re not eating enough to keep your heart functioning properly. Depending on what food you’re eating and how much, you could be at risk of a sudden cardiovascular event (a common cause of death in people who pass away from eating disorders) or your organs could start shutting down due to malnutrition. I don’t want to scare you, but you genuinely could die if you don’t get help soon. It’s possible that your body/heart will hold out until you have your appointment with a nutritionist, but it’s also possible that your body will not make it until then. It’s better to be safe than sorry, so given the risks you should go to the ER now to get your heart checked rather than taking the chance of waiting. \n\nWhen you get to the ER, you can explain that you’ve been struggling to eat or to maintain your weight, and that you’re very weak and your heart feels weird. They’ll be able to take it from there. Make sure you describe your symptoms fully and give honest answers to any questions they ask. You can also explain that you truly want to eat and gain weight, but you haven’t been able to. \n\nIf your situation is severe enough, the doctors may very well give you a feeding tube at least until you’re stabilized. Or they might be able to give you nutritional shakes or some other meal replacement that you’re able to tolerate enough to subsist on for now. If your situation isn’t as bad as I’m fearing, then they can explain that and tell you that you’re safe to wait until your nutritionist appointment. Either way, it’s better to seek help now.",
      "created_utc": 1741394652.0,
      "score": 53,
      "context": []
    },
    {
      "id": "mgm9d5p",
      "author": "Hanhula",
      "body": "Please go to the hospital immediately. Do you have a way to get there? You need IMMEDIATE help.\n\nETA: We talked on a post of yours a week ago. You have rapidly gotten worse since then. Your parents are abusive and irrelevant to you; if it were up to them, they'd be burying you and claiming it's your fault.\n\nGo to the hospital. Now.",
      "created_utc": 1741399665.0,
      "score": 37,
      "context": []
    },
    {
      "id": "mglweim",
      "author": "laziestmarxist",
      "body": "Go to the ER now. Call 911 yourself, do not let your parents talk you out of going. Your eating disorder has become severe and they are abusing you by denying the severity. Get to the ER asap",
      "created_utc": 1741395034.0,
      "score": 39,
      "context": []
    },
    {
      "id": "mgm2f47",
      "author": "Ok-Marsupial-9897",
      "body": "With love, you have correctly identified that you need medical help, but speculation on what exactly a doctor may do is likely increasing your fear. You can you this and you know your body, make a game plan to get to an ER.",
      "created_utc": 1741397166.0,
      "score": 30,
      "context": []
    },
    {
      "id": "mgm48i5",
      "author": "Meronnade",
      "body": "Please listen to people telling you to go to the er. Call emergency if necessary.\n\nYou need help and your parents are horrible people.",
      "created_utc": 1741397814.0,
      "score": 26,
      "context": []
    },
    {
      "id": "mgmfu0j",
      "author": "Fluffaykitties",
      "body": "Reddit cannot help you anymore. Go to the emergency room. Call the emergency services to your house and have them take you, not your parents.",
      "created_utc": 1741402065.0,
      "score": 26,
      "context": []
    },
    {
      "id": "mgmsoke",
      "author": "Feeling-Disaster7180",
      "body": "Your parents are right that doctors won’t just give someone a feeding tube, but they WILL give YOU one because your body is literally shutting down from malnutrition. You’ll be put on IV fluids and very carefully given meal supplement drinks/feeds, and likely hooked up to telemetry to monitor your heart and vital signs. \n\nYour weight alone would be a concern for doctors. I can guarantee you that you will be taken seriously. You’re objectively unwell. Please go to the ED or call your local emergency number for an ambulance. *Do not drive yourself*. \n\nI’m a nurse and my ward often has people with eating disorders with NGTs pass through while they stabilise after going through what you are and/or they’re refusing to eat or are purging. It’s not something to take likely. I’ve seen a young woman with a similar height and weight as you who had to be hooked up to all the monitors with hourly obs instead of the normal 4 hourly because she was at risk of refeeding syndrome. I’m not saying this to scare you, but so you realise how serious this is. \n\nIt’s *always* better to be safe than sorry.",
      "created_utc": 1741407197.0,
      "score": 22,
      "context": []
    },
    {
      "id": "mgniaql",
      "author": "buggiesmile",
      "body": "I’m going to be as blunt as possible, you are dying. Go to a hospital. I’m hoping to God that you listened to the other people in this thread and have already gone to one. Do not ask for permission first, if you have no way to take yourself, call an ambulance. Your life is worth any cost to save it.",
      "created_utc": 1741420546.0,
      "score": 21,
      "context": []
    },
    {
      "id": "mgngsvv",
      "author": "badgernextdoor",
      "body": "Go to the hospital, I have been EXACTLY where you're at (same height and 72lbs) and I DID go into feeding syndrome. I ended up in the hospital for a month and they gave me IV nutrition via a PICC line and a feeding tube. I don't remember my first week there, I was so incredibly sick. I almost died. Please please please go to the hospital, your body needs more help than you or anyone around you can give and death is knocking at your doorstep. \n\nPlease update us if you can💚",
      "created_utc": 1741419642.0,
      "score": 14,
      "context": []
    },
    {
      "id": "mgn58kp",
      "author": "bluehairbaddie",
      "body": "Please please go to the ER. I have a feeding tube (gtube) for my arfid and I wasn't even that bad off. You most likely need to be admitted and watched for refeeding syndrome. You are malnurished. You're body is giving out. I'm not trying to scare you. I'm trying to let you know the seriousness of this situation. Please go get the help you need. F what your parents say get help 🫶🫶",
      "created_utc": 1741413124.0,
      "score": 9,
      "context": []
    },
    {
      "id": "mgo5bp0",
      "author": "SoManyMysteries",
      "body": "OP,  your body is shutting down.  You need to be hospitalized ASAP.  Shame on the people around you for ignoring just how serious your case is. I don't need to tell you that your body is starving and what comes next because you seem to be acutely aware of how this may end if you don't seek medical intervention before your heart and organs begin to fail. My heart aches for you. I'm terrified for you. I don't want you to die. \nI don't know where you are located, but this hospital has been recommended to me by several different doctors, therapists, and my nutritionist. It's in Denver, Colorado. It's ED specialized inpatient care unit within a hospital, and it's covered by most medical insurance policies.  You can find it at www.acute.org   \nThey do have an air ambulance service that's covered by insurance, which could get you from your local hospital to Denver Health.",
      "created_utc": 1741434768.0,
      "score": 9,
      "context": []
    },
    {
      "id": "mgp01lu",
      "author": "BakuDaLoo",
      "body": "Please say that you went in and got some help.",
      "created_utc": 1741447210.0,
      "score": 7,
      "context": []
    },
    {
      "id": "mgqhft0",
      "author": "Itscatpicstime",
      "body": "I’ve had a feeding tube twice, TPN three times, you need to be tubed immediately. Go to the ER and tell them everything, do not sugar coat it. You need to be admitted for long term care. Your life depends on it at this point.",
      "created_utc": 1741463775.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mgp1ogm",
      "author": "Background-Ring2936",
      "body": "you'll be in my thoughts, op. i know how horrible this all feels. you are super strong, and i believe you can voice yourself to go get proper help. give updates if possible🖤",
      "created_utc": 1741447745.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mgqjop3",
      "author": "ItAintEzBeinGreen",
      "body": "Thinking of you OP, and glad you posted here. Doctors can be extremely dismissive about this. I’ve seen it firsthand. Go to the best hospital you can in your area and ask them to help. You’ve got this.",
      "created_utc": 1741464502.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mgxrebf",
      "author": "Fantastic_Price2199",
      "body": "when i went to treatment i was around 130 (im 5’11 and my “stabilized weight is closer to 160) and even at that weight i almost had to go on a feeding tube. i highly suggest going to the ER as soon as possible - your feelings and experience is VALID. don’t listen to your parents. it seems like they have no idea how much you’re truly suffering.",
      "created_utc": 1741563753.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mgmr3sq",
      "author": "Legitimate-Produce-1",
      "body": "GO TO THE HOSPITAL. YOU ARE AN ADULT.",
      "created_utc": 1741406521.0,
      "score": -2,
      "context": []
    },
    {
      "id": "mgm5rpw",
      "author": "plastickghost",
      "body": "this. i’ve known people in online communities who complained about feeling awful one day and never got the chance to update everyone on how things went at the DR. i highly doubt any form of qualified medical professional will see/hear ab OPs condition and send them on their way. you are 74lbs, THAT is reason enough to get tubed. please please please go get seen!!! they are there to help you, and you can always request a different one if you end up seeing a nurse who may not fully understand why it’s hard to eat. most of them just want you healthy!",
      "created_utc": 1741398367.0,
      "score": 80,
      "context": [
        {
          "id": "mgl4hdv",
          "author": "Jaded-Banana6205",
          "body": "You need to go to the ER.\n\nETA: you have a severe eating disorder and your body is shutting down. Chances are very high you'd need to be supervised with an NGT and IV for nourishment. You need serious,,specialized medical and psychiatric help. I know several people with ARFID who have long term feeding tubes. But you won't last 5 weeks for the nutritionist. The fact that your doctors are unconcerned by your weight is alarming.",
          "created_utc": 1741385657.0
        }
      ]
    },
    {
      "id": "mgmbzmo",
      "author": "haydesigner",
      "body": "And if you can’t get to the ER, then **call 911 now!**",
      "created_utc": 1741400624.0,
      "score": 41,
      "context": [
        {
          "id": "mgl4hdv",
          "author": "Jaded-Banana6205",
          "body": "You need to go to the ER.\n\nETA: you have a severe eating disorder and your body is shutting down. Chances are very high you'd need to be supervised with an NGT and IV for nourishment. You need serious,,specialized medical and psychiatric help. I know several people with ARFID who have long term feeding tubes. But you won't last 5 weeks for the nutritionist. The fact that your doctors are unconcerned by your weight is alarming.",
          "created_utc": 1741385657.0
        }
      ]
    },
    {
      "id": "mgmrsjs",
      "author": "Feeling-Disaster7180",
      "body": "*call your local emergency number",
      "created_utc": 1741406813.0,
      "score": 16,
      "context": [
        {
          "id": "mglweim",
          "author": "laziestmarxist",
          "body": "Go to the ER now. Call 911 yourself, do not let your parents talk you out of going. Your eating disorder has become severe and they are abusing you by denying the severity. Get to the ER asap",
          "created_utc": 1741395034.0
        }
      ]
    },
    {
      "id": "ms5n4du",
      "author": "Just_A_Warrior",
      "body": "Do you have to not be eating anything at all whatsoever for several days/weeks to get refeeding syndrome,? Or can it also happen if you have just not been eating a lot for a long time such as months (nearly a year), and have a very irregular eating schedule with about one max two meals a day for weeks/months now, which sometimes is as big as a massive Chinese hotpot, other times the size of about one sandwich per day. Not eating regularly at all, but there’s still some intake of carbs every day, even though not much,.",
      "created_utc": 1747168910.0,
      "score": 1,
      "context": [
        {
          "id": "mgmsoke",
          "author": "Feeling-Disaster7180",
          "body": "Your parents are right that doctors won’t just give someone a feeding tube, but they WILL give YOU one because your body is literally shutting down from malnutrition. You’ll be put on IV fluids and very carefully given meal supplement drinks/feeds, and likely hooked up to telemetry to monitor your heart and vital signs. \n\nYour weight alone would be a concern for doctors. I can guarantee you that you will be taken seriously. You’re objectively unwell. Please go to the ED or call your local emergency number for an ambulance. *Do not drive yourself*. \n\nI’m a nurse and my ward often has people with eating disorders with NGTs pass through while they stabilise after going through what you are and/or they’re refusing to eat or are purging. It’s not something to take likely. I’ve seen a young woman with a similar height and weight as you who had to be hooked up to all the monitors with hourly obs instead of the normal 4 hourly because she was at risk of refeeding syndrome. I’m not saying this to scare you, but so you realise how serious this is. \n\nIt’s *always* better to be safe than sorry.",
          "created_utc": 1741407197.0
        }
      ]
    },
    {
      "id": "mgo7lir",
      "author": "hayzilla",
      "body": "I am saying prayers for OP to get help & also so proud of you internet stranger for getting help when you needed it. I hope you are doing well in your recovery 🩷",
      "created_utc": 1741435964.0,
      "score": 8,
      "context": [
        {
          "id": "mgngsvv",
          "author": "badgernextdoor",
          "body": "Go to the hospital, I have been EXACTLY where you're at (same height and 72lbs) and I DID go into feeding syndrome. I ended up in the hospital for a month and they gave me IV nutrition via a PICC line and a feeding tube. I don't remember my first week there, I was so incredibly sick. I almost died. Please please please go to the hospital, your body needs more help than you or anyone around you can give and death is knocking at your doorstep. \n\nPlease update us if you can💚",
          "created_utc": 1741419642.0
        }
      ]
    },
    {
      "id": "ms5npst",
      "author": "Just_A_Warrior",
      "body": "How did you feel when you had refeeding syndrome,?",
      "created_utc": 1747169085.0,
      "score": 1,
      "context": [
        {
          "id": "mgngsvv",
          "author": "badgernextdoor",
          "body": "Go to the hospital, I have been EXACTLY where you're at (same height and 72lbs) and I DID go into feeding syndrome. I ended up in the hospital for a month and they gave me IV nutrition via a PICC line and a feeding tube. I don't remember my first week there, I was so incredibly sick. I almost died. Please please please go to the hospital, your body needs more help than you or anyone around you can give and death is knocking at your doorstep. \n\nPlease update us if you can💚",
          "created_utc": 1741419642.0
        }
      ]
    },
    {
      "id": "ms5okhj",
      "author": "Just_A_Warrior",
      "body": "How can you tell when the heart and other organs begin to fail,?",
      "created_utc": 1747169331.0,
      "score": 1,
      "context": [
        {
          "id": "mgo5bp0",
          "author": "SoManyMysteries",
          "body": "OP,  your body is shutting down.  You need to be hospitalized ASAP.  Shame on the people around you for ignoring just how serious your case is. I don't need to tell you that your body is starving and what comes next because you seem to be acutely aware of how this may end if you don't seek medical intervention before your heart and organs begin to fail. My heart aches for you. I'm terrified for you. I don't want you to die. \nI don't know where you are located, but this hospital has been recommended to me by several different doctors, therapists, and my nutritionist. It's in Denver, Colorado. It's ED specialized inpatient care unit within a hospital, and it's covered by most medical insurance policies.  You can find it at www.acute.org   \nThey do have an air ambulance service that's covered by insurance, which could get you from your local hospital to Denver Health.",
          "created_utc": 1741434768.0
        }
      ]
    },
    {
      "id": "ms5pcps",
      "author": "Just_A_Warrior",
      "body": "Why can they be so dismissive when it’s such a life-threatening dangerous health issue,?",
      "created_utc": 1747169558.0,
      "score": 1,
      "context": [
        {
          "id": "mgqjop3",
          "author": "ItAintEzBeinGreen",
          "body": "Thinking of you OP, and glad you posted here. Doctors can be extremely dismissive about this. I’ve seen it firsthand. Go to the best hospital you can in your area and ask them to help. You’ve got this.",
          "created_utc": 1741464502.0
        }
      ]
    },
    {
      "id": "mgovu1g",
      "author": "hungo_bungo",
      "body": "OP might be disabled so regardless of age they might need assistance getting there.",
      "created_utc": 1741445802.0,
      "score": 6,
      "context": [
        {
          "id": "mgmr3sq",
          "author": "Legitimate-Produce-1",
          "body": "GO TO THE HOSPITAL. YOU ARE AN ADULT.",
          "created_utc": 1741406521.0
        }
      ]
    },
    {
      "id": "mgowl9j",
      "author": "SoManyMysteries",
      "body": "It's not necessary to YELL at her.",
      "created_utc": 1741446061.0,
      "score": 7,
      "context": [
        {
          "id": "mgmr3sq",
          "author": "Legitimate-Produce-1",
          "body": "GO TO THE HOSPITAL. YOU ARE AN ADULT.",
          "created_utc": 1741406521.0
        }
      ]
    },
    {
      "id": "mgomklf",
      "author": "allgespraeche",
      "body": "That weight scared me honestly. I am only a little taller then they are (5\"4) and my grandma was already concerned for me when I was 45kg during covid (99lbs).  Now I am between 114 and 117 (52-53kg) always and healthy. Hearing they are 74lbs already scared me, thinking about kg and realising it is 33kg-holy shit. Emergency room like yesterday. Feeding tube like yesterday. That weight will kill them, and if it doesn't cause long term health problems. Maybe lifelong.\n\n\nOP, this isn't just feeing weak, this isn't something to wait on longer. Your body will destroy itself trying to keep you alive and is probably already doing so. Your body is eating away at everything it can, using all fat, using all muscle. It WILL start to break down even your heart. It will slow and at some point pretty much shut off your organs. I know it isn't your fault to have AFRID but you need help ASAP because you are literally standing in your grave with one foot at this point.",
      "created_utc": 1741442455.0,
      "score": 23,
      "context": [
        {
          "id": "mgl4hdv",
          "author": "Jaded-Banana6205",
          "body": "You need to go to the ER.\n\nETA: you have a severe eating disorder and your body is shutting down. Chances are very high you'd need to be supervised with an NGT and IV for nourishment. You need serious,,specialized medical and psychiatric help. I know several people with ARFID who have long term feeding tubes. But you won't last 5 weeks for the nutritionist. The fact that your doctors are unconcerned by your weight is alarming.",
          "created_utc": 1741385657.0
        },
        {
          "id": "mgm5rpw",
          "author": "plastickghost",
          "body": "this. i’ve known people in online communities who complained about feeling awful one day and never got the chance to update everyone on how things went at the DR. i highly doubt any form of qualified medical professional will see/hear ab OPs condition and send them on their way. you are 74lbs, THAT is reason enough to get tubed. please please please go get seen!!! they are there to help you, and you can always request a different one if you end up seeing a nurse who may not fully understand why it’s hard to eat. most of them just want you healthy!",
          "created_utc": 1741398367.0
        }
      ]
    },
    {
      "id": "mgmhq2a",
      "author": "jastity",
      "body": "(Or the emergency number in your country)",
      "created_utc": 1741402778.0,
      "score": 31,
      "context": [
        {
          "id": "mgl4hdv",
          "author": "Jaded-Banana6205",
          "body": "You need to go to the ER.\n\nETA: you have a severe eating disorder and your body is shutting down. Chances are very high you'd need to be supervised with an NGT and IV for nourishment. You need serious,,specialized medical and psychiatric help. I know several people with ARFID who have long term feeding tubes. But you won't last 5 weeks for the nutritionist. The fact that your doctors are unconcerned by your weight is alarming.",
          "created_utc": 1741385657.0
        },
        {
          "id": "mgmbzmo",
          "author": "haydesigner",
          "body": "And if you can’t get to the ER, then **call 911 now!**",
          "created_utc": 1741400624.0
        }
      ]
    },
    {
      "id": "msdqbw8",
      "author": "Feeling-Disaster7180",
      "body": "I’m definitely no expert, but my understanding is that you’re at risk of refeeding syndrome if you’re badly malnourished and/or have lost quite a bit of weight recently, so suddenly eating “normally” kind of shocks your body",
      "created_utc": 1747275175.0,
      "score": 1,
      "context": [
        {
          "id": "mgmsoke",
          "author": "Feeling-Disaster7180",
          "body": "Your parents are right that doctors won’t just give someone a feeding tube, but they WILL give YOU one because your body is literally shutting down from malnutrition. You’ll be put on IV fluids and very carefully given meal supplement drinks/feeds, and likely hooked up to telemetry to monitor your heart and vital signs. \n\nYour weight alone would be a concern for doctors. I can guarantee you that you will be taken seriously. You’re objectively unwell. Please go to the ED or call your local emergency number for an ambulance. *Do not drive yourself*. \n\nI’m a nurse and my ward often has people with eating disorders with NGTs pass through while they stabilise after going through what you are and/or they’re refusing to eat or are purging. It’s not something to take likely. I’ve seen a young woman with a similar height and weight as you who had to be hooked up to all the monitors with hourly obs instead of the normal 4 hourly because she was at risk of refeeding syndrome. I’m not saying this to scare you, but so you realise how serious this is. \n\nIt’s *always* better to be safe than sorry.",
          "created_utc": 1741407197.0
        },
        {
          "id": "ms5n4du",
          "author": "Just_A_Warrior",
          "body": "Do you have to not be eating anything at all whatsoever for several days/weeks to get refeeding syndrome,? Or can it also happen if you have just not been eating a lot for a long time such as months (nearly a year), and have a very irregular eating schedule with about one max two meals a day for weeks/months now, which sometimes is as big as a massive Chinese hotpot, other times the size of about one sandwich per day. Not eating regularly at all, but there’s still some intake of carbs every day, even though not much,.",
          "created_utc": 1747168910.0
        }
      ]
    },
    {
      "id": "mgsdcl3",
      "author": "badgernextdoor",
      "body": "Thank you internet stranger, I wish I could take more credit but my mom literally flew from Washington to Hawaii to force me into the hospital when she saw my lab work come back so terribly. She also caught my refeeding syndrome (career ER nurse, my mom). She saved my life. 💕💕 I am doing much much better now, thank you!!",
      "created_utc": 1741487139.0,
      "score": 3,
      "context": [
        {
          "id": "mgngsvv",
          "author": "badgernextdoor",
          "body": "Go to the hospital, I have been EXACTLY where you're at (same height and 72lbs) and I DID go into feeding syndrome. I ended up in the hospital for a month and they gave me IV nutrition via a PICC line and a feeding tube. I don't remember my first week there, I was so incredibly sick. I almost died. Please please please go to the hospital, your body needs more help than you or anyone around you can give and death is knocking at your doorstep. \n\nPlease update us if you can💚",
          "created_utc": 1741419642.0
        },
        {
          "id": "mgo7lir",
          "author": "hayzilla",
          "body": "I am saying prayers for OP to get help & also so proud of you internet stranger for getting help when you needed it. I hope you are doing well in your recovery 🩷",
          "created_utc": 1741435964.0
        }
      ]
    },
    {
      "id": "ms8dusy",
      "author": "badgernextdoor",
      "body": "I honestly don't remember, they had me so drugged up I don't remember the first at least week in the hospital. Dead ass can't remember a thing. I was on morphine for pain and Ativan for the esophageal spasms. It's rather surreal missing a whole week of your life. \n\nI know leading up to the hospitalization I felt incredibly weak, easily exhausted, extreme drops in blood sugar, feeling like I was dying but couldn't put my finger on it. And my mom said my heart rate kept dropping that first week, I did spend a good 2 weeks on telemetry too because my heart was beating dangerouslu slow at times. \n\nDon't know my exact numbers but I know my magnesium and potassium were wack though. I can ask my mom, she's an ER nurse and was the one who went over all my labs, forced me into the hospital and then raised hell until I got the care I needed (they weren't taking me seriously at first, then I went into refeeding and my mom LOST it).  \n\nNever get really sick and need specialized care in Hawaii, the healthcare is AWFUL.",
      "created_utc": 1747207440.0,
      "score": 1,
      "context": [
        {
          "id": "mgngsvv",
          "author": "badgernextdoor",
          "body": "Go to the hospital, I have been EXACTLY where you're at (same height and 72lbs) and I DID go into feeding syndrome. I ended up in the hospital for a month and they gave me IV nutrition via a PICC line and a feeding tube. I don't remember my first week there, I was so incredibly sick. I almost died. Please please please go to the hospital, your body needs more help than you or anyone around you can give and death is knocking at your doorstep. \n\nPlease update us if you can💚",
          "created_utc": 1741419642.0
        },
        {
          "id": "ms5npst",
          "author": "Just_A_Warrior",
          "body": "How did you feel when you had refeeding syndrome,?",
          "created_utc": 1747169085.0
        }
      ]
    },
    {
      "id": "msoqyvm",
      "author": "ItAintEzBeinGreen",
      "body": "I honestly think it must tie back to fat phobia somehow…. People seem to be very uncompassionate about under-eating. I really hope you are doing and feeling better!!",
      "created_utc": 1747427421.0,
      "score": 1,
      "context": [
        {
          "id": "mgqjop3",
          "author": "ItAintEzBeinGreen",
          "body": "Thinking of you OP, and glad you posted here. Doctors can be extremely dismissive about this. I’ve seen it firsthand. Go to the best hospital you can in your area and ask them to help. You’ve got this.",
          "created_utc": 1741464502.0
        },
        {
          "id": "ms5pcps",
          "author": "Just_A_Warrior",
          "body": "Why can they be so dismissive when it’s such a life-threatening dangerous health issue,?",
          "created_utc": 1747169558.0
        }
      ]
    },
    {
      "id": "mgoz7jp",
      "author": "Legitimate-Produce-1",
      "body": "That's what paramedics are for. Still, this person has legal agency to get there, the approval of their parents notwithstanding.",
      "created_utc": 1741446934.0,
      "score": 2,
      "context": [
        {
          "id": "mgmr3sq",
          "author": "Legitimate-Produce-1",
          "body": "GO TO THE HOSPITAL. YOU ARE AN ADULT.",
          "created_utc": 1741406521.0
        },
        {
          "id": "mgovu1g",
          "author": "hungo_bungo",
          "body": "OP might be disabled so regardless of age they might need assistance getting there.",
          "created_utc": 1741445802.0
        }
      ]
    },
    {
      "id": "mgozgkg",
      "author": "Legitimate-Produce-1",
      "body": "Idk, if a fellow human being is at death's door, I'm going to float 'em a wake up call.",
      "created_utc": 1741447016.0,
      "score": 4,
      "context": [
        {
          "id": "mgmr3sq",
          "author": "Legitimate-Produce-1",
          "body": "GO TO THE HOSPITAL. YOU ARE AN ADULT.",
          "created_utc": 1741406521.0
        },
        {
          "id": "mgowl9j",
          "author": "SoManyMysteries",
          "body": "It's not necessary to YELL at her.",
          "created_utc": 1741446061.0
        }
      ]
    },
    {
      "id": "ms5o33v",
      "author": "Just_A_Warrior",
      "body": "What was your lab work showing,?",
      "created_utc": 1747169192.0,
      "score": 1,
      "context": [
        {
          "id": "mgngsvv",
          "author": "badgernextdoor",
          "body": "Go to the hospital, I have been EXACTLY where you're at (same height and 72lbs) and I DID go into feeding syndrome. I ended up in the hospital for a month and they gave me IV nutrition via a PICC line and a feeding tube. I don't remember my first week there, I was so incredibly sick. I almost died. Please please please go to the hospital, your body needs more help than you or anyone around you can give and death is knocking at your doorstep. \n\nPlease update us if you can💚",
          "created_utc": 1741419642.0
        },
        {
          "id": "mgo7lir",
          "author": "hayzilla",
          "body": "I am saying prayers for OP to get help & also so proud of you internet stranger for getting help when you needed it. I hope you are doing well in your recovery 🩷",
          "created_utc": 1741435964.0
        },
        {
          "id": "mgsdcl3",
          "author": "badgernextdoor",
          "body": "Thank you internet stranger, I wish I could take more credit but my mom literally flew from Washington to Hawaii to force me into the hospital when she saw my lab work come back so terribly. She also caught my refeeding syndrome (career ER nurse, my mom). She saved my life. 💕💕 I am doing much much better now, thank you!!",
          "created_utc": 1741487139.0
        }
      ]
    },
    {
      "id": "ms8e5p9",
      "author": "badgernextdoor",
      "body": "It was about the time I went into refeeding that they gave me a PICC line and added TPN & lipids on top of the feeding tube. My only memory during that first week was then making me sign a consent for the PICC line. Don't even remember it being placed.",
      "created_utc": 1747207630.0,
      "score": 1,
      "context": [
        {
          "id": "mgngsvv",
          "author": "badgernextdoor",
          "body": "Go to the hospital, I have been EXACTLY where you're at (same height and 72lbs) and I DID go into feeding syndrome. I ended up in the hospital for a month and they gave me IV nutrition via a PICC line and a feeding tube. I don't remember my first week there, I was so incredibly sick. I almost died. Please please please go to the hospital, your body needs more help than you or anyone around you can give and death is knocking at your doorstep. \n\nPlease update us if you can💚",
          "created_utc": 1741419642.0
        },
        {
          "id": "ms5npst",
          "author": "Just_A_Warrior",
          "body": "How did you feel when you had refeeding syndrome,?",
          "created_utc": 1747169085.0
        },
        {
          "id": "ms8dusy",
          "author": "badgernextdoor",
          "body": "I honestly don't remember, they had me so drugged up I don't remember the first at least week in the hospital. Dead ass can't remember a thing. I was on morphine for pain and Ativan for the esophageal spasms. It's rather surreal missing a whole week of your life. \n\nI know leading up to the hospitalization I felt incredibly weak, easily exhausted, extreme drops in blood sugar, feeling like I was dying but couldn't put my finger on it. And my mom said my heart rate kept dropping that first week, I did spend a good 2 weeks on telemetry too because my heart was beating dangerouslu slow at times. \n\nDon't know my exact numbers but I know my magnesium and potassium were wack though. I can ask my mom, she's an ER nurse and was the one who went over all my labs, forced me into the hospital and then raised hell until I got the care I needed (they weren't taking me seriously at first, then I went into refeeding and my mom LOST it).  \n\nNever get really sick and need specialized care in Hawaii, the healthcare is AWFUL.",
          "created_utc": 1747207440.0
        }
      ]
    }
  ]
}