{
  "id": "1j8iepp",
  "subreddit": "ARFID",
  "author": "puppyhugtime",
  "created_utc": 1741666249.0,
  "title": "Feeling ashamed of how much money my food is",
  "selftext": "What the title says. Unfortunately, I have expensive tastes and often times the only thing I feel like I can eat is like, the most expensive option of all of my safe foods. I don’t make a lot of money and I get stuck in a shame cycle. Tonight I’ve just been sitting & staring at nothing trying to convince myself that it’s not self-sabotage to spend $40+ on one delivery meal if it’s the only thing I’ll eat. I am trying so hard to save money but I always fail because there are so many nights that I won’t eat if I can’t have a really specific dish. I’ve put a lot of effort into planning my meals and finding cheaper alternatives to some things but it always boils down to nights like this. If I don’t order the food I feel ashamed for not taking care of myself but if I do order the food I feel ashamed for throwing my money away & not being able to eat like a “normal” person. \nNot sure what I’m looking for with this post exactly, but I figured if anyone could relate to what I’m feeling it’s y’all. I don’t actually have diagnosed arfid, but I have many of the characteristics and have found a lot of support in this group. Thanks everyone\n\nEdit: thanks for the support everyone, I love you all 😭💖 it’s such a relief to have a space where I can talk to other people who have been there. ",
  "url": "https://www.reddit.com/r/ARFID/comments/1j8iepp/feeling_ashamed_of_how_much_money_my_food_is/",
  "score": 112,
  "num_comments": 29,
  "comments": [
    {
      "id": "mh5ii98",
      "author": "GaydrianTheRainbow",
      "body": "It’s so hard balancing poverty with buying food we’ll actually be able to eat. I definitely relate to this.",
      "created_utc": 1741667814.0,
      "score": 73,
      "context": []
    },
    {
      "id": "mh5mny8",
      "author": "amusling",
      "body": "Fed is best! I had this exact same guilt. Huge portion of my income was going towards delivery safe food options. I realized instead of constantly overspending I needed to just make it part of my budget. The same way as when I used to take public transit and would frequently have to cab to avoid meltdowns on the way home after 10hr shift- it’s an access need. Accommodate yourself. If there are ways to min max ur delivery it might make more sense. Sometimes I get two meals and save one for 2nds, which often turns into 3 meals. Thanks for posting",
      "created_utc": 1741669871.0,
      "score": 38,
      "context": []
    },
    {
      "id": "mh5gvu5",
      "author": "alwaysapprehensive1",
      "body": "I totally understand this. I think you’re doing so well if you’ve found ways to reduce ordering delivery food at all.",
      "created_utc": 1741667046.0,
      "score": 15,
      "context": []
    },
    {
      "id": "mh5mh4p",
      "author": "probs_raven",
      "body": "Don't feel ashamed for prioritizing ur health. Even if it costs a lot of money, we already have it hard enough at it is. It's definitely okay and valid for u to feel this way, tho. Ur not alone.",
      "created_utc": 1741669773.0,
      "score": 6,
      "context": []
    },
    {
      "id": "mh5m354",
      "author": "Shrieking_ghost",
      "body": "Real. I’ve had to talk myself out of doordashing food because I didn’t want to cook, etc. It costs way too much and it’d just end up stressing even more, it’s not worth it",
      "created_utc": 1741669569.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mh5l4cg",
      "author": "dmlzr",
      "body": "Man i relate to this so much. I left my job due to stress and now am even more stressed because i can’t afford my safe options. Feels so silly because I have other safe options I like and have prepared and should eat but I want to order food and not think about it all sm. \n\nI have no advice but want you to know your defs not alone!!!",
      "created_utc": 1741669078.0,
      "score": 6,
      "context": []
    },
    {
      "id": "mh5o8w1",
      "author": "This_Gear_465",
      "body": "Yes 100% relate. When possible I try to pick it up and order directly through the restaurant so it’s not as expensive… And then when I can’t make myself go pick it up, I’m not as guilty ordering delivery because I figure I saved some money picking it up those times before lol!",
      "created_utc": 1741670704.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mh5xkpb",
      "author": "ShyTownHigh",
      "body": "Hard yes. I’ve developed a little more self compassion around these habits, but I would guess that a majority if not all of my credit card debt is solely from ordering takeout / throwing food away because I bought it and then didn’t want it before it went bad.",
      "created_utc": 1741676122.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mh6dg18",
      "author": "theowlsbrain",
      "body": "I'm not diagnosed either but I definitely have arfid. I recently moved out and it's an experience for sure. Stocking safe foods is good if possible I try to keep as much frozen as possible but sometimes expensive is all you can do. You can't live withouth food it's a pretty fair priority. There's also an idea that healthy foods are cheaper or easier to prepare than what a lot of have as safe foods which just isn't nessecarily true.\nMaybe think of the only meals you can eat as medicine, it's the only thing that will keep you healthy (fed) so of course you will spend money on your health.",
      "created_utc": 1741686321.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mh7twhz",
      "author": "MadCatter32",
      "body": "I feel this so much. My mom eats cheaply, but I just ant. Fortunately, my meal exists at Walmart, but it's almost $5 per meal, and it's the only thing I will eat. It really adds up, and with all of the vitamins and supplements I have to take, I am just really expensive,  and the guilt is so real.",
      "created_utc": 1741706861.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mh840r3",
      "author": "Other_Marketing83",
      "body": "I’m right here with ya!!! I have no advice but just know you’re not alone at all. For like two years all I could eat was two meals from two different restaurants for $20 a meal 😭 it was very difficult and stressful but I am finally coming out the other side",
      "created_utc": 1741709767.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mh8ad9q",
      "author": "ItAintEzBeinGreen",
      "body": "You have no idea how much I relate. I’ve been doing this for the past couple years and just getting out of it. I spent a whole summer ordering delivery morning and night and spent thousands of dollars. You’re not alone and it’s good that you’re feeding yourself. It won’t be like this forever",
      "created_utc": 1741711573.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mh8rpyz",
      "author": "boytoy421",
      "body": "IDK what your safe foods are but if they're anything like mine an air fryer and the frozen section at your supermarket are going to be lifesavers. I can get enough chicken nuggets that are basically chick fil a quality to last me like a week for $15 but the trick is you need to air fry",
      "created_utc": 1741716433.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mh922yj",
      "author": "Important_Grass",
      "body": "i honestly relate so hard. i live with my partner in their parents' house and there are so many nights where i feel like i cant eat anything except for one specific thing from a specific restaurant. neither my partner nor their parents have much money and i JUST started a job and dont get my first paycheck until tomorrow and my parents live 20 minutes away. gas is too expensive so i can't ask my parents to bring me food or drive there to get money and i feel absolutely horrible asking my partner's parents to buy me food, especially if they're already super tight on money. there's several nights going down that same spiral of feeling bad about money or feeling bad about not taking care of myself",
      "created_utc": 1741719341.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mha3lci",
      "author": "Taurus420Spirit",
      "body": "I spend alot of deliveries and takeaways, when I feel low mentally and need to force myself to eat. It sucks and people judge but we need to eat to survive. Do whatever keeps you alive and eating!",
      "created_utc": 1741729870.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mh6d988",
      "author": "ThrowRA-17288483",
      "body": "Have the exact same thing spend between £15-£40 a day on food, been told I'm spoiled for always ordering fancy meals. I am not eating it to enjoy it I just genuinely can't eat anything else",
      "created_utc": 1741686208.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mh9lzie",
      "author": "Professional_Ear9795",
      "body": "I relate so hard. All my money goes to feeding my body 😭",
      "created_utc": 1741724923.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mh5gaai",
      "author": "None",
      "body": "Are you my partner?",
      "created_utc": 1741666773.0,
      "score": -3,
      "context": []
    },
    {
      "id": "mh5x4ff",
      "author": "puppyhugtime",
      "body": "Yeah. It’s so rough. I wish so much that I could just afford the accommodations I need.",
      "created_utc": 1741675850.0,
      "score": 19,
      "context": [
        {
          "id": "mh5ii98",
          "author": "GaydrianTheRainbow",
          "body": "It’s so hard balancing poverty with buying food we’ll actually be able to eat. I definitely relate to this.",
          "created_utc": 1741667814.0
        }
      ]
    },
    {
      "id": "mh5xaoe",
      "author": "puppyhugtime",
      "body": "Thank you. I did end up ordering tonight and at least I was able to make two meals out of it. You are right that fed is best.",
      "created_utc": 1741675955.0,
      "score": 12,
      "context": [
        {
          "id": "mh5mny8",
          "author": "amusling",
          "body": "Fed is best! I had this exact same guilt. Huge portion of my income was going towards delivery safe food options. I realized instead of constantly overspending I needed to just make it part of my budget. The same way as when I used to take public transit and would frequently have to cab to avoid meltdowns on the way home after 10hr shift- it’s an access need. Accommodate yourself. If there are ways to min max ur delivery it might make more sense. Sometimes I get two meals and save one for 2nds, which often turns into 3 meals. Thanks for posting",
          "created_utc": 1741669871.0
        }
      ]
    },
    {
      "id": "mh5jbhj",
      "author": "puppyhugtime",
      "body": "Thank you, I really need to hear this",
      "created_utc": 1741668206.0,
      "score": 8,
      "context": [
        {
          "id": "mh5gvu5",
          "author": "alwaysapprehensive1",
          "body": "I totally understand this. I think you’re doing so well if you’ve found ways to reduce ordering delivery food at all.",
          "created_utc": 1741667046.0
        }
      ]
    },
    {
      "id": "mh5xjbg",
      "author": "puppyhugtime",
      "body": "Thank you",
      "created_utc": 1741676098.0,
      "score": 3,
      "context": [
        {
          "id": "mh5mh4p",
          "author": "probs_raven",
          "body": "Don't feel ashamed for prioritizing ur health. Even if it costs a lot of money, we already have it hard enough at it is. It's definitely okay and valid for u to feel this way, tho. Ur not alone.",
          "created_utc": 1741669773.0
        }
      ]
    },
    {
      "id": "mh5xwrk",
      "author": "puppyhugtime",
      "body": "I’ve been doing a good job of talking myself out of it lately too! But sometimes I just don’t have the energy for anything else",
      "created_utc": 1741676328.0,
      "score": 3,
      "context": [
        {
          "id": "mh5m354",
          "author": "Shrieking_ghost",
          "body": "Real. I’ve had to talk myself out of doordashing food because I didn’t want to cook, etc. It costs way too much and it’d just end up stressing even more, it’s not worth it",
          "created_utc": 1741669569.0
        }
      ]
    },
    {
      "id": "mh5xhmm",
      "author": "puppyhugtime",
      "body": "I hear you. I cut my hours at work due to stress & when I was working full time I FINALLY was just barely making enough to feel okay about my expensive food options, but since I’ve been working less it’s been constant financial stress again. \n\nAnd thank you, posting on this thread has made me feel a lot better tonight. Grateful for the support on here.",
      "created_utc": 1741676069.0,
      "score": 3,
      "context": [
        {
          "id": "mh5l4cg",
          "author": "dmlzr",
          "body": "Man i relate to this so much. I left my job due to stress and now am even more stressed because i can’t afford my safe options. Feels so silly because I have other safe options I like and have prepared and should eat but I want to order food and not think about it all sm. \n\nI have no advice but want you to know your defs not alone!!!",
          "created_utc": 1741669078.0
        }
      ]
    },
    {
      "id": "mh5xo7i",
      "author": "puppyhugtime",
      "body": "Good idea. I try to do that when I can too, a major barrier for me though is that I hate to drive lol. There are a handful of restaurants I can walk to though, so I have been trying to get takeout from those places more often if I can",
      "created_utc": 1741676181.0,
      "score": 3,
      "context": [
        {
          "id": "mh5o8w1",
          "author": "This_Gear_465",
          "body": "Yes 100% relate. When possible I try to pick it up and order directly through the restaurant so it’s not as expensive… And then when I can’t make myself go pick it up, I’m not as guilty ordering delivery because I figure I saved some money picking it up those times before lol!",
          "created_utc": 1741670704.0
        }
      ]
    },
    {
      "id": "mh5ydyj",
      "author": "puppyhugtime",
      "body": "Ugh, I have sooo much stuff that goes bad in the fridge too 😭 😂 \nI’ve also developed some more self compassion around my habits, but there’s also a certain point where I have to be realistic about what I actually have to spend & that’s where the self-deprecating thoughts can sneak back in",
      "created_utc": 1741676619.0,
      "score": 2,
      "context": [
        {
          "id": "mh5xkpb",
          "author": "ShyTownHigh",
          "body": "Hard yes. I’ve developed a little more self compassion around these habits, but I would guess that a majority if not all of my credit card debt is solely from ordering takeout / throwing food away because I bought it and then didn’t want it before it went bad.",
          "created_utc": 1741676122.0
        }
      ]
    },
    {
      "id": "mh5jd3i",
      "author": "puppyhugtime",
      "body": "Not yet 😏 (jk)",
      "created_utc": 1741668227.0,
      "score": 6,
      "context": [
        {
          "id": "mh5gaai",
          "author": "None",
          "body": "Are you my partner?",
          "created_utc": 1741666773.0
        }
      ]
    },
    {
      "id": "mh5y0pb",
      "author": "Shrieking_ghost",
      "body": "Yeah, I definitely get that. And that’s ok! As long as it isn’t all the time. We still deserve a little pampering",
      "created_utc": 1741676393.0,
      "score": 2,
      "context": [
        {
          "id": "mh5m354",
          "author": "Shrieking_ghost",
          "body": "Real. I’ve had to talk myself out of doordashing food because I didn’t want to cook, etc. It costs way too much and it’d just end up stressing even more, it’s not worth it",
          "created_utc": 1741669569.0
        },
        {
          "id": "mh5xwrk",
          "author": "puppyhugtime",
          "body": "I’ve been doing a good job of talking myself out of it lately too! But sometimes I just don’t have the energy for anything else",
          "created_utc": 1741676328.0
        }
      ]
    },
    {
      "id": "mh8erz3",
      "author": "ShyTownHigh",
      "body": "I like the idea of working those expenses into your budget. Bottom line we need to eat to live, and not eating just leads to more problems. I had a phase of ordering delivery multiple times a week, it got out of hand. But I am capable of driving and picking it up myself, so when funds are low I’ll do that and try to keep it to once a week. If I feel like I extra don’t deserve or can’t afford it, I’ll work in some chores. If I do my laundry and go for a walk, then I’m allowed to get takeout. Kinda like a reward and then you feel less shitty about spending the money, if that makes sense.",
      "created_utc": 1741712809.0,
      "score": 3,
      "context": [
        {
          "id": "mh5xkpb",
          "author": "ShyTownHigh",
          "body": "Hard yes. I’ve developed a little more self compassion around these habits, but I would guess that a majority if not all of my credit card debt is solely from ordering takeout / throwing food away because I bought it and then didn’t want it before it went bad.",
          "created_utc": 1741676122.0
        },
        {
          "id": "mh5ydyj",
          "author": "puppyhugtime",
          "body": "Ugh, I have sooo much stuff that goes bad in the fridge too 😭 😂 \nI’ve also developed some more self compassion around my habits, but there’s also a certain point where I have to be realistic about what I actually have to spend & that’s where the self-deprecating thoughts can sneak back in",
          "created_utc": 1741676619.0
        }
      ]
    }
  ]
}