{
  "id": "1j93j3k",
  "subreddit": "ARFID",
  "author": "KillTheInc",
  "created_utc": 1741731953.0,
  "title": "I think people who hate picky eaters just make up fake people to be mad at",
  "selftext": "Cause the arguments against picky eaters (people with ARFID lmao) make NO sense to me.\n\n**\"I don't care if you're a picky eater, just don't be rude to ME if I want to order something adventurous.\"** When have any of us EVER been genuinely mean to someone because we don't like what they're eating? I don't feel like that happens very often, if ever. \n\n**\"I don't care if you're a picky eater, just don't make me order chicken tenders, too!\"** Again, no picky eater on Earth is doing this. None of us are gonna force you to eat something you don't want to. \n\n**\"Picky eaters are childish brats who throw tantrums when their safe foods aren't available.\"** I don't know a SINGLE person with this disorder that doesn't keep their mouth shut and go hungry when their safe foods aren't available. We shouldn't HAVE to do that, but we often do, because telling people that you can't eat 95% of the food at a buffet is embarrassing. \n\n**\"Picky eating is so embarrassing.\"** Yeah!!! It is!!! Glad you noticed!!! Imagine having to live like this!!! Do you think I'm doing this for the bit?? I think they genuinely believe I'm doing this for the bit.\n\n**\"If I take a picky eater to a restaurant and they try to order one of their safe foods when it's not listed on the menu, that's really annoying.\"** ???? WHO does this?? WHO orders things that aren't on the menu?? This sounds insane, but I saw this take MULTIPLE times the other day while browsing a Tumblr post. And it's possibly the most unhinged one, because I can't imagine trying to order something that isn't on a restaurant's menu. That doesn't even exist in my head as something I would think to do.\n\nLike....sure, maybe there's a FEW people out there who act like this. But it's not because they're picky eaters, it's because they're jerks. And ARFID is a really stupid thing to hate from an external standpoint, because YOU'RE not the one who has to deal with it. Making an accommodation for a friend at a restaurant because you care about then is not on the same level of annoying/humiliating/frustrating as living with an eating/feeding disorder for your entire life. Grow up and stop acting like a petulant baby because someone wants to eat different food than you do.",
  "url": "https://www.reddit.com/r/ARFID/comments/1j93j3k/i_think_people_who_hate_picky_eaters_just_make_up/",
  "score": 364,
  "num_comments": 43,
  "comments": [
    {
      "id": "mhag9rx",
      "author": "runnawaycucumber",
      "body": "The main things I experience is people just constantly telling me how stupid and childish I am and general bullying/shaming. I personally haven't experienced those kinds of phrases and I honestly don't think I could handle it lmao. I legit refuse to make friends anymore because nobody will shut the fk up about my diagnosis lol\n\nEdit// I did ask a friend to not eat raw fucking ground beef in front of me once so idk if that count as the **\"I don't care if you're a picky eater, just don't be rude to ME if I want to order something adventurous.\"** lollllll",
      "created_utc": 1741733621.0,
      "score": 138,
      "context": []
    },
    {
      "id": "mhaem5k",
      "author": "crustil",
      "body": "No, I literally google menus of restaurants before I go so I know what to order/if I wanna go so I don't get flustered when I'm in there 😅\n\nThis may be an ADHD thing but I frequently forget I can ask them to modify my food a bit like asking for no mushrooms on it. I'd rather just pick them off or order something else the rare time I DO remember anyway.",
      "created_utc": 1741733141.0,
      "score": 90,
      "context": []
    },
    {
      "id": "mhaqva8",
      "author": "xernpostz",
      "body": "it makes me incredibly upset when people call picky eaters \"whiners\" or \"childish\". if i leave the room because the food smells strong, im not insulting you or your food. it's because i literally cannot eat in that environment and im moving to a place where we can both eat in peace. it's as simple as that. \n\nbecause we are socialized around food from birth, people severely lack empathy for anyone who fits outside that box. ive read condescending statements about anyone who takes supplements in a textbook for gods sake, saying \"who would EVER want to ignore the JOYS of food?\" ugh. i hate it. \n\nif i don't want to try your casserole or whatever, it's because i literally can't. if i don't want to eat next to you it's because i can't do it. im not TRYING to be rude. people think that picky eaters are out to get them or be assholes on purpose.",
      "created_utc": 1741736900.0,
      "score": 76,
      "context": []
    },
    {
      "id": "mhb3r19",
      "author": "imhereforthemeta",
      "body": "99 percent positive these types of people are mad because they chose to go out to dinner with a friend with ARFID who asked them, please can we go somewhere where there’s food I can actually eat. I have had people throw fucking tantrums at me because I did not want to go to a sandwich place or something.",
      "created_utc": 1741741069.0,
      "score": 50,
      "context": []
    },
    {
      "id": "mhbcth8",
      "author": "StrawbraryLiberry",
      "body": "They want an excuse to discriminate against people who they feel are inconvenient. Basically ableism, but they want the person who \"is a picky eater\" to look like a jerk who taking up too much space by being inconvenient. \n\nI've decided picky eater haters are total jerks themselves, and they probably hate us, not necessarily because our illness or need for accommodations can be inconvenient to them, but sometimes because they probably don't feel empowered enough themselves to ask for anything. Because they can't have what they want or they can't take up space, they don't think anyone else should have what they want. \n\nThey don't realize that a lot of us want not to have ARFID or food allergies or whatever else is making us \"picky.\" \n\nWe don't have what we want, we have a plain baked potato with salt because it is all we can tolerate at this time. \n\nImagine being jealous of me and my sad potato.",
      "created_utc": 1741744120.0,
      "score": 34,
      "context": []
    },
    {
      "id": "mhb2r3v",
      "author": "MysticCollective",
      "body": "This is why I don't like picky eating being associated with ARFID. I'm not being picky. I literally can't force myself to eat even if I am hungry. Picky eaters can still eat food even if they don't like something. They won't feel sick after or discomfort or have sensory overload. I lack interest in eating. My safe foods that I actually enjoy are my motivation to eat. Otherwise I would not eat. So I won't apologize for needing certain foods at a restaurant.",
      "created_utc": 1741740735.0,
      "score": 51,
      "context": []
    },
    {
      "id": "mhaoej4",
      "author": "BeatnikMona",
      "body": "I’ll admit that I do have one rule which might annoy people, but all of my friends and partners have been very good about it and I’m incredibly grateful. My phobia of fish is severe and I can’t be around it—I’ve recently been okay with sushi being near me and shrimp being near me, but that’s it. \n\nAside from that, order whatever you want, just don’t harass me by trying to make me try it.",
      "created_utc": 1741736124.0,
      "score": 23,
      "context": []
    },
    {
      "id": "mhbvl2i",
      "author": "xdfgg234555",
      "body": "not only is the demonization of \"picky eaters\" rooted in blatant ableism but these arguments are also pure projection on their part because it's usually the non-picky eaters/ neurotypicals who are in a position of power and forcing things on US, often in violent and dehumanising ways. imo they just hate to see ND people assert our bodily autonomy and personhood and also generally dislike anyone who strongly enforces boundaries and can't be shamed into complying with social norms at their own risk to appear \"normal\" \n(partly because they are cowards who have no self respect and get triggered by those who do and partly because those traits make you harder to abuse and threaten to destabilize systems of oppression)",
      "created_utc": 1741751033.0,
      "score": 20,
      "context": []
    },
    {
      "id": "mhccbvv",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1741759347.0,
      "score": 18,
      "context": []
    },
    {
      "id": "mhb4y6g",
      "author": "BellZealousideal7435",
      "body": "People this we are joking when we say with arfid that we find it safer to starve ourselves than eat anything other than our safe foods only. Same food, same texture, same smell, same way it’s made, same brand specifically, not touching other foods. No new foods. I’m not setting off my gag reflex and upsetting my stomach and throwing back up food because people didn’t want to give me a safe food or an alternate at least to what they were only willing to give and make. Starvation is safety than that yes.",
      "created_utc": 1741741472.0,
      "score": 12,
      "context": []
    },
    {
      "id": "mhbg90t",
      "author": "DeterminedArrow",
      "body": "I once asked for something that technically wasn’t on the menu. The only thing I’d eat was on the kid’s menu and wasn’t offered for adults. Which is a ridiculous honestly. I just wanted the plain buttered noodles and there truly wasn’t anything else I’d eat. Thankfully, they let me order it when the situation was explained. But I was mortified because i was technically ordering off the menu.",
      "created_utc": 1741745279.0,
      "score": 9,
      "context": []
    },
    {
      "id": "mhcwu18",
      "author": "Angelangepange",
      "body": "It has happened way more often (lately) that the waiter comes and I'm like \"sorry I didn't find anything that I could eat on the menu, I eat this king of thing\" and THEY were the ones who told me they had something off the menu that could be in the category of stuff I eat.    \n     \nThey did it to be kind to me and I deeply appreciate it while disassociating the entire time waiting for this mystery food that they were preparing. Not knowing what it was really messed me up because it feels even more shameful if it turned out I couldn't eat it after they had done something so nice to me.    \n    \nAnd this happened twice total vs the zero times I asked for something off the menu. I usually just accept my destiny and leave if I can, eat only bread if I can't.    \n     \nI notice that on the internet being mad at things is cyclical, there will be lots of talk about one topic until everyone gets bored and they change. sometimes it's us. Some other time the big bad is aroace people (fucken wild). Some times is vegans. Notice how it's always people who *don't* do something that to others is a \"guilty pleasure\".    \n       \nMost of the times is whatever teen girls are doing at the moment but that's just misogyny.",
      "created_utc": 1741772430.0,
      "score": 9,
      "context": []
    },
    {
      "id": "mhbo6iu",
      "author": "amh8011",
      "body": "I would rather sit there with my ice water than make some sort of special request. Like let me be. I will eventually find food. Eat whatever you want. I’m fine. I know you enjoy eating a variety of things and I want you to enjoy it. Please don’t let me get in the way of you enjoying food. Don’t worry about me. I’ll manage and I will try my best not to embarass you. (Unless you’re my little sister, then I’ll only embarass you mildly but in a silly way that you laugh about later).",
      "created_utc": 1741748101.0,
      "score": 7,
      "context": []
    },
    {
      "id": "mhfb0qz",
      "author": "extremely_displeased",
      "body": "i started saying i had a stomach condition (because eating foods i don’t like makes me puke so it kinda is) and people were suddenly much more understanding 😒",
      "created_utc": 1741802982.0,
      "score": 7,
      "context": []
    },
    {
      "id": "mhfl1l4",
      "author": "avalonrose14",
      "body": "The amount of events I missed out on in college because they were centered around food and didn’t list the menu ahead of time is insane. I hate being picky but the shame of not eating and having everyone question me is even worse. So many “come learn about this important topic over lunch” events. And it’s always fucking subs man. I hate subs. They get served all the time at events and it’s always a nightmare for me. Even as an adult I went to a work conference and signed up for a field trip and they served lunch and I packed granola bars and an Apple for myself knowing I almost certainly wouldn’t be able to eat their lunch and my coworkers were all like “you dont want the free subs?” And I’m like yeaaaah I’m not that hungry. It’s miserable. I don’t want to be picky. I’m actively working so hard on being less picky. Yknow what I’m even going to brag for a second: I tried asparagus a few weeks ago for the first time. It was good I enjoyed it and I’m so proud of myself. Unfortunately enjoying it isn’t enough for me to add it into my rotation of foods yet because it’s still scary and new to my stupid brain. But now next time it’s served I’ll be able to eat it again and eventually it’ll become normal and I’ll be able to have another veggie I can eat consistently. Is it embarrassing I’m proud of trying asparagus at 26? Fuck yeah I’m horrifically embarrassed. But I’m allowed to be proud too. I’m just tryna live my life man.",
      "created_utc": 1741805854.0,
      "score": 7,
      "context": []
    },
    {
      "id": "mhd7itq",
      "author": "All_my_goats_foreign",
      "body": "This!! I especially hate when they don't have the common sense to realize NO ONE wants to be this way. No one wants to draw an unnecessary amount of attention to themselves for something like eating which is a basic human need. It's not like we pull this \"stunt\" a few times a year. This is our LIFE. Every. Damn. Day.",
      "created_utc": 1741778353.0,
      "score": 11,
      "context": []
    },
    {
      "id": "mhckyza",
      "author": "Dykeryy",
      "body": "I'll just start doing it. I don't care at this point. If they're going to call me a \"picky eater\" and complain about how we all tie them to chairs and FORCE them to eat chicken tenders and we scream at them for ordering food we don't like, maybe I'll just do it now.",
      "created_utc": 1741764702.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mhdyx0m",
      "author": "In_The_Play",
      "body": ">Like....sure, maybe there's a FEW people out there who act like this. But it's not because they're picky eaters, it's because they're jerks.\n\nExactly - and yet people use it as an excuse to hate on the rest of us. You can't mention all the irritating comments that people with ARFID or picky eaters without ARFID have to deal with without most people just defensively trotting out the phrases you mentioned. Like ... ok?? but that's not what I'm talking about???",
      "created_utc": 1741788810.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mhbmydg",
      "author": "amh8011",
      "body": "Okay so the last one is my grandma but she’s just like that. She has zero class. She’ll go to a nice restaurant and ask for a glass of milk. Like she’ll demand it. It’s so embarassing. She has no issue drinking other things but she must have a glass of milk with dinner. She’ll complain if they don’t have milk.",
      "created_utc": 1741747646.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mhov17l",
      "author": "potatol0ver1",
      "body": "I mainly have the issue of people telling me that in their household they would eat or else they wouldn't get food. I've never related because I was super stubborn and also trying new foods or things that I know I won't like is the scariest thing in the world to me. I believe there's too much ignorance because people simply don't know what it is.",
      "created_utc": 1741923190.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mhr017x",
      "author": "Impossible_Girl_23",
      "body": "'Picky people just want attention.' This one gets me THE MOST, because holy f, attention about food is the last thing on Earth any of us wants. THE LAST!",
      "created_utc": 1741961181.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mhxm68a",
      "author": "deandratb",
      "body": "Feeling judged for their choices, pressured to eat the same food as other people, berated because others aren't getting their way, feeling embarrassed, witnessing unreasonable demands...hmm, that all sounds awfully familiar to me! But from the other side. \n\nI haven't come across any of these complaints personally, but I do find such a weirdly defensive, victimized perspective pretty funny when those of us with ARFID are trained our whole lives to tolerate the kinds of treatment this describes, while we're also taught to be as quiet and invisible around food as possible.",
      "created_utc": 1742052444.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mhz2s15",
      "author": "pearlssad",
      "body": "Seems like you met my ex",
      "created_utc": 1742068841.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mhlh9kx",
      "author": "Wolvii_404",
      "body": "I used to get really mad at picky eaters, until I realised it was because my parents didn't allow for me to be picky, so my brain was like \"Why do you get a pass when I had to force myself all my life to eat things I didn't want to?\"",
      "created_utc": 1741885736.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mhguicc",
      "author": "AlienRobotTrex",
      "body": "Actually that last part isn't that unreasonable of a thing to do in some cases. For example at some restaurants that don't have fries on the menu but have other foods involving potatoes, they might make fries if you ask. The waiters don't even treat it like a big deal, they just say \"I'll see what we can do\"",
      "created_utc": 1741819176.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mhb9pmc",
      "author": "SadisticGoose",
      "body": "Raw meat??? That sounds like a major health hazard that no one should be eating???",
      "created_utc": 1741743070.0,
      "score": 31,
      "context": [
        {
          "id": "mhag9rx",
          "author": "runnawaycucumber",
          "body": "The main things I experience is people just constantly telling me how stupid and childish I am and general bullying/shaming. I personally haven't experienced those kinds of phrases and I honestly don't think I could handle it lmao. I legit refuse to make friends anymore because nobody will shut the fk up about my diagnosis lol\n\nEdit// I did ask a friend to not eat raw fucking ground beef in front of me once so idk if that count as the **\"I don't care if you're a picky eater, just don't be rude to ME if I want to order something adventurous.\"** lollllll",
          "created_utc": 1741733621.0
        }
      ]
    },
    {
      "id": "mhaiqc0",
      "author": "black_flame919",
      "body": "I do the same. Analyze the menu and spend days agonizing over what to order at a place I know won’t have many safe foods for me",
      "created_utc": 1741734362.0,
      "score": 27,
      "context": [
        {
          "id": "mhaem5k",
          "author": "crustil",
          "body": "No, I literally google menus of restaurants before I go so I know what to order/if I wanna go so I don't get flustered when I'm in there 😅\n\nThis may be an ADHD thing but I frequently forget I can ask them to modify my food a bit like asking for no mushrooms on it. I'd rather just pick them off or order something else the rare time I DO remember anyway.",
          "created_utc": 1741733141.0
        }
      ]
    },
    {
      "id": "mhanerp",
      "author": "Princesstinyk",
      "body": "I never forget but still avoid customizing because God forbid they forget I said no mushrooms and then my whole meal tastes like a mushroom. Or a pickle or whatever it is. Easier to order it as it comes so no one will mess it up and then I get an unsafe food but wasn't even expecting it",
      "created_utc": 1741735813.0,
      "score": 21,
      "context": [
        {
          "id": "mhaem5k",
          "author": "crustil",
          "body": "No, I literally google menus of restaurants before I go so I know what to order/if I wanna go so I don't get flustered when I'm in there 😅\n\nThis may be an ADHD thing but I frequently forget I can ask them to modify my food a bit like asking for no mushrooms on it. I'd rather just pick them off or order something else the rare time I DO remember anyway.",
          "created_utc": 1741733141.0
        }
      ]
    },
    {
      "id": "mhe079h",
      "author": "lurkingsubz",
      "body": "i do this too so if there’s nothing remotely appealing, we can find somewhere else. the few times i’ve dined somewhere without checking it out, and there’s nothing i can confidently eat, i usually just say i’m not that hungry 🤷🏻‍♂️ i tend to lose my appetite really quickly when i don’t feel like there’s a safe option anyways, so it’s not like i’m lying. i get incredibly overwhelmed and kinda shut down so it immediately turns off my hunger cues.",
      "created_utc": 1741789213.0,
      "score": 7,
      "context": [
        {
          "id": "mhaem5k",
          "author": "crustil",
          "body": "No, I literally google menus of restaurants before I go so I know what to order/if I wanna go so I don't get flustered when I'm in there 😅\n\nThis may be an ADHD thing but I frequently forget I can ask them to modify my food a bit like asking for no mushrooms on it. I'd rather just pick them off or order something else the rare time I DO remember anyway.",
          "created_utc": 1741733141.0
        }
      ]
    },
    {
      "id": "mhbau8w",
      "author": "slowsenpai",
      "body": "sandwiches... my greatest enemy...",
      "created_utc": 1741743449.0,
      "score": 20,
      "context": [
        {
          "id": "mhb3r19",
          "author": "imhereforthemeta",
          "body": "99 percent positive these types of people are mad because they chose to go out to dinner with a friend with ARFID who asked them, please can we go somewhere where there’s food I can actually eat. I have had people throw fucking tantrums at me because I did not want to go to a sandwich place or something.",
          "created_utc": 1741741069.0
        }
      ]
    },
    {
      "id": "mhf33np",
      "author": "kayidontcare",
      "body": "i had a friend get mad because i didn’t want to go to a SUSHI restaurant😭. it wasn’t like a planned date or anything; we were just spontaneously deciding to go out to eat and of all the places that is the one place that doesn’t have a single thing i can eat. That’s literally the only time i think i have inconvenienced somebody because of the way i eat",
      "created_utc": 1741800727.0,
      "score": 12,
      "context": [
        {
          "id": "mhb3r19",
          "author": "imhereforthemeta",
          "body": "99 percent positive these types of people are mad because they chose to go out to dinner with a friend with ARFID who asked them, please can we go somewhere where there’s food I can actually eat. I have had people throw fucking tantrums at me because I did not want to go to a sandwich place or something.",
          "created_utc": 1741741069.0
        }
      ]
    },
    {
      "id": "mhf3l6z",
      "author": "kayidontcare",
      "body": "i think you’re exactly right! lol if i could eat everything i would. i’ve always said if i had a genie give me three wishes; my first wish would be to like the taste and texture of every food on earth 🤣😭 i just want to be one of those health guru people but my eating will never match that lifestyle",
      "created_utc": 1741800866.0,
      "score": 6,
      "context": [
        {
          "id": "mhbcth8",
          "author": "StrawbraryLiberry",
          "body": "They want an excuse to discriminate against people who they feel are inconvenient. Basically ableism, but they want the person who \"is a picky eater\" to look like a jerk who taking up too much space by being inconvenient. \n\nI've decided picky eater haters are total jerks themselves, and they probably hate us, not necessarily because our illness or need for accommodations can be inconvenient to them, but sometimes because they probably don't feel empowered enough themselves to ask for anything. Because they can't have what they want or they can't take up space, they don't think anyone else should have what they want. \n\nThey don't realize that a lot of us want not to have ARFID or food allergies or whatever else is making us \"picky.\" \n\nWe don't have what we want, we have a plain baked potato with salt because it is all we can tolerate at this time. \n\nImagine being jealous of me and my sad potato.",
          "created_utc": 1741744120.0
        }
      ]
    },
    {
      "id": "mhbl8pw",
      "author": "dainty_dryad",
      "body": "*Needing* certain foods is exactly it. It's not my safe food because I simply prefer it over others if given the choice. It's my safe food because there is no other choice. I *cannot* eat anything else.\n\nIf you wouldn't take away a diabetic's insulin when theyre having a hypoglycemic episode, don't take away my safe food. It's that serious.",
      "created_utc": 1741747025.0,
      "score": 25,
      "context": [
        {
          "id": "mhb2r3v",
          "author": "MysticCollective",
          "body": "This is why I don't like picky eating being associated with ARFID. I'm not being picky. I literally can't force myself to eat even if I am hungry. Picky eaters can still eat food even if they don't like something. They won't feel sick after or discomfort or have sensory overload. I lack interest in eating. My safe foods that I actually enjoy are my motivation to eat. Otherwise I would not eat. So I won't apologize for needing certain foods at a restaurant.",
          "created_utc": 1741740735.0
        }
      ]
    },
    {
      "id": "mhbkhje",
      "author": "dainty_dryad",
      "body": "DONT HARASS ME BY TRYING TO MAKE ME TRY IT ***PLEASE*** FOR THE LOVE OF ALL THAT IS GOOD!!!",
      "created_utc": 1741746752.0,
      "score": 12,
      "context": [
        {
          "id": "mhaoej4",
          "author": "BeatnikMona",
          "body": "I’ll admit that I do have one rule which might annoy people, but all of my friends and partners have been very good about it and I’m incredibly grateful. My phobia of fish is severe and I can’t be around it—I’ve recently been okay with sushi being near me and shrimp being near me, but that’s it. \n\nAside from that, order whatever you want, just don’t harass me by trying to make me try it.",
          "created_utc": 1741736124.0
        }
      ]
    },
    {
      "id": "mhf6i1o",
      "author": "kayidontcare",
      "body": "“jUst tRy iT”",
      "created_utc": 1741801694.0,
      "score": 5,
      "context": [
        {
          "id": "mhccbvv",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1741759347.0
        }
      ]
    },
    {
      "id": "mhel167",
      "author": "mmm4dmb",
      "body": "Yup.",
      "created_utc": 1741795560.0,
      "score": 1,
      "context": [
        {
          "id": "mhd7itq",
          "author": "All_my_goats_foreign",
          "body": "This!! I especially hate when they don't have the common sense to realize NO ONE wants to be this way. No one wants to draw an unnecessary amount of attention to themselves for something like eating which is a basic human need. It's not like we pull this \"stunt\" a few times a year. This is our LIFE. Every. Damn. Day.",
          "created_utc": 1741778353.0
        }
      ]
    },
    {
      "id": "mhgkpno",
      "author": "Angelangepange",
      "body": "Oh man, your grandma would love Sweden. Having straight up a tall glass of milk with lunch or dinner is very common. I saw some colleagues have it in the office with their lunch so I wonder if she would get less complaints there when asking at a restaurant given that it's more normal there.",
      "created_utc": 1741816193.0,
      "score": 6,
      "context": [
        {
          "id": "mhbmydg",
          "author": "amh8011",
          "body": "Okay so the last one is my grandma but she’s just like that. She has zero class. She’ll go to a nice restaurant and ask for a glass of milk. Like she’ll demand it. It’s so embarassing. She has no issue drinking other things but she must have a glass of milk with dinner. She’ll complain if they don’t have milk.",
          "created_utc": 1741747646.0
        }
      ]
    },
    {
      "id": "mhb9sbs",
      "author": "runnawaycucumber",
      "body": "YOU WOULD THINK RIGHT?!",
      "created_utc": 1741743095.0,
      "score": 25,
      "context": [
        {
          "id": "mhag9rx",
          "author": "runnawaycucumber",
          "body": "The main things I experience is people just constantly telling me how stupid and childish I am and general bullying/shaming. I personally haven't experienced those kinds of phrases and I honestly don't think I could handle it lmao. I legit refuse to make friends anymore because nobody will shut the fk up about my diagnosis lol\n\nEdit// I did ask a friend to not eat raw fucking ground beef in front of me once so idk if that count as the **\"I don't care if you're a picky eater, just don't be rude to ME if I want to order something adventurous.\"** lollllll",
          "created_utc": 1741733621.0
        },
        {
          "id": "mhb9pmc",
          "author": "SadisticGoose",
          "body": "Raw meat??? That sounds like a major health hazard that no one should be eating???",
          "created_utc": 1741743070.0
        }
      ]
    },
    {
      "id": "mhigo3j",
      "author": "feralpossum19",
      "body": "Raw meat has been eaten for centuries. Steak tartare, sushi, and having grown up in the Midwest, cannibal sandwiches (ground beef on bread with onions). However, it's not unreasonable to ask someone not to eat that it front of you. My wife gets nauseated by me eating those so I just, don't do it when she's around.",
      "created_utc": 1741839102.0,
      "score": 5,
      "context": [
        {
          "id": "mhag9rx",
          "author": "runnawaycucumber",
          "body": "The main things I experience is people just constantly telling me how stupid and childish I am and general bullying/shaming. I personally haven't experienced those kinds of phrases and I honestly don't think I could handle it lmao. I legit refuse to make friends anymore because nobody will shut the fk up about my diagnosis lol\n\nEdit// I did ask a friend to not eat raw fucking ground beef in front of me once so idk if that count as the **\"I don't care if you're a picky eater, just don't be rude to ME if I want to order something adventurous.\"** lollllll",
          "created_utc": 1741733621.0
        },
        {
          "id": "mhb9pmc",
          "author": "SadisticGoose",
          "body": "Raw meat??? That sounds like a major health hazard that no one should be eating???",
          "created_utc": 1741743070.0
        }
      ]
    },
    {
      "id": "mhb5r9a",
      "author": "BellZealousideal7435",
      "body": "Yeah unfortunately simply picking it off doesn’t work for me it will still make me gag if I’m still tasting it. I’d have to be remade.",
      "created_utc": 1741741741.0,
      "score": 15,
      "context": [
        {
          "id": "mhaem5k",
          "author": "crustil",
          "body": "No, I literally google menus of restaurants before I go so I know what to order/if I wanna go so I don't get flustered when I'm in there 😅\n\nThis may be an ADHD thing but I frequently forget I can ask them to modify my food a bit like asking for no mushrooms on it. I'd rather just pick them off or order something else the rare time I DO remember anyway.",
          "created_utc": 1741733141.0
        },
        {
          "id": "mhanerp",
          "author": "Princesstinyk",
          "body": "I never forget but still avoid customizing because God forbid they forget I said no mushrooms and then my whole meal tastes like a mushroom. Or a pickle or whatever it is. Easier to order it as it comes so no one will mess it up and then I get an unsafe food but wasn't even expecting it",
          "created_utc": 1741735813.0
        }
      ]
    },
    {
      "id": "mhf44pc",
      "author": "imhereforthemeta",
      "body": "I have two ways of handling this and yeah, it’s unbelievable. How immature people get about someone not wanting to eat something. \n\n\nI will say hey, you can always go by yourself or with another friend. I don’t really know why people want to drag you to places where you can’t eat anything, but I’ll usually be pretty straight up about it. \n\nThe other thing I will do at times and this is peak petty - is agreed to go to a place that has very little to nothing I can eat after being pressed about it after an initial no. \n\nWhen I am not eating, people will feel extremely guilty and ask oh no why aren’t you eating. Then I will just be honest. I said that I couldn’t eat anything and you wanted to go anyway. Usually, they end up feeling terrible and it ruins their day, but they got what they wanted, to go to the place they wanted to eat. It’s kind of my little way of punishing people who want to act immature, but it does require some restraint. It just really makes me mad when people don’t actually care about you having a good time and all they care about is going to the place they want to go to; so I’m not above, making them feel really awful for it by giving them exactly what they asked for if they are hearing my hesitancy and still responding by being demanding",
      "created_utc": 1741801020.0,
      "score": 11,
      "context": [
        {
          "id": "mhb3r19",
          "author": "imhereforthemeta",
          "body": "99 percent positive these types of people are mad because they chose to go out to dinner with a friend with ARFID who asked them, please can we go somewhere where there’s food I can actually eat. I have had people throw fucking tantrums at me because I did not want to go to a sandwich place or something.",
          "created_utc": 1741741069.0
        },
        {
          "id": "mhf33np",
          "author": "kayidontcare",
          "body": "i had a friend get mad because i didn’t want to go to a SUSHI restaurant😭. it wasn’t like a planned date or anything; we were just spontaneously deciding to go out to eat and of all the places that is the one place that doesn’t have a single thing i can eat. That’s literally the only time i think i have inconvenienced somebody because of the way i eat",
          "created_utc": 1741800727.0
        }
      ]
    },
    {
      "id": "mhgvjgw",
      "author": "AlienRobotTrex",
      "body": "And even if someone is just being picky, it's better to be safe and respect their food choices.",
      "created_utc": 1741819493.0,
      "score": 4,
      "context": [
        {
          "id": "mhb2r3v",
          "author": "MysticCollective",
          "body": "This is why I don't like picky eating being associated with ARFID. I'm not being picky. I literally can't force myself to eat even if I am hungry. Picky eaters can still eat food even if they don't like something. They won't feel sick after or discomfort or have sensory overload. I lack interest in eating. My safe foods that I actually enjoy are my motivation to eat. Otherwise I would not eat. So I won't apologize for needing certain foods at a restaurant.",
          "created_utc": 1741740735.0
        },
        {
          "id": "mhbl8pw",
          "author": "dainty_dryad",
          "body": "*Needing* certain foods is exactly it. It's not my safe food because I simply prefer it over others if given the choice. It's my safe food because there is no other choice. I *cannot* eat anything else.\n\nIf you wouldn't take away a diabetic's insulin when theyre having a hypoglycemic episode, don't take away my safe food. It's that serious.",
          "created_utc": 1741747025.0
        }
      ]
    },
    {
      "id": "mhcq05q",
      "author": "devamon",
      "body": "In theory, it would most likely be fine as long as you know the meat has been kept in very food-safe conditions and generally know the animal didn't have any parasites and so on. \nI knew at least one person who would eat raw ground beef and... she was not the kind of person to know or care about these things... I imagine most of the sort of people who would snack on raw ground beef aren't.",
      "created_utc": 1741767998.0,
      "score": 8,
      "context": [
        {
          "id": "mhag9rx",
          "author": "runnawaycucumber",
          "body": "The main things I experience is people just constantly telling me how stupid and childish I am and general bullying/shaming. I personally haven't experienced those kinds of phrases and I honestly don't think I could handle it lmao. I legit refuse to make friends anymore because nobody will shut the fk up about my diagnosis lol\n\nEdit// I did ask a friend to not eat raw fucking ground beef in front of me once so idk if that count as the **\"I don't care if you're a picky eater, just don't be rude to ME if I want to order something adventurous.\"** lollllll",
          "created_utc": 1741733621.0
        },
        {
          "id": "mhb9pmc",
          "author": "SadisticGoose",
          "body": "Raw meat??? That sounds like a major health hazard that no one should be eating???",
          "created_utc": 1741743070.0
        },
        {
          "id": "mhb9sbs",
          "author": "runnawaycucumber",
          "body": "YOU WOULD THINK RIGHT?!",
          "created_utc": 1741743095.0
        }
      ]
    },
    {
      "id": "mhd5yxb",
      "author": "crustil",
      "body": "That's totally fair! There's some things for me that are more about texture, than taste. So those things I don't mind picking off. If it's a taste I can't handle, I'd just order something else (:",
      "created_utc": 1741777573.0,
      "score": 3,
      "context": [
        {
          "id": "mhaem5k",
          "author": "crustil",
          "body": "No, I literally google menus of restaurants before I go so I know what to order/if I wanna go so I don't get flustered when I'm in there 😅\n\nThis may be an ADHD thing but I frequently forget I can ask them to modify my food a bit like asking for no mushrooms on it. I'd rather just pick them off or order something else the rare time I DO remember anyway.",
          "created_utc": 1741733141.0
        },
        {
          "id": "mhanerp",
          "author": "Princesstinyk",
          "body": "I never forget but still avoid customizing because God forbid they forget I said no mushrooms and then my whole meal tastes like a mushroom. Or a pickle or whatever it is. Easier to order it as it comes so no one will mess it up and then I get an unsafe food but wasn't even expecting it",
          "created_utc": 1741735813.0
        },
        {
          "id": "mhb5r9a",
          "author": "BellZealousideal7435",
          "body": "Yeah unfortunately simply picking it off doesn’t work for me it will still make me gag if I’m still tasting it. I’d have to be remade.",
          "created_utc": 1741741741.0
        }
      ]
    }
  ]
}