{
  "id": "1jaf3vv",
  "subreddit": "ARFID",
  "author": "BeatnikMona",
  "created_utc": 1741880928.0,
  "title": "Just found out that I can’t eat like 75% of my safe foods",
  "selftext": "This is a semi rant/pity party as well as seeking advice. \n\nMy doctor and I were talking about some health issues that I have and she said that I need to cut out inflammatory foods and gave me the choice to cut out gluten or dairy. That alone set me off because I eat mostly chicken, fruit, dairy items, cereal, and pretzels. I chose gluten thinking that would be easier than dairy.\n\nI went to the grocery story yesterday and ended up crying, nearly everything that I eat contains gluten—all of the cereals that I like do, uncrustables, pretzels, and other small snacks. I figured I would get some gluten free bread and make some PPJs instead of the uncrustables but every gf bread loaf felt hard and the texture just seemed wrong. If im running late in the morning and don’t have time to make my normal breakfast (eggs, grits, and toast), I put a toaster scrambler in the toaster, that’s not an option anymore. \n\nAny suggestions for gluten free substitutes for like bread and stuff? I’m losing my mind here. \n\nEdit: I appreciate the advice and recommendations that I’ve received in here. Yesterday was my full day of not eating gluten and for the first time in a long time I woke up this morning without severe stomach cramping. I know that I don’t *have* to cut gluten if I’m not allergic, but since I woke up feeling better than I usually do and my doctor said if I don’t feel better in 30 days then I can go back to eating it, I’m feeling a little more comfortable. \n\nAlso, I tried gluten free macaroni and cheese last night, the texture is awful and I gagged so many times, never again. ",
  "url": "https://www.reddit.com/r/ARFID/comments/1jaf3vv/just_found_out_that_i_cant_eat_like_75_of_my_safe/",
  "score": 125,
  "num_comments": 59,
  "comments": [
    {
      "id": "mhl3hji",
      "author": "Lightning_And_Snow_",
      "body": "Is there a way you could explain the doctor that it's not manageable for you and causing you a severe amount of stress? I have chronic illnesses and have seen anti-inflammatory diets regularly suggested but there's just no way I could do it since so many of my safe foods contain gluten, dairy or the other things I'm meant to avoid. The stress of dealing with it is likely to make the health issues worse and overrule any benefits that avoiding those foods would have anyway.",
      "created_utc": 1741881824.0,
      "score": 114,
      "context": []
    },
    {
      "id": "mhl4i1e",
      "author": "king-of-the-sea",
      "body": "I don’t have any advice on what to get unfortunately, but I think a big part of going to a substitution is accepting that it won’t be the same.\n\nI went through this because I am lactose intolerant and love dairy. A LOT of my safe foods were dairy. I haaaated dairy substitutes because they weren’t the same. Oat milk, vegan cheese, bleh eugh yuck. Same with meat substitutes - if you are trying to imitate meat with vegetables, you’ll get something disappointing.\n\nInstead, you have to approach it as a new thing. I said I didn’t like oat milk, because it wasn’t milk and I wanted milk. My partner got some and I tried it, and eventually started buying and drinking my own. It’s delicious, but I had to approach it as a new food that was *similar* to my old food that I loved, rather than a replacement. Similarly, I like black bean patties even though I’m not vegetarian, because I like the texture and the flavor. If I bit into it expecting something meatlike, I would hate it.\n\nUnfortunately, that turns it into the age-old problem of trying new foods and trying to find new safe foods. For me it was easier because I was trying stuff that had some of the same qualities as my existing safe foods, so it wasn’t as scary. It was also harder in some ways, because I resented the substitutes for not being what I actually wanted.\n\nI hear you, I see you, and you are not alone.",
      "created_utc": 1741882113.0,
      "score": 32,
      "context": []
    },
    {
      "id": "mhlg1s3",
      "author": "ellabirde",
      "body": "I have celiac disease so I can definitely help with this! My favorite bread substitute is actually a gluten free waffle lol. The brand is Brazi Bites, they make original ones and cheesy ones - PB&J is really good on the original, as is Nutella, and they’re also great as just regular waffles with butter and syrup! And then anything savory is good on the cheesy, like a sandwich of any kind! They do not have any taste or texture difference to regular waffles like Eggo (I actually genuinely like the Brazi Bites ones better than any other frozen waffle I’ve had, including gluten ones lol). Glutino is a brand that makes incredible English muffins that are great to pop in the toaster and have with butter, cream cheese, or any kind of breakfast sandwich filling. Glutino also makes sandwich cookies that are just as good as Oreos. Snyder’s makes gluten free pretzels that are amazing and come in sticks, twists, and rods! For cereals, there are tons that are gluten free - any rice or corn Chex, lucky charms, cocoa and fruity pebbles, etc. Katz is a gluten free brand that makes amazing donuts, donut holes, and other bread-y sweet treats. Let me know if you’re looking for anything else specific and I’d be glad to help!",
      "created_utc": 1741885392.0,
      "score": 24,
      "context": []
    },
    {
      "id": "mhl9m6g",
      "author": "Beautiful-Ad-2227",
      "body": "Immediately changing the diet seems a bit cruel and unrealistic and unhealthy. Maybe transition away from gluten quickly, but not immediately, trying to find replacements.\n\n\nI now baked bread and make pizza from scratch, using a bread maker. \n\n\nGluten free flour is available and with enough practice can really dial in the flavor and texture. For us, most pizzas that can be purchased have a thick crust with a bad texture, so instead we are able to make it from scratch really thin crust. \n\n\nFor uncrustables, we make our own bread and then use a heart shaped cookie cutter and then store away for later use. For bread, we sometimes add flavorless vitamin powder to get more vitamins.\n\n\nIf you start bread making, preztels should be easy to learn as well.\n\n\nLosing cereal will be hard. Hope you can get through it all. Take it easy on yourself and believe and be hopeful. 💞",
      "created_utc": 1741883581.0,
      "score": 15,
      "context": []
    },
    {
      "id": "mhlc3k5",
      "author": "avalonrose14",
      "body": "I have a friend who’s had to cut out gluten and dairy and it’s much much easier to find good dairy alternatives than good gluten alternatives. I’d recommend cutting dairy over gluten. Lactose intolerance has become super common so there’s just more of a market for those products. I haven’t fully cut out dairy but I have cut back to basically only eating cheese and no other dairy due to my own lactose intolerance. And even cheese I use less of. Gluten is truly in like everything though. You’d be shocked how many random things have gluten. And the alternatives are either expensive as hell, gross, or both. \n\nHopefully you’re able to find something that works for you though. I know having to cut anything out when we already have so few items we can eat is really tough.",
      "created_utc": 1741884284.0,
      "score": 9,
      "context": []
    },
    {
      "id": "mhlert9",
      "author": "peachtreeparadise",
      "body": "At the end of the day, not eating food is worse than eating “inflammatory” food. Do you have celiac? I’ve tried cutting gluten before and didn’t notice any difference in my health, though all of our bodies are different. Currently we have no hard evidence that cutting gluten improves someone’s health, unless they are celiac. Of course I am not a doctor, but I am a chronically ill vet and very educated about health topics.",
      "created_utc": 1741885033.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mhnu405",
      "author": "izzy_americana",
      "body": "I would get a second opinion. You DO NOT have to avoid gluten or dairy unless you have a true allergy to these foods.",
      "created_utc": 1741910366.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mhmxqn3",
      "author": "r0ckchalk",
      "body": "If I had to eliminate gluten and dairy I would literally starve to death. I’d talk to your doctor again but also, get a referral to a nutritionist!! One who specializes in eating disorders and ARFID. I just started seeing one and she has been incredible. She is helping me find a good schedule to eat and good food to eat WITHIN my safe foods to help maximize my health. She hasn’t pressured me into any food challenges or trying something that’s not in my safe foods.",
      "created_utc": 1741900528.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mhsl2a7",
      "author": "Dim0ndDragon15",
      "body": "I actually had this happen to me, except I got celiac disease so it’s a little more intense. Honestly you’re gonna have to buy and try new things, and I know that shit is the worst, but you will find safe foods that you like even more than the old ones, and you’ll feel so so much better ",
      "created_utc": 1741978116.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mhlicre",
      "author": "knormcomix",
      "body": "I feel this pain. I suddenly became hardcore lactose intolerant this past year and suddenly all of my safe foods are dangerous for me.\n\nI've made due by finding lactase supplements that I can handle (moops is so good) and dairy free alternatives. I explain to my dietician that changing my foods is not an option, and they are usually very understanding and will suggest alternatives that they know of.\n\nTelling you to \"just cut out gluten\" is ridiculous for people like us. I'd voice your issues with your doctor.",
      "created_utc": 1741886041.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mhllonf",
      "author": "Armayra",
      "body": "Stars, I'm sorry you're going through this - I remember having to cut out the majority of my then safe foods when I got hit with the dairy allergy years ago. If you like baking/cooking, between my mom's gluten intolerance, and my dairy allergy, I've got a bunch of allergy friendly recipes I'm always happy to share and you're free to dm me. For bread, udis and schar are good, and I know Amy's is a popular brand for gf frozen meals and while they don't have anything in my safe food range, my mom always gets the pad thai and the enchiladas. [Katz Gluten Free ](http://katzglutenfree.com/) is an amazing brand, and everything they make is both dairy + gluten free - they have bread, pie, and a whole wide range of baked goods from muffins to cake to pop tarts (called toaster pastries), I love this brand so much!  For a toaster scrambler, Sweet Loren's makes a gf/df puff pastry that you could use to make the scrambler with and freeze for when you just need something quick. They also make pizza crust and cookie dough.",
      "created_utc": 1741886966.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mhln37r",
      "author": "amh8011",
      "body": "So I had to cut out gluten two years ago. Most of my safe foods were gluten containing foods. I’m located in the US, I’m not sure where you are but I’ll share my favorite gluten free substitutes that I’ve found in the US. Apologies for any weird formatting, I’m on mobile but I’ll try to make it look alright.\n\nBread:\n\n-Canyon Bakehouse Country White bread\n\n-BFree Homestyle Sandwich White Sourdough Loaf (my current favorite)\n\n-Trader Joe’s gluten free bread. I’ve tried a few and liked them. Their english muffins are also good.\n\n- I did visit the UK recently and I liked the ASDA brand gluten free sandwich bread.\n\n*you can buy a tool that cuts bread and sandwiches like uncrustables. I’m not sure where you can buy them but my parents bought one when I was little because I refused to eat sandwiches unless they were cut like uncrustables. So they do exist.\n\nCrackers:\n\n- Simple Mills brand. I personally love the tomato basil crackers but they have a variety.\n\nChicken nuggets:\n\n- Bell & Evans gluten free chicken nuggets\n\nCereal:\n\n- general mills cereals in the US are gluten free but they do have risk if cross contact with gluten. I personally do not have a reaction from eating cheerios.\n\n- granola is also an option that is usually gluten free but Idk how you feel about granola\n\n- oatmeal. So it is recommended to buy gluten free oats specifically. Oats are naturally gluten free but there can be cross contact during processing. I buy the nature’s path plain rolled oats.\n\nYou didn’t mention it but for veggie burgers, I like impossible burgers. I loved morningstar grillers but they contain gluten. Impossible burgers are a bit different than morningstar grillers but they’re still good.\n\n\nDairy substitutes:\n\nFor milk I absolutely love Oatly brand oatmilk. I mix the full fat with the regular and to me it has the same mouthfeel as 2% dairy milk. I also like their ice cream but I learned it doesn’t make great root beer floats.\n\nBeyond milk I haven’t found any dairy substitutes I like. I still eat a bit of cheese and butter. But as long as I don’t have too much cheese or butter I’m fine.\n\n\nI still haven’t found pretzels that I like or goldfish crackers. I’m not a fan of cheesy crackers that have a powdery cheese coating and most cheesy crackers I’ve tried just taste bad to me. But I love goldfish.\n\nEdit: kinnikinnick brand animal crackers and vanilla wafers are really good too. And Goodie Girl cinnamon breakfast bars.\n\nIf you’re into baking, King Arthur Baking has some great gluten free recipes. Gluten free baking is more challenging than regular baking and I ended up buying a food scale because the ratios are much more important with gluten free and measuring cups and spoons aren’t precise enough for gluten free.",
      "created_utc": 1741887362.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mhm4epo",
      "author": "madfrawgs",
      "body": "I might suggest cutting out the dairy. \n\nI find most dairy subs are just as good as lactose ones. The nice thing about dairy alts is the consistency and mouth feels stay mostly the same, if not identical. Yogurts and ice creams especially. Cheese can be tricky, but try goat or other lactose free options. Lactose free cheese has come a long way too.\n\nGluten is MUCH harder to navigate around, and is generally much more expensive, and it almost always has a different texture.\n\nI'd cut the gluten, not the dairy.\n\n  \nAnother option is to meal prep quick meals for yourself, like a toaster scrambler substitute. I'm sure YouTube has a wealth of gf meal prep ideas and recipes.",
      "created_utc": 1741892259.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mhmsuo0",
      "author": "StrawbraryLiberry",
      "body": "I would honestly question what your doctor is saying before eating a diet that is too restrictive for you. There are likely other options to reduce inflammation if that is truly an issue, but it doesn't sound like we know if those foods are hurting you at all. \n\nEating too little will do a lot of harm. What about adding something like a Turmeric or omega 3 supplement? Why not add things that reduce inflammation instead of cut out foods that may not be bothering you?",
      "created_utc": 1741899140.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mhmuwui",
      "author": "Angelangepange",
      "body": "If gluten feels this hard then how about dairy?   \nIf you try taking that out how many foods would you miss?   \n   \nAnyway I don't know if you had tests done that confirm you are gluten or lactose intolerant but I was just told by my nutritionist that this thing of the \"inflammatory foods\" is a theory not a proven fact.    \nLike that thing of the solanacea vegetables giving you inflammation also a theory.   \n     \nIt's my personal belief that a majority of human adults are inevitably lactose intolerant and that we are all just in denial but hey that too is a theory.    \n    \nIdk, I feel like even doctors give us this sense of urgency for certain things but don't even take the time to explain that it was not proven yet... so if it makes you freak out too much to give up these things maybe only try it for a limited time just to see what happens.",
      "created_utc": 1741899721.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mho1tkl",
      "author": "HourDimension1040",
      "body": "Gluten eating partner of a GF girlie here. Canyon Bakehouse. In my area it’s cheapest at hyvee. Hawaiian bread especially. If you make pbj on Hawaiian bread from canyon bakehouse and freeze them it may help the uncrustables craving. For pasta, Tinkyada. The only gf pasta that is tolerable imo. Snyders brand Gf pretzels are good too. These are my suggestions as someone who’s never eaten fully GF and so doesn’t have a tolerance for “close enough”. GF chicken tenders and strips from Realgood brand. Focus on chicken, Mexican food, and yogurt if any of your safe foods fit that description. Snacks: Fruit snacks, tortilla chips, fruity pebbles, Chex cereal, Rice Krispies bars, Honey Nut or regular Cheerios, fruit popsicles like Outshine, pickles, fruit cups or applesauce. Idk if any of those are safe foods for you but they’re what help my autistic GF girlfriend get thru eating entirely GF. Love and support from over here.",
      "created_utc": 1741912873.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mhtu3fj",
      "author": "lily_fairy",
      "body": "i have arfid and celiac disease. if you want to send me a list of your safe foods i'll send you all of my favorite substitutes! going gluten free was horrible for me in the beginning but it did get manageable once i found all my substitutes. the only thing that's hard about it now is the expense and lack of convenience because i always have to cook for myself. but i find that it is manageable with arfid now.\n\nto start, i'd highly recommend [against the grain](https://againstthegraingourmet.com) for bread. it is the only GF bread i've found that has good texture and taste, and i honestly like it better than any regular bread i had before celiac. if it's not available where you live, i'd suggest just using tortillas instead of bread because most GF bread is honestly so bad. also barilla is the only GF pasta i've tried that has a normal texture/taste for me.\n\nthis sucks and your feelings are valid. im here to help if you need it.",
      "created_utc": 1741991683.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mhyhnx9",
      "author": "Smooth_Possibility49",
      "body": "Walmart brand gluten free pasta is the best texture.  After that I like Catelli. \n\n The loopy whisk blog is one of the best recipe blogs I have found for creating GF bread/cake/cookie dupes.  She has a Cresent roll recipe that is the best I've ever had and my non gf picky kids love them. \n\nPancakes made with oat flour are the best pancakes. \n\nhttps://youtu.be/qhhmR05GqXI?si=8AOlHYfElrblgFKD ....this is the best tortilla wrap recipe ever.  \n\nBreton makes a decent gf cracker. I like the Vegitable  or herb and garlic.",
      "created_utc": 1742062202.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mijkr29",
      "author": "bokeleaf",
      "body": "Same happened to me and now I'm vitamin deficient\n\nAnd have an anxiety disorder I never had before\n\nDon't get stressed like me and don't try to go so extreme \n\n\n🥺",
      "created_utc": 1742347108.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mijlf40",
      "author": "bokeleaf",
      "body": "Baked potatoes are amazing and for me I do best with soft textures so I would recommend that :) \n\nI also do like a ground turkey taco u can do a gluten free wrap or lettuce ? Idk I really like it and I add salsa can be sweet or spicy \n\n\nWraps hold up better than bread too \n\nMango salsa is good too.",
      "created_utc": 1742347342.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mhoc3a0",
      "author": "jols0543",
      "body": "switch to dairy instead, it’s easier and the dairy free substitutes taste better than gluten free substitutes",
      "created_utc": 1741916335.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mhqo3sg",
      "author": "FairLemon6473",
      "body": "Cutting out gluten is absolute bullshit unless you are celiac or allergic to gluten",
      "created_utc": 1741957136.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mhr5yiy",
      "author": "georgecostanzalvr",
      "body": "I really recommend finding a doctor/gastroenterologist who know about ED’s. I went through a similar thing, it really rocked my world and my doctor just didn’t understand and was annoyed by my frustration and anxiety. My therapist recommended an ED informed Gastroenterologist and he has been amazing and is so much more understanding and helpful around elimination diets and stuff.",
      "created_utc": 1741963009.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mhm8tmh",
      "author": "kidfromdc",
      "body": "Are you working with a dietitian? Sadly, not a lot of doctors have a ton of experience in nutrition. Registered dietitians are accredited and certified and your insurance should cover working with one",
      "created_utc": 1741893508.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mhn7z5w",
      "author": "Preppy_Hippie",
      "body": "Can you explain a bit more about your limitations and health issues? Your doctor is correct that you are predominately eating inflammatory junk food that will make most medical conditions worse. Unfortunately, replacing these foods with other equally processed gluten-free \"foods\" or dairy alternatives will not really improve much from a health standpoint. \n\nIt's not really possible to make a dent in a chronic condition without eating a predominately whole food diet. Usually, some form of Mediterranean or WFPB diet is recommended (of course, with knowledge of food intolerances and allergies). What, specifically, is keeping you from eating vegetables, fruits, nuts, etc? Texture? Allergies? GI distress? Anxiety about them causing GI distress or being fattening? Something else? Maybe if we know more about the situation, we can make recommendations. But if it's serious enough that your Dr is telling you this- recommending a different kind of bread or processed snack, for instance, won't actually be helpful IMHO.",
      "created_utc": 1741903464.0,
      "score": -1,
      "context": []
    },
    {
      "id": "mhl5f62",
      "author": "chased444",
      "body": "Yeah trying to stick to a restricted diet just made my ARFID much worse bc it increased my obsessions/fears around food. Like I stopped being able to eat regular chicken and would only eat organic bc i was convinced it would make me “sick” and then I would end up not eating at all. I just finally had to tell myself fed is best.",
      "created_utc": 1741882378.0,
      "score": 54,
      "context": [
        {
          "id": "mhl3hji",
          "author": "Lightning_And_Snow_",
          "body": "Is there a way you could explain the doctor that it's not manageable for you and causing you a severe amount of stress? I have chronic illnesses and have seen anti-inflammatory diets regularly suggested but there's just no way I could do it since so many of my safe foods contain gluten, dairy or the other things I'm meant to avoid. The stress of dealing with it is likely to make the health issues worse and overrule any benefits that avoiding those foods would have anyway.",
          "created_utc": 1741881824.0
        }
      ]
    },
    {
      "id": "mhl4wl3",
      "author": "BeatnikMona",
      "body": "I will definitely mention it when I speak to her next, if not sooner. I had no idea how stressful it would be at the time, I thought it’d be easier than giving up dairy is all.",
      "created_utc": 1741882230.0,
      "score": 33,
      "context": [
        {
          "id": "mhl3hji",
          "author": "Lightning_And_Snow_",
          "body": "Is there a way you could explain the doctor that it's not manageable for you and causing you a severe amount of stress? I have chronic illnesses and have seen anti-inflammatory diets regularly suggested but there's just no way I could do it since so many of my safe foods contain gluten, dairy or the other things I'm meant to avoid. The stress of dealing with it is likely to make the health issues worse and overrule any benefits that avoiding those foods would have anyway.",
          "created_utc": 1741881824.0
        }
      ]
    },
    {
      "id": "mhlgklz",
      "author": "DenseAstronomer3631",
      "body": "I had a similar thought while reading this. I doubt the benefit would be worth the stress and possibly becoming malnourished or unable to eat a healthy amount",
      "created_utc": 1741885539.0,
      "score": 9,
      "context": [
        {
          "id": "mhl3hji",
          "author": "Lightning_And_Snow_",
          "body": "Is there a way you could explain the doctor that it's not manageable for you and causing you a severe amount of stress? I have chronic illnesses and have seen anti-inflammatory diets regularly suggested but there's just no way I could do it since so many of my safe foods contain gluten, dairy or the other things I'm meant to avoid. The stress of dealing with it is likely to make the health issues worse and overrule any benefits that avoiding those foods would have anyway.",
          "created_utc": 1741881824.0
        }
      ]
    },
    {
      "id": "mhlatmr",
      "author": "BeatnikMona",
      "body": "> It was also harder in some ways, because I resented the substitutes for not being what I actually wanted.\n\nYeah, that’s kind of the feeling that I had last night when I had almond flour crackers with vegan cheese last night.\n\nThank you for your insight, I appreciate it.",
      "created_utc": 1741883923.0,
      "score": 12,
      "context": [
        {
          "id": "mhl4i1e",
          "author": "king-of-the-sea",
          "body": "I don’t have any advice on what to get unfortunately, but I think a big part of going to a substitution is accepting that it won’t be the same.\n\nI went through this because I am lactose intolerant and love dairy. A LOT of my safe foods were dairy. I haaaated dairy substitutes because they weren’t the same. Oat milk, vegan cheese, bleh eugh yuck. Same with meat substitutes - if you are trying to imitate meat with vegetables, you’ll get something disappointing.\n\nInstead, you have to approach it as a new thing. I said I didn’t like oat milk, because it wasn’t milk and I wanted milk. My partner got some and I tried it, and eventually started buying and drinking my own. It’s delicious, but I had to approach it as a new food that was *similar* to my old food that I loved, rather than a replacement. Similarly, I like black bean patties even though I’m not vegetarian, because I like the texture and the flavor. If I bit into it expecting something meatlike, I would hate it.\n\nUnfortunately, that turns it into the age-old problem of trying new foods and trying to find new safe foods. For me it was easier because I was trying stuff that had some of the same qualities as my existing safe foods, so it wasn’t as scary. It was also harder in some ways, because I resented the substitutes for not being what I actually wanted.\n\nI hear you, I see you, and you are not alone.",
          "created_utc": 1741882113.0
        }
      ]
    },
    {
      "id": "mhlir4i",
      "author": "BeatnikMona",
      "body": "Omg thank you so much, this was very helpful.",
      "created_utc": 1741886154.0,
      "score": 8,
      "context": [
        {
          "id": "mhlg1s3",
          "author": "ellabirde",
          "body": "I have celiac disease so I can definitely help with this! My favorite bread substitute is actually a gluten free waffle lol. The brand is Brazi Bites, they make original ones and cheesy ones - PB&J is really good on the original, as is Nutella, and they’re also great as just regular waffles with butter and syrup! And then anything savory is good on the cheesy, like a sandwich of any kind! They do not have any taste or texture difference to regular waffles like Eggo (I actually genuinely like the Brazi Bites ones better than any other frozen waffle I’ve had, including gluten ones lol). Glutino is a brand that makes incredible English muffins that are great to pop in the toaster and have with butter, cream cheese, or any kind of breakfast sandwich filling. Glutino also makes sandwich cookies that are just as good as Oreos. Snyder’s makes gluten free pretzels that are amazing and come in sticks, twists, and rods! For cereals, there are tons that are gluten free - any rice or corn Chex, lucky charms, cocoa and fruity pebbles, etc. Katz is a gluten free brand that makes amazing donuts, donut holes, and other bread-y sweet treats. Let me know if you’re looking for anything else specific and I’d be glad to help!",
          "created_utc": 1741885392.0
        }
      ]
    },
    {
      "id": "mhlnaqn",
      "author": "amh8011",
      "body": "Ohhh I like the Katz donuts. They are good.",
      "created_utc": 1741887422.0,
      "score": 3,
      "context": [
        {
          "id": "mhlg1s3",
          "author": "ellabirde",
          "body": "I have celiac disease so I can definitely help with this! My favorite bread substitute is actually a gluten free waffle lol. The brand is Brazi Bites, they make original ones and cheesy ones - PB&J is really good on the original, as is Nutella, and they’re also great as just regular waffles with butter and syrup! And then anything savory is good on the cheesy, like a sandwich of any kind! They do not have any taste or texture difference to regular waffles like Eggo (I actually genuinely like the Brazi Bites ones better than any other frozen waffle I’ve had, including gluten ones lol). Glutino is a brand that makes incredible English muffins that are great to pop in the toaster and have with butter, cream cheese, or any kind of breakfast sandwich filling. Glutino also makes sandwich cookies that are just as good as Oreos. Snyder’s makes gluten free pretzels that are amazing and come in sticks, twists, and rods! For cereals, there are tons that are gluten free - any rice or corn Chex, lucky charms, cocoa and fruity pebbles, etc. Katz is a gluten free brand that makes amazing donuts, donut holes, and other bread-y sweet treats. Let me know if you’re looking for anything else specific and I’d be glad to help!",
          "created_utc": 1741885392.0
        }
      ]
    },
    {
      "id": "mhr8r2r",
      "author": "BeatnikMona",
      "body": "Thanks again for mentioning Brazi Bites. I’ve had the original bites before years ago and liked them, but had no idea that they had other products. I got some of their pizza roll things so fingers crossed.",
      "created_utc": 1741963843.0,
      "score": 2,
      "context": [
        {
          "id": "mhlg1s3",
          "author": "ellabirde",
          "body": "I have celiac disease so I can definitely help with this! My favorite bread substitute is actually a gluten free waffle lol. The brand is Brazi Bites, they make original ones and cheesy ones - PB&J is really good on the original, as is Nutella, and they’re also great as just regular waffles with butter and syrup! And then anything savory is good on the cheesy, like a sandwich of any kind! They do not have any taste or texture difference to regular waffles like Eggo (I actually genuinely like the Brazi Bites ones better than any other frozen waffle I’ve had, including gluten ones lol). Glutino is a brand that makes incredible English muffins that are great to pop in the toaster and have with butter, cream cheese, or any kind of breakfast sandwich filling. Glutino also makes sandwich cookies that are just as good as Oreos. Snyder’s makes gluten free pretzels that are amazing and come in sticks, twists, and rods! For cereals, there are tons that are gluten free - any rice or corn Chex, lucky charms, cocoa and fruity pebbles, etc. Katz is a gluten free brand that makes amazing donuts, donut holes, and other bread-y sweet treats. Let me know if you’re looking for anything else specific and I’d be glad to help!",
          "created_utc": 1741885392.0
        }
      ]
    },
    {
      "id": "mhlaz0a",
      "author": "BeatnikMona",
      "body": "I feel like my neurodivergent bread making era is coming…",
      "created_utc": 1741883966.0,
      "score": 10,
      "context": [
        {
          "id": "mhl9m6g",
          "author": "Beautiful-Ad-2227",
          "body": "Immediately changing the diet seems a bit cruel and unrealistic and unhealthy. Maybe transition away from gluten quickly, but not immediately, trying to find replacements.\n\n\nI now baked bread and make pizza from scratch, using a bread maker. \n\n\nGluten free flour is available and with enough practice can really dial in the flavor and texture. For us, most pizzas that can be purchased have a thick crust with a bad texture, so instead we are able to make it from scratch really thin crust. \n\n\nFor uncrustables, we make our own bread and then use a heart shaped cookie cutter and then store away for later use. For bread, we sometimes add flavorless vitamin powder to get more vitamins.\n\n\nIf you start bread making, preztels should be easy to learn as well.\n\n\nLosing cereal will be hard. Hope you can get through it all. Take it easy on yourself and believe and be hopeful. 💞",
          "created_utc": 1741883581.0
        }
      ]
    },
    {
      "id": "mhlhprg",
      "author": "BeatnikMona",
      "body": "I have PCOS and have been struggling with insulin resistance, but not celiac.",
      "created_utc": 1741885862.0,
      "score": 1,
      "context": [
        {
          "id": "mhlert9",
          "author": "peachtreeparadise",
          "body": "At the end of the day, not eating food is worse than eating “inflammatory” food. Do you have celiac? I’ve tried cutting gluten before and didn’t notice any difference in my health, though all of our bodies are different. Currently we have no hard evidence that cutting gluten improves someone’s health, unless they are celiac. Of course I am not a doctor, but I am a chronically ill vet and very educated about health topics.",
          "created_utc": 1741885033.0
        }
      ]
    },
    {
      "id": "mhrbbo9",
      "author": "Alia_Explores99",
      "body": "This. Removing entire food groups as inflammatory without a lab diagnosed allergy sounds like a fad diet theory. Ask for testing and/or a referral to a certified dietitian. A LOT of GPs are lacking in nutrition education. Can’t be an expert in everything all of the time, after all",
      "created_utc": 1741964603.0,
      "score": 4,
      "context": [
        {
          "id": "mhnu405",
          "author": "izzy_americana",
          "body": "I would get a second opinion. You DO NOT have to avoid gluten or dairy unless you have a true allergy to these foods.",
          "created_utc": 1741910366.0
        }
      ]
    },
    {
      "id": "mhndx3y",
      "author": "Preppy_Hippie",
      "body": "Unfortunately, adding something like omega 3 or turmeric will not offset inflammatory foods. I wish it worked that way, but it doesn't. At best, it will have a tiny fraction of the effect of removing the foods that negatively affect you.  I do agree completely, though, that they can't just pile on restrictions. The OP needs more support, detail and guidance than the Dr gave.",
      "created_utc": 1741905264.0,
      "score": 1,
      "context": [
        {
          "id": "mhmsuo0",
          "author": "StrawbraryLiberry",
          "body": "I would honestly question what your doctor is saying before eating a diet that is too restrictive for you. There are likely other options to reduce inflammation if that is truly an issue, but it doesn't sound like we know if those foods are hurting you at all. \n\nEating too little will do a lot of harm. What about adding something like a Turmeric or omega 3 supplement? Why not add things that reduce inflammation instead of cut out foods that may not be bothering you?",
          "created_utc": 1741899140.0
        }
      ]
    },
    {
      "id": "mhnbibo",
      "author": "Preppy_Hippie",
      "body": "You are absolutely correct about lactose. Globally, about 65-70% of people are lactose intolerant. The rates are much higher in people with ancestry closer to the equator (I've seen >80% in Mediterranean countries) and much lower with ancestry nearer to the Arctic (Northern Europe and Scandanavia, for instance). However, I believe a lot of \"lactose intolerance\" cases are actually cow dairy allergies- but I have no numbers on that",
      "created_utc": 1741904527.0,
      "score": 2,
      "context": [
        {
          "id": "mhmuwui",
          "author": "Angelangepange",
          "body": "If gluten feels this hard then how about dairy?   \nIf you try taking that out how many foods would you miss?   \n   \nAnyway I don't know if you had tests done that confirm you are gluten or lactose intolerant but I was just told by my nutritionist that this thing of the \"inflammatory foods\" is a theory not a proven fact.    \nLike that thing of the solanacea vegetables giving you inflammation also a theory.   \n     \nIt's my personal belief that a majority of human adults are inevitably lactose intolerant and that we are all just in denial but hey that too is a theory.    \n    \nIdk, I feel like even doctors give us this sense of urgency for certain things but don't even take the time to explain that it was not proven yet... so if it makes you freak out too much to give up these things maybe only try it for a limited time just to see what happens.",
          "created_utc": 1741899721.0
        }
      ]
    },
    {
      "id": "mhmdild",
      "author": "Backrow6",
      "body": "While I am neither a doctor or a dietitian this advice sounds suspiciously like Instagram granola woowoo talk. Doctors and other health professionals can be taken in by internet bullshit just like everyone else. I would definitely recommend a dietitian before making such an extreme dietary change.",
      "created_utc": 1741894834.0,
      "score": 2,
      "context": [
        {
          "id": "mhm8tmh",
          "author": "kidfromdc",
          "body": "Are you working with a dietitian? Sadly, not a lot of doctors have a ton of experience in nutrition. Registered dietitians are accredited and certified and your insurance should cover working with one",
          "created_utc": 1741893508.0
        }
      ]
    },
    {
      "id": "mhnkozx",
      "author": "BeatnikMona",
      "body": "I have PCOS and despite being 6’2, being physically active, and eating less than 1500 calories a day, I’ve been gaining weight. \n\nThis is a group for people with ARFID, so that pretty much explains your second paragraph.",
      "created_utc": 1741907371.0,
      "score": 1,
      "context": [
        {
          "id": "mhn7z5w",
          "author": "Preppy_Hippie",
          "body": "Can you explain a bit more about your limitations and health issues? Your doctor is correct that you are predominately eating inflammatory junk food that will make most medical conditions worse. Unfortunately, replacing these foods with other equally processed gluten-free \"foods\" or dairy alternatives will not really improve much from a health standpoint. \n\nIt's not really possible to make a dent in a chronic condition without eating a predominately whole food diet. Usually, some form of Mediterranean or WFPB diet is recommended (of course, with knowledge of food intolerances and allergies). What, specifically, is keeping you from eating vegetables, fruits, nuts, etc? Texture? Allergies? GI distress? Anxiety about them causing GI distress or being fattening? Something else? Maybe if we know more about the situation, we can make recommendations. But if it's serious enough that your Dr is telling you this- recommending a different kind of bread or processed snack, for instance, won't actually be helpful IMHO.",
          "created_utc": 1741903464.0
        }
      ]
    },
    {
      "id": "mhlhire",
      "author": "None",
      "body": "When you talk to your doctor I suggest you say \"eating disorder\" and say that's why you can't go on a restricted diet. Then explain the type of eating disorder you have is ARFID\n\nYou need to talk to a licensed dietician. That helped me more than anything else.",
      "created_utc": 1741885808.0,
      "score": 30,
      "context": [
        {
          "id": "mhl3hji",
          "author": "Lightning_And_Snow_",
          "body": "Is there a way you could explain the doctor that it's not manageable for you and causing you a severe amount of stress? I have chronic illnesses and have seen anti-inflammatory diets regularly suggested but there's just no way I could do it since so many of my safe foods contain gluten, dairy or the other things I'm meant to avoid. The stress of dealing with it is likely to make the health issues worse and overrule any benefits that avoiding those foods would have anyway.",
          "created_utc": 1741881824.0
        },
        {
          "id": "mhl4wl3",
          "author": "BeatnikMona",
          "body": "I will definitely mention it when I speak to her next, if not sooner. I had no idea how stressful it would be at the time, I thought it’d be easier than giving up dairy is all.",
          "created_utc": 1741882230.0
        }
      ]
    },
    {
      "id": "mhq6o6c",
      "author": "___disaster___",
      "body": "i had to go gluten free for a while for gut reasons and ive been through hell and back due to the same reasons. my arfid went from bad to worse. but it was going worse from the pain and bloatedness as well, overall i can't judge whether it was worth it or not.\n\nbe real careful with this, that's my advice. so many health issues worsen with stress that it may not be worth it. or think about changing gluten to diary, maybe some vegan substitutes would be easier than gluten free foods which are atrocious (sorry not sorry but they're all fucking disgusting).",
      "created_utc": 1741949641.0,
      "score": 2,
      "context": [
        {
          "id": "mhl3hji",
          "author": "Lightning_And_Snow_",
          "body": "Is there a way you could explain the doctor that it's not manageable for you and causing you a severe amount of stress? I have chronic illnesses and have seen anti-inflammatory diets regularly suggested but there's just no way I could do it since so many of my safe foods contain gluten, dairy or the other things I'm meant to avoid. The stress of dealing with it is likely to make the health issues worse and overrule any benefits that avoiding those foods would have anyway.",
          "created_utc": 1741881824.0
        },
        {
          "id": "mhl4wl3",
          "author": "BeatnikMona",
          "body": "I will definitely mention it when I speak to her next, if not sooner. I had no idea how stressful it would be at the time, I thought it’d be easier than giving up dairy is all.",
          "created_utc": 1741882230.0
        }
      ]
    },
    {
      "id": "mhlkmo7",
      "author": "Weary-Toast",
      "body": "To add onto this as a fellow celiac sufferer, Feel Good Foods is a great brand for gluten free convenience foods. Canyon Bakehouse Ranch has the best gluten free bread IMO but they treat their employees like garbage so I just gave up on bread all together. Jovial makes great gluten free pasta in tons of shapes (including bow tie which is my favorite pasta shape). If you like granola, Made Good has these awesome granola minis that make a great snack. Also Banza makes gluten free protein waffles, the texture is def different but I like that there’s 10g of protein in 2 waffles (they’re made from chickpeas). They’re pasta leaves ALOT to be desired 😂",
      "created_utc": 1741886672.0,
      "score": 10,
      "context": [
        {
          "id": "mhlg1s3",
          "author": "ellabirde",
          "body": "I have celiac disease so I can definitely help with this! My favorite bread substitute is actually a gluten free waffle lol. The brand is Brazi Bites, they make original ones and cheesy ones - PB&J is really good on the original, as is Nutella, and they’re also great as just regular waffles with butter and syrup! And then anything savory is good on the cheesy, like a sandwich of any kind! They do not have any taste or texture difference to regular waffles like Eggo (I actually genuinely like the Brazi Bites ones better than any other frozen waffle I’ve had, including gluten ones lol). Glutino is a brand that makes incredible English muffins that are great to pop in the toaster and have with butter, cream cheese, or any kind of breakfast sandwich filling. Glutino also makes sandwich cookies that are just as good as Oreos. Snyder’s makes gluten free pretzels that are amazing and come in sticks, twists, and rods! For cereals, there are tons that are gluten free - any rice or corn Chex, lucky charms, cocoa and fruity pebbles, etc. Katz is a gluten free brand that makes amazing donuts, donut holes, and other bread-y sweet treats. Let me know if you’re looking for anything else specific and I’d be glad to help!",
          "created_utc": 1741885392.0
        },
        {
          "id": "mhlir4i",
          "author": "BeatnikMona",
          "body": "Omg thank you so much, this was very helpful.",
          "created_utc": 1741886154.0
        }
      ]
    },
    {
      "id": "mhmeucz",
      "author": "ellabirde",
      "body": "You’re so welcome! I just completely understand where you are right now. I felt very helpless when I was diagnosed with celiac since virtually every safe food of mine had some form of gluten in it lol. But I found such great substitutes that it’s turned out so much easier than I thought it would be. It also helped that a lot of the things gluten free folks often struggle with at first are things I didn’t enjoy to begin with anyway (eating out, having home cooked meals from family and friends, trying new cuisine while traveling, etc). My stomach also started feeling SO much better because gluten wasn’t tearing it up anymore, which subsequently helped me feel so much less fearful about food in general since I didn’t have to anticipate pain after every meal. Wishing you all the best, and please do feel free to reach out anytime!\n\nEdit: also, when you’re looking up other products to try, r/glutenfree is an awesome resource :)",
      "created_utc": 1741895208.0,
      "score": 5,
      "context": [
        {
          "id": "mhlg1s3",
          "author": "ellabirde",
          "body": "I have celiac disease so I can definitely help with this! My favorite bread substitute is actually a gluten free waffle lol. The brand is Brazi Bites, they make original ones and cheesy ones - PB&J is really good on the original, as is Nutella, and they’re also great as just regular waffles with butter and syrup! And then anything savory is good on the cheesy, like a sandwich of any kind! They do not have any taste or texture difference to regular waffles like Eggo (I actually genuinely like the Brazi Bites ones better than any other frozen waffle I’ve had, including gluten ones lol). Glutino is a brand that makes incredible English muffins that are great to pop in the toaster and have with butter, cream cheese, or any kind of breakfast sandwich filling. Glutino also makes sandwich cookies that are just as good as Oreos. Snyder’s makes gluten free pretzels that are amazing and come in sticks, twists, and rods! For cereals, there are tons that are gluten free - any rice or corn Chex, lucky charms, cocoa and fruity pebbles, etc. Katz is a gluten free brand that makes amazing donuts, donut holes, and other bread-y sweet treats. Let me know if you’re looking for anything else specific and I’d be glad to help!",
          "created_utc": 1741885392.0
        },
        {
          "id": "mhlir4i",
          "author": "BeatnikMona",
          "body": "Omg thank you so much, this was very helpful.",
          "created_utc": 1741886154.0
        }
      ]
    },
    {
      "id": "mhrea4x",
      "author": "ellabirde",
      "body": "I will have my fingers crossed for you too! I think all of their stuff is tasty, I hope you like them :)",
      "created_utc": 1741965477.0,
      "score": 2,
      "context": [
        {
          "id": "mhlg1s3",
          "author": "ellabirde",
          "body": "I have celiac disease so I can definitely help with this! My favorite bread substitute is actually a gluten free waffle lol. The brand is Brazi Bites, they make original ones and cheesy ones - PB&J is really good on the original, as is Nutella, and they’re also great as just regular waffles with butter and syrup! And then anything savory is good on the cheesy, like a sandwich of any kind! They do not have any taste or texture difference to regular waffles like Eggo (I actually genuinely like the Brazi Bites ones better than any other frozen waffle I’ve had, including gluten ones lol). Glutino is a brand that makes incredible English muffins that are great to pop in the toaster and have with butter, cream cheese, or any kind of breakfast sandwich filling. Glutino also makes sandwich cookies that are just as good as Oreos. Snyder’s makes gluten free pretzels that are amazing and come in sticks, twists, and rods! For cereals, there are tons that are gluten free - any rice or corn Chex, lucky charms, cocoa and fruity pebbles, etc. Katz is a gluten free brand that makes amazing donuts, donut holes, and other bread-y sweet treats. Let me know if you’re looking for anything else specific and I’d be glad to help!",
          "created_utc": 1741885392.0
        },
        {
          "id": "mhr8r2r",
          "author": "BeatnikMona",
          "body": "Thanks again for mentioning Brazi Bites. I’ve had the original bites before years ago and liked them, but had no idea that they had other products. I got some of their pizza roll things so fingers crossed.",
          "created_utc": 1741963843.0
        }
      ]
    },
    {
      "id": "mhnt6x3",
      "author": "Preppy_Hippie",
      "body": "Thanks for sharing those details. From what you shared, I would recommend looking at Dr. Goldner and her “Goodbye Lupus” and “Goodbye Autoimmune” protocols - with some caveats.  She has a very specific diet, which would help. Once you dial it in to your preferences and tolerances, she has no problem with you eating the same short list of foods every day. She’s also fine with you blending everything if it is too hard to eat. You can also slowly transition to the diet or partially do it by supplementing your current comfort foods with her core smoothies and seeing if that is enough to move the needle.\n\nUnfortunately, I am new to the group and not super knowledgable about ARFID. Instead, I’ve had lifelong illness that has been managed and treated by restricted diets. So just from the description of ARFID, in my mind, a lot of different causes, symptoms, and restrictions could be happening that fall under that umbrella.\n\nSo, that being said, I’m not sure if you could tolerate her protocol or approach. Dr G. has a psychiatry and trauma background - but I find her approach pretty hard charging. So, IDK if you will mesh with her or can handle her smoothies and foods. I also don’t know if you’ve tried CBT, or would be willing to. Unfortunately, this is the type of dietary direction you need to go for these physical issues to improve. The question is, what kind of support and approach do you need to get there? I hope that is helpful.",
      "created_utc": 1741910072.0,
      "score": -1,
      "context": [
        {
          "id": "mhn7z5w",
          "author": "Preppy_Hippie",
          "body": "Can you explain a bit more about your limitations and health issues? Your doctor is correct that you are predominately eating inflammatory junk food that will make most medical conditions worse. Unfortunately, replacing these foods with other equally processed gluten-free \"foods\" or dairy alternatives will not really improve much from a health standpoint. \n\nIt's not really possible to make a dent in a chronic condition without eating a predominately whole food diet. Usually, some form of Mediterranean or WFPB diet is recommended (of course, with knowledge of food intolerances and allergies). What, specifically, is keeping you from eating vegetables, fruits, nuts, etc? Texture? Allergies? GI distress? Anxiety about them causing GI distress or being fattening? Something else? Maybe if we know more about the situation, we can make recommendations. But if it's serious enough that your Dr is telling you this- recommending a different kind of bread or processed snack, for instance, won't actually be helpful IMHO.",
          "created_utc": 1741903464.0
        },
        {
          "id": "mhnkozx",
          "author": "BeatnikMona",
          "body": "I have PCOS and despite being 6’2, being physically active, and eating less than 1500 calories a day, I’ve been gaining weight. \n\nThis is a group for people with ARFID, so that pretty much explains your second paragraph.",
          "created_utc": 1741907371.0
        }
      ]
    },
    {
      "id": "mhlj7gj",
      "author": "BeatnikMona",
      "body": "I was recently prescribed Wegovy, would saying that I have an eating disorder be a red flag for my doctor? \n\nMy old therapist knows, I recently moved so I’m getting medical care established right now in my new place.",
      "created_utc": 1741886279.0,
      "score": 11,
      "context": [
        {
          "id": "mhl3hji",
          "author": "Lightning_And_Snow_",
          "body": "Is there a way you could explain the doctor that it's not manageable for you and causing you a severe amount of stress? I have chronic illnesses and have seen anti-inflammatory diets regularly suggested but there's just no way I could do it since so many of my safe foods contain gluten, dairy or the other things I'm meant to avoid. The stress of dealing with it is likely to make the health issues worse and overrule any benefits that avoiding those foods would have anyway.",
          "created_utc": 1741881824.0
        },
        {
          "id": "mhl4wl3",
          "author": "BeatnikMona",
          "body": "I will definitely mention it when I speak to her next, if not sooner. I had no idea how stressful it would be at the time, I thought it’d be easier than giving up dairy is all.",
          "created_utc": 1741882230.0
        },
        {
          "id": "mhlhire",
          "author": "None",
          "body": "When you talk to your doctor I suggest you say \"eating disorder\" and say that's why you can't go on a restricted diet. Then explain the type of eating disorder you have is ARFID\n\nYou need to talk to a licensed dietician. That helped me more than anything else.",
          "created_utc": 1741885808.0
        }
      ]
    },
    {
      "id": "mhlld3e",
      "author": "BeatnikMona",
      "body": "My boyfriend recommended the Canyon Bakehouse Ranch bread but the texture and hardness that I could feel through the packaging was a nope.\n\nI’ll look into those other brands, I did hear Jovial is good.",
      "created_utc": 1741886876.0,
      "score": 5,
      "context": [
        {
          "id": "mhlg1s3",
          "author": "ellabirde",
          "body": "I have celiac disease so I can definitely help with this! My favorite bread substitute is actually a gluten free waffle lol. The brand is Brazi Bites, they make original ones and cheesy ones - PB&J is really good on the original, as is Nutella, and they’re also great as just regular waffles with butter and syrup! And then anything savory is good on the cheesy, like a sandwich of any kind! They do not have any taste or texture difference to regular waffles like Eggo (I actually genuinely like the Brazi Bites ones better than any other frozen waffle I’ve had, including gluten ones lol). Glutino is a brand that makes incredible English muffins that are great to pop in the toaster and have with butter, cream cheese, or any kind of breakfast sandwich filling. Glutino also makes sandwich cookies that are just as good as Oreos. Snyder’s makes gluten free pretzels that are amazing and come in sticks, twists, and rods! For cereals, there are tons that are gluten free - any rice or corn Chex, lucky charms, cocoa and fruity pebbles, etc. Katz is a gluten free brand that makes amazing donuts, donut holes, and other bread-y sweet treats. Let me know if you’re looking for anything else specific and I’d be glad to help!",
          "created_utc": 1741885392.0
        },
        {
          "id": "mhlir4i",
          "author": "BeatnikMona",
          "body": "Omg thank you so much, this was very helpful.",
          "created_utc": 1741886154.0
        },
        {
          "id": "mhlkmo7",
          "author": "Weary-Toast",
          "body": "To add onto this as a fellow celiac sufferer, Feel Good Foods is a great brand for gluten free convenience foods. Canyon Bakehouse Ranch has the best gluten free bread IMO but they treat their employees like garbage so I just gave up on bread all together. Jovial makes great gluten free pasta in tons of shapes (including bow tie which is my favorite pasta shape). If you like granola, Made Good has these awesome granola minis that make a great snack. Also Banza makes gluten free protein waffles, the texture is def different but I like that there’s 10g of protein in 2 waffles (they’re made from chickpeas). They’re pasta leaves ALOT to be desired 😂",
          "created_utc": 1741886672.0
        }
      ]
    },
    {
      "id": "mhstp5s",
      "author": "BeatnikMona",
      "body": "Eating them for lunch, they’re good!",
      "created_utc": 1741980691.0,
      "score": 2,
      "context": [
        {
          "id": "mhlg1s3",
          "author": "ellabirde",
          "body": "I have celiac disease so I can definitely help with this! My favorite bread substitute is actually a gluten free waffle lol. The brand is Brazi Bites, they make original ones and cheesy ones - PB&J is really good on the original, as is Nutella, and they’re also great as just regular waffles with butter and syrup! And then anything savory is good on the cheesy, like a sandwich of any kind! They do not have any taste or texture difference to regular waffles like Eggo (I actually genuinely like the Brazi Bites ones better than any other frozen waffle I’ve had, including gluten ones lol). Glutino is a brand that makes incredible English muffins that are great to pop in the toaster and have with butter, cream cheese, or any kind of breakfast sandwich filling. Glutino also makes sandwich cookies that are just as good as Oreos. Snyder’s makes gluten free pretzels that are amazing and come in sticks, twists, and rods! For cereals, there are tons that are gluten free - any rice or corn Chex, lucky charms, cocoa and fruity pebbles, etc. Katz is a gluten free brand that makes amazing donuts, donut holes, and other bread-y sweet treats. Let me know if you’re looking for anything else specific and I’d be glad to help!",
          "created_utc": 1741885392.0
        },
        {
          "id": "mhr8r2r",
          "author": "BeatnikMona",
          "body": "Thanks again for mentioning Brazi Bites. I’ve had the original bites before years ago and liked them, but had no idea that they had other products. I got some of their pizza roll things so fingers crossed.",
          "created_utc": 1741963843.0
        },
        {
          "id": "mhrea4x",
          "author": "ellabirde",
          "body": "I will have my fingers crossed for you too! I think all of their stuff is tasty, I hope you like them :)",
          "created_utc": 1741965477.0
        }
      ]
    },
    {
      "id": "mho0ubu",
      "author": "BeatnikMona",
      "body": "ARFID is an eating disorder where we only feel safe eating certain foods, and it’s fairly common for someone on the spectrum like myself to have it. The list of foods that I am willing to eat is medium-high from what I’ve been told, but more often than not, I will throw up if I don’t like the smell or texture of foods and I’m severely phobic or anything seafood. \n\nFad restrictive diets typically do not work for us.",
      "created_utc": 1741912555.0,
      "score": 2,
      "context": [
        {
          "id": "mhn7z5w",
          "author": "Preppy_Hippie",
          "body": "Can you explain a bit more about your limitations and health issues? Your doctor is correct that you are predominately eating inflammatory junk food that will make most medical conditions worse. Unfortunately, replacing these foods with other equally processed gluten-free \"foods\" or dairy alternatives will not really improve much from a health standpoint. \n\nIt's not really possible to make a dent in a chronic condition without eating a predominately whole food diet. Usually, some form of Mediterranean or WFPB diet is recommended (of course, with knowledge of food intolerances and allergies). What, specifically, is keeping you from eating vegetables, fruits, nuts, etc? Texture? Allergies? GI distress? Anxiety about them causing GI distress or being fattening? Something else? Maybe if we know more about the situation, we can make recommendations. But if it's serious enough that your Dr is telling you this- recommending a different kind of bread or processed snack, for instance, won't actually be helpful IMHO.",
          "created_utc": 1741903464.0
        },
        {
          "id": "mhnkozx",
          "author": "BeatnikMona",
          "body": "I have PCOS and despite being 6’2, being physically active, and eating less than 1500 calories a day, I’ve been gaining weight. \n\nThis is a group for people with ARFID, so that pretty much explains your second paragraph.",
          "created_utc": 1741907371.0
        },
        {
          "id": "mhnt6x3",
          "author": "Preppy_Hippie",
          "body": "Thanks for sharing those details. From what you shared, I would recommend looking at Dr. Goldner and her “Goodbye Lupus” and “Goodbye Autoimmune” protocols - with some caveats.  She has a very specific diet, which would help. Once you dial it in to your preferences and tolerances, she has no problem with you eating the same short list of foods every day. She’s also fine with you blending everything if it is too hard to eat. You can also slowly transition to the diet or partially do it by supplementing your current comfort foods with her core smoothies and seeing if that is enough to move the needle.\n\nUnfortunately, I am new to the group and not super knowledgable about ARFID. Instead, I’ve had lifelong illness that has been managed and treated by restricted diets. So just from the description of ARFID, in my mind, a lot of different causes, symptoms, and restrictions could be happening that fall under that umbrella.\n\nSo, that being said, I’m not sure if you could tolerate her protocol or approach. Dr G. has a psychiatry and trauma background - but I find her approach pretty hard charging. So, IDK if you will mesh with her or can handle her smoothies and foods. I also don’t know if you’ve tried CBT, or would be willing to. Unfortunately, this is the type of dietary direction you need to go for these physical issues to improve. The question is, what kind of support and approach do you need to get there? I hope that is helpful.",
          "created_utc": 1741910072.0
        }
      ]
    },
    {
      "id": "mho6jb7",
      "author": "FlemFatale",
      "body": "Just to add that ARFID is not just a restricted diet. Nor is it as simple as that. It stands for Avoidant Restrictive Food Intake Disorder and has three main types.  \n**Sensory**, where you restrict your diet due to the sensory properties of food causing over stimulation or sensitivity. This can be because of smells, textures, appearance, colour, etc. It can also include interoception (how you feel things in your body).  \n**Lack of interest**, where you have little to no interest in food. This could be exhibited by having no appetite, being extremely picky with what you eat, forgetting to eat, and getting distracted during mealtimes.  \n**Fear of averse consequences**, where you have fear reactions to food because you are scared of choking, nausea, vomiting, or pain that occurs after eating. This can often be caused by a specific traumatic event in the past (eg, choking on something, so never eating it again in case of reoccurrence of that incident).  \nA person with ARFID can have any one (or more) of these types to varying degrees of severity.  \n\nFor example, at the moment, I can only eat a few things due to sensory reasons (mainly texture for me, for example smoothies and drinks with bits in make me want to be sick and have done for my whole life), and things just feeling wrong in my mouth or just feel like too much and overwhelm me. There are a lot of foods that I will never and have never tried, and I can say for sure that I will not like them based on how they look. I also don't feel hunger in the same way as other people appear to, because I struggle with interoception due to Autism (another example is not knowing I need the toilet until I'm desperate), and get into states of hyperfocus where I totally lose track of anything else I'm doing for hours and totally forget to eat or drink or do anything apart from the one thing I am focuaing on. I also had an incident last year when I got sick just after eating one of my safe foods and now can't eat it due to being scared of being sick again because I can't stand the texture or taste of sick.  \n\nA restricted diet is not a treatment for ARFID. It is a consequence of having ARFID.",
      "created_utc": 1741914428.0,
      "score": 2,
      "context": [
        {
          "id": "mhn7z5w",
          "author": "Preppy_Hippie",
          "body": "Can you explain a bit more about your limitations and health issues? Your doctor is correct that you are predominately eating inflammatory junk food that will make most medical conditions worse. Unfortunately, replacing these foods with other equally processed gluten-free \"foods\" or dairy alternatives will not really improve much from a health standpoint. \n\nIt's not really possible to make a dent in a chronic condition without eating a predominately whole food diet. Usually, some form of Mediterranean or WFPB diet is recommended (of course, with knowledge of food intolerances and allergies). What, specifically, is keeping you from eating vegetables, fruits, nuts, etc? Texture? Allergies? GI distress? Anxiety about them causing GI distress or being fattening? Something else? Maybe if we know more about the situation, we can make recommendations. But if it's serious enough that your Dr is telling you this- recommending a different kind of bread or processed snack, for instance, won't actually be helpful IMHO.",
          "created_utc": 1741903464.0
        },
        {
          "id": "mhnkozx",
          "author": "BeatnikMona",
          "body": "I have PCOS and despite being 6’2, being physically active, and eating less than 1500 calories a day, I’ve been gaining weight. \n\nThis is a group for people with ARFID, so that pretty much explains your second paragraph.",
          "created_utc": 1741907371.0
        },
        {
          "id": "mhnt6x3",
          "author": "Preppy_Hippie",
          "body": "Thanks for sharing those details. From what you shared, I would recommend looking at Dr. Goldner and her “Goodbye Lupus” and “Goodbye Autoimmune” protocols - with some caveats.  She has a very specific diet, which would help. Once you dial it in to your preferences and tolerances, she has no problem with you eating the same short list of foods every day. She’s also fine with you blending everything if it is too hard to eat. You can also slowly transition to the diet or partially do it by supplementing your current comfort foods with her core smoothies and seeing if that is enough to move the needle.\n\nUnfortunately, I am new to the group and not super knowledgable about ARFID. Instead, I’ve had lifelong illness that has been managed and treated by restricted diets. So just from the description of ARFID, in my mind, a lot of different causes, symptoms, and restrictions could be happening that fall under that umbrella.\n\nSo, that being said, I’m not sure if you could tolerate her protocol or approach. Dr G. has a psychiatry and trauma background - but I find her approach pretty hard charging. So, IDK if you will mesh with her or can handle her smoothies and foods. I also don’t know if you’ve tried CBT, or would be willing to. Unfortunately, this is the type of dietary direction you need to go for these physical issues to improve. The question is, what kind of support and approach do you need to get there? I hope that is helpful.",
          "created_utc": 1741910072.0
        }
      ]
    },
    {
      "id": "mhlt0cq",
      "author": "None",
      "body": "Yeah... Especially if they aren't already familiar with ARFID. Those weight loss drugs cause ARFID like symptoms for a lot of people \n\nSeriously, talk to a dietician",
      "created_utc": 1741889026.0,
      "score": 23,
      "context": [
        {
          "id": "mhl3hji",
          "author": "Lightning_And_Snow_",
          "body": "Is there a way you could explain the doctor that it's not manageable for you and causing you a severe amount of stress? I have chronic illnesses and have seen anti-inflammatory diets regularly suggested but there's just no way I could do it since so many of my safe foods contain gluten, dairy or the other things I'm meant to avoid. The stress of dealing with it is likely to make the health issues worse and overrule any benefits that avoiding those foods would have anyway.",
          "created_utc": 1741881824.0
        },
        {
          "id": "mhl4wl3",
          "author": "BeatnikMona",
          "body": "I will definitely mention it when I speak to her next, if not sooner. I had no idea how stressful it would be at the time, I thought it’d be easier than giving up dairy is all.",
          "created_utc": 1741882230.0
        },
        {
          "id": "mhlhire",
          "author": "None",
          "body": "When you talk to your doctor I suggest you say \"eating disorder\" and say that's why you can't go on a restricted diet. Then explain the type of eating disorder you have is ARFID\n\nYou need to talk to a licensed dietician. That helped me more than anything else.",
          "created_utc": 1741885808.0
        },
        {
          "id": "mhlj7gj",
          "author": "BeatnikMona",
          "body": "I was recently prescribed Wegovy, would saying that I have an eating disorder be a red flag for my doctor? \n\nMy old therapist knows, I recently moved so I’m getting medical care established right now in my new place.",
          "created_utc": 1741886279.0
        }
      ]
    },
    {
      "id": "mho2c1n",
      "author": "HourDimension1040",
      "body": "I know they package it in a plastic pan inside the plastic bagging, could that have been what you were feeling?",
      "created_utc": 1741913040.0,
      "score": 2,
      "context": [
        {
          "id": "mhlg1s3",
          "author": "ellabirde",
          "body": "I have celiac disease so I can definitely help with this! My favorite bread substitute is actually a gluten free waffle lol. The brand is Brazi Bites, they make original ones and cheesy ones - PB&J is really good on the original, as is Nutella, and they’re also great as just regular waffles with butter and syrup! And then anything savory is good on the cheesy, like a sandwich of any kind! They do not have any taste or texture difference to regular waffles like Eggo (I actually genuinely like the Brazi Bites ones better than any other frozen waffle I’ve had, including gluten ones lol). Glutino is a brand that makes incredible English muffins that are great to pop in the toaster and have with butter, cream cheese, or any kind of breakfast sandwich filling. Glutino also makes sandwich cookies that are just as good as Oreos. Snyder’s makes gluten free pretzels that are amazing and come in sticks, twists, and rods! For cereals, there are tons that are gluten free - any rice or corn Chex, lucky charms, cocoa and fruity pebbles, etc. Katz is a gluten free brand that makes amazing donuts, donut holes, and other bread-y sweet treats. Let me know if you’re looking for anything else specific and I’d be glad to help!",
          "created_utc": 1741885392.0
        },
        {
          "id": "mhlir4i",
          "author": "BeatnikMona",
          "body": "Omg thank you so much, this was very helpful.",
          "created_utc": 1741886154.0
        },
        {
          "id": "mhlkmo7",
          "author": "Weary-Toast",
          "body": "To add onto this as a fellow celiac sufferer, Feel Good Foods is a great brand for gluten free convenience foods. Canyon Bakehouse Ranch has the best gluten free bread IMO but they treat their employees like garbage so I just gave up on bread all together. Jovial makes great gluten free pasta in tons of shapes (including bow tie which is my favorite pasta shape). If you like granola, Made Good has these awesome granola minis that make a great snack. Also Banza makes gluten free protein waffles, the texture is def different but I like that there’s 10g of protein in 2 waffles (they’re made from chickpeas). They’re pasta leaves ALOT to be desired 😂",
          "created_utc": 1741886672.0
        },
        {
          "id": "mhlld3e",
          "author": "BeatnikMona",
          "body": "My boyfriend recommended the Canyon Bakehouse Ranch bread but the texture and hardness that I could feel through the packaging was a nope.\n\nI’ll look into those other brands, I did hear Jovial is good.",
          "created_utc": 1741886876.0
        }
      ]
    },
    {
      "id": "mht3g1l",
      "author": "ellabirde",
      "body": "Yay!!",
      "created_utc": 1741983578.0,
      "score": 2,
      "context": [
        {
          "id": "mhlg1s3",
          "author": "ellabirde",
          "body": "I have celiac disease so I can definitely help with this! My favorite bread substitute is actually a gluten free waffle lol. The brand is Brazi Bites, they make original ones and cheesy ones - PB&J is really good on the original, as is Nutella, and they’re also great as just regular waffles with butter and syrup! And then anything savory is good on the cheesy, like a sandwich of any kind! They do not have any taste or texture difference to regular waffles like Eggo (I actually genuinely like the Brazi Bites ones better than any other frozen waffle I’ve had, including gluten ones lol). Glutino is a brand that makes incredible English muffins that are great to pop in the toaster and have with butter, cream cheese, or any kind of breakfast sandwich filling. Glutino also makes sandwich cookies that are just as good as Oreos. Snyder’s makes gluten free pretzels that are amazing and come in sticks, twists, and rods! For cereals, there are tons that are gluten free - any rice or corn Chex, lucky charms, cocoa and fruity pebbles, etc. Katz is a gluten free brand that makes amazing donuts, donut holes, and other bread-y sweet treats. Let me know if you’re looking for anything else specific and I’d be glad to help!",
          "created_utc": 1741885392.0
        },
        {
          "id": "mhr8r2r",
          "author": "BeatnikMona",
          "body": "Thanks again for mentioning Brazi Bites. I’ve had the original bites before years ago and liked them, but had no idea that they had other products. I got some of their pizza roll things so fingers crossed.",
          "created_utc": 1741963843.0
        },
        {
          "id": "mhrea4x",
          "author": "ellabirde",
          "body": "I will have my fingers crossed for you too! I think all of their stuff is tasty, I hope you like them :)",
          "created_utc": 1741965477.0
        },
        {
          "id": "mhstp5s",
          "author": "BeatnikMona",
          "body": "Eating them for lunch, they’re good!",
          "created_utc": 1741980691.0
        }
      ]
    },
    {
      "id": "mho3xbp",
      "author": "Preppy_Hippie",
      "body": "Good thing I didn’t recommend a fad diet. \n\nYou mentioned what you mostly eat- but not your full list. Medium-high sounds very promising, but again, IDK what that means. I am hoping there are other healthier foods you can tolerate, but you just prefer to lean on the ones you mentioned.\n\nI understand this is very challenging, but the reality is that you are encountering a conflict between your ARFID and physical health. Have you tried CBT or are there similar things that have helped anyone in the group to expand their diet, even slightly?",
      "created_utc": 1741913559.0,
      "score": 0,
      "context": [
        {
          "id": "mhn7z5w",
          "author": "Preppy_Hippie",
          "body": "Can you explain a bit more about your limitations and health issues? Your doctor is correct that you are predominately eating inflammatory junk food that will make most medical conditions worse. Unfortunately, replacing these foods with other equally processed gluten-free \"foods\" or dairy alternatives will not really improve much from a health standpoint. \n\nIt's not really possible to make a dent in a chronic condition without eating a predominately whole food diet. Usually, some form of Mediterranean or WFPB diet is recommended (of course, with knowledge of food intolerances and allergies). What, specifically, is keeping you from eating vegetables, fruits, nuts, etc? Texture? Allergies? GI distress? Anxiety about them causing GI distress or being fattening? Something else? Maybe if we know more about the situation, we can make recommendations. But if it's serious enough that your Dr is telling you this- recommending a different kind of bread or processed snack, for instance, won't actually be helpful IMHO.",
          "created_utc": 1741903464.0
        },
        {
          "id": "mhnkozx",
          "author": "BeatnikMona",
          "body": "I have PCOS and despite being 6’2, being physically active, and eating less than 1500 calories a day, I’ve been gaining weight. \n\nThis is a group for people with ARFID, so that pretty much explains your second paragraph.",
          "created_utc": 1741907371.0
        },
        {
          "id": "mhnt6x3",
          "author": "Preppy_Hippie",
          "body": "Thanks for sharing those details. From what you shared, I would recommend looking at Dr. Goldner and her “Goodbye Lupus” and “Goodbye Autoimmune” protocols - with some caveats.  She has a very specific diet, which would help. Once you dial it in to your preferences and tolerances, she has no problem with you eating the same short list of foods every day. She’s also fine with you blending everything if it is too hard to eat. You can also slowly transition to the diet or partially do it by supplementing your current comfort foods with her core smoothies and seeing if that is enough to move the needle.\n\nUnfortunately, I am new to the group and not super knowledgable about ARFID. Instead, I’ve had lifelong illness that has been managed and treated by restricted diets. So just from the description of ARFID, in my mind, a lot of different causes, symptoms, and restrictions could be happening that fall under that umbrella.\n\nSo, that being said, I’m not sure if you could tolerate her protocol or approach. Dr G. has a psychiatry and trauma background - but I find her approach pretty hard charging. So, IDK if you will mesh with her or can handle her smoothies and foods. I also don’t know if you’ve tried CBT, or would be willing to. Unfortunately, this is the type of dietary direction you need to go for these physical issues to improve. The question is, what kind of support and approach do you need to get there? I hope that is helpful.",
          "created_utc": 1741910072.0
        },
        {
          "id": "mho0ubu",
          "author": "BeatnikMona",
          "body": "ARFID is an eating disorder where we only feel safe eating certain foods, and it’s fairly common for someone on the spectrum like myself to have it. The list of foods that I am willing to eat is medium-high from what I’ve been told, but more often than not, I will throw up if I don’t like the smell or texture of foods and I’m severely phobic or anything seafood. \n\nFad restrictive diets typically do not work for us.",
          "created_utc": 1741912555.0
        }
      ]
    },
    {
      "id": "mhol3re",
      "author": "Preppy_Hippie",
      "body": "In case all the downvotes are from you- just to clarify, I'm not trying to make you feel bad or cause distress. The science is clear, but the fact of the matter is that your PCOS won't kill you. If an anti-inflammatory diet isn't an option and is too distressing, then it isn't. Ask your Dr to back off and to just manage the symptoms medically. You will be OK. I guess what I've also been getting at is, in that case, to also not worry too much about minor substitutions or further dietary restrictions. It will be more stressful than beneficial.\n\nSending you only best wishes.",
      "created_utc": 1741919437.0,
      "score": 0,
      "context": [
        {
          "id": "mhn7z5w",
          "author": "Preppy_Hippie",
          "body": "Can you explain a bit more about your limitations and health issues? Your doctor is correct that you are predominately eating inflammatory junk food that will make most medical conditions worse. Unfortunately, replacing these foods with other equally processed gluten-free \"foods\" or dairy alternatives will not really improve much from a health standpoint. \n\nIt's not really possible to make a dent in a chronic condition without eating a predominately whole food diet. Usually, some form of Mediterranean or WFPB diet is recommended (of course, with knowledge of food intolerances and allergies). What, specifically, is keeping you from eating vegetables, fruits, nuts, etc? Texture? Allergies? GI distress? Anxiety about them causing GI distress or being fattening? Something else? Maybe if we know more about the situation, we can make recommendations. But if it's serious enough that your Dr is telling you this- recommending a different kind of bread or processed snack, for instance, won't actually be helpful IMHO.",
          "created_utc": 1741903464.0
        },
        {
          "id": "mhnkozx",
          "author": "BeatnikMona",
          "body": "I have PCOS and despite being 6’2, being physically active, and eating less than 1500 calories a day, I’ve been gaining weight. \n\nThis is a group for people with ARFID, so that pretty much explains your second paragraph.",
          "created_utc": 1741907371.0
        },
        {
          "id": "mhnt6x3",
          "author": "Preppy_Hippie",
          "body": "Thanks for sharing those details. From what you shared, I would recommend looking at Dr. Goldner and her “Goodbye Lupus” and “Goodbye Autoimmune” protocols - with some caveats.  She has a very specific diet, which would help. Once you dial it in to your preferences and tolerances, she has no problem with you eating the same short list of foods every day. She’s also fine with you blending everything if it is too hard to eat. You can also slowly transition to the diet or partially do it by supplementing your current comfort foods with her core smoothies and seeing if that is enough to move the needle.\n\nUnfortunately, I am new to the group and not super knowledgable about ARFID. Instead, I’ve had lifelong illness that has been managed and treated by restricted diets. So just from the description of ARFID, in my mind, a lot of different causes, symptoms, and restrictions could be happening that fall under that umbrella.\n\nSo, that being said, I’m not sure if you could tolerate her protocol or approach. Dr G. has a psychiatry and trauma background - but I find her approach pretty hard charging. So, IDK if you will mesh with her or can handle her smoothies and foods. I also don’t know if you’ve tried CBT, or would be willing to. Unfortunately, this is the type of dietary direction you need to go for these physical issues to improve. The question is, what kind of support and approach do you need to get there? I hope that is helpful.",
          "created_utc": 1741910072.0
        },
        {
          "id": "mho0ubu",
          "author": "BeatnikMona",
          "body": "ARFID is an eating disorder where we only feel safe eating certain foods, and it’s fairly common for someone on the spectrum like myself to have it. The list of foods that I am willing to eat is medium-high from what I’ve been told, but more often than not, I will throw up if I don’t like the smell or texture of foods and I’m severely phobic or anything seafood. \n\nFad restrictive diets typically do not work for us.",
          "created_utc": 1741912555.0
        }
      ]
    },
    {
      "id": "mhoba22",
      "author": "Preppy_Hippie",
      "body": "Thank you for that explanation. My understanding wasn't far off. You are explaining what I was referring to: that there are many different causes, symptoms, and specific food limitations. This is why I asked for more detail to see if there is a way of following the spirit of the Dr’s guidance- which was to switch to an anti-imflammatory diet.\n\nAgain, just to clarify, I am not recommending a restricted diet as a treatment for ARFID. The OP has health issues that would be addressed by an anti-inflammatory diet and I'm trying to provide guidance and assistance in that direction, understanding that accommodation and some compromise will be required. ",
      "created_utc": 1741916052.0,
      "score": 1,
      "context": [
        {
          "id": "mhn7z5w",
          "author": "Preppy_Hippie",
          "body": "Can you explain a bit more about your limitations and health issues? Your doctor is correct that you are predominately eating inflammatory junk food that will make most medical conditions worse. Unfortunately, replacing these foods with other equally processed gluten-free \"foods\" or dairy alternatives will not really improve much from a health standpoint. \n\nIt's not really possible to make a dent in a chronic condition without eating a predominately whole food diet. Usually, some form of Mediterranean or WFPB diet is recommended (of course, with knowledge of food intolerances and allergies). What, specifically, is keeping you from eating vegetables, fruits, nuts, etc? Texture? Allergies? GI distress? Anxiety about them causing GI distress or being fattening? Something else? Maybe if we know more about the situation, we can make recommendations. But if it's serious enough that your Dr is telling you this- recommending a different kind of bread or processed snack, for instance, won't actually be helpful IMHO.",
          "created_utc": 1741903464.0
        },
        {
          "id": "mhnkozx",
          "author": "BeatnikMona",
          "body": "I have PCOS and despite being 6’2, being physically active, and eating less than 1500 calories a day, I’ve been gaining weight. \n\nThis is a group for people with ARFID, so that pretty much explains your second paragraph.",
          "created_utc": 1741907371.0
        },
        {
          "id": "mhnt6x3",
          "author": "Preppy_Hippie",
          "body": "Thanks for sharing those details. From what you shared, I would recommend looking at Dr. Goldner and her “Goodbye Lupus” and “Goodbye Autoimmune” protocols - with some caveats.  She has a very specific diet, which would help. Once you dial it in to your preferences and tolerances, she has no problem with you eating the same short list of foods every day. She’s also fine with you blending everything if it is too hard to eat. You can also slowly transition to the diet or partially do it by supplementing your current comfort foods with her core smoothies and seeing if that is enough to move the needle.\n\nUnfortunately, I am new to the group and not super knowledgable about ARFID. Instead, I’ve had lifelong illness that has been managed and treated by restricted diets. So just from the description of ARFID, in my mind, a lot of different causes, symptoms, and restrictions could be happening that fall under that umbrella.\n\nSo, that being said, I’m not sure if you could tolerate her protocol or approach. Dr G. has a psychiatry and trauma background - but I find her approach pretty hard charging. So, IDK if you will mesh with her or can handle her smoothies and foods. I also don’t know if you’ve tried CBT, or would be willing to. Unfortunately, this is the type of dietary direction you need to go for these physical issues to improve. The question is, what kind of support and approach do you need to get there? I hope that is helpful.",
          "created_utc": 1741910072.0
        },
        {
          "id": "mho6jb7",
          "author": "FlemFatale",
          "body": "Just to add that ARFID is not just a restricted diet. Nor is it as simple as that. It stands for Avoidant Restrictive Food Intake Disorder and has three main types.  \n**Sensory**, where you restrict your diet due to the sensory properties of food causing over stimulation or sensitivity. This can be because of smells, textures, appearance, colour, etc. It can also include interoception (how you feel things in your body).  \n**Lack of interest**, where you have little to no interest in food. This could be exhibited by having no appetite, being extremely picky with what you eat, forgetting to eat, and getting distracted during mealtimes.  \n**Fear of averse consequences**, where you have fear reactions to food because you are scared of choking, nausea, vomiting, or pain that occurs after eating. This can often be caused by a specific traumatic event in the past (eg, choking on something, so never eating it again in case of reoccurrence of that incident).  \nA person with ARFID can have any one (or more) of these types to varying degrees of severity.  \n\nFor example, at the moment, I can only eat a few things due to sensory reasons (mainly texture for me, for example smoothies and drinks with bits in make me want to be sick and have done for my whole life), and things just feeling wrong in my mouth or just feel like too much and overwhelm me. There are a lot of foods that I will never and have never tried, and I can say for sure that I will not like them based on how they look. I also don't feel hunger in the same way as other people appear to, because I struggle with interoception due to Autism (another example is not knowing I need the toilet until I'm desperate), and get into states of hyperfocus where I totally lose track of anything else I'm doing for hours and totally forget to eat or drink or do anything apart from the one thing I am focuaing on. I also had an incident last year when I got sick just after eating one of my safe foods and now can't eat it due to being scared of being sick again because I can't stand the texture or taste of sick.  \n\nA restricted diet is not a treatment for ARFID. It is a consequence of having ARFID.",
          "created_utc": 1741914428.0
        }
      ]
    },
    {
      "id": "mhoe0o0",
      "author": "BeatnikMona",
      "body": "I thought so at first, but the top of the loaf isn’t in the plastic and touching that part is what bothered me.",
      "created_utc": 1741916990.0,
      "score": 4,
      "context": [
        {
          "id": "mhlg1s3",
          "author": "ellabirde",
          "body": "I have celiac disease so I can definitely help with this! My favorite bread substitute is actually a gluten free waffle lol. The brand is Brazi Bites, they make original ones and cheesy ones - PB&J is really good on the original, as is Nutella, and they’re also great as just regular waffles with butter and syrup! And then anything savory is good on the cheesy, like a sandwich of any kind! They do not have any taste or texture difference to regular waffles like Eggo (I actually genuinely like the Brazi Bites ones better than any other frozen waffle I’ve had, including gluten ones lol). Glutino is a brand that makes incredible English muffins that are great to pop in the toaster and have with butter, cream cheese, or any kind of breakfast sandwich filling. Glutino also makes sandwich cookies that are just as good as Oreos. Snyder’s makes gluten free pretzels that are amazing and come in sticks, twists, and rods! For cereals, there are tons that are gluten free - any rice or corn Chex, lucky charms, cocoa and fruity pebbles, etc. Katz is a gluten free brand that makes amazing donuts, donut holes, and other bread-y sweet treats. Let me know if you’re looking for anything else specific and I’d be glad to help!",
          "created_utc": 1741885392.0
        },
        {
          "id": "mhlir4i",
          "author": "BeatnikMona",
          "body": "Omg thank you so much, this was very helpful.",
          "created_utc": 1741886154.0
        },
        {
          "id": "mhlkmo7",
          "author": "Weary-Toast",
          "body": "To add onto this as a fellow celiac sufferer, Feel Good Foods is a great brand for gluten free convenience foods. Canyon Bakehouse Ranch has the best gluten free bread IMO but they treat their employees like garbage so I just gave up on bread all together. Jovial makes great gluten free pasta in tons of shapes (including bow tie which is my favorite pasta shape). If you like granola, Made Good has these awesome granola minis that make a great snack. Also Banza makes gluten free protein waffles, the texture is def different but I like that there’s 10g of protein in 2 waffles (they’re made from chickpeas). They’re pasta leaves ALOT to be desired 😂",
          "created_utc": 1741886672.0
        },
        {
          "id": "mhlld3e",
          "author": "BeatnikMona",
          "body": "My boyfriend recommended the Canyon Bakehouse Ranch bread but the texture and hardness that I could feel through the packaging was a nope.\n\nI’ll look into those other brands, I did hear Jovial is good.",
          "created_utc": 1741886876.0
        },
        {
          "id": "mho2c1n",
          "author": "HourDimension1040",
          "body": "I know they package it in a plastic pan inside the plastic bagging, could that have been what you were feeling?",
          "created_utc": 1741913040.0
        }
      ]
    },
    {
      "id": "mhoej5q",
      "author": "HourDimension1040",
      "body": "Understandable. Alternatively, you could make your own bread? I’ve learned to make bread for my partner over the past few months. It’s actually pretty good although a thicker consistency oftentimes than gluteny and you can cut into it right away. Look up Loopy Whisk (or secondarily Gluten Free on a Shoestring). It wasn’t hard to learn and kinda fun :)",
      "created_utc": 1741917165.0,
      "score": 3,
      "context": [
        {
          "id": "mhlg1s3",
          "author": "ellabirde",
          "body": "I have celiac disease so I can definitely help with this! My favorite bread substitute is actually a gluten free waffle lol. The brand is Brazi Bites, they make original ones and cheesy ones - PB&J is really good on the original, as is Nutella, and they’re also great as just regular waffles with butter and syrup! And then anything savory is good on the cheesy, like a sandwich of any kind! They do not have any taste or texture difference to regular waffles like Eggo (I actually genuinely like the Brazi Bites ones better than any other frozen waffle I’ve had, including gluten ones lol). Glutino is a brand that makes incredible English muffins that are great to pop in the toaster and have with butter, cream cheese, or any kind of breakfast sandwich filling. Glutino also makes sandwich cookies that are just as good as Oreos. Snyder’s makes gluten free pretzels that are amazing and come in sticks, twists, and rods! For cereals, there are tons that are gluten free - any rice or corn Chex, lucky charms, cocoa and fruity pebbles, etc. Katz is a gluten free brand that makes amazing donuts, donut holes, and other bread-y sweet treats. Let me know if you’re looking for anything else specific and I’d be glad to help!",
          "created_utc": 1741885392.0
        },
        {
          "id": "mhlir4i",
          "author": "BeatnikMona",
          "body": "Omg thank you so much, this was very helpful.",
          "created_utc": 1741886154.0
        },
        {
          "id": "mhlkmo7",
          "author": "Weary-Toast",
          "body": "To add onto this as a fellow celiac sufferer, Feel Good Foods is a great brand for gluten free convenience foods. Canyon Bakehouse Ranch has the best gluten free bread IMO but they treat their employees like garbage so I just gave up on bread all together. Jovial makes great gluten free pasta in tons of shapes (including bow tie which is my favorite pasta shape). If you like granola, Made Good has these awesome granola minis that make a great snack. Also Banza makes gluten free protein waffles, the texture is def different but I like that there’s 10g of protein in 2 waffles (they’re made from chickpeas). They’re pasta leaves ALOT to be desired 😂",
          "created_utc": 1741886672.0
        },
        {
          "id": "mhlld3e",
          "author": "BeatnikMona",
          "body": "My boyfriend recommended the Canyon Bakehouse Ranch bread but the texture and hardness that I could feel through the packaging was a nope.\n\nI’ll look into those other brands, I did hear Jovial is good.",
          "created_utc": 1741886876.0
        },
        {
          "id": "mho2c1n",
          "author": "HourDimension1040",
          "body": "I know they package it in a plastic pan inside the plastic bagging, could that have been what you were feeling?",
          "created_utc": 1741913040.0
        },
        {
          "id": "mhoe0o0",
          "author": "BeatnikMona",
          "body": "I thought so at first, but the top of the loaf isn’t in the plastic and touching that part is what bothered me.",
          "created_utc": 1741916990.0
        }
      ]
    },
    {
      "id": "mhq1xo9",
      "author": "Weary-Toast",
      "body": "The plastic pan actually does fully encapsulate the loaf and it’s much softer once you take it out. One thing about GF bread is you always have to toast it. No matter the brand or what you are using it for. Toast.",
      "created_utc": 1741947069.0,
      "score": 2,
      "context": [
        {
          "id": "mhlg1s3",
          "author": "ellabirde",
          "body": "I have celiac disease so I can definitely help with this! My favorite bread substitute is actually a gluten free waffle lol. The brand is Brazi Bites, they make original ones and cheesy ones - PB&J is really good on the original, as is Nutella, and they’re also great as just regular waffles with butter and syrup! And then anything savory is good on the cheesy, like a sandwich of any kind! They do not have any taste or texture difference to regular waffles like Eggo (I actually genuinely like the Brazi Bites ones better than any other frozen waffle I’ve had, including gluten ones lol). Glutino is a brand that makes incredible English muffins that are great to pop in the toaster and have with butter, cream cheese, or any kind of breakfast sandwich filling. Glutino also makes sandwich cookies that are just as good as Oreos. Snyder’s makes gluten free pretzels that are amazing and come in sticks, twists, and rods! For cereals, there are tons that are gluten free - any rice or corn Chex, lucky charms, cocoa and fruity pebbles, etc. Katz is a gluten free brand that makes amazing donuts, donut holes, and other bread-y sweet treats. Let me know if you’re looking for anything else specific and I’d be glad to help!",
          "created_utc": 1741885392.0
        },
        {
          "id": "mhlir4i",
          "author": "BeatnikMona",
          "body": "Omg thank you so much, this was very helpful.",
          "created_utc": 1741886154.0
        },
        {
          "id": "mhlkmo7",
          "author": "Weary-Toast",
          "body": "To add onto this as a fellow celiac sufferer, Feel Good Foods is a great brand for gluten free convenience foods. Canyon Bakehouse Ranch has the best gluten free bread IMO but they treat their employees like garbage so I just gave up on bread all together. Jovial makes great gluten free pasta in tons of shapes (including bow tie which is my favorite pasta shape). If you like granola, Made Good has these awesome granola minis that make a great snack. Also Banza makes gluten free protein waffles, the texture is def different but I like that there’s 10g of protein in 2 waffles (they’re made from chickpeas). They’re pasta leaves ALOT to be desired 😂",
          "created_utc": 1741886672.0
        },
        {
          "id": "mhlld3e",
          "author": "BeatnikMona",
          "body": "My boyfriend recommended the Canyon Bakehouse Ranch bread but the texture and hardness that I could feel through the packaging was a nope.\n\nI’ll look into those other brands, I did hear Jovial is good.",
          "created_utc": 1741886876.0
        },
        {
          "id": "mho2c1n",
          "author": "HourDimension1040",
          "body": "I know they package it in a plastic pan inside the plastic bagging, could that have been what you were feeling?",
          "created_utc": 1741913040.0
        },
        {
          "id": "mhoe0o0",
          "author": "BeatnikMona",
          "body": "I thought so at first, but the top of the loaf isn’t in the plastic and touching that part is what bothered me.",
          "created_utc": 1741916990.0
        }
      ]
    }
  ]
}