{
  "id": "1jf1r9c",
  "subreddit": "ARFID",
  "author": "PlatypusEnthusiast16",
  "created_utc": 1742403435.0,
  "title": "SO THIS IS WHAT THIS IS?!",
  "selftext": "I've had issues with food for as long as I can remember. Im autistic and textures are meh. Growing up the dinnertable was my personal nightmare. Ive had so many fights, fits, and straight up abuse thrown at me for struggling to eat certain foods. I stumbled upon the term ARFID only a few months ago and my god...\n\nI didnt know there was a word for this, or a community, or support. If only younger me had known I wasnt alone with this.\n\nDid anyone else have a similar eureka moment? \n\n",
  "url": "https://www.reddit.com/r/ARFID/comments/1jf1r9c/so_this_is_what_this_is/",
  "score": 120,
  "num_comments": 15,
  "comments": [
    {
      "id": "minem6y",
      "author": "overduedevil",
      "body": "yes, i did! i'm also autistic, and was just labelled picky my whole life. i'm 24 now, and i found out about arfid when i was 20. it was like i understood myself so much better and how to advocate for my needs, plus having a community really helps-- i don't know anyone in real life who also has it, so being able to find solace in not being alone online has really helped. i hope you can find the same here.",
      "created_utc": 1742404470.0,
      "score": 22,
      "context": []
    },
    {
      "id": "minkmmw",
      "author": "PeachOnAWarmBeach",
      "body": "I cried.  I was in shock and relief when I realized I wasn't alone.  My brain and body relaxed in a way I didn't know it was tensed.",
      "created_utc": 1742406178.0,
      "score": 21,
      "context": []
    },
    {
      "id": "minmurp",
      "author": "Darthcookie",
      "body": "Yup, I only found out ARFID was a thing a few years ago. I’m 46. I’ve actually been slowly finding stuff that explains why I am the way I am; and most importantly, that it’s not “my fault” it’s something that is and I have no control over. \n\nThe goods news is, you’re not alone and this community is super supportive and positive!",
      "created_utc": 1742406812.0,
      "score": 11,
      "context": []
    },
    {
      "id": "ming3wy",
      "author": "Weird-Pipe3610",
      "body": "Yes, I'm also autistic. Fortunately my parents are autistic too so they understood that food kinda sucks.",
      "created_utc": 1742404892.0,
      "score": 7,
      "context": []
    },
    {
      "id": "miove73",
      "author": "crustil",
      "body": "Lol I just had a client ask me what my favorite food was and she looked at me like I was insane when I said I didn't have a favorite food. I honestly just wouldn't eat if I didn't have to 75% of the time.",
      "created_utc": 1742419955.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mioda7t",
      "author": "loveruthie",
      "body": "Literally just found out almost a year ago and it's been like this my whole life.",
      "created_utc": 1742414632.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mio79no",
      "author": "MaleficentSwan0223",
      "body": "I had a similar moment when I got diagnosed with arfid the doctor said “have you ever thought you might be autistic?”",
      "created_utc": 1742412727.0,
      "score": 3,
      "context": []
    },
    {
      "id": "miqq3pk",
      "author": "TheMelonSystem",
      "body": "Yup! I remember learning that there was literally a name for being such a picky eater that I needed supplements lmfao",
      "created_utc": 1742442916.0,
      "score": 3,
      "context": []
    },
    {
      "id": "miq9g2g",
      "author": "KiraLaManzana",
      "body": "Yes!! One day i found a video titled something like \"an unknown eating disorder\" and for some reason it called me. I watched it and oh my god that person was describing my life. Then I found this community and found even more relatable stories!",
      "created_utc": 1742436434.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mitsi0p",
      "author": "Prize_Anxiety_9937",
      "body": "It’s really relieving to know you’re not alone, isn’t it? ❤️",
      "created_utc": 1742491018.0,
      "score": 2,
      "context": []
    },
    {
      "id": "miu3ftx",
      "author": "_purplegalaxy_",
      "body": "Yes I did! When I discovered this subreddit I cried. It’s amazing to see that you are not alone in this and that people have the same struggles as you, you don’t feel crazy, you feel seen.",
      "created_utc": 1742494138.0,
      "score": 2,
      "context": []
    },
    {
      "id": "minqjsw",
      "author": "PlagueDoc1348",
      "body": "Yes, recently too. Not autistic but moderate to severe ADHD and loads of sensory issues. Very glad to have something to explain my “extremely picky” tendencies. Such a massive relief to be able to tell my friends ‘hey I have a disorder that makes food difficult for me’ instead of ‘hey I’m weird about food and so I probably can’t eat this thing youre offering me’.",
      "created_utc": 1742407865.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mipp85a",
      "author": "Mysterious-Tiger6925",
      "body": "This was a recent discovery for me as well. I’m 25 and only discovered what ARFID was last year. I am still going through an identity crisis because my entire life, I thought I was alone and just “picky” or “weird” for my food choices and habits. Having a name to a disorder you’ve had your entire life is mind boggling. The more I learn about ARFID, the more I want to recover because safe foods are feeling boring and I am tired of the criticism from friends and family. And I need to do it for my health. \n\nI am AuDHD. I’ve been seeing a dietitian since the fall of last year. I feel like I have made little to no progress since then, but I have to remember, this is 25 years of limited diets we are trying to recover from. Finding new foods to eat is scary, especially when textures and tastes and temperatures are weird to us.\n\nSince I haven’t seen progress really, I just started going to an adult ARFID support group. I just hope this is what jump starts my recovery. Fingers crossed.",
      "created_utc": 1742429451.0,
      "score": 1,
      "context": []
    },
    {
      "id": "miq2628",
      "author": "extremely_displeased",
      "body": "i immediately texted my bf about it being like “SEE IT’S REAL”",
      "created_utc": 1742433900.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mj63o2d",
      "author": "power36113",
      "body": "This was me in November 2023 (maybe a little later). I have been with my therapist since fall 2018, and only in November did I finally talk to her about my diet. This is also when I asked if maybe I might be autistic, and she said she can’t say, but it can’t hurt to get tested (turns out I am autistic!). ARFID and autism have a high comorbidity rate (existing together).\n\nI always thought I was just a picky eater. Nope. I have a real psychological condition. It’s a relief. Now, it’s a matter of getting treatment for it.\n\nThe psychologist that diagnosed me with autism offers hypnosis for potential ARFID treatment. I aim to begin this later this year (I have a balance I want to pay down with the provider first).",
      "created_utc": 1742661796.0,
      "score": 1,
      "context": []
    }
  ]
}