{
  "id": "1jgweyp",
  "subreddit": "ARFID",
  "author": "bubbleurry",
  "created_utc": 1742604578.0,
  "title": "“you can’t say you don’t like it without trying it” 🙄",
  "selftext": "i’m really tired of hearing people say that i can’t say i don’t like a food without trying it first. it seems like this is a general rule that many believe applies to everyone, but in my opinion, that’s not true.\n\nyes, i can state that i don’t like a food just by looking at it or smelling it. if my brain signals that i won’t like it and i try to taste it anyway, i end up unable to swallow it or even gag and vomit. i don’t know if this is something physiological, trauma, or deeply ingrained beliefs in my mind. i must admit that i would love to change this if i had the option.\n\nwhy are people so inflexible? why do they insist on me trying it? is it because most people find it easy to try new foods? is it really that difficult to accept that some people simply can’t, no matter how much they want to?\n\ni apologize if this comes off as a bitter rant, but i needed to share. i would also love to hear about your experiences regarding trying new foods, if you also find it more complicated than some people make it seem.",
  "url": "https://www.reddit.com/r/ARFID/comments/1jgweyp/you_cant_say_you_dont_like_it_without_trying_it/",
  "score": 273,
  "num_comments": 87,
  "comments": [
    {
      "id": "mj2oi8s",
      "author": "rigathrow",
      "body": "god, i got this SO fucking much growing up. sure there is the chance that something might taste better than it smells/looks but i know myself and my body. i know that if the mere thought of something being in my mouth makes me physically retch then.... uhh, yeah, i can safely say i won't like it so won't be trying it.\n\nlike, if my brain decides i won't like something, i physically can't eat it. my body will physically reject it before it even touches my lips. every single time i've tried bringing a smoothie to my mouth, i've vomited. i'm not doing this on purpose. why the hell would i? what's to gain from it?",
      "created_utc": 1742605162.0,
      "score": 116,
      "context": []
    },
    {
      "id": "mj35z29",
      "author": "throwawaypatien",
      "body": "https://preview.redd.it/k5u0ri4nn5qe1.jpeg?width=720&format=pjpg&auto=webp&s=4b4171be8ca6b15f0aaf95ed4395f3bb44bdeb37\n\nI've found this to be the perfect response to people saying that.",
      "created_utc": 1742611827.0,
      "score": 81,
      "context": []
    },
    {
      "id": "mj2qpgn",
      "author": "whatdoidonowdamnit",
      "body": "People stopped saying that to me when I hit adulthood. If you have people speaking to you that disrespectfully that’s a problem. Attempting to force a person to eat food is disrespectful. Trying to convince a person they don’t know their own dietary preferences is weird as shit and disrespectful. \n \nI don’t really try new foods all that often anymore, because there just aren’t many foods that interest me that I haven’t already tried. I have a decent variety of foods that I’ve worked into my diet over the last twenty years or so when I started actively trying to eat what I considered normal people food.",
      "created_utc": 1742605973.0,
      "score": 31,
      "context": []
    },
    {
      "id": "mj2s9d1",
      "author": "extremely_displeased",
      "body": "i hate this, but the worst is when i did try it and they go “oh but you haven’t tried it prepared like this!” or “you haven’t tried it from this restaurant!” like… you just want me to fucking eat it regardless, just say that",
      "created_utc": 1742606556.0,
      "score": 19,
      "context": []
    },
    {
      "id": "mj2wg7e",
      "author": "EliotTheGreat20",
      "body": "I just joined a cooking class because I'm trying to become more independent and we were making pasta the other day and I usually cook my pasta for 20+ minutes (I like it super duper soft) and the chef was like \"have you tried it?\" And I said no, because I know I won't like it, it's only been cooking for ten minutes and she went \"well you won't know if you like it unless you try it, everyone is waiting for you to try it\" like bro I've cooked pasta many times before I KNOW when I won't like it, it's been ten minutes I won't like it. But I took it off the heat anyways because we were running low on time, and guess what? I tried it and didn't like it 😐 /nbh\nAlso the added comment of \"everyone is waiting for you to try it\" added a lot more pressure then was needed..",
      "created_utc": 1742608125.0,
      "score": 21,
      "context": []
    },
    {
      "id": "mj2zmzm",
      "author": "IHaveNoUsernameSorry",
      "body": "This is what people without ARFID don’t understand and I’m sick of explaining it again and again. Why do so many people care about other people’s eating habits, anyway?",
      "created_utc": 1742609334.0,
      "score": 19,
      "context": []
    },
    {
      "id": "mj3hohb",
      "author": "Isadum",
      "body": "Whenever someone says that to me I just say “how do you know you’re not gay if you haven’t tried it”",
      "created_utc": 1742616817.0,
      "score": 18,
      "context": []
    },
    {
      "id": "mj456qn",
      "author": "Squirrel_Worth",
      "body": "‘For the same reasons you know you won’t like a bowl of maggots for breakfast without trying it’",
      "created_utc": 1742630632.0,
      "score": 11,
      "context": []
    },
    {
      "id": "mj3car6",
      "author": "KenMixtape",
      "body": "\"It came to me in a dream\"",
      "created_utc": 1742614441.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mj467yo",
      "author": "Preppy_Hippie",
      "body": "They are going by their experience and don't understand ARFID. They have had food, many times, that they were resistant to trying and worried that it would be revolting, but when they did try it they found it wasn't as bad as they expected- sometimes even good. They also have, many many times, experienced foods that taste and feel a LOT different than they smell or appear. They also know in the raising of children that this is generally the right approach. That it is normal to take multiple attempts before knowing for sure if the child doesn't really like it- and usually they come around. And sorry to say they are imagining ARFID as a fussy, picky eater on steroids, who probably wasn't parented properly and who might not actually know what they like because their diet is so limited.\n\nBut really, if you think about it for 2 seconds, it makes total sense that if you have severe reactions every time to certain smells, textures, etc and have known, experienced and tested and retested it for many years- that you would know. So it really is crazy to treat you like you were born yesterday.  Unfortunately, yes it really is that foreign to their experience and hard for them to understand, sorry to say, and they are not giving it much thought.  :(",
      "created_utc": 1742631313.0,
      "score": 6,
      "context": []
    },
    {
      "id": "mj2uj12",
      "author": "lauren_alyssa",
      "body": "story of my lifeee 😩 i could look at the shit and just know i’m gonna hate it and then they force me to try it just for me to hate just like i knew i would! and then they’ll  say im being dramatic 🤦🏽‍♀️",
      "created_utc": 1742607406.0,
      "score": 6,
      "context": []
    },
    {
      "id": "mj3bwxf",
      "author": "Enzoid23",
      "body": "Omg yess.. Like if you say \"I dont want to have it\" you're asked why not or pushed, if you say you dislike it they say you cant know that.. Its so frustrating! You cant win!",
      "created_utc": 1742614276.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mj3ydue",
      "author": "Angelangepange",
      "body": "I think it's because people really don't understand how arfid works and they are also mostly unwilling to understand.    \n    \nFor us it's not really a matter of will I like it but will it make me gag or vomit.    \n      \nAfter working of expanding my diet I finally had the feeling of \"not liking\" something and it's completely different.     \n     \nI remember as a small child my dad asked me \"why do you not want to eat it\" and I, given that I was so young said \"it makes me vomit\" and meant it literally.     \nHim being an adult thought I was using figurative language (🤦🏻‍♀️) and told me \"you can't say that, you have to say you don't like it\" and so I started saying I didn't like it because I thought everyone also felt the same as me, that they vomit when they \"don't like it\" but are so strong willed that they ate it anyway.     \nBut they don't, they never feel sick in the first place.      \n       \nI believe it all comes from the words we all use to mean something different.    \nAnd with these words non arfid people refuse to understand the difference.",
      "created_utc": 1742626198.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mj45s50",
      "author": "jessipoo451",
      "body": "Fun fact: you actually can tell you won't like it before trying it because you're an advanced mammal. It's called Affective Forecasting. Someone did an experiment with orangutans where they gave them different flavoured juices to try to see which flavours they liked, and then gave them combinations of those juices, and the orangutans could tell before trying it whether they would enjoy it or not. This is just an example of how the ability to know whether you will like a food (based on your previous experience with the same ingredients, flavours, textures, etc.) is actually so simple that it exists in non-human primates too.",
      "created_utc": 1742631022.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mj6qah2",
      "author": "MysticCollective",
      "body": "I will admit that I used to say this when I was younger because I heard it so much growing up that I believed it. It made me forget that your sense of smell would absolutely \"taste\" your food before it even reaches your mouth. Also you see your food before it reaches your mouth too.\n\nSo yeah, I no longer say this or believe it. I am pretty sure I have PDA= Pathological Demand Avoidance. One of the many things I need to get assessed for. Anyway, my point is I hate hearing this phrase too. If you want me to try something kindly shut up and let me try it.",
      "created_utc": 1742668847.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mj2r75z",
      "author": "None",
      "body": "I fully support your feelings on this!  The bottom line is people who don’t have this can’t understand the anxiety and stress that trying new foods brings, especially foods that our brain is already telling us we aren’t going to like",
      "created_utc": 1742606156.0,
      "score": 6,
      "context": []
    },
    {
      "id": "mj4j5ll",
      "author": "RealityTVfan28",
      "body": "Got that ALL THE TIME as a kid. Another one of their argument’s to get me to try/eat whatever they were pushing. \n\nWorse—when I liked the way something smelled and worked up the courage to try it—and it was horrible. Gag, try not to vomit. End. That was fried chicken for me. To this day, do not eat it or any meat.",
      "created_utc": 1742639867.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mj53l4z",
      "author": "MsMistySkye",
      "body": "One of my besties kept trying to get pushy with my daughter who has ARFID on her visit last week.  \nI kept telling her what she would or would not eat,  but she kept trying to force things on her.  I got a bit defensive until she backed off a bit.  The kid is nearly 19, she knows what she wants to consume and what she's willing to try.  Back off!",
      "created_utc": 1742649747.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mj5k8e5",
      "author": "PompyPom",
      "body": "I’ve been forced to eat fish twice and that just resulted in me immediately spitting it out and vomiting. So now whenever someone gives me that whole song and dance, I tell them unless they want to see me puking at the table, I can make a better judgement about my own body and preferences than they can.",
      "created_utc": 1742655583.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mj76e0j",
      "author": "maxism_21",
      "body": "If I’m not close enough to the person to feel bad I’ll usually just lie and say I’ve had it before and didn’t enjoy it or I’m allergic or something dietary etc.\nThe quicker I shut down the conversation and don’t have to explain further the better",
      "created_utc": 1742674033.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mjt2raq",
      "author": "Traditional-Set-2019",
      "body": "I know how this feels and it sucks. The feeling you get just thinking about trying something you know you can’t and won’t like is physically unbearable. The cringe I get thinking about this happening is giving me flashbacks. I hate that people say that and I’m just stubborn and I should try it and how do you know if you haven’t. It’s frustrating as heck! I’m cringing 😬",
      "created_utc": 1742982650.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mjtuanb",
      "author": "Neither_Soil1903",
      "body": "I have never heard of this disorder.  Found this group when did a search for yogurt without fruit in it. My entire life i have been called weird because how I eat. Textures and smells make me gag till vomit. Basically can only tolerate some meats, grains and limited dairy. The smell of melted cheese makes me so nauseous I could never bring myself to eat it. Any cheese smells like vomited dirty socks to me.  I live in USA where cheese is on everything so I have been made fun of my entire life for hating cheese. You have no idea how seeing all these post has made me feel",
      "created_utc": 1742995160.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mj43zus",
      "author": "Phoenixtdm",
      "body": "Theres been times where I think I’ll like something and it’s disgusting and times when I think I won’t like something but it’s really good",
      "created_utc": 1742629843.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mj4pbtm",
      "author": "No_Tailor_9572",
      "body": "& when I inevitably gagged up a storm, I also always got \"you're just being dramatic/acting because you were wrong about not liking it.\" Like, no mother, I did not choose to be like this",
      "created_utc": 1742643427.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mjj8pjn",
      "author": "ponsies",
      "body": "One of the ways that I worked on combatting this problem with myself is by taking something I called a no-thank you bite or lick, which is where I licked the thing or took a bite fully expecting to allow myself to spit it out if I didn’t like it. \n\nI also had the contamination fear type so I would sometimes have someone I trusted take a bite before I did to relieve some of that anxiety\n\nKeep in mind that it takes anywhere between 8 and 15 tries of an item for your taste buds and brain to figure out if you truly dislike it or if it’s just new and thus big scary.",
      "created_utc": 1742845930.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mk3amj4",
      "author": "None",
      "body": "Exactly.\n\nFor me, it was always a texture issue. Once I learned which textures I couldn’t have, it became very easy for me to look at something and tell, especially if it is similar to something that already made me gag.",
      "created_utc": 1743116510.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mk9ibtp",
      "author": "2cat007",
      "body": "I hate when people say that because from the look and smell I know I’m gonna hate it and thus decided to not eat it.",
      "created_utc": 1743200871.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mketnv3",
      "author": "animejaz",
      "body": "For anyone curious about my research and genuinely what to know why from the other side: I'm saying this with much respect, and as a wife to ARFID, and with a lot of loving research ( see below to sources) on this since I don't experience it myself.  \n\nBut from the outside there is research* about it taking anyone, even non ARFID, around 5-8 times of trying something new, Anything new, before it becomes no longer foreign and developing a fully sense analyzed experience that leads to a well rounded \"like/dislike\" of anything we put in our mouths. \n\nMost people don't have that in mind because of research, we have the experiences of trying something multiple times before we \"liked\" it. So we are subconsciously pulling from those experiences when suggesting there could be a good experience in there for you. \n\nIf it's someone that cares about you and knows that ARFID is involved, they are trying to be helpful. ( Which your probably know :) ) - If it's a new person in your life, they can't comprehend that you don't have those types of multiple experiences that have turned out good to reference. Re: my experiences with tomatoes over 15 years, is not something you can reference that helps. \n\nEither way, your journey is your own, and unless you are having an \"extra spoon\" day and want to push yourself and/or have someone you trust that your ok experimenting around - the rest can fuck off and should.  😝  And rant all you want, cause it definitely sucks. I don't like it either. \n\nKeep on keeping on!\n\n*https://pmc.ncbi.nlm.nih.gov/articles/PMC11397511\n\n*https://www.mdpi.com/2072-6643/16/17/3034\n\n*https://pmc.ncbi.nlm.nih.gov/articles/PMC10453506",
      "created_utc": 1743280221.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mj39ykd",
      "author": "JaguarJo",
      "body": "This is a tough one for me because I've actually been on both sides of it. My whole childhood and young adult life was filled with people who didn't seem to understand that I could tell from either the smell or the visible texture that I knew I wasn't going to be able to eat something before I ever put any of it in my mouth. My parents didn't force it, thankfully, but eating in public still caused anxiety. I was probably in my 30's by the time I stopped letting other people affect how I interact with food.\n\nWhen I became a parent of two children, both with very limited acceptable food lists, trying to make sure they still get enough nourishment from their meals is challenging. I've actually found myself saying the dreaded words just out of desperation to get them to try to expand their palates. And the thing is, sometimes we do find new foods this way. But on the other hand, I also don't force my kids to eat anything they indicate is outright repulsive. I don't want them to hate food. I don't want them to dread restaurants or potlucks. And it really is bullshit how so many people still get pushy about what someone else should eat.\n\nI don't think most people are being intentionally malicious. I think they're usually just excited to share something they like with us. Or if they made it themselves, then it's something they feel proud of and they want confirmation that they did a good job. Unfortunately, it just goes completely sideways when they don't understand our pre-existing struggles with food and the trauma that often comes with it.",
      "created_utc": 1742613456.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mj46trm",
      "author": "Tricky-Sentence",
      "body": "My favorite combination was forcing me into trying when I said it won't work, trying it, then I visibly gag attempting to not throw up, and then I get berated because \"You made the cook feel bad/like their food is gross\". WTH did you expect was gonna happen mom?",
      "created_utc": 1742631720.0,
      "score": 30,
      "context": [
        {
          "id": "mj2oi8s",
          "author": "rigathrow",
          "body": "god, i got this SO fucking much growing up. sure there is the chance that something might taste better than it smells/looks but i know myself and my body. i know that if the mere thought of something being in my mouth makes me physically retch then.... uhh, yeah, i can safely say i won't like it so won't be trying it.\n\nlike, if my brain decides i won't like something, i physically can't eat it. my body will physically reject it before it even touches my lips. every single time i've tried bringing a smoothie to my mouth, i've vomited. i'm not doing this on purpose. why the hell would i? what's to gain from it?",
          "created_utc": 1742605162.0
        }
      ]
    },
    {
      "id": "mj509pb",
      "author": "bubbleurry",
      "body": "i realize that many people can’t see that, for us, liking or simply tolerating something is not just a matter of taste, but also involves texture, appearance, and even smell. when i say i don’t like something, it’s bc one of these aspects really bothers me. but unfortunately, it’s easier to take it as a personal offense than to try to understand the reason",
      "created_utc": 1742648430.0,
      "score": 12,
      "context": [
        {
          "id": "mj2oi8s",
          "author": "rigathrow",
          "body": "god, i got this SO fucking much growing up. sure there is the chance that something might taste better than it smells/looks but i know myself and my body. i know that if the mere thought of something being in my mouth makes me physically retch then.... uhh, yeah, i can safely say i won't like it so won't be trying it.\n\nlike, if my brain decides i won't like something, i physically can't eat it. my body will physically reject it before it even touches my lips. every single time i've tried bringing a smoothie to my mouth, i've vomited. i'm not doing this on purpose. why the hell would i? what's to gain from it?",
          "created_utc": 1742605162.0
        }
      ]
    },
    {
      "id": "mj5pycx",
      "author": "Taxouck",
      "body": "My personal hypothesis is that ARFID is caveman anti-poison brain gone haywire. We used to have a societal need for people able to vibe-check food at a glance, even with false positives, because so much stuff out there was potentially toxic; but that trait just isn't adapted to our modern times. Doesn't make it disappear, though!",
      "created_utc": 1742657424.0,
      "score": 8,
      "context": [
        {
          "id": "mj2oi8s",
          "author": "rigathrow",
          "body": "god, i got this SO fucking much growing up. sure there is the chance that something might taste better than it smells/looks but i know myself and my body. i know that if the mere thought of something being in my mouth makes me physically retch then.... uhh, yeah, i can safely say i won't like it so won't be trying it.\n\nlike, if my brain decides i won't like something, i physically can't eat it. my body will physically reject it before it even touches my lips. every single time i've tried bringing a smoothie to my mouth, i've vomited. i'm not doing this on purpose. why the hell would i? what's to gain from it?",
          "created_utc": 1742605162.0
        }
      ]
    },
    {
      "id": "mj70n4i",
      "author": "3V3451NC3",
      "body": "This is why ive never understood those gross food challenges. Everytime i eat something i dislike my body has a physical reaction, and its so uncomfortable. I guess people without ARFID dont really relate but holy shit i just cant wrap my brain around it",
      "created_utc": 1742672204.0,
      "score": 7,
      "context": [
        {
          "id": "mj2oi8s",
          "author": "rigathrow",
          "body": "god, i got this SO fucking much growing up. sure there is the chance that something might taste better than it smells/looks but i know myself and my body. i know that if the mere thought of something being in my mouth makes me physically retch then.... uhh, yeah, i can safely say i won't like it so won't be trying it.\n\nlike, if my brain decides i won't like something, i physically can't eat it. my body will physically reject it before it even touches my lips. every single time i've tried bringing a smoothie to my mouth, i've vomited. i'm not doing this on purpose. why the hell would i? what's to gain from it?",
          "created_utc": 1742605162.0
        }
      ]
    },
    {
      "id": "mj4bh42",
      "author": "CIearMind",
      "body": "Fucking exactly.\n\nNone of them have ever tried eating shit. And yet they know that they wouldn't want to dig into a steaming pile of dung with their teeth.\n\nBut somehow when it's us: HOW CAN WE KNOOOOOW IF WE'VE NEVER TRIIIIEEEEEDDDD ITTÞ?",
      "created_utc": 1742634867.0,
      "score": 10,
      "context": [
        {
          "id": "mj35z29",
          "author": "throwawaypatien",
          "body": "https://preview.redd.it/k5u0ri4nn5qe1.jpeg?width=720&format=pjpg&auto=webp&s=4b4171be8ca6b15f0aaf95ed4395f3bb44bdeb37\n\nI've found this to be the perfect response to people saying that.",
          "created_utc": 1742611827.0
        }
      ]
    },
    {
      "id": "mj38bcs",
      "author": "TashaT50",
      "body": "Great response",
      "created_utc": 1742612777.0,
      "score": 7,
      "context": [
        {
          "id": "mj35z29",
          "author": "throwawaypatien",
          "body": "https://preview.redd.it/k5u0ri4nn5qe1.jpeg?width=720&format=pjpg&auto=webp&s=4b4171be8ca6b15f0aaf95ed4395f3bb44bdeb37\n\nI've found this to be the perfect response to people saying that.",
          "created_utc": 1742611827.0
        }
      ]
    },
    {
      "id": "mj52zt5",
      "author": "bubbleurry",
      "body": "omg, thank you!!! i’m saving this immediately for future use lol",
      "created_utc": 1742649513.0,
      "score": 4,
      "context": [
        {
          "id": "mj35z29",
          "author": "throwawaypatien",
          "body": "https://preview.redd.it/k5u0ri4nn5qe1.jpeg?width=720&format=pjpg&auto=webp&s=4b4171be8ca6b15f0aaf95ed4395f3bb44bdeb37\n\nI've found this to be the perfect response to people saying that.",
          "created_utc": 1742611827.0
        }
      ]
    },
    {
      "id": "mj55rma",
      "author": "bubbleurry",
      "body": "exactly!!! isn’t it completely disrespectful to throw away all of our understanding and experiences with food? \ni’ve made a lot of progress, let’s say, more than halfway towards what I aim for in terms of food variety. often, i find myself trying to like something just to please others, not bc it’s something that benefits me. it’s at that moment that i realize how much all the judgment around food affects me",
      "created_utc": 1742650587.0,
      "score": 4,
      "context": [
        {
          "id": "mj2qpgn",
          "author": "whatdoidonowdamnit",
          "body": "People stopped saying that to me when I hit adulthood. If you have people speaking to you that disrespectfully that’s a problem. Attempting to force a person to eat food is disrespectful. Trying to convince a person they don’t know their own dietary preferences is weird as shit and disrespectful. \n \nI don’t really try new foods all that often anymore, because there just aren’t many foods that interest me that I haven’t already tried. I have a decent variety of foods that I’ve worked into my diet over the last twenty years or so when I started actively trying to eat what I considered normal people food.",
          "created_utc": 1742605973.0
        }
      ]
    },
    {
      "id": "mj58ch0",
      "author": "bubbleurry",
      "body": "exactly!!! i almost want to say: admit it already, you just can’t accept that i don’t tolerate a food you love, it’s something personal for you",
      "created_utc": 1742651544.0,
      "score": 3,
      "context": [
        {
          "id": "mj2s9d1",
          "author": "extremely_displeased",
          "body": "i hate this, but the worst is when i did try it and they go “oh but you haven’t tried it prepared like this!” or “you haven’t tried it from this restaurant!” like… you just want me to fucking eat it regardless, just say that",
          "created_utc": 1742606556.0
        }
      ]
    },
    {
      "id": "mj57nd5",
      "author": "bubbleurry",
      "body": "i’m so sorry for this unpleasant experience. unfortunately, people in this position aren’t known for being very tolerant about it. but hey, i think you’re doing something amazing for yourself by choosing to learn to be more independent. when i started cooking my own food, it helped me so much with my ARFID. that’s how i found safe ways to prepare foods i couldn’t even look at before. i’m really supporting you! i hope you can gain a lot of benefits from this experience!!",
      "created_utc": 1742651290.0,
      "score": 6,
      "context": [
        {
          "id": "mj2wg7e",
          "author": "EliotTheGreat20",
          "body": "I just joined a cooking class because I'm trying to become more independent and we were making pasta the other day and I usually cook my pasta for 20+ minutes (I like it super duper soft) and the chef was like \"have you tried it?\" And I said no, because I know I won't like it, it's only been cooking for ten minutes and she went \"well you won't know if you like it unless you try it, everyone is waiting for you to try it\" like bro I've cooked pasta many times before I KNOW when I won't like it, it's been ten minutes I won't like it. But I took it off the heat anyways because we were running low on time, and guess what? I tried it and didn't like it 😐 /nbh\nAlso the added comment of \"everyone is waiting for you to try it\" added a lot more pressure then was needed..",
          "created_utc": 1742608125.0
        }
      ]
    },
    {
      "id": "mjajcru",
      "author": "RealityTVfan28",
      "body": "I applaud you for cooking class. I would never. I’d be afraid they’d try and have me eat something I just don’t!! I agree cooking for yourself helped. When I had kids and had to make dinner I learned to cook a lot of things—many of which I didn’t eat. People would say “how can you cook if you’re not tasting it?” Not that hard bro if you follow a recipe.",
      "created_utc": 1742727838.0,
      "score": 4,
      "context": [
        {
          "id": "mj2wg7e",
          "author": "EliotTheGreat20",
          "body": "I just joined a cooking class because I'm trying to become more independent and we were making pasta the other day and I usually cook my pasta for 20+ minutes (I like it super duper soft) and the chef was like \"have you tried it?\" And I said no, because I know I won't like it, it's only been cooking for ten minutes and she went \"well you won't know if you like it unless you try it, everyone is waiting for you to try it\" like bro I've cooked pasta many times before I KNOW when I won't like it, it's been ten minutes I won't like it. But I took it off the heat anyways because we were running low on time, and guess what? I tried it and didn't like it 😐 /nbh\nAlso the added comment of \"everyone is waiting for you to try it\" added a lot more pressure then was needed..",
          "created_utc": 1742608125.0
        }
      ]
    },
    {
      "id": "mj5aoqs",
      "author": "bubbleurry",
      "body": "i totally agree!! the worst part is when these concerns about our food come from ppl who don’t show any interest in us in any other way, it’s so selective lol",
      "created_utc": 1742652368.0,
      "score": 5,
      "context": [
        {
          "id": "mj2zmzm",
          "author": "IHaveNoUsernameSorry",
          "body": "This is what people without ARFID don’t understand and I’m sick of explaining it again and again. Why do so many people care about other people’s eating habits, anyway?",
          "created_utc": 1742609334.0
        }
      ]
    },
    {
      "id": "mj51nse",
      "author": "Bleedingshards",
      "body": "I'm asexual, so I get this \"How do you know if you haven't tried it\" with regards to ARFID and with sex... I usually go with this or with \"how do you know you don't like sex with goats?\" when they are really annoying...",
      "created_utc": 1742648983.0,
      "score": 10,
      "context": [
        {
          "id": "mj3hohb",
          "author": "Isadum",
          "body": "Whenever someone says that to me I just say “how do you know you’re not gay if you haven’t tried it”",
          "created_utc": 1742616817.0
        }
      ]
    },
    {
      "id": "mj5buki",
      "author": "bubbleurry",
      "body": "if this is going to leave them speechless, i’m totally on board!! 🫡🫡",
      "created_utc": 1742652767.0,
      "score": 5,
      "context": [
        {
          "id": "mj3hohb",
          "author": "Isadum",
          "body": "Whenever someone says that to me I just say “how do you know you’re not gay if you haven’t tried it”",
          "created_utc": 1742616817.0
        }
      ]
    },
    {
      "id": "mj5e9z5",
      "author": "bubbleurry",
      "body": "sometimes, returning the embarrassment is all we can do, right?? 😤😤",
      "created_utc": 1742653593.0,
      "score": 1,
      "context": [
        {
          "id": "mj456qn",
          "author": "Squirrel_Worth",
          "body": "‘For the same reasons you know you won’t like a bowl of maggots for breakfast without trying it’",
          "created_utc": 1742630632.0
        }
      ]
    },
    {
      "id": "mj5uekr",
      "author": "tenth",
      "body": "Haven't had it, can't say how I feel about it and can fully admit that. Maybe they're great!",
      "created_utc": 1742658825.0,
      "score": 1,
      "context": [
        {
          "id": "mj456qn",
          "author": "Squirrel_Worth",
          "body": "‘For the same reasons you know you won’t like a bowl of maggots for breakfast without trying it’",
          "created_utc": 1742630632.0
        }
      ]
    },
    {
      "id": "mjjvk32",
      "author": "Lost_My_Brilliance",
      "body": "totally using this with the old people at my southern baptist church’s potlucks lol, they’ll have a conniption fit",
      "created_utc": 1742852607.0,
      "score": 2,
      "context": [
        {
          "id": "mj3car6",
          "author": "KenMixtape",
          "body": "\"It came to me in a dream\"",
          "created_utc": 1742614441.0
        }
      ]
    },
    {
      "id": "mj5fi0x",
      "author": "bubbleurry",
      "body": "i’m writing this down rn",
      "created_utc": 1742654004.0,
      "score": 1,
      "context": [
        {
          "id": "mj3car6",
          "author": "KenMixtape",
          "body": "\"It came to me in a dream\"",
          "created_utc": 1742614441.0
        }
      ]
    },
    {
      "id": "mj5lnkw",
      "author": "bubbleurry",
      "body": "i agree with you, unfortunately, it seems much easier to label someone as childish or picky than to truly make an effort to understand their experience with food. it just doesn’t seem reasonable to use your personal experiences as a basis to judge others, but that’s exactly what ppl do all the time",
      "created_utc": 1742656046.0,
      "score": 3,
      "context": [
        {
          "id": "mj467yo",
          "author": "Preppy_Hippie",
          "body": "They are going by their experience and don't understand ARFID. They have had food, many times, that they were resistant to trying and worried that it would be revolting, but when they did try it they found it wasn't as bad as they expected- sometimes even good. They also have, many many times, experienced foods that taste and feel a LOT different than they smell or appear. They also know in the raising of children that this is generally the right approach. That it is normal to take multiple attempts before knowing for sure if the child doesn't really like it- and usually they come around. And sorry to say they are imagining ARFID as a fussy, picky eater on steroids, who probably wasn't parented properly and who might not actually know what they like because their diet is so limited.\n\nBut really, if you think about it for 2 seconds, it makes total sense that if you have severe reactions every time to certain smells, textures, etc and have known, experienced and tested and retested it for many years- that you would know. So it really is crazy to treat you like you were born yesterday.  Unfortunately, yes it really is that foreign to their experience and hard for them to understand, sorry to say, and they are not giving it much thought.  :(",
          "created_utc": 1742631313.0
        }
      ]
    },
    {
      "id": "mj5cayt",
      "author": "bubbleurry",
      "body": "we’re always the ones to blame, whether we do what they ask or not, right?? 🤯🤯",
      "created_utc": 1742652923.0,
      "score": 1,
      "context": [
        {
          "id": "mj2uj12",
          "author": "lauren_alyssa",
          "body": "story of my lifeee 😩 i could look at the shit and just know i’m gonna hate it and then they force me to try it just for me to hate just like i knew i would! and then they’ll  say im being dramatic 🤦🏽‍♀️",
          "created_utc": 1742607406.0
        }
      ]
    },
    {
      "id": "mj5dp2b",
      "author": "bubbleurry",
      "body": "you’re right, sometimes it’s just an opportunity for them to be intolerant, it has nothing to do with a genuine concern for what we choose to eat",
      "created_utc": 1742653396.0,
      "score": 1,
      "context": [
        {
          "id": "mj3bwxf",
          "author": "Enzoid23",
          "body": "Omg yess.. Like if you say \"I dont want to have it\" you're asked why not or pushed, if you say you dislike it they say you cant know that.. Its so frustrating! You cant win!",
          "created_utc": 1742614276.0
        }
      ]
    },
    {
      "id": "mj7rfpr",
      "author": "bubbleurry",
      "body": "these days, i realize that the words we choose in these situations make all the difference, as you mentioned. unfortunately, when i say that i might vomit, it never works for me. there was one time when i said this, and someone got really offended, telling me that i shouldn’t talk about food that way. what has been working, then, is saying that i can’t eat something, instead of saying that i don’t like it, bc that way ppl assume it’s due to some allergy or restriction and don’t insist on convincing me to try it. in the end, it’s frustrating that we have to think about these strategies when a simple ‘no, thank you’ should be enough",
      "created_utc": 1742680986.0,
      "score": 2,
      "context": [
        {
          "id": "mj3ydue",
          "author": "Angelangepange",
          "body": "I think it's because people really don't understand how arfid works and they are also mostly unwilling to understand.    \n    \nFor us it's not really a matter of will I like it but will it make me gag or vomit.    \n      \nAfter working of expanding my diet I finally had the feeling of \"not liking\" something and it's completely different.     \n     \nI remember as a small child my dad asked me \"why do you not want to eat it\" and I, given that I was so young said \"it makes me vomit\" and meant it literally.     \nHim being an adult thought I was using figurative language (🤦🏻‍♀️) and told me \"you can't say that, you have to say you don't like it\" and so I started saying I didn't like it because I thought everyone also felt the same as me, that they vomit when they \"don't like it\" but are so strong willed that they ate it anyway.     \nBut they don't, they never feel sick in the first place.      \n       \nI believe it all comes from the words we all use to mean something different.    \nAnd with these words non arfid people refuse to understand the difference.",
          "created_utc": 1742626198.0
        }
      ]
    },
    {
      "id": "mj7rwb6",
      "author": "bubbleurry",
      "body": "wow, that’s so interesting!!! i had no idea that this kind of experiment existed, thank you so much for sharing!!",
      "created_utc": 1742681144.0,
      "score": 1,
      "context": [
        {
          "id": "mj45s50",
          "author": "jessipoo451",
          "body": "Fun fact: you actually can tell you won't like it before trying it because you're an advanced mammal. It's called Affective Forecasting. Someone did an experiment with orangutans where they gave them different flavoured juices to try to see which flavours they liked, and then gave them combinations of those juices, and the orangutans could tell before trying it whether they would enjoy it or not. This is just an example of how the ability to know whether you will like a food (based on your previous experience with the same ingredients, flavours, textures, etc.) is actually so simple that it exists in non-human primates too.",
          "created_utc": 1742631022.0
        }
      ]
    },
    {
      "id": "mj8bcwx",
      "author": "bubbleurry",
      "body": "exactly, isn’t it strange how they make us try things when and how they want? it almost never works!!",
      "created_utc": 1742687847.0,
      "score": 2,
      "context": [
        {
          "id": "mj6qah2",
          "author": "MysticCollective",
          "body": "I will admit that I used to say this when I was younger because I heard it so much growing up that I believed it. It made me forget that your sense of smell would absolutely \"taste\" your food before it even reaches your mouth. Also you see your food before it reaches your mouth too.\n\nSo yeah, I no longer say this or believe it. I am pretty sure I have PDA= Pathological Demand Avoidance. One of the many things I need to get assessed for. Anyway, my point is I hate hearing this phrase too. If you want me to try something kindly shut up and let me try it.",
          "created_utc": 1742668847.0
        }
      ]
    },
    {
      "id": "mj5muoz",
      "author": "bubbleurry",
      "body": "exactly, they don’t even try or care to understand, which is much more problematic!!",
      "created_utc": 1742656433.0,
      "score": 2,
      "context": [
        {
          "id": "mj2r75z",
          "author": "None",
          "body": "I fully support your feelings on this!  The bottom line is people who don’t have this can’t understand the anxiety and stress that trying new foods brings, especially foods that our brain is already telling us we aren’t going to like",
          "created_utc": 1742606156.0
        }
      ]
    },
    {
      "id": "mj88pme",
      "author": "bubbleurry",
      "body": "ugh there’s nothing worse than going through the whole process of gathering the courage to try something and then not liking it, especially when we’re judged as rude just bc we were honest about not liking it",
      "created_utc": 1742686926.0,
      "score": 2,
      "context": [
        {
          "id": "mj4j5ll",
          "author": "RealityTVfan28",
          "body": "Got that ALL THE TIME as a kid. Another one of their argument’s to get me to try/eat whatever they were pushing. \n\nWorse—when I liked the way something smelled and worked up the courage to try it—and it was horrible. Gag, try not to vomit. End. That was fried chicken for me. To this day, do not eat it or any meat.",
          "created_utc": 1742639867.0
        }
      ]
    },
    {
      "id": "mj89ohd",
      "author": "bubbleurry",
      "body": "i’m sure it must be amazing for her to know she can count on your support!! 💛",
      "created_utc": 1742687259.0,
      "score": 2,
      "context": [
        {
          "id": "mj53l4z",
          "author": "MsMistySkye",
          "body": "One of my besties kept trying to get pushy with my daughter who has ARFID on her visit last week.  \nI kept telling her what she would or would not eat,  but she kept trying to force things on her.  I got a bit defensive until she backed off a bit.  The kid is nearly 19, she knows what she wants to consume and what she's willing to try.  Back off!",
          "created_utc": 1742649747.0
        }
      ]
    },
    {
      "id": "mj8a869",
      "author": "bubbleurry",
      "body": "i agree with you, especially bc i’m at a point in my life where i’m no longer a child!!",
      "created_utc": 1742687448.0,
      "score": 2,
      "context": [
        {
          "id": "mj5k8e5",
          "author": "PompyPom",
          "body": "I’ve been forced to eat fish twice and that just resulted in me immediately spitting it out and vomiting. So now whenever someone gives me that whole song and dance, I tell them unless they want to see me puking at the table, I can make a better judgement about my own body and preferences than they can.",
          "created_utc": 1742655583.0
        }
      ]
    },
    {
      "id": "mj91a3p",
      "author": "bubbleurry",
      "body": "i’ve been saying that i can’t eat it, instead of just saying that i don’t like it, which makes ppl assume i have some kind of allergy or dietary restriction, and then they stop insisting. even so, it’s frustrating that we have to resort to these strategies so that we are not bothered",
      "created_utc": 1742697654.0,
      "score": 3,
      "context": [
        {
          "id": "mj76e0j",
          "author": "maxism_21",
          "body": "If I’m not close enough to the person to feel bad I’ll usually just lie and say I’ve had it before and didn’t enjoy it or I’m allergic or something dietary etc.\nThe quicker I shut down the conversation and don’t have to explain further the better",
          "created_utc": 1742674033.0
        }
      ]
    },
    {
      "id": "mjybys5",
      "author": "bubbleurry",
      "body": "i’m sorry to hear that you are facing this situation as well!! i have often been called stubborn, difficult, and demanding, just bc i couldn’t try a food that was offered to me. i understand how complicated this can be, and i empathize with your frustration",
      "created_utc": 1743045316.0,
      "score": 1,
      "context": [
        {
          "id": "mjt2raq",
          "author": "Traditional-Set-2019",
          "body": "I know how this feels and it sucks. The feeling you get just thinking about trying something you know you can’t and won’t like is physically unbearable. The cringe I get thinking about this happening is giving me flashbacks. I hate that people say that and I’m just stubborn and I should try it and how do you know if you haven’t. It’s frustrating as heck! I’m cringing 😬",
          "created_utc": 1742982650.0
        }
      ]
    },
    {
      "id": "mjycssc",
      "author": "bubbleurry",
      "body": "i can really relate to the situations you mentioned, so i can understand how difficult and frustrating it can be to live that way. fortunately, here we have the opportunity to support each other, as it is often challenging to find support from the ppl around us",
      "created_utc": 1743045653.0,
      "score": 2,
      "context": [
        {
          "id": "mjtuanb",
          "author": "Neither_Soil1903",
          "body": "I have never heard of this disorder.  Found this group when did a search for yogurt without fruit in it. My entire life i have been called weird because how I eat. Textures and smells make me gag till vomit. Basically can only tolerate some meats, grains and limited dairy. The smell of melted cheese makes me so nauseous I could never bring myself to eat it. Any cheese smells like vomited dirty socks to me.  I live in USA where cheese is on everything so I have been made fun of my entire life for hating cheese. You have no idea how seeing all these post has made me feel",
          "created_utc": 1742995160.0
        }
      ]
    },
    {
      "id": "mk4lzlm",
      "author": "None",
      "body": "With a texture issue, that will never happen.",
      "created_utc": 1743132733.0,
      "score": 2,
      "context": [
        {
          "id": "mj43zus",
          "author": "Phoenixtdm",
          "body": "Theres been times where I think I’ll like something and it’s disgusting and times when I think I won’t like something but it’s really good",
          "created_utc": 1742629843.0
        }
      ]
    },
    {
      "id": "mj7saep",
      "author": "bubbleurry",
      "body": "i guess i’m just not that lucky lol",
      "created_utc": 1742681281.0,
      "score": 1,
      "context": [
        {
          "id": "mj43zus",
          "author": "Phoenixtdm",
          "body": "Theres been times where I think I’ll like something and it’s disgusting and times when I think I won’t like something but it’s really good",
          "created_utc": 1742629843.0
        }
      ]
    },
    {
      "id": "mj89btn",
      "author": "bubbleurry",
      "body": "this is the worst!! our word just isn’t taken seriously, it doesn’t matter whether we’ve tried something or not when we say we don’t like it 😤😤",
      "created_utc": 1742687139.0,
      "score": 2,
      "context": [
        {
          "id": "mj4pbtm",
          "author": "No_Tailor_9572",
          "body": "& when I inevitably gagged up a storm, I also always got \"you're just being dramatic/acting because you were wrong about not liking it.\" Like, no mother, I did not choose to be like this",
          "created_utc": 1742643427.0
        }
      ]
    },
    {
      "id": "mjr2c4i",
      "author": "bubbleurry",
      "body": "thank you for showing me your way of handling this! i feel like I still have a long way to go before reaching a point where i could handle giving so many attempts to something i’m experimenting with. right now it seems out of reach, but who knows, maybe in the future!!",
      "created_utc": 1742947924.0,
      "score": 3,
      "context": [
        {
          "id": "mjj8pjn",
          "author": "ponsies",
          "body": "One of the ways that I worked on combatting this problem with myself is by taking something I called a no-thank you bite or lick, which is where I licked the thing or took a bite fully expecting to allow myself to spit it out if I didn’t like it. \n\nI also had the contamination fear type so I would sometimes have someone I trusted take a bite before I did to relieve some of that anxiety\n\nKeep in mind that it takes anywhere between 8 and 15 tries of an item for your taste buds and brain to figure out if you truly dislike it or if it’s just new and thus big scary.",
          "created_utc": 1742845930.0
        }
      ]
    },
    {
      "id": "mk4lir0",
      "author": "None",
      "body": "Some people can’t do this. I despise “no thank you bites” and I wish that term would go back to whatever underworld it originated in. I have a severe texture problem and one bite of something can cause my body to react as if it were poisoned, generate lots of saliva to try to make me get rid of it, make me gag, make me vomit a little, and if I still swallow it, it can make my stomach upset. Even trying to spit it out before chewing can still make me gag, shake and sweat while tears flow uncontrollably, and later burp the taste of vomit. My body really thinks that certain textures are not food and are poisonous.",
      "created_utc": 1743132545.0,
      "score": 0,
      "context": [
        {
          "id": "mjj8pjn",
          "author": "ponsies",
          "body": "One of the ways that I worked on combatting this problem with myself is by taking something I called a no-thank you bite or lick, which is where I licked the thing or took a bite fully expecting to allow myself to spit it out if I didn’t like it. \n\nI also had the contamination fear type so I would sometimes have someone I trusted take a bite before I did to relieve some of that anxiety\n\nKeep in mind that it takes anywhere between 8 and 15 tries of an item for your taste buds and brain to figure out if you truly dislike it or if it’s just new and thus big scary.",
          "created_utc": 1742845930.0
        }
      ]
    },
    {
      "id": "mk6n1va",
      "author": "bubbleurry",
      "body": "i go through this too!! it’s frustrating that people don’t realize, or don’t even try to understand, how this affects us. many times, we’re treated like picky children, but our life experience already gives us the ability to understand how these sensory aspects impact our relationship with food",
      "created_utc": 1743169890.0,
      "score": 2,
      "context": [
        {
          "id": "mk3amj4",
          "author": "None",
          "body": "Exactly.\n\nFor me, it was always a texture issue. Once I learned which textures I couldn’t have, it became very easy for me to look at something and tell, especially if it is similar to something that already made me gag.",
          "created_utc": 1743116510.0
        }
      ]
    },
    {
      "id": "mkfmu6e",
      "author": "bubbleurry",
      "body": "exactly!! the impact of sensory stimuli on our relationship with food cannot be ignored!!",
      "created_utc": 1743290228.0,
      "score": 2,
      "context": [
        {
          "id": "mk9ibtp",
          "author": "2cat007",
          "body": "I hate when people say that because from the look and smell I know I’m gonna hate it and thus decided to not eat it.",
          "created_utc": 1743200871.0
        }
      ]
    },
    {
      "id": "mkfo9zj",
      "author": "bubbleurry",
      "body": "thank you so much for sharing your knowledge on this!!! i believe the main issue is that many ppl around us are not willing to listen to our experiences and our relationship with food before labeling us as picky or demanding. for sure, trying something under those conditions is much more difficult",
      "created_utc": 1743290727.0,
      "score": 2,
      "context": [
        {
          "id": "mketnv3",
          "author": "animejaz",
          "body": "For anyone curious about my research and genuinely what to know why from the other side: I'm saying this with much respect, and as a wife to ARFID, and with a lot of loving research ( see below to sources) on this since I don't experience it myself.  \n\nBut from the outside there is research* about it taking anyone, even non ARFID, around 5-8 times of trying something new, Anything new, before it becomes no longer foreign and developing a fully sense analyzed experience that leads to a well rounded \"like/dislike\" of anything we put in our mouths. \n\nMost people don't have that in mind because of research, we have the experiences of trying something multiple times before we \"liked\" it. So we are subconsciously pulling from those experiences when suggesting there could be a good experience in there for you. \n\nIf it's someone that cares about you and knows that ARFID is involved, they are trying to be helpful. ( Which your probably know :) ) - If it's a new person in your life, they can't comprehend that you don't have those types of multiple experiences that have turned out good to reference. Re: my experiences with tomatoes over 15 years, is not something you can reference that helps. \n\nEither way, your journey is your own, and unless you are having an \"extra spoon\" day and want to push yourself and/or have someone you trust that your ok experimenting around - the rest can fuck off and should.  😝  And rant all you want, cause it definitely sucks. I don't like it either. \n\nKeep on keeping on!\n\n*https://pmc.ncbi.nlm.nih.gov/articles/PMC11397511\n\n*https://www.mdpi.com/2072-6643/16/17/3034\n\n*https://pmc.ncbi.nlm.nih.gov/articles/PMC10453506",
          "created_utc": 1743280221.0
        }
      ]
    },
    {
      "id": "mj4rsrt",
      "author": "taytayrawr",
      "body": "As a parent with a 7 year old, I agree with this. I pretty much never ate any fruits or veggies before she was born. I quickly decided I needed to try and eat better/healthier foods to model a positive relationship with food to her. That’s how I found out I actually do like oven roasted broccoli, which simply smelling made me gag as a kid. I can’t stand skin on food (apples, cucumbers, the stringy parts of oranges), it’s hard for me to get down, and I probably look similar to an upset toddler with how stressed it can make me. But I tried to dip cucumbers in hummus the other day and it masks the texture just enough to actually be enjoyable. I had to use a lot of hummus on each bite, but I still ate the cucumber without gagging, which is a huge win!\n\nI’ve been trying to walk the line between giving myself enough space to feel how I feel about my aversions, but also acknowledging that trying the food IS actually the only way I will know/start to be able to eat it. Sure there are probably some foods I’ll never be able to force down(fish 🤢) but if I’ve got enough energy in the moment, I’ll give the food a try. It’s easy to feel on the defensive when someone who doesn’t understand the stress that comes with trying a new food, is trying to push one on to you. So my strategy with my daughter has been to have her try a food, and if she puts in a good effort and actually doesn’t like it, she doesn’t have to eat it. But if she immediately shuts it down before even knowing what the food is, or tries to pretend she took a bite, I’m going to have to work harder to figure out if she actually doesn’t like it or if it’s just because it’s a new thing. Most of the time, she actually doesn’t like it lol, but every now and then we find a new food she does like. And I always praise her for trying the foods, even if she doesn’t like them. Because I understand how having the courage to try the new foods is just as big as trying something new and discovering you like it.",
      "created_utc": 1742644675.0,
      "score": 3,
      "context": [
        {
          "id": "mj39ykd",
          "author": "JaguarJo",
          "body": "This is a tough one for me because I've actually been on both sides of it. My whole childhood and young adult life was filled with people who didn't seem to understand that I could tell from either the smell or the visible texture that I knew I wasn't going to be able to eat something before I ever put any of it in my mouth. My parents didn't force it, thankfully, but eating in public still caused anxiety. I was probably in my 30's by the time I stopped letting other people affect how I interact with food.\n\nWhen I became a parent of two children, both with very limited acceptable food lists, trying to make sure they still get enough nourishment from their meals is challenging. I've actually found myself saying the dreaded words just out of desperation to get them to try to expand their palates. And the thing is, sometimes we do find new foods this way. But on the other hand, I also don't force my kids to eat anything they indicate is outright repulsive. I don't want them to hate food. I don't want them to dread restaurants or potlucks. And it really is bullshit how so many people still get pushy about what someone else should eat.\n\nI don't think most people are being intentionally malicious. I think they're usually just excited to share something they like with us. Or if they made it themselves, then it's something they feel proud of and they want confirmation that they did a good job. Unfortunately, it just goes completely sideways when they don't understand our pre-existing struggles with food and the trauma that often comes with it.",
          "created_utc": 1742613456.0
        }
      ]
    },
    {
      "id": "mj936nb",
      "author": "bubbleurry",
      "body": "i really admire that you have the opportunity to be on both sides; it definitely gives you a broader and more empathetic view of the subject, which is truly amazing. from what i gathered in the comments of this post, the main issue seems to be the way food is imposed on us and how our preferences are disregarded, even when we try to open ourselves to new experiences. just by being so understanding about it, you’re already doing something exceptional, something that, unfortunately, not all of us have had the chance to experience! so, all my support for you to keep up this positive attitude 💛",
      "created_utc": 1742698427.0,
      "score": 2,
      "context": [
        {
          "id": "mj39ykd",
          "author": "JaguarJo",
          "body": "This is a tough one for me because I've actually been on both sides of it. My whole childhood and young adult life was filled with people who didn't seem to understand that I could tell from either the smell or the visible texture that I knew I wasn't going to be able to eat something before I ever put any of it in my mouth. My parents didn't force it, thankfully, but eating in public still caused anxiety. I was probably in my 30's by the time I stopped letting other people affect how I interact with food.\n\nWhen I became a parent of two children, both with very limited acceptable food lists, trying to make sure they still get enough nourishment from their meals is challenging. I've actually found myself saying the dreaded words just out of desperation to get them to try to expand their palates. And the thing is, sometimes we do find new foods this way. But on the other hand, I also don't force my kids to eat anything they indicate is outright repulsive. I don't want them to hate food. I don't want them to dread restaurants or potlucks. And it really is bullshit how so many people still get pushy about what someone else should eat.\n\nI don't think most people are being intentionally malicious. I think they're usually just excited to share something they like with us. Or if they made it themselves, then it's something they feel proud of and they want confirmation that they did a good job. Unfortunately, it just goes completely sideways when they don't understand our pre-existing struggles with food and the trauma that often comes with it.",
          "created_utc": 1742613456.0
        }
      ]
    },
    {
      "id": "mj521p0",
      "author": "bubbleurry",
      "body": "gosh, yes!!! i really don’t know how many times, after trying something and saying i didn’t like it, i was considered rude. isn’t it absurd how we’re treated with so much intolerance, regardless of our actions?? 🙄🙄",
      "created_utc": 1742649136.0,
      "score": 11,
      "context": [
        {
          "id": "mj2oi8s",
          "author": "rigathrow",
          "body": "god, i got this SO fucking much growing up. sure there is the chance that something might taste better than it smells/looks but i know myself and my body. i know that if the mere thought of something being in my mouth makes me physically retch then.... uhh, yeah, i can safely say i won't like it so won't be trying it.\n\nlike, if my brain decides i won't like something, i physically can't eat it. my body will physically reject it before it even touches my lips. every single time i've tried bringing a smoothie to my mouth, i've vomited. i'm not doing this on purpose. why the hell would i? what's to gain from it?",
          "created_utc": 1742605162.0
        },
        {
          "id": "mj46trm",
          "author": "Tricky-Sentence",
          "body": "My favorite combination was forcing me into trying when I said it won't work, trying it, then I visibly gag attempting to not throw up, and then I get berated because \"You made the cook feel bad/like their food is gross\". WTH did you expect was gonna happen mom?",
          "created_utc": 1742631720.0
        }
      ]
    },
    {
      "id": "mk3c1kp",
      "author": "None",
      "body": "Yes!!!!\n\nAlso, being told that you’re faking the vomiting or gagging because you want them to feel badly out of meanness. ",
      "created_utc": 1743116939.0,
      "score": 3,
      "context": [
        {
          "id": "mj2oi8s",
          "author": "rigathrow",
          "body": "god, i got this SO fucking much growing up. sure there is the chance that something might taste better than it smells/looks but i know myself and my body. i know that if the mere thought of something being in my mouth makes me physically retch then.... uhh, yeah, i can safely say i won't like it so won't be trying it.\n\nlike, if my brain decides i won't like something, i physically can't eat it. my body will physically reject it before it even touches my lips. every single time i've tried bringing a smoothie to my mouth, i've vomited. i'm not doing this on purpose. why the hell would i? what's to gain from it?",
          "created_utc": 1742605162.0
        },
        {
          "id": "mj46trm",
          "author": "Tricky-Sentence",
          "body": "My favorite combination was forcing me into trying when I said it won't work, trying it, then I visibly gag attempting to not throw up, and then I get berated because \"You made the cook feel bad/like their food is gross\". WTH did you expect was gonna happen mom?",
          "created_utc": 1742631720.0
        }
      ]
    },
    {
      "id": "mjaiwve",
      "author": "RealityTVfan28",
      "body": "OMG THIS ☝🏼. I cannot watch TV shows w weird food challenges. I have to walk away for fast forward. I have loved amazing race forever. Could never go on it they might want me to eat something weird!!",
      "created_utc": 1742727578.0,
      "score": 2,
      "context": [
        {
          "id": "mj2oi8s",
          "author": "rigathrow",
          "body": "god, i got this SO fucking much growing up. sure there is the chance that something might taste better than it smells/looks but i know myself and my body. i know that if the mere thought of something being in my mouth makes me physically retch then.... uhh, yeah, i can safely say i won't like it so won't be trying it.\n\nlike, if my brain decides i won't like something, i physically can't eat it. my body will physically reject it before it even touches my lips. every single time i've tried bringing a smoothie to my mouth, i've vomited. i'm not doing this on purpose. why the hell would i? what's to gain from it?",
          "created_utc": 1742605162.0
        },
        {
          "id": "mj70n4i",
          "author": "3V3451NC3",
          "body": "This is why ive never understood those gross food challenges. Everytime i eat something i dislike my body has a physical reaction, and its so uncomfortable. I guess people without ARFID dont really relate but holy shit i just cant wrap my brain around it",
          "created_utc": 1742672204.0
        }
      ]
    },
    {
      "id": "mk3dtbi",
      "author": "None",
      "body": "I think this is the reason that people pick on us. Normal people don’t have a gag reflex that is so easily triggered unless they are eating poison. For us, our brain does not recognize that these things are edible for some reason and immediate gags, vomits, or even causes and upset stomach because it really seems to think that we’ve eaten a non-food item.",
      "created_utc": 1743117490.0,
      "score": 2,
      "context": [
        {
          "id": "mj2oi8s",
          "author": "rigathrow",
          "body": "god, i got this SO fucking much growing up. sure there is the chance that something might taste better than it smells/looks but i know myself and my body. i know that if the mere thought of something being in my mouth makes me physically retch then.... uhh, yeah, i can safely say i won't like it so won't be trying it.\n\nlike, if my brain decides i won't like something, i physically can't eat it. my body will physically reject it before it even touches my lips. every single time i've tried bringing a smoothie to my mouth, i've vomited. i'm not doing this on purpose. why the hell would i? what's to gain from it?",
          "created_utc": 1742605162.0
        },
        {
          "id": "mj70n4i",
          "author": "3V3451NC3",
          "body": "This is why ive never understood those gross food challenges. Everytime i eat something i dislike my body has a physical reaction, and its so uncomfortable. I guess people without ARFID dont really relate but holy shit i just cant wrap my brain around it",
          "created_utc": 1742672204.0
        }
      ]
    },
    {
      "id": "mjfkpz7",
      "author": "Preppy_Hippie",
      "body": "The point of those challenges is self-mastery- that is to say, controlling the violent urge to throw up or be revolted. So the competition isn't easy or pleasurable for the participants. It's not that they don't have these violent physical reactions to the gross foods. They do it exactly because it is hard and they want to conquer or transcend that.",
      "created_utc": 1742792383.0,
      "score": 1,
      "context": [
        {
          "id": "mj2oi8s",
          "author": "rigathrow",
          "body": "god, i got this SO fucking much growing up. sure there is the chance that something might taste better than it smells/looks but i know myself and my body. i know that if the mere thought of something being in my mouth makes me physically retch then.... uhh, yeah, i can safely say i won't like it so won't be trying it.\n\nlike, if my brain decides i won't like something, i physically can't eat it. my body will physically reject it before it even touches my lips. every single time i've tried bringing a smoothie to my mouth, i've vomited. i'm not doing this on purpose. why the hell would i? what's to gain from it?",
          "created_utc": 1742605162.0
        },
        {
          "id": "mj70n4i",
          "author": "3V3451NC3",
          "body": "This is why ive never understood those gross food challenges. Everytime i eat something i dislike my body has a physical reaction, and its so uncomfortable. I guess people without ARFID dont really relate but holy shit i just cant wrap my brain around it",
          "created_utc": 1742672204.0
        }
      ]
    },
    {
      "id": "mj6xhz6",
      "author": "Preppy_Hippie",
      "body": "Yeah it’s tough. It sucks. But unfortunately we all kind operate that way. We expect others to see things the way we do, and they expect us to see things the way they do. 🤷‍♂️\n\nI wonder- maybe since you have had food like it, that you know doesn’t agree with you, maybe say “oh no, I remember now I have had tried it and can’t tolerate it/am allergic, etc” or something. If you’re worried about lying- it’s kinda true as you have had similar enough things that you know it’s in the same category/basically the same to you. And also, frankly, you don’t owe them anything. \n\nDoes that sound like an ok idea?",
      "created_utc": 1742671177.0,
      "score": 2,
      "context": [
        {
          "id": "mj467yo",
          "author": "Preppy_Hippie",
          "body": "They are going by their experience and don't understand ARFID. They have had food, many times, that they were resistant to trying and worried that it would be revolting, but when they did try it they found it wasn't as bad as they expected- sometimes even good. They also have, many many times, experienced foods that taste and feel a LOT different than they smell or appear. They also know in the raising of children that this is generally the right approach. That it is normal to take multiple attempts before knowing for sure if the child doesn't really like it- and usually they come around. And sorry to say they are imagining ARFID as a fussy, picky eater on steroids, who probably wasn't parented properly and who might not actually know what they like because their diet is so limited.\n\nBut really, if you think about it for 2 seconds, it makes total sense that if you have severe reactions every time to certain smells, textures, etc and have known, experienced and tested and retested it for many years- that you would know. So it really is crazy to treat you like you were born yesterday.  Unfortunately, yes it really is that foreign to their experience and hard for them to understand, sorry to say, and they are not giving it much thought.  :(",
          "created_utc": 1742631313.0
        },
        {
          "id": "mj5lnkw",
          "author": "bubbleurry",
          "body": "i agree with you, unfortunately, it seems much easier to label someone as childish or picky than to truly make an effort to understand their experience with food. it just doesn’t seem reasonable to use your personal experiences as a basis to judge others, but that’s exactly what ppl do all the time",
          "created_utc": 1742656046.0
        }
      ]
    },
    {
      "id": "mj9s8cz",
      "author": "Angelangepange",
      "body": "Yes that's totally my experience as well, people don't want to know and they hate to hear the word vomit so they think you are rude even tho they put you into the position of having to explain yourself by not taking your no in the first place.    \nI also had to learn to compliment the food first and then say vague things like \"it doesn't agree with me\" \"I would have bad reaction\"    \nThey can respect our \"restraint\" (some times) but not take no for an answer.   \n      \nThe only times I managed to explain this successfully was if it was in private and way before any food was even made and it took like an hour of talking and them not understanding for a while. But not being in public or already infront of the food I suppose makes them feel like they are not on the spot or something.     \n       \nIt's ridiculous that we have to dance on the egg shells of peoples egos like this, they don't like to be on the spot but it's totally fine to put us on the spot after we say no.",
      "created_utc": 1742710806.0,
      "score": 4,
      "context": [
        {
          "id": "mj3ydue",
          "author": "Angelangepange",
          "body": "I think it's because people really don't understand how arfid works and they are also mostly unwilling to understand.    \n    \nFor us it's not really a matter of will I like it but will it make me gag or vomit.    \n      \nAfter working of expanding my diet I finally had the feeling of \"not liking\" something and it's completely different.     \n     \nI remember as a small child my dad asked me \"why do you not want to eat it\" and I, given that I was so young said \"it makes me vomit\" and meant it literally.     \nHim being an adult thought I was using figurative language (🤦🏻‍♀️) and told me \"you can't say that, you have to say you don't like it\" and so I started saying I didn't like it because I thought everyone also felt the same as me, that they vomit when they \"don't like it\" but are so strong willed that they ate it anyway.     \nBut they don't, they never feel sick in the first place.      \n       \nI believe it all comes from the words we all use to mean something different.    \nAnd with these words non arfid people refuse to understand the difference.",
          "created_utc": 1742626198.0
        },
        {
          "id": "mj7rfpr",
          "author": "bubbleurry",
          "body": "these days, i realize that the words we choose in these situations make all the difference, as you mentioned. unfortunately, when i say that i might vomit, it never works for me. there was one time when i said this, and someone got really offended, telling me that i shouldn’t talk about food that way. what has been working, then, is saying that i can’t eat something, instead of saying that i don’t like it, bc that way ppl assume it’s due to some allergy or restriction and don’t insist on convincing me to try it. in the end, it’s frustrating that we have to think about these strategies when a simple ‘no, thank you’ should be enough",
          "created_utc": 1742680986.0
        }
      ]
    },
    {
      "id": "mj7t54t",
      "author": "jessipoo451",
      "body": "Yeah, I just learned about it in a lecture on taste perception the other day and thought it was interesting.\n\nBut also, interestingly, the orangutan had some flavours they liked and some they didn't, but they still sometimes enjoyed the combined drinks even if they contained disliked flavours, as long as the enjoyed flavour was strong enough. So that made me consider trying some foods that contain disliked flavours if it also contains very strong liked flavours. E.g. if you dislike the taste of a pizza but really love a particular sauce then you might be able to eat them combined. Only if you dislike some ingredients in a drink but love cherry flavour, then you might still enjoy the drink since the cherry flavour might overpower the others.",
      "created_utc": 1742681576.0,
      "score": 1,
      "context": [
        {
          "id": "mj45s50",
          "author": "jessipoo451",
          "body": "Fun fact: you actually can tell you won't like it before trying it because you're an advanced mammal. It's called Affective Forecasting. Someone did an experiment with orangutans where they gave them different flavoured juices to try to see which flavours they liked, and then gave them combinations of those juices, and the orangutans could tell before trying it whether they would enjoy it or not. This is just an example of how the ability to know whether you will like a food (based on your previous experience with the same ingredients, flavours, textures, etc.) is actually so simple that it exists in non-human primates too.",
          "created_utc": 1742631022.0
        },
        {
          "id": "mj7rwb6",
          "author": "bubbleurry",
          "body": "wow, that’s so interesting!!! i had no idea that this kind of experiment existed, thank you so much for sharing!!",
          "created_utc": 1742681144.0
        }
      ]
    },
    {
      "id": "mk4qtx3",
      "author": "Phoenixtdm",
      "body": "I’m sensitive to flavors not really textures",
      "created_utc": 1743134747.0,
      "score": 2,
      "context": [
        {
          "id": "mj43zus",
          "author": "Phoenixtdm",
          "body": "Theres been times where I think I’ll like something and it’s disgusting and times when I think I won’t like something but it’s really good",
          "created_utc": 1742629843.0
        },
        {
          "id": "mk4lzlm",
          "author": "None",
          "body": "With a texture issue, that will never happen.",
          "created_utc": 1743132733.0
        }
      ]
    },
    {
      "id": "mk4m6g5",
      "author": "ponsies",
      "body": "Hi, yes, I experienced the same thing and was eventually able to overcome it through exposure therapy. If you don’t like my anecdote then just don’t follow my advice. You have free will.\n\nEditing to add: it doesn’t have to be a bite to be a no-thank-you bite. It can also be a lick or a smell if you can’t make yourself taste it. And you don’t have to swallow it if you can’t handle it. The point is exposure, not immediate success.",
      "created_utc": 1743132809.0,
      "score": 1,
      "context": [
        {
          "id": "mjj8pjn",
          "author": "ponsies",
          "body": "One of the ways that I worked on combatting this problem with myself is by taking something I called a no-thank you bite or lick, which is where I licked the thing or took a bite fully expecting to allow myself to spit it out if I didn’t like it. \n\nI also had the contamination fear type so I would sometimes have someone I trusted take a bite before I did to relieve some of that anxiety\n\nKeep in mind that it takes anywhere between 8 and 15 tries of an item for your taste buds and brain to figure out if you truly dislike it or if it’s just new and thus big scary.",
          "created_utc": 1742845930.0
        },
        {
          "id": "mk4lir0",
          "author": "None",
          "body": "Some people can’t do this. I despise “no thank you bites” and I wish that term would go back to whatever underworld it originated in. I have a severe texture problem and one bite of something can cause my body to react as if it were poisoned, generate lots of saliva to try to make me get rid of it, make me gag, make me vomit a little, and if I still swallow it, it can make my stomach upset. Even trying to spit it out before chewing can still make me gag, shake and sweat while tears flow uncontrollably, and later burp the taste of vomit. My body really thinks that certain textures are not food and are poisonous.",
          "created_utc": 1743132545.0
        }
      ]
    },
    {
      "id": "mkg0zyw",
      "author": "animejaz",
      "body": "100%! \n\nThanks for being open to hearing my experiences. ❤️\n\nThrough multiple years and varying experiences with me, my husband has shed much of that type of trauma and judgement, but it's a lifetime journey. You're totally right, when the average person gets to, \"I can't relate - why try. Imma stick a label on it and call it a day\".  🙄 That's just being a lazy human being and those people...meh.\n\nI've had the \"fun\" of trying to explain it to others, ARFID is complex. Everyone is different about their ARFID, hence all my research, it's still hard for him  to explain some of the nuances to me. \n\nMy husband still experiences anxiety, concern, and triggers around food. ( No joke, we have a dinner party tonight) But we take the time to figure out how to talk about it. I'm still learning a lot about when I can try to stretch him and when not to. But I still wish people did that more often in a lot of areas of life. 😮‍💨",
      "created_utc": 1743295237.0,
      "score": 2,
      "context": [
        {
          "id": "mketnv3",
          "author": "animejaz",
          "body": "For anyone curious about my research and genuinely what to know why from the other side: I'm saying this with much respect, and as a wife to ARFID, and with a lot of loving research ( see below to sources) on this since I don't experience it myself.  \n\nBut from the outside there is research* about it taking anyone, even non ARFID, around 5-8 times of trying something new, Anything new, before it becomes no longer foreign and developing a fully sense analyzed experience that leads to a well rounded \"like/dislike\" of anything we put in our mouths. \n\nMost people don't have that in mind because of research, we have the experiences of trying something multiple times before we \"liked\" it. So we are subconsciously pulling from those experiences when suggesting there could be a good experience in there for you. \n\nIf it's someone that cares about you and knows that ARFID is involved, they are trying to be helpful. ( Which your probably know :) ) - If it's a new person in your life, they can't comprehend that you don't have those types of multiple experiences that have turned out good to reference. Re: my experiences with tomatoes over 15 years, is not something you can reference that helps. \n\nEither way, your journey is your own, and unless you are having an \"extra spoon\" day and want to push yourself and/or have someone you trust that your ok experimenting around - the rest can fuck off and should.  😝  And rant all you want, cause it definitely sucks. I don't like it either. \n\nKeep on keeping on!\n\n*https://pmc.ncbi.nlm.nih.gov/articles/PMC11397511\n\n*https://www.mdpi.com/2072-6643/16/17/3034\n\n*https://pmc.ncbi.nlm.nih.gov/articles/PMC10453506",
          "created_utc": 1743280221.0
        },
        {
          "id": "mkfo9zj",
          "author": "bubbleurry",
          "body": "thank you so much for sharing your knowledge on this!!! i believe the main issue is that many ppl around us are not willing to listen to our experiences and our relationship with food before labeling us as picky or demanding. for sure, trying something under those conditions is much more difficult",
          "created_utc": 1743290727.0
        }
      ]
    },
    {
      "id": "mk3e27s",
      "author": "None",
      "body": "Well, they are still different from us because we gag and vomit so badly from ACTUAL foods to the point in which we are shaking and crying as if we have really been poisoned.",
      "created_utc": 1743117567.0,
      "score": 2,
      "context": [
        {
          "id": "mj2oi8s",
          "author": "rigathrow",
          "body": "god, i got this SO fucking much growing up. sure there is the chance that something might taste better than it smells/looks but i know myself and my body. i know that if the mere thought of something being in my mouth makes me physically retch then.... uhh, yeah, i can safely say i won't like it so won't be trying it.\n\nlike, if my brain decides i won't like something, i physically can't eat it. my body will physically reject it before it even touches my lips. every single time i've tried bringing a smoothie to my mouth, i've vomited. i'm not doing this on purpose. why the hell would i? what's to gain from it?",
          "created_utc": 1742605162.0
        },
        {
          "id": "mj70n4i",
          "author": "3V3451NC3",
          "body": "This is why ive never understood those gross food challenges. Everytime i eat something i dislike my body has a physical reaction, and its so uncomfortable. I guess people without ARFID dont really relate but holy shit i just cant wrap my brain around it",
          "created_utc": 1742672204.0
        },
        {
          "id": "mjfkpz7",
          "author": "Preppy_Hippie",
          "body": "The point of those challenges is self-mastery- that is to say, controlling the violent urge to throw up or be revolted. So the competition isn't easy or pleasurable for the participants. It's not that they don't have these violent physical reactions to the gross foods. They do it exactly because it is hard and they want to conquer or transcend that.",
          "created_utc": 1742792383.0
        }
      ]
    },
    {
      "id": "mj955ye",
      "author": "bubbleurry",
      "body": "that’s a great idea, thank you!!! actually, i already do something like that. when i’m offered food that doesn’t seem safe, i say i can’t eat it, instead of saying i don’t like it, which makes people think i have some kind of allergy or restriction, and then they stop insisting. it’s a bit sad that we have to do this to have peace, but that’s just how things are :[",
      "created_utc": 1742699252.0,
      "score": 1,
      "context": [
        {
          "id": "mj467yo",
          "author": "Preppy_Hippie",
          "body": "They are going by their experience and don't understand ARFID. They have had food, many times, that they were resistant to trying and worried that it would be revolting, but when they did try it they found it wasn't as bad as they expected- sometimes even good. They also have, many many times, experienced foods that taste and feel a LOT different than they smell or appear. They also know in the raising of children that this is generally the right approach. That it is normal to take multiple attempts before knowing for sure if the child doesn't really like it- and usually they come around. And sorry to say they are imagining ARFID as a fussy, picky eater on steroids, who probably wasn't parented properly and who might not actually know what they like because their diet is so limited.\n\nBut really, if you think about it for 2 seconds, it makes total sense that if you have severe reactions every time to certain smells, textures, etc and have known, experienced and tested and retested it for many years- that you would know. So it really is crazy to treat you like you were born yesterday.  Unfortunately, yes it really is that foreign to their experience and hard for them to understand, sorry to say, and they are not giving it much thought.  :(",
          "created_utc": 1742631313.0
        },
        {
          "id": "mj5lnkw",
          "author": "bubbleurry",
          "body": "i agree with you, unfortunately, it seems much easier to label someone as childish or picky than to truly make an effort to understand their experience with food. it just doesn’t seem reasonable to use your personal experiences as a basis to judge others, but that’s exactly what ppl do all the time",
          "created_utc": 1742656046.0
        },
        {
          "id": "mj6xhz6",
          "author": "Preppy_Hippie",
          "body": "Yeah it’s tough. It sucks. But unfortunately we all kind operate that way. We expect others to see things the way we do, and they expect us to see things the way they do. 🤷‍♂️\n\nI wonder- maybe since you have had food like it, that you know doesn’t agree with you, maybe say “oh no, I remember now I have had tried it and can’t tolerate it/am allergic, etc” or something. If you’re worried about lying- it’s kinda true as you have had similar enough things that you know it’s in the same category/basically the same to you. And also, frankly, you don’t owe them anything. \n\nDoes that sound like an ok idea?",
          "created_utc": 1742671177.0
        }
      ]
    },
    {
      "id": "mk4mwef",
      "author": "None",
      "body": "I’ve had years of repeated exposure due to aggressive parenting and it’s not that I “don’t like” your advice, but that it’s actually harmful because people who don’t have ARFID are constantly saying “just one bite; just try it once more” and to us, it is saying “just vomit and ruin another meal just one more time” when there are plenty of foods available that won’t make us vomit so why not just shut up and let us eat those.",
      "created_utc": 1743133101.0,
      "score": 2,
      "context": [
        {
          "id": "mjj8pjn",
          "author": "ponsies",
          "body": "One of the ways that I worked on combatting this problem with myself is by taking something I called a no-thank you bite or lick, which is where I licked the thing or took a bite fully expecting to allow myself to spit it out if I didn’t like it. \n\nI also had the contamination fear type so I would sometimes have someone I trusted take a bite before I did to relieve some of that anxiety\n\nKeep in mind that it takes anywhere between 8 and 15 tries of an item for your taste buds and brain to figure out if you truly dislike it or if it’s just new and thus big scary.",
          "created_utc": 1742845930.0
        },
        {
          "id": "mk4lir0",
          "author": "None",
          "body": "Some people can’t do this. I despise “no thank you bites” and I wish that term would go back to whatever underworld it originated in. I have a severe texture problem and one bite of something can cause my body to react as if it were poisoned, generate lots of saliva to try to make me get rid of it, make me gag, make me vomit a little, and if I still swallow it, it can make my stomach upset. Even trying to spit it out before chewing can still make me gag, shake and sweat while tears flow uncontrollably, and later burp the taste of vomit. My body really thinks that certain textures are not food and are poisonous.",
          "created_utc": 1743132545.0
        },
        {
          "id": "mk4m6g5",
          "author": "ponsies",
          "body": "Hi, yes, I experienced the same thing and was eventually able to overcome it through exposure therapy. If you don’t like my anecdote then just don’t follow my advice. You have free will.\n\nEditing to add: it doesn’t have to be a bite to be a no-thank-you bite. It can also be a lick or a smell if you can’t make yourself taste it. And you don’t have to swallow it if you can’t handle it. The point is exposure, not immediate success.",
          "created_utc": 1743132809.0
        }
      ]
    },
    {
      "id": "mkat8na",
      "author": "Preppy_Hippie",
      "body": "That is an excellent description, and yes, that sensation is exactly the same for a contestant faced with eating fish eyeballs or donkey testicles, or whatever. Most cannot power through this, and even people watching feel it.  There are some that can power through this feeling to win the prize. Yes, that's that sad part of ARFID that the experience of broccoli or spinach or whatever is the same as fish eyeballs, etc. It's frustrating that it also means you can't trust your body to tell you what it needs, as it has been so monopolized by this revoltion. Even harder that there does not seem to be effective treatments or motivation to explore or prioritize them. Very tough. It's like living in Fear Factor and not wanting to be there or win the prize.",
      "created_utc": 1743217469.0,
      "score": 3,
      "context": [
        {
          "id": "mj2oi8s",
          "author": "rigathrow",
          "body": "god, i got this SO fucking much growing up. sure there is the chance that something might taste better than it smells/looks but i know myself and my body. i know that if the mere thought of something being in my mouth makes me physically retch then.... uhh, yeah, i can safely say i won't like it so won't be trying it.\n\nlike, if my brain decides i won't like something, i physically can't eat it. my body will physically reject it before it even touches my lips. every single time i've tried bringing a smoothie to my mouth, i've vomited. i'm not doing this on purpose. why the hell would i? what's to gain from it?",
          "created_utc": 1742605162.0
        },
        {
          "id": "mj70n4i",
          "author": "3V3451NC3",
          "body": "This is why ive never understood those gross food challenges. Everytime i eat something i dislike my body has a physical reaction, and its so uncomfortable. I guess people without ARFID dont really relate but holy shit i just cant wrap my brain around it",
          "created_utc": 1742672204.0
        },
        {
          "id": "mjfkpz7",
          "author": "Preppy_Hippie",
          "body": "The point of those challenges is self-mastery- that is to say, controlling the violent urge to throw up or be revolted. So the competition isn't easy or pleasurable for the participants. It's not that they don't have these violent physical reactions to the gross foods. They do it exactly because it is hard and they want to conquer or transcend that.",
          "created_utc": 1742792383.0
        },
        {
          "id": "mk3e27s",
          "author": "None",
          "body": "Well, they are still different from us because we gag and vomit so badly from ACTUAL foods to the point in which we are shaking and crying as if we have really been poisoned.",
          "created_utc": 1743117567.0
        }
      ]
    },
    {
      "id": "mjcz2jy",
      "author": "Preppy_Hippie",
      "body": "Oh good I'm glad that suggestion resonates with you!\n\nI’m a firm believer that it is important to be honest. But I think we all find that when we are too honest with things we are struggling with, it sucks other people into our struggle. They will try to understand it but don’t always have the experience to understand it, and so it turns into judgment. Everyone experiences this, not just with ARFID. That’s why in the US, for example, it is polite to ask, “How are you?” and basically, no one answers that question honestly. They don't want to get into it. They are worried about coming off negative or being judged if they share their struggles. It’s also why people make up all kinds of BS excuses not to do things or join in things socially or professionally.\n\nI was worried about the morality of these excuses/white lies until I encountered one of the details of my religion as to whether or not a lie needs to be confessed.  One of the aspects is that the person is or should be entitled to the truth. So if you BS a waitress calling an intolerance and allergy, for example, to make sure it is taken seriously (and because you don't want to spend the time getting into the details with her - and then ultimately not have the severity be understood) that it is harmless. But, of course, don’t BS your doctor or misrepresent your ARFID to date, for example. Even forgetting morality- it's not in your interest.\n\nIf it makes you feel any better, everyone has limitations of one kind or another and is covering for stuff this way. In a way, this might be some of the judgmental pushback you are getting- that you are not playing the game the way they are, and they expect, so it sounds childlike to them (both the honesty and the dietary restrictions). Sorry if that sounds harsh.\n\nSending best wishes.",
      "created_utc": 1742758607.0,
      "score": 2,
      "context": [
        {
          "id": "mj467yo",
          "author": "Preppy_Hippie",
          "body": "They are going by their experience and don't understand ARFID. They have had food, many times, that they were resistant to trying and worried that it would be revolting, but when they did try it they found it wasn't as bad as they expected- sometimes even good. They also have, many many times, experienced foods that taste and feel a LOT different than they smell or appear. They also know in the raising of children that this is generally the right approach. That it is normal to take multiple attempts before knowing for sure if the child doesn't really like it- and usually they come around. And sorry to say they are imagining ARFID as a fussy, picky eater on steroids, who probably wasn't parented properly and who might not actually know what they like because their diet is so limited.\n\nBut really, if you think about it for 2 seconds, it makes total sense that if you have severe reactions every time to certain smells, textures, etc and have known, experienced and tested and retested it for many years- that you would know. So it really is crazy to treat you like you were born yesterday.  Unfortunately, yes it really is that foreign to their experience and hard for them to understand, sorry to say, and they are not giving it much thought.  :(",
          "created_utc": 1742631313.0
        },
        {
          "id": "mj5lnkw",
          "author": "bubbleurry",
          "body": "i agree with you, unfortunately, it seems much easier to label someone as childish or picky than to truly make an effort to understand their experience with food. it just doesn’t seem reasonable to use your personal experiences as a basis to judge others, but that’s exactly what ppl do all the time",
          "created_utc": 1742656046.0
        },
        {
          "id": "mj6xhz6",
          "author": "Preppy_Hippie",
          "body": "Yeah it’s tough. It sucks. But unfortunately we all kind operate that way. We expect others to see things the way we do, and they expect us to see things the way they do. 🤷‍♂️\n\nI wonder- maybe since you have had food like it, that you know doesn’t agree with you, maybe say “oh no, I remember now I have had tried it and can’t tolerate it/am allergic, etc” or something. If you’re worried about lying- it’s kinda true as you have had similar enough things that you know it’s in the same category/basically the same to you. And also, frankly, you don’t owe them anything. \n\nDoes that sound like an ok idea?",
          "created_utc": 1742671177.0
        },
        {
          "id": "mj955ye",
          "author": "bubbleurry",
          "body": "that’s a great idea, thank you!!! actually, i already do something like that. when i’m offered food that doesn’t seem safe, i say i can’t eat it, instead of saying i don’t like it, which makes people think i have some kind of allergy or restriction, and then they stop insisting. it’s a bit sad that we have to do this to have peace, but that’s just how things are :[",
          "created_utc": 1742699252.0
        }
      ]
    }
  ]
}