{
  "id": "1jhmu7t",
  "subreddit": "ARFID",
  "author": "OniiKaps",
  "created_utc": 1742689410.0,
  "title": "“it tastes the same” NO IT DOESNT !!!!",
  "selftext": "I’m talking about reheated food btw. Every time i have leftovers my family says to reheat it another time, that “it’ll taste the same”. it does NOT taste the same, it tastes so much worse, and the texture becomes god awful. i’ve tried oven, microwave, and air fryer reheating, all of them are awful.\n\nThis is also why i can’t do meal planning. As soon as any leftovers go in to the fridge / freezer, they are never coming out the same. \n\nThis stems from getting ice cream today, my mom didn’t want to wait to order it (i was currently making my dinner) so she just put mine in the freezer saying “it’ll be the same” ,, no the hell it wasn’t 😭 ",
  "url": "https://www.reddit.com/r/ARFID/comments/1jhmu7t/it_tastes_the_same_no_it_doesnt/",
  "score": 283,
  "num_comments": 52,
  "comments": [
    {
      "id": "mj8hdm5",
      "author": "LoafingLion",
      "body": "Exactly!! My family thinks I'm crazy for refusing to eat reheated pizza even if I loved it when it was fresh. It's SO gross. Same with pasta. I have to make a lot of small batches now because it gets so chewy and bland if I reheat it.",
      "created_utc": 1742690048.0,
      "score": 81,
      "context": []
    },
    {
      "id": "mj8hgo6",
      "author": "Digimonera",
      "body": "I know it is not the same but to me the best way to reheat food is to microwave it with a glass of water next to it. Just a tip 🌻✨🫱🏼‍🫲🏽 it is great for bread for example.",
      "created_utc": 1742690079.0,
      "score": 27,
      "context": []
    },
    {
      "id": "mj8nnk9",
      "author": "FlemFatale",
      "body": "I do not eat leftovers. Never have, and never will. I fucking hate reheated food, because you expect one thing, and get something totally different. Nope nope nope.",
      "created_utc": 1742692377.0,
      "score": 28,
      "context": []
    },
    {
      "id": "mj8uopx",
      "author": "TashaT50",
      "body": "I find it depends on the food. I actually love some leftovers but but I hate others. Liking leftovers doesn’t necessarily mean they taste the same though. Other people telling me leftovers taste the same aren’t to be trusted though. Textures definitely changes for all sorts of things even fresh ice cream put in the freezer isn’t the same texture as it was at the ice cream stand.",
      "created_utc": 1742695076.0,
      "score": 25,
      "context": []
    },
    {
      "id": "mja563o",
      "author": "Cassio_Taylor",
      "body": "I genuinely don’t believe most people can taste the difference, or at least not as much as people with ARFID. We are hyper aware of it so we hate the difference",
      "created_utc": 1742718974.0,
      "score": 17,
      "context": []
    },
    {
      "id": "mj9fnyz",
      "author": "puppyhugtime",
      "body": "Leftovers are tricky for me too. There are certain foods I will *not* keep leftovers of because I know I won’t eat them. But there are some other foods that I’ve found reheat better, or foods that I’ve learned how to reheat so it tastes better.\n\nETA: I love soups and stews, they almost get better over a few days because the flavors have time to meld. Pasta sauces are fairly easy for me to make, if I want to I can freeze single-serve baggies & make the noodles as I go, rather than mixing the pasta and sauce at the beginning. I will NOT eat leftover pizza, mac n cheese, anything that is fried or crispy, or sandwiches. Nothing that will separate or get greasy in the microwave. Most times I add a bit of water to whatever I am reheating and that helps with the taste and texture a lot, especially if you’re using the microwave.",
      "created_utc": 1742703921.0,
      "score": 11,
      "context": []
    },
    {
      "id": "mj92crs",
      "author": "rats0nvenus",
      "body": "Mmm love the taste of microwave",
      "created_utc": 1742698093.0,
      "score": 7,
      "context": []
    },
    {
      "id": "mjadbu6",
      "author": "theowlsbrain",
      "body": "I actually prefer some meals reheated and cold and people also look at me like I'm insane lmao I 100% agree it tastes diffrent!",
      "created_utc": 1742724154.0,
      "score": 6,
      "context": []
    },
    {
      "id": "mjak07y",
      "author": "RealityTVfan28",
      "body": "Mind blown. Another thing I’m learning today. I just thought my aversion to leftovers was me being weird. Did not connect it to my ARFID. Wow. Just wow. Only leftover I will eat is my husbands twice baked potatoes. They are amazing. Leftover is not the same but still good if you pick the bacon bits off the top. They are no longer edible to me when reheated. TBH he used to blend them in but now only puts on top for me cause I hated bacon in the potatoes instead of on the potatoes. It ruined the texture of the bacon.",
      "created_utc": 1742728219.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mjb4glo",
      "author": "deJessias",
      "body": "Sometimes I wonder if we're the only ones with working taste buds",
      "created_utc": 1742737458.0,
      "score": 6,
      "context": []
    },
    {
      "id": "mj9e2x2",
      "author": "Venus_Ziegenfalle",
      "body": "I can't stand eating right after cooking for some reason so a lot of times I only get to experience a microwaved version of a meal. Maybe that's why it doesn't bother me.",
      "created_utc": 1742703164.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mjbien3",
      "author": "MadCatter32",
      "body": "I totally agree. It *never* tastes the same! Even my mom, who doesn't have ARFID, agrees that it doesn't taste the same, except she prefers the taste of leftovers. \n\nAnd this is not what you were saying, but it reminds me of when I say I hate ketchup and people tell me \"But you love tomatoes, it's literally the same thing, it tastes the same!\" Um, no, it doesn't! Have you ever tasted a fresh tomato? It tastes nothing like ketchup! You know they don't just grind up tomatoes and bottle it, right? They add stuff. It literally does not taste the same.\n\nBut I get that all the time. Why are people obsessed with me liking ketchup??",
      "created_utc": 1742742223.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mjefguf",
      "author": "Nyx_Shadowspawn",
      "body": "There's actually a higher histamine content in reheated food too. And the Maillard reaction where overheating of sugars and amino acids causes the development of acrylamide. Or oxidation of fats in the food, which I think many people just can't taste, but we definitely can. It also causes protein denaturization, and the reheating causes hydrolysis as water molecules in the food break down further, making things more starchy and changing the texture. \n\nIt is literally NOT the same.  I wish it was. I'm disabled. I don't enjoy making my life harder. It's hard for me to cook multiple times a day. I'd rather eat cold food than reheated food, though. But not everyone can stomach that. \n\nI prep my ingredients for meal planning- chop veggies, mix sauces, portion before hand etc so it's easy to pull out and cook, etc. instead of cooking in advance. Every time I try cooking in advance I wind up throwing out so much. Now I just cook small, unless it's something that I know will be enjoyed cold.",
      "created_utc": 1742775584.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mjag66c",
      "author": "MaleficentSwan0223",
      "body": "I reheat left overs but I view it as a totally different meal especially depending on how I reheat it. That’s plenty of variety for me. ",
      "created_utc": 1742725929.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mjawgro",
      "author": "universe93",
      "body": "Oh I have this issue too. It’s definitely a sensory issue, the texture changes when reheated",
      "created_utc": 1742734278.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mjbs1dl",
      "author": "wi7dcat",
      "body": "Not to mention it increases in histamines",
      "created_utc": 1742745300.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mj9crg9",
      "author": "janetsnakehole319",
      "body": "I find reheating in an air fryer is better, but still not exactly the same",
      "created_utc": 1742702560.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mj9wvzu",
      "author": "Anxious_Picture_9278",
      "body": "I absolutely cannot eat leftovers except for maybe pizza and only from certain places. 12 hours in the fridge MAX, after that I can’t.",
      "created_utc": 1742713698.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mjbpye7",
      "author": "CyreneUS",
      "body": "it really depends on the food. anything with chicken (which is the only meat i can eat) is usually a no-go because i SWEAR it gets tougher in the fridge. pizza i usually prefer reheated bc it gets softer and i overwhelmingly prefer soft foods. the couple of other foods i eat are usually single-serving so i've never run into a leftovers issue (ramen, french toast, grilled cheeses, mac n cheese, etc)",
      "created_utc": 1742744648.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mjd6i6p",
      "author": "littleghool",
      "body": "Safe food that gets put away and becomes leftovers is no longer safe food.",
      "created_utc": 1742760917.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mje9bav",
      "author": "izzy_americana",
      "body": "It doesn't taste the same, but if you're poor, then what do u do?",
      "created_utc": 1742773461.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mj9uzyo",
      "author": "BringMeYourBullets",
      "body": "For me, veal is the worst when it comes to this.",
      "created_utc": 1742712512.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mjags37",
      "author": "uncoolandgoinggrey",
      "body": "i can reheat a couple things in an airfryer but its all i think about the whole time im eating it",
      "created_utc": 1742726305.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mjc39p5",
      "author": "AxolotlWolfie",
      "body": "You’re not insane, I’ve heard reheating food literally changes it on a bio level",
      "created_utc": 1742748837.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mjc5y15",
      "author": "iandmeagree",
      "body": "For me even 2 of the same food item will taste different. For example, 2 jars of peanut butter? Even in the same package? They taste different",
      "created_utc": 1742749657.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mjcoalt",
      "author": "SadisticGoose",
      "body": "When I still lived on my own, I made a lot of sauces that would separate when reheated. I got very good at removing stains because I’d get butter on my shirt so often. \n\nI had to move back in with my parents, and I’m not a fan of most of the food they cook. I’ll eat it the first time, but my mom keeps trying to save me leftovers I don’t want then gets upset when I don’t want them.",
      "created_utc": 1742755239.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mjfuc16",
      "author": "10ToSfromaSRBalloon",
      "body": "This is spot on",
      "created_utc": 1742798131.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mjg06rn",
      "author": "calmingthechaos",
      "body": "There is not a single food that tastes the same as a leftover that I can think of. I can eat some things as leftovers. I don't heat leftover pizza and just eat it cold. I do that with mozzarella sticks too. I food prep a day or two ahead of time, but I have to stick to eating it either the next day or the day after.  But I used to never eat anything leftover except cold pizza and bread sticks.",
      "created_utc": 1742802024.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mjgmbdw",
      "author": "Mayatar",
      "body": "I cannot do microwave-readymeals because of this.",
      "created_utc": 1742815765.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mjj33jp",
      "author": "Sweaty_Rip7518",
      "body": "Can you do chili? I feel like that's one of the few foods that is better reheated",
      "created_utc": 1742844302.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mjlpyi0",
      "author": "Gaymer7437",
      "body": "For about two decades I never ate leftovers because the taste and texture changed. Then one time I had a leftover cheeba hit sandwich and I learned that sometimes I can like the change. That dry sandwich cold straight from the fridge was good in a way different from the original fresh was. And now sometimes I even have reheated leftovers like a specific restaurant has cheese curds that change when I have them air fryer reheated the next day but I like it.\n\n\nI still don't eat the vast majority of leftovers. recently had a huge melt down about some special pasta (cheese tortellini from Costco) I bought being prepared when I wasn't home and then put in the fridge as leftovers, because when it's reheated the texture is different and it's gross and I can't eat that. I felt so excluded by them having the pasta without me and not leaving any in the packaging unprepared but leaving leftovers from when they ate less than half The package after taking all of it out and boiling it.\n\n\nPoint is, no it's not the same but *sometimes* that can be an okay or even good different. ",
      "created_utc": 1742875820.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mjm87md",
      "author": "screamsintothevoid",
      "body": "The only way I’ve found that works is throwing it in a pan. Pizza with a splash of water gets crispy, pasta tastes fresh, even half an omelette recooks beautifully (worked at a diner). fuck microwaves and toaster ovens and air fryers",
      "created_utc": 1742886192.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mjpckns",
      "author": "Traditional-Set-2019",
      "body": "Same it doesn’t taste the same. I never do left overs. Yuck 🤮",
      "created_utc": 1742929146.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mjpenk8",
      "author": "Kawichi",
      "body": "I hate reheated pasta ",
      "created_utc": 1742929758.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mk8wmu0",
      "author": "i_cant_sleeeep",
      "body": "holy shit I didnt even know this was because of my arfid! you explained it perfectly",
      "created_utc": 1743193998.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mj8j5l1",
      "author": "OBPSG",
      "body": "Little Caesar's Pizza is one of the worst offenders out there with this. Whatever kind of seasoning they put in their pizza, it becomes even more powerful to the point of overwhelming when it's reheated.",
      "created_utc": 1742690706.0,
      "score": 16,
      "context": [
        {
          "id": "mj8hdm5",
          "author": "LoafingLion",
          "body": "Exactly!! My family thinks I'm crazy for refusing to eat reheated pizza even if I loved it when it was fresh. It's SO gross. Same with pasta. I have to make a lot of small batches now because it gets so chewy and bland if I reheat it.",
          "created_utc": 1742690048.0
        }
      ]
    },
    {
      "id": "mjc7uqa",
      "author": "sh--",
      "body": "Reheated pasta is so gross",
      "created_utc": 1742750242.0,
      "score": 7,
      "context": [
        {
          "id": "mj8hdm5",
          "author": "LoafingLion",
          "body": "Exactly!! My family thinks I'm crazy for refusing to eat reheated pizza even if I loved it when it was fresh. It's SO gross. Same with pasta. I have to make a lot of small batches now because it gets so chewy and bland if I reheat it.",
          "created_utc": 1742690048.0
        }
      ]
    },
    {
      "id": "mjhtybg",
      "author": "offmyfuxkingmind",
      "body": "I'm the total opposite with the pizza thing! I only enjoy pizza if it's been left for a few hours. but reheated pasta is gross tho. ",
      "created_utc": 1742831256.0,
      "score": 1,
      "context": [
        {
          "id": "mj8hdm5",
          "author": "LoafingLion",
          "body": "Exactly!! My family thinks I'm crazy for refusing to eat reheated pizza even if I loved it when it was fresh. It's SO gross. Same with pasta. I have to make a lot of small batches now because it gets so chewy and bland if I reheat it.",
          "created_utc": 1742690048.0
        }
      ]
    },
    {
      "id": "mjc4y4x",
      "author": "idk_honestly24",
      "body": "Careful with this, I saw a video the other day about water potentially becoming superheated in the microwave, meaning it’ll look normal when it comes out but when disturbed it could explode 😬 Google can explain it better, it’s scary stuff",
      "created_utc": 1742749350.0,
      "score": 7,
      "context": [
        {
          "id": "mj8hgo6",
          "author": "Digimonera",
          "body": "I know it is not the same but to me the best way to reheat food is to microwave it with a glass of water next to it. Just a tip 🌻✨🫱🏼‍🫲🏽 it is great for bread for example.",
          "created_utc": 1742690079.0
        }
      ]
    },
    {
      "id": "mjlq9e3",
      "author": "Gaymer7437",
      "body": "I do this with a local restaurant's burritos, theyre so good as leftovers. Instead of glass of water next to it, I cut up the burrito in a bowl and put a little bit of water on a plate and then put the plate over the bowl (water side down) so it steams in the bowl and the steam is stuck there until it's absorbed by the food. The rice and beans are no longer dry but hydrated and perfect 🤤.",
      "created_utc": 1742875963.0,
      "score": 2,
      "context": [
        {
          "id": "mj8hgo6",
          "author": "Digimonera",
          "body": "I know it is not the same but to me the best way to reheat food is to microwave it with a glass of water next to it. Just a tip 🌻✨🫱🏼‍🫲🏽 it is great for bread for example.",
          "created_utc": 1742690079.0
        }
      ]
    },
    {
      "id": "mjasykm",
      "author": "crlygirlg",
      "body": "Naw, I’m on here because I think my son has ARFID and you are all correct food is not the same reheated. These people just mean it doesn’t bother them enough to not eat it so it shouldn’t bother you. It’s cooking it a second time, it’s not going to be the same.",
      "created_utc": 1742732754.0,
      "score": 12,
      "context": [
        {
          "id": "mja563o",
          "author": "Cassio_Taylor",
          "body": "I genuinely don’t believe most people can taste the difference, or at least not as much as people with ARFID. We are hyper aware of it so we hate the difference",
          "created_utc": 1742718974.0
        }
      ]
    },
    {
      "id": "mje5iri",
      "author": "isupposeyes",
      "body": "Yeah I have autism which makes me hypersensitive to stuff like this, my friends have told me they literally can’t taste the difference",
      "created_utc": 1742772189.0,
      "score": 8,
      "context": [
        {
          "id": "mja563o",
          "author": "Cassio_Taylor",
          "body": "I genuinely don’t believe most people can taste the difference, or at least not as much as people with ARFID. We are hyper aware of it so we hate the difference",
          "created_utc": 1742718974.0
        }
      ]
    },
    {
      "id": "mjlqjr5",
      "author": "Gaymer7437",
      "body": "So true. I remember thinking that our tap water was absolutely disgusting. My stepmom constantly told me we had amazing tap water and it tasted great. 10 years after her and my dad moved into that house and the city gave them a free water filter because the city's pipes had led. It was lead water and I knew that it was different, to me it was not as much the taste of the water that was different but the texture was so overwhelmingly wrong. I hated drinking it and would sometimes just get really dehydrated if there was no bottled water available to me.",
      "created_utc": 1742876100.0,
      "score": 5,
      "context": [
        {
          "id": "mja563o",
          "author": "Cassio_Taylor",
          "body": "I genuinely don’t believe most people can taste the difference, or at least not as much as people with ARFID. We are hyper aware of it so we hate the difference",
          "created_utc": 1742718974.0
        }
      ]
    },
    {
      "id": "mjlqpes",
      "author": "Gaymer7437",
      "body": "Personally I think the sandwich I get from cheba Hut is better later after it's been refrigerated for a few hours. Any other sandwich shop sandwich is best fresh and will get sore if left in the fridge but my cheba Hut order is really dry sandwich.",
      "created_utc": 1742876174.0,
      "score": 2,
      "context": [
        {
          "id": "mjadbu6",
          "author": "theowlsbrain",
          "body": "I actually prefer some meals reheated and cold and people also look at me like I'm insane lmao I 100% agree it tastes diffrent!",
          "created_utc": 1742724154.0
        }
      ]
    },
    {
      "id": "mjlqx6g",
      "author": "Gaymer7437",
      "body": "I only eat about five things as leftovers, most foods has leftovers I won't touch.",
      "created_utc": 1742876275.0,
      "score": 2,
      "context": [
        {
          "id": "mjak07y",
          "author": "RealityTVfan28",
          "body": "Mind blown. Another thing I’m learning today. I just thought my aversion to leftovers was me being weird. Did not connect it to my ARFID. Wow. Just wow. Only leftover I will eat is my husbands twice baked potatoes. They are amazing. Leftover is not the same but still good if you pick the bacon bits off the top. They are no longer edible to me when reheated. TBH he used to blend them in but now only puts on top for me cause I hated bacon in the potatoes instead of on the potatoes. It ruined the texture of the bacon.",
          "created_utc": 1742728219.0
        }
      ]
    },
    {
      "id": "mjlqvbf",
      "author": "Gaymer7437",
      "body": "I add water to my food when I reheat it to help prevent the texture changing so much. I also just view the reheated food as a completely different food than when it was fresh.",
      "created_utc": 1742876251.0,
      "score": 2,
      "context": [
        {
          "id": "mjefguf",
          "author": "Nyx_Shadowspawn",
          "body": "There's actually a higher histamine content in reheated food too. And the Maillard reaction where overheating of sugars and amino acids causes the development of acrylamide. Or oxidation of fats in the food, which I think many people just can't taste, but we definitely can. It also causes protein denaturization, and the reheating causes hydrolysis as water molecules in the food break down further, making things more starchy and changing the texture. \n\nIt is literally NOT the same.  I wish it was. I'm disabled. I don't enjoy making my life harder. It's hard for me to cook multiple times a day. I'd rather eat cold food than reheated food, though. But not everyone can stomach that. \n\nI prep my ingredients for meal planning- chop veggies, mix sauces, portion before hand etc so it's easy to pull out and cook, etc. instead of cooking in advance. Every time I try cooking in advance I wind up throwing out so much. Now I just cook small, unless it's something that I know will be enjoyed cold.",
          "created_utc": 1742775584.0
        }
      ]
    },
    {
      "id": "mjlqs5s",
      "author": "Gaymer7437",
      "body": "Same here. The local burrito shop I oftentimes get the big burrito because even though it's the same food it's a burrito and it's fresh and when I reheat it I cut it up in a bowl it's like a completely different food.",
      "created_utc": 1742876210.0,
      "score": 2,
      "context": [
        {
          "id": "mjag66c",
          "author": "MaleficentSwan0223",
          "body": "I reheat left overs but I view it as a totally different meal especially depending on how I reheat it. That’s plenty of variety for me. ",
          "created_utc": 1742725929.0
        }
      ]
    },
    {
      "id": "mjlr46v",
      "author": "Gaymer7437",
      "body": "I probably dehydrates in the fridge and then again in the microwave.",
      "created_utc": 1742876369.0,
      "score": 1,
      "context": [
        {
          "id": "mjbpye7",
          "author": "CyreneUS",
          "body": "it really depends on the food. anything with chicken (which is the only meat i can eat) is usually a no-go because i SWEAR it gets tougher in the fridge. pizza i usually prefer reheated bc it gets softer and i overwhelmingly prefer soft foods. the couple of other foods i eat are usually single-serving so i've never run into a leftovers issue (ramen, french toast, grilled cheeses, mac n cheese, etc)",
          "created_utc": 1742744648.0
        }
      ]
    },
    {
      "id": "mjdhy61",
      "author": "bubble0peach",
      "body": "You can avoid superheating by providing what's called nucleation sites, basically irregular surfaces. Whether that's scratches in the container surface, or something like a toothpick/stir stick, something more porous. Also waiting for the water to cool before moving it can help.",
      "created_utc": 1742764452.0,
      "score": 15,
      "context": [
        {
          "id": "mj8hgo6",
          "author": "Digimonera",
          "body": "I know it is not the same but to me the best way to reheat food is to microwave it with a glass of water next to it. Just a tip 🌻✨🫱🏼‍🫲🏽 it is great for bread for example.",
          "created_utc": 1742690079.0
        },
        {
          "id": "mjc4y4x",
          "author": "idk_honestly24",
          "body": "Careful with this, I saw a video the other day about water potentially becoming superheated in the microwave, meaning it’ll look normal when it comes out but when disturbed it could explode 😬 Google can explain it better, it’s scary stuff",
          "created_utc": 1742749350.0
        }
      ]
    },
    {
      "id": "mjlqcdw",
      "author": "Gaymer7437",
      "body": "You can take the food out without disturbing the glass of water. Letting the water cool down before disturbing it.",
      "created_utc": 1742876002.0,
      "score": 2,
      "context": [
        {
          "id": "mj8hgo6",
          "author": "Digimonera",
          "body": "I know it is not the same but to me the best way to reheat food is to microwave it with a glass of water next to it. Just a tip 🌻✨🫱🏼‍🫲🏽 it is great for bread for example.",
          "created_utc": 1742690079.0
        },
        {
          "id": "mjc4y4x",
          "author": "idk_honestly24",
          "body": "Careful with this, I saw a video the other day about water potentially becoming superheated in the microwave, meaning it’ll look normal when it comes out but when disturbed it could explode 😬 Google can explain it better, it’s scary stuff",
          "created_utc": 1742749350.0
        }
      ]
    },
    {
      "id": "mjbecea",
      "author": "Cassio_Taylor",
      "body": "Fair enough. I have literally no idea what food tastes like to other people. Ig what bothers people is different for everyone, not just related to food",
      "created_utc": 1742740892.0,
      "score": 6,
      "context": [
        {
          "id": "mja563o",
          "author": "Cassio_Taylor",
          "body": "I genuinely don’t believe most people can taste the difference, or at least not as much as people with ARFID. We are hyper aware of it so we hate the difference",
          "created_utc": 1742718974.0
        },
        {
          "id": "mjasykm",
          "author": "crlygirlg",
          "body": "Naw, I’m on here because I think my son has ARFID and you are all correct food is not the same reheated. These people just mean it doesn’t bother them enough to not eat it so it shouldn’t bother you. It’s cooking it a second time, it’s not going to be the same.",
          "created_utc": 1742732754.0
        }
      ]
    },
    {
      "id": "mjmui69",
      "author": "Cassio_Taylor",
      "body": "I relate so much. My family used to go on holiday a few hours drive away and I would throw up whenever I drank the water there Every. Single. Time.",
      "created_utc": 1742900404.0,
      "score": 3,
      "context": [
        {
          "id": "mja563o",
          "author": "Cassio_Taylor",
          "body": "I genuinely don’t believe most people can taste the difference, or at least not as much as people with ARFID. We are hyper aware of it so we hate the difference",
          "created_utc": 1742718974.0
        },
        {
          "id": "mjlqjr5",
          "author": "Gaymer7437",
          "body": "So true. I remember thinking that our tap water was absolutely disgusting. My stepmom constantly told me we had amazing tap water and it tasted great. 10 years after her and my dad moved into that house and the city gave them a free water filter because the city's pipes had led. It was lead water and I knew that it was different, to me it was not as much the taste of the water that was different but the texture was so overwhelmingly wrong. I hated drinking it and would sometimes just get really dehydrated if there was no bottled water available to me.",
          "created_utc": 1742876100.0
        }
      ]
    }
  ]
}