{
  "id": "1jnrcv8",
  "subreddit": "ARFID",
  "author": "NEKORANDOMDOTCOM",
  "created_utc": 1743382428.0,
  "title": "My Life Under ARFID",
  "selftext": "\nHello everyone, my name is Adam. I'm 36 years old and from South Carolina.\n\nI've suffered from ARFID all my life, rejecting most foods since I was able to eat solids.\n\nLike most people, my family thought I was just a picky toddler and that it would eventually sort itself out.\n\nI remember my mom having to get special meals for me, like frozen pizza. I was absolutely terrified of dinner time.\n\nMy dad—and especially his family—weren't as understanding. I remember his sister taking a group of kids out for dinner and demonizing me as a three-year-old in a restaurant, without either of my parents there to see.\n\nMy dad died of lung cancer when I was seven, and my food struggles never really got better. My mom sent me to mini summer camps, and I’d practically starve all week unless it was breakfast time. Breakfast had so many safe foods. It wasn’t so bad once I learned how to turn off the hunger switch in my brain.\n\nThen came dating, which absolutely terrified me. I had no confidence, and while I kept ARFID mostly secret, I felt like I wasn’t cool, suave, or handsome—that I was ugly, unwanted, and a despicable freak.\n\nI asked out two girls, and both experiences went south. In retrospect, they weren’t anything special—I just wanted someone I thought matched me.\n\nI saw a thing about ARFID back when it was called Selective Eating Disorder. I loved knowing I wasn't alone but the show had a guy going on a date and the woman practically ran away silently screaming. That didn't help... \n\nMy first girlfriend came when I was twenty-one. I remember being so happy and excited to have someone, but... I settled.\n\nShe wasn’t pretty, wasn’t very bright, couldn’t hold a job, and I had to teach her to drive. She was extremely selfish and incapable of being there for me emotionally.\n\nStill, I got engaged and married to her—because I didn’t think I could do better. I spent ten years being mostly miserable, loathing my entire existence. Then one day, I realized I was someone who could be properly loved by a real woman.\n\nSo I divorced her. My mom admitted she had always wondered why I got with her in the first place.\n\nDating again was scary. I still kept ARFID a secret because it wasn’t something you admit on the first date. I often chose coffee shops with milkshakes as a way to avoid the issue until the right time.\n\nThen I met Jessica, who completely triggered my anxiety by inviting me to a Mexican restaurant for our first date. I was so nervous, but I ordered nachos with cheese and did my best. It went... okay with my plate.\n\nAnd she wanted a second date. And soon, we were a couple. She was everything I had ever wanted, and I knew I had to tell her eventually. With tears streaming down my face, I admitted it to her—and she accepted me, despite being a foodie herself.\n\nI had never felt so validated. We got engaged less than a year later and married before the next Christmas. Our son was born the following summer.\n\nI went from feeling alone, depressed, and worthless to having a true partner, being a real husband, and having a family—in less than two years.\n\nMy safe foods are decently numerous. At restaurants, pizza, pretzels, and French fries are my staples.\n\nThanks to Jessica, I've accepted that I have a disability. But I am not a freak. And I am loved. ",
  "url": "https://i.redd.it/27cli7i1bxre1.jpeg",
  "score": 84,
  "num_comments": 5,
  "comments": [
    {
      "id": "mkm7nlm",
      "author": "iToxicKidd",
      "body": "Super happy for you man. There is hope at the end of the tunnel. \n\nGlad you never gave up, and also arfid is hard but know that we are here for you! I wish you many many more amazing years with Jessica!\n\nThere are many TikTok accounts out there with people in relationships with someone having arfid, like patnjac etc. You are not alone and there is people who support their partners with arfid I promise you.",
      "created_utc": 1743384879.0,
      "score": 15,
      "context": []
    },
    {
      "id": "mkmgws9",
      "author": "FeivelM",
      "body": "Welcome to the gang, happy you have found happiness. I’m also 36M, and currently in treatment for ED I’m comorbid with anorexia, so it’s starting with that and then moving on to the ARFID. To be honest I’m more confident of cutting the former than the latter just because these thoughts are so engrained, as like you I’ve also had it all my life.",
      "created_utc": 1743388462.0,
      "score": 7,
      "context": []
    },
    {
      "id": "mkmm26h",
      "author": "Propsicle405",
      "body": "Nice to meet you friend!  My name is Cassi and I am 43 :) So happy to hear you have such a wonderful GF :)",
      "created_utc": 1743390593.0,
      "score": 8,
      "context": []
    },
    {
      "id": "mkoc5gg",
      "author": "apk5005",
      "body": "I’m just about your age (a little older in my late 30s) and I remember the absolute joy of finding [pickyeatingadults.com](https://pickyeatingadults.com/) online and feeling so validated. That was where I first learned there were others who never “outgrew” it. It just felt so good to not be “alone”.\n\nIf you have the time and insurance, I strongly recommend finding a therapist who specializes in disordered eating. It has helped me to expand my safe food list a bit, and my “risky” food list a lot. There is so much more for me to do, but I have found it easier to stay motivated because I’m now a food role model for my kids.\n\nA single phrase my therapist used that really resonated with me was “get angry”. I’d always been fight-or-flight (exclusively flight, really) with food. I would just avoid the triggers and be hungry until I could find some fries, a milkshake, or breakfast food. But when I reframed it and chose to “get angry” at my food, I was able to move past some of the fear and “just eat it” (I hate that phrase). It is far from 100% successful, but it has helped open some new doors.",
      "created_utc": 1743424689.0,
      "score": 6,
      "context": []
    },
    {
      "id": "mkn8heq",
      "author": "codeinecrim",
      "body": "Idk you but this makes my heart happy beyond words. You are not alone and you make me feel not alone as I have had a lot of the same struggles you have had in the dating front. I never realized how much the ARFID stuff has hurt me. \n\nKeep pushing dude! Thank you for sharing your story",
      "created_utc": 1743401998.0,
      "score": 3,
      "context": []
    }
  ]
}