{
  "id": "1jpmn3j",
  "subreddit": "ARFID",
  "author": "Thedailybee",
  "created_utc": 1743594653.0,
  "title": "Unhinged tips for eating",
  "selftext": "This trend has been going around TikTok asking for tips but like not your normal tips like “just try and eat multiple small snacks through the day!” Like no what’s the weirdest things you do that helps you?? I’ll go first:\n\nYou know those “what my 21 month old eats in a day” videos?? Yeah I watch those a lot so when I’m having a hard time getting myself to eat, I pretend I’m filming one for myself and literally will say as I’m making my food “here’s what my me-month old ate or didn’t eat today” specifically in a British accent bc one of the moms I watch has one 🤣 and then I’ll go through all the foods im making and even make note of my mood or how I’m feeling  so I’ll be like “today I offered her eggs and toast but she’s been in a mood today so I don’t have high expectations “\n\nIdk it helps me bc it reminds me that I don’t have to finish and it’s okay. It makes it feel less serious and more fun! I’ve also been an immersive daydreamer since I was a teenager so I think that factors into why this helps me so much. But even days when I really don’t even wanna try, it’s easy to be like okay but your me-month old needs to eat what would the TikTok people in your brain think if u don’t feed her (myself)",
  "url": "https://www.reddit.com/r/ARFID/comments/1jpmn3j/unhinged_tips_for_eating/",
  "score": 109,
  "num_comments": 58,
  "comments": [
    {
      "id": "ml0jgy4",
      "author": "Lylli-Rose",
      "body": "Is the British one the one who says “he ate the whole lot”?",
      "created_utc": 1743597866.0,
      "score": 55,
      "context": []
    },
    {
      "id": "ml0fof6",
      "author": "whatdoidonowdamnit",
      "body": "That dinosaur food video trend that one smart lady posted on TikTok. She just downs a handful of leaves.",
      "created_utc": 1743596296.0,
      "score": 26,
      "context": []
    },
    {
      "id": "ml0j3c5",
      "author": "two-of-me",
      "body": "Honestly, whatever helps. Fed is best and if you can’t get yourself to eat what’s offered to you, it’s fine to just eat dry cheerios out of the box or whatever floats your boat.",
      "created_utc": 1743597713.0,
      "score": 23,
      "context": []
    },
    {
      "id": "ml1702g",
      "author": "boringlesbian",
      "body": "I have to go into the office one day a week as opposed to the other four that I can work from home. This causes a dilemma because I don’t know what I will want to eat or be able to eat when lunch rolls around. So I bring a ridiculous assortment of small portions of several different things that kind of sort of maybe sound like I might want in five hours. I set aside about an hour before work to put this “lunch” together. None of it makes any sense as far as what a regular person would consider a meal. I just have to laugh sometimes at what I brought in some days.",
      "created_utc": 1743605880.0,
      "score": 17,
      "context": []
    },
    {
      "id": "ml0uokt",
      "author": "theowlsbrain",
      "body": "This doesn't help for people who fear choking but I've just literally swallowed pieces of pasta before because I didn't want to chew and I mean I ate",
      "created_utc": 1743602064.0,
      "score": 14,
      "context": []
    },
    {
      "id": "ml1536o",
      "author": "independentchickpea",
      "body": "Honestly sometimes I do pretend I'm feeding a kid, because when I revert to safe foods during a hard time, I'm basically living off chicken nuggets and noodles! It helps me practice nurturing my inner child too. \n\nIt's something we were taught in treatment so it is a totally valid tactic!",
      "created_utc": 1743605307.0,
      "score": 9,
      "context": []
    },
    {
      "id": "ml33vil",
      "author": "Newbie11107",
      "body": "My therapist and I created a “Inside Out” like personification of my ARFID that’s REALLY helped, specifically when it comes to exposures i do with my nutrition therapist.  for me, my ARFID is a toddler-ish aged girl, she sometimes screams, sets alarms off, take control of the control panel that is my brain. But I also have my logic brain (that’s me!) and I can pick her up and put ARFID in her play pen and know that just cuz she’s having a fit doesn’t actually mean I’m uncomfortable or unsafe. Even when she’s the loudest in the room it’s helpful to recognize - oh that’s just ARFID and she clearly has the mic, and my logic brain is much quieter. Just to be able to recognize it’s my ARFID, not me. ",
      "created_utc": 1743625912.0,
      "score": 8,
      "context": []
    },
    {
      "id": "ml113g7",
      "author": "theowlsbrain",
      "body": "Oh yeah I've also pretended to be making a mukbang video and concentrate on that to help me eat lol",
      "created_utc": 1743604095.0,
      "score": 7,
      "context": []
    },
    {
      "id": "ml1mhjr",
      "author": "nalycat",
      "body": "I wish I had a funny one but this is what I try. If I think I don't want to eat, I play my bfs nagging voice in my head to eat. And then I pretend I'm like doing an assignment and tell him after I eat (like in a text) to make him proud of me as if im a goddamn child. Sometimes I'll even take pictures",
      "created_utc": 1743610540.0,
      "score": 8,
      "context": []
    },
    {
      "id": "ml2qbdb",
      "author": "StrawbraryLiberry",
      "body": "On a bad day when I'm definitely not hungry I make soup and tell myself I can just eat one bite per hour 🙃 \n\nI usually eat most of it over a few hours. \n\nI almost always realize I actually was hungry by the time I eat the first bite. \n\nIt helps me at least get motivated to try to eat my last meal.",
      "created_utc": 1743622052.0,
      "score": 7,
      "context": []
    },
    {
      "id": "ml36ey8",
      "author": "feistymummy",
      "body": "I eat a thc gummy before a public dinner out. It’s brings my “give a shit” down enough to either 1- eat something out of my comfort zone OR 2- be me and have zero guilt. \nI have tried a few new foods this way, but I lean more on option 2.",
      "created_utc": 1743626623.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ml5ygnp",
      "author": "Impressive_Candle_14",
      "body": "honestly the only weird thing i tried to gain an appetite and eat more was to get high to trigger munchies😭 suddenly everything is appetizing and makes me wanna eat so much",
      "created_utc": 1743666220.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mle3gsu",
      "author": "Fit-Cauliflower-9229",
      "body": "Ngl but being on my phone helps. I noticed I’m less stressed and eat more because I’m distracted",
      "created_utc": 1743781437.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mlisr8a",
      "author": "PlatypusEnthusiast16",
      "body": "walk to fridge  \nopen fridge  \nstare at fridge contents  \nmeh  \ntake one (1) slice of cheese  \nmonch\n\nrepeat as needed",
      "created_utc": 1743850163.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ml1pj7g",
      "author": "JohanAugustArfweds0n",
      "body": "This is hilarious and genius, I'm going to try this with my daughter. Thanks for sharing and congrats on finding a way to manage this with humor.",
      "created_utc": 1743611453.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ml21ylu",
      "author": "Overall-Training8760",
      "body": "I have less anxiety eating if I’m drunk lol. I once tried some kind of spinach quinoa ball (that is so far from my sober comfort zone it’s literally on another planet)",
      "created_utc": 1743615007.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ml3qwlq",
      "author": "ashiscute024",
      "body": "I literally watch other people eat to make me hungry and want to keep eating… very weird very cutesy 😂😂😂",
      "created_utc": 1743632851.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ml6zevk",
      "author": "Goldenface0707",
      "body": "I used to pretend I was making a meal for a loved one and when I was done making it I would put it down in my room and then pretend someone I loved made it for me and eating it would make them happy",
      "created_utc": 1743685386.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ml2r2jm",
      "author": "bokeleaf",
      "body": "😍😍😍love this",
      "created_utc": 1743622276.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ml42h9r",
      "author": "floorenjoyer",
      "body": "HAHAHA I do basically the same thing 🤣 I find those videos of toddler food so motivating to try new things and view my own reaction to food more impartially instead of shaming myself. I'm actually pregnant with my first and looking forward to relearning my relationship with food with my kid 🤞🏽🤞🏽",
      "created_utc": 1743636691.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ml315wr",
      "author": "goldfishmuncher",
      "body": "sometimes when someone offers me a bite of something new i reply yes and try it SO quickly that my brain won't allow me to say no or think about it",
      "created_utc": 1743625160.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ml4ghp4",
      "author": "Neocactus",
      "body": "I've had a couple NSFW ideas for methods I want to try.\n\n- **abusing substances to try new foods:** Haven't tried it yet, but I noticed on a shroom trip that my ARFID was pretty much completely vaporized when I was tripping. I didn't have anything to try though, so nothing was accomplished there. It's been months since I had my hands on shrooms too.. but I've also been considering getting extremely drunk and seeing how well that could help.\n\n- **having a dom/domme force me to try new foods--obviously in a sexual way:** I have no idea where I could find someone to participate with me in this (single, don't wanna hire anyone, don't know how to explain), but I think it'd be really hot if some dominatrix was basically forcing me to eat. I think my horniness would greatly override any anxiety I have related to trying new foods.\n\nEdit: guess these aren't really tips, but I have a fair bit of confidence they could actually help me, lol.",
      "created_utc": 1743641529.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mlc53yx",
      "author": "calmingthechaos",
      "body": "I sometimes explain what I'm doing to make food to my dog. It'll be my niece, too, eventually. I'm in a routine at this point, so I have less of those ADHD days that cause me to not be aware of my hunger signals until it's too late. The only problem is that I'm sometimes \"hungry\" when I really shouldn't be, just because of the time. Like I'll eat dinner at 11 pm instead of 2 am, and then at 2 am, I'm \"hungry.\" Before I started my health journey, my eating habits were pretty unhinged themselves.",
      "created_utc": 1743750492.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mlx1f94",
      "author": "EmbarrassedStudy3796",
      "body": "Sauces. I eat something like stir fry almost every other day because white rice, broccoli and vegetarian steak tips are my safe foods. I just change the sauce I use like sweet and sour or teriyaki or orange. ",
      "created_utc": 1744055655.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mm8lxup",
      "author": "NightmareYellyfish",
      "body": "I used to watch a lady that had anorexia and bullimia and she had to force herself to eat something and filmed herself eating. That always encouraged me. She ate scrambled egg with salt and syrup. So I tried that and let me tell you I will never eat scrambled egg any other way again! \nShe was veeery ill and lost all her hair. It scared the crap out of me!",
      "created_utc": 1744217229.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mm3jr3j",
      "author": "Civil-Law529",
      "body": "I watch a comfort show and tell myself that I’m just “putting my food nearby in case I want something to munch on” and 9/10x I’ll eat some of it. The less I think about my food, the better. \n\nI also will start with a small amount of my safe food for a couple bites or in between bites to get me started and help me eat. Like ugh I don’t want to eat taco meat and rice but some tortilla chips, sure! \n\nAlso having a husband who cooks for me so I don’t have to see the raw meat. ",
      "created_utc": 1744144704.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ml0k6bw",
      "author": "Thedailybee",
      "body": "LMAO YES 😭",
      "created_utc": 1743598145.0,
      "score": 17,
      "context": [
        {
          "id": "ml0jgy4",
          "author": "Lylli-Rose",
          "body": "Is the British one the one who says “he ate the whole lot”?",
          "created_utc": 1743597866.0
        }
      ]
    },
    {
      "id": "ml25z0n",
      "author": "LoafingLion",
      "body": "omg I love that lady 😭",
      "created_utc": 1743616129.0,
      "score": 5,
      "context": [
        {
          "id": "ml0jgy4",
          "author": "Lylli-Rose",
          "body": "Is the British one the one who says “he ate the whole lot”?",
          "created_utc": 1743597866.0
        }
      ]
    },
    {
      "id": "ml3ipga",
      "author": "Nicksiee",
      "body": "I love these videos too! Especially as her older child is described as 'very particular' and I'm fairly sure they're looking into an ARFID diagnosis. When he eats the whole lot, I feel an odd sense of pride!\n\nI can see how these videos would be encouraging to others too, as I do find myself saying or thinking that phrase.",
      "created_utc": 1743630245.0,
      "score": 9,
      "context": [
        {
          "id": "ml0jgy4",
          "author": "Lylli-Rose",
          "body": "Is the British one the one who says “he ate the whole lot”?",
          "created_utc": 1743597866.0
        }
      ]
    },
    {
      "id": "ml0kch4",
      "author": "Thedailybee",
      "body": "Omg yes I’ve seen this!",
      "created_utc": 1743598211.0,
      "score": 8,
      "context": [
        {
          "id": "ml0fof6",
          "author": "whatdoidonowdamnit",
          "body": "That dinosaur food video trend that one smart lady posted on TikTok. She just downs a handful of leaves.",
          "created_utc": 1743596296.0
        }
      ]
    },
    {
      "id": "ml0kayp",
      "author": "Thedailybee",
      "body": "Agreed!! Some days all I can eat is a slice of untoasted bread- losing that food rule mindset has been essential",
      "created_utc": 1743598195.0,
      "score": 9,
      "context": [
        {
          "id": "ml0j3c5",
          "author": "two-of-me",
          "body": "Honestly, whatever helps. Fed is best and if you can’t get yourself to eat what’s offered to you, it’s fine to just eat dry cheerios out of the box or whatever floats your boat.",
          "created_utc": 1743597713.0
        }
      ]
    },
    {
      "id": "ml2pbs7",
      "author": "independentchickpea",
      "body": "Glad I'm not the only one. But once I had a boss comment on the weird food I ate at work, and I never ate at work again T\\_T",
      "created_utc": 1743621763.0,
      "score": 4,
      "context": [
        {
          "id": "ml1702g",
          "author": "boringlesbian",
          "body": "I have to go into the office one day a week as opposed to the other four that I can work from home. This causes a dilemma because I don’t know what I will want to eat or be able to eat when lunch rolls around. So I bring a ridiculous assortment of small portions of several different things that kind of sort of maybe sound like I might want in five hours. I set aside about an hour before work to put this “lunch” together. None of it makes any sense as far as what a regular person would consider a meal. I just have to laugh sometimes at what I brought in some days.",
          "created_utc": 1743605880.0
        }
      ]
    },
    {
      "id": "mle81t8",
      "author": "SadisticGoose",
      "body": "I’m starting a new job and am worried about how to handle lunch. I’m afraid someone will see me eating and think I’m weird.",
      "created_utc": 1743782805.0,
      "score": 4,
      "context": [
        {
          "id": "ml1702g",
          "author": "boringlesbian",
          "body": "I have to go into the office one day a week as opposed to the other four that I can work from home. This causes a dilemma because I don’t know what I will want to eat or be able to eat when lunch rolls around. So I bring a ridiculous assortment of small portions of several different things that kind of sort of maybe sound like I might want in five hours. I set aside about an hour before work to put this “lunch” together. None of it makes any sense as far as what a regular person would consider a meal. I just have to laugh sometimes at what I brought in some days.",
          "created_utc": 1743605880.0
        }
      ]
    },
    {
      "id": "mm3ir47",
      "author": "Civil-Law529",
      "body": "Me too!! It’s just a bunch of random leftovers and so many snacks because I never know what will work!",
      "created_utc": 1744144430.0,
      "score": 2,
      "context": [
        {
          "id": "ml1702g",
          "author": "boringlesbian",
          "body": "I have to go into the office one day a week as opposed to the other four that I can work from home. This causes a dilemma because I don’t know what I will want to eat or be able to eat when lunch rolls around. So I bring a ridiculous assortment of small portions of several different things that kind of sort of maybe sound like I might want in five hours. I set aside about an hour before work to put this “lunch” together. None of it makes any sense as far as what a regular person would consider a meal. I just have to laugh sometimes at what I brought in some days.",
          "created_utc": 1743605880.0
        }
      ]
    },
    {
      "id": "ml0y5qn",
      "author": "Thedailybee",
      "body": "I love doing this with the Kraft Mac and cheese 😭",
      "created_utc": 1743603193.0,
      "score": 6,
      "context": [
        {
          "id": "ml0uokt",
          "author": "theowlsbrain",
          "body": "This doesn't help for people who fear choking but I've just literally swallowed pieces of pasta before because I didn't want to chew and I mean I ate",
          "created_utc": 1743602064.0
        }
      ]
    },
    {
      "id": "ml26rfw",
      "author": "Thedailybee",
      "body": "I do this as well!! I even mostly use kids dinnerware , it’s smaller and cuter and makes it feel more fun/less intimidating. And it is very healing to imagine taking care of yourself that way 🥺",
      "created_utc": 1743616349.0,
      "score": 7,
      "context": [
        {
          "id": "ml1536o",
          "author": "independentchickpea",
          "body": "Honestly sometimes I do pretend I'm feeding a kid, because when I revert to safe foods during a hard time, I'm basically living off chicken nuggets and noodles! It helps me practice nurturing my inner child too. \n\nIt's something we were taught in treatment so it is a totally valid tactic!",
          "created_utc": 1743605307.0
        }
      ]
    },
    {
      "id": "ml6ubp3",
      "author": "sunnyskiezzz",
      "body": "This is something that helps me so much! Whether it's with nutrition, hygiene, school, sleep, etc. I try to talk to myself like I would a child who was struggling. It helps me have compassion for myself.",
      "created_utc": 1743683481.0,
      "score": 2,
      "context": [
        {
          "id": "ml1536o",
          "author": "independentchickpea",
          "body": "Honestly sometimes I do pretend I'm feeding a kid, because when I revert to safe foods during a hard time, I'm basically living off chicken nuggets and noodles! It helps me practice nurturing my inner child too. \n\nIt's something we were taught in treatment so it is a totally valid tactic!",
          "created_utc": 1743605307.0
        }
      ]
    },
    {
      "id": "mlaa5r8",
      "author": "Autismsaurus",
      "body": "I'm just imagining all the other Inside Out emotions chasing around after a toddler and it's making me laugh 😆",
      "created_utc": 1743721859.0,
      "score": 2,
      "context": [
        {
          "id": "ml33vil",
          "author": "Newbie11107",
          "body": "My therapist and I created a “Inside Out” like personification of my ARFID that’s REALLY helped, specifically when it comes to exposures i do with my nutrition therapist.  for me, my ARFID is a toddler-ish aged girl, she sometimes screams, sets alarms off, take control of the control panel that is my brain. But I also have my logic brain (that’s me!) and I can pick her up and put ARFID in her play pen and know that just cuz she’s having a fit doesn’t actually mean I’m uncomfortable or unsafe. Even when she’s the loudest in the room it’s helpful to recognize - oh that’s just ARFID and she clearly has the mic, and my logic brain is much quieter. Just to be able to recognize it’s my ARFID, not me. ",
          "created_utc": 1743625912.0
        }
      ]
    },
    {
      "id": "mldr7xk",
      "author": "None",
      "body": "Getting stoned every day has really helped me eat more",
      "created_utc": 1743777793.0,
      "score": 2,
      "context": [
        {
          "id": "ml36ey8",
          "author": "feistymummy",
          "body": "I eat a thc gummy before a public dinner out. It’s brings my “give a shit” down enough to either 1- eat something out of my comfort zone OR 2- be me and have zero guilt. \nI have tried a few new foods this way, but I lean more on option 2.",
          "created_utc": 1743626623.0
        }
      ]
    },
    {
      "id": "ml5yi4w",
      "author": "Impressive_Candle_14",
      "body": "recently tried alcohol as well but imo not as effective",
      "created_utc": 1743666246.0,
      "score": 1,
      "context": [
        {
          "id": "ml5ygnp",
          "author": "Impressive_Candle_14",
          "body": "honestly the only weird thing i tried to gain an appetite and eat more was to get high to trigger munchies😭 suddenly everything is appetizing and makes me wanna eat so much",
          "created_utc": 1743666220.0
        }
      ]
    },
    {
      "id": "mlpedch",
      "author": "flowersun88",
      "body": "I did this today 💀😭",
      "created_utc": 1743950318.0,
      "score": 2,
      "context": [
        {
          "id": "mlisr8a",
          "author": "PlatypusEnthusiast16",
          "body": "walk to fridge  \nopen fridge  \nstare at fridge contents  \nmeh  \ntake one (1) slice of cheese  \nmonch\n\nrepeat as needed",
          "created_utc": 1743850163.0
        }
      ]
    },
    {
      "id": "ml6ugz2",
      "author": "sunnyskiezzz",
      "body": "Pizza is a moderate-level fear food until I'm drunk. Then there is nothing on earth better than a stuffed crust cheese pizza.",
      "created_utc": 1743683539.0,
      "score": 2,
      "context": [
        {
          "id": "ml21ylu",
          "author": "Overall-Training8760",
          "body": "I have less anxiety eating if I’m drunk lol. I once tried some kind of spinach quinoa ball (that is so far from my sober comfort zone it’s literally on another planet)",
          "created_utc": 1743615007.0
        }
      ]
    },
    {
      "id": "ml3skpp",
      "author": "Thedailybee",
      "body": "Nooo bc I do the same thing, I get the biggest appetite watching fast food mukbangs or 7/11 hauls 😩it’s like body doubling but for eating !!",
      "created_utc": 1743633403.0,
      "score": 3,
      "context": [
        {
          "id": "ml3qwlq",
          "author": "ashiscute024",
          "body": "I literally watch other people eat to make me hungry and want to keep eating… very weird very cutesy 😂😂😂",
          "created_utc": 1743632851.0
        }
      ]
    },
    {
      "id": "ml73tlp",
      "author": "Thedailybee",
      "body": "I do similar!!",
      "created_utc": 1743686943.0,
      "score": 3,
      "context": [
        {
          "id": "ml6zevk",
          "author": "Goldenface0707",
          "body": "I used to pretend I was making a meal for a loved one and when I was done making it I would put it down in my room and then pretend someone I loved made it for me and eating it would make them happy",
          "created_utc": 1743685386.0
        }
      ]
    },
    {
      "id": "ml342gk",
      "author": "Newbie11107",
      "body": "Yes! This too! ",
      "created_utc": 1743625967.0,
      "score": 2,
      "context": [
        {
          "id": "ml315wr",
          "author": "goldfishmuncher",
          "body": "sometimes when someone offers me a bite of something new i reply yes and try it SO quickly that my brain won't allow me to say no or think about it",
          "created_utc": 1743625160.0
        }
      ]
    },
    {
      "id": "mldrzg6",
      "author": "None",
      "body": "Eating on mushrooms 💀 I could never! It makes me nauseous. But weed on the other hand...",
      "created_utc": 1743778022.0,
      "score": 1,
      "context": [
        {
          "id": "ml4ghp4",
          "author": "Neocactus",
          "body": "I've had a couple NSFW ideas for methods I want to try.\n\n- **abusing substances to try new foods:** Haven't tried it yet, but I noticed on a shroom trip that my ARFID was pretty much completely vaporized when I was tripping. I didn't have anything to try though, so nothing was accomplished there. It's been months since I had my hands on shrooms too.. but I've also been considering getting extremely drunk and seeing how well that could help.\n\n- **having a dom/domme force me to try new foods--obviously in a sexual way:** I have no idea where I could find someone to participate with me in this (single, don't wanna hire anyone, don't know how to explain), but I think it'd be really hot if some dominatrix was basically forcing me to eat. I think my horniness would greatly override any anxiety I have related to trying new foods.\n\nEdit: guess these aren't really tips, but I have a fair bit of confidence they could actually help me, lol.",
          "created_utc": 1743641529.0
        }
      ]
    },
    {
      "id": "mlea8tl",
      "author": "boringlesbian",
      "body": "Own it. Be unapologetic about it. It’s nobody’s business what you eat. You are an adult.",
      "created_utc": 1743783474.0,
      "score": 2,
      "context": [
        {
          "id": "ml1702g",
          "author": "boringlesbian",
          "body": "I have to go into the office one day a week as opposed to the other four that I can work from home. This causes a dilemma because I don’t know what I will want to eat or be able to eat when lunch rolls around. So I bring a ridiculous assortment of small portions of several different things that kind of sort of maybe sound like I might want in five hours. I set aside about an hour before work to put this “lunch” together. None of it makes any sense as far as what a regular person would consider a meal. I just have to laugh sometimes at what I brought in some days.",
          "created_utc": 1743605880.0
        },
        {
          "id": "mle81t8",
          "author": "SadisticGoose",
          "body": "I’m starting a new job and am worried about how to handle lunch. I’m afraid someone will see me eating and think I’m weird.",
          "created_utc": 1743782805.0
        }
      ]
    },
    {
      "id": "ml2oyn5",
      "author": "independentchickpea",
      "body": "Adorable! I have some cute things for bentos, and use a dinosaur-shaped sandwich cutter and have a \"uncrustable\" press too. I'll also get shaped nuggets for the serotonin hahaha. I developed ARFID as a child as a trauma response and so I just count it as some good self-care and talk my inner child through it so I feel safe and taken care of. It probably sounds totally unhinged but whatever, leave me alone with my Lion King nuggies!",
      "created_utc": 1743621656.0,
      "score": 6,
      "context": [
        {
          "id": "ml1536o",
          "author": "independentchickpea",
          "body": "Honestly sometimes I do pretend I'm feeding a kid, because when I revert to safe foods during a hard time, I'm basically living off chicken nuggets and noodles! It helps me practice nurturing my inner child too. \n\nIt's something we were taught in treatment so it is a totally valid tactic!",
          "created_utc": 1743605307.0
        },
        {
          "id": "ml26rfw",
          "author": "Thedailybee",
          "body": "I do this as well!! I even mostly use kids dinnerware , it’s smaller and cuter and makes it feel more fun/less intimidating. And it is very healing to imagine taking care of yourself that way 🥺",
          "created_utc": 1743616349.0
        }
      ]
    },
    {
      "id": "ml7drka",
      "author": "independentchickpea",
      "body": "Yup, I do it for lots of things... obviously food is a big one. But A on a test or a big win at work? I get myself a treat like a kid who nailed a report card and I'm a proud parent.\n\nIt does work!",
      "created_utc": 1743690162.0,
      "score": 3,
      "context": [
        {
          "id": "ml1536o",
          "author": "independentchickpea",
          "body": "Honestly sometimes I do pretend I'm feeding a kid, because when I revert to safe foods during a hard time, I'm basically living off chicken nuggets and noodles! It helps me practice nurturing my inner child too. \n\nIt's something we were taught in treatment so it is a totally valid tactic!",
          "created_utc": 1743605307.0
        },
        {
          "id": "ml6ubp3",
          "author": "sunnyskiezzz",
          "body": "This is something that helps me so much! Whether it's with nutrition, hygiene, school, sleep, etc. I try to talk to myself like I would a child who was struggling. It helps me have compassion for myself.",
          "created_utc": 1743683481.0
        }
      ]
    },
    {
      "id": "mlarm8p",
      "author": "Newbie11107",
      "body": "Like literally tho!! lol ",
      "created_utc": 1743728225.0,
      "score": 2,
      "context": [
        {
          "id": "ml33vil",
          "author": "Newbie11107",
          "body": "My therapist and I created a “Inside Out” like personification of my ARFID that’s REALLY helped, specifically when it comes to exposures i do with my nutrition therapist.  for me, my ARFID is a toddler-ish aged girl, she sometimes screams, sets alarms off, take control of the control panel that is my brain. But I also have my logic brain (that’s me!) and I can pick her up and put ARFID in her play pen and know that just cuz she’s having a fit doesn’t actually mean I’m uncomfortable or unsafe. Even when she’s the loudest in the room it’s helpful to recognize - oh that’s just ARFID and she clearly has the mic, and my logic brain is much quieter. Just to be able to recognize it’s my ARFID, not me. ",
          "created_utc": 1743625912.0
        },
        {
          "id": "mlaa5r8",
          "author": "Autismsaurus",
          "body": "I'm just imagining all the other Inside Out emotions chasing around after a toddler and it's making me laugh 😆",
          "created_utc": 1743721859.0
        }
      ]
    },
    {
      "id": "mlbhuro",
      "author": "Overall-Training8760",
      "body": "It makes sense since alcohol lowers inhibition! I’m honestly gonna have a little party for just myself and my fiancée where I get drunk and try a bite of a very plain salad… maybe just lettuce and dressing. I’d be so proud. Scrambled egg has been at the top of my list for a while too.",
      "created_utc": 1743738571.0,
      "score": 2,
      "context": [
        {
          "id": "ml21ylu",
          "author": "Overall-Training8760",
          "body": "I have less anxiety eating if I’m drunk lol. I once tried some kind of spinach quinoa ball (that is so far from my sober comfort zone it’s literally on another planet)",
          "created_utc": 1743615007.0
        },
        {
          "id": "ml6ugz2",
          "author": "sunnyskiezzz",
          "body": "Pizza is a moderate-level fear food until I'm drunk. Then there is nothing on earth better than a stuffed crust cheese pizza.",
          "created_utc": 1743683539.0
        }
      ]
    },
    {
      "id": "ml4nojy",
      "author": "ashiscute024",
      "body": "THANK GOD IM NOT ALONE IVE ALWAYS THOUGHT I WAS WEIRD!! It didn’t help that my now ex boyfriend would always look at me fucking weird when I would watch anything like that (or really anything he didn’t wanna watch) 😂😂 so glad I can watch them in peace now",
      "created_utc": 1743644076.0,
      "score": 3,
      "context": [
        {
          "id": "ml3qwlq",
          "author": "ashiscute024",
          "body": "I literally watch other people eat to make me hungry and want to keep eating… very weird very cutesy 😂😂😂",
          "created_utc": 1743632851.0
        },
        {
          "id": "ml3skpp",
          "author": "Thedailybee",
          "body": "Nooo bc I do the same thing, I get the biggest appetite watching fast food mukbangs or 7/11 hauls 😩it’s like body doubling but for eating !!",
          "created_utc": 1743633403.0
        }
      ]
    },
    {
      "id": "ml51raj",
      "author": "goldfishmuncher",
      "body": "it's how i tried fish cakes! truly i think they are disgusting but... in my soul i know i ACTUALLY ate a big bite of it so i don't feel guilty hating it. i feel guilty hating things i've never even tried lol",
      "created_utc": 1743649322.0,
      "score": 2,
      "context": [
        {
          "id": "ml315wr",
          "author": "goldfishmuncher",
          "body": "sometimes when someone offers me a bite of something new i reply yes and try it SO quickly that my brain won't allow me to say no or think about it",
          "created_utc": 1743625160.0
        },
        {
          "id": "ml342gk",
          "author": "Newbie11107",
          "body": "Yes! This too! ",
          "created_utc": 1743625967.0
        }
      ]
    },
    {
      "id": "mle2aay",
      "author": "Neocactus",
      "body": "Oh I don't eat them, lmao.\n\nSo what I do is I usually make tea in a kettle and then let the shrooms sit in little infusers (shroom squeezed into a ball, wrapped in a coffee filter, then placed inside an infuser). Then I let it sit in the tea right after it's made for about 45 mins. or so, and then drink up. Barely tastes any different than regular tea!\n\nEdit: weed only makes me more anxious and in my head. Absolutely no way I could try anything new high on weed.",
      "created_utc": 1743781087.0,
      "score": 0,
      "context": [
        {
          "id": "ml4ghp4",
          "author": "Neocactus",
          "body": "I've had a couple NSFW ideas for methods I want to try.\n\n- **abusing substances to try new foods:** Haven't tried it yet, but I noticed on a shroom trip that my ARFID was pretty much completely vaporized when I was tripping. I didn't have anything to try though, so nothing was accomplished there. It's been months since I had my hands on shrooms too.. but I've also been considering getting extremely drunk and seeing how well that could help.\n\n- **having a dom/domme force me to try new foods--obviously in a sexual way:** I have no idea where I could find someone to participate with me in this (single, don't wanna hire anyone, don't know how to explain), but I think it'd be really hot if some dominatrix was basically forcing me to eat. I think my horniness would greatly override any anxiety I have related to trying new foods.\n\nEdit: guess these aren't really tips, but I have a fair bit of confidence they could actually help me, lol.",
          "created_utc": 1743641529.0
        },
        {
          "id": "mldrzg6",
          "author": "None",
          "body": "Eating on mushrooms 💀 I could never! It makes me nauseous. But weed on the other hand...",
          "created_utc": 1743778022.0
        }
      ]
    },
    {
      "id": "mla9ufa",
      "author": "Autismsaurus",
      "body": "They have Lion King nuggets?! 😳  Want!",
      "created_utc": 1743721751.0,
      "score": 1,
      "context": [
        {
          "id": "ml1536o",
          "author": "independentchickpea",
          "body": "Honestly sometimes I do pretend I'm feeding a kid, because when I revert to safe foods during a hard time, I'm basically living off chicken nuggets and noodles! It helps me practice nurturing my inner child too. \n\nIt's something we were taught in treatment so it is a totally valid tactic!",
          "created_utc": 1743605307.0
        },
        {
          "id": "ml26rfw",
          "author": "Thedailybee",
          "body": "I do this as well!! I even mostly use kids dinnerware , it’s smaller and cuter and makes it feel more fun/less intimidating. And it is very healing to imagine taking care of yourself that way 🥺",
          "created_utc": 1743616349.0
        },
        {
          "id": "ml2oyn5",
          "author": "independentchickpea",
          "body": "Adorable! I have some cute things for bentos, and use a dinosaur-shaped sandwich cutter and have a \"uncrustable\" press too. I'll also get shaped nuggets for the serotonin hahaha. I developed ARFID as a child as a trauma response and so I just count it as some good self-care and talk my inner child through it so I feel safe and taken care of. It probably sounds totally unhinged but whatever, leave me alone with my Lion King nuggies!",
          "created_utc": 1743621656.0
        }
      ]
    },
    {
      "id": "mlfiiqc",
      "author": "sunnyskiezzz",
      "body": "You can do it! I try to avoid using alcohol to cope, but when I use it in a healthy way for celebratory reasons and it just happens to help my symptoms, I'm not complaining. It's the same with using weed for my anorexia -- it's not my first line of attack, but it is pretty nice to be able to eat a meal and have pleasure at the forefront instead of fear when I do partake.",
      "created_utc": 1743796927.0,
      "score": 2,
      "context": [
        {
          "id": "ml21ylu",
          "author": "Overall-Training8760",
          "body": "I have less anxiety eating if I’m drunk lol. I once tried some kind of spinach quinoa ball (that is so far from my sober comfort zone it’s literally on another planet)",
          "created_utc": 1743615007.0
        },
        {
          "id": "ml6ugz2",
          "author": "sunnyskiezzz",
          "body": "Pizza is a moderate-level fear food until I'm drunk. Then there is nothing on earth better than a stuffed crust cheese pizza.",
          "created_utc": 1743683539.0
        },
        {
          "id": "mlbhuro",
          "author": "Overall-Training8760",
          "body": "It makes sense since alcohol lowers inhibition! I’m honestly gonna have a little party for just myself and my fiancée where I get drunk and try a bite of a very plain salad… maybe just lettuce and dressing. I’d be so proud. Scrambled egg has been at the top of my list for a while too.",
          "created_utc": 1743738571.0
        }
      ]
    },
    {
      "id": "mlaapqx",
      "author": "independentchickpea",
      "body": "Impossible does! (I'm vegan, they're my favorite)",
      "created_utc": 1743722050.0,
      "score": 3,
      "context": [
        {
          "id": "ml1536o",
          "author": "independentchickpea",
          "body": "Honestly sometimes I do pretend I'm feeding a kid, because when I revert to safe foods during a hard time, I'm basically living off chicken nuggets and noodles! It helps me practice nurturing my inner child too. \n\nIt's something we were taught in treatment so it is a totally valid tactic!",
          "created_utc": 1743605307.0
        },
        {
          "id": "ml26rfw",
          "author": "Thedailybee",
          "body": "I do this as well!! I even mostly use kids dinnerware , it’s smaller and cuter and makes it feel more fun/less intimidating. And it is very healing to imagine taking care of yourself that way 🥺",
          "created_utc": 1743616349.0
        },
        {
          "id": "ml2oyn5",
          "author": "independentchickpea",
          "body": "Adorable! I have some cute things for bentos, and use a dinosaur-shaped sandwich cutter and have a \"uncrustable\" press too. I'll also get shaped nuggets for the serotonin hahaha. I developed ARFID as a child as a trauma response and so I just count it as some good self-care and talk my inner child through it so I feel safe and taken care of. It probably sounds totally unhinged but whatever, leave me alone with my Lion King nuggies!",
          "created_utc": 1743621656.0
        },
        {
          "id": "mla9ufa",
          "author": "Autismsaurus",
          "body": "They have Lion King nuggets?! 😳  Want!",
          "created_utc": 1743721751.0
        }
      ]
    },
    {
      "id": "mlmdzjj",
      "author": "Overall-Training8760",
      "body": "I’m not much of a drinker but I have noticed it helps the ARFID so I might as well try it! Definitely good to be cautious if you’re someone who’s prone to addictions or has a tricky relationship with alcohol.",
      "created_utc": 1743897643.0,
      "score": 1,
      "context": [
        {
          "id": "ml21ylu",
          "author": "Overall-Training8760",
          "body": "I have less anxiety eating if I’m drunk lol. I once tried some kind of spinach quinoa ball (that is so far from my sober comfort zone it’s literally on another planet)",
          "created_utc": 1743615007.0
        },
        {
          "id": "ml6ugz2",
          "author": "sunnyskiezzz",
          "body": "Pizza is a moderate-level fear food until I'm drunk. Then there is nothing on earth better than a stuffed crust cheese pizza.",
          "created_utc": 1743683539.0
        },
        {
          "id": "mlbhuro",
          "author": "Overall-Training8760",
          "body": "It makes sense since alcohol lowers inhibition! I’m honestly gonna have a little party for just myself and my fiancée where I get drunk and try a bite of a very plain salad… maybe just lettuce and dressing. I’d be so proud. Scrambled egg has been at the top of my list for a while too.",
          "created_utc": 1743738571.0
        },
        {
          "id": "mlfiiqc",
          "author": "sunnyskiezzz",
          "body": "You can do it! I try to avoid using alcohol to cope, but when I use it in a healthy way for celebratory reasons and it just happens to help my symptoms, I'm not complaining. It's the same with using weed for my anorexia -- it's not my first line of attack, but it is pretty nice to be able to eat a meal and have pleasure at the forefront instead of fear when I do partake.",
          "created_utc": 1743796927.0
        }
      ]
    }
  ]
}