{
  "id": "1jqhscd",
  "subreddit": "ARFID",
  "author": "cryerin25",
  "created_utc": 1743685178.0,
  "title": "what’s your least traditional/most surprising safe food?",
  "selftext": "(stealing this question from a tiktok because i thought it was interesting)\n\ni’ll go first, i’ve heard lots of other ppl with arfid denounce cottage cheese but that’s always been a go-to snack with me. also seafood is generally safe for me as a category, which often surprises people. ",
  "url": "https://www.reddit.com/r/ARFID/comments/1jqhscd/whats_your_least_traditionalmost_surprising_safe/",
  "score": 104,
  "num_comments": 148,
  "comments": [
    {
      "id": "ml75k38",
      "author": "Familiar_Drawer_703",
      "body": "I like almost all fruits and veggies! I've noticed that is kinda rare for ARFID.\n\nI just HATE meats, cheese and eat mostly bland foods. It's so freaking hard to get enough calories as an almost vegan. 🥲",
      "created_utc": 1743687536.0,
      "score": 98,
      "context": []
    },
    {
      "id": "ml75oy5",
      "author": "imhereforthemeta",
      "body": "I didn’t eat much processed food as a kid because of how j grew up - so a lot of veggies. I eat a huge salad with my safe veggies every night. I feel like I won the ARFID lottery because my parents just didn’t let a lot of food into the house that isn’t healthy",
      "created_utc": 1743687582.0,
      "score": 47,
      "context": []
    },
    {
      "id": "ml7gccj",
      "author": "kayidontcare",
      "body": "the jail food my dad raised me on 😆 canned chili mixed with ramen noodles is my favorite",
      "created_utc": 1743690940.0,
      "score": 35,
      "context": []
    },
    {
      "id": "ml70j86",
      "author": "fifibunkin",
      "body": "Escargot. I always get it in France in Epcot Disney World. I really like it.",
      "created_utc": 1743685794.0,
      "score": 28,
      "context": []
    },
    {
      "id": "ml759ka",
      "author": "grudgby",
      "body": "I was gonna say cottage cheese too! Lmao there are at least 2 of us",
      "created_utc": 1743687438.0,
      "score": 25,
      "context": []
    },
    {
      "id": "ml7dxi2",
      "author": "xernpostz",
      "body": "eggs and black beans! my arfid is highly geared towards food with one flavor and texture, and a mild taste. those both fit the bill",
      "created_utc": 1743690212.0,
      "score": 17,
      "context": []
    },
    {
      "id": "ml7hpds",
      "author": "Apprehensive_Suit940",
      "body": "I’m a fan of literally all cheese, doesn’t matter what kind, I will always eat it no matter what mood I’m in",
      "created_utc": 1743691348.0,
      "score": 17,
      "context": []
    },
    {
      "id": "ml709t5",
      "author": "PanteraBread69",
      "body": "Mm I like spicy tuna rolls (after removing the cucumber/avocado slice lol) and sashimi. However I've been unsuccessful in branching into other kinds of sushi haha, but folks are usually surprised when I'm down to go the to a sushi belt.",
      "created_utc": 1743685699.0,
      "score": 14,
      "context": []
    },
    {
      "id": "ml768ix",
      "author": "crown-jewel",
      "body": "Hamburger helper beef stroganoff is the one that always throws people, but I love it.",
      "created_utc": 1743687765.0,
      "score": 15,
      "context": []
    },
    {
      "id": "ml83d44",
      "author": "lemurificspeckle",
      "body": "People tend to be surprised that I LOVE spicy food. Adding spiciness can actually be a way to food chain for me, making trying something new more tolerable because at least there’s the spicy aspect that’s familiar and pleasant! \n\nI also tend to like some weirder taste combinations that other people might be disgusted by. Like, over the weekend I did a mini exposure where I tried a fancy fruit juice that had cayenne in it, and my friend thought it was gross but I was cool with it! And I loooooove dipping french fries in a frosty or some soft serve. Both of those examples seem pretty tame to me but some people look at me like I’m crazy when I say I like stuff like that, such a funny thing to experience as an ARFIDer!",
      "created_utc": 1743697734.0,
      "score": 14,
      "context": []
    },
    {
      "id": "ml7bwwx",
      "author": "theatregirl1987",
      "body": "Pineapple on pizza is the one that throws people off. I know it's strange, but I love both things, so putting them together is no big deal.",
      "created_utc": 1743689598.0,
      "score": 12,
      "context": []
    },
    {
      "id": "ml7b4xg",
      "author": "Odd_Signature_7720",
      "body": "boba balls and mushrooms are both safe foods for me, I know that's controversial in the ARFID community tho LOL",
      "created_utc": 1743689356.0,
      "score": 10,
      "context": []
    },
    {
      "id": "ml7u1xr",
      "author": "kidfromdc",
      "body": "I love Indian food, specifically Chana masala and samosas",
      "created_utc": 1743694977.0,
      "score": 11,
      "context": []
    },
    {
      "id": "ml88k3x",
      "author": "Darth_Celeste",
      "body": "Also Caesar salad and french fries. This meal heals my soul, I don’t know how else to describe it lol. The salad feels hydrating and the fries are filling and salty but not so much so that it causes bloating or anything negative like that 🤌🏻🤌🏻🤌🏻it is the perfect safe and easily obtainable meal for me when I’m out and about",
      "created_utc": 1743699267.0,
      "score": 9,
      "context": []
    },
    {
      "id": "ml8arig",
      "author": "Delicious_Impress818",
      "body": "mexican food! I’ve seen a lot of ARFID folks say they don’t like it but it’s a fav of mine",
      "created_utc": 1743699911.0,
      "score": 6,
      "context": []
    },
    {
      "id": "ml8vjl2",
      "author": "kaki024",
      "body": "I love broccoli. Fresh, steamed, frozen, sauced, plain. It’s been a safe food since childhood 🥦🥦🥦",
      "created_utc": 1743706001.0,
      "score": 6,
      "context": []
    },
    {
      "id": "ml70a9c",
      "author": "Nooshy1978",
      "body": "Eel from the Japanese restaurant near my house.",
      "created_utc": 1743685704.0,
      "score": 6,
      "context": []
    },
    {
      "id": "ml720lr",
      "author": "Goldenface0707",
      "body": "Pad Thai",
      "created_utc": 1743686319.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ml7u6l2",
      "author": "kfilks",
      "body": "Tuna from Subway",
      "created_utc": 1743695014.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mla3it9",
      "author": "lizardsnake23",
      "body": "anything that’s authentic mexican food and vegetarian (i’m vegetarian). something about the flavor combos is soo comforting. american mexican food is hit or miss. i don’t know why, i’m incrediblyy particular about literally everything else!",
      "created_utc": 1743719562.0,
      "score": 6,
      "context": []
    },
    {
      "id": "mlak7vm",
      "author": "randompersonignoreme",
      "body": "Fruits and veggies. My favorite texture wise is the skin of apples <3 Ily fruits <3 Ily veggies <3",
      "created_utc": 1743725465.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mlb62gv",
      "author": "Zimsgirlfriend",
      "body": "Vegetarian nuggets,most people think they are weird or bad but I honestly really like them to the point of that's all I literally live off of pretty much besides milk too. 🥛🦖",
      "created_utc": 1743733693.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ml72vnt",
      "author": "dioor",
      "body": "I really like a couple specific brands of egg rolls that I’ve been able to find in grocery stores (the frozen ones you cook in the oven) though I don’t think it’s a food I’m adventurous enough to try if I can’t overcook it myself. \n\nI also love pesto on pasta, even though that’s something I’ve heard a lot of normal eaters call gross.",
      "created_utc": 1743686619.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ml76tig",
      "author": "RealityISnotOk123123",
      "body": "Cottage cheese!",
      "created_utc": 1743687961.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ml7cwtt",
      "author": "lilliweasel",
      "body": "Stilton cheese!",
      "created_utc": 1743689901.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ml7j7g8",
      "author": "melanie31leo",
      "body": "I found a Chinese spot yesterday with some amazing sesame chicken. There were only like 2 offensive looking pieces but I ate the rest, it was so juicy and crispy",
      "created_utc": 1743691792.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ml7ldz4",
      "author": "StrawbraryLiberry",
      "body": "Smelly cheeses",
      "created_utc": 1743692423.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ml81lxd",
      "author": "PlagueDoc1348",
      "body": "Any Midwest style casserole as long as there’s no crunchy onions or pepper in it! Tater tot casserole, great bean casserole, etc etc. Usually reeeeally dislike “wet” veggies and most gravy, but if it’s in a casserole I don’t mind one bit! \n\nAlso cottage cheese, rice pudding, and mushrooms in almost any form (except soup) are things I eat regularly!",
      "created_utc": 1743697213.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ml87vi7",
      "author": "Darth_Celeste",
      "body": "I don’t like fruit but I love most veggies. My aversion is mostly meats and certain textures like anything soft/squishy inside something smooth (like smoothies or yogurt with chunks of fruit). \nOne of my go-to safe meals is actually indian food, specifically chicken vindaloo which is spicy chicken and potatoes. I used to go for chicken tikka masala but I’m lactose intolerant and I have emetaphobia so the cream in the sauce made me really bloated and it was kinda triggering.",
      "created_utc": 1743699069.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ml8b9ux",
      "author": "interrobangggg",
      "body": "Caesar salad 😋",
      "created_utc": 1743700062.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ml97ocm",
      "author": "contactwho",
      "body": "Olives! People can’t believe it when I actually eat something they won’t!",
      "created_utc": 1743709642.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mlah9f1",
      "author": "NoPantsPenny",
      "body": "Milk my safe food. I love it so much.",
      "created_utc": 1743724377.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mlb9sns",
      "author": "ZWiloh",
      "body": "I also really like seafood! When I was a kid my mom was eating steamed crabs and it was the only food she never even bothered to ask me to try. But for the first and probably only time in my life, I walked up to ber and said \"that smells good, can I try it?\" She hadn't wanted to share, lol. My favorite food at this point in my life is shrimp quesadillas that my dad makes. \n\nI don't know that I have any really surprising safe foods, but some of the things I don't like surprises people. I can't stand any pasta or macaroni so no mac and cheese for me, which many people who are used to picky children find surprising.",
      "created_utc": 1743735162.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ml7nvq5",
      "author": "JustPaula",
      "body": "My daughter likes curry \"bricks\" and dips fries and chicken in it.",
      "created_utc": 1743693167.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ml86s4n",
      "author": "40earthlikeplanets",
      "body": "I like lion's mane or oyster mushrooms. I fry em up in butter, garlic powder, onion powder, and salt",
      "created_utc": 1743698748.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ml8n9e2",
      "author": "Fro-yo_enthusiast",
      "body": "Sandwich from shop in my hometown, bacon & swiss cheese toasted on the bread, avocado, pickled jalapeños, lettuce, olive oil, & blackberry jam",
      "created_utc": 1743703530.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ml975fs",
      "author": "No-Yogurtcloset-1900",
      "body": "Dumplings. Pork is my favorite but I could eat dumplings of nearly any sort and be happy. (Just no seafood).",
      "created_utc": 1743709487.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ml9f91g",
      "author": "em_theawesome",
      "body": "Pineapple, I find that people either hate pineapple or love it. I love buying the canned rings and eating them for breakfast cause they're so filling.",
      "created_utc": 1743711839.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mlb4bqb",
      "author": "CuckooSpit_06",
      "body": "Eggs. I've heard many people with ARFID are disgusted by eggs but I eat them almost every day. Fried, boiled, in salads, sandwiches, in cottage cheese. They can be as bland or exciting as you want them to be.",
      "created_utc": 1743733030.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ml751aw",
      "author": "Lost_My_Brilliance",
      "body": "honey curry chicken is really not that weird, but it’s the least stereotypical thing i eat",
      "created_utc": 1743687360.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ml8fkzu",
      "author": "crash----",
      "body": "I loooove seafood! Shrimp, lobster, crab, clams, all that stuff. I also really like roasted cauliflower.",
      "created_utc": 1743701312.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ml9vz3a",
      "author": "sammy_nobrains",
      "body": "Haribo Gummie Bears and oranges",
      "created_utc": 1743716978.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mlabken",
      "author": "gingerbread63",
      "body": "Calamari 🤤",
      "created_utc": 1743722347.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mlagq6f",
      "author": "Honeydewskyy20",
      "body": "Avocado being my biggest safe food is wild to others lol. I just sprinkle a little salt and pepper on it and eat it! 😋",
      "created_utc": 1743724184.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mlaln9u",
      "author": "idk_honestly24",
      "body": "Boiled peanuts. Maybe not THAT crazy but i am surprised I like them haha",
      "created_utc": 1743725998.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mlb53ma",
      "author": "waitoutthewinter",
      "body": "While it is a fairly popular dish in my country, I really love chicken heart, especially in a barbecue. But I understand that for pretty much the rest of the world that's really weird and/or disgusting lol. It was just so normal for me growing up that I never thought too much about it and I still like it very much today\n\nI also love squid but I'm not a fan of fish or seafood in general. I like some types of shrimp but unfortunately can't eat it much without having terrible stomach side effects",
      "created_utc": 1743733323.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mlbt805",
      "author": "jorwyn",
      "body": "I like tons of Asian foods despite growing up in a small town in America where \"Asian food\" was chow mein from a can that wasn't even close to authentic. \n\nIt seems like the less it's like what I grew up with, the easier time I'll have with it.",
      "created_utc": 1743744039.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mle3ifr",
      "author": "Useful-Actuator8549",
      "body": "my ARFID is tied to contamination OCD, so anything that comes from an un-dented can is safe to me and most people seem to think canned foods are gross. \n\ncanned fish/chicken/veggies/fruits are all great safe options for me! i also am a huge fan of cottage cheese, i’ll eat it sweet or savoury!",
      "created_utc": 1743781451.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mlwjbj7",
      "author": "No-Leather8413",
      "body": "this is crazy to ME, but i did grow up southern and ate these before i could even talk- crawfish. typically i can’t eat anything that still has a head and EYES😭 but i’m not sure what’s so different about crawfish. i do really like seafood in general but crawfish just seems like it should gross me out.",
      "created_utc": 1744050058.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ml7qgve",
      "author": "booksncatsn",
      "body": "My daughter loves a faux cheese sauce made from tahini, miso and nutritional yeast. It doesn't taste cheesy to me, but it is good. She eats it like a soup.",
      "created_utc": 1743693931.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ml7rf6e",
      "author": "Suitable_Distance_69",
      "body": "Chili stow, my problem with a lot of foods that thay don't have enough flavor, my chili is.. the flavor is Hella strong, and really spicy, generally spicy food. Not spicy sweet. Only spicy",
      "created_utc": 1743694211.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ml7yrbi",
      "author": "Infinite-Most-8356",
      "body": "dried seaweed (?)",
      "created_utc": 1743696367.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ml850em",
      "author": "Fun_Theme_9421",
      "body": "Tuna salad",
      "created_utc": 1743698223.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ml89sfo",
      "author": "mamapajamas",
      "body": "Speaking for my daughter: miso soup and daikon radish!",
      "created_utc": 1743699621.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ml8gcdr",
      "author": "littleepatina",
      "body": "rice pudding",
      "created_utc": 1743701532.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ml98d7f",
      "author": "sharkprincefishstick",
      "body": "Canned chili, probably.",
      "created_utc": 1743709841.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ml9dxkg",
      "author": "jabroni3469",
      "body": "Salmon!",
      "created_utc": 1743711455.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ml9irur",
      "author": "skycotton",
      "body": "I love most fresh fruit and veggies, cottage cheese too",
      "created_utc": 1743712862.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ml9vof1",
      "author": "Woe_iz_i",
      "body": "Beans lol, and edamame",
      "created_utc": 1743716884.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mla5x6g",
      "author": "thelikesofyou73",
      "body": "Raw hamburger 😂",
      "created_utc": 1743720405.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mlafdgx",
      "author": "Salt_Worldliness7976",
      "body": "rye chips in the gardetto’s package",
      "created_utc": 1743723700.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mlamjt3",
      "author": "Sea_Lead1753",
      "body": "I love trying new, interesting creative foods at restaurants but can only eat my staples at home !",
      "created_utc": 1743726332.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mlav93l",
      "author": "tarac73",
      "body": "Cottage cheese is an odd one but once you get past the texture it's basically tasteless",
      "created_utc": 1743729604.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mlb0v2m",
      "author": "knowledgelover94",
      "body": "Guacamole",
      "created_utc": 1743731721.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mlblnoh",
      "author": "deathcappforacutie",
      "body": "seaweed avocado pizza from the sushi place next to my work!",
      "created_utc": 1743740324.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mlblzum",
      "author": "Driver3",
      "body": "I like green beans a lot. I don't know why either, I hate basically almost all other veggies, but green beans are apparently the one that my taste buds are like \"No wait, this is great, keep eating these\".",
      "created_utc": 1743740484.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mlbs009",
      "author": "OverlordSheepie",
      "body": "Fried oysters. When I have access to regular raw oysters I'll try giving those a go too. They taste like the ocean and the slimy texture doesn't bother me, it actually helps me swallow in a way.",
      "created_utc": 1743743396.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mlchrnz",
      "author": "mairih_",
      "body": "I love toast with cottage cheese and cucumbers",
      "created_utc": 1743758726.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mlcurrx",
      "author": "rileydonohue",
      "body": " Broccoli asparagus and green beans",
      "created_utc": 1743765943.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mld91j8",
      "author": "naturesguardiansmyf",
      "body": "Fish, olives, chestnuts and wok noodles",
      "created_utc": 1743771804.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mldasgw",
      "author": "TheBackyardigirl",
      "body": "I like beans 😭 i see a lot of fellow arfid people calling beans the devil incarnate but i think they’re really good",
      "created_utc": 1743772440.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mldbzx7",
      "author": "CaitlinSnep",
      "body": "Lima beans.",
      "created_utc": 1743772869.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mldk3j8",
      "author": "syntheticjoy_",
      "body": "Deviled eggs! So yummy to me",
      "created_utc": 1743775592.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mle7uug",
      "author": "TickingTiger",
      "body": "Coleslaw. I hate onions, I hate cabbage, and I hate salads where everything is chopped up and mixed together, ESPECIALLY with dressing. But I love coleslaw. Make it make sense.",
      "created_utc": 1743782745.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mlevz8r",
      "author": "swingingmydongaround",
      "body": "My fiance gets so weirded out bc I love the Calamari and escargot at my work lolol. But my fav safe food is probably spicy steak tacos or baby corn/rice/brown sauce",
      "created_utc": 1743789969.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mlf080m",
      "author": "Low_Ad_3139",
      "body": "Beef. It’s the only thing I digest well and never throw up.",
      "created_utc": 1743791262.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mlf3dbm",
      "author": "ZombieInACage",
      "body": "Apple sauce. I know a lot of people cannot handle the texture but that’s why I love it.",
      "created_utc": 1743792226.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mlf6uct",
      "author": "sillydogcircus",
      "body": "Raw baby spinach 😂 i eat it like potato chips!",
      "created_utc": 1743793285.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mlh04yd",
      "author": "TheRealAanarii",
      "body": "Sushi",
      "created_utc": 1743815699.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mlh7hbx",
      "author": "Nyx_Shadowspawn",
      "body": "I'll eat organ meat if my mom makes it, because she cooks it really well. Can't make it myself because watching the process and the smell of it raw makes me feel ill. Few other people know how to cook organ meat as good as my mom, especially now that my grandma and aunt are both dead. \n\nI can't do cottage cheese, so power to you, OP! That's definitely a win :)",
      "created_utc": 1743818598.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mlzyfe8",
      "author": "Conscious-Mouse-6956",
      "body": "Truffle! People never believe me when I say I like anything truffle lol. Truffle pasta, truffle chips, etc. And it’s not even like it’s a new food I’ve conquered recently. I’ve liked it since I was a kid! So so weird but happy ig :)",
      "created_utc": 1744097131.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mm3ifuj",
      "author": "Civil-Law529",
      "body": "Jello! A lot of people tell me the texture is disgusting and admittedly I don’t like slimy textures but something mushy like pudding or jello, I love!!\n\nNot a safe food but one I can sometimes eat is salmon, which often surprises people! I worked a long time to add salmon into the list of foods I can tolerate though so it definitely wasn’t love at first sight!! And it isn’t one I can eat all the time",
      "created_utc": 1744144344.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mm5z7mr",
      "author": "figtreemetaphor11",
      "body": "Bitter and fermented foods!!! Salt and vinegar chips have been a staple for me since I was young, and I love the taste of balsamic vinegar, pickles, kombucha, etc! Gotta have the pickles alone though- putting them on something ruins it.",
      "created_utc": 1744176565.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mm6bqze",
      "author": "Opposite-Sign-5664",
      "body": "tortillas with just sour cream and mexican cheese or just with sour cream",
      "created_utc": 1744184009.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mmarh7o",
      "author": "kennedylikesbugs",
      "body": "Fruits and vegetables but I’m very selective with them - for example I really really enjoy bananas but will only eat them before they turn ripe, so they need to be literally green or I won’t eat them lmfao",
      "created_utc": 1744240623.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mmbirb0",
      "author": "throwaway200780",
      "body": "Ground Beef, but only with rice. Ground beef itself is a no, I don’t know why honestly.",
      "created_utc": 1744250227.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mmr8vha",
      "author": "VividWood",
      "body": "Indian curry and rice!!! I just love it. It needs to only have chicken, potato’s and carrots in it though.",
      "created_utc": 1744475861.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ms1ope2",
      "author": "Jazzlike_Elderberry9",
      "body": "a can of sweet red beans from the asian market. it's funny because i refuse to put any sort of savory bean dish in my mouth",
      "created_utc": 1747115714.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ml7jruq",
      "author": "MyMindIsAHellscape",
      "body": "I wish I could trade. I’m a healthy weight but my diet is so bland and unhealthy.",
      "created_utc": 1743691956.0,
      "score": 24,
      "context": [
        {
          "id": "ml75k38",
          "author": "Familiar_Drawer_703",
          "body": "I like almost all fruits and veggies! I've noticed that is kinda rare for ARFID.\n\nI just HATE meats, cheese and eat mostly bland foods. It's so freaking hard to get enough calories as an almost vegan. 🥲",
          "created_utc": 1743687536.0
        }
      ]
    },
    {
      "id": "ml7t6ce",
      "author": "___disaster___",
      "body": "same! fruit and vegetables are v predictable in taste",
      "created_utc": 1743694722.0,
      "score": 14,
      "context": [
        {
          "id": "ml75k38",
          "author": "Familiar_Drawer_703",
          "body": "I like almost all fruits and veggies! I've noticed that is kinda rare for ARFID.\n\nI just HATE meats, cheese and eat mostly bland foods. It's so freaking hard to get enough calories as an almost vegan. 🥲",
          "created_utc": 1743687536.0
        }
      ]
    },
    {
      "id": "ml7u3v6",
      "author": "floorenjoyer",
      "body": "I also love fruit!! And fair pretty well trying veggies but theyre not a huge part of my diet. I also HATE meat and most cheese (i only rarely eat mozarella sticks or pan fried haloumi). I have a really limited savoury palette, but love sweet stuff so fruit is great :D",
      "created_utc": 1743694993.0,
      "score": 5,
      "context": [
        {
          "id": "ml75k38",
          "author": "Familiar_Drawer_703",
          "body": "I like almost all fruits and veggies! I've noticed that is kinda rare for ARFID.\n\nI just HATE meats, cheese and eat mostly bland foods. It's so freaking hard to get enough calories as an almost vegan. 🥲",
          "created_utc": 1743687536.0
        }
      ]
    },
    {
      "id": "mlah685",
      "author": "NoPantsPenny",
      "body": "Meat grosses me out so bad. The textures aren’t consistent and I hate it.",
      "created_utc": 1743724345.0,
      "score": 5,
      "context": [
        {
          "id": "ml75k38",
          "author": "Familiar_Drawer_703",
          "body": "I like almost all fruits and veggies! I've noticed that is kinda rare for ARFID.\n\nI just HATE meats, cheese and eat mostly bland foods. It's so freaking hard to get enough calories as an almost vegan. 🥲",
          "created_utc": 1743687536.0
        }
      ]
    },
    {
      "id": "mlaobo9",
      "author": "AetherDrew43",
      "body": "While I don't like many fruits, I don't find them completely repulsive, so I can bring myself to eat or drink them if I have to.\n\nI can't say the same for vegetables though, or fruits that are considered vegetables in the culinary world like tomatoes or cucumbers. Bell peppers are an exception, as well as carrots sometimes.",
      "created_utc": 1743726992.0,
      "score": 5,
      "context": [
        {
          "id": "ml75k38",
          "author": "Familiar_Drawer_703",
          "body": "I like almost all fruits and veggies! I've noticed that is kinda rare for ARFID.\n\nI just HATE meats, cheese and eat mostly bland foods. It's so freaking hard to get enough calories as an almost vegan. 🥲",
          "created_utc": 1743687536.0
        }
      ]
    },
    {
      "id": "mlb8vve",
      "author": "Princesstinyk",
      "body": "Omg same! I always felt like I was the only one! Getting enough protein is so hard and I'm pretty low in b12 but not deficient somehow. But I basically have to cover my meat with veg to eat ir",
      "created_utc": 1743734796.0,
      "score": 3,
      "context": [
        {
          "id": "ml75k38",
          "author": "Familiar_Drawer_703",
          "body": "I like almost all fruits and veggies! I've noticed that is kinda rare for ARFID.\n\nI just HATE meats, cheese and eat mostly bland foods. It's so freaking hard to get enough calories as an almost vegan. 🥲",
          "created_utc": 1743687536.0
        }
      ]
    },
    {
      "id": "mla27ni",
      "author": "3V3451NC3",
      "body": "When i was in treatment i got introuble for only wanting to eat the fruit 😭",
      "created_utc": 1743719101.0,
      "score": 2,
      "context": [
        {
          "id": "ml75k38",
          "author": "Familiar_Drawer_703",
          "body": "I like almost all fruits and veggies! I've noticed that is kinda rare for ARFID.\n\nI just HATE meats, cheese and eat mostly bland foods. It's so freaking hard to get enough calories as an almost vegan. 🥲",
          "created_utc": 1743687536.0
        }
      ]
    },
    {
      "id": "mlev0kz",
      "author": "swingingmydongaround",
      "body": "I have the same diet! Meat and cheeses weird me out but i’ll go to town on almost any veggie or fruit lol",
      "created_utc": 1743789680.0,
      "score": 2,
      "context": [
        {
          "id": "ml75k38",
          "author": "Familiar_Drawer_703",
          "body": "I like almost all fruits and veggies! I've noticed that is kinda rare for ARFID.\n\nI just HATE meats, cheese and eat mostly bland foods. It's so freaking hard to get enough calories as an almost vegan. 🥲",
          "created_utc": 1743687536.0
        }
      ]
    },
    {
      "id": "mlxlxz0",
      "author": "AshleysTheGirl",
      "body": "Same!! Not with cheese but with most meat fs. I do consistently like SOME meats but others not so much. Steak for example is my worst enemy. It's tasty but it's too hard to chew for me and any fatty parts I run into make me want to throw up\n\n\nAs for fruits and vegetables, they're a very safe bet for me. At least with a cucumber or something I know I won't find a tendon in it 😭",
      "created_utc": 1744062139.0,
      "score": 1,
      "context": [
        {
          "id": "ml75k38",
          "author": "Familiar_Drawer_703",
          "body": "I like almost all fruits and veggies! I've noticed that is kinda rare for ARFID.\n\nI just HATE meats, cheese and eat mostly bland foods. It's so freaking hard to get enough calories as an almost vegan. 🥲",
          "created_utc": 1743687536.0
        }
      ]
    },
    {
      "id": "ml8482h",
      "author": "lemurificspeckle",
      "body": "Honestly that’s a huge W to have salads/vegetables as safe foods from the get go. Doing exposures to get comfortable with salad has been AWESOME for me, I can eat healthier and actually order from restaurants!!!",
      "created_utc": 1743697989.0,
      "score": 14,
      "context": [
        {
          "id": "ml75oy5",
          "author": "imhereforthemeta",
          "body": "I didn’t eat much processed food as a kid because of how j grew up - so a lot of veggies. I eat a huge salad with my safe veggies every night. I feel like I won the ARFID lottery because my parents just didn’t let a lot of food into the house that isn’t healthy",
          "created_utc": 1743687582.0
        }
      ]
    },
    {
      "id": "mm3hcwj",
      "author": "Civil-Law529",
      "body": "Ah I wish I loved salads and veggies. I eat about two salads a year and even those I don’t finish!! Just try my best lol",
      "created_utc": 1744144048.0,
      "score": 1,
      "context": [
        {
          "id": "ml75oy5",
          "author": "imhereforthemeta",
          "body": "I didn’t eat much processed food as a kid because of how j grew up - so a lot of veggies. I eat a huge salad with my safe veggies every night. I feel like I won the ARFID lottery because my parents just didn’t let a lot of food into the house that isn’t healthy",
          "created_utc": 1743687582.0
        }
      ]
    },
    {
      "id": "mlduqfj",
      "author": "narcoed",
      "body": "This might be the craziest one on here",
      "created_utc": 1743778829.0,
      "score": 10,
      "context": [
        {
          "id": "ml70j86",
          "author": "fifibunkin",
          "body": "Escargot. I always get it in France in Epcot Disney World. I really like it.",
          "created_utc": 1743685794.0
        }
      ]
    },
    {
      "id": "ml7ezrn",
      "author": "goldfishmuncher",
      "body": "same!",
      "created_utc": 1743690531.0,
      "score": 3,
      "context": [
        {
          "id": "ml70j86",
          "author": "fifibunkin",
          "body": "Escargot. I always get it in France in Epcot Disney World. I really like it.",
          "created_utc": 1743685794.0
        }
      ]
    },
    {
      "id": "mlevdp7",
      "author": "swingingmydongaround",
      "body": "no wait I love escargot too, I think the garlic flavor of most of them and the crunchy bread to go with is 🤌🏻🤌🏻🤌🏻",
      "created_utc": 1743789789.0,
      "score": 3,
      "context": [
        {
          "id": "ml70j86",
          "author": "fifibunkin",
          "body": "Escargot. I always get it in France in Epcot Disney World. I really like it.",
          "created_utc": 1743685794.0
        }
      ]
    },
    {
      "id": "ml80sfm",
      "author": "PlagueDoc1348",
      "body": "I love cottage cheese with plain potato chips and some sea salt!",
      "created_utc": 1743696973.0,
      "score": 5,
      "context": [
        {
          "id": "ml759ka",
          "author": "grudgby",
          "body": "I was gonna say cottage cheese too! Lmao there are at least 2 of us",
          "created_utc": 1743687438.0
        }
      ]
    },
    {
      "id": "ml8vrq8",
      "author": "kaki024",
      "body": "One of my go-to meals is white rice and canned black beans. Sometimes I don’t even bother seasoning it lol.",
      "created_utc": 1743706068.0,
      "score": 5,
      "context": [
        {
          "id": "ml7dxi2",
          "author": "xernpostz",
          "body": "eggs and black beans! my arfid is highly geared towards food with one flavor and texture, and a mild taste. those both fit the bill",
          "created_utc": 1743690212.0
        }
      ]
    },
    {
      "id": "mlxjn6c",
      "author": "ChimkenFinger",
      "body": "I also really love boiled eggs. Always the same. Put a timer and its rare an egg ever misbehaves and doesnt have the usual/expected texture.",
      "created_utc": 1744061381.0,
      "score": 0,
      "context": [
        {
          "id": "ml7dxi2",
          "author": "xernpostz",
          "body": "eggs and black beans! my arfid is highly geared towards food with one flavor and texture, and a mild taste. those both fit the bill",
          "created_utc": 1743690212.0
        }
      ]
    },
    {
      "id": "ml7ket6",
      "author": "MyMindIsAHellscape",
      "body": "Everyone thinks I’m crazy because I don’t like cheese or chocolate very much and will only eat them in certain circumstances",
      "created_utc": 1743692139.0,
      "score": 5,
      "context": [
        {
          "id": "ml7hpds",
          "author": "Apprehensive_Suit940",
          "body": "I’m a fan of literally all cheese, doesn’t matter what kind, I will always eat it no matter what mood I’m in",
          "created_utc": 1743691348.0
        }
      ]
    },
    {
      "id": "mm3hma1",
      "author": "Civil-Law529",
      "body": "I like a crunchy California roll! It’s one of the only foods with mixed textures that I like. Not sure why. I also have not been successful with other types of sushi lol",
      "created_utc": 1744144122.0,
      "score": 2,
      "context": [
        {
          "id": "ml709t5",
          "author": "PanteraBread69",
          "body": "Mm I like spicy tuna rolls (after removing the cucumber/avocado slice lol) and sashimi. However I've been unsuccessful in branching into other kinds of sushi haha, but folks are usually surprised when I'm down to go the to a sushi belt.",
          "created_utc": 1743685699.0
        }
      ]
    },
    {
      "id": "ml87fif",
      "author": "SpaceKitten1704",
      "body": "Slightly off topic but I used to LOVE the orignal hamburger helper lasagna but they changed the recipe and I hate it now 😭 they made it more \"robust\" 🤣",
      "created_utc": 1743698938.0,
      "score": 4,
      "context": [
        {
          "id": "ml768ix",
          "author": "crown-jewel",
          "body": "Hamburger helper beef stroganoff is the one that always throws people, but I love it.",
          "created_utc": 1743687765.0
        }
      ]
    },
    {
      "id": "ml7fnu8",
      "author": "kayidontcare",
      "body": "the besttt",
      "created_utc": 1743690733.0,
      "score": 3,
      "context": [
        {
          "id": "ml768ix",
          "author": "crown-jewel",
          "body": "Hamburger helper beef stroganoff is the one that always throws people, but I love it.",
          "created_utc": 1743687765.0
        }
      ]
    },
    {
      "id": "ml899jo",
      "author": "Darth_Celeste",
      "body": "I also use spice as a tool for making a dubious food more appealing. I am very very averse to eggs unless they’re cooked in a very specific way but if it’s teetering that edge I will add hot sauce and that usually makes it edible lol",
      "created_utc": 1743699469.0,
      "score": 5,
      "context": [
        {
          "id": "ml83d44",
          "author": "lemurificspeckle",
          "body": "People tend to be surprised that I LOVE spicy food. Adding spiciness can actually be a way to food chain for me, making trying something new more tolerable because at least there’s the spicy aspect that’s familiar and pleasant! \n\nI also tend to like some weirder taste combinations that other people might be disgusted by. Like, over the weekend I did a mini exposure where I tried a fancy fruit juice that had cayenne in it, and my friend thought it was gross but I was cool with it! And I loooooove dipping french fries in a frosty or some soft serve. Both of those examples seem pretty tame to me but some people look at me like I’m crazy when I say I like stuff like that, such a funny thing to experience as an ARFIDer!",
          "created_utc": 1743697734.0
        }
      ]
    },
    {
      "id": "ml97jsi",
      "author": "contactwho",
      "body": "Blacked/ Cajun spice makes protein so much more tolerable!",
      "created_utc": 1743709606.0,
      "score": 3,
      "context": [
        {
          "id": "ml83d44",
          "author": "lemurificspeckle",
          "body": "People tend to be surprised that I LOVE spicy food. Adding spiciness can actually be a way to food chain for me, making trying something new more tolerable because at least there’s the spicy aspect that’s familiar and pleasant! \n\nI also tend to like some weirder taste combinations that other people might be disgusted by. Like, over the weekend I did a mini exposure where I tried a fancy fruit juice that had cayenne in it, and my friend thought it was gross but I was cool with it! And I loooooove dipping french fries in a frosty or some soft serve. Both of those examples seem pretty tame to me but some people look at me like I’m crazy when I say I like stuff like that, such a funny thing to experience as an ARFIDer!",
          "created_utc": 1743697734.0
        }
      ]
    },
    {
      "id": "mlcvf1w",
      "author": "krankity-krab",
      "body": "this (spiciness) was always my way of getting myself to try new things.. but then i had my firstborn & my tastebuds changed & i can’t handle spicy at all anymore 😭 literally even the mild salsa is too hot for me now, it’s been over two years since and i’m still SO salty over the fact i lost my spice 🥺 \n\nso now i survive on french fries, chips, & fruit snacks…\n\nnow i’m pregnant again & worried how i’m going to get at least SOME healthy nutrients for the sake of baby… (at least pregnancy will take the nutrients out of my (osteopenic) bones for baby if i’m not providing them.. 🥲)\n\nplease enjoy some yummy spicy stuffs for meeee! ❤️‍🩹",
      "created_utc": 1743766240.0,
      "score": 3,
      "context": [
        {
          "id": "ml83d44",
          "author": "lemurificspeckle",
          "body": "People tend to be surprised that I LOVE spicy food. Adding spiciness can actually be a way to food chain for me, making trying something new more tolerable because at least there’s the spicy aspect that’s familiar and pleasant! \n\nI also tend to like some weirder taste combinations that other people might be disgusted by. Like, over the weekend I did a mini exposure where I tried a fancy fruit juice that had cayenne in it, and my friend thought it was gross but I was cool with it! And I loooooove dipping french fries in a frosty or some soft serve. Both of those examples seem pretty tame to me but some people look at me like I’m crazy when I say I like stuff like that, such a funny thing to experience as an ARFIDer!",
          "created_utc": 1743697734.0
        }
      ]
    },
    {
      "id": "mlf37fd",
      "author": "Delicious_Impress818",
      "body": "I love spicy food I think it’s the sensory aspect of it that hooks us",
      "created_utc": 1743792177.0,
      "score": 2,
      "context": [
        {
          "id": "ml83d44",
          "author": "lemurificspeckle",
          "body": "People tend to be surprised that I LOVE spicy food. Adding spiciness can actually be a way to food chain for me, making trying something new more tolerable because at least there’s the spicy aspect that’s familiar and pleasant! \n\nI also tend to like some weirder taste combinations that other people might be disgusted by. Like, over the weekend I did a mini exposure where I tried a fancy fruit juice that had cayenne in it, and my friend thought it was gross but I was cool with it! And I loooooove dipping french fries in a frosty or some soft serve. Both of those examples seem pretty tame to me but some people look at me like I’m crazy when I say I like stuff like that, such a funny thing to experience as an ARFIDer!",
          "created_utc": 1743697734.0
        }
      ]
    },
    {
      "id": "ml7k74e",
      "author": "MyMindIsAHellscape",
      "body": "It’s absolutely not strange- people are just being weird about it. It’s popular to hate things. The Canadian who invented it was inspired by sweet and sour pork. Bread, meat, cheese, and fruit have been eaten together for thousands of years.",
      "created_utc": 1743692079.0,
      "score": 5,
      "context": [
        {
          "id": "ml7bwwx",
          "author": "theatregirl1987",
          "body": "Pineapple on pizza is the one that throws people off. I know it's strange, but I love both things, so putting them together is no big deal.",
          "created_utc": 1743689598.0
        }
      ]
    },
    {
      "id": "mle9bco",
      "author": "TickingTiger",
      "body": "I absolutely LOVE this too. I love cheese pizza, I love pineapple, put them together and BOOM delicious meal. \n\nDamn it, now I'm craving pizza delivery, and I do not have sufficient funds for pizza delivery. This is an unpleasant sensation. Any rich people on here wanna buy me dinner? 🤣",
      "created_utc": 1743783190.0,
      "score": 1,
      "context": [
        {
          "id": "ml7bwwx",
          "author": "theatregirl1987",
          "body": "Pineapple on pizza is the one that throws people off. I know it's strange, but I love both things, so putting them together is no big deal.",
          "created_utc": 1743689598.0
        }
      ]
    },
    {
      "id": "ml96k3l",
      "author": "lostinthemoss1",
      "body": "I love boba! I’m very sensitive to changes in texture though so it has to be cooked right",
      "created_utc": 1743709311.0,
      "score": 4,
      "context": [
        {
          "id": "ml7b4xg",
          "author": "Odd_Signature_7720",
          "body": "boba balls and mushrooms are both safe foods for me, I know that's controversial in the ARFID community tho LOL",
          "created_utc": 1743689356.0
        }
      ]
    },
    {
      "id": "ml8weh4",
      "author": "kaki024",
      "body": "https://imgur.com/a/bQZnQiZ",
      "created_utc": 1743706254.0,
      "score": 3,
      "context": [
        {
          "id": "ml88k3x",
          "author": "Darth_Celeste",
          "body": "Also Caesar salad and french fries. This meal heals my soul, I don’t know how else to describe it lol. The salad feels hydrating and the fries are filling and salty but not so much so that it causes bloating or anything negative like that 🤌🏻🤌🏻🤌🏻it is the perfect safe and easily obtainable meal for me when I’m out and about",
          "created_utc": 1743699267.0
        }
      ]
    },
    {
      "id": "mm3huwv",
      "author": "Civil-Law529",
      "body": "Yes! I love mexican food because tortilla chips are one of my safe foods!!",
      "created_utc": 1744144190.0,
      "score": 3,
      "context": [
        {
          "id": "ml8arig",
          "author": "Delicious_Impress818",
          "body": "mexican food! I’ve seen a lot of ARFID folks say they don’t like it but it’s a fav of mine",
          "created_utc": 1743699911.0
        }
      ]
    },
    {
      "id": "mlzdczr",
      "author": "AtomicMissy",
      "body": "Broccoli tossed in evo oil with salt, Italian herbs, and garlic; then roasted till crispy ends 🤤 I don't eat many veggies but I could eat my body weight in roasted broccoli 😂",
      "created_utc": 1744085588.0,
      "score": 3,
      "context": [
        {
          "id": "ml8vjl2",
          "author": "kaki024",
          "body": "I love broccoli. Fresh, steamed, frozen, sauced, plain. It’s been a safe food since childhood 🥦🥦🥦",
          "created_utc": 1743706001.0
        }
      ]
    },
    {
      "id": "mlf3ks2",
      "author": "Delicious_Impress818",
      "body": "broccoli is my fav veggie it’s so yummy",
      "created_utc": 1743792289.0,
      "score": 2,
      "context": [
        {
          "id": "ml8vjl2",
          "author": "kaki024",
          "body": "I love broccoli. Fresh, steamed, frozen, sauced, plain. It’s been a safe food since childhood 🥦🥦🥦",
          "created_utc": 1743706001.0
        }
      ]
    },
    {
      "id": "ml8mse6",
      "author": "okthissucksss",
      "body": "I feel seen right here. I get a tuna Subway so often that I’m kinda embarrassed about it 😆",
      "created_utc": 1743703391.0,
      "score": 4,
      "context": [
        {
          "id": "ml7u6l2",
          "author": "kfilks",
          "body": "Tuna from Subway",
          "created_utc": 1743695014.0
        }
      ]
    },
    {
      "id": "mlpwbzw",
      "author": "smikkk",
      "body": "I have a box of the spinach littles kind in my freezer that i’m going to try soon! hopefully i like it bc i’ve been struggling with very little safe foods lately",
      "created_utc": 1743956199.0,
      "score": 1,
      "context": [
        {
          "id": "mlb62gv",
          "author": "Zimsgirlfriend",
          "body": "Vegetarian nuggets,most people think they are weird or bad but I honestly really like them to the point of that's all I literally live off of pretty much besides milk too. 🥛🦖",
          "created_utc": 1743733693.0
        }
      ]
    },
    {
      "id": "mlewb25",
      "author": "swingingmydongaround",
      "body": "Pesto Cavatappi from Noodles and company 😌",
      "created_utc": 1743790068.0,
      "score": 1,
      "context": [
        {
          "id": "ml72vnt",
          "author": "dioor",
          "body": "I really like a couple specific brands of egg rolls that I’ve been able to find in grocery stores (the frozen ones you cook in the oven) though I don’t think it’s a food I’m adventurous enough to try if I can’t overcook it myself. \n\nI also love pesto on pasta, even though that’s something I’ve heard a lot of normal eaters call gross.",
          "created_utc": 1743686619.0
        }
      ]
    },
    {
      "id": "mlbhaup",
      "author": "Lizziclesayshi",
      "body": "Sounds like your food bill has been high lately! Well, if you're in the US, anyway.",
      "created_utc": 1743738324.0,
      "score": 1,
      "context": [
        {
          "id": "mlb4bqb",
          "author": "CuckooSpit_06",
          "body": "Eggs. I've heard many people with ARFID are disgusted by eggs but I eat them almost every day. Fried, boiled, in salads, sandwiches, in cottage cheese. They can be as bland or exciting as you want them to be.",
          "created_utc": 1743733030.0
        }
      ]
    },
    {
      "id": "ml8otce",
      "author": "Avalanche_Snow",
      "body": "Sameeee",
      "created_utc": 1743703989.0,
      "score": 5,
      "context": [
        {
          "id": "ml75k38",
          "author": "Familiar_Drawer_703",
          "body": "I like almost all fruits and veggies! I've noticed that is kinda rare for ARFID.\n\nI just HATE meats, cheese and eat mostly bland foods. It's so freaking hard to get enough calories as an almost vegan. 🥲",
          "created_utc": 1743687536.0
        },
        {
          "id": "ml7jruq",
          "author": "MyMindIsAHellscape",
          "body": "I wish I could trade. I’m a healthy weight but my diet is so bland and unhealthy.",
          "created_utc": 1743691956.0
        }
      ]
    },
    {
      "id": "mlba65a",
      "author": "ZWiloh",
      "body": "It's funny, I realized recently that the thing stopping me from trying most fruits is that I am totally unused to them and have no idea what to expect as far as texture. Like I enjoy a good blueberry muffin, but when there are still whole or mostly whole blueberries I get grossed out by the texture, so I worry about trying others.",
      "created_utc": 1743735313.0,
      "score": 8,
      "context": [
        {
          "id": "ml75k38",
          "author": "Familiar_Drawer_703",
          "body": "I like almost all fruits and veggies! I've noticed that is kinda rare for ARFID.\n\nI just HATE meats, cheese and eat mostly bland foods. It's so freaking hard to get enough calories as an almost vegan. 🥲",
          "created_utc": 1743687536.0
        },
        {
          "id": "ml7t6ce",
          "author": "___disaster___",
          "body": "same! fruit and vegetables are v predictable in taste",
          "created_utc": 1743694722.0
        }
      ]
    },
    {
      "id": "mlziy0e",
      "author": "Itscatpicstime",
      "body": "That’s crazy, one of the main reasons I hate fruit is because of how utterly inconsistent it is to me.",
      "created_utc": 1744088361.0,
      "score": 2,
      "context": [
        {
          "id": "ml75k38",
          "author": "Familiar_Drawer_703",
          "body": "I like almost all fruits and veggies! I've noticed that is kinda rare for ARFID.\n\nI just HATE meats, cheese and eat mostly bland foods. It's so freaking hard to get enough calories as an almost vegan. 🥲",
          "created_utc": 1743687536.0
        },
        {
          "id": "ml7t6ce",
          "author": "___disaster___",
          "body": "same! fruit and vegetables are v predictable in taste",
          "created_utc": 1743694722.0
        }
      ]
    },
    {
      "id": "mldv823",
      "author": "fifibunkin",
      "body": "I didn’t know what it was when I ordered it the first time. It was in a puff pastry which I like and I can’t remember what I thought it was so I ate it and I really like it and then my parents looked at each other laughing my mom said “do you know what that was?” And then she told me it was snails. Well it was too late to be upset about it because I really did like it so now I order it ever time.",
      "created_utc": 1743778975.0,
      "score": 6,
      "context": [
        {
          "id": "ml70j86",
          "author": "fifibunkin",
          "body": "Escargot. I always get it in France in Epcot Disney World. I really like it.",
          "created_utc": 1743685794.0
        },
        {
          "id": "mlduqfj",
          "author": "narcoed",
          "body": "This might be the craziest one on here",
          "created_utc": 1743778829.0
        }
      ]
    },
    {
      "id": "ml8efkb",
      "author": "grudgby",
      "body": "I just eat it plain with a spoon (I am sorry if thats upsetting to anyone here)",
      "created_utc": 1743700982.0,
      "score": 10,
      "context": [
        {
          "id": "ml759ka",
          "author": "grudgby",
          "body": "I was gonna say cottage cheese too! Lmao there are at least 2 of us",
          "created_utc": 1743687438.0
        },
        {
          "id": "ml80sfm",
          "author": "PlagueDoc1348",
          "body": "I love cottage cheese with plain potato chips and some sea salt!",
          "created_utc": 1743696973.0
        }
      ]
    },
    {
      "id": "ml8crce",
      "author": "Apprehensive_Suit940",
      "body": "No that’s so valid, I can see why cheese is such a difficult thing for others with arfid, it just isn’t for me for some reason and if I could I would only eat cheese for the rest of my life 😭",
      "created_utc": 1743700497.0,
      "score": 4,
      "context": [
        {
          "id": "ml7hpds",
          "author": "Apprehensive_Suit940",
          "body": "I’m a fan of literally all cheese, doesn’t matter what kind, I will always eat it no matter what mood I’m in",
          "created_utc": 1743691348.0
        },
        {
          "id": "ml7ket6",
          "author": "MyMindIsAHellscape",
          "body": "Everyone thinks I’m crazy because I don’t like cheese or chocolate very much and will only eat them in certain circumstances",
          "created_utc": 1743692139.0
        }
      ]
    },
    {
      "id": "mlf32km",
      "author": "Delicious_Impress818",
      "body": "omg I don’t like chocolate either everyone says I’m silly for it 😭",
      "created_utc": 1743792137.0,
      "score": 1,
      "context": [
        {
          "id": "ml7hpds",
          "author": "Apprehensive_Suit940",
          "body": "I’m a fan of literally all cheese, doesn’t matter what kind, I will always eat it no matter what mood I’m in",
          "created_utc": 1743691348.0
        },
        {
          "id": "ml7ket6",
          "author": "MyMindIsAHellscape",
          "body": "Everyone thinks I’m crazy because I don’t like cheese or chocolate very much and will only eat them in certain circumstances",
          "created_utc": 1743692139.0
        }
      ]
    },
    {
      "id": "ml8elu8",
      "author": "crown-jewel",
      "body": "Oh nooo I’m so sorry. I don’t know if you’ve had it, but I really like the frozen stouffer’s classic lasagna",
      "created_utc": 1743701032.0,
      "score": 3,
      "context": [
        {
          "id": "ml768ix",
          "author": "crown-jewel",
          "body": "Hamburger helper beef stroganoff is the one that always throws people, but I love it.",
          "created_utc": 1743687765.0
        },
        {
          "id": "ml87fif",
          "author": "SpaceKitten1704",
          "body": "Slightly off topic but I used to LOVE the orignal hamburger helper lasagna but they changed the recipe and I hate it now 😭 they made it more \"robust\" 🤣",
          "created_utc": 1743698938.0
        }
      ]
    },
    {
      "id": "mlgwbq2",
      "author": "lemurificspeckle",
      "body": "OMG my heart breaks for you!!!! I would be devastated if I suddenly couldn’t handle spice, like it’s one thing to have never had a tolerance but to have a high tolerance and love it and then lose it is just cruel! Though it’s better to have loved and lost than to have never loved at all I suppose 😭💔❤️‍🩹 I’ll be thinking of you and focusing on telepathically sending you spicy vibes next time I use my trusty cajun seasoning 🩷🩷🩷",
      "created_utc": 1743814205.0,
      "score": 2,
      "context": [
        {
          "id": "ml83d44",
          "author": "lemurificspeckle",
          "body": "People tend to be surprised that I LOVE spicy food. Adding spiciness can actually be a way to food chain for me, making trying something new more tolerable because at least there’s the spicy aspect that’s familiar and pleasant! \n\nI also tend to like some weirder taste combinations that other people might be disgusted by. Like, over the weekend I did a mini exposure where I tried a fancy fruit juice that had cayenne in it, and my friend thought it was gross but I was cool with it! And I loooooove dipping french fries in a frosty or some soft serve. Both of those examples seem pretty tame to me but some people look at me like I’m crazy when I say I like stuff like that, such a funny thing to experience as an ARFIDer!",
          "created_utc": 1743697734.0
        },
        {
          "id": "mlcvf1w",
          "author": "krankity-krab",
          "body": "this (spiciness) was always my way of getting myself to try new things.. but then i had my firstborn & my tastebuds changed & i can’t handle spicy at all anymore 😭 literally even the mild salsa is too hot for me now, it’s been over two years since and i’m still SO salty over the fact i lost my spice 🥺 \n\nso now i survive on french fries, chips, & fruit snacks…\n\nnow i’m pregnant again & worried how i’m going to get at least SOME healthy nutrients for the sake of baby… (at least pregnancy will take the nutrients out of my (osteopenic) bones for baby if i’m not providing them.. 🥲)\n\nplease enjoy some yummy spicy stuffs for meeee! ❤️‍🩹",
          "created_utc": 1743766240.0
        }
      ]
    },
    {
      "id": "mlf3ian",
      "author": "Delicious_Impress818",
      "body": "perfect link moment",
      "created_utc": 1743792267.0,
      "score": 2,
      "context": [
        {
          "id": "ml88k3x",
          "author": "Darth_Celeste",
          "body": "Also Caesar salad and french fries. This meal heals my soul, I don’t know how else to describe it lol. The salad feels hydrating and the fries are filling and salty but not so much so that it causes bloating or anything negative like that 🤌🏻🤌🏻🤌🏻it is the perfect safe and easily obtainable meal for me when I’m out and about",
          "created_utc": 1743699267.0
        },
        {
          "id": "ml8weh4",
          "author": "kaki024",
          "body": "https://imgur.com/a/bQZnQiZ",
          "created_utc": 1743706254.0
        }
      ]
    },
    {
      "id": "mm3j9ap",
      "author": "Delicious_Impress818",
      "body": "yessss tortilla chips are elite!",
      "created_utc": 1744144567.0,
      "score": 1,
      "context": [
        {
          "id": "ml8arig",
          "author": "Delicious_Impress818",
          "body": "mexican food! I’ve seen a lot of ARFID folks say they don’t like it but it’s a fav of mine",
          "created_utc": 1743699911.0
        },
        {
          "id": "mm3huwv",
          "author": "Civil-Law529",
          "body": "Yes! I love mexican food because tortilla chips are one of my safe foods!!",
          "created_utc": 1744144190.0
        }
      ]
    },
    {
      "id": "mm18cn3",
      "author": "kaki024",
      "body": "Yes!!! So tasty. I really love when they tempura fry it too- especially with just a light batter.",
      "created_utc": 1744120180.0,
      "score": 2,
      "context": [
        {
          "id": "ml8vjl2",
          "author": "kaki024",
          "body": "I love broccoli. Fresh, steamed, frozen, sauced, plain. It’s been a safe food since childhood 🥦🥦🥦",
          "created_utc": 1743706001.0
        },
        {
          "id": "mlzdczr",
          "author": "AtomicMissy",
          "body": "Broccoli tossed in evo oil with salt, Italian herbs, and garlic; then roasted till crispy ends 🤤 I don't eat many veggies but I could eat my body weight in roasted broccoli 😂",
          "created_utc": 1744085588.0
        }
      ]
    },
    {
      "id": "ml8s158",
      "author": "kfilks",
      "body": "lmao my Subway lady calls me tuna girl 💀 and says she always knows it is me and I swear she gives me a little extra since I'm just getting tuna and bread",
      "created_utc": 1743704949.0,
      "score": 8,
      "context": [
        {
          "id": "ml7u6l2",
          "author": "kfilks",
          "body": "Tuna from Subway",
          "created_utc": 1743695014.0
        },
        {
          "id": "ml8mse6",
          "author": "okthissucksss",
          "body": "I feel seen right here. I get a tuna Subway so often that I’m kinda embarrassed about it 😆",
          "created_utc": 1743703391.0
        }
      ]
    },
    {
      "id": "mlbozg2",
      "author": "CuckooSpit_06",
      "body": "Nope. In the uk. I heard there's like an egg crisis going on over there or something?",
      "created_utc": 1743741891.0,
      "score": 2,
      "context": [
        {
          "id": "mlb4bqb",
          "author": "CuckooSpit_06",
          "body": "Eggs. I've heard many people with ARFID are disgusted by eggs but I eat them almost every day. Fried, boiled, in salads, sandwiches, in cottage cheese. They can be as bland or exciting as you want them to be.",
          "created_utc": 1743733030.0
        },
        {
          "id": "mlbhaup",
          "author": "Lizziclesayshi",
          "body": "Sounds like your food bill has been high lately! Well, if you're in the US, anyway.",
          "created_utc": 1743738324.0
        }
      ]
    },
    {
      "id": "mlc2y5g",
      "author": "___disaster___",
      "body": "well, i don't like fruit in any pastry or inside cakes etc either. they are different than fresh fruit and their texture is off, for the worse. what textures do you like? maybe i could recommend a fruit based on that.\n\nbut i get it completely. i tried a mango and lichi (however its spelled) in the past and they were so bad for me that im not willing to try any new fruit. those bad experiences tend to linger on longer and stronger than the good ones.",
      "created_utc": 1743749224.0,
      "score": 5,
      "context": [
        {
          "id": "ml75k38",
          "author": "Familiar_Drawer_703",
          "body": "I like almost all fruits and veggies! I've noticed that is kinda rare for ARFID.\n\nI just HATE meats, cheese and eat mostly bland foods. It's so freaking hard to get enough calories as an almost vegan. 🥲",
          "created_utc": 1743687536.0
        },
        {
          "id": "ml7t6ce",
          "author": "___disaster___",
          "body": "same! fruit and vegetables are v predictable in taste",
          "created_utc": 1743694722.0
        },
        {
          "id": "mlba65a",
          "author": "ZWiloh",
          "body": "It's funny, I realized recently that the thing stopping me from trying most fruits is that I am totally unused to them and have no idea what to expect as far as texture. Like I enjoy a good blueberry muffin, but when there are still whole or mostly whole blueberries I get grossed out by the texture, so I worry about trying others.",
          "created_utc": 1743735313.0
        }
      ]
    },
    {
      "id": "mlakggy",
      "author": "moonsthetic0",
      "body": "I love cottage cheese with a spoon!",
      "created_utc": 1743725555.0,
      "score": 1,
      "context": [
        {
          "id": "ml759ka",
          "author": "grudgby",
          "body": "I was gonna say cottage cheese too! Lmao there are at least 2 of us",
          "created_utc": 1743687438.0
        },
        {
          "id": "ml80sfm",
          "author": "PlagueDoc1348",
          "body": "I love cottage cheese with plain potato chips and some sea salt!",
          "created_utc": 1743696973.0
        },
        {
          "id": "ml8efkb",
          "author": "grudgby",
          "body": "I just eat it plain with a spoon (I am sorry if thats upsetting to anyone here)",
          "created_utc": 1743700982.0
        }
      ]
    },
    {
      "id": "mnoys1v",
      "author": "PlagueDoc1348",
      "body": "Same!",
      "created_utc": 1744941936.0,
      "score": 1,
      "context": [
        {
          "id": "ml759ka",
          "author": "grudgby",
          "body": "I was gonna say cottage cheese too! Lmao there are at least 2 of us",
          "created_utc": 1743687438.0
        },
        {
          "id": "ml80sfm",
          "author": "PlagueDoc1348",
          "body": "I love cottage cheese with plain potato chips and some sea salt!",
          "created_utc": 1743696973.0
        },
        {
          "id": "ml8efkb",
          "author": "grudgby",
          "body": "I just eat it plain with a spoon (I am sorry if thats upsetting to anyone here)",
          "created_utc": 1743700982.0
        }
      ]
    },
    {
      "id": "ml8gkn0",
      "author": "SpaceKitten1704",
      "body": "I will definitely have to try it, thank you!!",
      "created_utc": 1743701599.0,
      "score": 2,
      "context": [
        {
          "id": "ml768ix",
          "author": "crown-jewel",
          "body": "Hamburger helper beef stroganoff is the one that always throws people, but I love it.",
          "created_utc": 1743687765.0
        },
        {
          "id": "ml87fif",
          "author": "SpaceKitten1704",
          "body": "Slightly off topic but I used to LOVE the orignal hamburger helper lasagna but they changed the recipe and I hate it now 😭 they made it more \"robust\" 🤣",
          "created_utc": 1743698938.0
        },
        {
          "id": "ml8elu8",
          "author": "crown-jewel",
          "body": "Oh nooo I’m so sorry. I don’t know if you’ve had it, but I really like the frozen stouffer’s classic lasagna",
          "created_utc": 1743701032.0
        }
      ]
    },
    {
      "id": "mm3qpg4",
      "author": "Civil-Law529",
      "body": "Unfortunately now that I’m pregnant they are one of my food aversions. 😂😂 I’m hoping after I give birth that goes away",
      "created_utc": 1744146711.0,
      "score": 1,
      "context": [
        {
          "id": "ml8arig",
          "author": "Delicious_Impress818",
          "body": "mexican food! I’ve seen a lot of ARFID folks say they don’t like it but it’s a fav of mine",
          "created_utc": 1743699911.0
        },
        {
          "id": "mm3huwv",
          "author": "Civil-Law529",
          "body": "Yes! I love mexican food because tortilla chips are one of my safe foods!!",
          "created_utc": 1744144190.0
        },
        {
          "id": "mm3j9ap",
          "author": "Delicious_Impress818",
          "body": "yessss tortilla chips are elite!",
          "created_utc": 1744144567.0
        }
      ]
    },
    {
      "id": "mlf3e6j",
      "author": "Delicious_Impress818",
      "body": "that’s so cute 😭😭",
      "created_utc": 1743792233.0,
      "score": 1,
      "context": [
        {
          "id": "ml7u6l2",
          "author": "kfilks",
          "body": "Tuna from Subway",
          "created_utc": 1743695014.0
        },
        {
          "id": "ml8mse6",
          "author": "okthissucksss",
          "body": "I feel seen right here. I get a tuna Subway so often that I’m kinda embarrassed about it 😆",
          "created_utc": 1743703391.0
        },
        {
          "id": "ml8s158",
          "author": "kfilks",
          "body": "lmao my Subway lady calls me tuna girl 💀 and says she always knows it is me and I swear she gives me a little extra since I'm just getting tuna and bread",
          "created_utc": 1743704949.0
        }
      ]
    },
    {
      "id": "mldg5bh",
      "author": "Lizziclesayshi",
      "body": "Yes! With avian flu about, if they find one bird has it, they're taking out the entire flock. So if you have 10,000 birds on the property, and one is found to have it.... you get the idea. That's making eggs much more scarce, and much more expensive!",
      "created_utc": 1743774301.0,
      "score": 2,
      "context": [
        {
          "id": "mlb4bqb",
          "author": "CuckooSpit_06",
          "body": "Eggs. I've heard many people with ARFID are disgusted by eggs but I eat them almost every day. Fried, boiled, in salads, sandwiches, in cottage cheese. They can be as bland or exciting as you want them to be.",
          "created_utc": 1743733030.0
        },
        {
          "id": "mlbhaup",
          "author": "Lizziclesayshi",
          "body": "Sounds like your food bill has been high lately! Well, if you're in the US, anyway.",
          "created_utc": 1743738324.0
        },
        {
          "id": "mlbozg2",
          "author": "CuckooSpit_06",
          "body": "Nope. In the uk. I heard there's like an egg crisis going on over there or something?",
          "created_utc": 1743741891.0
        }
      ]
    },
    {
      "id": "ml8kjny",
      "author": "crown-jewel",
      "body": "Of course! I hope it works for you!",
      "created_utc": 1743702746.0,
      "score": 1,
      "context": [
        {
          "id": "ml768ix",
          "author": "crown-jewel",
          "body": "Hamburger helper beef stroganoff is the one that always throws people, but I love it.",
          "created_utc": 1743687765.0
        },
        {
          "id": "ml87fif",
          "author": "SpaceKitten1704",
          "body": "Slightly off topic but I used to LOVE the orignal hamburger helper lasagna but they changed the recipe and I hate it now 😭 they made it more \"robust\" 🤣",
          "created_utc": 1743698938.0
        },
        {
          "id": "ml8elu8",
          "author": "crown-jewel",
          "body": "Oh nooo I’m so sorry. I don’t know if you’ve had it, but I really like the frozen stouffer’s classic lasagna",
          "created_utc": 1743701032.0
        },
        {
          "id": "ml8gkn0",
          "author": "SpaceKitten1704",
          "body": "I will definitely have to try it, thank you!!",
          "created_utc": 1743701599.0
        }
      ]
    },
    {
      "id": "mle58tn",
      "author": "CuckooSpit_06",
      "body": "Jesus that sounds like a nightmare. Would help if they vaccinated their chickens over there. That's also why eggs need refrigerated.",
      "created_utc": 1743781961.0,
      "score": 2,
      "context": [
        {
          "id": "mlb4bqb",
          "author": "CuckooSpit_06",
          "body": "Eggs. I've heard many people with ARFID are disgusted by eggs but I eat them almost every day. Fried, boiled, in salads, sandwiches, in cottage cheese. They can be as bland or exciting as you want them to be.",
          "created_utc": 1743733030.0
        },
        {
          "id": "mlbhaup",
          "author": "Lizziclesayshi",
          "body": "Sounds like your food bill has been high lately! Well, if you're in the US, anyway.",
          "created_utc": 1743738324.0
        },
        {
          "id": "mlbozg2",
          "author": "CuckooSpit_06",
          "body": "Nope. In the uk. I heard there's like an egg crisis going on over there or something?",
          "created_utc": 1743741891.0
        },
        {
          "id": "mldg5bh",
          "author": "Lizziclesayshi",
          "body": "Yes! With avian flu about, if they find one bird has it, they're taking out the entire flock. So if you have 10,000 birds on the property, and one is found to have it.... you get the idea. That's making eggs much more scarce, and much more expensive!",
          "created_utc": 1743774301.0
        }
      ]
    },
    {
      "id": "ml8lgsz",
      "author": "SpaceKitten1704",
      "body": "Thank you :)))",
      "created_utc": 1743703009.0,
      "score": 2,
      "context": [
        {
          "id": "ml768ix",
          "author": "crown-jewel",
          "body": "Hamburger helper beef stroganoff is the one that always throws people, but I love it.",
          "created_utc": 1743687765.0
        },
        {
          "id": "ml87fif",
          "author": "SpaceKitten1704",
          "body": "Slightly off topic but I used to LOVE the orignal hamburger helper lasagna but they changed the recipe and I hate it now 😭 they made it more \"robust\" 🤣",
          "created_utc": 1743698938.0
        },
        {
          "id": "ml8elu8",
          "author": "crown-jewel",
          "body": "Oh nooo I’m so sorry. I don’t know if you’ve had it, but I really like the frozen stouffer’s classic lasagna",
          "created_utc": 1743701032.0
        },
        {
          "id": "ml8gkn0",
          "author": "SpaceKitten1704",
          "body": "I will definitely have to try it, thank you!!",
          "created_utc": 1743701599.0
        },
        {
          "id": "ml8kjny",
          "author": "crown-jewel",
          "body": "Of course! I hope it works for you!",
          "created_utc": 1743702746.0
        }
      ]
    }
  ]
}