{
  "id": "1jt8ct3",
  "subreddit": "ARFID",
  "author": "himydandelion",
  "created_utc": 1743984694.0,
  "title": "PSA, re: \"free\" ARFID Support Call This Week",
  "selftext": "Hi r/ARFID! \n\nWe just wanted to make a quick post giving people a heads up about a post you may have seen last week. The post was by a user, u/fairy-girly-222, who professes to be a dietician passionate about ARFID. She wanted to host a virtual support group for ARFID. The original post, which she took down, was located here: [https://www.reddit.com/r/ARFID/comments/1joxim7/free\\_arfid\\_support\\_call\\_next\\_week\\_exclusive/](https://www.reddit.com/r/ARFID/comments/1joxim7/free_arfid_support_call_next_week_exclusive/)\n\nWe had several users reach out to us concerned that this was some sort of scam or marketing pitch. Mods have attempted to reach out to the user to verify her credentials and intentions from this group, but we have not received a response even though she did continue posting in the subreddit. \n\nBased on our research, we believe the community should be aware of the following before attending this support group, scheduled for this Wednesday night: \n\n1. This user has a past affiliation with a Multi-Level Marketing Company, Beachbody. After we called her on it, that mysteriously disappeared from her LinkedIn history. \n\n2. This user has not answered mod and user questions about credentials, nor did they specify whether this \"free\" support call might lead to a paid community advertisement. When users began to comment these questions on her original post, she deleted the post altogether. Mods have also reached out individually multiple times.  \n\n3. We were able to located this user's website: [https://www.sozoholisticnutrition.com/about](https://www.sozoholisticnutrition.com/about)   \nIt does appear that the advertised \"free\" call on Wednesday is a first step to a paid, monthly subscription service. Had this been disclosed in the original post, we may not have had a problem-- it's the fact that pretty valid questions have been dodged rather than answered that is concerning to us. It seems that this call for participants was intentionally hiding the potential for a paid subscription later on ($23/month for generalized support group call). \n\n  \nWe VERY MUCH hope this provider is legitimate and could really make a difference for members of our community, and we still invite the user to respond to mod questions about their credentials and intentions in commenting in this subreddit. But until we have that confirmation, we felt it would be irresponsible NOT to post this information given the attention the original post received last week.   \n  \nWe feel that a genuine professional would not have a problem answering the questions posed by the community and mods, and we really hope to get more information about this user soon. Obviously, we'd love to have people in the community who are genuinely willing and able to help, but we also can't ignore these red flags! Mods intend to post additional info and screenshots that gave us pause in the comments. \n\n**Long story short-- if you are intending to go to the virtual support group on Wednesday, proceed with caution!** It's entirely up to you what you decide. We as a mod team are not here to make any decisions for you....we want all of you to have the opportunity to make an informed decision about your care which is why we wanted to ensure this information was available to you all! \n\nEDIT TO ADD: I want to make it clear that mods are still trying to collect information about this, so please do comment or send us modmail if you have any details about this user, her practice, the call, etc. \n\nUPDATE, posted Saturday April 12th:\n\nSorry this took a few days!!\nWanted to give an  update on this week’s previously advertised support group call. I attended to see what the call would really be like. I’m going to try to be objective as possible and leave my opinion for the end– ultimately, EVERYONE is free to make whatever decision they want with this information. I’m not here to drive anyone away from something that could potentially help them. Our job as mods is to make sure everyone is adequately informed! \n\nBrief summary of the call: \nExplained what ARFID was, how it impacts people, etc \nBriefly discussed various ways ARFID is treated \nExplained her vision for an ARFID support group led by a clinician\nIntroduced an app community she built via an app called “Circle.” The group requires a subscription of $23 a month and is essentially a Discord support group led by her. She said she is trying to get therapists and other professionals involved, but does not have anyone but herself at this time. The subscription also includes a monthly support call with her. \n\nThe Zoom call did not leave enough time for questions (had a 40m limit) until I asked if she might be able to restart it so that we could ask some questions. Myself and another user asked about the price tag and her qualifications, trying to discern the reason for the monthly subscription. She explained that the subscription cost was because normally as a clinician, she charges upwards of $5500 for services, and she has a waitlist. From my understanding, the app is her way of trying to reach people who might be ON a treatment waitlist in a more casual Discord-like setting. I also let her know that I was a mod on the subreddit and that we were still awaiting responses from her. \n\nSo here’s a brief summary of my take, and I welcome other mods + users who attended to add their details/opinions as well so it’s not JUST my opinion. \n\nAs someone WITH ARFID who has had years of professional ongoing treatment, I do not feel confident that this individual is qualified to charge this much for the services she is offering– especially at the costs she is advertising. \nHer original post advertised this call as a SUPPORT GROUP CALL. It was, quite simply, a sales pitch. There’s really no other way to put it. It was not a support call. It was all about what she knew about ARFID leading into her proposal for users to join this monthly subscription support group. She even offered a 10% off code. Doesn’t get more sales pitch than that. \nShe “did not appreciate” me asking about her Reddit activity on the call (her words). I tried to do so in the least disruptive way possible— it was the very end, and at that point, there were only 3 people left (two of which I knew were other Reddit members like y’all). I asked if she had seen mod messages because we were concerned about some red flags with her posting. She still seemed resistant to answering questions and saw her Reddit post and comment history as irrelevant to the discussion. I encouraged her to respond to us. Instead, she deleted her account within 24 hours. \n\nThe fact that this was advertised as a support group and ended up being a sales pitch does not sit right with me as a user OR a moderator. Probably should go without saying, but sales pitches are not welcome here in r/ARFID, and the fact that this one was disguised makes me feel even more uneasy.  \n\nThis user was banned from the subreddit for self-promotion (and if anyone sees her pop up on a new account, tell mods immediately). However, she may advertise this app elsewhere. I do hope that it’ll be meaningful and helpful for anyone who uses it, but I encourage you to do some research, read through this thread, and make an informed decision that works for you and your loved ones. \n\nThe only other thing that I’d like to point out is that we have a Discord Support Group already set up. There are multiple out there, in fact– one is run by the same moderators of this subreddit and it is a multi-chat format with different areas to discuss anything– much like the app being advertised. Obviously, our Discord group is free, and will remain free. Though none of us profess to be any kind of medical professionals, the group is always a FREE option for anyone seeking this type of space– especially if the subscription does not feel realistic for you. \n\nI leave this thread open for any other attendees, mods, etc to comment as needed– this is an open discussion, and again, I’m not here to tell anyone what to do!! Please feel free to comment or message with any questions you have.\n\nTL;DR— “support” group call was indeed a sales pitch. User in question was given MULTIPLE opportunities to prove legitimacy— including me asking her directly on the advertised call. She went out of her way to dodge doing so and deleted her account. That tells me all I need to know. I am really doubtful that her intentions are good, but even if they are, her qualifications and knowledge of ARFID seems lacking. \n\nPersonally, if I choose to spend that much money on a treatment provider, I’ll be choosing someone who acts more ethically, professionally, and qualified. \n\n",
  "url": "https://www.reddit.com/r/ARFID/comments/1jt8ct3/psa_re_free_arfid_support_call_this_week/",
  "score": 141,
  "num_comments": 21,
  "comments": [
    {
      "id": "mmr477a",
      "author": "himydandelion",
      "body": "UPDATE POSTED to original post. \n\n**TL;DR— “support” group call was indeed a sales pitch. User in question was given MULTIPLE opportunities to prove legitimacy— including me asking her directly on the advertised call. She went out of her way to dodge doing so and deleted her account. That tells me all I need to know. I am really doubtful that her intentions are good, but even if they are, her qualifications and knowledge of ARFID seems lacking.** \n\n  \nNext steps I'm going to be working on with my mod team.....  \n1. writing CLEAR rules for if individuals claiming to be clinicians or treatment providers want to participate here  \n2. working more to update and expand the existing treatment provider database-- adding a new space to include advisories about situations like these",
      "created_utc": 1744474385.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mlsewsc",
      "author": "Longjumping-Use7830",
      "body": "https://preview.redd.it/dbz41f6m6bte1.jpeg?width=2358&format=pjpg&auto=webp&s=ed87d3a58b6e7002c7a626b8fb722b618f66eeea\n\nAnd in case you WERE somehow interested in her 1-on-1 16 week program, please be aware that it'll likely cost you almost ten grand (she doesn't take insurance) and if you don't have that much to spare, she thinks it's because YOU don't care about INVESTING in your HEALTH. And she makes that plenty clear in the application. Stay safe, guys.",
      "created_utc": 1743986596.0,
      "score": 71,
      "context": []
    },
    {
      "id": "mltaw5c",
      "author": "JustPaula",
      "body": "I'm glad this PSA was made. In my opinion, had Haley just been honest in the first place, this could have gone over better. \n\nHaley blocked me for asking questions, which I feel is odd. Its especially odd since they were about her credentials, experience with ARFID, and whether or not there would be an app or have a cost. It's not a good start.",
      "created_utc": 1743999980.0,
      "score": 41,
      "context": []
    },
    {
      "id": "mlv1yav",
      "author": "ceciliabee",
      "body": "MLM affiliated person trying to scam a vulnerable group, what a surprise. Thanks for diving into this, mods, everyone here is safer for it.\n\nTo the MLM community member: your lack of shame is paralleled only by your lack of integrity. May no one prey on you the way you tried to prey on the people here. Do something good with your love. Give your parents something to brag about to their friends for once in your life.",
      "created_utc": 1744033637.0,
      "score": 25,
      "context": []
    },
    {
      "id": "mlvpsle",
      "author": "angeltay",
      "body": "Good catch to the users who saw something weird and were correct! And good work to the mods who figured her out!",
      "created_utc": 1744041089.0,
      "score": 11,
      "context": []
    },
    {
      "id": "mluaype",
      "author": "Taxouck",
      "body": "Yeah, so like, can we just call a scam a scam? No need to pussyfoot around language like that. If you're scared of being sued then whatever I'll do it for you, but there's really no need for those \"may\"s and \"might\"s.",
      "created_utc": 1744021849.0,
      "score": 23,
      "context": []
    },
    {
      "id": "mm5o9i5",
      "author": "Martian_Space_Duck",
      "body": "I'm glad this was made to let us all know. It's kind of disappointing that they would hide that kind of information. And could have possibly tricked a lot of people into paying for a service they thought was going to be free.",
      "created_utc": 1744171241.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mm892xg",
      "author": "FlemFatale",
      "body": "What the actual shit, and what an absolute scumbag you must have to be to say that people \"...can't invest in their health...\" if they don't have a large amount of disposable income every month.  \n  \nWell done for catching it Mods, and I will definitely be reading the rest of this saga.  \n  \nIt makes me even more angry because if something like this happened in my country, I would jump on it, as there isn't any ARFID treatment for adults in my area (but my GP is fighting the commissioners, so that's good), and then ended up getting scammed out of money that I can't afford to lose.",
      "created_utc": 1744213431.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mmc6rqe",
      "author": "himydandelion",
      "body": "Brief update for anyone still upset or anxious about this. \n\nAttended the call tonight, asked questions, took notes. Will organize and share details in the next few days!! Will keep posting to this same thread so that everyone can follow easily. \n\nI’m also happy to answer any questions yall have…….once I’m awake and less migrained.",
      "created_utc": 1744260067.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mpht7s1",
      "author": "Puzzleheaded_Guide97",
      "body": "Thank you so much for the investigation and all the effort!! I was one that gave her permission to private message me for more info about this call \n\nThankfully I was just too busy to engage with any of it\n\n\ngood reminder to be cautious and know that I'm in a vulnerable group that can be targeted",
      "created_utc": 1745853063.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mlsm03i",
      "author": "Hanhula",
      "body": "1.5k a month?! Bloody Nora!",
      "created_utc": 1743989369.0,
      "score": 31,
      "context": [
        {
          "id": "mlsewsc",
          "author": "Longjumping-Use7830",
          "body": "https://preview.redd.it/dbz41f6m6bte1.jpeg?width=2358&format=pjpg&auto=webp&s=ed87d3a58b6e7002c7a626b8fb722b618f66eeea\n\nAnd in case you WERE somehow interested in her 1-on-1 16 week program, please be aware that it'll likely cost you almost ten grand (she doesn't take insurance) and if you don't have that much to spare, she thinks it's because YOU don't care about INVESTING in your HEALTH. And she makes that plenty clear in the application. Stay safe, guys.",
          "created_utc": 1743986596.0
        }
      ]
    },
    {
      "id": "mlxz4ut",
      "author": "Additional_Bread_861",
      "body": "This questionnaire is so gross. “I don’t have resources to invest in my health”\n\nWhat a guilt-inducing, gross way to perceive those who need assistance. Might as well say “I’m too broke to want to change”. And the only reason they ask isn’t to give assistance, it’s to weed out folks who can’t afford or borrow enough. \n\nThis is simply predatory and so gross.",
      "created_utc": 1744066649.0,
      "score": 19,
      "context": [
        {
          "id": "mlsewsc",
          "author": "Longjumping-Use7830",
          "body": "https://preview.redd.it/dbz41f6m6bte1.jpeg?width=2358&format=pjpg&auto=webp&s=ed87d3a58b6e7002c7a626b8fb722b618f66eeea\n\nAnd in case you WERE somehow interested in her 1-on-1 16 week program, please be aware that it'll likely cost you almost ten grand (she doesn't take insurance) and if you don't have that much to spare, she thinks it's because YOU don't care about INVESTING in your HEALTH. And she makes that plenty clear in the application. Stay safe, guys.",
          "created_utc": 1743986596.0
        }
      ]
    },
    {
      "id": "mmhrqmn",
      "author": "BunSwirly",
      "body": "No insurance is crazy.",
      "created_utc": 1744335767.0,
      "score": 1,
      "context": [
        {
          "id": "mlsewsc",
          "author": "Longjumping-Use7830",
          "body": "https://preview.redd.it/dbz41f6m6bte1.jpeg?width=2358&format=pjpg&auto=webp&s=ed87d3a58b6e7002c7a626b8fb722b618f66eeea\n\nAnd in case you WERE somehow interested in her 1-on-1 16 week program, please be aware that it'll likely cost you almost ten grand (she doesn't take insurance) and if you don't have that much to spare, she thinks it's because YOU don't care about INVESTING in your HEALTH. And she makes that plenty clear in the application. Stay safe, guys.",
          "created_utc": 1743986596.0
        }
      ]
    },
    {
      "id": "mlxzjun",
      "author": "Additional_Bread_861",
      "body": "I was also blocked for asking questions which was a HUGE red flag to begin with. A professional would be willing to describe their program— they’d be proud of their hard work developing it. \n\nShe was sneaky from the beginning, from withholding the name of her program to blocking those seeking more information. \n\nThere are a lot of folks in this group who will be on this call because of the post she made. I’m hoping they don’t get conned. But likely at least one will.",
      "created_utc": 1744066788.0,
      "score": 12,
      "context": [
        {
          "id": "mltaw5c",
          "author": "JustPaula",
          "body": "I'm glad this PSA was made. In my opinion, had Haley just been honest in the first place, this could have gone over better. \n\nHaley blocked me for asking questions, which I feel is odd. Its especially odd since they were about her credentials, experience with ARFID, and whether or not there would be an app or have a cost. It's not a good start.",
          "created_utc": 1743999980.0
        }
      ]
    },
    {
      "id": "mlvq7cr",
      "author": "abitbuzzed",
      "body": "Well said! \n\n>May no one prey on you the way you tried to prey on the people here. \n\nThis is my only point of disagreement. I think she absolutely deserves to experience what she tried to trick others into here. I think that would be an excellent way for her to learn how to be a decent human being.",
      "created_utc": 1744041214.0,
      "score": 8,
      "context": [
        {
          "id": "mlv1yav",
          "author": "ceciliabee",
          "body": "MLM affiliated person trying to scam a vulnerable group, what a surprise. Thanks for diving into this, mods, everyone here is safer for it.\n\nTo the MLM community member: your lack of shame is paralleled only by your lack of integrity. May no one prey on you the way you tried to prey on the people here. Do something good with your love. Give your parents something to brag about to their friends for once in your life.",
          "created_utc": 1744033637.0
        }
      ]
    },
    {
      "id": "mlw3pme",
      "author": "himydandelion",
      "body": "This is a fair criticism! \n\nFrom my perspective— I was trying to remain ✨professional ✨and unbiased and didn’t want to come across as making the decision for anyone. For all I know, one of you is actually a patient of hers and we’re entirely off base here…..at least that’s what I was hoping, that we were totally wrong here. I was also hoping we’d get more information after this post so that I could say for CERTAIN what we’ve found here rather than just guessing, but so far all we’ve got is a confirmation she does have an active CNS license, which doesn’t confirm her experience or intentions. \n\nWe’ve been accused of being “anti treatment” and stuff in the past, so I try to just state facts and keep my own potential bias out of it— especially cause we’re not experts and thus COULD always be wrong……that said, the longer we go without a response from her the more it confirms my original suspicions that this person is predatory. So at this point I don’t think we ARE wrong, unfortunately. \n\n(I also have had a migraine for like 4 straight days. so I may have overcorrected when revising and trying to keep the post professional…….so I apologize!)",
      "created_utc": 1744045376.0,
      "score": 11,
      "context": [
        {
          "id": "mluaype",
          "author": "Taxouck",
          "body": "Yeah, so like, can we just call a scam a scam? No need to pussyfoot around language like that. If you're scared of being sued then whatever I'll do it for you, but there's really no need for those \"may\"s and \"might\"s.",
          "created_utc": 1744021849.0
        }
      ]
    },
    {
      "id": "mlw5kfo",
      "author": "joshb44231",
      "body": "We aren’t scared of being sued. We’re using this language because if someone wants to do this, it’s ultimately up to them. \n\nWe don’t force our members to do something or not do something because we think a certain way. The wording you used was very weird and low-key demeaning.\n\n\nAdding to this, like u/himydandelion said, we’ve been accused of being anti-treatment in the past. So if we outright said this is a scam people could give us shit for being “anti-treatment”",
      "created_utc": 1744045945.0,
      "score": 9,
      "context": [
        {
          "id": "mluaype",
          "author": "Taxouck",
          "body": "Yeah, so like, can we just call a scam a scam? No need to pussyfoot around language like that. If you're scared of being sued then whatever I'll do it for you, but there's really no need for those \"may\"s and \"might\"s.",
          "created_utc": 1744021849.0
        }
      ]
    },
    {
      "id": "mlvrauw",
      "author": "abitbuzzed",
      "body": "Yeah, this needs to be higher. Mods, I would encourage you to call a spade a spade, especially given the additional evidence posted in these comments (such as the $10k financial commitment). \n\nThis woman pretty clearly does not have good intentions. No one who has empathy and understands eating disorders says in their intake paperwork that if you don't have $10k to blow on their garbage program, it means you're not \"invested\" in recovery. She just wants you to \"invest\" in her shitty new scam. \n\nHaley, you should be fucking ashamed of yourself. I know you probably aren't, given your \"work\" history. But maybe one day you'll get your head out of your ass. Who knows. Stranger things have happened. 🙄",
      "created_utc": 1744041549.0,
      "score": 5,
      "context": [
        {
          "id": "mluaype",
          "author": "Taxouck",
          "body": "Yeah, so like, can we just call a scam a scam? No need to pussyfoot around language like that. If you're scared of being sued then whatever I'll do it for you, but there's really no need for those \"may\"s and \"might\"s.",
          "created_utc": 1744021849.0
        }
      ]
    },
    {
      "id": "mm5su2c",
      "author": "himydandelion",
      "body": "I won’t get into the details but we (mods) are working behind the scenes to make sure that doesn’t happen….we are not just going to passively let this go. \n\nPlease do spread the word if you know of anyone who may have seen the post! She has put the call out on Facebook as well so it’s possible it’s on other social media. I intend to use this thread to update with more information as we collect it, so stay tuned here if you are interested in seeing where this goes.\n\nOH, forgot to add, the user in question was banned several days ago but if anyone sees anything suspicious from other accounts PLEASE let us know right away.",
      "created_utc": 1744173355.0,
      "score": 5,
      "context": [
        {
          "id": "mm5o9i5",
          "author": "Martian_Space_Duck",
          "body": "I'm glad this was made to let us all know. It's kind of disappointing that they would hide that kind of information. And could have possibly tricked a lot of people into paying for a service they thought was going to be free.",
          "created_utc": 1744171241.0
        }
      ]
    },
    {
      "id": "mly6pcb",
      "author": "himydandelion",
      "body": "And she doesn’t take insurance which just makes it even worse. The way it’s worded almost is like she’s SHAMING people who don’t have that kind of money (which let’s be real, who DOES??)",
      "created_utc": 1744069254.0,
      "score": 11,
      "context": [
        {
          "id": "mlsewsc",
          "author": "Longjumping-Use7830",
          "body": "https://preview.redd.it/dbz41f6m6bte1.jpeg?width=2358&format=pjpg&auto=webp&s=ed87d3a58b6e7002c7a626b8fb722b618f66eeea\n\nAnd in case you WERE somehow interested in her 1-on-1 16 week program, please be aware that it'll likely cost you almost ten grand (she doesn't take insurance) and if you don't have that much to spare, she thinks it's because YOU don't care about INVESTING in your HEALTH. And she makes that plenty clear in the application. Stay safe, guys.",
          "created_utc": 1743986596.0
        },
        {
          "id": "mlxz4ut",
          "author": "Additional_Bread_861",
          "body": "This questionnaire is so gross. “I don’t have resources to invest in my health”\n\nWhat a guilt-inducing, gross way to perceive those who need assistance. Might as well say “I’m too broke to want to change”. And the only reason they ask isn’t to give assistance, it’s to weed out folks who can’t afford or borrow enough. \n\nThis is simply predatory and so gross.",
          "created_utc": 1744066649.0
        }
      ]
    },
    {
      "id": "mlw4m9x",
      "author": "himydandelion",
      "body": "(I’ll also note that we are hoping to learn more after this call on Wednesday….I was intending to update the post once we get confirmation of how it went down but we still wanted to have some advisory up in the meantime.)",
      "created_utc": 1744045654.0,
      "score": 5,
      "context": [
        {
          "id": "mluaype",
          "author": "Taxouck",
          "body": "Yeah, so like, can we just call a scam a scam? No need to pussyfoot around language like that. If you're scared of being sued then whatever I'll do it for you, but there's really no need for those \"may\"s and \"might\"s.",
          "created_utc": 1744021849.0
        },
        {
          "id": "mlw3pme",
          "author": "himydandelion",
          "body": "This is a fair criticism! \n\nFrom my perspective— I was trying to remain ✨professional ✨and unbiased and didn’t want to come across as making the decision for anyone. For all I know, one of you is actually a patient of hers and we’re entirely off base here…..at least that’s what I was hoping, that we were totally wrong here. I was also hoping we’d get more information after this post so that I could say for CERTAIN what we’ve found here rather than just guessing, but so far all we’ve got is a confirmation she does have an active CNS license, which doesn’t confirm her experience or intentions. \n\nWe’ve been accused of being “anti treatment” and stuff in the past, so I try to just state facts and keep my own potential bias out of it— especially cause we’re not experts and thus COULD always be wrong……that said, the longer we go without a response from her the more it confirms my original suspicions that this person is predatory. So at this point I don’t think we ARE wrong, unfortunately. \n\n(I also have had a migraine for like 4 straight days. so I may have overcorrected when revising and trying to keep the post professional…….so I apologize!)",
          "created_utc": 1744045376.0
        }
      ]
    }
  ]
}