{
  "id": "1jx9zrk",
  "subreddit": "ARFID",
  "author": "rlpsc",
  "created_utc": 1744435286.0,
  "title": "I guess carrots and apples are “unhealthy”, 🙄 but I don’t care 😎",
  "selftext": "Idk why but for some reason, whenever I finally find a fruit or vegetable that I enjoy and want to eat, or find a way to eat them that I enjoy, people around me have always gotta find a way to crap on my excitement and gaslight me into thinking literal fruits and vegetables aren’t healthy.\n\nMy two examples:\n\nSome years ago when I was in high school I discovered that i can not just tolerate but actually enjoy medium sized baby carrots by one particular brand (the organic store brand of a grocery store I don’t normally go to, the closer store’s brands/name brands are too soft). I was so excited by this discovery because my health teacher had been having nice side conversations with me (just for fun I enjoyed it) about healthy eating and saying (kindly). After making this discovery, and being so excited that I finally had a vegetable I could eat, I told the teacher this amazing news and that it was the only vegetable I could finally tolerate, and all she has to say is “you know there’s a lot of sugar in carrots, they’re the candy of vegetables”.\n\nWow, thanks, what a way to kill my excitement. How about I go eat a bag of chips instead, would you prefer that? \n\nApples: similar thing happened to me recently with apples. I finally figured out a fruit I can handle: cosmic crisp apples, sliced, as long as I 1. Feel them when choosing them, and they HAVE to be SO hard that my finger won’t push into them when I press hard. Now that I’ve made this discovery, I feel so happy and great. Not only did I find a fruit I can tolerate, but I ACTUALLY ENJOY IT! I’m eating one right now and I CHOSE to eat it instead of Oreos or popcorn! I’ve been eating one to two a day! But ofcourse, when I told a friend who knows i have “something like ARFID” (she knows I have autism/sensory issues with food but isn’t aware of the scope of arfid), she says “that’s a lot of sugar”, and “you need to eat a variety of fruit so you get all your vitamins”.\n\nOk so how about I just eat a scoop of sugar if they’re both just sugar, am I right? \n\nLike geez people, these are the kind of people who whine about childhood/overall obesity, but when a kid (when I was telling the teacher) or an adult (when telling the friend) comes to you excited about finally finding a fruit they can tolerate after years of searching, they just say “well you’re not healthy enough”.\n\nI’m still excited about my accomplishments, but these people are annoying. I have common sense so I know carrots aren’t the equivalent to a sleeve of starburst, and I know the “limited vitamins” of an apple are more than the even more limited vitamins of a scoop of pure sugar. I’ll be enjoying my apple while they let the perfect be the enemy of the good lol. \n\nAlso did I mention this apple is really good and I’m really excited about it lol. It feels so good finding a new food and not just tolerating it, but ENJOYING IT 😭 am I pathetic that I’m this excited about eating an apple? It took me so long to find a fruit I could eat. I tried dehydrating, fruit leather, basically all varieties of fruit at the store, and finally found something.",
  "url": "https://www.reddit.com/r/ARFID/comments/1jx9zrk/i_guess_carrots_and_apples_are_unhealthy_but_i/",
  "score": 182,
  "num_comments": 54,
  "comments": [
    {
      "id": "mmow7sk",
      "author": "sipsyrup",
      "body": "There's like 5 grams of sugar in a cup of baby carrots. To suggest they have a high sugar content is asinine. Like, maybe compared to a lettuce leaf, sure. Enjoy your carrots, the only danger with them is the possibility of mimicking bugs bunny. Same applies to apples.",
      "created_utc": 1744437285.0,
      "score": 172,
      "context": []
    },
    {
      "id": "mmptbgx",
      "author": "Moondust99",
      "body": "Ive had this too!! Someone even tried to tell me broccoli was one of the most sugary vegetables??? It’s like people already have the notion that your eating habits are ridiculous and don’t want to admit they’re wrong, so even when presented with evidence that it’s not the case, they find a way to try and make it fit their view. It’s rough. \n\nAlso sugar is overly demonised imo. This is from a British perspective so other countries may be different. But even a lot of “unhealthy” foods that are sugary don’t actually have anything “bad” in? Sugar free versions can actually have a lot more artificial ingredients that probably aren’t as good for us. And we need sugar lol. Same as we need fat and salt and carbs and whatever else people have tried to demonise.",
      "created_utc": 1744457289.0,
      "score": 55,
      "context": []
    },
    {
      "id": "mmp1w0o",
      "author": "WindermerePeaks1",
      "body": "i am so sorry that was peoples reaction. i would love to share the excitement with you because honey crisp apples made me want to eat apples! as long as my sensory issues aren’t too strong i don’t mind the sticky juice and the nice crisp of the apple is so nice!! i’m so happy you found your variety that suits you!! you are definitely not pathetic for being so happy over an apple. finding a new food is always such a happy time when new foods are so lacking!! congrats 🫶🏻",
      "created_utc": 1744440636.0,
      "score": 13,
      "context": []
    },
    {
      "id": "mmq2avi",
      "author": "allgespraeche",
      "body": "We know how full of sugar EVERYTHING is now. Eating lots of baby carrots isn't like candy. Probably the same as eating other ready meals and stuff.\nThe bigger risk is probably you turning orange, not you eating way to much sugar. \n\n\"A single serving (85g) of baby carrots has 7 grams of carbohydrates. This includes 2.5 grams of fiber and 4.1 grams of naturally occurring sugar. There is no starch in baby carrots.\"\n\nEat your baby carrots all you want.",
      "created_utc": 1744461426.0,
      "score": 12,
      "context": []
    },
    {
      "id": "mmpoyg7",
      "author": "Bleedingshards",
      "body": "My go-to fruit is bananas. Probably the most sugary fruit out there. I was like \"Well, that is probably why I like it.\" I recently learned that I have insulin resistance and the first thing you learn is, that bananas are bad... Well it's that or sweets. \n\nApples however are ok and carrots are GREAT. I could eat carrots all day and not reach my calorie count. I remind myself, that for me this is still great. People who just eat salad leaves all day, can talk this bullshit, but like you said: Its much better than just eating a scop of sugar. I recently incorporated apple-crumble into my breakfast routine and it is amazing (considering the alternative is white bread with nutella). Hey I finally found a way to eat fruits regularly, which is a huge step forward. \n\nAnd If people don't eat carros or apples because the consider them sweets, they are really stupid. You apple-excitement is basically my raspberry. I don't like them fresh because of the texture, but mixed into something else or pureed with joghurt is awesome",
      "created_utc": 1744454947.0,
      "score": 11,
      "context": []
    },
    {
      "id": "mmr2tfv",
      "author": "shelllllo",
      "body": "My son has ARFID and his doctor said if he can tolerate apples and carrots, that’s great and he doesn’t need to eat every single fruit and vegetable there is. Just wanted to share my experience! \n\n\nYou’re rocking it! I’m so proud of you, and your teacher and friend need more education around food, before they judge people! Trying new food and LIKING it, is HUGE!!! \n\n\nSeriously, really so happy for you!",
      "created_utc": 1744473951.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mmqgegu",
      "author": "pendigedig",
      "body": "I absolutely hate this! I was under the impression that it was worthless to eat dried or frozen fruit because they \"lose their nutrients\" until I actually looked it up and it's like entirely negligible especially since the alternative for me would have been eating nothing instead!",
      "created_utc": 1744466702.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mmq03hc",
      "author": "TashaT50",
      "body": "I’m sorry people were jerks and objectively wrong. Obviously it’s better to eat apples all day than Oreos. It’s way better to snack on carrots than chips or candy when looking for that crunch. Even if you didn’t have ARFID or food sensory issues/restrictions these would be better choices. Like duh. \n\nCarrots and apples are healthy and each new safe food can lead to more. I’m excited with you finding an awesome apple to munch on for that crunch craving. Did you know you can sprinkle a little salt on apples to get that salty crunch? If you like nut butter or cheese both go well with apples. I like hard cheddar pre-cut snack pieces or cheese fondue. Nut butter can be done as a dip or spread on each slice. Any of my suggestions might be a sensory issue but I thought I’d mention them.\n\nBaby carrots are great for dipping or just sprinkle a little salt for that salty crunch craving. If you like yogurt to get more protein you can make a number of dips - onion soup, dill, ranch, etc. If you are having problems getting enough calories daily I love sour cream dip especially Lipton onion soup. Lots of mixes and recipes for veggie dips out there to try. I love wishbone robusto Italian salad dressing so I’ll pour a little in small dipping bowls and dip the carrots in that.\n\nGiven you like the hardness of cosmic crisp apples, if you haven’t tried them yet, you might like red delicious apples - just make sure they feel hard and aren’t on their final week. As apples age they get mushier so squeeze them when shopping to make sure they feel super hard.\n\nSo exciting you found a fruit to love. I’ve been known to do a little dance when I find a new safe food. My youngest niece also taught me to say “I win, I win, I win” while doing the dance. I’m in my 50s for context.",
      "created_utc": 1744460466.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mmq2j9r",
      "author": "None",
      "body": "A lot of people really do not know what healthy foods are and think that salty, savory, fatty foods covered in sauces are healthy just because that’s what neurotypicals tend to eat.\n\nI was criticized for liking green apples better than red apples and later criticized for eating apples and broccoli instead of greasy, fatty chicken and oily vegetables covered in sauces. A lot of people simply believe that NT-styled eating is automatically healthy.",
      "created_utc": 1744461524.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mmq0qn8",
      "author": "RealityTVfan28",
      "body": "Just tune out the naysayers. At this point in my life other people are just not entitled to an opinion or criticism of what I do or don’t eat. Period. Full stop. \n\nOnce I got to that point for myself I felt like people in general were more accepting because I just wasn’t having their input. It doesn’t affect them in any way, shape or form. \n\nBe excited for every new food you add. There are no “bad” foods. There can be bad quantities. That’s different. BTW I’m a 68 year old grandma and I have never, not once eaten a carrot or an apple so you’re doing amazing in my opinion. Be kind to yourself. You got this.",
      "created_utc": 1744460750.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mmqlu07",
      "author": "grass_and_dirt",
      "body": "Cosmic crisp apples were invented in my town :)",
      "created_utc": 1744468528.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mmri74p",
      "author": "colorfulzeeb",
      "body": "My doctor told me to eat a bunch of fruits and vegetables, but avoid carrots, peas, grapes, bananas, apples, pears, melons, & citrus because they all have too much sugar. She seems to have orthorexia and little understanding or acknowledgement of some of her patients’ eating disorders. Meanwhile, my bloodwork shows that I have vitamin deficiencies due to not eating meat, and nothing else. No prediabetes or diabetes to fuel this fixation of hers. She’s obsessed with diet and sugar being inflammatory, and if you’re eating it, then it’s kind of your fault for not getting better, right? /s\n\n\n\nOther foods she’s told me to avoid are anything containing corn, soy, tomato, soft cheeses, artificial sweeteners, anything with added sugars, and I honestly can’t remember all of the other restrictions she had for me to treat my condition that can only effectively be treated with medication (which she *is* also prescribing). There’s no winning with people who count the sugar content of carrots.",
      "created_utc": 1744478682.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mmrjmun",
      "author": "tittylamp",
      "body": "theres a big difference between naturally occurring  sugars and processed/added sugars. i used to put processed sugar on my cheerios but now i use honey instead. still high in sugar but it is a lot healthier. \n\nbottom line these are healthier choices and you should be happy. fuck the sugar content. at least you arent eating junk food.",
      "created_utc": 1744479115.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mmv6olf",
      "author": "Ginger_Cat_Ventures",
      "body": "Absolutely been there and my condolences because it’s so frustrating. I have an acquaintance who use to be a cook, and when I have tried to tell her my accomplishments (I use to only be able to eat ritz crackers and applesauce) she would go on and on about how most of the foods I tried to branch into and have had success with are all processed a lot (like Impossible chicken nuggets). Or that if I’m to have vegetables that they have to have sauce on them. \n\nLook….i’m not debating that I am not eating healthy. I WISH I could. \n\nBut any win is a win. Trying to shame me for my progress with ARFID is so counterproductive to their efforts to actually live with their eating disorder. \n\nI’ve been told by my therapist that I am hard on myself but BOY is it crazy how hard other people who are not me can be. \n\nGranted: this person is also always telling me that I’m being negative all the time. Which is ironic given how she’s actively trying to diminish my accomplishments with food.",
      "created_utc": 1744532529.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mmqdrsj",
      "author": "keto_and_me",
      "body": "If my teenage stepdaughter would put ANY whole food on her food list, I’d be over the moon happy. I’m sorry that some know it all rained on your parade. \n\nEnjoy your carrots and apples! Just not so much that you can’t stand looking at them after a few weeks 😁",
      "created_utc": 1744465807.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mmr7vw9",
      "author": "LetMeInYourWindowH",
      "body": "Yes, carrots and apples have sugar, but they also come bundled with fibre, slowing down the impact on blood sugar. So they're okay in my book. Fibre is also great for your gut health.",
      "created_utc": 1744475550.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mmrad6l",
      "author": "goldfishmuncher",
      "body": "garbage advice from them, natural sugars vs artificial sugars are so different. keep up with the fruits and veggies!",
      "created_utc": 1744476328.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mmw5ggs",
      "author": "EmergencyAltruistic1",
      "body": "The only way I can eat a salad is covered in Italian dressing. I use the low fat options as I'm obese. Most of my safe foods are fried fast food, carbs, & sugars. My body needs vitamins & minerals so it pisses me off when I eat a salad & get told I might as well eat a burger. Like, ok, the calories may be the same but the nutrients are not.",
      "created_utc": 1744551162.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mmqzx50",
      "author": "stillabadkid",
      "body": "Omg cosmic crisp and organic baby carrots are safe foods for me lol",
      "created_utc": 1744473053.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mmrl9z0",
      "author": "undercovercatman",
      "body": "I wonder if you would like broccoli slaw, basically coleslaw but with broccoli instead of cabbage plus carrots and some red cabbage (which I personally love, but you can easily pick out). They’re just little baby strips of the veggies and I really like the crunch, sometimes I add la choy rice noodles on top for some extra crunchiness!\n\nEdit: also wanted to mention that I don’t put any dressing or anything on it, just the veggies plain from the bag",
      "created_utc": 1744479615.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mmrwqvp",
      "author": "Shesarubikscube",
      "body": "Eating plant based whole foods is far better for you than if you eat processed foods. The only reason to worry about the carbs in whole based plant foods is if you are diabetic and need to count carbs (like my mom). These people sound wildly uninformed. Keep eating your baby carrots and your apples- they are great for natural fiber and nutrients and good for you.",
      "created_utc": 1744483251.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mmry7ay",
      "author": "bubble-buddy2",
      "body": "No person has been told by a doctor to stop eating fruits or veggies because of their sugar content. I despise people who say that to those of us who have finally found a veggie or fruit we enjoy. Don't listen to them",
      "created_utc": 1744483730.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mms9wex",
      "author": "CarelessTelevision86",
      "body": "You know what? If you can eat it, eat it. Don't worry about what other people are saying. Carrots and apples ARE healthy. End of story. Fruits and veggies, as long as your body can process them correctly (mine can, to an extent), are great foods. There is a reason there are apple trees and not Twinkie trees. Where it goes unhealthy is the ultra-processed things.",
      "created_utc": 1744487644.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mmscdrm",
      "author": "saintceciliax",
      "body": "This is insane? Sorry but those people are stupid. Try not to let it bother you. I wish I would eat literally any fruits or vegetables",
      "created_utc": 1744488470.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mmsdtp1",
      "author": "thisislikemytenthalt",
      "body": "Apples come with fiber which helps stabilize any sugar",
      "created_utc": 1744488954.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mmsm0qx",
      "author": "chunkeymunkeyandrunt",
      "body": "Any amount of fruit or vegetable is better than zero!! Carrots are awesome. \n\nThese people also generally seem to be the type who hear ‘sugar’ and assume it means bad. Sugar doesn’t mean just one thing. The natural sugars in fruits and veggies is very different than processed sugar in candy. \n\nMaybe I’ve just lost my filter over the years but nowadays when someone tries to give me their unasked for opinion I just ask them where they got their dietician certifications lmao",
      "created_utc": 1744491683.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mmt3l1e",
      "author": "Substantial_Chest395",
      "body": "Stop listening to “people” and conduct your own research.",
      "created_utc": 1744497953.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mmt91d0",
      "author": "shinyrocklover",
      "body": "Whole Foods> processed foods> no food\nProud of you for eating, even prouder of you for trying new things and finding more variety! ❤️",
      "created_utc": 1744500001.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mmtu8w7",
      "author": "Affectionate_Desk_43",
      "body": "Those people live in hell pls just eat the vegetables!! im glad you found something you can eat",
      "created_utc": 1744508319.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mmuh2s2",
      "author": "DeterminedArrow",
      "body": "I’ve been there. Lordy. I find anything new I like gets immediately criticized on how to make it better or healthier. \nlol i know",
      "created_utc": 1744518043.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mmulyr9",
      "author": "sliverofmasc",
      "body": "Fructose is different to glucose, and you get to have *cronch*! \n\nPeople need to stop policing food 😒 the only people who are *allowed* to \"police\" food are dietitians who actually know what they're talking about instead of folks trying to concern troll you into not eating literally healthy raw fruit and vege??? \n\nApples and carrots are so good for you wtf???\n\n😭",
      "created_utc": 1744520435.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mmv14af",
      "author": "kasha789",
      "body": "No! Eat them all fruits and veggies are nourishing!",
      "created_utc": 1744529049.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mmv4xzy",
      "author": "DaraVelour",
      "body": "Even if they have a lot of sugar, that's a different kind of sugar than in the processed food. And a healthier one.",
      "created_utc": 1744531430.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mmvjx70",
      "author": "GaydrianTheRainbow",
      "body": "Good lird. People can be so tiresome.\n\nAlso cosmic crisp apples are so good! To me they taste like the platonic ideal of apple.",
      "created_utc": 1744541083.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mmzebhr",
      "author": "luminousrobot",
      "body": "So funny those are among the only fruits and veggies I eat. Baby carrots and super crisp apples.  I am also able to eat extremely crisp grapes. \n\nIgnore them and do your thing! They may have sugar but they also have fiber and vitamins!",
      "created_utc": 1744589487.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mmziyzo",
      "author": "Interesting-Error859",
      "body": "I had a \"friend\" who once tried to discourage me from all my food and also make my mental health worse about my insulin by trying to convince me my body will \"stop absorbing stuff if I keep eating the same foods\". She was not an idiot, I know for a fact she was playing it on or some crap to make me feel bad. IDK why I put up with her for so long",
      "created_utc": 1744591260.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mmztf50",
      "author": "crustil",
      "body": "What? I've never heard anyone say carrots are bad for you? Or apples. Honestly I've only ever heard the opposite! They used to say carrots were good for your eyes (lol i actually don't know why) and the peel on the apple is full of fiber!! \n\nI don't even like carrots, but I literally ordered carrots in my meal, just because they're good for me. I think you're doing great!",
      "created_utc": 1744595329.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mn4ibzi",
      "author": "NVS3992",
      "body": "Those foods are definitely not unhealthy lmao. Don't listen to them.",
      "created_utc": 1744663645.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mn76bfv",
      "author": "Lovely_Bug9833",
      "body": "Coming from a professor with a PhD in health science and cognates in nutrition… your teacher is a moron! Ignore her and keep it moving right along! Congrats on finding two tasty and VERY healthy foods you love. That’s a major victory!",
      "created_utc": 1744703261.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mn7lqrf",
      "author": "Civil-Law529",
      "body": "Ughhhh people who are like that drive me crazy!!! I couldn’t eat most fruits until college so learning to eat fruit was such a big deal to me. But the way I can take them best is in a smoothie from Tropical Smoothie. Then one of my friends in grad school kept making comments about how much sugar is in it and how it really isn’t healthy. Ma’am!! This is my only fruit intake and fruit has so many good vitamins. \n\nSame with when people make comments about the way I cook my veggies or only want them like fried up in a saucy stir fry. I’m eating vegetables which I will always take as a huge win!!",
      "created_utc": 1744713142.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mndegn6",
      "author": "throwawaypatien",
      "body": "I think people are too concerned about sugar these days. Now, I can understand a little bit of concern, but it's getting to be too much these days.\n\nVery few fruits and vegetables have zero sugar.",
      "created_utc": 1744788145.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mnge6vg",
      "author": "Zestyclose_Scene2602",
      "body": "Oh my god I feel this and do it to myself. There is no way any food is actually healthy with the criteria people have! Too much sugar, fat, carbs, you realize we need those things to survive too?? And most of the “unhealthy” food is based on fad diets which have different goals. And everyone has different bodies and different needs. I might edit this later because I have many thoughts.",
      "created_utc": 1744829175.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mmqx8gt",
      "author": "kiiitsunecchan",
      "body": "Also, OP is eating them raw. Cooked carrots have an abysmal GI index once cooked/roasted, due to breakdown of other molecules and such, but raw ones are absolutely GREAT vegetables.\n\nI'm into ketogenic diets and low carb stuff in general (in theory, doing it with ARFID can be an extra pain in the ass depending on individual limitations), training as a Dietitian, and I would never dream of discouraging someone because they managed to add one fruit or veggie to their diet because it's not the \"best\" option.\n\n1 - there's no objective best option at all, variety is friends with good nutrition, but supplements are there for people who can't manage it through diet alone;\n\n2 - as OP said, letting the perfect be the enemy of good is asinine. There isn't good or bad foods, but there are foods with better nutritional profile than others. Raw carrots and apples are more nutritious than statbusts or chips (though it would be nice to have more engineered versions of those that have a better nutritional profile while still being tasty and consistent), and being able to go for those now sometimes is really great for OP.",
      "created_utc": 1744472221.0,
      "score": 36,
      "context": [
        {
          "id": "mmow7sk",
          "author": "sipsyrup",
          "body": "There's like 5 grams of sugar in a cup of baby carrots. To suggest they have a high sugar content is asinine. Like, maybe compared to a lettuce leaf, sure. Enjoy your carrots, the only danger with them is the possibility of mimicking bugs bunny. Same applies to apples.",
          "created_utc": 1744437285.0
        }
      ]
    },
    {
      "id": "mmrp4r3",
      "author": "SpOoKy_sKeLeToN_1998",
      "body": "Well, there is another danger to carrots (& fruit/ vegetables in general).\n\nJust don't eat too many at a time, it will go right through you because of the fiber. I once ate a whole (sharing size) pack of baby carrots in 1 day & learned the hard way why you shouldn't do that. But they tasted so Good lol",
      "created_utc": 1744480796.0,
      "score": 10,
      "context": [
        {
          "id": "mmow7sk",
          "author": "sipsyrup",
          "body": "There's like 5 grams of sugar in a cup of baby carrots. To suggest they have a high sugar content is asinine. Like, maybe compared to a lettuce leaf, sure. Enjoy your carrots, the only danger with them is the possibility of mimicking bugs bunny. Same applies to apples.",
          "created_utc": 1744437285.0
        }
      ]
    },
    {
      "id": "mmtm2xn",
      "author": "zephalephadingong",
      "body": "If you eat too many carrots it can turn your skin orange.  It takes a metric fuckton though.  Also no side effects other then the coloration, so not really a health concern",
      "created_utc": 1744505018.0,
      "score": 9,
      "context": [
        {
          "id": "mmow7sk",
          "author": "sipsyrup",
          "body": "There's like 5 grams of sugar in a cup of baby carrots. To suggest they have a high sugar content is asinine. Like, maybe compared to a lettuce leaf, sure. Enjoy your carrots, the only danger with them is the possibility of mimicking bugs bunny. Same applies to apples.",
          "created_utc": 1744437285.0
        }
      ]
    },
    {
      "id": "mmq033x",
      "author": "corn_breath",
      "body": "I think what you’re learning is that a lot of people are afraid of food, just in a different way from you. Mainstream food fear is more like shame based. I think there’s an idea that there’s this secret magical formula that’s basically unachievable. If you eat these exact foods in this exact order prepared to this exact way your body will suddenly transcend its normal state. You’ll feel way better. You’ll live way longer. You’ll be way smarter. It’s capitalism at work. It’s a way to sell more expensive foods and diets. The best way to sell things is to make feel people feel broken unless they buy them. You make people feel bad about themselves, and then they’ll wanna buy things to feel better. Conveniently, you have those things for sale.\n\nWhen it comes to these foods that you’re being told aren’t right, my guess is these people feel that way whenever they eat. They feel a feeling of shame like there’s something imperfect.",
      "created_utc": 1744460462.0,
      "score": 28,
      "context": [
        {
          "id": "mmptbgx",
          "author": "Moondust99",
          "body": "Ive had this too!! Someone even tried to tell me broccoli was one of the most sugary vegetables??? It’s like people already have the notion that your eating habits are ridiculous and don’t want to admit they’re wrong, so even when presented with evidence that it’s not the case, they find a way to try and make it fit their view. It’s rough. \n\nAlso sugar is overly demonised imo. This is from a British perspective so other countries may be different. But even a lot of “unhealthy” foods that are sugary don’t actually have anything “bad” in? Sugar free versions can actually have a lot more artificial ingredients that probably aren’t as good for us. And we need sugar lol. Same as we need fat and salt and carbs and whatever else people have tried to demonise.",
          "created_utc": 1744457289.0
        }
      ]
    },
    {
      "id": "mmpxoqn",
      "author": "Taxouck",
      "body": "I've heard that the \"true culprit\" of the rise in obesity is caloric density rather than fat, salt, sugar... Like, our foods are just *too efficient* at nourishing us in a small package that leaves us still hungry, so we overeat because our bodies are still used to the comparatively inefficient meals of the past. Fingers crossed this proves to be actually true this time, and that the news spreads...",
      "created_utc": 1744459388.0,
      "score": 6,
      "context": [
        {
          "id": "mmptbgx",
          "author": "Moondust99",
          "body": "Ive had this too!! Someone even tried to tell me broccoli was one of the most sugary vegetables??? It’s like people already have the notion that your eating habits are ridiculous and don’t want to admit they’re wrong, so even when presented with evidence that it’s not the case, they find a way to try and make it fit their view. It’s rough. \n\nAlso sugar is overly demonised imo. This is from a British perspective so other countries may be different. But even a lot of “unhealthy” foods that are sugary don’t actually have anything “bad” in? Sugar free versions can actually have a lot more artificial ingredients that probably aren’t as good for us. And we need sugar lol. Same as we need fat and salt and carbs and whatever else people have tried to demonise.",
          "created_utc": 1744457289.0
        }
      ]
    },
    {
      "id": "mmq49at",
      "author": "rlpsc",
      "body": "For real! I bet my lunch of raw carrots was healthier than that teachers oil and preservative drenched lettuce, but she’s got the nerve",
      "created_utc": 1744462234.0,
      "score": 2,
      "context": [
        {
          "id": "mmq2j9r",
          "author": "None",
          "body": "A lot of people really do not know what healthy foods are and think that salty, savory, fatty foods covered in sauces are healthy just because that’s what neurotypicals tend to eat.\n\nI was criticized for liking green apples better than red apples and later criticized for eating apples and broccoli instead of greasy, fatty chicken and oily vegetables covered in sauces. A lot of people simply believe that NT-styled eating is automatically healthy.",
          "created_utc": 1744461524.0
        }
      ]
    },
    {
      "id": "mmrz8is",
      "author": "rlpsc",
      "body": "Thanks, I’m glad I know they’re wrong, but it actually did make me stop eating carrots for a few years in highschool. Now that I’m older I know they’re just dumb, common sense hit me and i was like “wait, this is stupid, carrots aren’t unhealthy”. I kinda feel bad for anyone they might have said a similar thing to who didn’t have a later realization like I did.",
      "created_utc": 1744484072.0,
      "score": 2,
      "context": [
        {
          "id": "mmry7ay",
          "author": "bubble-buddy2",
          "body": "No person has been told by a doctor to stop eating fruits or veggies because of their sugar content. I despise people who say that to those of us who have finally found a veggie or fruit we enjoy. Don't listen to them",
          "created_utc": 1744483730.0
        }
      ]
    },
    {
      "id": "mn7lwng",
      "author": "Civil-Law529",
      "body": "Also the fiber in fruits and veggies has been so helpful for regular digestion that people can get over the fact that apples have sugar. They are great for helping you poop 😂",
      "created_utc": 1744713235.0,
      "score": 1,
      "context": [
        {
          "id": "mn7lqrf",
          "author": "Civil-Law529",
          "body": "Ughhhh people who are like that drive me crazy!!! I couldn’t eat most fruits until college so learning to eat fruit was such a big deal to me. But the way I can take them best is in a smoothie from Tropical Smoothie. Then one of my friends in grad school kept making comments about how much sugar is in it and how it really isn’t healthy. Ma’am!! This is my only fruit intake and fruit has so many good vitamins. \n\nSame with when people make comments about the way I cook my veggies or only want them like fried up in a saucy stir fry. I’m eating vegetables which I will always take as a huge win!!",
          "created_utc": 1744713142.0
        }
      ]
    },
    {
      "id": "mmtsia6",
      "author": "puppyhugtime",
      "body": "Thank you for being a dietician that doesn’t moralize food choices! It is so hard to find advice about nutrition that isn’t rooted in being “good” or “bad” based on what you eat/look like",
      "created_utc": 1744507610.0,
      "score": 11,
      "context": [
        {
          "id": "mmow7sk",
          "author": "sipsyrup",
          "body": "There's like 5 grams of sugar in a cup of baby carrots. To suggest they have a high sugar content is asinine. Like, maybe compared to a lettuce leaf, sure. Enjoy your carrots, the only danger with them is the possibility of mimicking bugs bunny. Same applies to apples.",
          "created_utc": 1744437285.0
        },
        {
          "id": "mmqx8gt",
          "author": "kiiitsunecchan",
          "body": "Also, OP is eating them raw. Cooked carrots have an abysmal GI index once cooked/roasted, due to breakdown of other molecules and such, but raw ones are absolutely GREAT vegetables.\n\nI'm into ketogenic diets and low carb stuff in general (in theory, doing it with ARFID can be an extra pain in the ass depending on individual limitations), training as a Dietitian, and I would never dream of discouraging someone because they managed to add one fruit or veggie to their diet because it's not the \"best\" option.\n\n1 - there's no objective best option at all, variety is friends with good nutrition, but supplements are there for people who can't manage it through diet alone;\n\n2 - as OP said, letting the perfect be the enemy of good is asinine. There isn't good or bad foods, but there are foods with better nutritional profile than others. Raw carrots and apples are more nutritious than statbusts or chips (though it would be nice to have more engineered versions of those that have a better nutritional profile while still being tasty and consistent), and being able to go for those now sometimes is really great for OP.",
          "created_utc": 1744472221.0
        }
      ]
    },
    {
      "id": "mmxtkzu",
      "author": "lesbiangerardway",
      "body": "Please if you can drop any recs for similar ARFID-conscious dietitians, especially those with an understanding of GI. I am struggling so much to find someone who doesn’t make me feel like shit",
      "created_utc": 1744570245.0,
      "score": 1,
      "context": [
        {
          "id": "mmow7sk",
          "author": "sipsyrup",
          "body": "There's like 5 grams of sugar in a cup of baby carrots. To suggest they have a high sugar content is asinine. Like, maybe compared to a lettuce leaf, sure. Enjoy your carrots, the only danger with them is the possibility of mimicking bugs bunny. Same applies to apples.",
          "created_utc": 1744437285.0
        },
        {
          "id": "mmqx8gt",
          "author": "kiiitsunecchan",
          "body": "Also, OP is eating them raw. Cooked carrots have an abysmal GI index once cooked/roasted, due to breakdown of other molecules and such, but raw ones are absolutely GREAT vegetables.\n\nI'm into ketogenic diets and low carb stuff in general (in theory, doing it with ARFID can be an extra pain in the ass depending on individual limitations), training as a Dietitian, and I would never dream of discouraging someone because they managed to add one fruit or veggie to their diet because it's not the \"best\" option.\n\n1 - there's no objective best option at all, variety is friends with good nutrition, but supplements are there for people who can't manage it through diet alone;\n\n2 - as OP said, letting the perfect be the enemy of good is asinine. There isn't good or bad foods, but there are foods with better nutritional profile than others. Raw carrots and apples are more nutritious than statbusts or chips (though it would be nice to have more engineered versions of those that have a better nutritional profile while still being tasty and consistent), and being able to go for those now sometimes is really great for OP.",
          "created_utc": 1744472221.0
        }
      ]
    },
    {
      "id": "mmq1d4v",
      "author": "frogspeedbaby",
      "body": "This is such a great response. Too often things boil down to people feeling insecure in themselves. Our society breeds it too. There is no perfect diet you can obtain. Celebrate your wins!",
      "created_utc": 1744461021.0,
      "score": 11,
      "context": [
        {
          "id": "mmptbgx",
          "author": "Moondust99",
          "body": "Ive had this too!! Someone even tried to tell me broccoli was one of the most sugary vegetables??? It’s like people already have the notion that your eating habits are ridiculous and don’t want to admit they’re wrong, so even when presented with evidence that it’s not the case, they find a way to try and make it fit their view. It’s rough. \n\nAlso sugar is overly demonised imo. This is from a British perspective so other countries may be different. But even a lot of “unhealthy” foods that are sugary don’t actually have anything “bad” in? Sugar free versions can actually have a lot more artificial ingredients that probably aren’t as good for us. And we need sugar lol. Same as we need fat and salt and carbs and whatever else people have tried to demonise.",
          "created_utc": 1744457289.0
        },
        {
          "id": "mmq033x",
          "author": "corn_breath",
          "body": "I think what you’re learning is that a lot of people are afraid of food, just in a different way from you. Mainstream food fear is more like shame based. I think there’s an idea that there’s this secret magical formula that’s basically unachievable. If you eat these exact foods in this exact order prepared to this exact way your body will suddenly transcend its normal state. You’ll feel way better. You’ll live way longer. You’ll be way smarter. It’s capitalism at work. It’s a way to sell more expensive foods and diets. The best way to sell things is to make feel people feel broken unless they buy them. You make people feel bad about themselves, and then they’ll wanna buy things to feel better. Conveniently, you have those things for sale.\n\nWhen it comes to these foods that you’re being told aren’t right, my guess is these people feel that way whenever they eat. They feel a feeling of shame like there’s something imperfect.",
          "created_utc": 1744460462.0
        }
      ]
    },
    {
      "id": "mmxyzsp",
      "author": "kiiitsunecchan",
      "body": "I wish there were more dietitians like that, but sadly I'm in Brazil and only know of one, who doesn't speak English :( She specialized in allergies for a long time, then EDs, and both backgrounds make her have a very different approach to diet and nutrition, so maybe looking for someone with a similar education might lead you to such professionals.\n\nI have ARFID myself, and am autistic, and while I didn't plan to go on the clinic side of my course much, the lack of professionals have made me rethink that decision, so I'm here I am acouple years from finishing training.\n\nMost of my colleagues are difficult to work with at best. There's widespread disordered eating and straight up body dysmorphic EDs in the profession, and navigating it feels like a minefield. If the main thing your dietitian brings up is weight management and you're not visibly underweight, it's probably not going to be a good fit. The dietitian I mentioned always start with extensive bloodwork because her main concern is that people are not malnourished, and you can't tell that by weight or body measurements at all, and she's happy to work with you where you're at - either becoming healthier with how your restrictions are atm (supplements, alternative products, meal replacement) or helping with chaining (? not sure if that's the name in English) if you are at a point where expanding your safe foods is something you want.",
      "created_utc": 1744571984.0,
      "score": 2,
      "context": [
        {
          "id": "mmow7sk",
          "author": "sipsyrup",
          "body": "There's like 5 grams of sugar in a cup of baby carrots. To suggest they have a high sugar content is asinine. Like, maybe compared to a lettuce leaf, sure. Enjoy your carrots, the only danger with them is the possibility of mimicking bugs bunny. Same applies to apples.",
          "created_utc": 1744437285.0
        },
        {
          "id": "mmqx8gt",
          "author": "kiiitsunecchan",
          "body": "Also, OP is eating them raw. Cooked carrots have an abysmal GI index once cooked/roasted, due to breakdown of other molecules and such, but raw ones are absolutely GREAT vegetables.\n\nI'm into ketogenic diets and low carb stuff in general (in theory, doing it with ARFID can be an extra pain in the ass depending on individual limitations), training as a Dietitian, and I would never dream of discouraging someone because they managed to add one fruit or veggie to their diet because it's not the \"best\" option.\n\n1 - there's no objective best option at all, variety is friends with good nutrition, but supplements are there for people who can't manage it through diet alone;\n\n2 - as OP said, letting the perfect be the enemy of good is asinine. There isn't good or bad foods, but there are foods with better nutritional profile than others. Raw carrots and apples are more nutritious than statbusts or chips (though it would be nice to have more engineered versions of those that have a better nutritional profile while still being tasty and consistent), and being able to go for those now sometimes is really great for OP.",
          "created_utc": 1744472221.0
        },
        {
          "id": "mmxtkzu",
          "author": "lesbiangerardway",
          "body": "Please if you can drop any recs for similar ARFID-conscious dietitians, especially those with an understanding of GI. I am struggling so much to find someone who doesn’t make me feel like shit",
          "created_utc": 1744570245.0
        }
      ]
    }
  ]
}