{
  "id": "1jzfdoc",
  "subreddit": "ARFID",
  "author": "MathsNCats",
  "created_utc": 1744679455.0,
  "title": "Sometimes I look at my food and can't help but be a little proud of how far I've come. Teenage me would never have even considered eating this, now it's a dessert I look forward to",
  "selftext": "I hated bananas with a burning passion and strawberries were almost as bad. \nPlus my dinner was chock full of broccoli and cauliflower, which I love now. ",
  "url": "https://i.redd.it/5l82uzgrfwue1.png",
  "score": 84,
  "num_comments": 4,
  "comments": [
    {
      "id": "mn5u0u8",
      "author": "Rabbid0Luigi",
      "body": "I wish I could eat literally any of the things you listed in this post, congrats on the progress",
      "created_utc": 1744679974.0,
      "score": 22,
      "context": []
    },
    {
      "id": "mn5whno",
      "author": "Upset-Lavishness-522",
      "body": "This is BAD ASS.  It took me, I shit you not, 20 years to tolerate bananas. Cream, first shot, loved it. Strawberries, an absolute never.\n\nIts different for everyone, and there's no need to compete (not deleting my first paragraph because, i get it, comparing looks like competing, but will revise that if it looks too hypocritical. I just wanted to show how freaking good it feels when you eventually get to enjoy a prior fear food) OP, that looks delicious and I bet almost all of us here could enjoy at least a variation on that.\n\nTLDR: AWESOME JOB AND IM HAPPYFOR YOU",
      "created_utc": 1744680870.0,
      "score": 11,
      "context": []
    },
    {
      "id": "mndiyaa",
      "author": "TashaT50",
      "body": "Love this for dessert. We definitely should be proud of progress we’ve made increasing safe foods and eliminating restrictions. \n\nCongrats on your progress. So happy for you.",
      "created_utc": 1744791034.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mo7t34j",
      "author": "pierre_sucks",
      "body": "Good job. I'm really glad to see that you are expanding the foods you eat, that's really important. You should feel proud!",
      "created_utc": 1745216698.0,
      "score": 1,
      "context": []
    }
  ]
}