{
  "id": "1k0zplt",
  "subreddit": "ARFID",
  "author": "likeaparasite",
  "created_utc": 1744849210.0,
  "title": "My teenager is living off nuggs.",
  "selftext": "My kid (16) is newly diagnosed with autism and has a childhood diagnosis of ADD. We moved from California to Canada and she lost all of her safe foods except the almighty McD chicken nuggie. I've had friends send food up but \"it's not the same\". She's surviving right now on: nugs, nutella&peanut butter sandwiches, chocolate chip waffles, and garlic noodles. \n\nWhat I'm here to ask for advice on: She flips her shit if McD isn't an option once a day. She will argue, refuse to eat anything the whole day, just act an asshole. With fights we are looking at 4-5x a week. I feel like the worlds shittiest parent and I'm enabling her, like the answer is \"Quit buying it\" but I don't feel like saying \"Go hungry!\" helps her in any way. We've talked about the expense and math of it all.\n\nI don't really know what else I should be doing but I'm so lost. I'm at a point where I don't want to fight and strain our relationship any further.",
  "url": "https://www.reddit.com/r/ARFID/comments/1k0zplt/my_teenager_is_living_off_nuggs/",
  "score": 112,
  "num_comments": 51,
  "comments": [
    {
      "id": "mni6280",
      "author": "lotteoddities",
      "body": "You need an therapist who is trained to work with Autistic patients and ARFID specifically. Or a skills coach. Both will have ways to communicate with your teenager to find out how to expand their safe food list and hopefully get off of daily McDonald's.",
      "created_utc": 1744849799.0,
      "score": 187,
      "context": []
    },
    {
      "id": "mniarlo",
      "author": "dioor",
      "body": "I want to preface this by saying that I am a fully-functional adult in my mid-30s — people other than my husband and closest family, who I’m most open with about my struggles, would consider me very high functioning. I am healthy, financially stable, work full time, am happily married, etc. \n\nWhen I’m stressed, I can basically only eat 5 minute rice with margarine. There are weeks when that and Diet Coke and Starbucks baked goods are all I’m ingesting. My Starbucks spending is probably my #1 vice. It’s a comfort thing. I’ve had full-on panic attacks over leftovers my husband has in the fridge before. \n\nIf someone took away my safe meal and comfort snacks I wouldn’t eat better, I would just be hungry and even more stressed. When I’m going through it, the source(s) of stress and anxiety needs to be attacked first — I need to be able to manage and navigate those things, and then I can work on reintegrating healthier and more varied foods. I only know this because I’ve been me for 35 years, at some point I clued in to just how abnormal I am, and I have gotten really good at managing myself. \n\nSo from my perspective you are not enabling or doing anything wrong. You’re making sure your child gets fed which is absolutely paramount. It is a bit unhelpful to bring up the economics of eating mostly McDonalds, because this might contribute to her guilt/stress. I’d support her in eating what she will temporarily, if you can swing it, without making it “a thing” — while working toward the goal of healthier and more economical eating habits by minimizing/managing other sources of stress and anxiety first. \n\nARFID is *not* a junk food addiction. It is an anxiety condition. So “enabling” isn’t really a thing. You are in a position to genuinely help your child’s life be more manageable for them, but it is definitely not a straight line to force-feeding better meal options.",
      "created_utc": 1744851512.0,
      "score": 174,
      "context": []
    },
    {
      "id": "mni6h7h",
      "author": "None",
      "body": "I can completely see why you’d be frustrated and upset, and why you might feel like the world shittiest parent given the way society focuses on giving children a balanced diet. \n\nBut, as a 28yr old with ARFID and ASD, I think you’re doing a great job right now. An international move is a huge adjustment, and I think a lot of people on the autism spectrum struggle with big changes, heck I think even NT people struggle with big changes/transitions. Not to mention the fact that she’s a 16 year old girl, which is a hard time in life for anyone. From this post, I view you as a loving parent that is doing what is right for her child. The rest of the world might not see it that way, but what matters more is a) that your daughter is eating something, even if it isn’t nutritious; and b) you’re supporting your daughter. \n\nMy parents tried telling me “if you’re hungry you’ll eat fruit” as a child. As a result I was malnourished. My diet at the moment consists primarily of chips and chocolate as I’m not doing well right now. My Mum helps me out by cooking the 2 meals I do like every few days, and that means the world to me. The teenage years are so difficult to survive, and I understand your frustration (and guilt) I hope you can one day see that you’re providing her with the food she can and will eat, while preserving your relationship with her.",
      "created_utc": 1744849955.0,
      "score": 66,
      "context": []
    },
    {
      "id": "mnjfqy2",
      "author": "IntrepidCost4461",
      "body": "I have autism and arfid so I fully understand her. My food palate is really small as well. Thru my life ive been eating slowly more things BUT every new thing i tried was similar in either taste/texture/smell to the thing I already liked.\n\nSo if she likes nuggets, try to introduce her to a similar type of chicken but healthier. If she likes nutella/peanut butter try to introduce her to peanuts or jelly (healthy type but jelly might be too much of a texture change).\n\nTry to ask her if there is some food that she wants to try but dont overdo it. My mom used to ask me everyday multiple times a day if I want to try eating some food that she was currently eating. Ive never tried anything like that because it was food that was nowhere my safe foods and it only caused frustration.\n\nAnd in terms of going hungry - it doesnt work. She will try to find her safe food in a house when hungry, she likely wont try anything new and it will just cause masive anxiety instead and a meltdown\n\nAnd remember, ANY food is better than no food. You’re doing great",
      "created_utc": 1744868725.0,
      "score": 20,
      "context": []
    },
    {
      "id": "mnj95uz",
      "author": "Little_Bit_87",
      "body": "Sounds like she's still dealing with the move. I (37f) have ADHD/ASD with sensory disorders. Big things like moving from Ca to CA is going to take a long time to feel normal for her. Any type of anxiety or adjustments can cause my ARFID symptoms to spiral. The best thing you can do for her is to acknowledge this isn't something she's choosing. She has no control over it in her current state and is wanting more than anything to have a normal relationship with food right now. I would look into getting her a therapist and a dietitian who specializes in ARFID. I'd also recommend trying to have fun with finding her new safe foods. You can get her nuggies and make a deal with her to try one bite of a new food to get them. Shell gain more confidence over time and be more willing to try new things. Also look into doing cooking exercises with her. Give her a timeframe to Google and find recipes she thinks could be safe. You can teach her to cook them with you making trying new things more about bonding than a battle. \n\nPlease please please understand she is feeling so out of control of this situation and doesn't want it to be like this either. She's not battling you even though it may feel like that. She's in a battle with herself.",
      "created_utc": 1744865264.0,
      "score": 14,
      "context": []
    },
    {
      "id": "mnj8vyh",
      "author": "AuroreChaton",
      "body": "I can't say any of this will work if she has any sort of PDA, but sit her down and try to figure out WHY those things are safe foods for her. Is it texture, smell, color, taste, familiarity, temperature? Also ask what she feels like when she eats \"unsafe\" foods. There is a difference between feeling unwell while eating something, and just not liking it, and this will affect how she handles new foods. This can be a delicate process since it can be very hard for even an adult to articulate their reactions and reasoning, and being unable to communicate can be distressing. This could happen even while eating safe foods. Fights will decrease if you open up to each other about this and can empathize.\n\nAsk her if she would be okay with you attempting to \"trick\" her. (Things like keeping packaging out of sight so she can't see the brand, blending veggies into a dish like cookies or pasta sauce, etc.) A lot of ARFID can be all in your head, especially when it comes to familiarity and anxiety based forms. If they don't have access to food they feel safe eating, they will not eat, and tricking them without their knowledge can result in them losing all trust in even their safe foods, which will almost always mean they'll eat nothing at all. Ask to try preparing the safe foods differently. Cutting up chicken nuggets, serving them with different sides or sauces as an option, etc. can help with texture issues. This may not work, of course! But asking is important. She needs to feel as though she has input into this. \n\nAlso ask her if there is any food she's wanted to try. I find that foreign foods can and have helped me because they make me feel adventurous, but other people prefer trying out yogurts, different protein bars, new fruits/veggies, etc. KEEP ASKING about this. Ask at every shopping trip, which you should insist she attend for a bit, ask every time you think about going to a restaurant. Don't be pushy about it, but rather keep the option open. Knowing she can try something new the second she asks to will mean that whenever she has the courage to, she will ask instead of sitting on that courage until it dissipates. The willpower to eat something can dissipate in mere hours for people with ARFID.\n\nFast and easy foods are also key. Find a cereal she likes, find a \"raw\" food item she enjoys whether it's fruit cups, apple sauce, juice, olives or tomatoes, pepperoni, etc. Having something \"snackable\" means less reliance on sweet foods. I found that much of my affinity for sweets was actually me having nothing else to fall back on that was easy to prep when I was feeling particularly low. I don't actually want to reach for sweets.\n\nLastly, my father liked to say that I shouldn't be having a can of soup every day because too much salt was unhealthy, but on the days I ate a can of soup, I often didn't even eat anything else. Those cans didn't have more than the daily recommended amount of salt, just a lot for the volume. \"Unhealthy\" is relative, and any food is better than none. Changing ARFID habits takes time and courage, and worrying about health can make any setback all the more discouraging. Health worries are for people who can eat a variety of things. You can let her in on the money struggles, but my advice is not to worry about health yet.",
      "created_utc": 1744865128.0,
      "score": 9,
      "context": []
    },
    {
      "id": "mnjb3fl",
      "author": "Tacos_I_Guess",
      "body": "I feel your pain! My 5 year old with ARFID has chicken nuggets for dinner almost every night. The rare occasion he doesn't is when we have pizza, but he'll only eat that with all cheese and toppings removed. \n\nWe've got his first feeding therapy session next week and I'm really hoping it helps.",
      "created_utc": 1744866235.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mnld9jf",
      "author": "IndisClaire",
      "body": "If its a price thing could you potentially buy the nuggets from the supplier (tyson) directly? Greater upfront cost but cheaper after factoring in gas/delivery fee and mark up from mcdonalds? Do you think she would compromise with them being made at home if they are the same brand/same in everyway. From what i can see the only difference is they remove the boot shape to not get sued",
      "created_utc": 1744901188.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mnn53rs",
      "author": "acnerd5",
      "body": "As a 30 something year old mother, I spent 2 years living off of mac and cheese as a teenager. Id occasionally manage a small meal of something else, but Mac n cheese man. I was going through it with stress at the time and my stomach just stopped. \n\nMy mom tried to stop me from making it, and I struggled to eat anything. My dad watched me not eat for 2 days and said, \"you need to eat\" and forced my mom to pull out the mac n cheese she had hidden.\n\nThat being said, no it wasn't the healthiest, but i survived and it is ok to make sure your kid is fed.\n\nThis has NEVER been a choice, my dad wasnt \"enabling\" me. He kept me from getting a feeding tube if I didnt eat. \n\nI didn't get a diagnosis until recently but knowing it wasnt my fault, I wasnt \"crazy\" like they said, I wasnt wrong for doing my best... that mattered more than anything. Having so much drama about my food made me miserable, and stopped me from eating.\n\nOP, your daughter will feel more and more broken the more you push. She's going to wonder why her best isn't enough. Her stomach may stop accepting more foods, and she may lose more of the few safe foods she has left.\n\nRight now, and always, especially with ARFID? She needs your LOVE. She needs your support. She needs your acceptance. It is NOT her fault. It is NOT her choice. Please, do not let her feel broken.",
      "created_utc": 1744919831.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mnl38oo",
      "author": "Cyandraaa",
      "body": "I can’t help with the parenting aspect, but in the meantime, you could try adding [THIS](https://simplyenof.com/) to her food. I use it & love it. You can’t even taste it, either.",
      "created_utc": 1744898149.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mnlbhqu",
      "author": "peachtreeparadise",
      "body": "I empathize with you. \n\nFirst off, *please* do not go cold turkey & cut her off 100%. Being 16 is hard enough without also being autistic, having ARFID, and having a huge move. \n\nI myself am almost 28, autistic, and have ARFID. I’m lucky that *now* my brain is fully developed so I can *reason* and try new foods — like this week I cooked ground beef and roasted broccoli for the first time ever! I felt like such a proper adult! BUT I ate so much fast food in my adolescence because it was so consistent. In my adolescence I thought it was anorexia, not even knowing about ARFID, nor knowing I had autism & adhd — and none of my mental health issues were being addressed so I was fully on the struggle bus. \n\nYour kiddo is going through a major stressor event by 1- moving & having their schedules/ routines completely thrown off & 2- losing the majority of their safe foods. While *you* as an adult also have major stressors (like being the one financially responsible for everything), you have to recognize that their stress feels just as significant & insurmountable as yours because they are *their* stressors (hoping that makes sense). \n\nIf you’re not autistic you won’t know how serious something not being the same is. We crave what is predictable & when it’s not then we can become unregulated& stressed out, especially at 16. Self-regulation is one of those higher-level cognitive skills that we develop as we age, but we also need to be shown *how* to self regulate. I highly, HIGHLY recommend professional help with that, but also with the ARFID. You & your kiddo will be better off once they’re getting the professional help they need to 1- learn how to self regulate as an autistic & 2- be more accepting of variance in their food taste, smell, appearance, temperature, etc. \n\nSome associates professionals may be a registered dietitian who specializes in ARFID, a speech-language pathologist that specializes in pediatric feeding disorders, and a therapist that works with pediatric autistics. I seriously wish y’all the best. In the mean time please be patient with yourself and your kiddo, and know that allowing her *any food she will eat* is the best food for her.\n\n\nEdit: I also just want to add that it’s clear to me how much you care for your child — the fact that you’re concerned for their nutrition. You are *not* a shitty parent. It’s OKAY that you are struggling too. But you’re not shitty. My one tip if your child is willing to try it, is to cook the garlic noodles in bone broth instead of regular water as that will add a little extra nutrition— it will also change the flavor so she would need to be fully on board.",
      "created_utc": 1744900669.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mnndrf3",
      "author": "KingMcB",
      "body": "I just want you to know you’re not alone. For months (YEARS) my 19-year old ARFID kiddo and I have been planning an international trip. We carefully planned our hotel to be able to make some snacks and meals in our room plus be around Americanized food options so they felt safe. UGH. We’re here and tried some local cuisine which sent them spiraling. (Also the local grocery store foods are not the same as home because American foods are toxic waste dumps). \nI’m proud of them for trying but the last two days have been painful because we’ve had to take busses across town to get … MCDONALDS at least once a day. I’m sympathizing with you. \n\nAlso having been a teenager who experienced a cross-country move - give them at least 6-12 months to adjust to just the move. Anxiety is a bitch on top of everything else. \n\nMcDonald’s should offer us an ARFID discount. How many of you/us have a McD’s safe food?!? 😂",
      "created_utc": 1744922396.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mnood8r",
      "author": "kennedylikesbugs",
      "body": "Hey, from a perspective of a teen (18) with arfid, get the McDonald’s so your kid is able to eat and look into a therapist that specializes in arfid and neurodivergence. When your kid is getting snappy about food, it isn’t your kid, it’s the eating disorder talking. I am currently waiting to meet with my new therapist for this purpose because I’m having the same issue that your child seems to be right now. \n\nSince I haven’t been able to get in touch with that therapist since its hard to access, I’ve seen my psychiatrist and she’s prescribed me both a benzodiazepine for my anxiety around eating and also an antipsychotic that stimulates an appetite, this has been one of the only effective things for me right now that even gets me to eat my required 3 meals and select snacks. \n\nIf your kid isn’t meeting dietary needs which it sounds like they aren’t (which I’m not blaming you or your child, I get the struggle.) I recommend starting nutritional supplements, I absolutely cannot stand any of the milkshake drinks made by ensure or boost, but I can tolerate the non creamy boosts which are essentially just a juice packed with vitamins - though I completely hate all the flavours so what I do is mix orange flavoured non creamy boost with actual orange juice, I’ve been doing this daily for 2 months now and have seen real improvement in my bowel movements, I’m not throwing up every day from my overproduction of bile, and life feels somewhat liveable again. If this isn’t something that ends up working out, at least find some sort of gummy vitamin or capsule that your kiddo is willing to take to make sure they’re getting at least SOME of the nutrients they need. \n\nI hope you’re able to get something from this that actually helps you guys out, it’s a really tough place to be in",
      "created_utc": 1744938036.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mnlwuum",
      "author": "Delicious_Impress818",
      "body": "try morningstar chicken nuggets. they’re the only frozen chicken nuggets I like (they’re not real chicken, they’re plant protein so they’re quite a bit healthier than mcdonald’s). they are the same texture all the way through and that never changes. a big thing for ARFID is having food that stays the same consistently every time you eat it, so these are a go to for me because of that reason. \n\nif there are any veggies she likes, my favorite is broccoli, try chopping them small and mixing a few in with her pasta. there are also some garlic cream sauces you can make super easily that will add a little more protein to her noodles. you can also try protein pasta for that, personally I think it tastes just like normal pasta. \n\nif she likes nutella and peanut butter, have you tried a protein smoothie with those ingredients? \n\nalso, sit down with her and work out the reasoning behind why she avoids food. is it fear of choking vomiting, is it a texture thing, is it an aversion to the act of chewing itself, etc. there are different types of ARFID and understanding which one she has will save you so much time in trying to push through this.",
      "created_utc": 1744906873.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mno8064",
      "author": "letsdothisthing88",
      "body": "https://www.reddit.com/r/frozendinners/s/hdY8ML8ldn\n\nThese if you can get them might help. That said you're not spoiling her it's her brain that is different.",
      "created_utc": 1744932145.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mnpe26i",
      "author": "bicripple",
      "body": "Others have pointed out she seems to be in a period of stress. On a *good* day, when she's up for it, I'd recommend getting a whole bunch of bake-at-home nuggets and have her taste test the new options. (It can be a group exercise.)\n\nAssure her she doesn't have to like, or finish all of them. (And don't go back on it!) All she has to do is try each one and report on whether she likes it or not. Best case scenario, you find multiple cheaper options for nuggets.  Worst case, you've ruled out a bunch of options.\n\n\n\nI'd include some McDonald's nuggets in the exercise as as a reference point. Ask your daughter if she'd prefer to do it as a blind taste test (she doesn't know which brand a given nugget is) or an open test (she knows). Blind taste test is ideal but since this is an anxiety about food, hiding the information might be too stressful for her right now.\n\nI personally prefer a numerous brands of fake chicken nuggets over the real stuff so maybe try some of those too. Gardein's lime nuggets are my personal favourites.",
      "created_utc": 1744948310.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mnrj74b",
      "author": "haydesigner",
      "body": "Fully agree with this. I will also add simple advice of: just let her eat what she wants to eat. \n\nStop fighting about it and make everyone’s life better. Whatever your concerns about her eating McDonald’s, those concerns are *far less important* than your child’s mental health.",
      "created_utc": 1744986600.0,
      "score": 0,
      "context": [
        {
          "id": "mni6280",
          "author": "lotteoddities",
          "body": "You need an therapist who is trained to work with Autistic patients and ARFID specifically. Or a skills coach. Both will have ways to communicate with your teenager to find out how to expand their safe food list and hopefully get off of daily McDonald's.",
          "created_utc": 1744849799.0
        }
      ]
    },
    {
      "id": "mnkemct",
      "author": "quirky-enby",
      "body": "Seconding this, and adding on: when you’re 16 years old, your brain still isn’t fully developed. The anxiety & stress truly can feel like you’re defending yourself against tigers hellbent on eating your face, instead of just the shame/anxiety of “what happens if my nuggets aren’t affordable?” Layer rhat on top of daily stressors and you’ve got yourself a mess. \n\nAll that to say, please do also look into PMDD. Many autistic/ADD folks have that as a comorbidity, and learning how different times of the month affect me was a lifesaver (plus propranolol for me). Even though I had PCOS so it was a bit erratic, I was able to learn to associate body/emotional cues to discover when I’m more likely to be on a hair trigger & need comfort food vs when I’d be okay eating “Okay-ish food”",
      "created_utc": 1744889036.0,
      "score": 46,
      "context": [
        {
          "id": "mniarlo",
          "author": "dioor",
          "body": "I want to preface this by saying that I am a fully-functional adult in my mid-30s — people other than my husband and closest family, who I’m most open with about my struggles, would consider me very high functioning. I am healthy, financially stable, work full time, am happily married, etc. \n\nWhen I’m stressed, I can basically only eat 5 minute rice with margarine. There are weeks when that and Diet Coke and Starbucks baked goods are all I’m ingesting. My Starbucks spending is probably my #1 vice. It’s a comfort thing. I’ve had full-on panic attacks over leftovers my husband has in the fridge before. \n\nIf someone took away my safe meal and comfort snacks I wouldn’t eat better, I would just be hungry and even more stressed. When I’m going through it, the source(s) of stress and anxiety needs to be attacked first — I need to be able to manage and navigate those things, and then I can work on reintegrating healthier and more varied foods. I only know this because I’ve been me for 35 years, at some point I clued in to just how abnormal I am, and I have gotten really good at managing myself. \n\nSo from my perspective you are not enabling or doing anything wrong. You’re making sure your child gets fed which is absolutely paramount. It is a bit unhelpful to bring up the economics of eating mostly McDonalds, because this might contribute to her guilt/stress. I’d support her in eating what she will temporarily, if you can swing it, without making it “a thing” — while working toward the goal of healthier and more economical eating habits by minimizing/managing other sources of stress and anxiety first. \n\nARFID is *not* a junk food addiction. It is an anxiety condition. So “enabling” isn’t really a thing. You are in a position to genuinely help your child’s life be more manageable for them, but it is definitely not a straight line to force-feeding better meal options.",
          "created_utc": 1744851512.0
        }
      ]
    },
    {
      "id": "mnob82x",
      "author": "likeaparasite",
      "body": "Thank you. It does make her feel guilty to know the $ of it, but we were really at a loss on how to talk her *out of it* and grasping straws. Because that's everything we're told as parents you know, \"picky eating is a result of bad parenting\" - or at least that's how I've been treated. She became picky on her 3rd birthday and I remember the exact meal she refused. Her teachers commented on her eating all the time. It's been something we've revolved around for most of her life. It's frustrating and sad.",
      "created_utc": 1744933263.0,
      "score": 7,
      "context": [
        {
          "id": "mniarlo",
          "author": "dioor",
          "body": "I want to preface this by saying that I am a fully-functional adult in my mid-30s — people other than my husband and closest family, who I’m most open with about my struggles, would consider me very high functioning. I am healthy, financially stable, work full time, am happily married, etc. \n\nWhen I’m stressed, I can basically only eat 5 minute rice with margarine. There are weeks when that and Diet Coke and Starbucks baked goods are all I’m ingesting. My Starbucks spending is probably my #1 vice. It’s a comfort thing. I’ve had full-on panic attacks over leftovers my husband has in the fridge before. \n\nIf someone took away my safe meal and comfort snacks I wouldn’t eat better, I would just be hungry and even more stressed. When I’m going through it, the source(s) of stress and anxiety needs to be attacked first — I need to be able to manage and navigate those things, and then I can work on reintegrating healthier and more varied foods. I only know this because I’ve been me for 35 years, at some point I clued in to just how abnormal I am, and I have gotten really good at managing myself. \n\nSo from my perspective you are not enabling or doing anything wrong. You’re making sure your child gets fed which is absolutely paramount. It is a bit unhelpful to bring up the economics of eating mostly McDonalds, because this might contribute to her guilt/stress. I’d support her in eating what she will temporarily, if you can swing it, without making it “a thing” — while working toward the goal of healthier and more economical eating habits by minimizing/managing other sources of stress and anxiety first. \n\nARFID is *not* a junk food addiction. It is an anxiety condition. So “enabling” isn’t really a thing. You are in a position to genuinely help your child’s life be more manageable for them, but it is definitely not a straight line to force-feeding better meal options.",
          "created_utc": 1744851512.0
        }
      ]
    },
    {
      "id": "mnjsci6",
      "author": "harpyoftheshore",
      "body": "I wish i had gold to give you",
      "created_utc": 1744876252.0,
      "score": 14,
      "context": [
        {
          "id": "mniarlo",
          "author": "dioor",
          "body": "I want to preface this by saying that I am a fully-functional adult in my mid-30s — people other than my husband and closest family, who I’m most open with about my struggles, would consider me very high functioning. I am healthy, financially stable, work full time, am happily married, etc. \n\nWhen I’m stressed, I can basically only eat 5 minute rice with margarine. There are weeks when that and Diet Coke and Starbucks baked goods are all I’m ingesting. My Starbucks spending is probably my #1 vice. It’s a comfort thing. I’ve had full-on panic attacks over leftovers my husband has in the fridge before. \n\nIf someone took away my safe meal and comfort snacks I wouldn’t eat better, I would just be hungry and even more stressed. When I’m going through it, the source(s) of stress and anxiety needs to be attacked first — I need to be able to manage and navigate those things, and then I can work on reintegrating healthier and more varied foods. I only know this because I’ve been me for 35 years, at some point I clued in to just how abnormal I am, and I have gotten really good at managing myself. \n\nSo from my perspective you are not enabling or doing anything wrong. You’re making sure your child gets fed which is absolutely paramount. It is a bit unhelpful to bring up the economics of eating mostly McDonalds, because this might contribute to her guilt/stress. I’d support her in eating what she will temporarily, if you can swing it, without making it “a thing” — while working toward the goal of healthier and more economical eating habits by minimizing/managing other sources of stress and anxiety first. \n\nARFID is *not* a junk food addiction. It is an anxiety condition. So “enabling” isn’t really a thing. You are in a position to genuinely help your child’s life be more manageable for them, but it is definitely not a straight line to force-feeding better meal options.",
          "created_utc": 1744851512.0
        }
      ]
    },
    {
      "id": "mnmim7b",
      "author": "Lasagan",
      "body": "I agree completely. When I'm having a particularly hard time with eating, it's almost always triggered by extra stress and anxiety. Punishing myself by withholding food I know I'll eat only makes my situation worse.",
      "created_utc": 1744913105.0,
      "score": 5,
      "context": [
        {
          "id": "mniarlo",
          "author": "dioor",
          "body": "I want to preface this by saying that I am a fully-functional adult in my mid-30s — people other than my husband and closest family, who I’m most open with about my struggles, would consider me very high functioning. I am healthy, financially stable, work full time, am happily married, etc. \n\nWhen I’m stressed, I can basically only eat 5 minute rice with margarine. There are weeks when that and Diet Coke and Starbucks baked goods are all I’m ingesting. My Starbucks spending is probably my #1 vice. It’s a comfort thing. I’ve had full-on panic attacks over leftovers my husband has in the fridge before. \n\nIf someone took away my safe meal and comfort snacks I wouldn’t eat better, I would just be hungry and even more stressed. When I’m going through it, the source(s) of stress and anxiety needs to be attacked first — I need to be able to manage and navigate those things, and then I can work on reintegrating healthier and more varied foods. I only know this because I’ve been me for 35 years, at some point I clued in to just how abnormal I am, and I have gotten really good at managing myself. \n\nSo from my perspective you are not enabling or doing anything wrong. You’re making sure your child gets fed which is absolutely paramount. It is a bit unhelpful to bring up the economics of eating mostly McDonalds, because this might contribute to her guilt/stress. I’d support her in eating what she will temporarily, if you can swing it, without making it “a thing” — while working toward the goal of healthier and more economical eating habits by minimizing/managing other sources of stress and anxiety first. \n\nARFID is *not* a junk food addiction. It is an anxiety condition. So “enabling” isn’t really a thing. You are in a position to genuinely help your child’s life be more manageable for them, but it is definitely not a straight line to force-feeding better meal options.",
          "created_utc": 1744851512.0
        }
      ]
    },
    {
      "id": "mnq5a3t",
      "author": "eggcetera2",
      "body": "I love this response and I can relate. I have had ARFID since age 2 or 3 and didn’t discover it until I was in my 20’s. \nAbout two years ago, I was doing very well in life: full time job, new apartment, extra money, had just met my girlfriend, mental and physical health were stable. During that year, I ate more new foods than I had in my entire life. Foods I had always said I would “never be able to try.” It was eye opening and exhilarating. I was 24 and I had never eaten a bean or a kiwi or salad before. \nThen in this last year, I lost my job, my physical and mental health significantly declined, I got in a car accident and there’s even more crap going on. And now with my increased anxiety, all I can eat is cereal, Eggo’s, rice, pasta, crackers, and chocolate. I didn’t notice this connection until a month or so ago.\n*Edit: spelling",
      "created_utc": 1744963670.0,
      "score": 5,
      "context": [
        {
          "id": "mniarlo",
          "author": "dioor",
          "body": "I want to preface this by saying that I am a fully-functional adult in my mid-30s — people other than my husband and closest family, who I’m most open with about my struggles, would consider me very high functioning. I am healthy, financially stable, work full time, am happily married, etc. \n\nWhen I’m stressed, I can basically only eat 5 minute rice with margarine. There are weeks when that and Diet Coke and Starbucks baked goods are all I’m ingesting. My Starbucks spending is probably my #1 vice. It’s a comfort thing. I’ve had full-on panic attacks over leftovers my husband has in the fridge before. \n\nIf someone took away my safe meal and comfort snacks I wouldn’t eat better, I would just be hungry and even more stressed. When I’m going through it, the source(s) of stress and anxiety needs to be attacked first — I need to be able to manage and navigate those things, and then I can work on reintegrating healthier and more varied foods. I only know this because I’ve been me for 35 years, at some point I clued in to just how abnormal I am, and I have gotten really good at managing myself. \n\nSo from my perspective you are not enabling or doing anything wrong. You’re making sure your child gets fed which is absolutely paramount. It is a bit unhelpful to bring up the economics of eating mostly McDonalds, because this might contribute to her guilt/stress. I’d support her in eating what she will temporarily, if you can swing it, without making it “a thing” — while working toward the goal of healthier and more economical eating habits by minimizing/managing other sources of stress and anxiety first. \n\nARFID is *not* a junk food addiction. It is an anxiety condition. So “enabling” isn’t really a thing. You are in a position to genuinely help your child’s life be more manageable for them, but it is definitely not a straight line to force-feeding better meal options.",
          "created_utc": 1744851512.0
        }
      ]
    },
    {
      "id": "mno9d5c",
      "author": "likeaparasite",
      "body": "Thank you.",
      "created_utc": 1744932616.0,
      "score": 1,
      "context": [
        {
          "id": "mnn53rs",
          "author": "acnerd5",
          "body": "As a 30 something year old mother, I spent 2 years living off of mac and cheese as a teenager. Id occasionally manage a small meal of something else, but Mac n cheese man. I was going through it with stress at the time and my stomach just stopped. \n\nMy mom tried to stop me from making it, and I struggled to eat anything. My dad watched me not eat for 2 days and said, \"you need to eat\" and forced my mom to pull out the mac n cheese she had hidden.\n\nThat being said, no it wasn't the healthiest, but i survived and it is ok to make sure your kid is fed.\n\nThis has NEVER been a choice, my dad wasnt \"enabling\" me. He kept me from getting a feeding tube if I didnt eat. \n\nI didn't get a diagnosis until recently but knowing it wasnt my fault, I wasnt \"crazy\" like they said, I wasnt wrong for doing my best... that mattered more than anything. Having so much drama about my food made me miserable, and stopped me from eating.\n\nOP, your daughter will feel more and more broken the more you push. She's going to wonder why her best isn't enough. Her stomach may stop accepting more foods, and she may lose more of the few safe foods she has left.\n\nRight now, and always, especially with ARFID? She needs your LOVE. She needs your support. She needs your acceptance. It is NOT her fault. It is NOT her choice. Please, do not let her feel broken.",
          "created_utc": 1744919831.0
        }
      ]
    },
    {
      "id": "mnvl5jo",
      "author": "Peanut27Butter",
      "body": "That product (ENOF)  is THE reason why I am not panicking that my child only eats 5-10 things (10 is a stretch). I stir it in his milk. It seems to disappear in there, but just in case it is served in a cup with a lid, and he has never known it's in there!",
      "created_utc": 1745036254.0,
      "score": 2,
      "context": [
        {
          "id": "mnl38oo",
          "author": "Cyandraaa",
          "body": "I can’t help with the parenting aspect, but in the meantime, you could try adding [THIS](https://simplyenof.com/) to her food. I use it & love it. You can’t even taste it, either.",
          "created_utc": 1744898149.0
        }
      ]
    },
    {
      "id": "mnwg94s",
      "author": "jerzeett",
      "body": "I'm an adult but thank you so much for this! I've been using ovalfine but it has so much sugar",
      "created_utc": 1745054479.0,
      "score": 2,
      "context": [
        {
          "id": "mnl38oo",
          "author": "Cyandraaa",
          "body": "I can’t help with the parenting aspect, but in the meantime, you could try adding [THIS](https://simplyenof.com/) to her food. I use it & love it. You can’t even taste it, either.",
          "created_utc": 1744898149.0
        }
      ]
    },
    {
      "id": "mno97ps",
      "author": "likeaparasite",
      "body": "Our first stop across the border was McDonalds for lunch and nobody warned me that the bbq dipping sauce is different. *I* had a panic attack, but she said \"I'll try to get used to it.\" and she actually did. I still don't like it personally haha",
      "created_utc": 1744932564.0,
      "score": 2,
      "context": [
        {
          "id": "mnndrf3",
          "author": "KingMcB",
          "body": "I just want you to know you’re not alone. For months (YEARS) my 19-year old ARFID kiddo and I have been planning an international trip. We carefully planned our hotel to be able to make some snacks and meals in our room plus be around Americanized food options so they felt safe. UGH. We’re here and tried some local cuisine which sent them spiraling. (Also the local grocery store foods are not the same as home because American foods are toxic waste dumps). \nI’m proud of them for trying but the last two days have been painful because we’ve had to take busses across town to get … MCDONALDS at least once a day. I’m sympathizing with you. \n\nAlso having been a teenager who experienced a cross-country move - give them at least 6-12 months to adjust to just the move. Anxiety is a bitch on top of everything else. \n\nMcDonald’s should offer us an ARFID discount. How many of you/us have a McD’s safe food?!? 😂",
          "created_utc": 1744922396.0
        }
      ]
    },
    {
      "id": "mns19rx",
      "author": "garsha-man",
      "body": "I’m sorry but this is just not true. Having ARFID, just eating whatever you want, if it’s extremely limited, WILL lead to nutritional deficiencies—not only will this severely impact physical health both short and long term, it WILL affect their mental health as well—nutrition and mental health are intrinsically linked. This is just one aspect that makes ARFID so difficult to deal with.",
      "created_utc": 1744992023.0,
      "score": 7,
      "context": [
        {
          "id": "mni6280",
          "author": "lotteoddities",
          "body": "You need an therapist who is trained to work with Autistic patients and ARFID specifically. Or a skills coach. Both will have ways to communicate with your teenager to find out how to expand their safe food list and hopefully get off of daily McDonald's.",
          "created_utc": 1744849799.0
        },
        {
          "id": "mnrj74b",
          "author": "haydesigner",
          "body": "Fully agree with this. I will also add simple advice of: just let her eat what she wants to eat. \n\nStop fighting about it and make everyone’s life better. Whatever your concerns about her eating McDonald’s, those concerns are *far less important* than your child’s mental health.",
          "created_utc": 1744986600.0
        }
      ]
    },
    {
      "id": "moppefq",
      "author": "Issababy22",
      "body": "I agree as someone who believes they have ARFID and I was raised with parents who tried the forcing thing when I was younger but eventually came to terms with my habits my mother still encouraged me to eat and try new things but by the time I was 9 she stopped arguing with me ab it or using the tactics like before to try to get me to “eat normal”",
      "created_utc": 1745458102.0,
      "score": 2,
      "context": [
        {
          "id": "mni6280",
          "author": "lotteoddities",
          "body": "You need an therapist who is trained to work with Autistic patients and ARFID specifically. Or a skills coach. Both will have ways to communicate with your teenager to find out how to expand their safe food list and hopefully get off of daily McDonald's.",
          "created_utc": 1744849799.0
        },
        {
          "id": "mnrj74b",
          "author": "haydesigner",
          "body": "Fully agree with this. I will also add simple advice of: just let her eat what she wants to eat. \n\nStop fighting about it and make everyone’s life better. Whatever your concerns about her eating McDonald’s, those concerns are *far less important* than your child’s mental health.",
          "created_utc": 1744986600.0
        }
      ]
    },
    {
      "id": "mnkonc0",
      "author": "dioor",
      "body": "Oh this is *such* a good point. It took me most of my life to make the connection to my cycle!",
      "created_utc": 1744893134.0,
      "score": 12,
      "context": [
        {
          "id": "mniarlo",
          "author": "dioor",
          "body": "I want to preface this by saying that I am a fully-functional adult in my mid-30s — people other than my husband and closest family, who I’m most open with about my struggles, would consider me very high functioning. I am healthy, financially stable, work full time, am happily married, etc. \n\nWhen I’m stressed, I can basically only eat 5 minute rice with margarine. There are weeks when that and Diet Coke and Starbucks baked goods are all I’m ingesting. My Starbucks spending is probably my #1 vice. It’s a comfort thing. I’ve had full-on panic attacks over leftovers my husband has in the fridge before. \n\nIf someone took away my safe meal and comfort snacks I wouldn’t eat better, I would just be hungry and even more stressed. When I’m going through it, the source(s) of stress and anxiety needs to be attacked first — I need to be able to manage and navigate those things, and then I can work on reintegrating healthier and more varied foods. I only know this because I’ve been me for 35 years, at some point I clued in to just how abnormal I am, and I have gotten really good at managing myself. \n\nSo from my perspective you are not enabling or doing anything wrong. You’re making sure your child gets fed which is absolutely paramount. It is a bit unhelpful to bring up the economics of eating mostly McDonalds, because this might contribute to her guilt/stress. I’d support her in eating what she will temporarily, if you can swing it, without making it “a thing” — while working toward the goal of healthier and more economical eating habits by minimizing/managing other sources of stress and anxiety first. \n\nARFID is *not* a junk food addiction. It is an anxiety condition. So “enabling” isn’t really a thing. You are in a position to genuinely help your child’s life be more manageable for them, but it is definitely not a straight line to force-feeding better meal options.",
          "created_utc": 1744851512.0
        },
        {
          "id": "mnkemct",
          "author": "quirky-enby",
          "body": "Seconding this, and adding on: when you’re 16 years old, your brain still isn’t fully developed. The anxiety & stress truly can feel like you’re defending yourself against tigers hellbent on eating your face, instead of just the shame/anxiety of “what happens if my nuggets aren’t affordable?” Layer rhat on top of daily stressors and you’ve got yourself a mess. \n\nAll that to say, please do also look into PMDD. Many autistic/ADD folks have that as a comorbidity, and learning how different times of the month affect me was a lifesaver (plus propranolol for me). Even though I had PCOS so it was a bit erratic, I was able to learn to associate body/emotional cues to discover when I’m more likely to be on a hair trigger & need comfort food vs when I’d be okay eating “Okay-ish food”",
          "created_utc": 1744889036.0
        }
      ]
    },
    {
      "id": "mno8qkq",
      "author": "likeaparasite",
      "body": "I didn't know there was that PMDD connection! She is already on a continuous use birth control because her cycle was so rough.",
      "created_utc": 1744932399.0,
      "score": 3,
      "context": [
        {
          "id": "mniarlo",
          "author": "dioor",
          "body": "I want to preface this by saying that I am a fully-functional adult in my mid-30s — people other than my husband and closest family, who I’m most open with about my struggles, would consider me very high functioning. I am healthy, financially stable, work full time, am happily married, etc. \n\nWhen I’m stressed, I can basically only eat 5 minute rice with margarine. There are weeks when that and Diet Coke and Starbucks baked goods are all I’m ingesting. My Starbucks spending is probably my #1 vice. It’s a comfort thing. I’ve had full-on panic attacks over leftovers my husband has in the fridge before. \n\nIf someone took away my safe meal and comfort snacks I wouldn’t eat better, I would just be hungry and even more stressed. When I’m going through it, the source(s) of stress and anxiety needs to be attacked first — I need to be able to manage and navigate those things, and then I can work on reintegrating healthier and more varied foods. I only know this because I’ve been me for 35 years, at some point I clued in to just how abnormal I am, and I have gotten really good at managing myself. \n\nSo from my perspective you are not enabling or doing anything wrong. You’re making sure your child gets fed which is absolutely paramount. It is a bit unhelpful to bring up the economics of eating mostly McDonalds, because this might contribute to her guilt/stress. I’d support her in eating what she will temporarily, if you can swing it, without making it “a thing” — while working toward the goal of healthier and more economical eating habits by minimizing/managing other sources of stress and anxiety first. \n\nARFID is *not* a junk food addiction. It is an anxiety condition. So “enabling” isn’t really a thing. You are in a position to genuinely help your child’s life be more manageable for them, but it is definitely not a straight line to force-feeding better meal options.",
          "created_utc": 1744851512.0
        },
        {
          "id": "mnkemct",
          "author": "quirky-enby",
          "body": "Seconding this, and adding on: when you’re 16 years old, your brain still isn’t fully developed. The anxiety & stress truly can feel like you’re defending yourself against tigers hellbent on eating your face, instead of just the shame/anxiety of “what happens if my nuggets aren’t affordable?” Layer rhat on top of daily stressors and you’ve got yourself a mess. \n\nAll that to say, please do also look into PMDD. Many autistic/ADD folks have that as a comorbidity, and learning how different times of the month affect me was a lifesaver (plus propranolol for me). Even though I had PCOS so it was a bit erratic, I was able to learn to associate body/emotional cues to discover when I’m more likely to be on a hair trigger & need comfort food vs when I’d be okay eating “Okay-ish food”",
          "created_utc": 1744889036.0
        }
      ]
    },
    {
      "id": "mnpx7ui",
      "author": "LittleAstrophysicist",
      "body": "That's the unfortunate thing. You can't talk your way out of arfid.",
      "created_utc": 1744958641.0,
      "score": 7,
      "context": [
        {
          "id": "mniarlo",
          "author": "dioor",
          "body": "I want to preface this by saying that I am a fully-functional adult in my mid-30s — people other than my husband and closest family, who I’m most open with about my struggles, would consider me very high functioning. I am healthy, financially stable, work full time, am happily married, etc. \n\nWhen I’m stressed, I can basically only eat 5 minute rice with margarine. There are weeks when that and Diet Coke and Starbucks baked goods are all I’m ingesting. My Starbucks spending is probably my #1 vice. It’s a comfort thing. I’ve had full-on panic attacks over leftovers my husband has in the fridge before. \n\nIf someone took away my safe meal and comfort snacks I wouldn’t eat better, I would just be hungry and even more stressed. When I’m going through it, the source(s) of stress and anxiety needs to be attacked first — I need to be able to manage and navigate those things, and then I can work on reintegrating healthier and more varied foods. I only know this because I’ve been me for 35 years, at some point I clued in to just how abnormal I am, and I have gotten really good at managing myself. \n\nSo from my perspective you are not enabling or doing anything wrong. You’re making sure your child gets fed which is absolutely paramount. It is a bit unhelpful to bring up the economics of eating mostly McDonalds, because this might contribute to her guilt/stress. I’d support her in eating what she will temporarily, if you can swing it, without making it “a thing” — while working toward the goal of healthier and more economical eating habits by minimizing/managing other sources of stress and anxiety first. \n\nARFID is *not* a junk food addiction. It is an anxiety condition. So “enabling” isn’t really a thing. You are in a position to genuinely help your child’s life be more manageable for them, but it is definitely not a straight line to force-feeding better meal options.",
          "created_utc": 1744851512.0
        },
        {
          "id": "mnob82x",
          "author": "likeaparasite",
          "body": "Thank you. It does make her feel guilty to know the $ of it, but we were really at a loss on how to talk her *out of it* and grasping straws. Because that's everything we're told as parents you know, \"picky eating is a result of bad parenting\" - or at least that's how I've been treated. She became picky on her 3rd birthday and I remember the exact meal she refused. Her teachers commented on her eating all the time. It's been something we've revolved around for most of her life. It's frustrating and sad.",
          "created_utc": 1744933263.0
        }
      ]
    },
    {
      "id": "mns2v39",
      "author": "dioor",
      "body": "Unfortunately, anxiety is not rational. Being reminded how irrational/unhealthy/costly etc. your eating choices are compounds things, as someone with ARFID, because you feel guilty and called out. And you already knew it was bad, but you were trying your best. It sucks to be reminded how bad “your best” healthy eating looks to people who aren’t dealing with the same anxieties. Doing well managing this condition rarely looks particularly impressive to anyone else, so you just kind of toot your own horn and get used to carrying around other people’s judgement and misunderstanding and negativity. \n\nShe needs to build coping strategies and be able to focus her energy on things that make her happy and less stressed. Therapy can be part of it (I have never been to therapy personally, but do lean on my family doctor). Routine is great. Everyone is different, but she will probably tell you want she needs and some of it might be possible to accommodate — and then she can use the extra “space” that frees up to deal with the things she doesn’t like but *has* to do — if this makes any sense. \n\nOther people are judgemental and awful and need to just be tuned out, as hard as that is. If people are going to be jerks and hypocrites anyway, I would just tell them she’s dealing with severe allergies or the more ambiguous “food sensitivities” rather than try to explain ARFID.",
      "created_utc": 1744992507.0,
      "score": 2,
      "context": [
        {
          "id": "mniarlo",
          "author": "dioor",
          "body": "I want to preface this by saying that I am a fully-functional adult in my mid-30s — people other than my husband and closest family, who I’m most open with about my struggles, would consider me very high functioning. I am healthy, financially stable, work full time, am happily married, etc. \n\nWhen I’m stressed, I can basically only eat 5 minute rice with margarine. There are weeks when that and Diet Coke and Starbucks baked goods are all I’m ingesting. My Starbucks spending is probably my #1 vice. It’s a comfort thing. I’ve had full-on panic attacks over leftovers my husband has in the fridge before. \n\nIf someone took away my safe meal and comfort snacks I wouldn’t eat better, I would just be hungry and even more stressed. When I’m going through it, the source(s) of stress and anxiety needs to be attacked first — I need to be able to manage and navigate those things, and then I can work on reintegrating healthier and more varied foods. I only know this because I’ve been me for 35 years, at some point I clued in to just how abnormal I am, and I have gotten really good at managing myself. \n\nSo from my perspective you are not enabling or doing anything wrong. You’re making sure your child gets fed which is absolutely paramount. It is a bit unhelpful to bring up the economics of eating mostly McDonalds, because this might contribute to her guilt/stress. I’d support her in eating what she will temporarily, if you can swing it, without making it “a thing” — while working toward the goal of healthier and more economical eating habits by minimizing/managing other sources of stress and anxiety first. \n\nARFID is *not* a junk food addiction. It is an anxiety condition. So “enabling” isn’t really a thing. You are in a position to genuinely help your child’s life be more manageable for them, but it is definitely not a straight line to force-feeding better meal options.",
          "created_utc": 1744851512.0
        },
        {
          "id": "mnob82x",
          "author": "likeaparasite",
          "body": "Thank you. It does make her feel guilty to know the $ of it, but we were really at a loss on how to talk her *out of it* and grasping straws. Because that's everything we're told as parents you know, \"picky eating is a result of bad parenting\" - or at least that's how I've been treated. She became picky on her 3rd birthday and I remember the exact meal she refused. Her teachers commented on her eating all the time. It's been something we've revolved around for most of her life. It's frustrating and sad.",
          "created_utc": 1744933263.0
        }
      ]
    },
    {
      "id": "mo5zfb0",
      "author": "msmustyslush",
      "body": "Hey OP, I’m glad you’re looking for insight on this issue with your daughter! I’m relating to a lot of this post so just wanted to mention a few things that may be worth considering moving forward. \n\n1. I’d encourage you to be cautious with your words when arguing with her. You mention the financial aspect does make her feel guilty. Please remember that our brains can latch onto these things and they may follow her into adulthood and be detrimental to her progress even though you’re well intentioned. \n\n(In my case, that financial guilt has transformed into anxiety in adulthood over trying new foods because if I struggle to eat them I’m “wasting money.”)\n\n2. When you start to feel like others are viewing you as a bad parent, I encourage you to take a step back and reevaluate. My family often chose looking like a good parent over actually being a good parent. It would be a shame to prioritize appearances over your daughter’s well being. \n\n3. When it’s frustrating and sad for you, remember it’s even harder for her! No one wants to struggle with ARFID and eating difficulties. It may feel like she’s intentionally defying you or working against you but in reality her mind and body are working against her. Please seek professional help if possible to help you maintain empathy when approaching the situation. \n\nWishing you the best of luck tackling this issue together 🫶🏻",
      "created_utc": 1745189557.0,
      "score": 2,
      "context": [
        {
          "id": "mniarlo",
          "author": "dioor",
          "body": "I want to preface this by saying that I am a fully-functional adult in my mid-30s — people other than my husband and closest family, who I’m most open with about my struggles, would consider me very high functioning. I am healthy, financially stable, work full time, am happily married, etc. \n\nWhen I’m stressed, I can basically only eat 5 minute rice with margarine. There are weeks when that and Diet Coke and Starbucks baked goods are all I’m ingesting. My Starbucks spending is probably my #1 vice. It’s a comfort thing. I’ve had full-on panic attacks over leftovers my husband has in the fridge before. \n\nIf someone took away my safe meal and comfort snacks I wouldn’t eat better, I would just be hungry and even more stressed. When I’m going through it, the source(s) of stress and anxiety needs to be attacked first — I need to be able to manage and navigate those things, and then I can work on reintegrating healthier and more varied foods. I only know this because I’ve been me for 35 years, at some point I clued in to just how abnormal I am, and I have gotten really good at managing myself. \n\nSo from my perspective you are not enabling or doing anything wrong. You’re making sure your child gets fed which is absolutely paramount. It is a bit unhelpful to bring up the economics of eating mostly McDonalds, because this might contribute to her guilt/stress. I’d support her in eating what she will temporarily, if you can swing it, without making it “a thing” — while working toward the goal of healthier and more economical eating habits by minimizing/managing other sources of stress and anxiety first. \n\nARFID is *not* a junk food addiction. It is an anxiety condition. So “enabling” isn’t really a thing. You are in a position to genuinely help your child’s life be more manageable for them, but it is definitely not a straight line to force-feeding better meal options.",
          "created_utc": 1744851512.0
        },
        {
          "id": "mnob82x",
          "author": "likeaparasite",
          "body": "Thank you. It does make her feel guilty to know the $ of it, but we were really at a loss on how to talk her *out of it* and grasping straws. Because that's everything we're told as parents you know, \"picky eating is a result of bad parenting\" - or at least that's how I've been treated. She became picky on her 3rd birthday and I remember the exact meal she refused. Her teachers commented on her eating all the time. It's been something we've revolved around for most of her life. It's frustrating and sad.",
          "created_utc": 1744933263.0
        }
      ]
    },
    {
      "id": "mnrfjmj",
      "author": "Smorsdoeuvres",
      "body": "I’m worried my oldest is struggling with ARFID and have been for a few years, they turn 8 this fall, and while I recall quite a few moments that seemed to be real stressors for my child, I’m not sure there is 1 in my mind as *the* tipping point. Do you mind sharing more of the journey you have had with your child, the issues and the discovery? Do you (or anyone else in the thread) have any tips for other parents out there trying to help their child stressed at the table?",
      "created_utc": 1744985453.0,
      "score": 1,
      "context": [
        {
          "id": "mniarlo",
          "author": "dioor",
          "body": "I want to preface this by saying that I am a fully-functional adult in my mid-30s — people other than my husband and closest family, who I’m most open with about my struggles, would consider me very high functioning. I am healthy, financially stable, work full time, am happily married, etc. \n\nWhen I’m stressed, I can basically only eat 5 minute rice with margarine. There are weeks when that and Diet Coke and Starbucks baked goods are all I’m ingesting. My Starbucks spending is probably my #1 vice. It’s a comfort thing. I’ve had full-on panic attacks over leftovers my husband has in the fridge before. \n\nIf someone took away my safe meal and comfort snacks I wouldn’t eat better, I would just be hungry and even more stressed. When I’m going through it, the source(s) of stress and anxiety needs to be attacked first — I need to be able to manage and navigate those things, and then I can work on reintegrating healthier and more varied foods. I only know this because I’ve been me for 35 years, at some point I clued in to just how abnormal I am, and I have gotten really good at managing myself. \n\nSo from my perspective you are not enabling or doing anything wrong. You’re making sure your child gets fed which is absolutely paramount. It is a bit unhelpful to bring up the economics of eating mostly McDonalds, because this might contribute to her guilt/stress. I’d support her in eating what she will temporarily, if you can swing it, without making it “a thing” — while working toward the goal of healthier and more economical eating habits by minimizing/managing other sources of stress and anxiety first. \n\nARFID is *not* a junk food addiction. It is an anxiety condition. So “enabling” isn’t really a thing. You are in a position to genuinely help your child’s life be more manageable for them, but it is definitely not a straight line to force-feeding better meal options.",
          "created_utc": 1744851512.0
        },
        {
          "id": "mnob82x",
          "author": "likeaparasite",
          "body": "Thank you. It does make her feel guilty to know the $ of it, but we were really at a loss on how to talk her *out of it* and grasping straws. Because that's everything we're told as parents you know, \"picky eating is a result of bad parenting\" - or at least that's how I've been treated. She became picky on her 3rd birthday and I remember the exact meal she refused. Her teachers commented on her eating all the time. It's been something we've revolved around for most of her life. It's frustrating and sad.",
          "created_utc": 1744933263.0
        }
      ]
    },
    {
      "id": "mnladki",
      "author": "dioor",
      "body": "I’m just grateful that this is relatable to this community and hope my insight can be remotely useful to someone! I thought it was just me for so long.. it is so frustrating having people pass judgement, like as if you are making a conscious choice to have an unhealthy diet — especially when you’re actually making huge strides for yourself, but for a normal eater it still looks like you’re eating what they consider junk/plain/etc.",
      "created_utc": 1744900335.0,
      "score": 12,
      "context": [
        {
          "id": "mniarlo",
          "author": "dioor",
          "body": "I want to preface this by saying that I am a fully-functional adult in my mid-30s — people other than my husband and closest family, who I’m most open with about my struggles, would consider me very high functioning. I am healthy, financially stable, work full time, am happily married, etc. \n\nWhen I’m stressed, I can basically only eat 5 minute rice with margarine. There are weeks when that and Diet Coke and Starbucks baked goods are all I’m ingesting. My Starbucks spending is probably my #1 vice. It’s a comfort thing. I’ve had full-on panic attacks over leftovers my husband has in the fridge before. \n\nIf someone took away my safe meal and comfort snacks I wouldn’t eat better, I would just be hungry and even more stressed. When I’m going through it, the source(s) of stress and anxiety needs to be attacked first — I need to be able to manage and navigate those things, and then I can work on reintegrating healthier and more varied foods. I only know this because I’ve been me for 35 years, at some point I clued in to just how abnormal I am, and I have gotten really good at managing myself. \n\nSo from my perspective you are not enabling or doing anything wrong. You’re making sure your child gets fed which is absolutely paramount. It is a bit unhelpful to bring up the economics of eating mostly McDonalds, because this might contribute to her guilt/stress. I’d support her in eating what she will temporarily, if you can swing it, without making it “a thing” — while working toward the goal of healthier and more economical eating habits by minimizing/managing other sources of stress and anxiety first. \n\nARFID is *not* a junk food addiction. It is an anxiety condition. So “enabling” isn’t really a thing. You are in a position to genuinely help your child’s life be more manageable for them, but it is definitely not a straight line to force-feeding better meal options.",
          "created_utc": 1744851512.0
        },
        {
          "id": "mnjsci6",
          "author": "harpyoftheshore",
          "body": "I wish i had gold to give you",
          "created_utc": 1744876252.0
        }
      ]
    },
    {
      "id": "mnwgc0l",
      "author": "Cyandraaa",
      "body": "Hey I’m grown too & I use it. Anything helps!",
      "created_utc": 1745054531.0,
      "score": 1,
      "context": [
        {
          "id": "mnl38oo",
          "author": "Cyandraaa",
          "body": "I can’t help with the parenting aspect, but in the meantime, you could try adding [THIS](https://simplyenof.com/) to her food. I use it & love it. You can’t even taste it, either.",
          "created_utc": 1744898149.0
        },
        {
          "id": "mnwg94s",
          "author": "jerzeett",
          "body": "I'm an adult but thank you so much for this! I've been using ovalfine but it has so much sugar",
          "created_utc": 1745054479.0
        }
      ]
    },
    {
      "id": "mnqcb7b",
      "author": "KingMcB",
      "body": "We are in Europe where ketchup is markedly different, tho it’s more similar at McDs. Here, many eat fries with sriracha seasoning - and Mayo!\n\nhttps://preview.redd.it/sulqgwuz9kve1.png?width=2067&format=png&auto=webp&s=20a679369968fc422ee3824ba5cf07dbb54e3e1b",
      "created_utc": 1744968129.0,
      "score": 2,
      "context": [
        {
          "id": "mnndrf3",
          "author": "KingMcB",
          "body": "I just want you to know you’re not alone. For months (YEARS) my 19-year old ARFID kiddo and I have been planning an international trip. We carefully planned our hotel to be able to make some snacks and meals in our room plus be around Americanized food options so they felt safe. UGH. We’re here and tried some local cuisine which sent them spiraling. (Also the local grocery store foods are not the same as home because American foods are toxic waste dumps). \nI’m proud of them for trying but the last two days have been painful because we’ve had to take busses across town to get … MCDONALDS at least once a day. I’m sympathizing with you. \n\nAlso having been a teenager who experienced a cross-country move - give them at least 6-12 months to adjust to just the move. Anxiety is a bitch on top of everything else. \n\nMcDonald’s should offer us an ARFID discount. How many of you/us have a McD’s safe food?!? 😂",
          "created_utc": 1744922396.0
        },
        {
          "id": "mno97ps",
          "author": "likeaparasite",
          "body": "Our first stop across the border was McDonalds for lunch and nobody warned me that the bbq dipping sauce is different. *I* had a panic attack, but she said \"I'll try to get used to it.\" and she actually did. I still don't like it personally haha",
          "created_utc": 1744932564.0
        }
      ]
    },
    {
      "id": "mns1q9h",
      "author": "haydesigner",
      "body": "It CAN lead to nutritional difficulties. That doesn’t mean it will lead to it. It is clear that both the child and the parent are suffering mental health, and that is the most important thing in the short term/right now. That’s what I was saying.",
      "created_utc": 1744992162.0,
      "score": 2,
      "context": [
        {
          "id": "mni6280",
          "author": "lotteoddities",
          "body": "You need an therapist who is trained to work with Autistic patients and ARFID specifically. Or a skills coach. Both will have ways to communicate with your teenager to find out how to expand their safe food list and hopefully get off of daily McDonald's.",
          "created_utc": 1744849799.0
        },
        {
          "id": "mnrj74b",
          "author": "haydesigner",
          "body": "Fully agree with this. I will also add simple advice of: just let her eat what she wants to eat. \n\nStop fighting about it and make everyone’s life better. Whatever your concerns about her eating McDonald’s, those concerns are *far less important* than your child’s mental health.",
          "created_utc": 1744986600.0
        },
        {
          "id": "mns19rx",
          "author": "garsha-man",
          "body": "I’m sorry but this is just not true. Having ARFID, just eating whatever you want, if it’s extremely limited, WILL lead to nutritional deficiencies—not only will this severely impact physical health both short and long term, it WILL affect their mental health as well—nutrition and mental health are intrinsically linked. This is just one aspect that makes ARFID so difficult to deal with.",
          "created_utc": 1744992023.0
        }
      ]
    },
    {
      "id": "mopq1z1",
      "author": "Issababy22",
      "body": "Also just to add context it did used to make me sad and actually it still does bother me when ppl push too hard with the “normal eating” thing it just makes me wish so bad that I was normal and that I wish I could just simply eat things like others and with others or that it wasn’t such a touchy subject for me when it come to eating in front of ppl especially for the first time and I used to pretty much just eat nuggets growing up as well…now I’m 23 and I’ve gotten better with the range of foods but not by much so it might be easier and more emotionally beneficial to lessen the struggle a bit",
      "created_utc": 1745458333.0,
      "score": 1,
      "context": [
        {
          "id": "mni6280",
          "author": "lotteoddities",
          "body": "You need an therapist who is trained to work with Autistic patients and ARFID specifically. Or a skills coach. Both will have ways to communicate with your teenager to find out how to expand their safe food list and hopefully get off of daily McDonald's.",
          "created_utc": 1744849799.0
        },
        {
          "id": "mnrj74b",
          "author": "haydesigner",
          "body": "Fully agree with this. I will also add simple advice of: just let her eat what she wants to eat. \n\nStop fighting about it and make everyone’s life better. Whatever your concerns about her eating McDonald’s, those concerns are *far less important* than your child’s mental health.",
          "created_utc": 1744986600.0
        },
        {
          "id": "moppefq",
          "author": "Issababy22",
          "body": "I agree as someone who believes they have ARFID and I was raised with parents who tried the forcing thing when I was younger but eventually came to terms with my habits my mother still encouraged me to eat and try new things but by the time I was 9 she stopped arguing with me ab it or using the tactics like before to try to get me to “eat normal”",
          "created_utc": 1745458102.0
        }
      ]
    },
    {
      "id": "mns23ff",
      "author": "likeaparasite",
      "body": "One of her favorite foods was meatballs with rice and tomato sauce. It was her 3rd birthday and I made that as a family dinner to celebrate. She refused to touch it that day, or her birthday cake. I feel like that was when everything changed. She became very limited in diet but it was a variety of your basic kid-friendly foods I could make at home. Mac n cheese, quesadillas, scrambled eggs, ham.. but her diet became more and more limited as she got older. \n\nI've worked with children with high support needs for a while now, namely autism and comorbidities, but ARFID only crossed my radar about a year ago as things got harder and harder for her. We are on this journey now to find the roots of her severe anxiety so that we can focus on the proper coping methods and improve overall mental health.",
      "created_utc": 1744992274.0,
      "score": 1,
      "context": [
        {
          "id": "mniarlo",
          "author": "dioor",
          "body": "I want to preface this by saying that I am a fully-functional adult in my mid-30s — people other than my husband and closest family, who I’m most open with about my struggles, would consider me very high functioning. I am healthy, financially stable, work full time, am happily married, etc. \n\nWhen I’m stressed, I can basically only eat 5 minute rice with margarine. There are weeks when that and Diet Coke and Starbucks baked goods are all I’m ingesting. My Starbucks spending is probably my #1 vice. It’s a comfort thing. I’ve had full-on panic attacks over leftovers my husband has in the fridge before. \n\nIf someone took away my safe meal and comfort snacks I wouldn’t eat better, I would just be hungry and even more stressed. When I’m going through it, the source(s) of stress and anxiety needs to be attacked first — I need to be able to manage and navigate those things, and then I can work on reintegrating healthier and more varied foods. I only know this because I’ve been me for 35 years, at some point I clued in to just how abnormal I am, and I have gotten really good at managing myself. \n\nSo from my perspective you are not enabling or doing anything wrong. You’re making sure your child gets fed which is absolutely paramount. It is a bit unhelpful to bring up the economics of eating mostly McDonalds, because this might contribute to her guilt/stress. I’d support her in eating what she will temporarily, if you can swing it, without making it “a thing” — while working toward the goal of healthier and more economical eating habits by minimizing/managing other sources of stress and anxiety first. \n\nARFID is *not* a junk food addiction. It is an anxiety condition. So “enabling” isn’t really a thing. You are in a position to genuinely help your child’s life be more manageable for them, but it is definitely not a straight line to force-feeding better meal options.",
          "created_utc": 1744851512.0
        },
        {
          "id": "mnob82x",
          "author": "likeaparasite",
          "body": "Thank you. It does make her feel guilty to know the $ of it, but we were really at a loss on how to talk her *out of it* and grasping straws. Because that's everything we're told as parents you know, \"picky eating is a result of bad parenting\" - or at least that's how I've been treated. She became picky on her 3rd birthday and I remember the exact meal she refused. Her teachers commented on her eating all the time. It's been something we've revolved around for most of her life. It's frustrating and sad.",
          "created_utc": 1744933263.0
        },
        {
          "id": "mnrfjmj",
          "author": "Smorsdoeuvres",
          "body": "I’m worried my oldest is struggling with ARFID and have been for a few years, they turn 8 this fall, and while I recall quite a few moments that seemed to be real stressors for my child, I’m not sure there is 1 in my mind as *the* tipping point. Do you mind sharing more of the journey you have had with your child, the issues and the discovery? Do you (or anyone else in the thread) have any tips for other parents out there trying to help their child stressed at the table?",
          "created_utc": 1744985453.0
        }
      ]
    },
    {
      "id": "mns2aiy",
      "author": "garsha-man",
      "body": "Yes it’s important to have safe foods in the short term,, but I specified when the diet is “extremely limited”, no— it’s not just a possibility of leading to nutritional deficiencies, it WILL.",
      "created_utc": 1744992334.0,
      "score": 4,
      "context": [
        {
          "id": "mni6280",
          "author": "lotteoddities",
          "body": "You need an therapist who is trained to work with Autistic patients and ARFID specifically. Or a skills coach. Both will have ways to communicate with your teenager to find out how to expand their safe food list and hopefully get off of daily McDonald's.",
          "created_utc": 1744849799.0
        },
        {
          "id": "mnrj74b",
          "author": "haydesigner",
          "body": "Fully agree with this. I will also add simple advice of: just let her eat what she wants to eat. \n\nStop fighting about it and make everyone’s life better. Whatever your concerns about her eating McDonald’s, those concerns are *far less important* than your child’s mental health.",
          "created_utc": 1744986600.0
        },
        {
          "id": "mns19rx",
          "author": "garsha-man",
          "body": "I’m sorry but this is just not true. Having ARFID, just eating whatever you want, if it’s extremely limited, WILL lead to nutritional deficiencies—not only will this severely impact physical health both short and long term, it WILL affect their mental health as well—nutrition and mental health are intrinsically linked. This is just one aspect that makes ARFID so difficult to deal with.",
          "created_utc": 1744992023.0
        },
        {
          "id": "mns1q9h",
          "author": "haydesigner",
          "body": "It CAN lead to nutritional difficulties. That doesn’t mean it will lead to it. It is clear that both the child and the parent are suffering mental health, and that is the most important thing in the short term/right now. That’s what I was saying.",
          "created_utc": 1744992162.0
        }
      ]
    },
    {
      "id": "mns2nrl",
      "author": "haydesigner",
      "body": "> it’s not just a possibility of leading to nutritional deficiencies, it WILL.\n\nYou absolutely cannot say that without knowing exactly what the person eats.\n\nIt is entirely possible to have ARFID, and still have a well balanced dial.",
      "created_utc": 1744992445.0,
      "score": 2,
      "context": [
        {
          "id": "mni6280",
          "author": "lotteoddities",
          "body": "You need an therapist who is trained to work with Autistic patients and ARFID specifically. Or a skills coach. Both will have ways to communicate with your teenager to find out how to expand their safe food list and hopefully get off of daily McDonald's.",
          "created_utc": 1744849799.0
        },
        {
          "id": "mnrj74b",
          "author": "haydesigner",
          "body": "Fully agree with this. I will also add simple advice of: just let her eat what she wants to eat. \n\nStop fighting about it and make everyone’s life better. Whatever your concerns about her eating McDonald’s, those concerns are *far less important* than your child’s mental health.",
          "created_utc": 1744986600.0
        },
        {
          "id": "mns19rx",
          "author": "garsha-man",
          "body": "I’m sorry but this is just not true. Having ARFID, just eating whatever you want, if it’s extremely limited, WILL lead to nutritional deficiencies—not only will this severely impact physical health both short and long term, it WILL affect their mental health as well—nutrition and mental health are intrinsically linked. This is just one aspect that makes ARFID so difficult to deal with.",
          "created_utc": 1744992023.0
        },
        {
          "id": "mns1q9h",
          "author": "haydesigner",
          "body": "It CAN lead to nutritional difficulties. That doesn’t mean it will lead to it. It is clear that both the child and the parent are suffering mental health, and that is the most important thing in the short term/right now. That’s what I was saying.",
          "created_utc": 1744992162.0
        },
        {
          "id": "mns2aiy",
          "author": "garsha-man",
          "body": "Yes it’s important to have safe foods in the short term,, but I specified when the diet is “extremely limited”, no— it’s not just a possibility of leading to nutritional deficiencies, it WILL.",
          "created_utc": 1744992334.0
        }
      ]
    },
    {
      "id": "mns2xz7",
      "author": "garsha-man",
      "body": "Dude that’s not what I’m saying. Yes you can have ARFID and eat a balanced diet, but as I’ve specified, this being the third time: WHEN THE DIET IS EXTREMELY LIMITED, IT WILL LEAD TO NUTRITIONAL DEFICIENCIES.",
      "created_utc": 1744992532.0,
      "score": 3,
      "context": [
        {
          "id": "mni6280",
          "author": "lotteoddities",
          "body": "You need an therapist who is trained to work with Autistic patients and ARFID specifically. Or a skills coach. Both will have ways to communicate with your teenager to find out how to expand their safe food list and hopefully get off of daily McDonald's.",
          "created_utc": 1744849799.0
        },
        {
          "id": "mnrj74b",
          "author": "haydesigner",
          "body": "Fully agree with this. I will also add simple advice of: just let her eat what she wants to eat. \n\nStop fighting about it and make everyone’s life better. Whatever your concerns about her eating McDonald’s, those concerns are *far less important* than your child’s mental health.",
          "created_utc": 1744986600.0
        },
        {
          "id": "mns19rx",
          "author": "garsha-man",
          "body": "I’m sorry but this is just not true. Having ARFID, just eating whatever you want, if it’s extremely limited, WILL lead to nutritional deficiencies—not only will this severely impact physical health both short and long term, it WILL affect their mental health as well—nutrition and mental health are intrinsically linked. This is just one aspect that makes ARFID so difficult to deal with.",
          "created_utc": 1744992023.0
        },
        {
          "id": "mns1q9h",
          "author": "haydesigner",
          "body": "It CAN lead to nutritional difficulties. That doesn’t mean it will lead to it. It is clear that both the child and the parent are suffering mental health, and that is the most important thing in the short term/right now. That’s what I was saying.",
          "created_utc": 1744992162.0
        },
        {
          "id": "mns2aiy",
          "author": "garsha-man",
          "body": "Yes it’s important to have safe foods in the short term,, but I specified when the diet is “extremely limited”, no— it’s not just a possibility of leading to nutritional deficiencies, it WILL.",
          "created_utc": 1744992334.0
        },
        {
          "id": "mns2nrl",
          "author": "haydesigner",
          "body": "> it’s not just a possibility of leading to nutritional deficiencies, it WILL.\n\nYou absolutely cannot say that without knowing exactly what the person eats.\n\nIt is entirely possible to have ARFID, and still have a well balanced dial.",
          "created_utc": 1744992445.0
        }
      ]
    },
    {
      "id": "mns3gxu",
      "author": "haydesigner",
      "body": "> WHEN THE DIET IS EXTREMELY LIMITED, IT WILL LEAD TO NUTRITIONAL DEFICIENCIES.\n\nAnd again, I am saying you could not say that with certainty without knowing what the exact foods are.\n\nARFID is about food avoidance, regardless of its nutritional value.",
      "created_utc": 1744992693.0,
      "score": 1,
      "context": [
        {
          "id": "mni6280",
          "author": "lotteoddities",
          "body": "You need an therapist who is trained to work with Autistic patients and ARFID specifically. Or a skills coach. Both will have ways to communicate with your teenager to find out how to expand their safe food list and hopefully get off of daily McDonald's.",
          "created_utc": 1744849799.0
        },
        {
          "id": "mnrj74b",
          "author": "haydesigner",
          "body": "Fully agree with this. I will also add simple advice of: just let her eat what she wants to eat. \n\nStop fighting about it and make everyone’s life better. Whatever your concerns about her eating McDonald’s, those concerns are *far less important* than your child’s mental health.",
          "created_utc": 1744986600.0
        },
        {
          "id": "mns19rx",
          "author": "garsha-man",
          "body": "I’m sorry but this is just not true. Having ARFID, just eating whatever you want, if it’s extremely limited, WILL lead to nutritional deficiencies—not only will this severely impact physical health both short and long term, it WILL affect their mental health as well—nutrition and mental health are intrinsically linked. This is just one aspect that makes ARFID so difficult to deal with.",
          "created_utc": 1744992023.0
        },
        {
          "id": "mns1q9h",
          "author": "haydesigner",
          "body": "It CAN lead to nutritional difficulties. That doesn’t mean it will lead to it. It is clear that both the child and the parent are suffering mental health, and that is the most important thing in the short term/right now. That’s what I was saying.",
          "created_utc": 1744992162.0
        },
        {
          "id": "mns2aiy",
          "author": "garsha-man",
          "body": "Yes it’s important to have safe foods in the short term,, but I specified when the diet is “extremely limited”, no— it’s not just a possibility of leading to nutritional deficiencies, it WILL.",
          "created_utc": 1744992334.0
        },
        {
          "id": "mns2nrl",
          "author": "haydesigner",
          "body": "> it’s not just a possibility of leading to nutritional deficiencies, it WILL.\n\nYou absolutely cannot say that without knowing exactly what the person eats.\n\nIt is entirely possible to have ARFID, and still have a well balanced dial.",
          "created_utc": 1744992445.0
        },
        {
          "id": "mns2xz7",
          "author": "garsha-man",
          "body": "Dude that’s not what I’m saying. Yes you can have ARFID and eat a balanced diet, but as I’ve specified, this being the third time: WHEN THE DIET IS EXTREMELY LIMITED, IT WILL LEAD TO NUTRITIONAL DEFICIENCIES.",
          "created_utc": 1744992532.0
        }
      ]
    },
    {
      "id": "mns50yj",
      "author": "garsha-man",
      "body": "https://www.sciencedirect.com/science/article/abs/pii/S0929693X19301216#:~:text=Patients%20with%20a%20positive%20ARFID,even%20when%20in%20clinical%20remission.\n\n“Patients with a positive ARFID risk screen were significantly more likely to be at risk for malnutrition (60.7% vs 15.8%; P < . 01)”\n\nI understand where you’re coming from man, but I’m not sure you realize the scope of ARFID, despite —I assume—you having it, as do I. Western culture in its normalcy is not great about balanced diets; add ARFID to this and in most cases, especially when it’s a significantly limited diet, there is going to be some form of malnutrition. Yes, I cannot say this without knowing exactly what someone eats, but in most cases where the diet can be described as “significantly limited”, there is almost always some degree of malnutrition.",
      "created_utc": 1744993173.0,
      "score": 2,
      "context": [
        {
          "id": "mni6280",
          "author": "lotteoddities",
          "body": "You need an therapist who is trained to work with Autistic patients and ARFID specifically. Or a skills coach. Both will have ways to communicate with your teenager to find out how to expand their safe food list and hopefully get off of daily McDonald's.",
          "created_utc": 1744849799.0
        },
        {
          "id": "mnrj74b",
          "author": "haydesigner",
          "body": "Fully agree with this. I will also add simple advice of: just let her eat what she wants to eat. \n\nStop fighting about it and make everyone’s life better. Whatever your concerns about her eating McDonald’s, those concerns are *far less important* than your child’s mental health.",
          "created_utc": 1744986600.0
        },
        {
          "id": "mns19rx",
          "author": "garsha-man",
          "body": "I’m sorry but this is just not true. Having ARFID, just eating whatever you want, if it’s extremely limited, WILL lead to nutritional deficiencies—not only will this severely impact physical health both short and long term, it WILL affect their mental health as well—nutrition and mental health are intrinsically linked. This is just one aspect that makes ARFID so difficult to deal with.",
          "created_utc": 1744992023.0
        },
        {
          "id": "mns1q9h",
          "author": "haydesigner",
          "body": "It CAN lead to nutritional difficulties. That doesn’t mean it will lead to it. It is clear that both the child and the parent are suffering mental health, and that is the most important thing in the short term/right now. That’s what I was saying.",
          "created_utc": 1744992162.0
        },
        {
          "id": "mns2aiy",
          "author": "garsha-man",
          "body": "Yes it’s important to have safe foods in the short term,, but I specified when the diet is “extremely limited”, no— it’s not just a possibility of leading to nutritional deficiencies, it WILL.",
          "created_utc": 1744992334.0
        },
        {
          "id": "mns2nrl",
          "author": "haydesigner",
          "body": "> it’s not just a possibility of leading to nutritional deficiencies, it WILL.\n\nYou absolutely cannot say that without knowing exactly what the person eats.\n\nIt is entirely possible to have ARFID, and still have a well balanced dial.",
          "created_utc": 1744992445.0
        },
        {
          "id": "mns2xz7",
          "author": "garsha-man",
          "body": "Dude that’s not what I’m saying. Yes you can have ARFID and eat a balanced diet, but as I’ve specified, this being the third time: WHEN THE DIET IS EXTREMELY LIMITED, IT WILL LEAD TO NUTRITIONAL DEFICIENCIES.",
          "created_utc": 1744992532.0
        },
        {
          "id": "mns3gxu",
          "author": "haydesigner",
          "body": "> WHEN THE DIET IS EXTREMELY LIMITED, IT WILL LEAD TO NUTRITIONAL DEFICIENCIES.\n\nAnd again, I am saying you could not say that with certainty without knowing what the exact foods are.\n\nARFID is about food avoidance, regardless of its nutritional value.",
          "created_utc": 1744992693.0
        }
      ]
    },
    {
      "id": "mntmnq9",
      "author": "haydesigner",
      "body": "> Yes, I cannot say this without knowing exactly what someone eats\n\nAnd that is what I was saying.",
      "created_utc": 1745009631.0,
      "score": 0,
      "context": [
        {
          "id": "mni6280",
          "author": "lotteoddities",
          "body": "You need an therapist who is trained to work with Autistic patients and ARFID specifically. Or a skills coach. Both will have ways to communicate with your teenager to find out how to expand their safe food list and hopefully get off of daily McDonald's.",
          "created_utc": 1744849799.0
        },
        {
          "id": "mnrj74b",
          "author": "haydesigner",
          "body": "Fully agree with this. I will also add simple advice of: just let her eat what she wants to eat. \n\nStop fighting about it and make everyone’s life better. Whatever your concerns about her eating McDonald’s, those concerns are *far less important* than your child’s mental health.",
          "created_utc": 1744986600.0
        },
        {
          "id": "mns19rx",
          "author": "garsha-man",
          "body": "I’m sorry but this is just not true. Having ARFID, just eating whatever you want, if it’s extremely limited, WILL lead to nutritional deficiencies—not only will this severely impact physical health both short and long term, it WILL affect their mental health as well—nutrition and mental health are intrinsically linked. This is just one aspect that makes ARFID so difficult to deal with.",
          "created_utc": 1744992023.0
        },
        {
          "id": "mns1q9h",
          "author": "haydesigner",
          "body": "It CAN lead to nutritional difficulties. That doesn’t mean it will lead to it. It is clear that both the child and the parent are suffering mental health, and that is the most important thing in the short term/right now. That’s what I was saying.",
          "created_utc": 1744992162.0
        },
        {
          "id": "mns2aiy",
          "author": "garsha-man",
          "body": "Yes it’s important to have safe foods in the short term,, but I specified when the diet is “extremely limited”, no— it’s not just a possibility of leading to nutritional deficiencies, it WILL.",
          "created_utc": 1744992334.0
        },
        {
          "id": "mns2nrl",
          "author": "haydesigner",
          "body": "> it’s not just a possibility of leading to nutritional deficiencies, it WILL.\n\nYou absolutely cannot say that without knowing exactly what the person eats.\n\nIt is entirely possible to have ARFID, and still have a well balanced dial.",
          "created_utc": 1744992445.0
        },
        {
          "id": "mns2xz7",
          "author": "garsha-man",
          "body": "Dude that’s not what I’m saying. Yes you can have ARFID and eat a balanced diet, but as I’ve specified, this being the third time: WHEN THE DIET IS EXTREMELY LIMITED, IT WILL LEAD TO NUTRITIONAL DEFICIENCIES.",
          "created_utc": 1744992532.0
        },
        {
          "id": "mns3gxu",
          "author": "haydesigner",
          "body": "> WHEN THE DIET IS EXTREMELY LIMITED, IT WILL LEAD TO NUTRITIONAL DEFICIENCIES.\n\nAnd again, I am saying you could not say that with certainty without knowing what the exact foods are.\n\nARFID is about food avoidance, regardless of its nutritional value.",
          "created_utc": 1744992693.0
        },
        {
          "id": "mns50yj",
          "author": "garsha-man",
          "body": "https://www.sciencedirect.com/science/article/abs/pii/S0929693X19301216#:~:text=Patients%20with%20a%20positive%20ARFID,even%20when%20in%20clinical%20remission.\n\n“Patients with a positive ARFID risk screen were significantly more likely to be at risk for malnutrition (60.7% vs 15.8%; P < . 01)”\n\nI understand where you’re coming from man, but I’m not sure you realize the scope of ARFID, despite —I assume—you having it, as do I. Western culture in its normalcy is not great about balanced diets; add ARFID to this and in most cases, especially when it’s a significantly limited diet, there is going to be some form of malnutrition. Yes, I cannot say this without knowing exactly what someone eats, but in most cases where the diet can be described as “significantly limited”, there is almost always some degree of malnutrition.",
          "created_utc": 1744993173.0
        }
      ]
    },
    {
      "id": "mnwfyqv",
      "author": "jerzeett",
      "body": "Ok but op posted what the kid eats and it's a limited diet that WILL lead to nutritional deficiencies",
      "created_utc": 1745054287.0,
      "score": 2,
      "context": [
        {
          "id": "mni6280",
          "author": "lotteoddities",
          "body": "You need an therapist who is trained to work with Autistic patients and ARFID specifically. Or a skills coach. Both will have ways to communicate with your teenager to find out how to expand their safe food list and hopefully get off of daily McDonald's.",
          "created_utc": 1744849799.0
        },
        {
          "id": "mnrj74b",
          "author": "haydesigner",
          "body": "Fully agree with this. I will also add simple advice of: just let her eat what she wants to eat. \n\nStop fighting about it and make everyone’s life better. Whatever your concerns about her eating McDonald’s, those concerns are *far less important* than your child’s mental health.",
          "created_utc": 1744986600.0
        },
        {
          "id": "mns19rx",
          "author": "garsha-man",
          "body": "I’m sorry but this is just not true. Having ARFID, just eating whatever you want, if it’s extremely limited, WILL lead to nutritional deficiencies—not only will this severely impact physical health both short and long term, it WILL affect their mental health as well—nutrition and mental health are intrinsically linked. This is just one aspect that makes ARFID so difficult to deal with.",
          "created_utc": 1744992023.0
        },
        {
          "id": "mns1q9h",
          "author": "haydesigner",
          "body": "It CAN lead to nutritional difficulties. That doesn’t mean it will lead to it. It is clear that both the child and the parent are suffering mental health, and that is the most important thing in the short term/right now. That’s what I was saying.",
          "created_utc": 1744992162.0
        },
        {
          "id": "mns2aiy",
          "author": "garsha-man",
          "body": "Yes it’s important to have safe foods in the short term,, but I specified when the diet is “extremely limited”, no— it’s not just a possibility of leading to nutritional deficiencies, it WILL.",
          "created_utc": 1744992334.0
        },
        {
          "id": "mns2nrl",
          "author": "haydesigner",
          "body": "> it’s not just a possibility of leading to nutritional deficiencies, it WILL.\n\nYou absolutely cannot say that without knowing exactly what the person eats.\n\nIt is entirely possible to have ARFID, and still have a well balanced dial.",
          "created_utc": 1744992445.0
        },
        {
          "id": "mns2xz7",
          "author": "garsha-man",
          "body": "Dude that’s not what I’m saying. Yes you can have ARFID and eat a balanced diet, but as I’ve specified, this being the third time: WHEN THE DIET IS EXTREMELY LIMITED, IT WILL LEAD TO NUTRITIONAL DEFICIENCIES.",
          "created_utc": 1744992532.0
        },
        {
          "id": "mns3gxu",
          "author": "haydesigner",
          "body": "> WHEN THE DIET IS EXTREMELY LIMITED, IT WILL LEAD TO NUTRITIONAL DEFICIENCIES.\n\nAnd again, I am saying you could not say that with certainty without knowing what the exact foods are.\n\nARFID is about food avoidance, regardless of its nutritional value.",
          "created_utc": 1744992693.0
        },
        {
          "id": "mns50yj",
          "author": "garsha-man",
          "body": "https://www.sciencedirect.com/science/article/abs/pii/S0929693X19301216#:~:text=Patients%20with%20a%20positive%20ARFID,even%20when%20in%20clinical%20remission.\n\n“Patients with a positive ARFID risk screen were significantly more likely to be at risk for malnutrition (60.7% vs 15.8%; P < . 01)”\n\nI understand where you’re coming from man, but I’m not sure you realize the scope of ARFID, despite —I assume—you having it, as do I. Western culture in its normalcy is not great about balanced diets; add ARFID to this and in most cases, especially when it’s a significantly limited diet, there is going to be some form of malnutrition. Yes, I cannot say this without knowing exactly what someone eats, but in most cases where the diet can be described as “significantly limited”, there is almost always some degree of malnutrition.",
          "created_utc": 1744993173.0
        },
        {
          "id": "mntmnq9",
          "author": "haydesigner",
          "body": "> Yes, I cannot say this without knowing exactly what someone eats\n\nAnd that is what I was saying.",
          "created_utc": 1745009631.0
        }
      ]
    },
    {
      "id": "mnu6gn2",
      "author": "garsha-man",
      "body": "I swear this is what talking to a wall is like.",
      "created_utc": 1745016377.0,
      "score": 0,
      "context": [
        {
          "id": "mni6280",
          "author": "lotteoddities",
          "body": "You need an therapist who is trained to work with Autistic patients and ARFID specifically. Or a skills coach. Both will have ways to communicate with your teenager to find out how to expand their safe food list and hopefully get off of daily McDonald's.",
          "created_utc": 1744849799.0
        },
        {
          "id": "mnrj74b",
          "author": "haydesigner",
          "body": "Fully agree with this. I will also add simple advice of: just let her eat what she wants to eat. \n\nStop fighting about it and make everyone’s life better. Whatever your concerns about her eating McDonald’s, those concerns are *far less important* than your child’s mental health.",
          "created_utc": 1744986600.0
        },
        {
          "id": "mns19rx",
          "author": "garsha-man",
          "body": "I’m sorry but this is just not true. Having ARFID, just eating whatever you want, if it’s extremely limited, WILL lead to nutritional deficiencies—not only will this severely impact physical health both short and long term, it WILL affect their mental health as well—nutrition and mental health are intrinsically linked. This is just one aspect that makes ARFID so difficult to deal with.",
          "created_utc": 1744992023.0
        },
        {
          "id": "mns1q9h",
          "author": "haydesigner",
          "body": "It CAN lead to nutritional difficulties. That doesn’t mean it will lead to it. It is clear that both the child and the parent are suffering mental health, and that is the most important thing in the short term/right now. That’s what I was saying.",
          "created_utc": 1744992162.0
        },
        {
          "id": "mns2aiy",
          "author": "garsha-man",
          "body": "Yes it’s important to have safe foods in the short term,, but I specified when the diet is “extremely limited”, no— it’s not just a possibility of leading to nutritional deficiencies, it WILL.",
          "created_utc": 1744992334.0
        },
        {
          "id": "mns2nrl",
          "author": "haydesigner",
          "body": "> it’s not just a possibility of leading to nutritional deficiencies, it WILL.\n\nYou absolutely cannot say that without knowing exactly what the person eats.\n\nIt is entirely possible to have ARFID, and still have a well balanced dial.",
          "created_utc": 1744992445.0
        },
        {
          "id": "mns2xz7",
          "author": "garsha-man",
          "body": "Dude that’s not what I’m saying. Yes you can have ARFID and eat a balanced diet, but as I’ve specified, this being the third time: WHEN THE DIET IS EXTREMELY LIMITED, IT WILL LEAD TO NUTRITIONAL DEFICIENCIES.",
          "created_utc": 1744992532.0
        },
        {
          "id": "mns3gxu",
          "author": "haydesigner",
          "body": "> WHEN THE DIET IS EXTREMELY LIMITED, IT WILL LEAD TO NUTRITIONAL DEFICIENCIES.\n\nAnd again, I am saying you could not say that with certainty without knowing what the exact foods are.\n\nARFID is about food avoidance, regardless of its nutritional value.",
          "created_utc": 1744992693.0
        },
        {
          "id": "mns50yj",
          "author": "garsha-man",
          "body": "https://www.sciencedirect.com/science/article/abs/pii/S0929693X19301216#:~:text=Patients%20with%20a%20positive%20ARFID,even%20when%20in%20clinical%20remission.\n\n“Patients with a positive ARFID risk screen were significantly more likely to be at risk for malnutrition (60.7% vs 15.8%; P < . 01)”\n\nI understand where you’re coming from man, but I’m not sure you realize the scope of ARFID, despite —I assume—you having it, as do I. Western culture in its normalcy is not great about balanced diets; add ARFID to this and in most cases, especially when it’s a significantly limited diet, there is going to be some form of malnutrition. Yes, I cannot say this without knowing exactly what someone eats, but in most cases where the diet can be described as “significantly limited”, there is almost always some degree of malnutrition.",
          "created_utc": 1744993173.0
        },
        {
          "id": "mntmnq9",
          "author": "haydesigner",
          "body": "> Yes, I cannot say this without knowing exactly what someone eats\n\nAnd that is what I was saying.",
          "created_utc": 1745009631.0
        }
      ]
    },
    {
      "id": "mnz34k6",
      "author": "haydesigner",
      "body": "And so I repeat myself from earlier:\n\n> It is clear that both the child and the parent are suffering mental health, and that is the most important thing in the short term/right now. That’s what I was saying.",
      "created_utc": 1745090585.0,
      "score": 1,
      "context": [
        {
          "id": "mni6280",
          "author": "lotteoddities",
          "body": "You need an therapist who is trained to work with Autistic patients and ARFID specifically. Or a skills coach. Both will have ways to communicate with your teenager to find out how to expand their safe food list and hopefully get off of daily McDonald's.",
          "created_utc": 1744849799.0
        },
        {
          "id": "mnrj74b",
          "author": "haydesigner",
          "body": "Fully agree with this. I will also add simple advice of: just let her eat what she wants to eat. \n\nStop fighting about it and make everyone’s life better. Whatever your concerns about her eating McDonald’s, those concerns are *far less important* than your child’s mental health.",
          "created_utc": 1744986600.0
        },
        {
          "id": "mns19rx",
          "author": "garsha-man",
          "body": "I’m sorry but this is just not true. Having ARFID, just eating whatever you want, if it’s extremely limited, WILL lead to nutritional deficiencies—not only will this severely impact physical health both short and long term, it WILL affect their mental health as well—nutrition and mental health are intrinsically linked. This is just one aspect that makes ARFID so difficult to deal with.",
          "created_utc": 1744992023.0
        },
        {
          "id": "mns1q9h",
          "author": "haydesigner",
          "body": "It CAN lead to nutritional difficulties. That doesn’t mean it will lead to it. It is clear that both the child and the parent are suffering mental health, and that is the most important thing in the short term/right now. That’s what I was saying.",
          "created_utc": 1744992162.0
        },
        {
          "id": "mns2aiy",
          "author": "garsha-man",
          "body": "Yes it’s important to have safe foods in the short term,, but I specified when the diet is “extremely limited”, no— it’s not just a possibility of leading to nutritional deficiencies, it WILL.",
          "created_utc": 1744992334.0
        },
        {
          "id": "mns2nrl",
          "author": "haydesigner",
          "body": "> it’s not just a possibility of leading to nutritional deficiencies, it WILL.\n\nYou absolutely cannot say that without knowing exactly what the person eats.\n\nIt is entirely possible to have ARFID, and still have a well balanced dial.",
          "created_utc": 1744992445.0
        },
        {
          "id": "mns2xz7",
          "author": "garsha-man",
          "body": "Dude that’s not what I’m saying. Yes you can have ARFID and eat a balanced diet, but as I’ve specified, this being the third time: WHEN THE DIET IS EXTREMELY LIMITED, IT WILL LEAD TO NUTRITIONAL DEFICIENCIES.",
          "created_utc": 1744992532.0
        },
        {
          "id": "mns3gxu",
          "author": "haydesigner",
          "body": "> WHEN THE DIET IS EXTREMELY LIMITED, IT WILL LEAD TO NUTRITIONAL DEFICIENCIES.\n\nAnd again, I am saying you could not say that with certainty without knowing what the exact foods are.\n\nARFID is about food avoidance, regardless of its nutritional value.",
          "created_utc": 1744992693.0
        },
        {
          "id": "mns50yj",
          "author": "garsha-man",
          "body": "https://www.sciencedirect.com/science/article/abs/pii/S0929693X19301216#:~:text=Patients%20with%20a%20positive%20ARFID,even%20when%20in%20clinical%20remission.\n\n“Patients with a positive ARFID risk screen were significantly more likely to be at risk for malnutrition (60.7% vs 15.8%; P < . 01)”\n\nI understand where you’re coming from man, but I’m not sure you realize the scope of ARFID, despite —I assume—you having it, as do I. Western culture in its normalcy is not great about balanced diets; add ARFID to this and in most cases, especially when it’s a significantly limited diet, there is going to be some form of malnutrition. Yes, I cannot say this without knowing exactly what someone eats, but in most cases where the diet can be described as “significantly limited”, there is almost always some degree of malnutrition.",
          "created_utc": 1744993173.0
        },
        {
          "id": "mntmnq9",
          "author": "haydesigner",
          "body": "> Yes, I cannot say this without knowing exactly what someone eats\n\nAnd that is what I was saying.",
          "created_utc": 1745009631.0
        },
        {
          "id": "mnwfyqv",
          "author": "jerzeett",
          "body": "Ok but op posted what the kid eats and it's a limited diet that WILL lead to nutritional deficiencies",
          "created_utc": 1745054287.0
        }
      ]
    },
    {
      "id": "mnz30up",
      "author": "haydesigner",
      "body": "You are the one who refused to comprehend, not I.",
      "created_utc": 1745090550.0,
      "score": 0,
      "context": [
        {
          "id": "mni6280",
          "author": "lotteoddities",
          "body": "You need an therapist who is trained to work with Autistic patients and ARFID specifically. Or a skills coach. Both will have ways to communicate with your teenager to find out how to expand their safe food list and hopefully get off of daily McDonald's.",
          "created_utc": 1744849799.0
        },
        {
          "id": "mnrj74b",
          "author": "haydesigner",
          "body": "Fully agree with this. I will also add simple advice of: just let her eat what she wants to eat. \n\nStop fighting about it and make everyone’s life better. Whatever your concerns about her eating McDonald’s, those concerns are *far less important* than your child’s mental health.",
          "created_utc": 1744986600.0
        },
        {
          "id": "mns19rx",
          "author": "garsha-man",
          "body": "I’m sorry but this is just not true. Having ARFID, just eating whatever you want, if it’s extremely limited, WILL lead to nutritional deficiencies—not only will this severely impact physical health both short and long term, it WILL affect their mental health as well—nutrition and mental health are intrinsically linked. This is just one aspect that makes ARFID so difficult to deal with.",
          "created_utc": 1744992023.0
        },
        {
          "id": "mns1q9h",
          "author": "haydesigner",
          "body": "It CAN lead to nutritional difficulties. That doesn’t mean it will lead to it. It is clear that both the child and the parent are suffering mental health, and that is the most important thing in the short term/right now. That’s what I was saying.",
          "created_utc": 1744992162.0
        },
        {
          "id": "mns2aiy",
          "author": "garsha-man",
          "body": "Yes it’s important to have safe foods in the short term,, but I specified when the diet is “extremely limited”, no— it’s not just a possibility of leading to nutritional deficiencies, it WILL.",
          "created_utc": 1744992334.0
        },
        {
          "id": "mns2nrl",
          "author": "haydesigner",
          "body": "> it’s not just a possibility of leading to nutritional deficiencies, it WILL.\n\nYou absolutely cannot say that without knowing exactly what the person eats.\n\nIt is entirely possible to have ARFID, and still have a well balanced dial.",
          "created_utc": 1744992445.0
        },
        {
          "id": "mns2xz7",
          "author": "garsha-man",
          "body": "Dude that’s not what I’m saying. Yes you can have ARFID and eat a balanced diet, but as I’ve specified, this being the third time: WHEN THE DIET IS EXTREMELY LIMITED, IT WILL LEAD TO NUTRITIONAL DEFICIENCIES.",
          "created_utc": 1744992532.0
        },
        {
          "id": "mns3gxu",
          "author": "haydesigner",
          "body": "> WHEN THE DIET IS EXTREMELY LIMITED, IT WILL LEAD TO NUTRITIONAL DEFICIENCIES.\n\nAnd again, I am saying you could not say that with certainty without knowing what the exact foods are.\n\nARFID is about food avoidance, regardless of its nutritional value.",
          "created_utc": 1744992693.0
        },
        {
          "id": "mns50yj",
          "author": "garsha-man",
          "body": "https://www.sciencedirect.com/science/article/abs/pii/S0929693X19301216#:~:text=Patients%20with%20a%20positive%20ARFID,even%20when%20in%20clinical%20remission.\n\n“Patients with a positive ARFID risk screen were significantly more likely to be at risk for malnutrition (60.7% vs 15.8%; P < . 01)”\n\nI understand where you’re coming from man, but I’m not sure you realize the scope of ARFID, despite —I assume—you having it, as do I. Western culture in its normalcy is not great about balanced diets; add ARFID to this and in most cases, especially when it’s a significantly limited diet, there is going to be some form of malnutrition. Yes, I cannot say this without knowing exactly what someone eats, but in most cases where the diet can be described as “significantly limited”, there is almost always some degree of malnutrition.",
          "created_utc": 1744993173.0
        },
        {
          "id": "mntmnq9",
          "author": "haydesigner",
          "body": "> Yes, I cannot say this without knowing exactly what someone eats\n\nAnd that is what I was saying.",
          "created_utc": 1745009631.0
        },
        {
          "id": "mnu6gn2",
          "author": "garsha-man",
          "body": "I swear this is what talking to a wall is like.",
          "created_utc": 1745016377.0
        }
      ]
    },
    {
      "id": "mnzrs0y",
      "author": "garsha-man",
      "body": "Your original comment has -3, but keep telling yourself that",
      "created_utc": 1745098866.0,
      "score": 1,
      "context": [
        {
          "id": "mni6280",
          "author": "lotteoddities",
          "body": "You need an therapist who is trained to work with Autistic patients and ARFID specifically. Or a skills coach. Both will have ways to communicate with your teenager to find out how to expand their safe food list and hopefully get off of daily McDonald's.",
          "created_utc": 1744849799.0
        },
        {
          "id": "mnrj74b",
          "author": "haydesigner",
          "body": "Fully agree with this. I will also add simple advice of: just let her eat what she wants to eat. \n\nStop fighting about it and make everyone’s life better. Whatever your concerns about her eating McDonald’s, those concerns are *far less important* than your child’s mental health.",
          "created_utc": 1744986600.0
        },
        {
          "id": "mns19rx",
          "author": "garsha-man",
          "body": "I’m sorry but this is just not true. Having ARFID, just eating whatever you want, if it’s extremely limited, WILL lead to nutritional deficiencies—not only will this severely impact physical health both short and long term, it WILL affect their mental health as well—nutrition and mental health are intrinsically linked. This is just one aspect that makes ARFID so difficult to deal with.",
          "created_utc": 1744992023.0
        },
        {
          "id": "mns1q9h",
          "author": "haydesigner",
          "body": "It CAN lead to nutritional difficulties. That doesn’t mean it will lead to it. It is clear that both the child and the parent are suffering mental health, and that is the most important thing in the short term/right now. That’s what I was saying.",
          "created_utc": 1744992162.0
        },
        {
          "id": "mns2aiy",
          "author": "garsha-man",
          "body": "Yes it’s important to have safe foods in the short term,, but I specified when the diet is “extremely limited”, no— it’s not just a possibility of leading to nutritional deficiencies, it WILL.",
          "created_utc": 1744992334.0
        },
        {
          "id": "mns2nrl",
          "author": "haydesigner",
          "body": "> it’s not just a possibility of leading to nutritional deficiencies, it WILL.\n\nYou absolutely cannot say that without knowing exactly what the person eats.\n\nIt is entirely possible to have ARFID, and still have a well balanced dial.",
          "created_utc": 1744992445.0
        },
        {
          "id": "mns2xz7",
          "author": "garsha-man",
          "body": "Dude that’s not what I’m saying. Yes you can have ARFID and eat a balanced diet, but as I’ve specified, this being the third time: WHEN THE DIET IS EXTREMELY LIMITED, IT WILL LEAD TO NUTRITIONAL DEFICIENCIES.",
          "created_utc": 1744992532.0
        },
        {
          "id": "mns3gxu",
          "author": "haydesigner",
          "body": "> WHEN THE DIET IS EXTREMELY LIMITED, IT WILL LEAD TO NUTRITIONAL DEFICIENCIES.\n\nAnd again, I am saying you could not say that with certainty without knowing what the exact foods are.\n\nARFID is about food avoidance, regardless of its nutritional value.",
          "created_utc": 1744992693.0
        },
        {
          "id": "mns50yj",
          "author": "garsha-man",
          "body": "https://www.sciencedirect.com/science/article/abs/pii/S0929693X19301216#:~:text=Patients%20with%20a%20positive%20ARFID,even%20when%20in%20clinical%20remission.\n\n“Patients with a positive ARFID risk screen were significantly more likely to be at risk for malnutrition (60.7% vs 15.8%; P < . 01)”\n\nI understand where you’re coming from man, but I’m not sure you realize the scope of ARFID, despite —I assume—you having it, as do I. Western culture in its normalcy is not great about balanced diets; add ARFID to this and in most cases, especially when it’s a significantly limited diet, there is going to be some form of malnutrition. Yes, I cannot say this without knowing exactly what someone eats, but in most cases where the diet can be described as “significantly limited”, there is almost always some degree of malnutrition.",
          "created_utc": 1744993173.0
        },
        {
          "id": "mntmnq9",
          "author": "haydesigner",
          "body": "> Yes, I cannot say this without knowing exactly what someone eats\n\nAnd that is what I was saying.",
          "created_utc": 1745009631.0
        },
        {
          "id": "mnu6gn2",
          "author": "garsha-man",
          "body": "I swear this is what talking to a wall is like.",
          "created_utc": 1745016377.0
        },
        {
          "id": "mnz30up",
          "author": "haydesigner",
          "body": "You are the one who refused to comprehend, not I.",
          "created_utc": 1745090550.0
        }
      ]
    }
  ]
}