{
  "id": "1k2w0vg",
  "subreddit": "ARFID",
  "author": "None",
  "created_utc": 1745068545.0,
  "title": "Dude 💀",
  "selftext": "I was scrolling on insta reels and saw this shit, really pissed me off and I need to take yall down with me, lmao\n\nWhat if the type of person they’re referring to in the post has arfid? They sound like that’s what they’re describing. I guarantee their struggles are much more difficult then “waaaa!!! I can’t go to this restaurant because my friend has a literal eating disorder!!! This affects me somehow more than it affects them!!!” Like, if you wanna go there so bad, next time, just, like, don’t bring them? It’s not that hard. \n\nI will say, I go to restaurants with my friends, and usually just don’t eat anything if they don’t have options for me, but still, what?\n\nAlso, the “your girlfriend’s parents hate having you over” thing is so mean?? Yeah, dude, I know they do. That’s like, honestly the main reason I’m scared to get a boyfriend 😭 my family members who know about it always stare me down during dinner, because I end up just making my own meal. I feel so rude, and I hate family dinners just in general.  Also, a real friend wouldn’t care if you had an ED, they would support you and help you overcome it.\n\nBut my main thing with this is, like, why do they give a shit? It affects the person with the actual issue more than it affects you. Oh, your friend has an eating disorder that can genuinely really affect your health and social situations, and you think it’s annoying to care for them? Waa waa, cry about it.\n\nSorry, I’m usually not this mean, but it really pmo 😭\n\n\nAlso, I left a comment saying “what if they had Arfid? And two people replied “that’s not a real disease!” So, glad to see how intelligent people are on Instagram reels 😭🙏",
  "url": "https://i.redd.it/ndpxdp9qksve1.jpeg",
  "score": 176,
  "num_comments": 28,
  "comments": [
    {
      "id": "mny2sal",
      "author": "WeirdUnion5605",
      "body": "That's why I'd rather be alone. These people act as if they are perfect and as if we don't hear this kind of stuff thrown in our faces all life. I'm tired of being a burden to others over stuff I can't control, it's the same as my family thinking depression is sadness. I never bother going to places with other people because I know I won't be able to eat anything, and bringing food they think is rude though, so I just look for excuses to not eat, which is also rude, so there's no winning with ARFID. I should be more worried about having to eat through a tube than with other grown up people's feelings for fuck sake.\n\nI never tell people I have an ED because they not understanding would just piss me off, instead I just tell the other truth: \"I throw up everything I eat\", it rarely works either though, people just feel the right to act bitchy and judgemental.",
      "created_utc": 1745079027.0,
      "score": 46,
      "context": []
    },
    {
      "id": "mnxad3z",
      "author": "Upset-Lavishness-522",
      "body": "The post is unnecessarily mean....but its unfortunately true. I have personally never asked to be accommodated , and have always gone to whatever restaurant the group wants to go to. We have a disorder, but we don't have the right to inflict it on others. That said, there is ZERO reason for anyone to be that nasty  (unless the \"picky eater\" gets to dictate which restaurants are  patronized, but even then, a conversation might be better than a bitchy tweet)",
      "created_utc": 1745069615.0,
      "score": 169,
      "context": []
    },
    {
      "id": "mnymq3i",
      "author": "Stormdude127",
      "body": "I just hate that this seems to be everyone’s default perception of people with ARFID. I would say MOST people with ARFID are willing to make their own accommodations, sometimes that means not eating, or sometimes it means just having bread, fries, or white rice. There are people like who the OP is talking about, and those people do suck, but they’re by far not the majority, but people on Reddit seem to think they are and judge the rest of us by their actions. But what I hate even more is when you do everything you can to get out of the way and to not force other people to accommodate you, but they insist on doing it anyway because they just find it too weird for you to not eat while they’re eating or not eat a real meal. So they change the restaurant so you can eat with them and then make passive aggressive comments later. Like bitch, you CHOSE to do that, I specifically told you not to, but you just couldn’t handle watching someone else not eat. It’s like they don’t believe me when I say I’ll be fine. Our ancestors fasted for days sometimes. Skipping one meal isn’t gonna kill me, and I’ll eat afterwards anyway. Idk why that’s so hard for some people to understand. It’s not my fault society has decided that meals out are a social event that everyone must partake in fully 🙄",
      "created_utc": 1745085281.0,
      "score": 21,
      "context": []
    },
    {
      "id": "mny7ryo",
      "author": "TheMadHatterWasHere",
      "body": "I feel like what they are complaining about is this picky person being entitled. Like they cannot just go to an Indian restaurant, and eat later if everyone else wants to go there? I would honestly have gone to the indian place, and just ate something else when I got home. I don't ask ppl to accomodate me ever, bc I know ppl will recent me for it :)",
      "created_utc": 1745080622.0,
      "score": 17,
      "context": []
    },
    {
      "id": "mnxu7tb",
      "author": "Kawichi",
      "body": "This post makes me want to beat up the OP. Some people need to stop being ignorant and let people do what they need to without being judged. ",
      "created_utc": 1745076328.0,
      "score": 24,
      "context": []
    },
    {
      "id": "mo2uw4f",
      "author": "SprintsAC",
      "body": "It's such an overdramatic post for someone to write out. Imagine being that bothered that someone doesn't want to eat something.",
      "created_utc": 1745151055.0,
      "score": 7,
      "context": []
    },
    {
      "id": "mnxe267",
      "author": "damnthatroy",
      "body": "I know the post sounds mean but I think its mainly targeting people who feel entitled because of their arfid/picky eating. If its people im not close to (my immediate family and my best friends) i would never ask to be accommodated I’ll just go along and find something to eat even if its just plain white rice or french fries, or I’ll just cancel and not mention im canceling because of the restaurant choice because I surround myself with nice people who would probably kinda feel obligated to change the restaurant so i can come.",
      "created_utc": 1745070967.0,
      "score": 24,
      "context": []
    },
    {
      "id": "mny52io",
      "author": "Bunchasticks",
      "body": "This person has clearly never experienced the hell that is spinach",
      "created_utc": 1745079755.0,
      "score": 10,
      "context": []
    },
    {
      "id": "mny8kp4",
      "author": "ShigolAjumma",
      "body": "This adult smells like they've peaked in high school. Find good people, some may never be compatible with you at mealtime. That's okay. You can be food incompatible but still be respectful and use your brains to find a solution. That dude is just a bully you don't want in your life anyways. ​",
      "created_utc": 1745080878.0,
      "score": 12,
      "context": []
    },
    {
      "id": "mnynku3",
      "author": "None",
      "body": "whenever I go out with friends specially to eat I try to find something I can eat, can't we all hang out together with me eating my hamburger and the rest of you eating the Indian spicy food? \nif it's at someone's place I can order something for me, let's say they're ordering pizza that I don't like I order French fries that I like, I'm very adjustable and every person with arfid I know doesn't try to make everyone eat what they like, I just say what I don't like and for some reason people are personally offended by it but there's nothing I can do",
      "created_utc": 1745085536.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mnycsgc",
      "author": "saintceciliax",
      "body": "Some people are just hateful.",
      "created_utc": 1745082205.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mnyzkx0",
      "author": "TR403",
      "body": "While I do hate that people see us that way, this hypothetical person shouldn’t be forcing others to go somewhere else. Any time I’m invited to eat with friends and they go someplace that doesn’t have any of my safe foods, I just tell them I’ll just have water or pick something else up from somewhere else nearby and eat before or after. I always search up the menu beforehand so I go to new places and I’ve never had anyone judge me to my face about bringing something different. Though sometimes people will be concerned when I’m not eating and it makes them feel guilty which makes me feel guilty in turn. Either way this asshole has clearly met the loud minority of people with arfid.",
      "created_utc": 1745089393.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mobgzur",
      "author": "x9x9x9x9x9",
      "body": "Yeah this is why I go and just don't eat anything or find an appetizer that won't make my body violently gag when I bite into an unexpected onion or something.",
      "created_utc": 1745268236.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mnz3u64",
      "author": "CuckooSpit_06",
      "body": "Someone clearly had a bad day. You could say the same thing, he wants people to accommodate him because the \"picky eaters\" choices weren't something he enjoyed.",
      "created_utc": 1745090824.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mo7a2nx",
      "author": "princessuuke",
      "body": "And this is why i never suggest going out to eat with anyone ever! And I hate when i get asked about food :))",
      "created_utc": 1745206648.0,
      "score": 1,
      "context": []
    },
    {
      "id": "moxffy4",
      "author": "JackTheMightyRat",
      "body": "I actually go with people to places and I just don't get anything. I eat after 🤷 idk many people who would make the whole group eat their safe food. like I understand that I'm the only one who won't eat there so why the hell should I force other people who don't have ARFID to accommodate to me?",
      "created_utc": 1745562548.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mnxazg4",
      "author": "None",
      "body": "I agree. Again, I’ve always just gone wherever people wanted to go when it comes to food, and I think forcing everybody to accommodate you is unfair to everyone else, but, yeah. Super hostile and mean. Maybe instead of whining on Reddit, they should have just talked to their friend. I’d be really upset if somebody posted this about me 😭",
      "created_utc": 1745069848.0,
      "score": 29,
      "context": [
        {
          "id": "mnxad3z",
          "author": "Upset-Lavishness-522",
          "body": "The post is unnecessarily mean....but its unfortunately true. I have personally never asked to be accommodated , and have always gone to whatever restaurant the group wants to go to. We have a disorder, but we don't have the right to inflict it on others. That said, there is ZERO reason for anyone to be that nasty  (unless the \"picky eater\" gets to dictate which restaurants are  patronized, but even then, a conversation might be better than a bitchy tweet)",
          "created_utc": 1745069615.0
        }
      ]
    },
    {
      "id": "mnz0xt3",
      "author": "No_Tailor_9572",
      "body": "That's a really disparaging way to think of us. My friends & family love me so we go to places where I can eat because I'm a human who deserves food even if that means we don't go to Thai places or whatever",
      "created_utc": 1745089849.0,
      "score": 31,
      "context": [
        {
          "id": "mnxad3z",
          "author": "Upset-Lavishness-522",
          "body": "The post is unnecessarily mean....but its unfortunately true. I have personally never asked to be accommodated , and have always gone to whatever restaurant the group wants to go to. We have a disorder, but we don't have the right to inflict it on others. That said, there is ZERO reason for anyone to be that nasty  (unless the \"picky eater\" gets to dictate which restaurants are  patronized, but even then, a conversation might be better than a bitchy tweet)",
          "created_utc": 1745069615.0
        }
      ]
    },
    {
      "id": "mo6lyp2",
      "author": "Gashi_The_Fangirl_75",
      "body": "I don’t know if “inflicting our disorder upon others” is the kindest way to put it. Like obviously it’s not cool to pick the restaurant every time or demand people change pre-existing plans for you, but if you’re going to a restaurant with someone to have a nice time with them, it should be a place everyone can enjoy. It’s not a burden to have to accommodate people you care about if you actually care about them. My sister has celiac disease, my mom doesn’t eat red meat, and I have ARFID. This makes it incredibly difficult to find restaurants or meals that we can all agree on, but none of us *ever* treat anyone like an annoyance for having these requirements. We keep searching until we find a place we can all get something at, or we get food from multiple places and eat at a third location. Everyone deserves to eat. Everyone deserves to have their needs met.",
      "created_utc": 1745197610.0,
      "score": 8,
      "context": [
        {
          "id": "mnxad3z",
          "author": "Upset-Lavishness-522",
          "body": "The post is unnecessarily mean....but its unfortunately true. I have personally never asked to be accommodated , and have always gone to whatever restaurant the group wants to go to. We have a disorder, but we don't have the right to inflict it on others. That said, there is ZERO reason for anyone to be that nasty  (unless the \"picky eater\" gets to dictate which restaurants are  patronized, but even then, a conversation might be better than a bitchy tweet)",
          "created_utc": 1745069615.0
        }
      ]
    },
    {
      "id": "mnz5y3o",
      "author": "Odd-fox-God",
      "body": "When I don't want to eat something, I don't make a big deal about it. I just don't eat, I get fast food on the way home. It sucks. I hate turning down my friends' home cooked meals, but I literally cannot consume them without gagging. Throwing up your friends' food might be even more insulting than not eating it at all. I feel terrible about it all the time. \n\nI hate going to restaurants with my family because I usually have to ask if we can hit up some fast food joint on the way home. Last time I went to California Pizza Kitchen I just sat there with nothing in front of me because I didn't want to bother my parents with $15 plain bow tie pasta. I hate pasta sauce, it tastes like absolute garbage.\n\nCheesecake Factory changed the recipe of my safe food, the chicken tenders from the kids meal. Words cannot describe how much I hate ordering from the kids meal. It makes me feel... infantile.",
      "created_utc": 1745091539.0,
      "score": 9,
      "context": [
        {
          "id": "mnxu7tb",
          "author": "Kawichi",
          "body": "This post makes me want to beat up the OP. Some people need to stop being ignorant and let people do what they need to without being judged. ",
          "created_utc": 1745076328.0
        }
      ]
    },
    {
      "id": "mnxedmn",
      "author": "damnthatroy",
      "body": "Maybe the person the OP is talking about has a way more severe arfid than me though so that would be sad, they should ask the person whats wrong",
      "created_utc": 1745071081.0,
      "score": 3,
      "context": [
        {
          "id": "mnxe267",
          "author": "damnthatroy",
          "body": "I know the post sounds mean but I think its mainly targeting people who feel entitled because of their arfid/picky eating. If its people im not close to (my immediate family and my best friends) i would never ask to be accommodated I’ll just go along and find something to eat even if its just plain white rice or french fries, or I’ll just cancel and not mention im canceling because of the restaurant choice because I surround myself with nice people who would probably kinda feel obligated to change the restaurant so i can come.",
          "created_utc": 1745070967.0
        }
      ]
    },
    {
      "id": "mo9ucln",
      "author": "___disaster___",
      "body": "im not asking to be accommodated either - but every time i go out or travel with people or stay at somebody's place, they're hellbent on accommodating me.\n\nand you know what? it sometimes works out.\n\nrecently i was planning to go on my favorite apples and sweets for two days while out of town bc things are bad for me rn. but two ppl i was there with (who are more of acquaintances than friends) were trying to find something i could try and like - even despite knowing that i may not eat it at all or eat a spoonful and decide i can't stomach it.\n\nand their openness to it and their kindness made me actually feel safe enough to give it a try, even in an unknown place (which usually stresses me out). and i liked it v much. it was some curry thing and i haven't eaten anything like that for 1,5 year.\n\nim so glad that they were willing to go to such lengths for me (you can probably imagine how many ingredients i vetoed and they never bat an eye, never complained). and it made me realize that id do the same for another person. it's just me, i don't feel worthy of something like this being done for me, so i never ask. but maybe we're all worth it and should ask for it, at least from time to time, or when it's important.",
      "created_utc": 1745250729.0,
      "score": 7,
      "context": [
        {
          "id": "mnxad3z",
          "author": "Upset-Lavishness-522",
          "body": "The post is unnecessarily mean....but its unfortunately true. I have personally never asked to be accommodated , and have always gone to whatever restaurant the group wants to go to. We have a disorder, but we don't have the right to inflict it on others. That said, there is ZERO reason for anyone to be that nasty  (unless the \"picky eater\" gets to dictate which restaurants are  patronized, but even then, a conversation might be better than a bitchy tweet)",
          "created_utc": 1745069615.0
        },
        {
          "id": "mnxazg4",
          "author": "None",
          "body": "I agree. Again, I’ve always just gone wherever people wanted to go when it comes to food, and I think forcing everybody to accommodate you is unfair to everyone else, but, yeah. Super hostile and mean. Maybe instead of whining on Reddit, they should have just talked to their friend. I’d be really upset if somebody posted this about me 😭",
          "created_utc": 1745069848.0
        }
      ]
    },
    {
      "id": "mo8dm2e",
      "author": "Upset-Lavishness-522",
      "body": "I hear you. We accommodate ARFID, vegans and celiac too - its a nightmare. The problem is that ARFID and vegans can get lumped into the same box. Im likely projecting the feelings of others when I say 'inflicting'.",
      "created_utc": 1745229684.0,
      "score": 2,
      "context": [
        {
          "id": "mnxad3z",
          "author": "Upset-Lavishness-522",
          "body": "The post is unnecessarily mean....but its unfortunately true. I have personally never asked to be accommodated , and have always gone to whatever restaurant the group wants to go to. We have a disorder, but we don't have the right to inflict it on others. That said, there is ZERO reason for anyone to be that nasty  (unless the \"picky eater\" gets to dictate which restaurants are  patronized, but even then, a conversation might be better than a bitchy tweet)",
          "created_utc": 1745069615.0
        },
        {
          "id": "mo6lyp2",
          "author": "Gashi_The_Fangirl_75",
          "body": "I don’t know if “inflicting our disorder upon others” is the kindest way to put it. Like obviously it’s not cool to pick the restaurant every time or demand people change pre-existing plans for you, but if you’re going to a restaurant with someone to have a nice time with them, it should be a place everyone can enjoy. It’s not a burden to have to accommodate people you care about if you actually care about them. My sister has celiac disease, my mom doesn’t eat red meat, and I have ARFID. This makes it incredibly difficult to find restaurants or meals that we can all agree on, but none of us *ever* treat anyone like an annoyance for having these requirements. We keep searching until we find a place we can all get something at, or we get food from multiple places and eat at a third location. Everyone deserves to eat. Everyone deserves to have their needs met.",
          "created_utc": 1745197610.0
        }
      ]
    },
    {
      "id": "mo9xv89",
      "author": "None",
      "body": "Nah I get that! Theres nothing wrong with being accommodated! I love it when people do that for me, I would just never force them to, lol.",
      "created_utc": 1745252006.0,
      "score": 2,
      "context": [
        {
          "id": "mnxad3z",
          "author": "Upset-Lavishness-522",
          "body": "The post is unnecessarily mean....but its unfortunately true. I have personally never asked to be accommodated , and have always gone to whatever restaurant the group wants to go to. We have a disorder, but we don't have the right to inflict it on others. That said, there is ZERO reason for anyone to be that nasty  (unless the \"picky eater\" gets to dictate which restaurants are  patronized, but even then, a conversation might be better than a bitchy tweet)",
          "created_utc": 1745069615.0
        },
        {
          "id": "mnxazg4",
          "author": "None",
          "body": "I agree. Again, I’ve always just gone wherever people wanted to go when it comes to food, and I think forcing everybody to accommodate you is unfair to everyone else, but, yeah. Super hostile and mean. Maybe instead of whining on Reddit, they should have just talked to their friend. I’d be really upset if somebody posted this about me 😭",
          "created_utc": 1745069848.0
        },
        {
          "id": "mo9ucln",
          "author": "___disaster___",
          "body": "im not asking to be accommodated either - but every time i go out or travel with people or stay at somebody's place, they're hellbent on accommodating me.\n\nand you know what? it sometimes works out.\n\nrecently i was planning to go on my favorite apples and sweets for two days while out of town bc things are bad for me rn. but two ppl i was there with (who are more of acquaintances than friends) were trying to find something i could try and like - even despite knowing that i may not eat it at all or eat a spoonful and decide i can't stomach it.\n\nand their openness to it and their kindness made me actually feel safe enough to give it a try, even in an unknown place (which usually stresses me out). and i liked it v much. it was some curry thing and i haven't eaten anything like that for 1,5 year.\n\nim so glad that they were willing to go to such lengths for me (you can probably imagine how many ingredients i vetoed and they never bat an eye, never complained). and it made me realize that id do the same for another person. it's just me, i don't feel worthy of something like this being done for me, so i never ask. but maybe we're all worth it and should ask for it, at least from time to time, or when it's important.",
          "created_utc": 1745250729.0
        }
      ]
    },
    {
      "id": "mo9uc2a",
      "author": "___disaster___",
      "body": "what do you mean by lumping them in the same box?",
      "created_utc": 1745250708.0,
      "score": 1,
      "context": [
        {
          "id": "mnxad3z",
          "author": "Upset-Lavishness-522",
          "body": "The post is unnecessarily mean....but its unfortunately true. I have personally never asked to be accommodated , and have always gone to whatever restaurant the group wants to go to. We have a disorder, but we don't have the right to inflict it on others. That said, there is ZERO reason for anyone to be that nasty  (unless the \"picky eater\" gets to dictate which restaurants are  patronized, but even then, a conversation might be better than a bitchy tweet)",
          "created_utc": 1745069615.0
        },
        {
          "id": "mo6lyp2",
          "author": "Gashi_The_Fangirl_75",
          "body": "I don’t know if “inflicting our disorder upon others” is the kindest way to put it. Like obviously it’s not cool to pick the restaurant every time or demand people change pre-existing plans for you, but if you’re going to a restaurant with someone to have a nice time with them, it should be a place everyone can enjoy. It’s not a burden to have to accommodate people you care about if you actually care about them. My sister has celiac disease, my mom doesn’t eat red meat, and I have ARFID. This makes it incredibly difficult to find restaurants or meals that we can all agree on, but none of us *ever* treat anyone like an annoyance for having these requirements. We keep searching until we find a place we can all get something at, or we get food from multiple places and eat at a third location. Everyone deserves to eat. Everyone deserves to have their needs met.",
          "created_utc": 1745197610.0
        },
        {
          "id": "mo8dm2e",
          "author": "Upset-Lavishness-522",
          "body": "I hear you. We accommodate ARFID, vegans and celiac too - its a nightmare. The problem is that ARFID and vegans can get lumped into the same box. Im likely projecting the feelings of others when I say 'inflicting'.",
          "created_utc": 1745229684.0
        }
      ]
    },
    {
      "id": "mo9z35x",
      "author": "___disaster___",
      "body": "i wouldn't force anybody either, it's more about choosing the people around you having this in mind, remembering that this sort of kindness doesn't cost (*most of*) others all that much, not nearly as much as ARFID costs us.",
      "created_utc": 1745252390.0,
      "score": 3,
      "context": [
        {
          "id": "mnxad3z",
          "author": "Upset-Lavishness-522",
          "body": "The post is unnecessarily mean....but its unfortunately true. I have personally never asked to be accommodated , and have always gone to whatever restaurant the group wants to go to. We have a disorder, but we don't have the right to inflict it on others. That said, there is ZERO reason for anyone to be that nasty  (unless the \"picky eater\" gets to dictate which restaurants are  patronized, but even then, a conversation might be better than a bitchy tweet)",
          "created_utc": 1745069615.0
        },
        {
          "id": "mnxazg4",
          "author": "None",
          "body": "I agree. Again, I’ve always just gone wherever people wanted to go when it comes to food, and I think forcing everybody to accommodate you is unfair to everyone else, but, yeah. Super hostile and mean. Maybe instead of whining on Reddit, they should have just talked to their friend. I’d be really upset if somebody posted this about me 😭",
          "created_utc": 1745069848.0
        },
        {
          "id": "mo9ucln",
          "author": "___disaster___",
          "body": "im not asking to be accommodated either - but every time i go out or travel with people or stay at somebody's place, they're hellbent on accommodating me.\n\nand you know what? it sometimes works out.\n\nrecently i was planning to go on my favorite apples and sweets for two days while out of town bc things are bad for me rn. but two ppl i was there with (who are more of acquaintances than friends) were trying to find something i could try and like - even despite knowing that i may not eat it at all or eat a spoonful and decide i can't stomach it.\n\nand their openness to it and their kindness made me actually feel safe enough to give it a try, even in an unknown place (which usually stresses me out). and i liked it v much. it was some curry thing and i haven't eaten anything like that for 1,5 year.\n\nim so glad that they were willing to go to such lengths for me (you can probably imagine how many ingredients i vetoed and they never bat an eye, never complained). and it made me realize that id do the same for another person. it's just me, i don't feel worthy of something like this being done for me, so i never ask. but maybe we're all worth it and should ask for it, at least from time to time, or when it's important.",
          "created_utc": 1745250729.0
        },
        {
          "id": "mo9xv89",
          "author": "None",
          "body": "Nah I get that! Theres nothing wrong with being accommodated! I love it when people do that for me, I would just never force them to, lol.",
          "created_utc": 1745252006.0
        }
      ]
    },
    {
      "id": "mo9y0uo",
      "author": "Upset-Lavishness-522",
      "body": "People can assume ARFID is being picky/fussy ie a choice, like veganism",
      "created_utc": 1745252055.0,
      "score": 1,
      "context": [
        {
          "id": "mnxad3z",
          "author": "Upset-Lavishness-522",
          "body": "The post is unnecessarily mean....but its unfortunately true. I have personally never asked to be accommodated , and have always gone to whatever restaurant the group wants to go to. We have a disorder, but we don't have the right to inflict it on others. That said, there is ZERO reason for anyone to be that nasty  (unless the \"picky eater\" gets to dictate which restaurants are  patronized, but even then, a conversation might be better than a bitchy tweet)",
          "created_utc": 1745069615.0
        },
        {
          "id": "mo6lyp2",
          "author": "Gashi_The_Fangirl_75",
          "body": "I don’t know if “inflicting our disorder upon others” is the kindest way to put it. Like obviously it’s not cool to pick the restaurant every time or demand people change pre-existing plans for you, but if you’re going to a restaurant with someone to have a nice time with them, it should be a place everyone can enjoy. It’s not a burden to have to accommodate people you care about if you actually care about them. My sister has celiac disease, my mom doesn’t eat red meat, and I have ARFID. This makes it incredibly difficult to find restaurants or meals that we can all agree on, but none of us *ever* treat anyone like an annoyance for having these requirements. We keep searching until we find a place we can all get something at, or we get food from multiple places and eat at a third location. Everyone deserves to eat. Everyone deserves to have their needs met.",
          "created_utc": 1745197610.0
        },
        {
          "id": "mo8dm2e",
          "author": "Upset-Lavishness-522",
          "body": "I hear you. We accommodate ARFID, vegans and celiac too - its a nightmare. The problem is that ARFID and vegans can get lumped into the same box. Im likely projecting the feelings of others when I say 'inflicting'.",
          "created_utc": 1745229684.0
        },
        {
          "id": "mo9uc2a",
          "author": "___disaster___",
          "body": "what do you mean by lumping them in the same box?",
          "created_utc": 1745250708.0
        }
      ]
    },
    {
      "id": "mo9zltk",
      "author": "___disaster___",
      "body": "do we choose what we find moral and immoral tho? we can try to shape it but it's not possible to make it a choice. veganism can be a choice for some, it is not for others. i constantly juggle between veganism and ARFID, oftentimes caught between the two, having to choose between listening to one or the other. and i don't find any of those two voices stronger for me.",
      "created_utc": 1745252550.0,
      "score": 1,
      "context": [
        {
          "id": "mnxad3z",
          "author": "Upset-Lavishness-522",
          "body": "The post is unnecessarily mean....but its unfortunately true. I have personally never asked to be accommodated , and have always gone to whatever restaurant the group wants to go to. We have a disorder, but we don't have the right to inflict it on others. That said, there is ZERO reason for anyone to be that nasty  (unless the \"picky eater\" gets to dictate which restaurants are  patronized, but even then, a conversation might be better than a bitchy tweet)",
          "created_utc": 1745069615.0
        },
        {
          "id": "mo6lyp2",
          "author": "Gashi_The_Fangirl_75",
          "body": "I don’t know if “inflicting our disorder upon others” is the kindest way to put it. Like obviously it’s not cool to pick the restaurant every time or demand people change pre-existing plans for you, but if you’re going to a restaurant with someone to have a nice time with them, it should be a place everyone can enjoy. It’s not a burden to have to accommodate people you care about if you actually care about them. My sister has celiac disease, my mom doesn’t eat red meat, and I have ARFID. This makes it incredibly difficult to find restaurants or meals that we can all agree on, but none of us *ever* treat anyone like an annoyance for having these requirements. We keep searching until we find a place we can all get something at, or we get food from multiple places and eat at a third location. Everyone deserves to eat. Everyone deserves to have their needs met.",
          "created_utc": 1745197610.0
        },
        {
          "id": "mo8dm2e",
          "author": "Upset-Lavishness-522",
          "body": "I hear you. We accommodate ARFID, vegans and celiac too - its a nightmare. The problem is that ARFID and vegans can get lumped into the same box. Im likely projecting the feelings of others when I say 'inflicting'.",
          "created_utc": 1745229684.0
        },
        {
          "id": "mo9uc2a",
          "author": "___disaster___",
          "body": "what do you mean by lumping them in the same box?",
          "created_utc": 1745250708.0
        },
        {
          "id": "mo9y0uo",
          "author": "Upset-Lavishness-522",
          "body": "People can assume ARFID is being picky/fussy ie a choice, like veganism",
          "created_utc": 1745252055.0
        }
      ]
    }
  ]
}