{
  "id": "1k36eqq",
  "subreddit": "ARFID",
  "author": "None",
  "created_utc": 1745096938.0,
  "title": "ARFID feels embarrassing",
  "selftext": "It’s a huge inconvenience. I cannot even look in the direction of a piece of food if I’m not at starving levels of hungry. I always have to bring my own meal to family events and eat it somewhere alone because I can’t handle being around non-safe foods. It’s *so* embarrassing to be a grown adult bringing a little cup of Kraft mac-n-cheese. I avoid food at all costs because the idea of eating just makes me feel sick. \n\nGoing to other people’s houses and trying to articulate a sentence to explain “hey I have an eating disorder so, if I don’t eat please understand that it’s nothing against your cooking, i just can barely eat” is embarrassing. \n\nGoing to restaurants and being the only person unable to order food because *what if this restaurant that makes my safe food makes it in a way that makes it not safe anymore* is embarrassing. \n\nHaving to explain hundreds of times to people that it’s not the fact I *don’t* want to try new things (because I wish I could!! I’m extremely jealous of people who can just eat whatever!!), and I’m not just “childish” is embarrassing. I feel extreme guilt for my ARFID and what comes with it. ",
  "url": "https://www.reddit.com/r/ARFID/comments/1k36eqq/arfid_feels_embarrassing/",
  "score": 177,
  "num_comments": 18,
  "comments": [
    {
      "id": "mnzpgvx",
      "author": "WeirdUnion5605",
      "body": "I could have written this post, I feel exactly the same,  even that I wish I could try everything, I'm so curious how they taste but sometimes I can't even eat stuff I like.",
      "created_utc": 1745098060.0,
      "score": 36,
      "context": []
    },
    {
      "id": "mo0080w",
      "author": "Top_Improvement8494",
      "body": "So so so embarrassing. We are moving soon and one of my main anxieties is that I will have to meet new people and eat around them. And answer questions. And be perceived as childish. It’s exhausting.",
      "created_utc": 1745101805.0,
      "score": 23,
      "context": []
    },
    {
      "id": "mo09ypb",
      "author": "dioor",
      "body": "The eating at other people’s houses bit hits *so hard.* But if it helps at all, I can tell you that sometime in my late 20s I just reframed it for myself: I am managing a medical condition. I am *not* judging the cleanliness of this person’s home, their cooking skills, etc. I have told them as much, so if they choose to be offended anyway by a medical condition I cannot control, that’s their problem. It’s like leaping to the assumption that if someone is at your house and has to leave early because they have a headache, they’re stealthily trying to say your house has a strong smell or something like that. It’s just an unwarranted leap. \n\nI’ll only once at the same house explain some version of: I have a medical condition and am a super sensitive eater — I always eat before I come to a get together rather than make my hosts accommodate me because trust me, it’s so limiting, it would ruin the meal for everyone else! I’m happy to be here, I just won’t be able to eat much, that’s all. \n\nAnd from there I just don’t really explain myself further, I just decline any food that’s offered that I don’t want (generally everything). I find it helps to bring drinks that I know I’ll like — fizzy/flavoured waters can be a good one — to fit in a bit better at a table where everyone else is eating. \n\nIf people can’t handle my condition and don’t invite me back because of it, good, I wouldn’t have had much of a relationship with these people anyway since managing ARFID is a big part of who I am.",
      "created_utc": 1745105212.0,
      "score": 12,
      "context": []
    },
    {
      "id": "mnzplyx",
      "author": "caldus_x",
      "body": "Understand and relate to this so hard. You’re absolutely not alone! Send yourself so much compassion, you are doing your best!",
      "created_utc": 1745098109.0,
      "score": 10,
      "context": []
    },
    {
      "id": "mo0qocf",
      "author": "kendraro",
      "body": "I relate to this so much, but what I have is food allergies. Please be kind to yourself, you also have a medical condition and you are doing your best.",
      "created_utc": 1745111338.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mobvmh6",
      "author": "MultiFandomShipperr",
      "body": "I hate when my relatives come over because I'll be eating one of the only things I can eat (like plain rice or hotdogs) and they'll start judging me and saying that I should eat other things. And even going as far as putting random stuff ON TOP OF MY RICE! And I can't explain to them that the thought of eating something unsafe makes me sick and that, no, I can't just force myself to eat.\n\nI hate having everyone look at my plate of white rice while they have theirs full of plantain and vegetables and stuff",
      "created_utc": 1745272758.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mo0l6l4",
      "author": "m6u9s6i9c",
      "body": "I’m the same. I never bring my own food to family events, I just refuse to eat anything. Today my family was meeting for Easter and I didn’t eat anything but a few bites of pie and candy. It’s so embarrassing, especially because my family makes fun of everything anyone does. My one cousin is actually a dietitian, but she never stops anyone from making fun",
      "created_utc": 1745109291.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mo8s9bg",
      "author": "SomeTraits",
      "body": "If only the public knew about ARFID, it'd be way easier for us!",
      "created_utc": 1745237184.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mo0fgpl",
      "author": "ingol98",
      "body": "I feel this 100% to the core!! you ain't alone!",
      "created_utc": 1745107158.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mo24ymm",
      "author": "_purplegalaxy_",
      "body": "I feel the same, and the lack of information in general doesn’t help that much either, I hope that all of us can get and work in the recovery that we deserve😞",
      "created_utc": 1745135568.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mo4jpeh",
      "author": "Aromatic-Elephant110",
      "body": "I felt that way when I was younger. I don't really care anymore. I can eat what I can eat. It's not like I'm doing it for funsies.",
      "created_utc": 1745172025.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mo1ispr",
      "author": "a-little-onee",
      "body": "Ugh felt. I feel so annoying not eating around my friends or getting super basic stuff… esp nowadays I’m scared it’s off putting or “pick me” behaviour even though it’s not😭",
      "created_utc": 1745122868.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mp17f86",
      "author": "lorthelie",
      "body": "I read this and realize I say this in my head all the time. It sucks.",
      "created_utc": 1745613246.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mw9owc7",
      "author": "General_Writer_1664",
      "body": "I also have ARFID. It's really embarrassing to say out my condition and my colleagues are also trying hard to ask me for lunch but I just can't do it 😔",
      "created_utc": 1749188023.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mz2btjd",
      "author": "ksizzle27",
      "body": "I was just diagnosed with diabetes because all I can eat are uncrustables and they are high in sugar. My Dr and family don't understand and they act like it's so easy to just start eating all kinds of different food everyday and the thought of it is making me sick. Ive been having massive meltdowns the last couple days because this is so stressful. I hate this so much. Glad to know I'm not alone",
      "created_utc": 1750547361.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mo8p2l9",
      "author": "naokokoro",
      "body": "God I feel this so much, no faster way to feel like a complete outsider, & no amount of distractions is enough to make time fly. Hugsss for you 🫂",
      "created_utc": 1745235769.0,
      "score": 3,
      "context": [
        {
          "id": "mo0l6l4",
          "author": "m6u9s6i9c",
          "body": "I’m the same. I never bring my own food to family events, I just refuse to eat anything. Today my family was meeting for Easter and I didn’t eat anything but a few bites of pie and candy. It’s so embarrassing, especially because my family makes fun of everything anyone does. My one cousin is actually a dietitian, but she never stops anyone from making fun",
          "created_utc": 1745109291.0
        }
      ]
    },
    {
      "id": "mo9yrx9",
      "author": "None",
      "body": "I really wish ARFID was more known about like other eating disorders, I didn’t even know it existed till I was recently diagnosed with it!!",
      "created_utc": 1745252293.0,
      "score": 2,
      "context": [
        {
          "id": "mo8s9bg",
          "author": "SomeTraits",
          "body": "If only the public knew about ARFID, it'd be way easier for us!",
          "created_utc": 1745237184.0
        }
      ]
    },
    {
      "id": "n04mwo9",
      "author": "One_Bat8206",
      "body": "you've literally only eaten uncrustables your entire life? at some point you've got to make a stand... diabetes is no joke.",
      "created_utc": 1751055983.0,
      "score": 1,
      "context": [
        {
          "id": "mz2btjd",
          "author": "ksizzle27",
          "body": "I was just diagnosed with diabetes because all I can eat are uncrustables and they are high in sugar. My Dr and family don't understand and they act like it's so easy to just start eating all kinds of different food everyday and the thought of it is making me sick. Ive been having massive meltdowns the last couple days because this is so stressful. I hate this so much. Glad to know I'm not alone",
          "created_utc": 1750547361.0
        }
      ]
    }
  ]
}