{
  "id": "1k4hxwo",
  "subreddit": "ARFID",
  "author": "None",
  "created_utc": 1745253564.0,
  "title": "So only Women and children have this?",
  "selftext": "I finally decided to seek out some help for my lifelong struggle with eating. I’m a 38 yo man. \n\n\nThe lack of help for men with eating issues is crazy. I’m finding that most places cater specifically to children/adolescents and women. This morning for example, was told on the phone “we do not provide services for cis-gendered men”. She then referred me to a place that only provides services for children. \n\nAre you kidding me? I guess I should just “be a man” and just start forcing myself to eat. \n",
  "url": "https://www.reddit.com/r/ARFID/comments/1k4hxwo/so_only_women_and_children_have_this/",
  "score": 204,
  "num_comments": 46,
  "comments": [
    {
      "id": "moa4qzn",
      "author": "mymonkeybusiness",
      "body": "This is so fucking wrong I'm also a man I'm 26 and had issues w food my whole life have u tried asking ur GP best of luck dude",
      "created_utc": 1745254094.0,
      "score": 125,
      "context": []
    },
    {
      "id": "moa6ykd",
      "author": "lilliweasel",
      "body": "I worked in a NHS unit for childhood and teenage eating disorders (outpatient) for just over a year(where I first discovered I had ARFID) and I would say the larger majority of the patients were female but it is absolutely ludicrous to deny treatment to men",
      "created_utc": 1745254736.0,
      "score": 80,
      "context": []
    },
    {
      "id": "moa82jx",
      "author": "anwar_negali",
      "body": "Adult male here. Also Arfid. Sorry your going through this buddy. You aren't alone.",
      "created_utc": 1745255058.0,
      "score": 44,
      "context": []
    },
    {
      "id": "moa8vav",
      "author": "WeirdUnion5605",
      "body": "Only children it seems, I can only find info and help for children and teens at the most, they do know we grew up and still need the help right?? So infuriating.",
      "created_utc": 1745255286.0,
      "score": 37,
      "context": []
    },
    {
      "id": "moagtpl",
      "author": "Squirrel_Worth",
      "body": "As a cis woman - wtf. A lot of places only provide help for children around me (not very useful when it wasn’t a recognised ED when you were a child and your parents tried to get help but hey) but I don’t see why your gender should have any bearing on receiving care for this.",
      "created_utc": 1745257566.0,
      "score": 17,
      "context": []
    },
    {
      "id": "moa9fkm",
      "author": "Angelangepange",
      "body": "What in the world 🤦🏻‍♀️ I'm so sorry you had to deal with this absurdity",
      "created_utc": 1745255449.0,
      "score": 11,
      "context": []
    },
    {
      "id": "moaab2n",
      "author": "Delicious_Impress818",
      "body": "this is so stupid. you deserve help just as much as anyone else! I hope you are able to find a facility that is useful 😔",
      "created_utc": 1745255702.0,
      "score": 9,
      "context": []
    },
    {
      "id": "moa8bue",
      "author": "PatientSufficient69",
      "body": "I mean....I'm autistic and was told my whole life that wasn't possible because I don't have a penis....just saying it goes both ways, all ways...don't be the victim take charge and keep calling.",
      "created_utc": 1745255130.0,
      "score": 47,
      "context": []
    },
    {
      "id": "moalxpg",
      "author": "StrawbraryLiberry",
      "body": "Wow, that's wild because so many men have eating disorders, it's not even like it's rare, it's just being ignored for the most part. I'm sorry!",
      "created_utc": 1745259035.0,
      "score": 5,
      "context": []
    },
    {
      "id": "moc8r1d",
      "author": "starboatkarl",
      "body": "The Eating Recovery Center has locations in denver, Chicago, and cincinnati, and they for sure treat men! i’ve met several male patients of all different ages at their locations. good luck op",
      "created_utc": 1745277194.0,
      "score": 5,
      "context": []
    },
    {
      "id": "moabrj1",
      "author": "StellaEtoile1",
      "body": "I'm really sorry they did that! I hope you call them back and ask them why they don't.",
      "created_utc": 1745256118.0,
      "score": 4,
      "context": []
    },
    {
      "id": "moah4dd",
      "author": "two-of-me",
      "body": "I’m so sorry you’re being dismissed due to your gender. ARFID does not discriminate. But people do, and when they do it makes people feel like they don’t deserve the help they need. I’m really sorry. Keep looking.",
      "created_utc": 1745257650.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mob5dyy",
      "author": "Calm-Ad-7206",
      "body": "I’m glad u/Blunt3donreality sought help. That is actually a HUGE step a lot of men/male/boys don’t take. I’m sorry the professionals didn’t take you seriously. I am a former professional cook, I can make whatever my boyfriend likes. I think he has grown and discovered new foods through my cooking, but never when I say “JUST TRY IT!” It’s a psychological thing, he has trauma related to food. AFRID is REAL and men can have it just as bad as women have other EDs.",
      "created_utc": 1745264795.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mobr5y8",
      "author": "Sure-Lecture-2542",
      "body": "Whereas anorexia and bulemia are both about 90% female, 10% male. \nARFID is different. It’s more like 60% female, 40% male. \nPer published research. \nThis is NOT childhood disorder, but typical age at diagnosis is 11-13. \nTry contacting Equip.",
      "created_utc": 1745271328.0,
      "score": 5,
      "context": []
    },
    {
      "id": "moadjvu",
      "author": "Neocactus",
      "body": "I haven't seeked out any professional help.\n\nThough I REALLY, REALLY need to, because I think my mental health is getting to a point where I'll soon be beyond help.\n\nBut this really doesn't surprise me. I've never felt like this massive eating problem I've had for basically my whole life was ever taken all that seriously by anyone.",
      "created_utc": 1745256629.0,
      "score": 3,
      "context": []
    },
    {
      "id": "moc0imi",
      "author": "Sophia_HJ22",
      "body": "I was going to comment here, but then I’m trans - not going to be helpful for you 😂",
      "created_utc": 1745274402.0,
      "score": 3,
      "context": []
    },
    {
      "id": "moafyw1",
      "author": "CocteauTwinn",
      "body": "Nope. I know a 23 year old man who has it.",
      "created_utc": 1745257323.0,
      "score": 2,
      "context": []
    },
    {
      "id": "moaqepa",
      "author": "Nooshy1978",
      "body": "I'm a guy, I have autism and I have this. I am also older than most people expect that have this, I'm 46. But I only sought treatment the past few years, because I was miserable. I think about food way too much for someone who doesn't eat a whole lot of it.",
      "created_utc": 1745260352.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mob6ffn",
      "author": "dalykosh",
      "body": "I am trying to find resources for my husband who is 26 and I also haven’t had any luck finding resources for adults…",
      "created_utc": 1745265103.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mocg18v",
      "author": "Digimonera",
      "body": "My dad's got it too though he would NEVER admit it",
      "created_utc": 1745279647.0,
      "score": 2,
      "context": []
    },
    {
      "id": "moe2hdw",
      "author": "rainingBows1",
      "body": "My nephew has diagnosed arfid, if anything he has a much easier time getting accommodated in school or at home than I ever did and his mother also raised me! I was also told that I “taught him to be picky” growing up because he happens to have similar safe foods even though he has a wider variety of foods!! I was literally kicked out of feeding therapy 2x because I wasn’t cooperative… literally as a baby and toddler. Before I could articulate what the problem was. I was forced to get fruits and vegetables on my plate in elementary school and told to just throw them away after even if it made my entire lunch inedible. Yet my nephew was always accommodated, never forced to try new foods, was always assumed autistic until he was finally diagnosed this year. \n\nI am also autistic, and his mother told me I’m not like my sister (non verbal autistic high support needs) so I’m not autistic. Her son is literally a normal kid developmentally, can fully take care of himself, has critical thinking, never missed milestones (unlike me! I was late for ALL of my milestones!). \n\nSorry for the rant, the way you were treated just really hits home. I feel so much for you, no one should be  invalidated at any age or sex/gender even over a “childhood condition”, it’s not like we grow out of it and suddenly eat everything.  I would ask to speak to the director or head medical professional there and ask them directly why you can’t be treated. Even adults can develop arfid from trauma so it’s completely ridiculous to deny you. They don’t know what caused it or how long you’ve been struggling, not that it should even matter! It sounds like to me the receptionist was ableist and didn’t feel like you needed treatment. This is literally discrimination. Unless it’s specifically advertised with this “rule” I’d try to talk to someone higher up about this and see if their practice is discriminatory or if the receptionist was in the wrong.",
      "created_utc": 1745303484.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mom5mlm",
      "author": "21stcenturydiyboy",
      "body": "I’m an adult man with ARFID as well. Admittedly not cisgender, but the idea that EDs are a “woman’s issue” can be really invalidating. ARFID doesn’t discriminate",
      "created_utc": 1745419053.0,
      "score": 2,
      "context": []
    },
    {
      "id": "monok88",
      "author": "djbullard87",
      "body": "In the same boat. 37 year old man. No help at all. I’ve been so unwell with it for the last 14 months it’s messed up my mental health as it all came on after I was polydrugged by my doctor with anti depressants and it’s literally poisoned me so I’m terrified to eat anything and there’s no help for me at all. I’ve been left feeling like I’m dying every day.",
      "created_utc": 1745434936.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mob06ou",
      "author": "iandmeagree",
      "body": "I’m 23M with ARFID. People are fucked",
      "created_utc": 1745263246.0,
      "score": 1,
      "context": []
    },
    {
      "id": "modfou6",
      "author": "No_Squash_6551",
      "body": "I know it sucks but the other side of it is that if they outright tell you they can't help you... it would be even worse if you paid a bunch of money to find out the hard way. \n\nI tried for several years to find a certain type of treatment program. I got denied all over the place after multiple screening calls because of them not really catering to my actual dx. Eventually one place said \"Yes oh absolutely no problem!\" but it worried me. Their view was that my dx always involved anxiety, so it would still be totally worth my time to go through their anxiety program. I asked for them to further clarify if it the actual doctors/therapists/etc involved were comfortable with this and thought it would be useful. I got to talk to the actual people who run the program instead of the intake people, annnnd they said \"we absolutely can't treat your actual dx, and it probably is not a good use of your time to come.\" Specifically, the main therapist I would be seeing had NEVER EVER treated anyone with it before.... and I certainly did not want to be the first.",
      "created_utc": 1745292319.0,
      "score": 1,
      "context": []
    },
    {
      "id": "modqspo",
      "author": "sjr56x",
      "body": "I’m not sure if it’s so much that men don’t have it as much as food issues are generally considered to be a very female thing. A lot of men have disordered eating and it’s just not acknowledged.",
      "created_utc": 1745297130.0,
      "score": 1,
      "context": []
    },
    {
      "id": "moef8is",
      "author": "FlemFatale",
      "body": "Same here. I'm not cis, but I'm a 35 year old man and really struggling with ARFID atm, mainly due to textures, tastes, look, and just not feeling hungry because now that my ADHD is medicated, my Autism symptoms are a lot more problematic and obvious.  \nTurns out, there is no treatment for ARFID in adults in my county, and after getting referred to numerous places and refused for the last 4 months, my GP is now trying to get the ICB to sort something out.  \nIt's a right ball ache, but hopefully, we will get somewhere with this...  \nSo, I know the struggle.",
      "created_utc": 1745311669.0,
      "score": 1,
      "context": []
    },
    {
      "id": "moiopqp",
      "author": "Poise-on",
      "body": "Wtf ?? That has to be discriminatory",
      "created_utc": 1745364347.0,
      "score": 1,
      "context": []
    },
    {
      "id": "molz6wx",
      "author": "Upset_Book_6643",
      "body": "No, not at all. Many men and boys have Arfid",
      "created_utc": 1745417103.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mopod9q",
      "author": "Issababy22",
      "body": "This is so fucked…I understand a facility servicing only children bc it can be a whole other ball game but like giving women only food assistance services is crazy like there’s no real reason they can’t serve men that’s so weird..",
      "created_utc": 1745457738.0,
      "score": 1,
      "context": []
    },
    {
      "id": "morrijx",
      "author": "L31FY",
      "body": "Men just fall into the stigma they should suck it up and not seek help which is unfortunate. 50% of the people I've known with this were dudes. ",
      "created_utc": 1745494230.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mosojot",
      "author": "floorigami",
      "body": "*hugs*",
      "created_utc": 1745505644.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mtgu7zp",
      "author": "ValuableAttention384",
      "body": "FFFFFFFFFFFF NO YOU FUCKING IDIOT MEN ALSO HAVE IT",
      "created_utc": 1747832985.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mobzt34",
      "author": "ssspiral",
      "body": "i think it’s more so about keeping populations segregated because of issues with trauma/assault/safety/etc. for example a lot of in-patient places will separate the sexes for SA reasons, and if the male floor has little to no patients at times, it may close down completely for funding reasons. i don’t think the lack of care is reflective of them thinking men don’t deserve or need help. more so a reflection of the complexities of the healthcare system and lack of resources",
      "created_utc": 1745274162.0,
      "score": 0,
      "context": []
    },
    {
      "id": "moapron",
      "author": "SachiKaM",
      "body": "If you live somewhere with limited access to resources, I could justify why treatment options would be generally centered to women (of child bearing age) and/or children than to adult men. However absolutely it does not *only* effect w/c, the health industry tends to prioritize supporting them nutritionally. Are you able to have your primary care refer you to a mental health specialist and dietitian? The qualifications for a DX are via the physical health implications you present, they may not get you to the clinic of your choice but it’s still treatable by separating the symptoms.",
      "created_utc": 1745260163.0,
      "score": 0,
      "context": []
    },
    {
      "id": "mocc71q",
      "author": "Relapsq",
      "body": "Men just don't realize they have disordered eating cause they're taught that's something women get. Just think about all the gym bros that eat chicken and rice for every meal 😭",
      "created_utc": 1745278350.0,
      "score": 41,
      "context": [
        {
          "id": "moa6ykd",
          "author": "lilliweasel",
          "body": "I worked in a NHS unit for childhood and teenage eating disorders (outpatient) for just over a year(where I first discovered I had ARFID) and I would say the larger majority of the patients were female but it is absolutely ludicrous to deny treatment to men",
          "created_utc": 1745254736.0
        }
      ]
    },
    {
      "id": "moaf2eo",
      "author": "Lost_My_Brilliance",
      "body": "even older kids and teenagers, where i live at least, the cut off for most places is 8-10, which a few 12-13 cut off spread in the mix. we haven’t gone to one yet, but the person i’m supposed to go to is like 2 hours away, the closest one that goes through 18. if it weren’t for my grandparents living around there and then we can stay the weekend and see them, we just wouldn’t go.  hopefully by the time i turn 18 i’ll be fine, because i don’t know what we’d do after that.",
      "created_utc": 1745257065.0,
      "score": 13,
      "context": [
        {
          "id": "moa8vav",
          "author": "WeirdUnion5605",
          "body": "Only children it seems, I can only find info and help for children and teens at the most, they do know we grew up and still need the help right?? So infuriating.",
          "created_utc": 1745255286.0
        }
      ]
    },
    {
      "id": "mod8t92",
      "author": "Feeling-Disaster7180",
      "body": "I was so excited to see a [news article](https://www.abc.net.au/news/104648840?utm_source=abc_news_app&utm_medium=content_shared&utm_campaign=abc_news_app&utm_content=link) by my country’s main outlet about ARFID, only for 95% of it to go on about kids after starting with “ARFID is a newly recognised eating disorder, which became an official diagnosis for adults and children in 2013”",
      "created_utc": 1745289647.0,
      "score": 6,
      "context": [
        {
          "id": "moa8vav",
          "author": "WeirdUnion5605",
          "body": "Only children it seems, I can only find info and help for children and teens at the most, they do know we grew up and still need the help right?? So infuriating.",
          "created_utc": 1745255286.0
        }
      ]
    },
    {
      "id": "moqjvkg",
      "author": "IndependenceOld8708",
      "body": "If i remember correctly, ARFID is actually more common in men when it comes to adult populations. It's just ARFID is a \"new\" eating disorder, and it's incredibly complex. I'd suggest looking up a therapist who specializes in eating disorders (like took extra schooling). \n\n\nI'm currently in my masters to be a mental health counselor. I've had people working on their PhD interview me because I have complex ARFID. Sadly a lot of us die before we get too old from malnutrition. It's reported as heart, liver, or kidney failure because there isn't much history or research on the disorder. It wasn't even a disorder when it nearly killed me in my early 20s and I'm 39 now. ",
      "created_utc": 1745469893.0,
      "score": 3,
      "context": [
        {
          "id": "moa8vav",
          "author": "WeirdUnion5605",
          "body": "Only children it seems, I can only find info and help for children and teens at the most, they do know we grew up and still need the help right?? So infuriating.",
          "created_utc": 1745255286.0
        }
      ]
    },
    {
      "id": "moaqbgb",
      "author": "Fizzabl",
      "body": "Oh I had the same with adhd. \"You can't have that that's 'naughty little boy disease'\" ?????",
      "created_utc": 1745260325.0,
      "score": 31,
      "context": [
        {
          "id": "moa8bue",
          "author": "PatientSufficient69",
          "body": "I mean....I'm autistic and was told my whole life that wasn't possible because I don't have a penis....just saying it goes both ways, all ways...don't be the victim take charge and keep calling.",
          "created_utc": 1745255130.0
        }
      ]
    },
    {
      "id": "moc9ur7",
      "author": "None",
      "body": "I’m not mad at these clinics for choosing to cater to specific populations. I get it. I’m just saying that in regard to disordered eating, there’s no one helping adult men.",
      "created_utc": 1745277561.0,
      "score": 4,
      "context": [
        {
          "id": "moalxpg",
          "author": "StrawbraryLiberry",
          "body": "Wow, that's wild because so many men have eating disorders, it's not even like it's rare, it's just being ignored for the most part. I'm sorry!",
          "created_utc": 1745259035.0
        }
      ]
    },
    {
      "id": "moaqhq6",
      "author": "SachiKaM",
      "body": "I did this and got to the point of a specialist telling me “if you continue, you will die”, and that wasn’t enough of a motivation bc my energy was so diminished. Please don’t wait.. even if it gets better, it always comes back stronger. I took 3yrs to recover and lost an entire life I created where I was happy, it happened so fast.",
      "created_utc": 1745260377.0,
      "score": 1,
      "context": [
        {
          "id": "moadjvu",
          "author": "Neocactus",
          "body": "I haven't seeked out any professional help.\n\nThough I REALLY, REALLY need to, because I think my mental health is getting to a point where I'll soon be beyond help.\n\nBut this really doesn't surprise me. I've never felt like this massive eating problem I've had for basically my whole life was ever taken all that seriously by anyone.",
          "created_utc": 1745256629.0
        }
      ]
    },
    {
      "id": "mopogb1",
      "author": "Issababy22",
      "body": "No disorder does smhhh..so wrong",
      "created_utc": 1745457767.0,
      "score": 1,
      "context": [
        {
          "id": "mom5mlm",
          "author": "21stcenturydiyboy",
          "body": "I’m an adult man with ARFID as well. Admittedly not cisgender, but the idea that EDs are a “woman’s issue” can be really invalidating. ARFID doesn’t discriminate",
          "created_utc": 1745419053.0
        }
      ]
    },
    {
      "id": "mofk7lm",
      "author": "kiiitsunecchan",
      "body": "IME, disordered eating in men is often more accepted (and expected). Most men I know would be considered \"picky\" if they were women, but their avoidance aligns with what is socially/culturally expected of men's diets, so no one bats an eye. Men don't generally eat fruits, veggies and wholefoods in general in my culture, and it's perfectly fine for them to live off of beige foods, meats and processed foods - if you're a woman, though, it's very concerning to eat like that, so we are more likely to be diagnosed. Same goes for binge eating.\n\nBody dysmorphic eating disorders often take on different forms in male populations as well. Dietitians in my country are just starting to see the tip of the iceberg with how prevalent bulimia and orthorexia are in males within fitness/sports circles.\n\nThere are still professors who equate body dysmorphia with patients being exclusively underweight, and eating disorders with body dysmorphia (ARFID is relatively knew as a dx, but it makes no sense for DIETITIANS to not be up to date with at leaat the basics of it), so there's a long way to go.",
      "created_utc": 1745330405.0,
      "score": 13,
      "context": [
        {
          "id": "moa6ykd",
          "author": "lilliweasel",
          "body": "I worked in a NHS unit for childhood and teenage eating disorders (outpatient) for just over a year(where I first discovered I had ARFID) and I would say the larger majority of the patients were female but it is absolutely ludicrous to deny treatment to men",
          "created_utc": 1745254736.0
        },
        {
          "id": "mocc71q",
          "author": "Relapsq",
          "body": "Men just don't realize they have disordered eating cause they're taught that's something women get. Just think about all the gym bros that eat chicken and rice for every meal 😭",
          "created_utc": 1745278350.0
        }
      ]
    },
    {
      "id": "mobrg6g",
      "author": "WeirdUnion5605",
      "body": "I wish you good luck!",
      "created_utc": 1745271418.0,
      "score": 1,
      "context": [
        {
          "id": "moa8vav",
          "author": "WeirdUnion5605",
          "body": "Only children it seems, I can only find info and help for children and teens at the most, they do know we grew up and still need the help right?? So infuriating.",
          "created_utc": 1745255286.0
        },
        {
          "id": "moaf2eo",
          "author": "Lost_My_Brilliance",
          "body": "even older kids and teenagers, where i live at least, the cut off for most places is 8-10, which a few 12-13 cut off spread in the mix. we haven’t gone to one yet, but the person i’m supposed to go to is like 2 hours away, the closest one that goes through 18. if it weren’t for my grandparents living around there and then we can stay the weekend and see them, we just wouldn’t go.  hopefully by the time i turn 18 i’ll be fine, because i don’t know what we’d do after that.",
          "created_utc": 1745257065.0
        }
      ]
    },
    {
      "id": "moawim4",
      "author": "seeeveryjoyouscolor",
      "body": "True. Op, A lack of services for AFAB is the overwhelming majority for almost every ailment! Even pregnancy/breast cancer drugs have studies tested exclusively on men - like beyond all logic 🙃\n\nThere’s no oppression Olympics points here. ARFID sucks. Having a specialized practice means better service for some while excluding others. \n\nIdeally, there are specialists for everyone. But in the real world, separate is not equal. \n\nThe takeaway for op is “Exclusion stinks,” remember how it feels next time you are in a place where you are *included* and ask yourself “who is missing from a seat at this table?”",
      "created_utc": 1745262157.0,
      "score": 19,
      "context": [
        {
          "id": "moa8bue",
          "author": "PatientSufficient69",
          "body": "I mean....I'm autistic and was told my whole life that wasn't possible because I don't have a penis....just saying it goes both ways, all ways...don't be the victim take charge and keep calling.",
          "created_utc": 1745255130.0
        },
        {
          "id": "moaqbgb",
          "author": "Fizzabl",
          "body": "Oh I had the same with adhd. \"You can't have that that's 'naughty little boy disease'\" ?????",
          "created_utc": 1745260325.0
        }
      ]
    }
  ]
}