{
  "id": "1ka01h4",
  "subreddit": "ARFID",
  "author": "None",
  "created_utc": 1745858243.0,
  "title": "I had ARFID so bad I nearly died. Now I can eat three meals a day, my muscles are coming back, my heart condition is fixed and my hair is growing back.",
  "selftext": "I’ll keep this short and easy to read. I had severe PTSD. I had some really awful things done to me and was forced to throw up often. \n\nAfter a long time of getting out of this. I finally got someone in my life who truly helped. I’ve been going to therapy for years, I was supposed to go to an inpatient facility for this disorder. I was hospitalized for a heart condition due to it, my hair was thinning and falling out, I couldn’t walk up the stairs, and I vomited atleast ten times a week. \n\nNow, this has taken me about three consistent months to get significantly better. I do have the support here so it is different than being alone. I just want to share what’s helped. I started dating someone I’ve known for awhile. I am 28F and he is 32M. He’s been a chef for about 15 years. He’s very passionate about it. He found me when I was basically on deaths door. \n\nThese are the things that have helped: \n\n- positive reinforcement after eating ANYTHING. Even a bite of food. \n\n- constantly watching short and very aesthetic videos starting with my safe foods.\n\n- going to a restaurant and eating the yummiest foods they have\n\n- I had to be taught, “you do not need to throw up again. It is not making you feel better. It is not helping. It’s literally killing you.” \n\n- we processed some of my trauma in a safe place and he helped me understand what I went through as abusive and wrong\n\nTo try to help you incorporate these things into your life, I’ll try to explain these things a bit. His passion for food really helped me learn to like food again. If I didn’t have him but I had this information that I do now, I would try to incorporate myself into spaces where people are passionate about food. Try to make it as fun as possible. Remind yourself that not eating will only make you feel worse in the long run. Try to find people who make you feel safe when you’re eating. Open up to your friends so they can help you. I can not stress this enough WATCH SHORT COOKING VIDEOS OF SAFE FOODS YOU LIKE!!!!! \n\nMind you, I do not have ARFID from Autism or ADHD, I don’t believe. I had some deep really vile trauma that was forced onto me, along with previous complex-PTSD as a young adult. \n\nNone the less, I thought I was completely fucked and left for dead with this disorder. I was lucky enough to have my boyfriend literally save my life with his passion for food and his patience and love for me. I know most people aren’t able to get that. But you can take the things I learned and try to apply them to your healing journey! I really hope this helps someone. Feel free to ask any questions. \n \n",
  "url": "https://www.reddit.com/r/ARFID/comments/1ka01h4/i_had_arfid_so_bad_i_nearly_died_now_i_can_eat/",
  "score": 199,
  "num_comments": 24,
  "comments": [
    {
      "id": "mpigxgn",
      "author": "ceciliabee",
      "body": "Thank you for sharing your experience! I'm so happy you have someone in your life who can support you through this. It sounds like you're doing well, keep it up! I'm proud of you!",
      "created_utc": 1745860093.0,
      "score": 14,
      "context": []
    },
    {
      "id": "mpj1fs6",
      "author": "StrawbraryLiberry",
      "body": "It's awesome you are getting so much better! \n\nI was in terrible shape before I started my recovery, and mine has taken so much longer to feel better! I've been recovering for over a year now, and it got worse before it got better. It's interesting how different healing can be for people. But just now, I feel my muscles coming back and I'm feeling stronger and less exhausted and I'm eating ALL the food groups finally nearly every day! \n\nIt's wonderful to feel so much healthier. I'm happy to hear you are healing so well! \n\nSometimes even a bite of food is an accomplishment! Healing is one bite at a time. 💙",
      "created_utc": 1745866098.0,
      "score": 9,
      "context": []
    },
    {
      "id": "mpiksft",
      "author": "sliereils",
      "body": "❤️❤️❤️ my girlfriend also loves cooking and she was a huge part of my recovery ❤️❤️❤️ really nice to hear a similar story :)",
      "created_utc": 1745861207.0,
      "score": 17,
      "context": []
    },
    {
      "id": "mpin8l5",
      "author": "Ok-Marsupial-9897",
      "body": "Thank you for sharing. It's encouraging to see you are doing better.",
      "created_utc": 1745861912.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mpka2xj",
      "author": "Cosmicrelief0",
      "body": "Literally the only time I feel like I get a handle on my ARFID is when I'm dating chefs 😭",
      "created_utc": 1745880119.0,
      "score": 8,
      "context": []
    },
    {
      "id": "mpjza8u",
      "author": "throw0OO0away",
      "body": "To add on, I tell myself that you only have to try something once. Afterwards, you never have eat it again. Another strategy I use is to end the meal with a safe food if I'm in an unfamiliar place.",
      "created_utc": 1745876415.0,
      "score": 6,
      "context": []
    },
    {
      "id": "mpku5jt",
      "author": "whoopsissathrowaway",
      "body": "DITTO ON WATCHING COOKING VIDEOS! Even for new foods, it really helped to see the cooking process and made some unfamiliar and scary foods look really appetizing",
      "created_utc": 1745887041.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mppv8wt",
      "author": "jeannesloaf",
      "body": "God damn I wish I had a partner to support me like this 🙃",
      "created_utc": 1745956849.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mpjghp5",
      "author": "orion_pax_2005",
      "body": "Thank you so much for sharing! I'm 19, my bf is 18, and he is also very supportive of me. It's nice to know other people have found help for the same disorder I have with their partners. I'm glad you're doing better!",
      "created_utc": 1745870648.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mpmrnk2",
      "author": "Antique_Ad4322",
      "body": "I’m so so proud of you!! You’re so inspiring 🩷🩷",
      "created_utc": 1745919658.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mpnf1sm",
      "author": "Historical_Spell_772",
      "body": "❤️❤️❤️❤️❤️❤️❤️",
      "created_utc": 1745930634.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mpnlcjl",
      "author": "SatisfactionSoggy724",
      "body": "So happy to hear your doing better. Thanks for sharing your story. \n\nFor me I would really love to be able to eat salad. I",
      "created_utc": 1745932849.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mpqf92j",
      "author": "pplouise",
      "body": "YOU ROCK ALL THE SOCKS IN THE UNIVERSE! SO PROUD OF YOU! I love that you acknowledge also how much help it is to have someone in your life helping you. That gives me hope that maybe it could be easier for me one day if I ever have someone in my life like that. \n\nI was just acknowledging my growth realizing I eat at least once every day and I can eat in public now. I actually prioritize eating, I am so proud of myself. \n\nThis is not an easy thing to live with. In fact it's absolutely insidious. I am so proud of you!!!!",
      "created_utc": 1745962658.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mpw38i7",
      "author": "ProteusAlpha",
      "body": "I need to save this for more detailed study, later.",
      "created_utc": 1746040429.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mpy2xah",
      "author": "Panic-King-Hard",
      "body": "Congratulations for all your hard work and the payoff!\n\nThanks for sharing your success story with us! 🩷\n\nAnd especially your effective strategies!! 🤌🏻\n\nHere’s hoping you only go up from here and give yourself the compassion and motivation you need to continue making progress if you do happen to stumble and fall♥️♥️♥️",
      "created_utc": 1746063349.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mpy3is8",
      "author": "Panic-King-Hard",
      "body": "Feel free to ignore me or PM me privately if you like, but I’m very curious how you determined it was ARFID rather than anorexia, bulimia, binge eating, or some other combination thereof\n\nWould you mind specifying?",
      "created_utc": 1746063559.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mq41uhm",
      "author": "haydesigner",
      "body": "I'm happy for you! Give your boyfriend a hi-5 from me, and tell him he's awesome.",
      "created_utc": 1746144340.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mpmz67c",
      "author": "Fit-Cauliflower-9229",
      "body": "Congratulations ! I’m so happy for you 🥹\n\nthe keys to healing ARFID is definitely;\n - 1. Taking it slow\n - 2. Eating is good for you ! I know this can sound crazy but repeating to myself « this for your good, this is for your health » helped so much!",
      "created_utc": 1745923905.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mpo15vz",
      "author": "Itscatpicstime",
      "body": "My mind is blown other ARFID folks respond well to this. \n\nWatching aesthetic food / cooking videos resulted in me *losing* some of the few safe foods I had. Tbh, watching the cooking process in general always makes things worse for me.",
      "created_utc": 1745937815.0,
      "score": 2,
      "context": [
        {
          "id": "mpku5jt",
          "author": "whoopsissathrowaway",
          "body": "DITTO ON WATCHING COOKING VIDEOS! Even for new foods, it really helped to see the cooking process and made some unfamiliar and scary foods look really appetizing",
          "created_utc": 1745887041.0
        }
      ]
    },
    {
      "id": "mpyaon2",
      "author": "None",
      "body": "Yeah no problem. So basically I’ve had anorexia and bulimia as a teenager. It is extremely different. The problem was a could not touch or eat food without being so repulsed that I ended up vomiting. I had a deep fear of throwing up. And I lost so much weight that I did NOT want to lose. Nothing about it was me needing to be thin or needing control of my life. I desperately wanted to eat all the time. My brain wouldn’t let me do it.",
      "created_utc": 1746066057.0,
      "score": 1,
      "context": [
        {
          "id": "mpy3is8",
          "author": "Panic-King-Hard",
          "body": "Feel free to ignore me or PM me privately if you like, but I’m very curious how you determined it was ARFID rather than anorexia, bulimia, binge eating, or some other combination thereof\n\nWould you mind specifying?",
          "created_utc": 1746063559.0
        }
      ]
    },
    {
      "id": "mqgqvi6",
      "author": "rrriot-kitty",
      "body": "Me, too",
      "created_utc": 1746321119.0,
      "score": 2,
      "context": [
        {
          "id": "mpku5jt",
          "author": "whoopsissathrowaway",
          "body": "DITTO ON WATCHING COOKING VIDEOS! Even for new foods, it really helped to see the cooking process and made some unfamiliar and scary foods look really appetizing",
          "created_utc": 1745887041.0
        },
        {
          "id": "mpo15vz",
          "author": "Itscatpicstime",
          "body": "My mind is blown other ARFID folks respond well to this. \n\nWatching aesthetic food / cooking videos resulted in me *losing* some of the few safe foods I had. Tbh, watching the cooking process in general always makes things worse for me.",
          "created_utc": 1745937815.0
        }
      ]
    },
    {
      "id": "mpyb8m1",
      "author": "Panic-King-Hard",
      "body": "Thank you so much for satisfying my very curious brain!!\n\nHave you looked into it to verify you’re definitely not ND??? Bc this sounds a lot like how my autistic side presents itself… \n\nNot trying to armchair diagnose! Just giving you a gentle nudge in a helpful direction in case you need a nudge to go down that rabbit role and investigate!\n\nOh and btw, the involuntary visceral response to food  you’ve described sounds VERY similar to experiences of something called “sex repulsion.” So if you’re sad no one can relate to that lived experience, try looking for ppl who are sex-repulsed! These folx are often found in online sex-repulsion, sex-aversion, demi, and ace communities. You may find y’all can relate in some surprising ways!\n\nBONUS TRIVIA FACT:\nPeople with EDs should really be automatically screened for innate neurodivergence bc there is OVERWHELMING comorbidity! I looked into it after the author briefly mentioned it in “Autism in Heels” and it checks out!!\n\n[Audible 2020- “Autism In Heels” by Jennifer Cook O’Toole AUDIO](https://www.audible.ca/pd/B085WBNRHB?source_code=ASSORAP0511160006&share_location=pdp%5D)\n\n[Nature 2025- ED’s and ND’s Research Study WEB](https://www.nature.com/articles/s41380-024-02825-w#:~:text=Eating%20disorders%20(EDs)%20commonly%20co,overlap%20among%20them%20requires%20clarification.)\n\n[Nature 2025- ED’s and ND’s Research Study PDF](https://www.nature.com/articles/s41380-024-02825-w.pdf)",
      "created_utc": 1746066254.0,
      "score": 1,
      "context": [
        {
          "id": "mpy3is8",
          "author": "Panic-King-Hard",
          "body": "Feel free to ignore me or PM me privately if you like, but I’m very curious how you determined it was ARFID rather than anorexia, bulimia, binge eating, or some other combination thereof\n\nWould you mind specifying?",
          "created_utc": 1746063559.0
        },
        {
          "id": "mpyaon2",
          "author": "None",
          "body": "Yeah no problem. So basically I’ve had anorexia and bulimia as a teenager. It is extremely different. The problem was a could not touch or eat food without being so repulsed that I ended up vomiting. I had a deep fear of throwing up. And I lost so much weight that I did NOT want to lose. Nothing about it was me needing to be thin or needing control of my life. I desperately wanted to eat all the time. My brain wouldn’t let me do it.",
          "created_utc": 1746066057.0
        }
      ]
    },
    {
      "id": "mpzpet1",
      "author": "None",
      "body": "I appreciate the perspective of it possibly being autism. I do have BPD and complex-PTSD and PTSD. They do present very similar. As I said before, most of my food issues stem from a particular trauma. I have talked to my therapist about ADHD and Autism multiple times. \n\nI’ve seen a lot of doctors, therapists, psychiatrists and neurologists. \n\nWhat happened to me was really honestly disgusting and not for the faint of heart to hear. \n\nMy problem with food was that I knew I’d be physically forced to throw it up later so I stopped eating because it made it less gross. Therefore, I developed an aversion to it all together. That’s why I tried to make it clear that my problem is trauma based and not something I was born with, so I can’t speak on people who have things they were born with. \n\nEither way, I do hope some of the things I mentioned are able to help other people heal and get better. \n\nI love your curiosity and ability to relay things in such a sweet way and want to learn! I’m just a small girl who’s been through a lot. That’s all.",
      "created_utc": 1746092282.0,
      "score": 2,
      "context": [
        {
          "id": "mpy3is8",
          "author": "Panic-King-Hard",
          "body": "Feel free to ignore me or PM me privately if you like, but I’m very curious how you determined it was ARFID rather than anorexia, bulimia, binge eating, or some other combination thereof\n\nWould you mind specifying?",
          "created_utc": 1746063559.0
        },
        {
          "id": "mpyaon2",
          "author": "None",
          "body": "Yeah no problem. So basically I’ve had anorexia and bulimia as a teenager. It is extremely different. The problem was a could not touch or eat food without being so repulsed that I ended up vomiting. I had a deep fear of throwing up. And I lost so much weight that I did NOT want to lose. Nothing about it was me needing to be thin or needing control of my life. I desperately wanted to eat all the time. My brain wouldn’t let me do it.",
          "created_utc": 1746066057.0
        },
        {
          "id": "mpyb8m1",
          "author": "Panic-King-Hard",
          "body": "Thank you so much for satisfying my very curious brain!!\n\nHave you looked into it to verify you’re definitely not ND??? Bc this sounds a lot like how my autistic side presents itself… \n\nNot trying to armchair diagnose! Just giving you a gentle nudge in a helpful direction in case you need a nudge to go down that rabbit role and investigate!\n\nOh and btw, the involuntary visceral response to food  you’ve described sounds VERY similar to experiences of something called “sex repulsion.” So if you’re sad no one can relate to that lived experience, try looking for ppl who are sex-repulsed! These folx are often found in online sex-repulsion, sex-aversion, demi, and ace communities. You may find y’all can relate in some surprising ways!\n\nBONUS TRIVIA FACT:\nPeople with EDs should really be automatically screened for innate neurodivergence bc there is OVERWHELMING comorbidity! I looked into it after the author briefly mentioned it in “Autism in Heels” and it checks out!!\n\n[Audible 2020- “Autism In Heels” by Jennifer Cook O’Toole AUDIO](https://www.audible.ca/pd/B085WBNRHB?source_code=ASSORAP0511160006&share_location=pdp%5D)\n\n[Nature 2025- ED’s and ND’s Research Study WEB](https://www.nature.com/articles/s41380-024-02825-w#:~:text=Eating%20disorders%20(EDs)%20commonly%20co,overlap%20among%20them%20requires%20clarification.)\n\n[Nature 2025- ED’s and ND’s Research Study PDF](https://www.nature.com/articles/s41380-024-02825-w.pdf)",
          "created_utc": 1746066254.0
        }
      ]
    },
    {
      "id": "mq3fndf",
      "author": "Panic-King-Hard",
      "body": "\nA few factors worth consideration:\n\n*(1) I COMPLETELY agree with you that your involuntary repulsion being a conditioned response (nurture) rather than innate response (nature) makes it far less likely to be an autistic trait!*\n\n*(2) Although technically ALL BPDers, PTSDers, etc. are ND due to neuroplasticity (nurture),…*\n\n*… like many people, I tend to use ND in reference to innate ND’s.*\n\nYou seemed to pick up on that, though, so I’m glad we’re on the same page!\n\n*(3) I’m glad you’ve previously looked into neurodivergence bc ND’s have a sensitivity gene (nature) that makes us FAR more likely to develop a TONNE of physical and mental health conditions, depending on our environment (nurture)!*\n\nThe sensitivity gene includes higher likelihoods of developing ADHD, autism, BPD and more!\n\n^ That said, I don’t consider ADHDers, autists , or my AuDHD ass “disordered” myself and I think that’s an important distinction\n\n*(4) There is MASSIVE overlap between BPD and autism.*\n\nFurthermore, being innately ND has a high comorbidity with ALL the personality disorders!***\n\n***Feel free to verify this claim bc I am not 100% sure if it was all PD’s or just Cluster B ones… but ONE of those two assertions is correct!\n\n*(5) There is also a huge systemic sexism problem in psychiatry that results in a TONNE of women being misdiagnosed with BPD when an autism diagnosis would be much more appropriate!!*\n\n- - - - -\n\nWe are kindred spirits! 🫶🏻🩷🐈‍⬛\n\nI am an ND in THE NERDIEST way possible and EMBODY TF outta the ND urge to be curious to the point of irritation 😅🤪🤣\n\nBtw, thank you for the compliments!!! You are such a sweetheart! 🩷🩷🩷\n\n- - - - -\n\nI recognize that there’s no possible way I can understand what you went through (and I never encourage trauma Olympic comparisons anyways)\n\nThat said, I think it’s important to recognize that I didn’t experience what you did and I personally don’t qualify for a BPD dx\n\n^ I’m also pretty confident about that bc I PESTERED TF outta my mental health professionals when I was fixated on quiet BPD specifically!! 🤪😅\n\nTHAT said, I can definitely still relate to your experiences on SOME level and I feel for you 🫂♥️ \n\nI too have endured a fuck tonne of abuse and have big attachment trauma (which is the core essence of BPD) as part of my CPTSD and PTSD\n\n*I’m SO SORRY you had to endure all that and I’m SO PROUD of you for sticking around and working on yourself to build the life you want and deserve ♥️♥️♥️*\n\nPS If you ever feel alone and are looking for someone to relate to with in regards to your “learned ARFID” ED, you might enjoy this book:\n\n[“I’m Glad My Mom Died” by Jennette McCurdy AUDIO](https://www.audible.ca/pd/B09VJHT9ZR?source_code=ASSORAP0511160006&share_location=pdp)",
      "created_utc": 1746136806.0,
      "score": 1,
      "context": [
        {
          "id": "mpy3is8",
          "author": "Panic-King-Hard",
          "body": "Feel free to ignore me or PM me privately if you like, but I’m very curious how you determined it was ARFID rather than anorexia, bulimia, binge eating, or some other combination thereof\n\nWould you mind specifying?",
          "created_utc": 1746063559.0
        },
        {
          "id": "mpyaon2",
          "author": "None",
          "body": "Yeah no problem. So basically I’ve had anorexia and bulimia as a teenager. It is extremely different. The problem was a could not touch or eat food without being so repulsed that I ended up vomiting. I had a deep fear of throwing up. And I lost so much weight that I did NOT want to lose. Nothing about it was me needing to be thin or needing control of my life. I desperately wanted to eat all the time. My brain wouldn’t let me do it.",
          "created_utc": 1746066057.0
        },
        {
          "id": "mpyb8m1",
          "author": "Panic-King-Hard",
          "body": "Thank you so much for satisfying my very curious brain!!\n\nHave you looked into it to verify you’re definitely not ND??? Bc this sounds a lot like how my autistic side presents itself… \n\nNot trying to armchair diagnose! Just giving you a gentle nudge in a helpful direction in case you need a nudge to go down that rabbit role and investigate!\n\nOh and btw, the involuntary visceral response to food  you’ve described sounds VERY similar to experiences of something called “sex repulsion.” So if you’re sad no one can relate to that lived experience, try looking for ppl who are sex-repulsed! These folx are often found in online sex-repulsion, sex-aversion, demi, and ace communities. You may find y’all can relate in some surprising ways!\n\nBONUS TRIVIA FACT:\nPeople with EDs should really be automatically screened for innate neurodivergence bc there is OVERWHELMING comorbidity! I looked into it after the author briefly mentioned it in “Autism in Heels” and it checks out!!\n\n[Audible 2020- “Autism In Heels” by Jennifer Cook O’Toole AUDIO](https://www.audible.ca/pd/B085WBNRHB?source_code=ASSORAP0511160006&share_location=pdp%5D)\n\n[Nature 2025- ED’s and ND’s Research Study WEB](https://www.nature.com/articles/s41380-024-02825-w#:~:text=Eating%20disorders%20(EDs)%20commonly%20co,overlap%20among%20them%20requires%20clarification.)\n\n[Nature 2025- ED’s and ND’s Research Study PDF](https://www.nature.com/articles/s41380-024-02825-w.pdf)",
          "created_utc": 1746066254.0
        },
        {
          "id": "mpzpet1",
          "author": "None",
          "body": "I appreciate the perspective of it possibly being autism. I do have BPD and complex-PTSD and PTSD. They do present very similar. As I said before, most of my food issues stem from a particular trauma. I have talked to my therapist about ADHD and Autism multiple times. \n\nI’ve seen a lot of doctors, therapists, psychiatrists and neurologists. \n\nWhat happened to me was really honestly disgusting and not for the faint of heart to hear. \n\nMy problem with food was that I knew I’d be physically forced to throw it up later so I stopped eating because it made it less gross. Therefore, I developed an aversion to it all together. That’s why I tried to make it clear that my problem is trauma based and not something I was born with, so I can’t speak on people who have things they were born with. \n\nEither way, I do hope some of the things I mentioned are able to help other people heal and get better. \n\nI love your curiosity and ability to relay things in such a sweet way and want to learn! I’m just a small girl who’s been through a lot. That’s all.",
          "created_utc": 1746092282.0
        }
      ]
    }
  ]
}