{
  "id": "1keysgh",
  "subreddit": "ARFID",
  "author": "dhsobfksk",
  "created_utc": 1746405079.0,
  "title": "So Tired of this \"Picky Eaters are evil\" bs",
  "selftext": "I'm so tired of seeing everywhere all of these sentiments that picky eaters are selfish and childish and intentionally make things harder for people.\n\nNo, Debra, I am not intentionally making you feel bad by not eating your food, I am just terrified of eating it.\n\nIf I try to force myself to eat something that triggers me, I get nauseous and have a panic attack, but sure, it's just \"mind over matter\" and I need to \"get over myself and start being an adult\"\n\nI hate people acting like it's a choice. It's not. It's deeply linked to so many different parts of my childhood and life. \n\nIt's also just humiliating. To sit there and be on the verge of tears because the restaurant someone picked isn't a safe option for me, and there's nothing I can eat on the menu. To receive a dish that has ingredients they didn't list on the menu, and to have to sit there picking them out.\n\nWhy on earth would I choose that?",
  "url": "https://www.reddit.com/r/ARFID/comments/1keysgh/so_tired_of_this_picky_eaters_are_evil_bs/",
  "score": 142,
  "num_comments": 9,
  "comments": [
    {
      "id": "mqn1nh0",
      "author": "NEKORANDOMDOTCOM",
      "body": "I definitely know how that feels.\n\nI love restaurants with expansive menus. We ate at a place called Tacozzini that has almost anything you could think of outside of Asian dishes\n\nMy wife's favorite steakhouse doesn't have fries. I just imagine the owner flipping me off knowing that.",
      "created_utc": 1746410601.0,
      "score": 21,
      "context": []
    },
    {
      "id": "mqpxydr",
      "author": "follow_illumination",
      "body": "People who attack others for being \"picky eaters\" (ARFID or no ARFID) often do so because they want to see themselves as somehow superior for being more adventurous with food. I've noticed especially on travel subs, the sentiment is rife, and it's astounding the number of people who claim there's no point in even going to a foreign country if you're not interested in eating the local cuisine. How about the country's history, its nature, architecture, museums, art, and cultural experiences that don't revolve around food?\n\nThe accusations of selfishness and intentionally making things harder for others are often levelled at vegans too, and even occasionally people with medical dietary restrictions, so really it's just that some people are a-holes who lack empathy and are too self-absorbed to tolerate small inconveniences for the sake of others.",
      "created_utc": 1746458400.0,
      "score": 21,
      "context": []
    },
    {
      "id": "mqog9y2",
      "author": "Angelangepange",
      "body": "Yes, I hate that attitude so so much.    \nPeople really villanise anything that gives them any minor inconvenience.    \nLike they act as if we are ruining their day when this kind of thing happens when in reality nothing is happening to them and we are the ones who stay hungry.",
      "created_utc": 1746436929.0,
      "score": 16,
      "context": []
    },
    {
      "id": "mqxp8us",
      "author": "saltil",
      "body": "Them same people are shocked when you try the food and gag it up again asif you didn't just explain in detail to them their food isn't the issue we are just extremely sensitive to it.",
      "created_utc": 1746558715.0,
      "score": 7,
      "context": []
    },
    {
      "id": "mr4s5w5",
      "author": "StevieJupiter",
      "body": "you are entirely valid in your feelings. ARFID often comes with neurodiversity, and with that it feels like people often chose to misunderstand us and ignore the words that come out of our mouths directly. you're doing good and don't let people who chose to misunderstand your words bring you down.",
      "created_utc": 1746651037.0,
      "score": 6,
      "context": []
    },
    {
      "id": "mrpjvja",
      "author": "angel_of_satan",
      "body": "Also i hate that when I bring this up, i get hit with \"well not you\" \"i meant people who can help it but-\" no. They're inherently biased. Most people who are \"picky\" either have some kind of diagnosis or are neurodivergent. They don't like accommodating people and their inherently ingrained ableism is showing. The entire \"conversation\" around picky eaters as if it's immoral somehow to have strong preferences about food (OBVIOUSLY outside of being an asshole about it in certain situations) is just blatant ableism at some point. \n\nSo yeah I'm right there with you, the whole \"conversation\" about how people are inconvenienced or annoyed by picky eaters is ridiculous. They claim we are the selfish ones when THEYRE the ones making what WE eat about them. Again, the whole \"no no not you, you have a condition\" thing is ridiculous. If i didnt tell them that I had ARFID they would still be judging me hard. It's only \"okay\" when they SAY it's okay for us to be different. When they give us permission because we have a \"reason\". How about just stop being judgmental and let people eat??\n\nEdit: wording/spelling",
      "created_utc": 1746944025.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mrq0luo",
      "author": "Reidthedumbass",
      "body": "I get so much anxiety eating out with my new people, I always use the \"ate at home\" excuse and that just makes me look like an inconsiderate dick. The other day my friend offhandedly told me \" I need you to expand your palette so we can travel and eat all the local food\" and it reminded me that people really see picky eating as a choice and not a terrible damn curse. I would do anything to be able to confidently go out to any spot and buy something delicious.",
      "created_utc": 1746954403.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mrzr8j7",
      "author": "Issababy22",
      "body": "I have not heard this going around but I definitely highly disagree with that narrative like I’m not crying at night wishing to be normal for no reason Debraaaa😭😭",
      "created_utc": 1747089116.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mqxq2wd",
      "author": "saltil",
      "body": "That's a really stupid thing to say to someone who's already struggling, it's crazy they even care it's our problem not theirs they have no reason to be so upset that we struggle to eat and the reason I love the idea of travel is I hope one day I see/smell something that makes me think I could consume it, preferably something healthy but either way expanding the mind can only benefit us.",
      "created_utc": 1746558959.0,
      "score": 5,
      "context": [
        {
          "id": "mqpxydr",
          "author": "follow_illumination",
          "body": "People who attack others for being \"picky eaters\" (ARFID or no ARFID) often do so because they want to see themselves as somehow superior for being more adventurous with food. I've noticed especially on travel subs, the sentiment is rife, and it's astounding the number of people who claim there's no point in even going to a foreign country if you're not interested in eating the local cuisine. How about the country's history, its nature, architecture, museums, art, and cultural experiences that don't revolve around food?\n\nThe accusations of selfishness and intentionally making things harder for others are often levelled at vegans too, and even occasionally people with medical dietary restrictions, so really it's just that some people are a-holes who lack empathy and are too self-absorbed to tolerate small inconveniences for the sake of others.",
          "created_utc": 1746458400.0
        }
      ]
    }
  ]
}