{
  "id": "1km0lg9",
  "subreddit": "ARFID",
  "author": "eggsoda23",
  "created_utc": 1747178557.0,
  "title": "Family still doesn't get I'm NOT CHOOSING to be like this",
  "selftext": "The other day my family was joking around about my eating habits and comparing it to meals that toddlers eat. It actually made me feel so awful. Like do you actually think I'm choosing to eat like this??? Do you think I chose to sit at that table for 40 goddamn minutes pushing my food around on the plate because I couldn't actually bring myself to eat it because of its texture?? HELL NO I JUST WANT TO BE ABLE TO EAT NORMALLY. \n\nI'm not choosing to be difficult. I really, genuinely hate being \"picky\" (in quotes, because they still seem to believe it's picky eating). I hate feeling childish and convincing myself I just never grew out of the toddler picky eating phase. But every time they seem to think I'm just choosing not to eat it because I'm picky and want to go for the unhealthy option like chips or cookies rather than the healthy options. \n\nI've tried to explain that I only go for the food like that because its texture is consistent. Foods that are crunchy like chips or cookies are safe for me. But even after explaining this it still doesn't seem to stick. I love my family, but this has just been driving me insane for the longest time.\n",
  "url": "https://www.reddit.com/r/ARFID/comments/1km0lg9/family_still_doesnt_get_im_not_choosing_to_be/",
  "score": 105,
  "num_comments": 12,
  "comments": [
    {
      "id": "ms6n193",
      "author": "RefrigeratorWeird872",
      "body": "I completely get this. I got lucky with my mom, she has seen me cry from trying to eat something. Now there's very few questions if I ask her to take a bite of something before I can eat. (and the questions are usually, \"do you not want this?\" or \"is it the wrong flavor?\") But my dad is a completely different story. He thinks I'm choosing to be \"Difficult\". There are foods that I haven't eaten in over 10 years and every time they ate it he made at least one comment. You'd think making a comment at least once every 3 months for 10 years would make him remember that I don't eat that, but nope. \nSurrounding myself with people that get it has really helped. I worry less about contamination (one of my food issues) and I worry less about judgment. \nBeing on here and seeing other people continue to live life even with limited food options has also helped. \nYou aren't difficult, you aren't picky, and you aren't alone",
      "created_utc": 1747180592.0,
      "score": 28,
      "context": []
    },
    {
      "id": "ms6nwta",
      "author": "floppicus",
      "body": "I know right… this shit has affected my life in sooo many areas. Everything would be easier if I didn’t have it. People think it’s somehow a choice, like we wanted this. It’s not fun, we’re treated like shit by others constantly, our health is fucked, and we miss out on so many experiences. I’m sorry your family is so close minded about this OP. It took my mum 15 years to take me seriously once she saw me crying over food I couldn’t eat. I hope you find someone who understands you",
      "created_utc": 1747180896.0,
      "score": 22,
      "context": []
    },
    {
      "id": "ms7dkp9",
      "author": "dioor",
      "body": "Tell them your issues with food stem from a legitimate, recognized anxiety condition (that you’re managing with medical professionals, if that’s the case), and their antagonizing you is probably the top factor impeding your progress.\n\nJust look them straight in the eye and say it exactly like that, point blank, without any emotion. Don’t try to explain it to them beyond that. They are being disrespectful, and you don’t deserve that disrespect.",
      "created_utc": 1747190019.0,
      "score": 9,
      "context": []
    },
    {
      "id": "ms90n5b",
      "author": "DreamDroplet",
      "body": "My father abused me my whole childhood because he thinks I don't eat just to hurt him somehow. He's a gourmet chef who trained in Paris and when I don't like his food... he just explodes. We sat him down with a doctor who explained it's an eating disorder and yet he will still go to his grave thinking it's ALL just to spite him 😢",
      "created_utc": 1747220899.0,
      "score": 10,
      "context": []
    },
    {
      "id": "ms72lx1",
      "author": "WeirdUnion5605",
      "body": "Honestly, same, I could have written this. It's hurting my body real bad, I don't even know if there's recovering from what's happening, but people still think I'm just picky.",
      "created_utc": 1747186141.0,
      "score": 7,
      "context": []
    },
    {
      "id": "msgv0go",
      "author": "teddy0967",
      "body": "It’s an eating disorder. Just like anorexia, and etc are all eating disorders . \n\nMy family is the same way. “Just eat it” “it’s just ____”\n\nIt’s so so difficult , I understand . I’m so sorry",
      "created_utc": 1747324490.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mszdwhi",
      "author": "RealityTVfan28",
      "body": "Please tell them a 68 y/o grandma on Reddit said this:\n\nAs a child I was taunted, berated, punished, teased and even spanked for not being able to eat many foods. You think I wanted to only be able to eat baby food and peanut butter and crackers? Like who would pick that if given a choice?\n\nIn my teens I had my work arounds which allowed me to form a good circle of friends. As an adult I met and married a man who didn’t give a damn what I ate or didn’t eat. With this—I thrived. I wasn’t being tormented or judged. I tried many, many new foods. I had 3 kids. None have ARFID. \n\nTell them too that I still have it. With love and support I was able to really expand my food choices and saved my health. To be honest I’ve never once eaten meat at all. I am not on any medications for any chronic conditions. I don’t know many 68 year olds not on any medicine. \n\nI have ARFID. And I’m ok with that. They should be grateful to know what it is and support you in trying to manage it. Take care hun and hang in there.",
      "created_utc": 1747588218.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mt8j0aq",
      "author": "reallynicegirl57",
      "body": "my favorite thing my therapist has said was that \"if it was really that easy, you would have done it by now\"\nIt hurts to have outside input on something so personal i used to struggle with this a lot, but you cant control your environment, just how you respond\nI hope it gets easier for you",
      "created_utc": 1747710863.0,
      "score": 2,
      "context": []
    },
    {
      "id": "msu954d",
      "author": "Specific-Deer7287",
      "body": "There is a sad reality, some people no matter how well u explain to them just won't get it. Its a Closed mind and rigit thinking. And its very bad when such peoples are yr family. In such cases u go and find who will understand and support u. Accept and grief the fact yr family is not on board. I am sorry.\nI didn't see a reason to explain to someone who doesn't want to know",
      "created_utc": 1747509914.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mug75tm",
      "author": "UAreNowReadingThis",
      "body": "This really hits home. It’s frustrating when they think it’s a choice or an act.",
      "created_utc": 1748312964.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ms9d6k9",
      "author": "Direct-Situation8927",
      "body": "My dad literally saw me crying and vomiting and said “don’t make a scene” at the kitchen table",
      "created_utc": 1747226108.0,
      "score": 5,
      "context": [
        {
          "id": "ms6nwta",
          "author": "floppicus",
          "body": "I know right… this shit has affected my life in sooo many areas. Everything would be easier if I didn’t have it. People think it’s somehow a choice, like we wanted this. It’s not fun, we’re treated like shit by others constantly, our health is fucked, and we miss out on so many experiences. I’m sorry your family is so close minded about this OP. It took my mum 15 years to take me seriously once she saw me crying over food I couldn’t eat. I hope you find someone who understands you",
          "created_utc": 1747180896.0
        }
      ]
    },
    {
      "id": "msc76zm",
      "author": "floppicus",
      "body": "so sorry :((( some people have no desire to try a new perspective",
      "created_utc": 1747256602.0,
      "score": 3,
      "context": [
        {
          "id": "ms6nwta",
          "author": "floppicus",
          "body": "I know right… this shit has affected my life in sooo many areas. Everything would be easier if I didn’t have it. People think it’s somehow a choice, like we wanted this. It’s not fun, we’re treated like shit by others constantly, our health is fucked, and we miss out on so many experiences. I’m sorry your family is so close minded about this OP. It took my mum 15 years to take me seriously once she saw me crying over food I couldn’t eat. I hope you find someone who understands you",
          "created_utc": 1747180896.0
        },
        {
          "id": "ms9d6k9",
          "author": "Direct-Situation8927",
          "body": "My dad literally saw me crying and vomiting and said “don’t make a scene” at the kitchen table",
          "created_utc": 1747226108.0
        }
      ]
    }
  ]
}