{
  "id": "1km39pr",
  "subreddit": "ARFID",
  "author": "ColdKaleidoscope743",
  "created_utc": 1747186450.0,
  "title": "“you can’t even taste the __”",
  "selftext": "don’t you guys find it funny when someone’s talking about a dish and claim you can’t even taste something aversive in the dish. like i just watched a video of someone cook eggs with cottage cheese and claimed you can’t even tell there’s cottage cheese in it. like pls i promise you this tongue will know ",
  "url": "https://www.reddit.com/r/ARFID/comments/1km39pr/you_cant_even_taste_the/",
  "score": 284,
  "num_comments": 85,
  "comments": [
    {
      "id": "ms77yte",
      "author": "StrawbraryLiberry",
      "body": "Why would they add something I'm not supposed to taste 🧐 \n\nThey also underestimate my tasting power.",
      "created_utc": 1747187986.0,
      "score": 164,
      "context": []
    },
    {
      "id": "ms7jhha",
      "author": "_warped_art_",
      "body": "My mom trying to convince me that lettuce doesn't taste like anything, yes it does it tastes like lettuce!",
      "created_utc": 1747192304.0,
      "score": 119,
      "context": []
    },
    {
      "id": "ms7ml9o",
      "author": "ProteusAlpha",
      "body": "My entire life, I've been told you can't taste onions when they're cooked.  I've never missed a one.",
      "created_utc": 1747193545.0,
      "score": 57,
      "context": []
    },
    {
      "id": "ms7x6jo",
      "author": "S-quinn7292",
      "body": "“You can’t even taste the…”\n\n“no YOU can’t taste it, that doesn’t mean I won’t taste it”\n\nI’ve had that back and forth more than once",
      "created_utc": 1747198158.0,
      "score": 45,
      "context": []
    },
    {
      "id": "ms76th8",
      "author": "Similar_Guidance2339",
      "body": "FR if there’s a single speck of pepper on a dish I WILL KNOW",
      "created_utc": 1747187585.0,
      "score": 31,
      "context": []
    },
    {
      "id": "ms7xtat",
      "author": "betelguesez",
      "body": "People always say this to me about bananas. No I can absolutely taste the banana!! Stop trying to get me to try this!!!",
      "created_utc": 1747198464.0,
      "score": 27,
      "context": []
    },
    {
      "id": "ms8clbg",
      "author": "puppyhugtime",
      "body": "Hate this. It’s alcohol & nuts for me. Are there really people who can’t tell if there’s alcohol in a drink?",
      "created_utc": 1747206667.0,
      "score": 25,
      "context": []
    },
    {
      "id": "ms9au37",
      "author": "r0ckchalk",
      "body": "I have a theory that a lot of us with ARFID are supertasters and have a much more sensitive palate than those without.",
      "created_utc": 1747225213.0,
      "score": 24,
      "context": []
    },
    {
      "id": "ms8fwb9",
      "author": "offmyfuxkingmind",
      "body": "store bought sandwiches with pickles. yes you took them out but my sandwich still tastes like pickles, I cannot taste anything but pickles. yikes. ",
      "created_utc": 1747208730.0,
      "score": 11,
      "context": []
    },
    {
      "id": "ms8fd08",
      "author": "Arvach",
      "body": "oooh I remember when my grandma brought me a cucumbers with natural yoghurt after I told her I prefer it with sour cream because I don't like yoghurt taste. Of course she was claiming I won't feel any difference.\n\nshe didn't tell me, yet after first spoon I just put the whole plate back in the kitchen where it came from. Not only I did not ask for it, it was ugly in taste. Her face looked like shocked pikachu for the rest of the day. And later she was shocked when I didn't want to eat anything she did. She wasn't honest with me what is in the food and I am too old for games like that. It's like a one way ticket to lost trust permamently.",
      "created_utc": 1747208392.0,
      "score": 8,
      "context": []
    },
    {
      "id": "ms7dlhd",
      "author": "crashnebulaa_a",
      "body": "got mac n cheese recently with chives sprinkled on it as a garnish and that’s ALL I could taste",
      "created_utc": 1747190026.0,
      "score": 17,
      "context": []
    },
    {
      "id": "ms865ap",
      "author": "My4thaccountfornow",
      "body": "\"You can't even taste the coffee\"\nYes, yes I can\nand if you're gonna shove it under 20 layers of vanilla and milk might as well just let me drink vanilla and milk. (realistically, I just want hot choco or chocolate milkshake)",
      "created_utc": 1747202880.0,
      "score": 8,
      "context": []
    },
    {
      "id": "ms8i3n6",
      "author": "Fit-Cauliflower-9229",
      "body": "I can feel the texture :(",
      "created_utc": 1747210112.0,
      "score": 7,
      "context": []
    },
    {
      "id": "ms8n5og",
      "author": "MultiFandomShipperr",
      "body": "If I can't taste something, I can smell it. If I can't smell it, just knowing it's in there is bad enough",
      "created_utc": 1747213339.0,
      "score": 8,
      "context": []
    },
    {
      "id": "ms8bdm5",
      "author": "Silver-Ware",
      "body": "The thing is, even if I might not taste it, I know it’s in there. I ain’t risking that",
      "created_utc": 1747205936.0,
      "score": 15,
      "context": []
    },
    {
      "id": "msc9cv6",
      "author": "Lost_My_Brilliance",
      "body": "“you can’t even taste the mushrooms/onions, and they’re so small you’ll barely feel them, just eat it” “then why did you put the onions in there?” “oh, for the flavour” MOTHER WHAT? I BEG YOUR FINEST PARDON?",
      "created_utc": 1747257256.0,
      "score": 7,
      "context": []
    },
    {
      "id": "ms7zdlr",
      "author": "AetherDrew43",
      "body": "Now that you mention it, I never realized how fake that statement was.\n\nThis tongue is way too powerful against my will.",
      "created_utc": 1747199238.0,
      "score": 4,
      "context": []
    },
    {
      "id": "msbjihd",
      "author": "GuyOwasca",
      "body": "I will literally fucking END the next person who tells me that American cheese is the same as cheddar. I will die on this hill.\n\nAmerican cheese is plasticized food simulacra. I’d rather eat someone else’s vomit than peel that oily melted rubber off the roof of my mouth.",
      "created_utc": 1747249525.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ms95548",
      "author": "ResponsibleTune6569",
      "body": "My main food is chips, I can always tell when someone has cooked something else in the same fat, family always thought i was exaggerating",
      "created_utc": 1747222907.0,
      "score": 5,
      "context": []
    },
    {
      "id": "msatiu3",
      "author": "Aromatic-Elephant110",
      "body": "I can taste the dirt the vegetables grow in after they've been washed and roasted. Some people have not very sensitive taste buds and that's fine for them but it shouldn't be hard to believe that there are people who DO have sensitive taste buds.",
      "created_utc": 1747242113.0,
      "score": 7,
      "context": []
    },
    {
      "id": "msb7iws",
      "author": "littleepatina",
      "body": "mayonnaise 🤢",
      "created_utc": 1747246048.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ms8elr2",
      "author": "BringMeYourBullets",
      "body": "I think they might be of the population that has fewer and/or less sensitive taste buds.",
      "created_utc": 1747207911.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ms9ymp2",
      "author": "PINKSPlDER",
      "body": "If anything has cheese in it I can tell immediately and I hate it",
      "created_utc": 1747233197.0,
      "score": 3,
      "context": []
    },
    {
      "id": "msar8ox",
      "author": "shelllllo",
      "body": "Mushrooms!! I’ve despised and refused mushrooms since I can remember. I wa forced to sit at the table until I ate them, and spent a few nights sleeping at the table until morning.\n\n\nI’ve thrown up just from the smell of cooked mushrooms before, I gag thinking about the texture. My entire family loves them, all different kinds and uses mushroom soup mix in different things they make. \n\n\nSince I was about 4 years old, my brother has tried to convince me that I won’t notice them, that they’re so good and I need to try them. \n\n\nHe will try to sneak them in things and like put them under the cheese on pizza he makes and things like that. They are horrible and yes yes I can taste and FEEL them on my tongue!",
      "created_utc": 1747241471.0,
      "score": 3,
      "context": []
    },
    {
      "id": "msavy8k",
      "author": "HookerFace81",
      "body": "Everyone says this to me about minced onions. I KNOW THEY’RE IN THERE STOP LYING! I can smell them and my palate will know. I hate them I don’t care how small they are. If you put them in a dish I’m not touching said dish, gtfo with your nonsense.",
      "created_utc": 1747242808.0,
      "score": 3,
      "context": []
    },
    {
      "id": "msbma7e",
      "author": "MysticCollective",
      "body": "Unfortunately, I am guilty of saying this but it's because it's been true in some cases. So I think it's important to remember people don't say this to purposely annoy you. It's because they genuinely feel it is true. Now if you explain to them that you can taste the food item and they still insist you can't taste it. That's a jerk at that point. Kick that person out of your life. You don't need gaslighting in your life.",
      "created_utc": 1747250339.0,
      "score": 3,
      "context": []
    },
    {
      "id": "msd0ba6",
      "author": "Rinny-ThePooh",
      "body": "My mom filled a bottle of water with tap water and I spit it out in less then 3 seconds 🤣",
      "created_utc": 1747266155.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ms8dm9b",
      "author": "rosie_purple13",
      "body": "I get it. That’s usually a good thing for me because that means I can eat it without wanting to throw up and that’s a good feeling and if it’s healthy and I enjoy it that’s another win.",
      "created_utc": 1747207296.0,
      "score": 2,
      "context": []
    },
    {
      "id": "msbnh7m",
      "author": "krankity-krab",
      "body": "MUSHROOMS! even when my MIL blended them up for me and didn’t tell me they were in that dish, i could tell the first bite and spit it into my napkin.. i can’t do mushrooms at all, i hate the texture, i hate the taste. its just so gross to me.",
      "created_utc": 1747250690.0,
      "score": 2,
      "context": []
    },
    {
      "id": "msg8kyf",
      "author": "huntresswizard_",
      "body": "I don’t like peanuts at all but I’m not allergic. My cousin tried to convince me you can’t taste the peanuts in snickers 😂  straight up LIES.",
      "created_utc": 1747317821.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mt70fr7",
      "author": "This_Gear_465",
      "body": "As a kid I wouldn’t take medicine and doctors told my mom put it in milkshakes and smoothies I’d never know… one sip and I’d know as soon as it hit my tongue lol.",
      "created_utc": 1747690939.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ms9p3x4",
      "author": "corn_breath",
      "body": "FWIW, my ARFID kid THINKS this way, but when we get it together and do blind taste tests with subtly different ingredients to things like his Mac & Cheese or nuggets, he will just as often prefer the \"misprepared\" version. Then, when we tell him which was prepared in the familiar way, he will refuse to eat the differently prepared one even though he preferred it moments earlier. \n\nFor him at least, it seems to me that his ARFID is deeply linked to the feeling that his life is out of control, likely as a consequence of being a child of divorce and having a workaholic tough it out dad and a mom with medical issues and a tendency to get overstimulated and retreat in the face of typical kid chaos (I'm the stepdad). \n\nI also think that as a kid, there's a fear of \"give an inch, take a mile\". If he accepts for instance that he likes mac and cheese prepared in various ways from various brands, that invites discussions about other ways he might be surprisingly flexible, which leads ot discussions about trying other new foods. This issue crops up with most exposures that succeed. He will happily try and sometimes enjoy a food and eat it a few times, but when it comes to normalizing it, he shuts down because I think there's an anticipation that comes with that of being asked to try something new, which his ARFID brain tells him will be repulsive even though he has no idea.",
      "created_utc": 1747230251.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mscf53t",
      "author": "TuttiFruttiuwu",
      "body": "This has happened to me so many times it's exhausting. I don't care what YOU think, there's no way I'm trying that 😒",
      "created_utc": 1747259027.0,
      "score": 1,
      "context": []
    },
    {
      "id": "msd3l66",
      "author": "luminousrobot",
      "body": "“You can’t even taste the alcohol” said every person trying to get me to drink a mixed drink ever.",
      "created_utc": 1747267262.0,
      "score": 1,
      "context": []
    },
    {
      "id": "msdu03r",
      "author": "NoBalance1897",
      "body": "my mom would always say this to me. let’s just say i always tasted what she convinced me i wasn’t going to taste",
      "created_utc": 1747276543.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mshd3h2",
      "author": "FlemFatale",
      "body": "Excuse me, I can tell which shop things come from in blind taste tests I'll have you know...",
      "created_utc": 1747329769.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mshebay",
      "author": "kaki024",
      "body": "I stopped questioning my sister when she knew my mom put white pepper in Mac n cheese.",
      "created_utc": 1747330112.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mst8duj",
      "author": "Noodles_uses_reddit",
      "body": "Haha, that happens a lot. One time my mom cooked me dinner and she put a bit too much oat flour in the biscuits— half wheat flour half oat flour mixture, and I immediately flagged the extra oat flour. She said I was crazy but I swear that she used extra. ",
      "created_utc": 1747497912.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mt479e3",
      "author": "sickkid29",
      "body": "Most of the time you won't be able to know ",
      "created_utc": 1747660334.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mta947o",
      "author": "Gioia_mia",
      "body": "It's the anchovies. They always say you'll never know they're in there. You just told me they are. I'm not eating it. ",
      "created_utc": 1747743936.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mta9dsu",
      "author": "Gioia_mia",
      "body": "Nuts in things. Especially walnuts. I will literally gag if a meaty, greasy walnut finds its way into my food. Like who decided walnuts should go in brownies?",
      "created_utc": 1747744045.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ms8nmxv",
      "author": "axw3555",
      "body": "There’s sometimes an element of texture.\n\nIt’s when they go “you’d never know it was there” - they’re either wrong (ie it screws the dish by not including) or it’s pointless to add.",
      "created_utc": 1747213645.0,
      "score": 27,
      "context": [
        {
          "id": "ms77yte",
          "author": "StrawbraryLiberry",
          "body": "Why would they add something I'm not supposed to taste 🧐 \n\nThey also underestimate my tasting power.",
          "created_utc": 1747187986.0
        }
      ]
    },
    {
      "id": "ms8cn2z",
      "author": "luvmffy",
      "body": "we are literally pro tasters i think they’re slow",
      "created_utc": 1747206697.0,
      "score": 37,
      "context": [
        {
          "id": "ms77yte",
          "author": "StrawbraryLiberry",
          "body": "Why would they add something I'm not supposed to taste 🧐 \n\nThey also underestimate my tasting power.",
          "created_utc": 1747187986.0
        }
      ]
    },
    {
      "id": "mt18bxg",
      "author": "PsychoScooby",
      "body": "Preach. I’ve never understood this.",
      "created_utc": 1747609874.0,
      "score": 3,
      "context": [
        {
          "id": "ms77yte",
          "author": "StrawbraryLiberry",
          "body": "Why would they add something I'm not supposed to taste 🧐 \n\nThey also underestimate my tasting power.",
          "created_utc": 1747187986.0
        }
      ]
    },
    {
      "id": "mt2pcsz",
      "author": "peachygatorade",
      "body": "Cause it's healthy or some shit",
      "created_utc": 1747631506.0,
      "score": 3,
      "context": [
        {
          "id": "ms77yte",
          "author": "StrawbraryLiberry",
          "body": "Why would they add something I'm not supposed to taste 🧐 \n\nThey also underestimate my tasting power.",
          "created_utc": 1747187986.0
        }
      ]
    },
    {
      "id": "ms7lvix",
      "author": "crashnebulaa_a",
      "body": "lettuce has a STRONG taste to me",
      "created_utc": 1747193255.0,
      "score": 54,
      "context": [
        {
          "id": "ms7jhha",
          "author": "_warped_art_",
          "body": "My mom trying to convince me that lettuce doesn't taste like anything, yes it does it tastes like lettuce!",
          "created_utc": 1747192304.0
        }
      ]
    },
    {
      "id": "ms7lsn7",
      "author": "ColdKaleidoscope743",
      "body": "bleh i especially hate white crunchy parts of lettuce",
      "created_utc": 1747193224.0,
      "score": 21,
      "context": [
        {
          "id": "ms7jhha",
          "author": "_warped_art_",
          "body": "My mom trying to convince me that lettuce doesn't taste like anything, yes it does it tastes like lettuce!",
          "created_utc": 1747192304.0
        }
      ]
    },
    {
      "id": "ms8uc93",
      "author": "QuickMoonTrip",
      "body": "Oh my gosh, and if it’s got ANY wilt? That shit permeates everything",
      "created_utc": 1747217689.0,
      "score": 20,
      "context": [
        {
          "id": "ms7jhha",
          "author": "_warped_art_",
          "body": "My mom trying to convince me that lettuce doesn't taste like anything, yes it does it tastes like lettuce!",
          "created_utc": 1747192304.0
        }
      ]
    },
    {
      "id": "msdk12h",
      "author": "BMH_FL",
      "body": "Same! People think I’m crazy, but I can taste if there’s a tiny piece of lettuce anywhere in my food. Mexican style places are the biggest offenders of getting bits of other food in my taco or burrito when making it, so I learned to always open it up to check before I bite.\n\nAnd onions! How tf are people so overly confident that they can hide onions in food. Do others really not feel the texture?  It’s baffling to me lol",
      "created_utc": 1747272952.0,
      "score": 9,
      "context": [
        {
          "id": "ms7jhha",
          "author": "_warped_art_",
          "body": "My mom trying to convince me that lettuce doesn't taste like anything, yes it does it tastes like lettuce!",
          "created_utc": 1747192304.0
        }
      ]
    },
    {
      "id": "ms8ck3x",
      "author": "luvmffy",
      "body": "idk why lettuce has like a sour taste to it, its not that prominent but i can still notice it",
      "created_utc": 1747206647.0,
      "score": 8,
      "context": [
        {
          "id": "ms7jhha",
          "author": "_warped_art_",
          "body": "My mom trying to convince me that lettuce doesn't taste like anything, yes it does it tastes like lettuce!",
          "created_utc": 1747192304.0
        }
      ]
    },
    {
      "id": "ms8eq5m",
      "author": "adnow-r",
      "body": "Literally my life's story, even if I suffer eating through it and it's mild, i still get oniony aftertaste for the next day or two. So yes Janet, I will in fact taste your betrayal for a very long time",
      "created_utc": 1747207988.0,
      "score": 14,
      "context": [
        {
          "id": "ms7ml9o",
          "author": "ProteusAlpha",
          "body": "My entire life, I've been told you can't taste onions when they're cooked.  I've never missed a one.",
          "created_utc": 1747193545.0
        }
      ]
    },
    {
      "id": "ms90w1e",
      "author": "MoodOk8885",
      "body": "Wait then why do they even include it in their cooking",
      "created_utc": 1747221014.0,
      "score": 9,
      "context": [
        {
          "id": "ms7ml9o",
          "author": "ProteusAlpha",
          "body": "My entire life, I've been told you can't taste onions when they're cooked.  I've never missed a one.",
          "created_utc": 1747193545.0
        }
      ]
    },
    {
      "id": "msak45e",
      "author": "InsideOusside",
      "body": "same here, my dad puts onions in most things and goes “you can’t taste it!” but i most certainly can mr. dad sir.",
      "created_utc": 1747239413.0,
      "score": 6,
      "context": [
        {
          "id": "ms7ml9o",
          "author": "ProteusAlpha",
          "body": "My entire life, I've been told you can't taste onions when they're cooked.  I've never missed a one.",
          "created_utc": 1747193545.0
        }
      ]
    },
    {
      "id": "msbo89c",
      "author": "krankity-krab",
      "body": "i never did either when i was a kid, my mom used to get soo mad at me cuz i could tell. it was so gross, and i hated the texture and the taste. \n\nnow, thankfully, i love onions, cuz it seems like they’re in everything! (although maybe that’s because it’s one of the only vegetables i’ll eat, so my MIL makes recipes with them so i ‘at least get some nutrients’ lol 🥲)",
      "created_utc": 1747250912.0,
      "score": 4,
      "context": [
        {
          "id": "ms7ml9o",
          "author": "ProteusAlpha",
          "body": "My entire life, I've been told you can't taste onions when they're cooked.  I've never missed a one.",
          "created_utc": 1747193545.0
        }
      ]
    },
    {
      "id": "msd0dr3",
      "author": "j_kleinnn",
      "body": "I’m this way with ANY kind of pepper, people think I’m crazy for not picking out foods with straight-up bell peppers, sweet peppers, chili peppers, etc. in them!! I can only do chili peppers in a sauce like with butter chicken, but not too much because then it gets too hot 😭",
      "created_utc": 1747266178.0,
      "score": 2,
      "context": [
        {
          "id": "ms76th8",
          "author": "Similar_Guidance2339",
          "body": "FR if there’s a single speck of pepper on a dish I WILL KNOW",
          "created_utc": 1747187585.0
        }
      ]
    },
    {
      "id": "msatyy3",
      "author": "Aromatic-Elephant110",
      "body": "I had a roommate a while back. I liked chocolate chips muffins, she liked banana chocolate chip muffins. She said that you can't really taste banana, it just kind of sweetens the chocolate more. So I tried one of hers. All I could taste was banana.",
      "created_utc": 1747242241.0,
      "score": 7,
      "context": [
        {
          "id": "ms7xtat",
          "author": "betelguesez",
          "body": "People always say this to me about bananas. No I can absolutely taste the banana!! Stop trying to get me to try this!!!",
          "created_utc": 1747198464.0
        }
      ]
    },
    {
      "id": "ms8whiw",
      "author": "S-quinn7292",
      "body": "I can’t imagine how you wouldn’t notice alcohol in a drink",
      "created_utc": 1747218860.0,
      "score": 10,
      "context": [
        {
          "id": "ms8clbg",
          "author": "puppyhugtime",
          "body": "Hate this. It’s alcohol & nuts for me. Are there really people who can’t tell if there’s alcohol in a drink?",
          "created_utc": 1747206667.0
        }
      ]
    },
    {
      "id": "msd0lr1",
      "author": "j_kleinnn",
      "body": "I’ve never understood how people don’t instantly recoil at the taste of alcohol, because it’s SO strong for me!!! I can totally tell when there’s alcohol, and people will say like wine is sweet and i’m like what world do you live in 🥲",
      "created_utc": 1747266257.0,
      "score": 5,
      "context": [
        {
          "id": "ms8clbg",
          "author": "puppyhugtime",
          "body": "Hate this. It’s alcohol & nuts for me. Are there really people who can’t tell if there’s alcohol in a drink?",
          "created_utc": 1747206667.0
        }
      ]
    },
    {
      "id": "msao091",
      "author": "BakedTaterTits",
      "body": "Istg this is half my problem even after COVID wrecked half my taste buds. My mom tried putting a different brand of peanut butter in a Skippy container when I was a kid. Skippy is the only creamy peanut butter I've tried and liked. You can guess how well that went. There were a lot of things I could force myself to eat to avoid punishment as a kid. The wrong peanut butter was not one of them.",
      "created_utc": 1747240541.0,
      "score": 9,
      "context": [
        {
          "id": "ms9au37",
          "author": "r0ckchalk",
          "body": "I have a theory that a lot of us with ARFID are supertasters and have a much more sensitive palate than those without.",
          "created_utc": 1747225213.0
        }
      ]
    },
    {
      "id": "msaurle",
      "author": "Aromatic-Elephant110",
      "body": "My mom is always baffled that I don't want her ham & jalapeño pizza when I just like ham. She can't be convinced that you can still taste jalapeño even though I think just about everyone in the world would agree with ME.",
      "created_utc": 1747242472.0,
      "score": 6,
      "context": [
        {
          "id": "ms8fwb9",
          "author": "offmyfuxkingmind",
          "body": "store bought sandwiches with pickles. yes you took them out but my sandwich still tastes like pickles, I cannot taste anything but pickles. yikes. ",
          "created_utc": 1747208730.0
        }
      ]
    },
    {
      "id": "mtanlk8",
      "author": "Steven2008278",
      "body": "American cheese is so gross",
      "created_utc": 1747749125.0,
      "score": 3,
      "context": [
        {
          "id": "msbjihd",
          "author": "GuyOwasca",
          "body": "I will literally fucking END the next person who tells me that American cheese is the same as cheddar. I will die on this hill.\n\nAmerican cheese is plasticized food simulacra. I’d rather eat someone else’s vomit than peel that oily melted rubber off the roof of my mouth.",
          "created_utc": 1747249525.0
        }
      ]
    },
    {
      "id": "msbmsbu",
      "author": "ColdKaleidoscope743",
      "body": "haha yeah i’m not annoyed by it, i know it can be true for most people and motivate other people to try whatever is cooked. i just think it’s funny bc i feel like it’s not something that works on most people w arfid.",
      "created_utc": 1747250486.0,
      "score": 2,
      "context": [
        {
          "id": "msbma7e",
          "author": "MysticCollective",
          "body": "Unfortunately, I am guilty of saying this but it's because it's been true in some cases. So I think it's important to remember people don't say this to purposely annoy you. It's because they genuinely feel it is true. Now if you explain to them that you can taste the food item and they still insist you can't taste it. That's a jerk at that point. Kick that person out of your life. You don't need gaslighting in your life.",
          "created_utc": 1747250339.0
        }
      ]
    },
    {
      "id": "mshhzfs",
      "author": "speedmankelly",
      "body": "I used to lie as a kid and say I was allergic to avoid peanuts at all costs, the smell of peanut butter literally made me nauseous",
      "created_utc": 1747331151.0,
      "score": 1,
      "context": [
        {
          "id": "msg8kyf",
          "author": "huntresswizard_",
          "body": "I don’t like peanuts at all but I’m not allergic. My cousin tried to convince me you can’t taste the peanuts in snickers 😂  straight up LIES.",
          "created_utc": 1747317821.0
        }
      ]
    },
    {
      "id": "msblqvg",
      "author": "ColdKaleidoscope743",
      "body": "this is very interesting and insightful to read! thank you for sharing",
      "created_utc": 1747250180.0,
      "score": 1,
      "context": [
        {
          "id": "ms9p3x4",
          "author": "corn_breath",
          "body": "FWIW, my ARFID kid THINKS this way, but when we get it together and do blind taste tests with subtly different ingredients to things like his Mac & Cheese or nuggets, he will just as often prefer the \"misprepared\" version. Then, when we tell him which was prepared in the familiar way, he will refuse to eat the differently prepared one even though he preferred it moments earlier. \n\nFor him at least, it seems to me that his ARFID is deeply linked to the feeling that his life is out of control, likely as a consequence of being a child of divorce and having a workaholic tough it out dad and a mom with medical issues and a tendency to get overstimulated and retreat in the face of typical kid chaos (I'm the stepdad). \n\nI also think that as a kid, there's a fear of \"give an inch, take a mile\". If he accepts for instance that he likes mac and cheese prepared in various ways from various brands, that invites discussions about other ways he might be surprisingly flexible, which leads ot discussions about trying other new foods. This issue crops up with most exposures that succeed. He will happily try and sometimes enjoy a food and eat it a few times, but when it comes to normalizing it, he shuts down because I think there's an anticipation that comes with that of being asked to try something new, which his ARFID brain tells him will be repulsive even though he has no idea.",
          "created_utc": 1747230251.0
        }
      ]
    },
    {
      "id": "mssfask",
      "author": "turtlewings2o5",
      "body": "My ARFID is very anxiety-driven and was definitely caused, or at least seriously worsened, by constant power battles with my parents over whether I was going to eat what they wanted me to eat. Once I got out on my own, where it was completely up to me what I ate, I quickly became more willing to try things. All of which to say, you are probably 100% correct about your kiddo needing to feel in control of what he puts in his mouth!",
      "created_utc": 1747487954.0,
      "score": 1,
      "context": [
        {
          "id": "ms9p3x4",
          "author": "corn_breath",
          "body": "FWIW, my ARFID kid THINKS this way, but when we get it together and do blind taste tests with subtly different ingredients to things like his Mac & Cheese or nuggets, he will just as often prefer the \"misprepared\" version. Then, when we tell him which was prepared in the familiar way, he will refuse to eat the differently prepared one even though he preferred it moments earlier. \n\nFor him at least, it seems to me that his ARFID is deeply linked to the feeling that his life is out of control, likely as a consequence of being a child of divorce and having a workaholic tough it out dad and a mom with medical issues and a tendency to get overstimulated and retreat in the face of typical kid chaos (I'm the stepdad). \n\nI also think that as a kid, there's a fear of \"give an inch, take a mile\". If he accepts for instance that he likes mac and cheese prepared in various ways from various brands, that invites discussions about other ways he might be surprisingly flexible, which leads ot discussions about trying other new foods. This issue crops up with most exposures that succeed. He will happily try and sometimes enjoy a food and eat it a few times, but when it comes to normalizing it, he shuts down because I think there's an anticipation that comes with that of being asked to try something new, which his ARFID brain tells him will be repulsive even though he has no idea.",
          "created_utc": 1747230251.0
        }
      ]
    },
    {
      "id": "mt8nmwi",
      "author": "ColdKaleidoscope743",
      "body": "if you say so",
      "created_utc": 1747712916.0,
      "score": 1,
      "context": [
        {
          "id": "mt479e3",
          "author": "sickkid29",
          "body": "Most of the time you won't be able to know ",
          "created_utc": 1747660334.0
        }
      ]
    },
    {
      "id": "msmw8pr",
      "author": "sstagger",
      "body": "ME TOO OMFG EVEN A SHRED OF LETTUCE I CAN TASTE IT THROUGHOUT MY ENTIRE MEAL😭😭",
      "created_utc": 1747407567.0,
      "score": 4,
      "context": [
        {
          "id": "ms7jhha",
          "author": "_warped_art_",
          "body": "My mom trying to convince me that lettuce doesn't taste like anything, yes it does it tastes like lettuce!",
          "created_utc": 1747192304.0
        },
        {
          "id": "ms7lvix",
          "author": "crashnebulaa_a",
          "body": "lettuce has a STRONG taste to me",
          "created_utc": 1747193255.0
        }
      ]
    },
    {
      "id": "ms8n04u",
      "author": "ArcherFawkes",
      "body": "Same. Unfortunately that part has the best crunch factor and soggy lettuce is awful",
      "created_utc": 1747213242.0,
      "score": 7,
      "context": [
        {
          "id": "ms7jhha",
          "author": "_warped_art_",
          "body": "My mom trying to convince me that lettuce doesn't taste like anything, yes it does it tastes like lettuce!",
          "created_utc": 1747192304.0
        },
        {
          "id": "ms7lsn7",
          "author": "ColdKaleidoscope743",
          "body": "bleh i especially hate white crunchy parts of lettuce",
          "created_utc": 1747193224.0
        }
      ]
    },
    {
      "id": "mt4766l",
      "author": "sickkid29",
      "body": "That's the best part ",
      "created_utc": 1747660301.0,
      "score": 2,
      "context": [
        {
          "id": "ms7jhha",
          "author": "_warped_art_",
          "body": "My mom trying to convince me that lettuce doesn't taste like anything, yes it does it tastes like lettuce!",
          "created_utc": 1747192304.0
        },
        {
          "id": "ms7lsn7",
          "author": "ColdKaleidoscope743",
          "body": "bleh i especially hate white crunchy parts of lettuce",
          "created_utc": 1747193224.0
        }
      ]
    },
    {
      "id": "mvcxge8",
      "author": "Cosmic_witch_777",
      "body": "OH MY GOD ONIONS. I have serious issues with onions why do people put it in EVERYTHING. I'm at a recovery facility right now and they had to give me a different menu because EVERYTHING HAS ONIONS. And they all say \"what if we cut them up really small\" like its still gonna crunch in a squishy way no matter how small you make it. I hate things that crunch in a squishy way",
      "created_utc": 1748749458.0,
      "score": 2,
      "context": [
        {
          "id": "ms7jhha",
          "author": "_warped_art_",
          "body": "My mom trying to convince me that lettuce doesn't taste like anything, yes it does it tastes like lettuce!",
          "created_utc": 1747192304.0
        },
        {
          "id": "msdk12h",
          "author": "BMH_FL",
          "body": "Same! People think I’m crazy, but I can taste if there’s a tiny piece of lettuce anywhere in my food. Mexican style places are the biggest offenders of getting bits of other food in my taco or burrito when making it, so I learned to always open it up to check before I bite.\n\nAnd onions! How tf are people so overly confident that they can hide onions in food. Do others really not feel the texture?  It’s baffling to me lol",
          "created_utc": 1747272952.0
        }
      ]
    },
    {
      "id": "mu29sa8",
      "author": "_warped_art_",
      "body": "I cannot do raw onions unless it's in pico de gallo",
      "created_utc": 1748117592.0,
      "score": 1,
      "context": [
        {
          "id": "ms7jhha",
          "author": "_warped_art_",
          "body": "My mom trying to convince me that lettuce doesn't taste like anything, yes it does it tastes like lettuce!",
          "created_utc": 1747192304.0
        },
        {
          "id": "msdk12h",
          "author": "BMH_FL",
          "body": "Same! People think I’m crazy, but I can taste if there’s a tiny piece of lettuce anywhere in my food. Mexican style places are the biggest offenders of getting bits of other food in my taco or burrito when making it, so I learned to always open it up to check before I bite.\n\nAnd onions! How tf are people so overly confident that they can hide onions in food. Do others really not feel the texture?  It’s baffling to me lol",
          "created_utc": 1747272952.0
        }
      ]
    },
    {
      "id": "msbff70",
      "author": "Comfortable_Sport_38",
      "body": "I hope you wash your lettuce before eating it😭",
      "created_utc": 1747248340.0,
      "score": 3,
      "context": [
        {
          "id": "ms7jhha",
          "author": "_warped_art_",
          "body": "My mom trying to convince me that lettuce doesn't taste like anything, yes it does it tastes like lettuce!",
          "created_utc": 1747192304.0
        },
        {
          "id": "ms8ck3x",
          "author": "luvmffy",
          "body": "idk why lettuce has like a sour taste to it, its not that prominent but i can still notice it",
          "created_utc": 1747206647.0
        }
      ]
    },
    {
      "id": "msbyzwn",
      "author": "ProteusAlpha",
      "body": "That's what I always used to say!  They never could give me a solid answer.",
      "created_utc": 1747254072.0,
      "score": 4,
      "context": [
        {
          "id": "ms7ml9o",
          "author": "ProteusAlpha",
          "body": "My entire life, I've been told you can't taste onions when they're cooked.  I've never missed a one.",
          "created_utc": 1747193545.0
        },
        {
          "id": "ms90w1e",
          "author": "MoodOk8885",
          "body": "Wait then why do they even include it in their cooking",
          "created_utc": 1747221014.0
        }
      ]
    },
    {
      "id": "msbzybd",
      "author": "ProteusAlpha",
      "body": "Can't taste it?  Then how did I know it was there?!  You deliberately didn't tell me!.",
      "created_utc": 1747254366.0,
      "score": 6,
      "context": [
        {
          "id": "ms7ml9o",
          "author": "ProteusAlpha",
          "body": "My entire life, I've been told you can't taste onions when they're cooked.  I've never missed a one.",
          "created_utc": 1747193545.0
        },
        {
          "id": "msak45e",
          "author": "InsideOusside",
          "body": "same here, my dad puts onions in most things and goes “you can’t taste it!” but i most certainly can mr. dad sir.",
          "created_utc": 1747239413.0
        }
      ]
    },
    {
      "id": "msbzv5q",
      "author": "ProteusAlpha",
      "body": "I got that way with Mustard and Pepper.  Used to hate them as a kid, now I go through so much of it, I have to restock once a month.",
      "created_utc": 1747254339.0,
      "score": 5,
      "context": [
        {
          "id": "ms7ml9o",
          "author": "ProteusAlpha",
          "body": "My entire life, I've been told you can't taste onions when they're cooked.  I've never missed a one.",
          "created_utc": 1747193545.0
        },
        {
          "id": "msbo89c",
          "author": "krankity-krab",
          "body": "i never did either when i was a kid, my mom used to get soo mad at me cuz i could tell. it was so gross, and i hated the texture and the taste. \n\nnow, thankfully, i love onions, cuz it seems like they’re in everything! (although maybe that’s because it’s one of the only vegetables i’ll eat, so my MIL makes recipes with them so i ‘at least get some nutrients’ lol 🥲)",
          "created_utc": 1747250912.0
        }
      ]
    },
    {
      "id": "msekr4d",
      "author": "swingingmydongaround",
      "body": "I love peppers but yeah when they’re cooked in something you can def taste the residue on EVERYTHING even if you pick them out",
      "created_utc": 1747288609.0,
      "score": 3,
      "context": [
        {
          "id": "ms76th8",
          "author": "Similar_Guidance2339",
          "body": "FR if there’s a single speck of pepper on a dish I WILL KNOW",
          "created_utc": 1747187585.0
        },
        {
          "id": "msd0dr3",
          "author": "j_kleinnn",
          "body": "I’m this way with ANY kind of pepper, people think I’m crazy for not picking out foods with straight-up bell peppers, sweet peppers, chili peppers, etc. in them!! I can only do chili peppers in a sauce like with butter chicken, but not too much because then it gets too hot 😭",
          "created_utc": 1747266178.0
        }
      ]
    },
    {
      "id": "mseksh1",
      "author": "swingingmydongaround",
      "body": "banana ruins everything I swear.",
      "created_utc": 1747288630.0,
      "score": 5,
      "context": [
        {
          "id": "ms7xtat",
          "author": "betelguesez",
          "body": "People always say this to me about bananas. No I can absolutely taste the banana!! Stop trying to get me to try this!!!",
          "created_utc": 1747198464.0
        },
        {
          "id": "msatyy3",
          "author": "Aromatic-Elephant110",
          "body": "I had a roommate a while back. I liked chocolate chips muffins, she liked banana chocolate chip muffins. She said that you can't really taste banana, it just kind of sweetens the chocolate more. So I tried one of hers. All I could taste was banana.",
          "created_utc": 1747242241.0
        }
      ]
    },
    {
      "id": "msaco06",
      "author": "MrPureinstinct",
      "body": "I have had some very sweet cocktails where the alcohol isn't that strong of a liquor so it gets masked by the very sugary mixer. If I didn't see it get made I wouldn't have believe there was booze in it.",
      "created_utc": 1747237284.0,
      "score": 6,
      "context": [
        {
          "id": "ms8clbg",
          "author": "puppyhugtime",
          "body": "Hate this. It’s alcohol & nuts for me. Are there really people who can’t tell if there’s alcohol in a drink?",
          "created_utc": 1747206667.0
        },
        {
          "id": "ms8whiw",
          "author": "S-quinn7292",
          "body": "I can’t imagine how you wouldn’t notice alcohol in a drink",
          "created_utc": 1747218860.0
        }
      ]
    },
    {
      "id": "msenq6x",
      "author": "kinkbongcrazybasin",
      "body": "When I'm drunk, I don't taste alcohol, so I used to drink sweet wines or citrus IPAs to get drunk and then drink whiskey or rum straight from the bottle to get blackout drunk. There are reasons why I stopped drinking.",
      "created_utc": 1747290290.0,
      "score": 6,
      "context": [
        {
          "id": "ms8clbg",
          "author": "puppyhugtime",
          "body": "Hate this. It’s alcohol & nuts for me. Are there really people who can’t tell if there’s alcohol in a drink?",
          "created_utc": 1747206667.0
        },
        {
          "id": "ms8whiw",
          "author": "S-quinn7292",
          "body": "I can’t imagine how you wouldn’t notice alcohol in a drink",
          "created_utc": 1747218860.0
        }
      ]
    },
    {
      "id": "msdsie4",
      "author": "puppyhugtime",
      "body": "Yeah, wine tastes like hell LOL",
      "created_utc": 1747275982.0,
      "score": 5,
      "context": [
        {
          "id": "ms8clbg",
          "author": "puppyhugtime",
          "body": "Hate this. It’s alcohol & nuts for me. Are there really people who can’t tell if there’s alcohol in a drink?",
          "created_utc": 1747206667.0
        },
        {
          "id": "msd0lr1",
          "author": "j_kleinnn",
          "body": "I’ve never understood how people don’t instantly recoil at the taste of alcohol, because it’s SO strong for me!!! I can totally tell when there’s alcohol, and people will say like wine is sweet and i’m like what world do you live in 🥲",
          "created_utc": 1747266257.0
        }
      ]
    },
    {
      "id": "msekv3f",
      "author": "swingingmydongaround",
      "body": "this! but I will say that I make a bloody mary where the alcohol is almost undetectable",
      "created_utc": 1747288670.0,
      "score": 4,
      "context": [
        {
          "id": "ms8clbg",
          "author": "puppyhugtime",
          "body": "Hate this. It’s alcohol & nuts for me. Are there really people who can’t tell if there’s alcohol in a drink?",
          "created_utc": 1747206667.0
        },
        {
          "id": "msd0lr1",
          "author": "j_kleinnn",
          "body": "I’ve never understood how people don’t instantly recoil at the taste of alcohol, because it’s SO strong for me!!! I can totally tell when there’s alcohol, and people will say like wine is sweet and i’m like what world do you live in 🥲",
          "created_utc": 1747266257.0
        }
      ]
    },
    {
      "id": "msbvsqg",
      "author": "bekaz13",
      "body": "She thinks jalapeño juice doesn't get on the pizza? If she touches one does she wash her hands before rubbing her eyes?",
      "created_utc": 1747253139.0,
      "score": 3,
      "context": [
        {
          "id": "ms8fwb9",
          "author": "offmyfuxkingmind",
          "body": "store bought sandwiches with pickles. yes you took them out but my sandwich still tastes like pickles, I cannot taste anything but pickles. yikes. ",
          "created_utc": 1747208730.0
        },
        {
          "id": "msaurle",
          "author": "Aromatic-Elephant110",
          "body": "My mom is always baffled that I don't want her ham & jalapeño pizza when I just like ham. She can't be convinced that you can still taste jalapeño even though I think just about everyone in the world would agree with ME.",
          "created_utc": 1747242472.0
        }
      ]
    },
    {
      "id": "msjbl6l",
      "author": "huntresswizard_",
      "body": "Oh lol I definitely did the same, and this experience with my cousin was a MAJOR reason why I started",
      "created_utc": 1747351348.0,
      "score": 1,
      "context": [
        {
          "id": "msg8kyf",
          "author": "huntresswizard_",
          "body": "I don’t like peanuts at all but I’m not allergic. My cousin tried to convince me you can’t taste the peanuts in snickers 😂  straight up LIES.",
          "created_utc": 1747317821.0
        },
        {
          "id": "mshhzfs",
          "author": "speedmankelly",
          "body": "I used to lie as a kid and say I was allergic to avoid peanuts at all costs, the smell of peanut butter literally made me nauseous",
          "created_utc": 1747331151.0
        }
      ]
    },
    {
      "id": "msvpugp",
      "author": "corn_breath",
      "body": "He's not pressured much about food -- we try to take a collaborative appraoch with him and at his dad's, they haven't seen his limited diet as a problem until recently -- but there are definitely different values and expectations about other things between houses and I think a palpable sense of distrust that pushes him into this tough, lonely position in the middle. Not that he's passing messages between parents... it's more like just inconsistencies about so many rules. \n\nI think in the big picture though he has sort of taken on this diplomat position where he's so worried about keeping his parents in the right mindset (his dad's temper, his mom's anxiety) that he silence's his own emotions. For whatever reason, food has become his unconscious way of fighting back for control... at least that's my theory.\n\nI would agree that if he is ever able to get to a place where he feels more in control of the other aspects of his life, it would help him also feel more willing to try new foods.",
      "created_utc": 1747528544.0,
      "score": 1,
      "context": [
        {
          "id": "ms9p3x4",
          "author": "corn_breath",
          "body": "FWIW, my ARFID kid THINKS this way, but when we get it together and do blind taste tests with subtly different ingredients to things like his Mac & Cheese or nuggets, he will just as often prefer the \"misprepared\" version. Then, when we tell him which was prepared in the familiar way, he will refuse to eat the differently prepared one even though he preferred it moments earlier. \n\nFor him at least, it seems to me that his ARFID is deeply linked to the feeling that his life is out of control, likely as a consequence of being a child of divorce and having a workaholic tough it out dad and a mom with medical issues and a tendency to get overstimulated and retreat in the face of typical kid chaos (I'm the stepdad). \n\nI also think that as a kid, there's a fear of \"give an inch, take a mile\". If he accepts for instance that he likes mac and cheese prepared in various ways from various brands, that invites discussions about other ways he might be surprisingly flexible, which leads ot discussions about trying other new foods. This issue crops up with most exposures that succeed. He will happily try and sometimes enjoy a food and eat it a few times, but when it comes to normalizing it, he shuts down because I think there's an anticipation that comes with that of being asked to try something new, which his ARFID brain tells him will be repulsive even though he has no idea.",
          "created_utc": 1747230251.0
        },
        {
          "id": "mssfask",
          "author": "turtlewings2o5",
          "body": "My ARFID is very anxiety-driven and was definitely caused, or at least seriously worsened, by constant power battles with my parents over whether I was going to eat what they wanted me to eat. Once I got out on my own, where it was completely up to me what I ate, I quickly became more willing to try things. All of which to say, you are probably 100% correct about your kiddo needing to feel in control of what he puts in his mouth!",
          "created_utc": 1747487954.0
        }
      ]
    },
    {
      "id": "msbfvqt",
      "author": "luvmffy",
      "body": "i do, i wash all my fruit and veg before eating it bcs i’m scared of getting sick lol",
      "created_utc": 1747248473.0,
      "score": 4,
      "context": [
        {
          "id": "ms7jhha",
          "author": "_warped_art_",
          "body": "My mom trying to convince me that lettuce doesn't taste like anything, yes it does it tastes like lettuce!",
          "created_utc": 1747192304.0
        },
        {
          "id": "ms8ck3x",
          "author": "luvmffy",
          "body": "idk why lettuce has like a sour taste to it, its not that prominent but i can still notice it",
          "created_utc": 1747206647.0
        },
        {
          "id": "msbff70",
          "author": "Comfortable_Sport_38",
          "body": "I hope you wash your lettuce before eating it😭",
          "created_utc": 1747248340.0
        }
      ]
    }
  ]
}