{
  "id": "1kojyg3",
  "subreddit": "ARFID",
  "author": "xernpostz",
  "created_utc": 1747454112.0,
  "title": "Posted on another food sub and these are some of the comments i got. Trying to get healthy when people like this exist is a nightmare",
  "selftext": "all i asked for was a calorie estimate of one of my meals (fair warning if you go look at the post, there is an image of the meal).\n\npost blew up more than i expected it to. thankfully, the vast majority of people were helpful and compassionate. but im so fucking sick of stuff like this. the reason why people with ARFID dont seek health advice or venture into other nutritional communities is because of people like this. everyone needs to stop making assumptions about our lives. ik im scared to ever post on another food sub that isnt this one ever again",
  "url": "https://www.reddit.com/gallery/1kojyg3",
  "score": 168,
  "num_comments": 58,
  "comments": [
    {
      "id": "msrp3b1",
      "author": "AirshipPirate",
      "body": "I know people who are otherwise the nicest and most empathetic people, but eat something they deem 'unhealthy' in front of them? Suddenly they feel they've got permission to say whatever ugly, shaming thing they want. It's ridiculous. Nobody knows more about your journey with food than you. I'm proud of you for putting yourself out there and trying to get that help even when people want to throw it in your face.",
      "created_utc": 1747474838.0,
      "score": 94,
      "context": []
    },
    {
      "id": "msrsyzm",
      "author": "CalamityWof",
      "body": "Dude, its wild how folks just think its pickyness. I'd give anything to eat nutritional stuff like I should be and not worry about supplements and stuff.",
      "created_utc": 1747477274.0,
      "score": 78,
      "context": []
    },
    {
      "id": "msszv0q",
      "author": "Named_users",
      "body": "Reading this as I’m sitting here starving trying to decide if I can stomach ramen noodles or vegetable soup for BREAKFAST because it’s all I’ve been able to handle the last week. Fuck those people. It costs nothing to not be an ass hole",
      "created_utc": 1747495165.0,
      "score": 38,
      "context": []
    },
    {
      "id": "mssp1vx",
      "author": "Mother_Goat1541",
      "body": "I spent my whole life trying to explain my ARFID and eating restrictions to people. Then I was diagnosed with Crohns. Suddenly people are SO considerate and understanding of my dietary needs. Nobody makes comments, people go out of their way to be accommodating. Nothing has changed other than the letters I give them to explain my diet…it’s so frustrating",
      "created_utc": 1747491571.0,
      "score": 32,
      "context": []
    },
    {
      "id": "mssreul",
      "author": "paradigm_mgmt",
      "body": "issues with food is actually really prevalent in our society but because denying yourself is seen as some kind of virtue it can fly under the radar for so many. (let's not even open the can of orthorexia)\n\nsorry people can't just answer questions and be helpful 🫤\n\nsuper enjoy the commenter who said you were being too kind to yourself and just go to 'complete hunger' 🙄🤦🏼 i personally don't feel hungry - i just feel sick after too long and then reeeeally don't want anything. good to see, know-nothing numpties are out there giving advice 🫠",
      "created_utc": 1747492381.0,
      "score": 24,
      "context": []
    },
    {
      "id": "mst05dy",
      "author": "SadisticGoose",
      "body": "Honestly, don’t waste your time arguing with these people. They choose to be prejudiced and ignorant. They will not be convinced otherwise, at least on the internet. People are extra sensitive about what other people eat for some reason.",
      "created_utc": 1747495256.0,
      "score": 15,
      "context": []
    },
    {
      "id": "msv96lm",
      "author": "MultiFandomShipperr",
      "body": ">Introduce complete hunger to beat it\n\nBuddy boy, a lot of us have experienced complete hunger. Starving isn't going to make my body accept unsafe foods",
      "created_utc": 1747522307.0,
      "score": 12,
      "context": []
    },
    {
      "id": "mstugwi",
      "author": "LyssaRae7129",
      "body": "I’m literally so sick of interacting with neurotypicals at all. My default is empathy and compassion, and theirs seems to be “get fucked lol, I love excuses to be mean to people.” Fuck ‘em all tbh. I’m so sorry you got these kinds of responses.\n\nTangentially related to mean ass neurotypicals: Someone posted in r/MaliciousCompliance about consistently running late to work (5-15 minutes) and their boss telling them not to come in at all if they’re gonna be late. The number of people who were like “Fuck you, I’d have BEEN fired you” was astonishing. When I suggested that anything could be happening, from a weird morning throwing things to ADHD making mornings unmanageable, to navigating kids who have no sense of urgency, the neurotypicals saw an opportunity to remind me that OP said nothing about having a medical condition or other need. Like?? That’s not at all the point? The point is that it is so much less exhausting being compassionate than looking for every excuse to be an asshole/trying to enforce arbitrary rules that have very little consequence. 🙃",
      "created_utc": 1747504975.0,
      "score": 11,
      "context": []
    },
    {
      "id": "msucc1a",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1747510996.0,
      "score": 10,
      "context": []
    },
    {
      "id": "msvrtzz",
      "author": "angel_of_satan",
      "body": "i have genuinely given up trying to reason with people who insist ARFID is a choice. if they seriously think we CHOOSE to live like this w all our struggles, nothing I can say will change their mind. doesn't even matter how many scientific studies you show them, they will INSIST you can just \"push through\" if you try hard enough. they simply lack empathy for ppl they don't understand, even if they don't wanna admit that.",
      "created_utc": 1747529343.0,
      "score": 9,
      "context": []
    },
    {
      "id": "mswrbmb",
      "author": "Snugglebuggle",
      "body": "Your story is my story... from my birth onwards. I also barely ate as a baby and ended up being hospitalized as a toddler. They initially diagnosed me with Failure to Thrive. My family would try any means necessary to get me to eat, to keep me alive, setting timers with punishment if I didn't finish my food, not willing to make any adaptations. I used to sit at the dinner table and cry as I watched the timer count down. I can just regain my ability to eat (at all), but a stressful situation can easily put me back into starvation mode, and then it can take up to 6 months for me to slowly work my way back to eating regularly. When I was formally diagnosed with Autism in my 30s, I was also diagnosed with ARFID. Everything started to make sense. I've been called a picky eater by everyone in my life repeatedly. I now find it a highly triggering and offensive term because of the damage caused by other people's assumptions about me. \n\nCurrently 40yo, 125 lbs, 5'5\". In the last year alone, I have lost more than 50 lbs due to starvation. I have dropped below 90 lbs before. I'm so exhausted all the time from barely eating that it can be hard to get out of bed. Of all my issues, ARFID sucks the most.",
      "created_utc": 1747545215.0,
      "score": 5,
      "context": []
    },
    {
      "id": "msujpax",
      "author": "xThyQueen",
      "body": "Refusal of work syndrome is actually a symptom of ADHD. Just called something else lol these people are so miserable in their own bodies and lives they get on here to make others feel bad cause it makes them feel better knowing someone out there feels worse. It's weird behavior. Those people have nothing going for them in life the fact they are knowingly trying to hurt you is very odd behavior. Don't take anything they say to heart. They have none. And probably no inner voice as well.",
      "created_utc": 1747513420.0,
      "score": 3,
      "context": []
    },
    {
      "id": "msuj3yf",
      "author": "Sunraeshinesbright",
      "body": "I’m so sorry that there were so many awful comments from people, I’m especially annoyed at the guy suggesting to introduce “complete hunger” I was diagnosed with ARFID literally yesterday and for about 2 months I’ve been hardly able to eat anything, it’s not at all me being picky infact some of the foods I cannot eat, I used to LOVE but for example yesterday I put a piece of scrambled eggs in my mouth and immediately was sick to my stomach… (developed ARFID after having gastroparisis for years so pretty much anything I’ve ever thrown up due to my partially paralyzed stomach is a hard no) I’m so sorry that so many don’t understand, sending you love and btw that meal looked really good lol",
      "created_utc": 1747513227.0,
      "score": 2,
      "context": []
    },
    {
      "id": "msvcv1m",
      "author": "dehydratedbisexual",
      "body": "Yikes, people can be so awful online. I’m sorry they were so rude to you. I went to look at your post and it wasn’t even that crazy! Like, how is pasta bad?? Maybe the amount is a bit large for the average person, but it’s not that crazy. Especially if you’re not eating “3 balanced meals” a day. Load up on those carbs, fuel yourself! Good on you for nourishing your body!!!",
      "created_utc": 1747523615.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mt10wmh",
      "author": "Cosmicrelief0",
      "body": "Stop engaging with these baboons. They have no desire to learn, and if they did, they wouldn't be putting the responsibility on you. \n\nSave your energy friend 🤍",
      "created_utc": 1747607179.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mt128dd",
      "author": "Rinny-ThePooh",
      "body": "I recently started eating “healthy” foods (what I can tolerate so mostly fruits veggies etc) and honestly.. I wanna go back. My bills are out the ass. It’s so much more expensive when I can’t eat half the fruit in the container or have to cut out half of my potato.",
      "created_utc": 1747607651.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mt1l9gj",
      "author": "bubble-buddy2",
      "body": "\"stop being so nice to yourself\"? Says who? Says fucking who? What's wrong with being nice to myself? That's so lame",
      "created_utc": 1747614636.0,
      "score": 2,
      "context": []
    },
    {
      "id": "msv569n",
      "author": "phoebemocha",
      "body": "u/eufalonasdownfall u/beneficial_iron3508\n\nspeaking this way to someone with a disorder is a disability hate crime. please change yourselves for the better, you are spreading unneeded hatred on our planet. we have 100 short years, please spread love, if you're human",
      "created_utc": 1747520825.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mswsf0d",
      "author": "saintceciliax",
      "body": "You’re only gonna hurt yourself arguing with these people unfortunately",
      "created_utc": 1747545815.0,
      "score": 1,
      "context": []
    },
    {
      "id": "msy23uj",
      "author": "Outrageous_Land8828",
      "body": "Fucking pissed how people don’t consider ARFID at all. “Any dietary needs?” As they say, so I go “I have an eating disorder that prevents me from eating almost anything”. They say “Oh that’s rubbish, eat this food anyway”. Imagine saying that to someone with Crohn’s disease or stomach cancer! Pricks.",
      "created_utc": 1747572092.0,
      "score": 1,
      "context": []
    },
    {
      "id": "msyzj1y",
      "author": "Marsisoncrack",
      "body": "What the fuck is wrong with people??? some people need to learn how to shut the fuck up honestly im sorry people said such disgusting things to you. This infuriates me and im tired of entitled little assholes with the privilege of not having arfid  talking about how they think they know ANYTHING about our disorder and lacking total fucking empathy and being insanely disrespectful it pisses me off.",
      "created_utc": 1747583653.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mt20fyb",
      "author": "R0da",
      "body": "There are real life adults out there who react to my business like how my body reacts to green beans.\n\nAt least I know I look silly when I hurl abuses at those  soggy witch toes. Do less harm too.",
      "created_utc": 1747620327.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mu0qm17",
      "author": "Veryoutofplace",
      "body": "I wouldn’t wish arfid on my worst enemy. Nobody, not even my closest friends take it seriously.",
      "created_utc": 1748099624.0,
      "score": 1,
      "context": []
    },
    {
      "id": "msyneit",
      "author": "Still_Enthusiasm_263",
      "body": "as I can see, since your post about calories in a serving of pasta made its way to my dashboard, there is a huge influx of positive comments, suggestions on how to make your life easier even with the diagnosis that you have and that commenters don’t have to understand\nI do understand the thing about other people being mean for no reason but in this case I’d say to focus on a positive side and a ton of positive comments instead of fishing for sympathy here",
      "created_utc": 1747579756.0,
      "score": 0,
      "context": []
    },
    {
      "id": "mt48v0g",
      "author": "sickkid29",
      "body": "You don't need to put a warning that there is a picture of food 😂",
      "created_utc": 1747660906.0,
      "score": 0,
      "context": []
    },
    {
      "id": "msue2kj",
      "author": "xernpostz",
      "body": "i honestly tried to change their minds but it's clear they're not interested in educating themselves. im gonna continue with what works for me and try my best to live a healthier lifestyle, but they don't even realize that saying this shit makes people more averse to seeking help. if you want people to live a healthy lifestyle then why the fuck are you yelling at them?? makes no sense",
      "created_utc": 1747511571.0,
      "score": 17,
      "context": [
        {
          "id": "msrp3b1",
          "author": "AirshipPirate",
          "body": "I know people who are otherwise the nicest and most empathetic people, but eat something they deem 'unhealthy' in front of them? Suddenly they feel they've got permission to say whatever ugly, shaming thing they want. It's ridiculous. Nobody knows more about your journey with food than you. I'm proud of you for putting yourself out there and trying to get that help even when people want to throw it in your face.",
          "created_utc": 1747474838.0
        }
      ]
    },
    {
      "id": "mt1k883",
      "author": "james4345",
      "body": "THIS. I’m a parent of a young child with ARFID—I follow this sub to learn more from the kid’s perspective. A mom friend I know is a high school counselor with a master’s degree in something related to counseling and/or education. You’d think she’d know all about eating disorders, right? Long before I knew about ARFID, she freaking accosted me one time about packing my then-“picky” child Lunchables in his lunchbox, when it was one of the few things he would eat. Her husband intervened and told her to calm down, but she was almost in my face about… Lunchables (and sodium! I remember her yelling about the sodium). She is lovely the rest of the time. I don’t understand why what everyone else eats is such a cause for personal concern, but you are right that people love to shame others about their food choices these days.",
      "created_utc": 1747614247.0,
      "score": 4,
      "context": [
        {
          "id": "msrp3b1",
          "author": "AirshipPirate",
          "body": "I know people who are otherwise the nicest and most empathetic people, but eat something they deem 'unhealthy' in front of them? Suddenly they feel they've got permission to say whatever ugly, shaming thing they want. It's ridiculous. Nobody knows more about your journey with food than you. I'm proud of you for putting yourself out there and trying to get that help even when people want to throw it in your face.",
          "created_utc": 1747474838.0
        }
      ]
    },
    {
      "id": "msubs8a",
      "author": "axw3555",
      "body": "Welcome to the world of poor education and a demand that everyone be \"normal\".\n\nThat said, I will say that despite this being posted in a food sub, the assholes got downvoted to hell. Which is rare for a food sub.",
      "created_utc": 1747510811.0,
      "score": 21,
      "context": [
        {
          "id": "msrsyzm",
          "author": "CalamityWof",
          "body": "Dude, its wild how folks just think its pickyness. I'd give anything to eat nutritional stuff like I should be and not worry about supplements and stuff.",
          "created_utc": 1747477274.0
        }
      ]
    },
    {
      "id": "msws4ji",
      "author": "LeakyFountainPen",
      "body": "I was shocked when I talked to my mom once and mentioned how I didn't like a certain food all that much. She was shocked bc it was one of the only veggies she could get me to eat as a kid. \n\nShe was like \"I thought you loved it???\"\n\nAnd I said \"No, yeah, I mean, it doesn't make me gag and puke, but like...idk, the taste is underwhelming and I don't enjoy the experience of eating it. But I CAN eat it, so I do.\" (Like, it's SAFE, it's just not GOOD.)\n\nAnd she kind of blew my mind when she realized those were *separate* categories in my head. And I came to the realization that everyone thought all of my \"unsafe\" foods were in that first category. That I was making a huge deal out of \"it's not my most favoritest delicious food\" and throwing a fit when I couldn't have This One Specific Brand of oatmeal. \n\nBecause THAT'S what people mean when they say \"picky.\"",
      "created_utc": 1747545656.0,
      "score": 12,
      "context": [
        {
          "id": "msrsyzm",
          "author": "CalamityWof",
          "body": "Dude, its wild how folks just think its pickyness. I'd give anything to eat nutritional stuff like I should be and not worry about supplements and stuff.",
          "created_utc": 1747477274.0
        }
      ]
    },
    {
      "id": "msujw3j",
      "author": "xThyQueen",
      "body": "Same. I cry a lot because I feel so bad most of the time.",
      "created_utc": 1747513481.0,
      "score": 3,
      "context": [
        {
          "id": "msrsyzm",
          "author": "CalamityWof",
          "body": "Dude, its wild how folks just think its pickyness. I'd give anything to eat nutritional stuff like I should be and not worry about supplements and stuff.",
          "created_utc": 1747477274.0
        }
      ]
    },
    {
      "id": "mt6een1",
      "author": "saltil",
      "body": "Exactly, I have pain in organs all the time, feel terrible then buy spinach, shove as much down my gob before I think about the texture and gag it all back up again, I'd love to be able to just easily eat it, I'd love if meal times felt fun and enjoyable like it does for others, it just isn't the case. Crazy to actually believe someone wants to feel this pain, or fear, I wish I was picky, I wish I had that freedom.",
      "created_utc": 1747684274.0,
      "score": 3,
      "context": [
        {
          "id": "msrsyzm",
          "author": "CalamityWof",
          "body": "Dude, its wild how folks just think its pickyness. I'd give anything to eat nutritional stuff like I should be and not worry about supplements and stuff.",
          "created_utc": 1747477274.0
        }
      ]
    },
    {
      "id": "msuea0i",
      "author": "xernpostz",
      "body": "im very late but have you considered liquid options? my go to in the morning is chocolate milk. ensure is a good option too. so sorry this is happening to you, wishing you the best",
      "created_utc": 1747511639.0,
      "score": 7,
      "context": [
        {
          "id": "msszv0q",
          "author": "Named_users",
          "body": "Reading this as I’m sitting here starving trying to decide if I can stomach ramen noodles or vegetable soup for BREAKFAST because it’s all I’ve been able to handle the last week. Fuck those people. It costs nothing to not be an ass hole",
          "created_utc": 1747495165.0
        }
      ]
    },
    {
      "id": "msuc8a9",
      "author": "xernpostz",
      "body": "\"you're being too nice to yourself so you should start starving yourself\" is SUCH an insane take i can't even wrap my head around it. our society has such an unhealthy outlook on food in general",
      "created_utc": 1747510960.0,
      "score": 13,
      "context": [
        {
          "id": "mssreul",
          "author": "paradigm_mgmt",
          "body": "issues with food is actually really prevalent in our society but because denying yourself is seen as some kind of virtue it can fly under the radar for so many. (let's not even open the can of orthorexia)\n\nsorry people can't just answer questions and be helpful 🫤\n\nsuper enjoy the commenter who said you were being too kind to yourself and just go to 'complete hunger' 🙄🤦🏼 i personally don't feel hungry - i just feel sick after too long and then reeeeally don't want anything. good to see, know-nothing numpties are out there giving advice 🫠",
          "created_utc": 1747492381.0
        }
      ]
    },
    {
      "id": "msucd24",
      "author": "xernpostz",
      "body": "i try my best to educate people but it usually falls on deaf ears. i want to change a few minds but im disappointed at how little it actually works. i just need to stop engaging",
      "created_utc": 1747511005.0,
      "score": 3,
      "context": [
        {
          "id": "mst05dy",
          "author": "SadisticGoose",
          "body": "Honestly, don’t waste your time arguing with these people. They choose to be prejudiced and ignorant. They will not be convinced otherwise, at least on the internet. People are extra sensitive about what other people eat for some reason.",
          "created_utc": 1747495256.0
        }
      ]
    },
    {
      "id": "msvccz4",
      "author": "heartoffiction",
      "body": "My partner the other week was like “well you’d eat xyz if you were starving on a deserted island” and I was like “no I wouldn’t that’s literally the entire problem” and now he gets it 😂",
      "created_utc": 1747523433.0,
      "score": 8,
      "context": [
        {
          "id": "msv96lm",
          "author": "MultiFandomShipperr",
          "body": ">Introduce complete hunger to beat it\n\nBuddy boy, a lot of us have experienced complete hunger. Starving isn't going to make my body accept unsafe foods",
          "created_utc": 1747522307.0
        }
      ]
    },
    {
      "id": "msv9dd6",
      "author": "xernpostz",
      "body": "right?? goes to show that they didn't do any research whatsoever",
      "created_utc": 1747522373.0,
      "score": 6,
      "context": [
        {
          "id": "msv96lm",
          "author": "MultiFandomShipperr",
          "body": ">Introduce complete hunger to beat it\n\nBuddy boy, a lot of us have experienced complete hunger. Starving isn't going to make my body accept unsafe foods",
          "created_utc": 1747522307.0
        }
      ]
    },
    {
      "id": "msvs7bz",
      "author": "angel_of_satan",
      "body": "i starved for an entire week as a kid when my parents tried to force me to eat what they ate or nothing at all. i believe i was 7, that wasn't a choice. i TRIED to eat, my body rejected 'nonsafe' foods and i puked it all up.",
      "created_utc": 1747529494.0,
      "score": 2,
      "context": [
        {
          "id": "msv96lm",
          "author": "MultiFandomShipperr",
          "body": ">Introduce complete hunger to beat it\n\nBuddy boy, a lot of us have experienced complete hunger. Starving isn't going to make my body accept unsafe foods",
          "created_utc": 1747522307.0
        }
      ]
    },
    {
      "id": "msud6fi",
      "author": "xernpostz",
      "body": "i have friends with ADHD and it's SUCH a crippling condition. jesus christ people automatically jump to the worst assumptions of people rather than accepting they could ever actually have a problem. and the worst part is they refuse to learn anything new when you try to educate them",
      "created_utc": 1747511275.0,
      "score": 3,
      "context": [
        {
          "id": "mstugwi",
          "author": "LyssaRae7129",
          "body": "I’m literally so sick of interacting with neurotypicals at all. My default is empathy and compassion, and theirs seems to be “get fucked lol, I love excuses to be mean to people.” Fuck ‘em all tbh. I’m so sorry you got these kinds of responses.\n\nTangentially related to mean ass neurotypicals: Someone posted in r/MaliciousCompliance about consistently running late to work (5-15 minutes) and their boss telling them not to come in at all if they’re gonna be late. The number of people who were like “Fuck you, I’d have BEEN fired you” was astonishing. When I suggested that anything could be happening, from a weird morning throwing things to ADHD making mornings unmanageable, to navigating kids who have no sense of urgency, the neurotypicals saw an opportunity to remind me that OP said nothing about having a medical condition or other need. Like?? That’s not at all the point? The point is that it is so much less exhausting being compassionate than looking for every excuse to be an asshole/trying to enforce arbitrary rules that have very little consequence. 🙃",
          "created_utc": 1747504975.0
        }
      ]
    },
    {
      "id": "msvc3fu",
      "author": "heartoffiction",
      "body": "My loving partner is very understanding of it- it’s possible!",
      "created_utc": 1747523339.0,
      "score": 4,
      "context": [
        {
          "id": "msucc1a",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1747510996.0
        }
      ]
    },
    {
      "id": "mtfcssi",
      "author": "ARFID-ModTeam",
      "body": "Your post or comment was removed due to containing a harmful message about ARFID— specifically, that people with this condition are unlovable. We understand that you struggle with this, but we also don't want others to internalize such an idea. Thank you for your understanding.",
      "created_utc": 1747805077.0,
      "score": 2,
      "context": [
        {
          "id": "msucc1a",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1747510996.0
        }
      ]
    },
    {
      "id": "msvsnca",
      "author": "xernpostz",
      "body": "i don't understand how even after explaining that i was constantly on the verge of death as a child, that i wouldn't eat, that i was seen as a medical anomaly, they still do not believe me. it's frustrating as hell. i don't understand why we can't live in a world more empathetic to those who are struggling.",
      "created_utc": 1747529672.0,
      "score": 5,
      "context": [
        {
          "id": "msvrtzz",
          "author": "angel_of_satan",
          "body": "i have genuinely given up trying to reason with people who insist ARFID is a choice. if they seriously think we CHOOSE to live like this w all our struggles, nothing I can say will change their mind. doesn't even matter how many scientific studies you show them, they will INSIST you can just \"push through\" if you try hard enough. they simply lack empathy for ppl they don't understand, even if they don't wanna admit that.",
          "created_utc": 1747529343.0
        }
      ]
    },
    {
      "id": "mswvk6v",
      "author": "xernpostz",
      "body": "oh gosh i am so sorry. it's comforting to know there was someone with my experience, but i also really feel for you having to struggle through that. i was lucky enough to have a mother who just wanted me fed. no one with this condition deserves to go through that...i hope you find peace and heal from what you've had to go through. fostering a healthy relationship with food when people are like this is so difficult. take care of yourself. you'll be in my thoughts",
      "created_utc": 1747547581.0,
      "score": 2,
      "context": [
        {
          "id": "mswrbmb",
          "author": "Snugglebuggle",
          "body": "Your story is my story... from my birth onwards. I also barely ate as a baby and ended up being hospitalized as a toddler. They initially diagnosed me with Failure to Thrive. My family would try any means necessary to get me to eat, to keep me alive, setting timers with punishment if I didn't finish my food, not willing to make any adaptations. I used to sit at the dinner table and cry as I watched the timer count down. I can just regain my ability to eat (at all), but a stressful situation can easily put me back into starvation mode, and then it can take up to 6 months for me to slowly work my way back to eating regularly. When I was formally diagnosed with Autism in my 30s, I was also diagnosed with ARFID. Everything started to make sense. I've been called a picky eater by everyone in my life repeatedly. I now find it a highly triggering and offensive term because of the damage caused by other people's assumptions about me. \n\nCurrently 40yo, 125 lbs, 5'5\". In the last year alone, I have lost more than 50 lbs due to starvation. I have dropped below 90 lbs before. I'm so exhausted all the time from barely eating that it can be hard to get out of bed. Of all my issues, ARFID sucks the most.",
          "created_utc": 1747545215.0
        }
      ]
    },
    {
      "id": "msvdk66",
      "author": "xernpostz",
      "body": "i had to educate someone who was throwing out weird buzz words (keto, eat meat it'll help your body \"heal from sugar\", etc) because they have no idea how macros work. like seriously, people assume i have no idea how nutrition works just because i have an eating disorder. ffs!",
      "created_utc": 1747523865.0,
      "score": 3,
      "context": [
        {
          "id": "msvcv1m",
          "author": "dehydratedbisexual",
          "body": "Yikes, people can be so awful online. I’m sorry they were so rude to you. I went to look at your post and it wasn’t even that crazy! Like, how is pasta bad?? Maybe the amount is a bit large for the average person, but it’s not that crazy. Especially if you’re not eating “3 balanced meals” a day. Load up on those carbs, fuel yourself! Good on you for nourishing your body!!!",
          "created_utc": 1747523615.0
        }
      ]
    },
    {
      "id": "mt12s8f",
      "author": "xernpostz",
      "body": "the economy is shit. eggs were a safe food for me until the prices blew through the roof. 15$ for a carton of fucking eggs? are you kidding?",
      "created_utc": 1747607852.0,
      "score": 2,
      "context": [
        {
          "id": "mt128dd",
          "author": "Rinny-ThePooh",
          "body": "I recently started eating “healthy” foods (what I can tolerate so mostly fruits veggies etc) and honestly.. I wanna go back. My bills are out the ass. It’s so much more expensive when I can’t eat half the fruit in the container or have to cut out half of my potato.",
          "created_utc": 1747607651.0
        }
      ]
    },
    {
      "id": "mt1s36a",
      "author": "xernpostz",
      "body": "the only place that rhetoric gets anyone is more eating disorders. seriously. it's so fucking dangerous to tell people shit like that. being nice to yourself is half the battle",
      "created_utc": 1747617184.0,
      "score": 1,
      "context": [
        {
          "id": "mt1l9gj",
          "author": "bubble-buddy2",
          "body": "\"stop being so nice to yourself\"? Says who? Says fucking who? What's wrong with being nice to myself? That's so lame",
          "created_utc": 1747614636.0
        }
      ]
    },
    {
      "id": "msx7x3l",
      "author": "Beneficial_Iron3508",
      "body": "OP sharing the post here actually adds up with my hypothesis about OP’s spoiled upbringing. Self victimisation (rage baiting in another sub) for center of attention is also very common with such individuals.",
      "created_utc": 1747555121.0,
      "score": -2,
      "context": [
        {
          "id": "msv569n",
          "author": "phoebemocha",
          "body": "u/eufalonasdownfall u/beneficial_iron3508\n\nspeaking this way to someone with a disorder is a disability hate crime. please change yourselves for the better, you are spreading unneeded hatred on our planet. we have 100 short years, please spread love, if you're human",
          "created_utc": 1747520825.0
        }
      ]
    },
    {
      "id": "msynuku",
      "author": "Still_Enthusiasm_263",
      "body": "living with any sort of diagnosis suck, some diagnosis suck more than others, being a picky eater (in a way) not by choice but by the way your body and mind work - sucks, and I truly wish you the best and to overcome your struggles at least to a certain degree, just cheer up and pay no mind to people on the internet 🙂‍↔️",
      "created_utc": 1747579901.0,
      "score": 0,
      "context": [
        {
          "id": "msyneit",
          "author": "Still_Enthusiasm_263",
          "body": "as I can see, since your post about calories in a serving of pasta made its way to my dashboard, there is a huge influx of positive comments, suggestions on how to make your life easier even with the diagnosis that you have and that commenters don’t have to understand\nI do understand the thing about other people being mean for no reason but in this case I’d say to focus on a positive side and a ton of positive comments instead of fishing for sympathy here",
          "created_utc": 1747579756.0
        }
      ]
    },
    {
      "id": "mt4nqiy",
      "author": "xernpostz",
      "body": "rules of this sub have you spoiler food images, it's the same idea of courtesy",
      "created_utc": 1747665751.0,
      "score": 1,
      "context": [
        {
          "id": "mt48v0g",
          "author": "sickkid29",
          "body": "You don't need to put a warning that there is a picture of food 😂",
          "created_utc": 1747660906.0
        }
      ]
    },
    {
      "id": "mt21jsw",
      "author": "R0da",
      "body": "I stuck up for \"chicken tender adults\" in a random gaming sub once, sharing my experiences having arfid to some dude going off on one of these tirades, and a bunch of people swooped in as he escalated to tell him to fuck off and stop working himself into a tizzy over something that's not his business. These fuckers are loud and hostile, but things are still getting better :')",
      "created_utc": 1747620736.0,
      "score": 3,
      "context": [
        {
          "id": "msrsyzm",
          "author": "CalamityWof",
          "body": "Dude, its wild how folks just think its pickyness. I'd give anything to eat nutritional stuff like I should be and not worry about supplements and stuff.",
          "created_utc": 1747477274.0
        },
        {
          "id": "msubs8a",
          "author": "axw3555",
          "body": "Welcome to the world of poor education and a demand that everyone be \"normal\".\n\nThat said, I will say that despite this being posted in a food sub, the assholes got downvoted to hell. Which is rare for a food sub.",
          "created_utc": 1747510811.0
        }
      ]
    },
    {
      "id": "mt6ujzh",
      "author": "CalamityWof",
      "body": "I love the taste of some fruits or vegetables. The texture, however, in any form they are make me gag though. Its a fight to get even smoothies down which I really wish it wasnt :/",
      "created_utc": 1747689083.0,
      "score": 2,
      "context": [
        {
          "id": "msrsyzm",
          "author": "CalamityWof",
          "body": "Dude, its wild how folks just think its pickyness. I'd give anything to eat nutritional stuff like I should be and not worry about supplements and stuff.",
          "created_utc": 1747477274.0
        },
        {
          "id": "mt6een1",
          "author": "saltil",
          "body": "Exactly, I have pain in organs all the time, feel terrible then buy spinach, shove as much down my gob before I think about the texture and gag it all back up again, I'd love to be able to just easily eat it, I'd love if meal times felt fun and enjoyable like it does for others, it just isn't the case. Crazy to actually believe someone wants to feel this pain, or fear, I wish I was picky, I wish I had that freedom.",
          "created_utc": 1747684274.0
        }
      ]
    },
    {
      "id": "msvfnjh",
      "author": "xernpostz",
      "body": "LOL the absolute perfect analogy!! and i lived it, too! like i said, when i was a kid i starved myself. i didn't give a fuck!! if force feeding worked, then it wouldn't be considered an eating disorder!",
      "created_utc": 1747524605.0,
      "score": 4,
      "context": [
        {
          "id": "msv96lm",
          "author": "MultiFandomShipperr",
          "body": ">Introduce complete hunger to beat it\n\nBuddy boy, a lot of us have experienced complete hunger. Starving isn't going to make my body accept unsafe foods",
          "created_utc": 1747522307.0
        },
        {
          "id": "msvccz4",
          "author": "heartoffiction",
          "body": "My partner the other week was like “well you’d eat xyz if you were starving on a deserted island” and I was like “no I wouldn’t that’s literally the entire problem” and now he gets it 😂",
          "created_utc": 1747523433.0
        }
      ]
    },
    {
      "id": "msvt2e5",
      "author": "angel_of_satan",
      "body": "i feel you. the best thing to do is let go of the frustration, don't engage with people who have no intention of actually understanding. those people are a dime a dozen and you will talk yourself hoarse trying to genuinely educate people who are perfectly comfortable in their ignorance. just block or ignore those people and focus on the people who do understand. its easier said than done, for sure, but i have had SO much peace of mind since I stopped engaging in bad-faith arguments.",
      "created_utc": 1747529840.0,
      "score": 2,
      "context": [
        {
          "id": "msvrtzz",
          "author": "angel_of_satan",
          "body": "i have genuinely given up trying to reason with people who insist ARFID is a choice. if they seriously think we CHOOSE to live like this w all our struggles, nothing I can say will change their mind. doesn't even matter how many scientific studies you show them, they will INSIST you can just \"push through\" if you try hard enough. they simply lack empathy for ppl they don't understand, even if they don't wanna admit that.",
          "created_utc": 1747529343.0
        },
        {
          "id": "msvsnca",
          "author": "xernpostz",
          "body": "i don't understand how even after explaining that i was constantly on the verge of death as a child, that i wouldn't eat, that i was seen as a medical anomaly, they still do not believe me. it's frustrating as hell. i don't understand why we can't live in a world more empathetic to those who are struggling.",
          "created_utc": 1747529672.0
        }
      ]
    },
    {
      "id": "mswyt05",
      "author": "Snugglebuggle",
      "body": "Thank you so much, and i'll keep you in mine.",
      "created_utc": 1747549509.0,
      "score": 1,
      "context": [
        {
          "id": "mswrbmb",
          "author": "Snugglebuggle",
          "body": "Your story is my story... from my birth onwards. I also barely ate as a baby and ended up being hospitalized as a toddler. They initially diagnosed me with Failure to Thrive. My family would try any means necessary to get me to eat, to keep me alive, setting timers with punishment if I didn't finish my food, not willing to make any adaptations. I used to sit at the dinner table and cry as I watched the timer count down. I can just regain my ability to eat (at all), but a stressful situation can easily put me back into starvation mode, and then it can take up to 6 months for me to slowly work my way back to eating regularly. When I was formally diagnosed with Autism in my 30s, I was also diagnosed with ARFID. Everything started to make sense. I've been called a picky eater by everyone in my life repeatedly. I now find it a highly triggering and offensive term because of the damage caused by other people's assumptions about me. \n\nCurrently 40yo, 125 lbs, 5'5\". In the last year alone, I have lost more than 50 lbs due to starvation. I have dropped below 90 lbs before. I'm so exhausted all the time from barely eating that it can be hard to get out of bed. Of all my issues, ARFID sucks the most.",
          "created_utc": 1747545215.0
        },
        {
          "id": "mswvk6v",
          "author": "xernpostz",
          "body": "oh gosh i am so sorry. it's comforting to know there was someone with my experience, but i also really feel for you having to struggle through that. i was lucky enough to have a mother who just wanted me fed. no one with this condition deserves to go through that...i hope you find peace and heal from what you've had to go through. fostering a healthy relationship with food when people are like this is so difficult. take care of yourself. you'll be in my thoughts",
          "created_utc": 1747547581.0
        }
      ]
    },
    {
      "id": "msve1cf",
      "author": "dehydratedbisexual",
      "body": "Oh god, “heal from sugar” just triggered something in me haha nutrition people on the internet are something else. At the end of the day, you just need to get yourself energy, in whatever way works. I’m glad you have this community to rely on to back you up on this kind of stuff 💚",
      "created_utc": 1747524033.0,
      "score": 2,
      "context": [
        {
          "id": "msvcv1m",
          "author": "dehydratedbisexual",
          "body": "Yikes, people can be so awful online. I’m sorry they were so rude to you. I went to look at your post and it wasn’t even that crazy! Like, how is pasta bad?? Maybe the amount is a bit large for the average person, but it’s not that crazy. Especially if you’re not eating “3 balanced meals” a day. Load up on those carbs, fuel yourself! Good on you for nourishing your body!!!",
          "created_utc": 1747523615.0
        },
        {
          "id": "msvdk66",
          "author": "xernpostz",
          "body": "i had to educate someone who was throwing out weird buzz words (keto, eat meat it'll help your body \"heal from sugar\", etc) because they have no idea how macros work. like seriously, people assume i have no idea how nutrition works just because i have an eating disorder. ffs!",
          "created_utc": 1747523865.0
        }
      ]
    },
    {
      "id": "mt16c27",
      "author": "Rinny-ThePooh",
      "body": "Literally. The only blueberry brand I like is 8 dollars for a quart. A QUART. Like are you serious right now?? I legit started a bunch of seedlings from the strains I can tolerate and I’m gonna grow my own. I cannot afford all of this 😭",
      "created_utc": 1747609144.0,
      "score": 1,
      "context": [
        {
          "id": "mt128dd",
          "author": "Rinny-ThePooh",
          "body": "I recently started eating “healthy” foods (what I can tolerate so mostly fruits veggies etc) and honestly.. I wanna go back. My bills are out the ass. It’s so much more expensive when I can’t eat half the fruit in the container or have to cut out half of my potato.",
          "created_utc": 1747607651.0
        },
        {
          "id": "mt12s8f",
          "author": "xernpostz",
          "body": "the economy is shit. eggs were a safe food for me until the prices blew through the roof. 15$ for a carton of fucking eggs? are you kidding?",
          "created_utc": 1747607852.0
        }
      ]
    },
    {
      "id": "mt9dznz",
      "author": "saltil",
      "body": "Yeah that's the exact same for me, they get stuck in teeth way more aswell and on gums, I can be eating blueberries as soon as the skin is stuck to the top of my mouth I start gagging. Smoothies upset my stomach like crazy too idk why",
      "created_utc": 1747727204.0,
      "score": 2,
      "context": [
        {
          "id": "msrsyzm",
          "author": "CalamityWof",
          "body": "Dude, its wild how folks just think its pickyness. I'd give anything to eat nutritional stuff like I should be and not worry about supplements and stuff.",
          "created_utc": 1747477274.0
        },
        {
          "id": "mt6een1",
          "author": "saltil",
          "body": "Exactly, I have pain in organs all the time, feel terrible then buy spinach, shove as much down my gob before I think about the texture and gag it all back up again, I'd love to be able to just easily eat it, I'd love if meal times felt fun and enjoyable like it does for others, it just isn't the case. Crazy to actually believe someone wants to feel this pain, or fear, I wish I was picky, I wish I had that freedom.",
          "created_utc": 1747684274.0
        },
        {
          "id": "mt6ujzh",
          "author": "CalamityWof",
          "body": "I love the taste of some fruits or vegetables. The texture, however, in any form they are make me gag though. Its a fight to get even smoothies down which I really wish it wasnt :/",
          "created_utc": 1747689083.0
        }
      ]
    },
    {
      "id": "msvea42",
      "author": "xernpostz",
      "body": "thanks mate. i love how kind it is here. everyone is incredibly supportive and ive missed out on that for most of my life. im glad i have people to turn to",
      "created_utc": 1747524120.0,
      "score": 2,
      "context": [
        {
          "id": "msvcv1m",
          "author": "dehydratedbisexual",
          "body": "Yikes, people can be so awful online. I’m sorry they were so rude to you. I went to look at your post and it wasn’t even that crazy! Like, how is pasta bad?? Maybe the amount is a bit large for the average person, but it’s not that crazy. Especially if you’re not eating “3 balanced meals” a day. Load up on those carbs, fuel yourself! Good on you for nourishing your body!!!",
          "created_utc": 1747523615.0
        },
        {
          "id": "msvdk66",
          "author": "xernpostz",
          "body": "i had to educate someone who was throwing out weird buzz words (keto, eat meat it'll help your body \"heal from sugar\", etc) because they have no idea how macros work. like seriously, people assume i have no idea how nutrition works just because i have an eating disorder. ffs!",
          "created_utc": 1747523865.0
        },
        {
          "id": "msve1cf",
          "author": "dehydratedbisexual",
          "body": "Oh god, “heal from sugar” just triggered something in me haha nutrition people on the internet are something else. At the end of the day, you just need to get yourself energy, in whatever way works. I’m glad you have this community to rely on to back you up on this kind of stuff 💚",
          "created_utc": 1747524033.0
        }
      ]
    }
  ]
}