{
  "id": "1kw971p",
  "subreddit": "ARFID",
  "author": "obviously_throwaway6",
  "created_utc": 1748303370.0,
  "title": "Fuck it. It's too hard. I'm done",
  "selftext": "I'm done. It's too hard to eat. It's too hard ***to eat***. How is that fair? I can't eat a goddamn apple. It's an ***apple***, man. It's good for you. It's a fucking apple. Have I lost my mind? Why can't I eat a goddamn apple? There's no bugs in it. It's not poisonous. It's not even that ***weirdly textured***. I even ***like*** how it tastes!!!!\n\nI'm just done. No more eating. No more problems.\n\nEdit: I appreciate everything you guys have said. I ate some toast. I'll be fine.",
  "url": "https://www.reddit.com/r/ARFID/comments/1kw971p/fuck_it_its_too_hard_im_done/",
  "score": 125,
  "num_comments": 50,
  "comments": [
    {
      "id": "mufhvik",
      "author": "gir1_from_the_sea",
      "body": "Please you have to eat something… anything! I know, I know it isn’t fair, it sucks. It’s hard. And it shouldn’t be this way. But if you ignore it, you will slowly die of hunger, and that shit is painful. At least drink some water… there has to be something other than an apple… maybe even just bread? Or chips of some sort? I get it. It’s really fucking hard. But we have to stick together. Even if you don’t know me, I care about you. I don’t want anyone here to die because of this condition. We have to work together to manage it everyday.",
      "created_utc": 1748303707.0,
      "score": 39,
      "context": []
    },
    {
      "id": "mufnv8k",
      "author": "terpleymcterpleson",
      "body": "Hi I'm going to jump on this post because this is the most relatable one so far. I'm just learning about Afrid. I feel like I'm being overdramatic at times but it truly has become impossible to eat. I'm down over 50 lbs and This started about 6 months ago and has progressively gotten worse. I thought this was something you developed younger. I also didn't understand that you could actually like the taste of the food but can't eat it because of the way it feels to you. When you said that in your post it made me feel so much better (in the weirdest way) because there are foods I love the taste of but I just can't do it. I thought because I liked the taste of some of the foods it couldn't be Afrid. I feel like I'm slowly suffering in silence because I don't really even understand it and those around me don't know what it is. My stomach is in pain all the time and I make myself upset because I really want to eat. Today was kind of the breaking point when I felt like I couldn't stand up straight because my belly hurt. Any advice? 😭\n.",
      "created_utc": 1748305915.0,
      "score": 19,
      "context": []
    },
    {
      "id": "mufks0g",
      "author": "Deep_Willingness6071",
      "body": "Can you try apple sauce or apple purée instead? \nI know it’s incredibly frustrating to lose another safe food or to even continue the “chore” of eating at times, but you have to keep going. Go on a liquid diet or get a feeding tube. Every day will not be a loss or a flare up, it will pass even if it doesn’t feel that way now.",
      "created_utc": 1748304778.0,
      "score": 6,
      "context": []
    },
    {
      "id": "mufl4dz",
      "author": "caldus_x",
      "body": "I’m sorry things are heavy right now! Please show yourself so much compassion. Try not to dismiss your frustrations by saying “it’s just an apple”. Even if it might be true, you have a disorder that makes eating the apple 10x harder. Your body is doing what it thinks it needs to do to stay safe. Be kind to yourself and show yourself love—it’s really hard and you’re doing your best. Hope things feel lighter for you 🩷",
      "created_utc": 1748304903.0,
      "score": 7,
      "context": []
    },
    {
      "id": "mufxm08",
      "author": "teddy0967",
      "body": "I’m in the same boat as you. I’m petrified to even drink milk. Or eat an apple. Or eat a damn chicken nugget! Which is my favorite food!!!’\n\nIt’s incredibly hard but you’re not alone !!",
      "created_utc": 1748309474.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mufwzuv",
      "author": "QuixoticRuin",
      "body": "Hey friend -- could you try eating the apple in thin slices similar to ramen?  Maybe julienne it, and eat it with chopsticks?  I just don't know, but maybe that could work? \n\nIf you give it a go, make sure you try when you're well rested and have the mental bandwidth to try.\n\nI'm so proud of you for making this post.  Thanks for knowing you have to try even if right now it feels like you don't want to.  Just breathe.\n\nI've been having cramps from lack of potassium, so I've been  trying to eat a banana, and I'm going to go try right now in solidity with you, OP.  \n\nYou aren't fighting alone.  We're all rooting for you.",
      "created_utc": 1748309252.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mug6wun",
      "author": "Environmental-Cat942",
      "body": "NutraOrganics makes a “veggie hero” powder, a hidden veggie powder specifically designed for picky eaters. Im gonna make jello shots with it bc im too scared to put it on my food (but i wont waste vodka lol) and at the end of the day, its only one bite worth & i can force that. \n\nits a way to get nutrients, and takes a bit of the guilt away of only eating “junk food” all the time",
      "created_utc": 1748312872.0,
      "score": 4,
      "context": []
    },
    {
      "id": "muh8ufz",
      "author": "noivern_plus_cats",
      "body": "I get in this mood a lot too tbh. Whenever there's a food I don't really like but don't hate I just go \"ehhhhhh\" and eat a bit and then finish. Just three or four bites and I go. It sucks because I would like to eat more, and it's not even that I hate the food because I don't! I just don't feel like eating more than I need to not feel hungry. I'd rather eat my safe foods (mac and cheese/grilled cheese) instead of eating some of these meals because I just don't want to eat some of them. \n\nMy body is hungry! I should eat! But my body also doesn't feel motivated to eat anything. It sucks so much",
      "created_utc": 1748331168.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mugzp8k",
      "author": "CorrysCorner",
      "body": "Unfortunately apples are one of my worst foods and they make me nauseous for no reason at all. I’m sorry you’re struggling so hard. At least you’re not in this sinking ship alone?",
      "created_utc": 1748325902.0,
      "score": 2,
      "context": []
    },
    {
      "id": "muj9uj0",
      "author": "bakedgoudamom",
      "body": "I feel this deeply. I miss eating so much. I don’t know how or when it got so bad. I don’t see how to move forward and it’s just exhausting. Good luck.",
      "created_utc": 1748361338.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mujaedj",
      "author": "bakedgoudamom",
      "body": "I feel this deeply. I miss eating so much. I don’t know how or when it got so bad. I don’t see how to move forward and it’s just exhausting. Good luck and hopefully we both are able to eat an apple this week",
      "created_utc": 1748361491.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mujrhsn",
      "author": "Angelangepange",
      "body": "You are so right, it's not fair at all. I do not know why or how we are like this and why we struggle with something literally needed to live but I hope you can find it in you to not completely give up eating.   \nTake a break, eat your safe foods and if you can just rely on vitamins supplements for a bit until you feel ready again. You already did great by trying it.",
      "created_utc": 1748366325.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mulvplw",
      "author": "FlemFatale",
      "body": "I know this feel. I've given up. If I want a load of profiteroles for lunch, that's what I have. If I don't want anything, I don't.  \nMy mental health is far better this way, but it is also getting scary.  \nI'm lucky that my GP is trying to get me treatment, so I would say that that is your first step if you haven't done that already.  \nBe prepared to have to explain exactly what ARFID even is, though.",
      "created_utc": 1748388948.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mumuuyo",
      "author": "itmeonetwothree",
      "body": "“I ate some toast. I’ll be fine” made me smile but it’s so on point. It’s so fucking hard because our brains rely on food as nourishment. Our emotions and executive function rely on food. It’s so fucking unfair and I’m so angry sometimes that this biological necessity feels so impossible.",
      "created_utc": 1748401006.0,
      "score": 2,
      "context": []
    },
    {
      "id": "muq4lvv",
      "author": "hamster00_",
      "body": "one of the most relatable things I've ever read. the amount of times I've wished i could just simply. not eat,,,",
      "created_utc": 1748449945.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mumjlh4",
      "author": "Sure-Lecture-2542",
      "body": "Yes you can. You can eat the apple. It’s an absolute fact, whether you believe it or not. You do eat food. As evidenced by your continued existence. Obviously you’ve eaten enough food to survive every day up until today. You are capable of eating. And the only reason you haven’t already eaten the apple is because you’re thinking about it, instead of doing it. Stop thinking. You’re not going to convince yourself that it’s okay to eat by thinking harder. Don’t think about it at all. Shrug your damn shoulders and bite it and chew it and pretend like you couldn’t care less.",
      "created_utc": 1748397073.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mutsx8k",
      "author": "AccomplishedPrint465",
      "body": "I feel u. sooooooo much. I have celiac and other allergies on top of it. I literally know exactly how u feel. but “update: I ate some toast. I’ll be fine.” killled me 😂😂😭 SAME",
      "created_utc": 1748492190.0,
      "score": 1,
      "context": []
    },
    {
      "id": "muwvoba",
      "author": "Agitated-Sir8926",
      "body": "I absolutely relate to this and wanting to give up. It's so frustrating to see everyone else eat like normal when we are over here with our brains getting in the way. When i first joined this sub someone said the ARFID motto is \"any food is good food\". If you're worried about health I've found adding a multivitamin has helped me personally.",
      "created_utc": 1748537585.0,
      "score": 1,
      "context": []
    },
    {
      "id": "muzu738",
      "author": "JoJoShoo",
      "body": "I can only eat an apple if it’s cut in bite size pieces.  Will not bite into one!  It’s frustrating.  I feel ya!!!",
      "created_utc": 1748570144.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mwfra78",
      "author": "shitducks",
      "body": "this the realest shit i ever heard",
      "created_utc": 1749269249.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mzgsgti",
      "author": "Emmabebe",
      "body": "i think apples are just evil because they make me inexplicably nauseous too. like taste/texture isnt that bad but it happens anyways consistently.",
      "created_utc": 1750744374.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mufiave",
      "author": "obviously_throwaway6",
      "body": "I'm just so sick of trying, man. I've eaten nothing but ramen noodles for like a month. Maybe two. And before that I just ate peanut butter sandwiches for like six months. I'm gonna be fucking sick istg. My stomach hurts so bad all the time.\n\nThis isnt even about the apple anymore. But God if I could eat that fucking apple my life would be perfect",
      "created_utc": 1748303862.0,
      "score": 28,
      "context": [
        {
          "id": "mufhvik",
          "author": "gir1_from_the_sea",
          "body": "Please you have to eat something… anything! I know, I know it isn’t fair, it sucks. It’s hard. And it shouldn’t be this way. But if you ignore it, you will slowly die of hunger, and that shit is painful. At least drink some water… there has to be something other than an apple… maybe even just bread? Or chips of some sort? I get it. It’s really fucking hard. But we have to stick together. Even if you don’t know me, I care about you. I don’t want anyone here to die because of this condition. We have to work together to manage it everyday.",
          "created_utc": 1748303707.0
        }
      ]
    },
    {
      "id": "mufosa3",
      "author": "obviously_throwaway6",
      "body": "🫂🫂🫂🫂🫂🫂🫂🫂🫂🫂🫂🫂🫂🫂🫂🫂🫂🫂🫂🫂 and a dinosaur too 🦕\n\nThrow a tantrum with me. It helps. Don't do what I'm doing and stop eating though. That won't help. I don't know why I'm doing it. Lmao\n\nHow I've gotten this far is just a lot of the same thing. A lot of peanut butter and a lot of ramen. I also had Soylent for a while. I don't know whether it actually helped but you know. I drank them anyway \n\nDown 30 lbs myself in the last few months.\n\nI think when it ***does*** work for me it's because I just constantly ***(constantly)*** remind myself  that there are no bugs or poisons in my mouth while I'm chewing and make triple sure before I bite that the texture is going to be predictable",
      "created_utc": 1748306247.0,
      "score": 14,
      "context": [
        {
          "id": "mufnv8k",
          "author": "terpleymcterpleson",
          "body": "Hi I'm going to jump on this post because this is the most relatable one so far. I'm just learning about Afrid. I feel like I'm being overdramatic at times but it truly has become impossible to eat. I'm down over 50 lbs and This started about 6 months ago and has progressively gotten worse. I thought this was something you developed younger. I also didn't understand that you could actually like the taste of the food but can't eat it because of the way it feels to you. When you said that in your post it made me feel so much better (in the weirdest way) because there are foods I love the taste of but I just can't do it. I thought because I liked the taste of some of the foods it couldn't be Afrid. I feel like I'm slowly suffering in silence because I don't really even understand it and those around me don't know what it is. My stomach is in pain all the time and I make myself upset because I really want to eat. Today was kind of the breaking point when I felt like I couldn't stand up straight because my belly hurt. Any advice? 😭\n.",
          "created_utc": 1748305915.0
        }
      ]
    },
    {
      "id": "mufl7wu",
      "author": "obviously_throwaway6",
      "body": "I'll eat. I have to eventually. The alternative is death. That would suck. I am going to stall as long as physically possible though. Or just throw a tantrum on the internet. But probably both.",
      "created_utc": 1748304939.0,
      "score": 13,
      "context": [
        {
          "id": "mufks0g",
          "author": "Deep_Willingness6071",
          "body": "Can you try apple sauce or apple purée instead? \nI know it’s incredibly frustrating to lose another safe food or to even continue the “chore” of eating at times, but you have to keep going. Go on a liquid diet or get a feeding tube. Every day will not be a loss or a flare up, it will pass even if it doesn’t feel that way now.",
          "created_utc": 1748304778.0
        }
      ]
    },
    {
      "id": "mvgygu1",
      "author": "ana_meadows",
      "body": "The diet tech at my residential treatment suggested covering the apple with peanut butter or Nutella to mask the apple texture. Hope it helps",
      "created_utc": 1748807835.0,
      "score": 2,
      "context": [
        {
          "id": "mufks0g",
          "author": "Deep_Willingness6071",
          "body": "Can you try apple sauce or apple purée instead? \nI know it’s incredibly frustrating to lose another safe food or to even continue the “chore” of eating at times, but you have to keep going. Go on a liquid diet or get a feeding tube. Every day will not be a loss or a flare up, it will pass even if it doesn’t feel that way now.",
          "created_utc": 1748304778.0
        }
      ]
    },
    {
      "id": "muflvqr",
      "author": "obviously_throwaway6",
      "body": "Can you imagine, though? God, what a dream. To be able to just ***eat an apple*** and be cool with it. Think about how much your (my) stomach wouldn't hurt now that you (me) were getting proper NUTRIENTS. \n\nIstfg I'm losing my mind.",
      "created_utc": 1748305180.0,
      "score": 5,
      "context": [
        {
          "id": "mufl4dz",
          "author": "caldus_x",
          "body": "I’m sorry things are heavy right now! Please show yourself so much compassion. Try not to dismiss your frustrations by saying “it’s just an apple”. Even if it might be true, you have a disorder that makes eating the apple 10x harder. Your body is doing what it thinks it needs to do to stay safe. Be kind to yourself and show yourself love—it’s really hard and you’re doing your best. Hope things feel lighter for you 🩷",
          "created_utc": 1748304903.0
        }
      ]
    },
    {
      "id": "mufzeni",
      "author": "obviously_throwaway6",
      "body": "Man, like, what's the deal with that? It's ***food we like***. Ffs man. You know what I mean? \n\nYeah. You get it. This guy gets it. Or girl. Whatever. I'm a girl.",
      "created_utc": 1748310117.0,
      "score": 8,
      "context": [
        {
          "id": "mufxm08",
          "author": "teddy0967",
          "body": "I’m in the same boat as you. I’m petrified to even drink milk. Or eat an apple. Or eat a damn chicken nugget! Which is my favorite food!!!’\n\nIt’s incredibly hard but you’re not alone !!",
          "created_utc": 1748309474.0
        }
      ]
    },
    {
      "id": "mufzyil",
      "author": "obviously_throwaway6",
      "body": "The apple unfortunately is just hypothetical and I don't have a physical apple I could confront and destroy. Not to say I can't eat apples. I can't. I very much can't. And it haunts me. Obviously. But in this particular instance, there was no actual apple. Just the memory of every apple I've never eaten. Fucking apples.",
      "created_utc": 1748310315.0,
      "score": 5,
      "context": [
        {
          "id": "mufwzuv",
          "author": "QuixoticRuin",
          "body": "Hey friend -- could you try eating the apple in thin slices similar to ramen?  Maybe julienne it, and eat it with chopsticks?  I just don't know, but maybe that could work? \n\nIf you give it a go, make sure you try when you're well rested and have the mental bandwidth to try.\n\nI'm so proud of you for making this post.  Thanks for knowing you have to try even if right now it feels like you don't want to.  Just breathe.\n\nI've been having cramps from lack of potassium, so I've been  trying to eat a banana, and I'm going to go try right now in solidity with you, OP.  \n\nYou aren't fighting alone.  We're all rooting for you.",
          "created_utc": 1748309252.0
        }
      ]
    },
    {
      "id": "mug733q",
      "author": "obviously_throwaway6",
      "body": "Noted. I'll take a look",
      "created_utc": 1748312936.0,
      "score": 4,
      "context": [
        {
          "id": "mug6wun",
          "author": "Environmental-Cat942",
          "body": "NutraOrganics makes a “veggie hero” powder, a hidden veggie powder specifically designed for picky eaters. Im gonna make jello shots with it bc im too scared to put it on my food (but i wont waste vodka lol) and at the end of the day, its only one bite worth & i can force that. \n\nits a way to get nutrients, and takes a bit of the guilt away of only eating “junk food” all the time",
          "created_utc": 1748312872.0
        }
      ]
    },
    {
      "id": "mufif6d",
      "author": "gir1_from_the_sea",
      "body": "You can do it! I know it’s hard, but just go nice and slow, deep breaths. I’m here for you.",
      "created_utc": 1748303907.0,
      "score": 11,
      "context": [
        {
          "id": "mufhvik",
          "author": "gir1_from_the_sea",
          "body": "Please you have to eat something… anything! I know, I know it isn’t fair, it sucks. It’s hard. And it shouldn’t be this way. But if you ignore it, you will slowly die of hunger, and that shit is painful. At least drink some water… there has to be something other than an apple… maybe even just bread? Or chips of some sort? I get it. It’s really fucking hard. But we have to stick together. Even if you don’t know me, I care about you. I don’t want anyone here to die because of this condition. We have to work together to manage it everyday.",
          "created_utc": 1748303707.0
        },
        {
          "id": "mufiave",
          "author": "obviously_throwaway6",
          "body": "I'm just so sick of trying, man. I've eaten nothing but ramen noodles for like a month. Maybe two. And before that I just ate peanut butter sandwiches for like six months. I'm gonna be fucking sick istg. My stomach hurts so bad all the time.\n\nThis isnt even about the apple anymore. But God if I could eat that fucking apple my life would be perfect",
          "created_utc": 1748303862.0
        }
      ]
    },
    {
      "id": "muggir2",
      "author": "makinggrace",
      "body": "It is actually really hard to be reasonable about ARFID and try to manage it and try new foods when your body is hungry/missing nutrients. It's the same as everything else: whenever there's stress in one aspect of a system, the rest goes to hell unless it compensates. Compensating is an exhausting practice. At least, that's my experience of it.\n\nIf you can drink Soylent, heck yes! That counts. That stuff has calories and vitamins and all the things. There are other drinkable options but if you can handle that one, start there. Just adding more calories on a daily basis helps if you have been short.\n\nI won't lie to you. Your safe food list is short. Too short. And apples are delicious. (Truth: I only willingly eat fuji apples. They must be cut with my special apple cutter which makes relatively thin slices. I cannot manage to eat thick slices of anything. If the apple isn't ripe enough it's not gonna happen.)\n\nWould you like to hear about how I feel about peanut butter? You can have mine. :)\n\nI digress. You're not alone. And you can do this.\n\n[This book about ARFID is decent--a lot of us have found it helpful.](https://a.co/d/fpFQt6W)",
      "created_utc": 1748316627.0,
      "score": 6,
      "context": [
        {
          "id": "mufnv8k",
          "author": "terpleymcterpleson",
          "body": "Hi I'm going to jump on this post because this is the most relatable one so far. I'm just learning about Afrid. I feel like I'm being overdramatic at times but it truly has become impossible to eat. I'm down over 50 lbs and This started about 6 months ago and has progressively gotten worse. I thought this was something you developed younger. I also didn't understand that you could actually like the taste of the food but can't eat it because of the way it feels to you. When you said that in your post it made me feel so much better (in the weirdest way) because there are foods I love the taste of but I just can't do it. I thought because I liked the taste of some of the foods it couldn't be Afrid. I feel like I'm slowly suffering in silence because I don't really even understand it and those around me don't know what it is. My stomach is in pain all the time and I make myself upset because I really want to eat. Today was kind of the breaking point when I felt like I couldn't stand up straight because my belly hurt. Any advice? 😭\n.",
          "created_utc": 1748305915.0
        },
        {
          "id": "mufosa3",
          "author": "obviously_throwaway6",
          "body": "🫂🫂🫂🫂🫂🫂🫂🫂🫂🫂🫂🫂🫂🫂🫂🫂🫂🫂🫂🫂 and a dinosaur too 🦕\n\nThrow a tantrum with me. It helps. Don't do what I'm doing and stop eating though. That won't help. I don't know why I'm doing it. Lmao\n\nHow I've gotten this far is just a lot of the same thing. A lot of peanut butter and a lot of ramen. I also had Soylent for a while. I don't know whether it actually helped but you know. I drank them anyway \n\nDown 30 lbs myself in the last few months.\n\nI think when it ***does*** work for me it's because I just constantly ***(constantly)*** remind myself  that there are no bugs or poisons in my mouth while I'm chewing and make triple sure before I bite that the texture is going to be predictable",
          "created_utc": 1748306247.0
        }
      ]
    },
    {
      "id": "muh8q9j",
      "author": "nonbog",
      "body": "Hey! I just saw this and your other post. Have you been to a doctor about these issues?\n\nI think it’s possible you have severe anxiety, or maybe even OCD. I get you. I have had some very similar issues to you in the past.\n\nIf you haven’t sought help so far, would it be possible to? I think therapy could be extremely helpful for you! It really helped me",
      "created_utc": 1748331097.0,
      "score": 4,
      "context": [
        {
          "id": "mufnv8k",
          "author": "terpleymcterpleson",
          "body": "Hi I'm going to jump on this post because this is the most relatable one so far. I'm just learning about Afrid. I feel like I'm being overdramatic at times but it truly has become impossible to eat. I'm down over 50 lbs and This started about 6 months ago and has progressively gotten worse. I thought this was something you developed younger. I also didn't understand that you could actually like the taste of the food but can't eat it because of the way it feels to you. When you said that in your post it made me feel so much better (in the weirdest way) because there are foods I love the taste of but I just can't do it. I thought because I liked the taste of some of the foods it couldn't be Afrid. I feel like I'm slowly suffering in silence because I don't really even understand it and those around me don't know what it is. My stomach is in pain all the time and I make myself upset because I really want to eat. Today was kind of the breaking point when I felt like I couldn't stand up straight because my belly hurt. Any advice? 😭\n.",
          "created_utc": 1748305915.0
        },
        {
          "id": "mufosa3",
          "author": "obviously_throwaway6",
          "body": "🫂🫂🫂🫂🫂🫂🫂🫂🫂🫂🫂🫂🫂🫂🫂🫂🫂🫂🫂🫂 and a dinosaur too 🦕\n\nThrow a tantrum with me. It helps. Don't do what I'm doing and stop eating though. That won't help. I don't know why I'm doing it. Lmao\n\nHow I've gotten this far is just a lot of the same thing. A lot of peanut butter and a lot of ramen. I also had Soylent for a while. I don't know whether it actually helped but you know. I drank them anyway \n\nDown 30 lbs myself in the last few months.\n\nI think when it ***does*** work for me it's because I just constantly ***(constantly)*** remind myself  that there are no bugs or poisons in my mouth while I'm chewing and make triple sure before I bite that the texture is going to be predictable",
          "created_utc": 1748306247.0
        }
      ]
    },
    {
      "id": "mufmm5j",
      "author": "caldus_x",
      "body": "I know it’s so frustrating!! I deal with the same thoughts. When I zoom out, it can feel so silly! But your struggle is very very real—both things can be true!! I hope one day you’re able to eat that apple! (I recommend red delicious but that’s just me)",
      "created_utc": 1748305449.0,
      "score": 3,
      "context": [
        {
          "id": "mufl4dz",
          "author": "caldus_x",
          "body": "I’m sorry things are heavy right now! Please show yourself so much compassion. Try not to dismiss your frustrations by saying “it’s just an apple”. Even if it might be true, you have a disorder that makes eating the apple 10x harder. Your body is doing what it thinks it needs to do to stay safe. Be kind to yourself and show yourself love—it’s really hard and you’re doing your best. Hope things feel lighter for you 🩷",
          "created_utc": 1748304903.0
        },
        {
          "id": "muflvqr",
          "author": "obviously_throwaway6",
          "body": "Can you imagine, though? God, what a dream. To be able to just ***eat an apple*** and be cool with it. Think about how much your (my) stomach wouldn't hurt now that you (me) were getting proper NUTRIENTS. \n\nIstfg I'm losing my mind.",
          "created_utc": 1748305180.0
        }
      ]
    },
    {
      "id": "mwe8lvo",
      "author": "teddy0967",
      "body": "I fear food allergies, so that’s what prevents me 😭",
      "created_utc": 1749248483.0,
      "score": 1,
      "context": [
        {
          "id": "mufxm08",
          "author": "teddy0967",
          "body": "I’m in the same boat as you. I’m petrified to even drink milk. Or eat an apple. Or eat a damn chicken nugget! Which is my favorite food!!!’\n\nIt’s incredibly hard but you’re not alone !!",
          "created_utc": 1748309474.0
        },
        {
          "id": "mufzeni",
          "author": "obviously_throwaway6",
          "body": "Man, like, what's the deal with that? It's ***food we like***. Ffs man. You know what I mean? \n\nYeah. You get it. This guy gets it. Or girl. Whatever. I'm a girl.",
          "created_utc": 1748310117.0
        }
      ]
    },
    {
      "id": "muz34t2",
      "author": "QuixoticRuin",
      "body": "I fucking hate apples myself, but I did eat almost half a banana for you that day in solidarity.  \n\nI hope you keep fighting, friend.  I'm fighting that same fight alongside you, and you're not alone.",
      "created_utc": 1748560927.0,
      "score": 1,
      "context": [
        {
          "id": "mufwzuv",
          "author": "QuixoticRuin",
          "body": "Hey friend -- could you try eating the apple in thin slices similar to ramen?  Maybe julienne it, and eat it with chopsticks?  I just don't know, but maybe that could work? \n\nIf you give it a go, make sure you try when you're well rested and have the mental bandwidth to try.\n\nI'm so proud of you for making this post.  Thanks for knowing you have to try even if right now it feels like you don't want to.  Just breathe.\n\nI've been having cramps from lack of potassium, so I've been  trying to eat a banana, and I'm going to go try right now in solidity with you, OP.  \n\nYou aren't fighting alone.  We're all rooting for you.",
          "created_utc": 1748309252.0
        },
        {
          "id": "mufzyil",
          "author": "obviously_throwaway6",
          "body": "The apple unfortunately is just hypothetical and I don't have a physical apple I could confront and destroy. Not to say I can't eat apples. I can't. I very much can't. And it haunts me. Obviously. But in this particular instance, there was no actual apple. Just the memory of every apple I've never eaten. Fucking apples.",
          "created_utc": 1748310315.0
        }
      ]
    },
    {
      "id": "mugzrkb",
      "author": "CorrysCorner",
      "body": "Enof powder also exists",
      "created_utc": 1748325937.0,
      "score": 1,
      "context": [
        {
          "id": "mug6wun",
          "author": "Environmental-Cat942",
          "body": "NutraOrganics makes a “veggie hero” powder, a hidden veggie powder specifically designed for picky eaters. Im gonna make jello shots with it bc im too scared to put it on my food (but i wont waste vodka lol) and at the end of the day, its only one bite worth & i can force that. \n\nits a way to get nutrients, and takes a bit of the guilt away of only eating “junk food” all the time",
          "created_utc": 1748312872.0
        },
        {
          "id": "mug733q",
          "author": "obviously_throwaway6",
          "body": "Noted. I'll take a look",
          "created_utc": 1748312936.0
        }
      ]
    },
    {
      "id": "mufil73",
      "author": "obviously_throwaway6",
      "body": "I'm so sick of ramen noodles and peanut butter and stomach aches though. I just want to be done with this shit.",
      "created_utc": 1748303969.0,
      "score": 8,
      "context": [
        {
          "id": "mufhvik",
          "author": "gir1_from_the_sea",
          "body": "Please you have to eat something… anything! I know, I know it isn’t fair, it sucks. It’s hard. And it shouldn’t be this way. But if you ignore it, you will slowly die of hunger, and that shit is painful. At least drink some water… there has to be something other than an apple… maybe even just bread? Or chips of some sort? I get it. It’s really fucking hard. But we have to stick together. Even if you don’t know me, I care about you. I don’t want anyone here to die because of this condition. We have to work together to manage it everyday.",
          "created_utc": 1748303707.0
        },
        {
          "id": "mufiave",
          "author": "obviously_throwaway6",
          "body": "I'm just so sick of trying, man. I've eaten nothing but ramen noodles for like a month. Maybe two. And before that I just ate peanut butter sandwiches for like six months. I'm gonna be fucking sick istg. My stomach hurts so bad all the time.\n\nThis isnt even about the apple anymore. But God if I could eat that fucking apple my life would be perfect",
          "created_utc": 1748303862.0
        },
        {
          "id": "mufif6d",
          "author": "gir1_from_the_sea",
          "body": "You can do it! I know it’s hard, but just go nice and slow, deep breaths. I’m here for you.",
          "created_utc": 1748303907.0
        }
      ]
    },
    {
      "id": "mukvys8",
      "author": "obviously_throwaway6",
      "body": "I oscillate between seeing my OCD fear of bugs as \"not a big deal and I can handle it\" and \"Jesus fucking Christ how have I been operating like this?\" Seeing someone about it is something I really should do but I'm honestly just... I don't know. Maybe I'm afraid of what they're going to make me do.",
      "created_utc": 1748377759.0,
      "score": 3,
      "context": [
        {
          "id": "mufnv8k",
          "author": "terpleymcterpleson",
          "body": "Hi I'm going to jump on this post because this is the most relatable one so far. I'm just learning about Afrid. I feel like I'm being overdramatic at times but it truly has become impossible to eat. I'm down over 50 lbs and This started about 6 months ago and has progressively gotten worse. I thought this was something you developed younger. I also didn't understand that you could actually like the taste of the food but can't eat it because of the way it feels to you. When you said that in your post it made me feel so much better (in the weirdest way) because there are foods I love the taste of but I just can't do it. I thought because I liked the taste of some of the foods it couldn't be Afrid. I feel like I'm slowly suffering in silence because I don't really even understand it and those around me don't know what it is. My stomach is in pain all the time and I make myself upset because I really want to eat. Today was kind of the breaking point when I felt like I couldn't stand up straight because my belly hurt. Any advice? 😭\n.",
          "created_utc": 1748305915.0
        },
        {
          "id": "mufosa3",
          "author": "obviously_throwaway6",
          "body": "🫂🫂🫂🫂🫂🫂🫂🫂🫂🫂🫂🫂🫂🫂🫂🫂🫂🫂🫂🫂 and a dinosaur too 🦕\n\nThrow a tantrum with me. It helps. Don't do what I'm doing and stop eating though. That won't help. I don't know why I'm doing it. Lmao\n\nHow I've gotten this far is just a lot of the same thing. A lot of peanut butter and a lot of ramen. I also had Soylent for a while. I don't know whether it actually helped but you know. I drank them anyway \n\nDown 30 lbs myself in the last few months.\n\nI think when it ***does*** work for me it's because I just constantly ***(constantly)*** remind myself  that there are no bugs or poisons in my mouth while I'm chewing and make triple sure before I bite that the texture is going to be predictable",
          "created_utc": 1748306247.0
        },
        {
          "id": "muh8q9j",
          "author": "nonbog",
          "body": "Hey! I just saw this and your other post. Have you been to a doctor about these issues?\n\nI think it’s possible you have severe anxiety, or maybe even OCD. I get you. I have had some very similar issues to you in the past.\n\nIf you haven’t sought help so far, would it be possible to? I think therapy could be extremely helpful for you! It really helped me",
          "created_utc": 1748331097.0
        }
      ]
    },
    {
      "id": "muz6kzz",
      "author": "obviously_throwaway6",
      "body": "Well, then you may the happy to know that I've resumed eating. I hate it and it's terrible, but I'm eating breakfast and dinner. So I suppose we truly are in this together.",
      "created_utc": 1748562066.0,
      "score": 2,
      "context": [
        {
          "id": "mufwzuv",
          "author": "QuixoticRuin",
          "body": "Hey friend -- could you try eating the apple in thin slices similar to ramen?  Maybe julienne it, and eat it with chopsticks?  I just don't know, but maybe that could work? \n\nIf you give it a go, make sure you try when you're well rested and have the mental bandwidth to try.\n\nI'm so proud of you for making this post.  Thanks for knowing you have to try even if right now it feels like you don't want to.  Just breathe.\n\nI've been having cramps from lack of potassium, so I've been  trying to eat a banana, and I'm going to go try right now in solidity with you, OP.  \n\nYou aren't fighting alone.  We're all rooting for you.",
          "created_utc": 1748309252.0
        },
        {
          "id": "mufzyil",
          "author": "obviously_throwaway6",
          "body": "The apple unfortunately is just hypothetical and I don't have a physical apple I could confront and destroy. Not to say I can't eat apples. I can't. I very much can't. And it haunts me. Obviously. But in this particular instance, there was no actual apple. Just the memory of every apple I've never eaten. Fucking apples.",
          "created_utc": 1748310315.0
        },
        {
          "id": "muz34t2",
          "author": "QuixoticRuin",
          "body": "I fucking hate apples myself, but I did eat almost half a banana for you that day in solidarity.  \n\nI hope you keep fighting, friend.  I'm fighting that same fight alongside you, and you're not alone.",
          "created_utc": 1748560927.0
        }
      ]
    },
    {
      "id": "mufj44m",
      "author": "gir1_from_the_sea",
      "body": "I understand. In the end it is your choice to stay or go. But all I will say, do you really want to leave everything behind? I mean I don’t know your story, but you must have at least one person who cares for you, and values you. And if not, let me be that person. I know I’m just a stranger to you, but I can at least try to be something. If you don’t want ramen or peanut butter sandwiches, try to slowly eat the apple. I know it’s hard, but right now it sounds like you don’t have much of a choice. Or even just sleep. If anything.",
      "created_utc": 1748304164.0,
      "score": 6,
      "context": [
        {
          "id": "mufhvik",
          "author": "gir1_from_the_sea",
          "body": "Please you have to eat something… anything! I know, I know it isn’t fair, it sucks. It’s hard. And it shouldn’t be this way. But if you ignore it, you will slowly die of hunger, and that shit is painful. At least drink some water… there has to be something other than an apple… maybe even just bread? Or chips of some sort? I get it. It’s really fucking hard. But we have to stick together. Even if you don’t know me, I care about you. I don’t want anyone here to die because of this condition. We have to work together to manage it everyday.",
          "created_utc": 1748303707.0
        },
        {
          "id": "mufiave",
          "author": "obviously_throwaway6",
          "body": "I'm just so sick of trying, man. I've eaten nothing but ramen noodles for like a month. Maybe two. And before that I just ate peanut butter sandwiches for like six months. I'm gonna be fucking sick istg. My stomach hurts so bad all the time.\n\nThis isnt even about the apple anymore. But God if I could eat that fucking apple my life would be perfect",
          "created_utc": 1748303862.0
        },
        {
          "id": "mufif6d",
          "author": "gir1_from_the_sea",
          "body": "You can do it! I know it’s hard, but just go nice and slow, deep breaths. I’m here for you.",
          "created_utc": 1748303907.0
        },
        {
          "id": "mufil73",
          "author": "obviously_throwaway6",
          "body": "I'm so sick of ramen noodles and peanut butter and stomach aches though. I just want to be done with this shit.",
          "created_utc": 1748303969.0
        }
      ]
    },
    {
      "id": "mukywfp",
      "author": "nonbog",
      "body": "First of all I want to say I completely understand! OCD/anxiety often runs in cycles! I go periods of time where I think my fears are silly, and then suddenly I’m so terrified I literally daren’t leave the sofa and spend every waking minute researching my worries.\n\nPlease don’t be afraid of what they’re going to make you do. I don’t know what country you live in, and therefore I don’t know how accessible high-quality therapy is in your area, but a good therapist won’t make you do anything you’re not comfortable with until *you* feel ready.\n\nMostly it will revolve around tackling the thought processes that feed into these fears.\n\nI really do hope you decide to get help! You deserve to live your life as free of these fears as possible. It made an unbelievable difference to my mental health. Beforehand I was literally not functioning and now I go most days without thinking about them at all!\n\nAnxiety/OCD is extremely treatable!\n\nI wish you all the best :)",
      "created_utc": 1748378592.0,
      "score": 1,
      "context": [
        {
          "id": "mufnv8k",
          "author": "terpleymcterpleson",
          "body": "Hi I'm going to jump on this post because this is the most relatable one so far. I'm just learning about Afrid. I feel like I'm being overdramatic at times but it truly has become impossible to eat. I'm down over 50 lbs and This started about 6 months ago and has progressively gotten worse. I thought this was something you developed younger. I also didn't understand that you could actually like the taste of the food but can't eat it because of the way it feels to you. When you said that in your post it made me feel so much better (in the weirdest way) because there are foods I love the taste of but I just can't do it. I thought because I liked the taste of some of the foods it couldn't be Afrid. I feel like I'm slowly suffering in silence because I don't really even understand it and those around me don't know what it is. My stomach is in pain all the time and I make myself upset because I really want to eat. Today was kind of the breaking point when I felt like I couldn't stand up straight because my belly hurt. Any advice? 😭\n.",
          "created_utc": 1748305915.0
        },
        {
          "id": "mufosa3",
          "author": "obviously_throwaway6",
          "body": "🫂🫂🫂🫂🫂🫂🫂🫂🫂🫂🫂🫂🫂🫂🫂🫂🫂🫂🫂🫂 and a dinosaur too 🦕\n\nThrow a tantrum with me. It helps. Don't do what I'm doing and stop eating though. That won't help. I don't know why I'm doing it. Lmao\n\nHow I've gotten this far is just a lot of the same thing. A lot of peanut butter and a lot of ramen. I also had Soylent for a while. I don't know whether it actually helped but you know. I drank them anyway \n\nDown 30 lbs myself in the last few months.\n\nI think when it ***does*** work for me it's because I just constantly ***(constantly)*** remind myself  that there are no bugs or poisons in my mouth while I'm chewing and make triple sure before I bite that the texture is going to be predictable",
          "created_utc": 1748306247.0
        },
        {
          "id": "muh8q9j",
          "author": "nonbog",
          "body": "Hey! I just saw this and your other post. Have you been to a doctor about these issues?\n\nI think it’s possible you have severe anxiety, or maybe even OCD. I get you. I have had some very similar issues to you in the past.\n\nIf you haven’t sought help so far, would it be possible to? I think therapy could be extremely helpful for you! It really helped me",
          "created_utc": 1748331097.0
        },
        {
          "id": "mukvys8",
          "author": "obviously_throwaway6",
          "body": "I oscillate between seeing my OCD fear of bugs as \"not a big deal and I can handle it\" and \"Jesus fucking Christ how have I been operating like this?\" Seeing someone about it is something I really should do but I'm honestly just... I don't know. Maybe I'm afraid of what they're going to make me do.",
          "created_utc": 1748377759.0
        }
      ]
    },
    {
      "id": "muzm1dq",
      "author": "QuixoticRuin",
      "body": "Today, I only managed a couple French fries, a protein wafer thing, and a meal replacement drink.  Oh, and a protein smoothie with chocolate -- and banana.  \n\nNot much solid food today, but perhaps tomorrow.\n\nEach day, we keep fighting.  Together.",
      "created_utc": 1748567360.0,
      "score": 1,
      "context": [
        {
          "id": "mufwzuv",
          "author": "QuixoticRuin",
          "body": "Hey friend -- could you try eating the apple in thin slices similar to ramen?  Maybe julienne it, and eat it with chopsticks?  I just don't know, but maybe that could work? \n\nIf you give it a go, make sure you try when you're well rested and have the mental bandwidth to try.\n\nI'm so proud of you for making this post.  Thanks for knowing you have to try even if right now it feels like you don't want to.  Just breathe.\n\nI've been having cramps from lack of potassium, so I've been  trying to eat a banana, and I'm going to go try right now in solidity with you, OP.  \n\nYou aren't fighting alone.  We're all rooting for you.",
          "created_utc": 1748309252.0
        },
        {
          "id": "mufzyil",
          "author": "obviously_throwaway6",
          "body": "The apple unfortunately is just hypothetical and I don't have a physical apple I could confront and destroy. Not to say I can't eat apples. I can't. I very much can't. And it haunts me. Obviously. But in this particular instance, there was no actual apple. Just the memory of every apple I've never eaten. Fucking apples.",
          "created_utc": 1748310315.0
        },
        {
          "id": "muz34t2",
          "author": "QuixoticRuin",
          "body": "I fucking hate apples myself, but I did eat almost half a banana for you that day in solidarity.  \n\nI hope you keep fighting, friend.  I'm fighting that same fight alongside you, and you're not alone.",
          "created_utc": 1748560927.0
        },
        {
          "id": "muz6kzz",
          "author": "obviously_throwaway6",
          "body": "Well, then you may the happy to know that I've resumed eating. I hate it and it's terrible, but I'm eating breakfast and dinner. So I suppose we truly are in this together.",
          "created_utc": 1748562066.0
        }
      ]
    },
    {
      "id": "mufjv6n",
      "author": "obviously_throwaway6",
      "body": "I don't want to die. Ill eat. Eventually. I have to. I have no choice. But I'm going to live in my delusional fantasy world where I don't need to eat as long as physically possible first.",
      "created_utc": 1748304443.0,
      "score": 10,
      "context": [
        {
          "id": "mufhvik",
          "author": "gir1_from_the_sea",
          "body": "Please you have to eat something… anything! I know, I know it isn’t fair, it sucks. It’s hard. And it shouldn’t be this way. But if you ignore it, you will slowly die of hunger, and that shit is painful. At least drink some water… there has to be something other than an apple… maybe even just bread? Or chips of some sort? I get it. It’s really fucking hard. But we have to stick together. Even if you don’t know me, I care about you. I don’t want anyone here to die because of this condition. We have to work together to manage it everyday.",
          "created_utc": 1748303707.0
        },
        {
          "id": "mufiave",
          "author": "obviously_throwaway6",
          "body": "I'm just so sick of trying, man. I've eaten nothing but ramen noodles for like a month. Maybe two. And before that I just ate peanut butter sandwiches for like six months. I'm gonna be fucking sick istg. My stomach hurts so bad all the time.\n\nThis isnt even about the apple anymore. But God if I could eat that fucking apple my life would be perfect",
          "created_utc": 1748303862.0
        },
        {
          "id": "mufif6d",
          "author": "gir1_from_the_sea",
          "body": "You can do it! I know it’s hard, but just go nice and slow, deep breaths. I’m here for you.",
          "created_utc": 1748303907.0
        },
        {
          "id": "mufil73",
          "author": "obviously_throwaway6",
          "body": "I'm so sick of ramen noodles and peanut butter and stomach aches though. I just want to be done with this shit.",
          "created_utc": 1748303969.0
        },
        {
          "id": "mufj44m",
          "author": "gir1_from_the_sea",
          "body": "I understand. In the end it is your choice to stay or go. But all I will say, do you really want to leave everything behind? I mean I don’t know your story, but you must have at least one person who cares for you, and values you. And if not, let me be that person. I know I’m just a stranger to you, but I can at least try to be something. If you don’t want ramen or peanut butter sandwiches, try to slowly eat the apple. I know it’s hard, but right now it sounds like you don’t have much of a choice. Or even just sleep. If anything.",
          "created_utc": 1748304164.0
        }
      ]
    },
    {
      "id": "mv6dq6d",
      "author": "obviously_throwaway6",
      "body": "Ramen and five slices of bread. Om nom nom nom 🤜🤛",
      "created_utc": 1748656603.0,
      "score": 1,
      "context": [
        {
          "id": "mufwzuv",
          "author": "QuixoticRuin",
          "body": "Hey friend -- could you try eating the apple in thin slices similar to ramen?  Maybe julienne it, and eat it with chopsticks?  I just don't know, but maybe that could work? \n\nIf you give it a go, make sure you try when you're well rested and have the mental bandwidth to try.\n\nI'm so proud of you for making this post.  Thanks for knowing you have to try even if right now it feels like you don't want to.  Just breathe.\n\nI've been having cramps from lack of potassium, so I've been  trying to eat a banana, and I'm going to go try right now in solidity with you, OP.  \n\nYou aren't fighting alone.  We're all rooting for you.",
          "created_utc": 1748309252.0
        },
        {
          "id": "mufzyil",
          "author": "obviously_throwaway6",
          "body": "The apple unfortunately is just hypothetical and I don't have a physical apple I could confront and destroy. Not to say I can't eat apples. I can't. I very much can't. And it haunts me. Obviously. But in this particular instance, there was no actual apple. Just the memory of every apple I've never eaten. Fucking apples.",
          "created_utc": 1748310315.0
        },
        {
          "id": "muz34t2",
          "author": "QuixoticRuin",
          "body": "I fucking hate apples myself, but I did eat almost half a banana for you that day in solidarity.  \n\nI hope you keep fighting, friend.  I'm fighting that same fight alongside you, and you're not alone.",
          "created_utc": 1748560927.0
        },
        {
          "id": "muz6kzz",
          "author": "obviously_throwaway6",
          "body": "Well, then you may the happy to know that I've resumed eating. I hate it and it's terrible, but I'm eating breakfast and dinner. So I suppose we truly are in this together.",
          "created_utc": 1748562066.0
        },
        {
          "id": "muzm1dq",
          "author": "QuixoticRuin",
          "body": "Today, I only managed a couple French fries, a protein wafer thing, and a meal replacement drink.  Oh, and a protein smoothie with chocolate -- and banana.  \n\nNot much solid food today, but perhaps tomorrow.\n\nEach day, we keep fighting.  Together.",
          "created_utc": 1748567360.0
        }
      ]
    },
    {
      "id": "mufk0jo",
      "author": "gir1_from_the_sea",
      "body": "I do the same. Thank you for staying. I know it’s hard. Feel free to dm me if you ever need to talk or want some help, ok?",
      "created_utc": 1748304499.0,
      "score": 6,
      "context": [
        {
          "id": "mufhvik",
          "author": "gir1_from_the_sea",
          "body": "Please you have to eat something… anything! I know, I know it isn’t fair, it sucks. It’s hard. And it shouldn’t be this way. But if you ignore it, you will slowly die of hunger, and that shit is painful. At least drink some water… there has to be something other than an apple… maybe even just bread? Or chips of some sort? I get it. It’s really fucking hard. But we have to stick together. Even if you don’t know me, I care about you. I don’t want anyone here to die because of this condition. We have to work together to manage it everyday.",
          "created_utc": 1748303707.0
        },
        {
          "id": "mufiave",
          "author": "obviously_throwaway6",
          "body": "I'm just so sick of trying, man. I've eaten nothing but ramen noodles for like a month. Maybe two. And before that I just ate peanut butter sandwiches for like six months. I'm gonna be fucking sick istg. My stomach hurts so bad all the time.\n\nThis isnt even about the apple anymore. But God if I could eat that fucking apple my life would be perfect",
          "created_utc": 1748303862.0
        },
        {
          "id": "mufif6d",
          "author": "gir1_from_the_sea",
          "body": "You can do it! I know it’s hard, but just go nice and slow, deep breaths. I’m here for you.",
          "created_utc": 1748303907.0
        },
        {
          "id": "mufil73",
          "author": "obviously_throwaway6",
          "body": "I'm so sick of ramen noodles and peanut butter and stomach aches though. I just want to be done with this shit.",
          "created_utc": 1748303969.0
        },
        {
          "id": "mufj44m",
          "author": "gir1_from_the_sea",
          "body": "I understand. In the end it is your choice to stay or go. But all I will say, do you really want to leave everything behind? I mean I don’t know your story, but you must have at least one person who cares for you, and values you. And if not, let me be that person. I know I’m just a stranger to you, but I can at least try to be something. If you don’t want ramen or peanut butter sandwiches, try to slowly eat the apple. I know it’s hard, but right now it sounds like you don’t have much of a choice. Or even just sleep. If anything.",
          "created_utc": 1748304164.0
        },
        {
          "id": "mufjv6n",
          "author": "obviously_throwaway6",
          "body": "I don't want to die. Ill eat. Eventually. I have to. I have no choice. But I'm going to live in my delusional fantasy world where I don't need to eat as long as physically possible first.",
          "created_utc": 1748304443.0
        }
      ]
    },
    {
      "id": "mv6ifpk",
      "author": "QuixoticRuin",
      "body": "2 meals!  1.5 tacos for one, and nice chicken nuggets and fries for the other.  Omg, solid food was amazeballs today.\n\nWe both kicked ass today!",
      "created_utc": 1748658417.0,
      "score": 1,
      "context": [
        {
          "id": "mufwzuv",
          "author": "QuixoticRuin",
          "body": "Hey friend -- could you try eating the apple in thin slices similar to ramen?  Maybe julienne it, and eat it with chopsticks?  I just don't know, but maybe that could work? \n\nIf you give it a go, make sure you try when you're well rested and have the mental bandwidth to try.\n\nI'm so proud of you for making this post.  Thanks for knowing you have to try even if right now it feels like you don't want to.  Just breathe.\n\nI've been having cramps from lack of potassium, so I've been  trying to eat a banana, and I'm going to go try right now in solidity with you, OP.  \n\nYou aren't fighting alone.  We're all rooting for you.",
          "created_utc": 1748309252.0
        },
        {
          "id": "mufzyil",
          "author": "obviously_throwaway6",
          "body": "The apple unfortunately is just hypothetical and I don't have a physical apple I could confront and destroy. Not to say I can't eat apples. I can't. I very much can't. And it haunts me. Obviously. But in this particular instance, there was no actual apple. Just the memory of every apple I've never eaten. Fucking apples.",
          "created_utc": 1748310315.0
        },
        {
          "id": "muz34t2",
          "author": "QuixoticRuin",
          "body": "I fucking hate apples myself, but I did eat almost half a banana for you that day in solidarity.  \n\nI hope you keep fighting, friend.  I'm fighting that same fight alongside you, and you're not alone.",
          "created_utc": 1748560927.0
        },
        {
          "id": "muz6kzz",
          "author": "obviously_throwaway6",
          "body": "Well, then you may the happy to know that I've resumed eating. I hate it and it's terrible, but I'm eating breakfast and dinner. So I suppose we truly are in this together.",
          "created_utc": 1748562066.0
        },
        {
          "id": "muzm1dq",
          "author": "QuixoticRuin",
          "body": "Today, I only managed a couple French fries, a protein wafer thing, and a meal replacement drink.  Oh, and a protein smoothie with chocolate -- and banana.  \n\nNot much solid food today, but perhaps tomorrow.\n\nEach day, we keep fighting.  Together.",
          "created_utc": 1748567360.0
        },
        {
          "id": "mv6dq6d",
          "author": "obviously_throwaway6",
          "body": "Ramen and five slices of bread. Om nom nom nom 🤜🤛",
          "created_utc": 1748656603.0
        }
      ]
    },
    {
      "id": "mvcniuo",
      "author": "obviously_throwaway6",
      "body": "Bread and ramen again. Idk why I'm still telling you this. Go team.",
      "created_utc": 1748745433.0,
      "score": 1,
      "context": [
        {
          "id": "mufwzuv",
          "author": "QuixoticRuin",
          "body": "Hey friend -- could you try eating the apple in thin slices similar to ramen?  Maybe julienne it, and eat it with chopsticks?  I just don't know, but maybe that could work? \n\nIf you give it a go, make sure you try when you're well rested and have the mental bandwidth to try.\n\nI'm so proud of you for making this post.  Thanks for knowing you have to try even if right now it feels like you don't want to.  Just breathe.\n\nI've been having cramps from lack of potassium, so I've been  trying to eat a banana, and I'm going to go try right now in solidity with you, OP.  \n\nYou aren't fighting alone.  We're all rooting for you.",
          "created_utc": 1748309252.0
        },
        {
          "id": "mufzyil",
          "author": "obviously_throwaway6",
          "body": "The apple unfortunately is just hypothetical and I don't have a physical apple I could confront and destroy. Not to say I can't eat apples. I can't. I very much can't. And it haunts me. Obviously. But in this particular instance, there was no actual apple. Just the memory of every apple I've never eaten. Fucking apples.",
          "created_utc": 1748310315.0
        },
        {
          "id": "muz34t2",
          "author": "QuixoticRuin",
          "body": "I fucking hate apples myself, but I did eat almost half a banana for you that day in solidarity.  \n\nI hope you keep fighting, friend.  I'm fighting that same fight alongside you, and you're not alone.",
          "created_utc": 1748560927.0
        },
        {
          "id": "muz6kzz",
          "author": "obviously_throwaway6",
          "body": "Well, then you may the happy to know that I've resumed eating. I hate it and it's terrible, but I'm eating breakfast and dinner. So I suppose we truly are in this together.",
          "created_utc": 1748562066.0
        },
        {
          "id": "muzm1dq",
          "author": "QuixoticRuin",
          "body": "Today, I only managed a couple French fries, a protein wafer thing, and a meal replacement drink.  Oh, and a protein smoothie with chocolate -- and banana.  \n\nNot much solid food today, but perhaps tomorrow.\n\nEach day, we keep fighting.  Together.",
          "created_utc": 1748567360.0
        },
        {
          "id": "mv6dq6d",
          "author": "obviously_throwaway6",
          "body": "Ramen and five slices of bread. Om nom nom nom 🤜🤛",
          "created_utc": 1748656603.0
        },
        {
          "id": "mv6ifpk",
          "author": "QuixoticRuin",
          "body": "2 meals!  1.5 tacos for one, and nice chicken nuggets and fries for the other.  Omg, solid food was amazeballs today.\n\nWe both kicked ass today!",
          "created_utc": 1748658417.0
        }
      ]
    },
    {
      "id": "mvhn7o0",
      "author": "QuixoticRuin",
      "body": "About to eat STEAK and potatoes my kid wanted this weird way.  Idk, they are coated in seasoning, flour, and look like pom poms, and are about to get deep fried.\n\nWith corn.\n\nHad a protein meal replacement earlier, but grazed on tortilla chips at a party.",
      "created_utc": 1748815676.0,
      "score": 1,
      "context": [
        {
          "id": "mufwzuv",
          "author": "QuixoticRuin",
          "body": "Hey friend -- could you try eating the apple in thin slices similar to ramen?  Maybe julienne it, and eat it with chopsticks?  I just don't know, but maybe that could work? \n\nIf you give it a go, make sure you try when you're well rested and have the mental bandwidth to try.\n\nI'm so proud of you for making this post.  Thanks for knowing you have to try even if right now it feels like you don't want to.  Just breathe.\n\nI've been having cramps from lack of potassium, so I've been  trying to eat a banana, and I'm going to go try right now in solidity with you, OP.  \n\nYou aren't fighting alone.  We're all rooting for you.",
          "created_utc": 1748309252.0
        },
        {
          "id": "mufzyil",
          "author": "obviously_throwaway6",
          "body": "The apple unfortunately is just hypothetical and I don't have a physical apple I could confront and destroy. Not to say I can't eat apples. I can't. I very much can't. And it haunts me. Obviously. But in this particular instance, there was no actual apple. Just the memory of every apple I've never eaten. Fucking apples.",
          "created_utc": 1748310315.0
        },
        {
          "id": "muz34t2",
          "author": "QuixoticRuin",
          "body": "I fucking hate apples myself, but I did eat almost half a banana for you that day in solidarity.  \n\nI hope you keep fighting, friend.  I'm fighting that same fight alongside you, and you're not alone.",
          "created_utc": 1748560927.0
        },
        {
          "id": "muz6kzz",
          "author": "obviously_throwaway6",
          "body": "Well, then you may the happy to know that I've resumed eating. I hate it and it's terrible, but I'm eating breakfast and dinner. So I suppose we truly are in this together.",
          "created_utc": 1748562066.0
        },
        {
          "id": "muzm1dq",
          "author": "QuixoticRuin",
          "body": "Today, I only managed a couple French fries, a protein wafer thing, and a meal replacement drink.  Oh, and a protein smoothie with chocolate -- and banana.  \n\nNot much solid food today, but perhaps tomorrow.\n\nEach day, we keep fighting.  Together.",
          "created_utc": 1748567360.0
        },
        {
          "id": "mv6dq6d",
          "author": "obviously_throwaway6",
          "body": "Ramen and five slices of bread. Om nom nom nom 🤜🤛",
          "created_utc": 1748656603.0
        },
        {
          "id": "mv6ifpk",
          "author": "QuixoticRuin",
          "body": "2 meals!  1.5 tacos for one, and nice chicken nuggets and fries for the other.  Omg, solid food was amazeballs today.\n\nWe both kicked ass today!",
          "created_utc": 1748658417.0
        },
        {
          "id": "mvcniuo",
          "author": "obviously_throwaway6",
          "body": "Bread and ramen again. Idk why I'm still telling you this. Go team.",
          "created_utc": 1748745433.0
        }
      ]
    },
    {
      "id": "mvih4hx",
      "author": "obviously_throwaway6",
      "body": "Came close to stopping at breakfast ramen today. Girlfriend brought me some breakfast food at Jack in the box. Hooray for bacon and eggs. Close call.",
      "created_utc": 1748826365.0,
      "score": 1,
      "context": [
        {
          "id": "mufwzuv",
          "author": "QuixoticRuin",
          "body": "Hey friend -- could you try eating the apple in thin slices similar to ramen?  Maybe julienne it, and eat it with chopsticks?  I just don't know, but maybe that could work? \n\nIf you give it a go, make sure you try when you're well rested and have the mental bandwidth to try.\n\nI'm so proud of you for making this post.  Thanks for knowing you have to try even if right now it feels like you don't want to.  Just breathe.\n\nI've been having cramps from lack of potassium, so I've been  trying to eat a banana, and I'm going to go try right now in solidity with you, OP.  \n\nYou aren't fighting alone.  We're all rooting for you.",
          "created_utc": 1748309252.0
        },
        {
          "id": "mufzyil",
          "author": "obviously_throwaway6",
          "body": "The apple unfortunately is just hypothetical and I don't have a physical apple I could confront and destroy. Not to say I can't eat apples. I can't. I very much can't. And it haunts me. Obviously. But in this particular instance, there was no actual apple. Just the memory of every apple I've never eaten. Fucking apples.",
          "created_utc": 1748310315.0
        },
        {
          "id": "muz34t2",
          "author": "QuixoticRuin",
          "body": "I fucking hate apples myself, but I did eat almost half a banana for you that day in solidarity.  \n\nI hope you keep fighting, friend.  I'm fighting that same fight alongside you, and you're not alone.",
          "created_utc": 1748560927.0
        },
        {
          "id": "muz6kzz",
          "author": "obviously_throwaway6",
          "body": "Well, then you may the happy to know that I've resumed eating. I hate it and it's terrible, but I'm eating breakfast and dinner. So I suppose we truly are in this together.",
          "created_utc": 1748562066.0
        },
        {
          "id": "muzm1dq",
          "author": "QuixoticRuin",
          "body": "Today, I only managed a couple French fries, a protein wafer thing, and a meal replacement drink.  Oh, and a protein smoothie with chocolate -- and banana.  \n\nNot much solid food today, but perhaps tomorrow.\n\nEach day, we keep fighting.  Together.",
          "created_utc": 1748567360.0
        },
        {
          "id": "mv6dq6d",
          "author": "obviously_throwaway6",
          "body": "Ramen and five slices of bread. Om nom nom nom 🤜🤛",
          "created_utc": 1748656603.0
        },
        {
          "id": "mv6ifpk",
          "author": "QuixoticRuin",
          "body": "2 meals!  1.5 tacos for one, and nice chicken nuggets and fries for the other.  Omg, solid food was amazeballs today.\n\nWe both kicked ass today!",
          "created_utc": 1748658417.0
        },
        {
          "id": "mvcniuo",
          "author": "obviously_throwaway6",
          "body": "Bread and ramen again. Idk why I'm still telling you this. Go team.",
          "created_utc": 1748745433.0
        },
        {
          "id": "mvhn7o0",
          "author": "QuixoticRuin",
          "body": "About to eat STEAK and potatoes my kid wanted this weird way.  Idk, they are coated in seasoning, flour, and look like pom poms, and are about to get deep fried.\n\nWith corn.\n\nHad a protein meal replacement earlier, but grazed on tortilla chips at a party.",
          "created_utc": 1748815676.0
        }
      ]
    },
    {
      "id": "mwyhelx",
      "author": "QuixoticRuin",
      "body": "Made myself stuffing, au gratin potatoes, corn.  Was the tits.\n\nHope you're well.",
      "created_utc": 1749527392.0,
      "score": 1,
      "context": [
        {
          "id": "mufwzuv",
          "author": "QuixoticRuin",
          "body": "Hey friend -- could you try eating the apple in thin slices similar to ramen?  Maybe julienne it, and eat it with chopsticks?  I just don't know, but maybe that could work? \n\nIf you give it a go, make sure you try when you're well rested and have the mental bandwidth to try.\n\nI'm so proud of you for making this post.  Thanks for knowing you have to try even if right now it feels like you don't want to.  Just breathe.\n\nI've been having cramps from lack of potassium, so I've been  trying to eat a banana, and I'm going to go try right now in solidity with you, OP.  \n\nYou aren't fighting alone.  We're all rooting for you.",
          "created_utc": 1748309252.0
        },
        {
          "id": "mufzyil",
          "author": "obviously_throwaway6",
          "body": "The apple unfortunately is just hypothetical and I don't have a physical apple I could confront and destroy. Not to say I can't eat apples. I can't. I very much can't. And it haunts me. Obviously. But in this particular instance, there was no actual apple. Just the memory of every apple I've never eaten. Fucking apples.",
          "created_utc": 1748310315.0
        },
        {
          "id": "muz34t2",
          "author": "QuixoticRuin",
          "body": "I fucking hate apples myself, but I did eat almost half a banana for you that day in solidarity.  \n\nI hope you keep fighting, friend.  I'm fighting that same fight alongside you, and you're not alone.",
          "created_utc": 1748560927.0
        },
        {
          "id": "muz6kzz",
          "author": "obviously_throwaway6",
          "body": "Well, then you may the happy to know that I've resumed eating. I hate it and it's terrible, but I'm eating breakfast and dinner. So I suppose we truly are in this together.",
          "created_utc": 1748562066.0
        },
        {
          "id": "muzm1dq",
          "author": "QuixoticRuin",
          "body": "Today, I only managed a couple French fries, a protein wafer thing, and a meal replacement drink.  Oh, and a protein smoothie with chocolate -- and banana.  \n\nNot much solid food today, but perhaps tomorrow.\n\nEach day, we keep fighting.  Together.",
          "created_utc": 1748567360.0
        },
        {
          "id": "mv6dq6d",
          "author": "obviously_throwaway6",
          "body": "Ramen and five slices of bread. Om nom nom nom 🤜🤛",
          "created_utc": 1748656603.0
        },
        {
          "id": "mv6ifpk",
          "author": "QuixoticRuin",
          "body": "2 meals!  1.5 tacos for one, and nice chicken nuggets and fries for the other.  Omg, solid food was amazeballs today.\n\nWe both kicked ass today!",
          "created_utc": 1748658417.0
        },
        {
          "id": "mvcniuo",
          "author": "obviously_throwaway6",
          "body": "Bread and ramen again. Idk why I'm still telling you this. Go team.",
          "created_utc": 1748745433.0
        },
        {
          "id": "mvhn7o0",
          "author": "QuixoticRuin",
          "body": "About to eat STEAK and potatoes my kid wanted this weird way.  Idk, they are coated in seasoning, flour, and look like pom poms, and are about to get deep fried.\n\nWith corn.\n\nHad a protein meal replacement earlier, but grazed on tortilla chips at a party.",
          "created_utc": 1748815676.0
        },
        {
          "id": "mvih4hx",
          "author": "obviously_throwaway6",
          "body": "Came close to stopping at breakfast ramen today. Girlfriend brought me some breakfast food at Jack in the box. Hooray for bacon and eggs. Close call.",
          "created_utc": 1748826365.0
        }
      ]
    }
  ]
}