{
  "id": "1kxxef2",
  "subreddit": "ARFID",
  "author": "ibelieveinaliens111",
  "created_utc": 1748479085.0,
  "title": "What are some consequences of ARFID no one seems to talk about?",
  "selftext": "Anyone have any consequences of ARFID that they feel aren’t talked about enough? I’ll go first.\n\nFOOD WASTE. I feel like a horrible person when I just can’t eat something, and it sits in my fridge.",
  "url": "https://www.reddit.com/r/ARFID/comments/1kxxef2/what_are_some_consequences_of_arfid_no_one_seems/",
  "score": 105,
  "num_comments": 80,
  "comments": [
    {
      "id": "muth072",
      "author": "No_Reach3179",
      "body": "C O N S T I P A T I O N 🗣️  i can’t be the only one who’s (at one point) eaten so little that their colon stopped working to save energy",
      "created_utc": 1748487331.0,
      "score": 76,
      "context": []
    },
    {
      "id": "musuvd1",
      "author": "acnerd5",
      "body": "The fear of wasting food though omg - because I've wasted so much food thanks to my ARFID, has now made my ARFID worse - because of course, why not have fears about not finishing food to make eating food harder?\n\nThat's one of the biggest consequences that has coincidentally led to things being worse :(",
      "created_utc": 1748479647.0,
      "score": 63,
      "context": []
    },
    {
      "id": "mute676",
      "author": "Quinns_Quirks",
      "body": "The social anxiety around food 😅\nI have a near fear of eating in public. At least eating around people I know, because I know comments will be made.",
      "created_utc": 1748486303.0,
      "score": 48,
      "context": []
    },
    {
      "id": "mut0pcm",
      "author": "Dykeryy",
      "body": "The fact that it can make other eating disorders worse or more likely. I was anorexic for a while, and ARFID made it a hundred times worse, because I was already used to not eating, and other people praised me for being able to not eat for days, which just fed into the disordered mindset.",
      "created_utc": 1748481642.0,
      "score": 37,
      "context": []
    },
    {
      "id": "muuzzj4",
      "author": "strawberrywool",
      "body": "how frustrated you feel with yourself all the time like why am i crying over a slice of toast💔",
      "created_utc": 1748515623.0,
      "score": 39,
      "context": []
    },
    {
      "id": "mutiurv",
      "author": "Ginger_Cat_Ventures",
      "body": "My TEETH are terrible because I eat a lot of sugary things and I swish drinks (that are sugary) around in my mouth. I cannot eat acidic things like fruit anymore because it hurts my teeth.",
      "created_utc": 1748488019.0,
      "score": 25,
      "context": []
    },
    {
      "id": "mutq4eg",
      "author": "allison777",
      "body": "Food waste is so true especially living with a parent that gets frustrated when they buy food you don’t end up eating. I feel so guilty I buy my own exposure foods now so nobody can be mad at me for wasting",
      "created_utc": 1748490966.0,
      "score": 18,
      "context": []
    },
    {
      "id": "muw3a0w",
      "author": "indiapursuingart",
      "body": "I desperately want to travel the world, ESPECIALLY Asia but I know I’d get extremely sick over there because I wouldn’t be able to eat anything :( makes me scared to travel despite how badly I want to see different places.",
      "created_utc": 1748529596.0,
      "score": 18,
      "context": []
    },
    {
      "id": "mutfuf5",
      "author": "crazyrainbowoctopus",
      "body": "Omg yes i waste so much food and feel horrible! I love all my friends and their families, but every time i go over and they try to be nice and cook for me and stuff I feel like a horrible person when I pick at it and dont eat it. One time i stayed a friends house for a weekend and i had to give her mom a list of the foods i eat because she wanted to accommodate me but i felt like such a burden",
      "created_utc": 1748486905.0,
      "score": 14,
      "context": []
    },
    {
      "id": "muuaygj",
      "author": "theflyingpiggies",
      "body": "The food waste one is such a nasty cycle. I don’t eat so the food goes to waste. The food goes to waste so I stop even attempting to buy groceries. I don’t have food so I don’t eat.",
      "created_utc": 1748501417.0,
      "score": 15,
      "context": []
    },
    {
      "id": "muxd0qc",
      "author": "brrratmobile",
      "body": "the lack of energy and tiredness from not getting enough nutrients ☹️",
      "created_utc": 1748542356.0,
      "score": 13,
      "context": []
    },
    {
      "id": "muwu56t",
      "author": "Murgbot",
      "body": "The utter stress that comes with someone inviting you out to eat and just having to find one thing on the menu that you can eat because you don’t want them to have to change to fit in with you for once 😭 \n\nGenuinely I HATE that my diet is so limited but the thought of changing it is horrible too. I would love if places could just put normal fucking meals on their menus instead of trying to be fancy 🙄",
      "created_utc": 1748537161.0,
      "score": 13,
      "context": []
    },
    {
      "id": "mutjdn2",
      "author": "naokokoro",
      "body": "Food insecurity - it’s like my body’s afraid we’ll be starving later so when I eat it’s till I’m too full…\n\nbut when I’m too full, it also screams at me to purge 🥲 it’s an ED partay over here lol",
      "created_utc": 1748488222.0,
      "score": 10,
      "context": []
    },
    {
      "id": "muv26r8",
      "author": "Konsicrafter",
      "body": "I couldn't make a year abroad in school or university because I was raised I was gonna starve in the US or Canada because the food is probably processed so differently. Same thing, I can't travel to Asia or Africa because of fear of the same thing. Basically, southern Europe is as exotic as it gets, without leaving safety!",
      "created_utc": 1748516646.0,
      "score": 10,
      "context": []
    },
    {
      "id": "muv2asl",
      "author": "noivern_plus_cats",
      "body": "The good ol \"Oh man I love apples they taste so good and are the only fruit that's actively consistent in texture and flavor (dependent on variety but I love almost all varieties) I can't wait to get them\" and proceeding to eat three of them because I can't be bothered to eat sometimes or my body just doesn't want to put a cold and wet food into it because it'll make me feel colder...\n\nThe worst part for me (undiagnosed but well... considering I can't eat most vegetables, many fruits, all seafood...) is that I can't eat certain foods and people keep trying to convince me I'm too picky and doing this to myself. I can register that a dish made with certain foods looks good! I would love to eat a Krabby Patty if I could but the lettuce, tomatoes, and pickles would be too moist and crunchy and soft and sour and the bread would be soggy... I hate it so much because something looks so good but I know that it just won't be. I know that certain foods in certain ways just won't do well with any of my texture issues, and I HATE bitter foods and can not stand them. \n\nA lot of the time people will go \"oh but you liked this food that had this\" and the reason why is that the food wasn't made to where the ingredient goes against all of my texture and taste issues. I have no reason to hate something that has cooked onions and celery because I built up the courage over a decade and a half to finally try them and found out I can eat them if they're cooked to softness. If the food isn't a texture tornado and isn't bitter, but I don't like it, I just won't eat a lot either. The social pressure sucks because sure I can eat pad thai or my dad's porkchops, but I don't like either. So I just take a few bites until I'm \"full\" and then leave. There are just so many people who think they know more than you about what you like and so many people think that because you're \"a bit picky\", you're just being a jerk to everyone around you. They don't understand that being unable to eat certain foods physically and mentally without getting sick or vomiting is a genuine issue for you.",
      "created_utc": 1748516697.0,
      "score": 9,
      "context": []
    },
    {
      "id": "muutnie",
      "author": "AccomplishedPrint465",
      "body": "same as you, stuff spoils in my fridge so often and I feel like shit because people are literally starving because they can’t afford food. it makes me really emotional tbh",
      "created_utc": 1748512338.0,
      "score": 7,
      "context": []
    },
    {
      "id": "muycyp1",
      "author": "BillyYumYumTwo-byTwo",
      "body": "I don’t like going out to eat, but it’s pretty hard to avoid. My husband is amazing at being accommodating, but you never know if your meal will be not what you were expecting. I hate the looks I get from waiters when they see my plate. And even when the food is good, my body is not used to eating an entire restaurant sized meal. Sometimes I ask for a box, even though I mostly can’t do leftovers, just to avoid the judgmental look (and I’m sure 95% of the time they aren’t judgey, just maybe a bit confused or even mildly concerned)",
      "created_utc": 1748552660.0,
      "score": 5,
      "context": []
    },
    {
      "id": "muwb38a",
      "author": "Propsicle405",
      "body": "Osteopenia and osteoporosis by far.  This year I fractured my back in two places, and also broke my shoulder :(",
      "created_utc": 1748531792.0,
      "score": 4,
      "context": []
    },
    {
      "id": "muxsonn",
      "author": "Angelangepange",
      "body": "For me the worse consequences was becoming afraid to make any choice. Not just food related.    \nBecause my body only wants to eat \"bad foods\" I started believing I was unable to make good choices in any context.   \n    \nAs a kid I started believing I was evil because \"good children eat vegetables\" and I was unable to (back then I didn't know what arfid was and thought I was the only person like this)    \nBecause I also had undiagnosed adhd my family told me I did not care about them because I kept forgetting things and it all cemented into my head that I was just genetically evil or something.   \nI think the worst of all was the mental health stuff that came along due to no one understanding what was going on with me.",
      "created_utc": 1748546848.0,
      "score": 4,
      "context": []
    },
    {
      "id": "muyhru2",
      "author": "Puzzleheaded-Arm4170",
      "body": "Being deficient in EVERYTHING! B12, Iron, magnesium, vitamin D, vitamin B6, vitamin C… etc. all the complications, symptoms, and knowing that most vitamin supplements take months to kick in!\n\nSome complications that I ( personally) struggle with:\n\nSevere anemia\nScurvy \nPeripheral neuropathy \nWeakness\nFatigue\nConstipation\nDiarrhea\nHeart conditions\nPale/gaunt\n\nAnd that’s just me! I imagine for anyone else the list could be far more expansive, and people don’t like to hear the same complaints all the time, but it’s a real struggle!",
      "created_utc": 1748554096.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mv25dwp",
      "author": "chickenparmnocheese",
      "body": "Being embarrassed and hiding my diet of eating the same things every day.  I avoided lunch time in high school, ate at off hours in the college dining hall before moving off campus, and I’ve avoided eating lunch at work with others.  I have missed a lot of social skills because of this.  \n\nEating with anyone, even with family that are helpful and supportive, can sometimes cause an intense sadness at the table.  It’s the I desperately want to be able to eat more foods and enjoy eating out with other people, but no idea how and feeling trapped with this forever.\n\nI’ve started to try and embrace and accept this, to try and not get embarrassed about myself.  It’s helped, but it creeps up still.",
      "created_utc": 1748609403.0,
      "score": 5,
      "context": []
    },
    {
      "id": "muwcf2d",
      "author": "Gashi_The_Fangirl_75",
      "body": "Intentionally eating spoiled food. It takes me hours to eat, so oftentimes my food will go bad because it’s been sitting out for too long before I can finish a reasonable portion, and then I’ll eat it anyways because I feel so guilty for wasting it. I am getting better about this one though!",
      "created_utc": 1748532167.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mux0hi6",
      "author": "Suspicious_Low8430",
      "body": "Being on ADHD medication and having ARFID. I’m 23 and have been on XR stimulants for over 10 years. My appetite is so fucked up and makes it way harder to eat as well as giving me chronic dry mouth. I panic every morning cuz eating breakfast is so hard because I wake up take my pill and have about an hour or so to eat before it kicks in which obviously puts more pressure on breakfast.",
      "created_utc": 1748538907.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mv4ndop",
      "author": "blondeswift",
      "body": "The small amount of patience people have when you’re trying something new. “Just eat it” bro….. IF I COULD I WOULD PLEASE GIVE ME TIME",
      "created_utc": 1748635654.0,
      "score": 2,
      "context": []
    },
    {
      "id": "muyhsmc",
      "author": "Puzzleheaded-Arm4170",
      "body": "Being deficient in EVERYTHING! B12, Iron, magnesium, vitamin D, vitamin B6, vitamin C… etc. all the complications, symptoms, and knowing that most vitamin supplements take months to kick in!\n\nSome complications that I ( personally) struggle with:\n\nSevere anemia\nScurvy \nPeripheral neuropathy \nWeakness\nFatigue\nConstipation\nDiarrhea\nHeart conditions\nPale/gaunt\n\nAnd that’s just me! I imagine for anyone else the list could be far more expansive, and people don’t like to hear the same complaints all the time, but it’s a real struggle!",
      "created_utc": 1748554102.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mvbwpdy",
      "author": "KribriQT",
      "body": "NAFLD, and honestly the social aspects to it. So many cultures revolve around food that it’s so isolating in settings with people who don’t know you.",
      "created_utc": 1748735290.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mvfpjuo",
      "author": "Miserable-Piglet9008",
      "body": "Sitting, staring at your meal for an hour convincing yourself it isn't going to hurt you. Only to then give up and just *not eat* because it's *\"easier\"*.",
      "created_utc": 1748794400.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mvghbjc",
      "author": "_Blue_Raspberries_",
      "body": "Food waste definitely. I get terrified of stuff going bad in my fridge and often can't eat stuff after it's been in there a few days. Especially leftovers... But I also dislike shopping so buying small amounts of food at once means I'll just go a few weeks at a time barely eating because I don't want to go to the store...\n\nI also have an insane amount of anxiety about eating in front of others. I hate the idea of others judging what I eat. I don't even eat unhealthy but I just don't like being watched while eating...\n\nAnd there's some food textures I just cannot stand. Grainy textures like applesauce, textures of seed breads... As well as just the idea of certain foods? Like I can't eat raw fish. No reason other than it sounds bad.",
      "created_utc": 1748802616.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mykqg1r",
      "author": "gabbsito",
      "body": "Being embarrassed in front of others. I've been with my bf for almost 6 years and from day 1 he knew that I had ARFID. But I have denied lunches with his mom, disappointed his relatives that wanted me to try their cooking and when we go out we always end up eating at the same place so sometimes I feel he wants to eat something else ;(",
      "created_utc": 1750306269.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n17jn8x",
      "author": "Ok-Reason3039",
      "body": "The embarrassment and frustration, being angry at yourself all the time because you know the food isn’t going to do any harm to you, you’re ganna like it or you won’t, but i still won’t be able to try it. and the embarrassment of going out or going to peoples houses",
      "created_utc": 1751582149.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n2mwngp",
      "author": "MaybeAggravating7359",
      "body": "I've developed osteoarthritis in the hips and lumber spine. I'm now on medication that is usually only prescribed for over 60s. I'm in my 40s,but this horrible condition has left me with severe health problems and even nearly took my life in December 2024. One day after my birthday.\nI'm now tube fed and trying to get better. Arfid destroys your body from the inside, out. ",
      "created_utc": 1752274858.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n4ez22q",
      "author": "FunkPopRoyalty",
      "body": "People because my friends will ask \"Hey wanna go get ______\" and now i gotta either \n1) come up with an excuse not to go\n2) have that awkward explanation on why I don't like that/havent tried that type of food nor want too\nOr 3) if done option 2 then need to swivel out of the peer pressure people are now putting on me to go and try it with them bc it physically hurts and im a mess whenever I do go to try a new food! Its so annoying and difficult to explain because people simply do not understand",
      "created_utc": 1753133531.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mutkr3h",
      "author": "Desert_Fairy",
      "body": "As a cost saving measure, The light at the end of the tunnel has been turned off. \n\nI second this, constipation is the absolute worst.",
      "created_utc": 1748488755.0,
      "score": 28,
      "context": [
        {
          "id": "muth072",
          "author": "No_Reach3179",
          "body": "C O N S T I P A T I O N 🗣️  i can’t be the only one who’s (at one point) eaten so little that their colon stopped working to save energy",
          "created_utc": 1748487331.0
        }
      ]
    },
    {
      "id": "muv0l7v",
      "author": "noivern_plus_cats",
      "body": "I've eaten only one meal per day for a huge chunk of my life and I still got it moving because I have that good ol IBS and fast metabolism\n\nIt's crazy because some days I'll only eat a few bites of something and still the dam breaks.",
      "created_utc": 1748515908.0,
      "score": 11,
      "context": [
        {
          "id": "muth072",
          "author": "No_Reach3179",
          "body": "C O N S T I P A T I O N 🗣️  i can’t be the only one who’s (at one point) eaten so little that their colon stopped working to save energy",
          "created_utc": 1748487331.0
        }
      ]
    },
    {
      "id": "muz5sdc",
      "author": "ibelieveinaliens111",
      "body": "It’s not that I don’t eat enough, it’s that I don’t eat right. My digestive system gives out A LOT after running on like 10g of fiber a week… It gets to the point where I actually get nauseous. Searching up symptoms and the reoccurring answer is “gastrointestinal issues” is always humbling 🫠",
      "created_utc": 1748561804.0,
      "score": 3,
      "context": [
        {
          "id": "muth072",
          "author": "No_Reach3179",
          "body": "C O N S T I P A T I O N 🗣️  i can’t be the only one who’s (at one point) eaten so little that their colon stopped working to save energy",
          "created_utc": 1748487331.0
        }
      ]
    },
    {
      "id": "muto754",
      "author": "OneEyedTreeHugger",
      "body": "Wait, that’s a thing?! That might explain some stuff recently…",
      "created_utc": 1748490155.0,
      "score": 2,
      "context": [
        {
          "id": "muth072",
          "author": "No_Reach3179",
          "body": "C O N S T I P A T I O N 🗣️  i can’t be the only one who’s (at one point) eaten so little that their colon stopped working to save energy",
          "created_utc": 1748487331.0
        }
      ]
    },
    {
      "id": "muuaq1m",
      "author": "cattbug",
      "body": "Oh, is this it? I'd been wondering why my food issues have gotten worse since being in remission from anorexia 🫠",
      "created_utc": 1748501287.0,
      "score": 6,
      "context": [
        {
          "id": "musuvd1",
          "author": "acnerd5",
          "body": "The fear of wasting food though omg - because I've wasted so much food thanks to my ARFID, has now made my ARFID worse - because of course, why not have fears about not finishing food to make eating food harder?\n\nThat's one of the biggest consequences that has coincidentally led to things being worse :(",
          "created_utc": 1748479647.0
        }
      ]
    },
    {
      "id": "mutinil",
      "author": "No_Reach3179",
      "body": "Bingo",
      "created_utc": 1748487943.0,
      "score": 7,
      "context": [
        {
          "id": "mute676",
          "author": "Quinns_Quirks",
          "body": "The social anxiety around food 😅\nI have a near fear of eating in public. At least eating around people I know, because I know comments will be made.",
          "created_utc": 1748486303.0
        }
      ]
    },
    {
      "id": "muy5f1u",
      "author": "kippenon",
      "body": "This omg! Every time I'm able to eat something/we go out to eat, my family ALWAYS makes a comment about my eating habits. I've told them so many times why I can't eat like they can, and it's always met with the same dismissive reactions. I know they don't realize that their comments make things worse, but it still sucks that if I were to explain that to them, they'd still do it. :p\n\nPlus their comments inadvertently caused my inability to eat in front of anyone at all, even supportive friends of mine.",
      "created_utc": 1748550499.0,
      "score": 7,
      "context": [
        {
          "id": "mute676",
          "author": "Quinns_Quirks",
          "body": "The social anxiety around food 😅\nI have a near fear of eating in public. At least eating around people I know, because I know comments will be made.",
          "created_utc": 1748486303.0
        }
      ]
    },
    {
      "id": "muticoc",
      "author": "No_Reach3179",
      "body": "Yup, mines definitely crossed with orthorexia/health anxiety. I have no body image issues but I have paranoia about food harming me. Doesn’t matter if it’s food poisoning, “toxic” ingredients, choking, contamination, weird pieces of meat, unknown or hidden ingredients, basically anything used to prevent me from eating. \n\nSince then I’ve learned any food is better than none. Even if the only food someone was willing to eat were junk foods, eating junk everyday will always be better for you than not eating at all. Any calories will take you farther than no calories.",
      "created_utc": 1748487830.0,
      "score": 13,
      "context": [
        {
          "id": "mut0pcm",
          "author": "Dykeryy",
          "body": "The fact that it can make other eating disorders worse or more likely. I was anorexic for a while, and ARFID made it a hundred times worse, because I was already used to not eating, and other people praised me for being able to not eat for days, which just fed into the disordered mindset.",
          "created_utc": 1748481642.0
        }
      ]
    },
    {
      "id": "muwuk7u",
      "author": "Murgbot",
      "body": "This! Especially when it happens in public and you can’t explain that the reason you’re crying is because your safe food is touching unsafe food and you’ll be able to taste the remnants of the unsafe food!!!",
      "created_utc": 1748537279.0,
      "score": 10,
      "context": [
        {
          "id": "muuzzj4",
          "author": "strawberrywool",
          "body": "how frustrated you feel with yourself all the time like why am i crying over a slice of toast💔",
          "created_utc": 1748515623.0
        }
      ]
    },
    {
      "id": "muz5ycb",
      "author": "ibelieveinaliens111",
      "body": "Seriously!! And it feels so silly in retrospect, I feel stupid just for getting upset. Because why are my options A, eat the toast, or B, cry over the toast- and why did I pick B?!?!",
      "created_utc": 1748561859.0,
      "score": 3,
      "context": [
        {
          "id": "muuzzj4",
          "author": "strawberrywool",
          "body": "how frustrated you feel with yourself all the time like why am i crying over a slice of toast💔",
          "created_utc": 1748515623.0
        }
      ]
    },
    {
      "id": "muwsf60",
      "author": "haydesigner",
      "body": "I don’t know how old you are, but take it from me… you need to brush your teeth, multiple times a day! Periodontal disease is very much real and directly related to your sugar intake. Please talk with your dentist and doctor about this as soon as you can.\n\nI didn’t heed the warnings, and now I’m gonna pay a huge price, literally. In the last year, I’ve had two of my front teeth break in half because of this. And I’ll need implants to fix this, and it’s about $6000 per tooth (and that’s with insurance!).",
      "created_utc": 1748536683.0,
      "score": 9,
      "context": [
        {
          "id": "mutiurv",
          "author": "Ginger_Cat_Ventures",
          "body": "My TEETH are terrible because I eat a lot of sugary things and I swish drinks (that are sugary) around in my mouth. I cannot eat acidic things like fruit anymore because it hurts my teeth.",
          "created_utc": 1748488019.0
        }
      ]
    },
    {
      "id": "muxvit9",
      "author": "mykineticromance",
      "body": "sensodyne toothpaste helps me with sensitive teeth! though mine are sensitive to cold mostly, and i love cold food.\n\nif flavor is an issue, i know there's some brands that have a wider variety of flavors than just mint.",
      "created_utc": 1748547668.0,
      "score": 6,
      "context": [
        {
          "id": "mutiurv",
          "author": "Ginger_Cat_Ventures",
          "body": "My TEETH are terrible because I eat a lot of sugary things and I swish drinks (that are sugary) around in my mouth. I cannot eat acidic things like fruit anymore because it hurts my teeth.",
          "created_utc": 1748488019.0
        }
      ]
    },
    {
      "id": "muz6hwx",
      "author": "ibelieveinaliens111",
      "body": "I’ve been unable to brush my teeth for a long time due to depression and arfid (taste + texture of toothpaste…) and I have the same problem :( It’s not so much it hurts, but some sugary foods always make my teeth feel odd! like a weird film.",
      "created_utc": 1748562039.0,
      "score": 4,
      "context": [
        {
          "id": "mutiurv",
          "author": "Ginger_Cat_Ventures",
          "body": "My TEETH are terrible because I eat a lot of sugary things and I swish drinks (that are sugary) around in my mouth. I cannot eat acidic things like fruit anymore because it hurts my teeth.",
          "created_utc": 1748488019.0
        }
      ]
    },
    {
      "id": "mv3sv8a",
      "author": "HowdyPez",
      "body": "I’m going to echo what Haydesigner mentioned. Teeth are extremely expensive to fix. Too many crowns and root canals to count. I’m lucky that the teeth I’ve lost are in the back so I haven’t needed implants (I have a tiny mouth so no one can really tell they are missing).\n\nOne thing that helped me was switching to sugar free drinks (took along time of phasing them in because - ARFID 😉).  I also found a dentist that works with my sensory issues, so I am extremely vigilant in keeping routine appointments (knowing how bad my teeth are).\n\nI got into a pretty good habit of brushing, then had a significant traumatic event, followed by diagnosis after diagnosis.  I am now having severe issues with my gums. I’m trying to get back on track, but it’s been hard. One thing I am starting is at least brushing without toothpaste, just to get the film off.  I  then floss (I’m better at flossing than brushing -no water involved and to get the stuff people can see).  On days I can’t even do that, I’ve been swishing with a mouthwash (not listerine, and a kids version - for obvious reasons).  If I can only get one completed, then I only done. If I get all 3 done, I consider it a win,",
      "created_utc": 1748626764.0,
      "score": 2,
      "context": [
        {
          "id": "mutiurv",
          "author": "Ginger_Cat_Ventures",
          "body": "My TEETH are terrible because I eat a lot of sugary things and I swish drinks (that are sugary) around in my mouth. I cannot eat acidic things like fruit anymore because it hurts my teeth.",
          "created_utc": 1748488019.0
        }
      ]
    },
    {
      "id": "muz69m2",
      "author": "ibelieveinaliens111",
      "body": "Same, except now I’m mad at myself even more for wasting money on that stuff 🤦‍♂️ and start thinking everyone else is dissapointed, too",
      "created_utc": 1748561963.0,
      "score": 3,
      "context": [
        {
          "id": "mutq4eg",
          "author": "allison777",
          "body": "Food waste is so true especially living with a parent that gets frustrated when they buy food you don’t end up eating. I feel so guilty I buy my own exposure foods now so nobody can be mad at me for wasting",
          "created_utc": 1748490966.0
        }
      ]
    },
    {
      "id": "muwuwvz",
      "author": "Murgbot",
      "body": "Honestly, McDonald’s is my absolute saviour when I travel! I absolutely love that I can just get cheeseburger and chips there in any country and it’ll taste exactly the same!",
      "created_utc": 1748537376.0,
      "score": 3,
      "context": [
        {
          "id": "muw3a0w",
          "author": "indiapursuingart",
          "body": "I desperately want to travel the world, ESPECIALLY Asia but I know I’d get extremely sick over there because I wouldn’t be able to eat anything :( makes me scared to travel despite how badly I want to see different places.",
          "created_utc": 1748529596.0
        }
      ]
    },
    {
      "id": "muz51ai",
      "author": "ibelieveinaliens111",
      "body": "I GET THIS SO MUCH!!! Everytime I find myself thinking living somewhere outside of the US, I remember how different the food is. Just imagining myself, clearly a white american, asking for accommodations from an international menu- I get so embarrassed 😭",
      "created_utc": 1748561552.0,
      "score": 3,
      "context": [
        {
          "id": "muw3a0w",
          "author": "indiapursuingart",
          "body": "I desperately want to travel the world, ESPECIALLY Asia but I know I’d get extremely sick over there because I wouldn’t be able to eat anything :( makes me scared to travel despite how badly I want to see different places.",
          "created_utc": 1748529596.0
        }
      ]
    },
    {
      "id": "mv7km3b",
      "author": "SapphireScully",
      "body": "i fully understand this. when i go visit my family in colombia it’s so difficult. i lived in indonesia for 3 months and pretty much just ate rice the entire time.",
      "created_utc": 1748676912.0,
      "score": 1,
      "context": [
        {
          "id": "muw3a0w",
          "author": "indiapursuingart",
          "body": "I desperately want to travel the world, ESPECIALLY Asia but I know I’d get extremely sick over there because I wouldn’t be able to eat anything :( makes me scared to travel despite how badly I want to see different places.",
          "created_utc": 1748529596.0
        }
      ]
    },
    {
      "id": "muxp1jw",
      "author": "___disaster___",
      "body": "oh yeah good old feeling like a burden\n\npeople around me know i have issues with eating and cooking so oftentimes they want to make something for me. and between veganism, IBS and ARFID, it's easier to just name those 5 foods that id eat on a good day instead of naming foods i can't eat. and no matter how enthusiastic they are about it, i can't shake the feeling of being a burden to everybody",
      "created_utc": 1748545793.0,
      "score": 4,
      "context": [
        {
          "id": "mutfuf5",
          "author": "crazyrainbowoctopus",
          "body": "Omg yes i waste so much food and feel horrible! I love all my friends and their families, but every time i go over and they try to be nice and cook for me and stuff I feel like a horrible person when I pick at it and dont eat it. One time i stayed a friends house for a weekend and i had to give her mom a list of the foods i eat because she wanted to accommodate me but i felt like such a burden",
          "created_utc": 1748486905.0
        }
      ]
    },
    {
      "id": "muz73g2",
      "author": "ibelieveinaliens111",
      "body": "My mom literally brought me over with my food for the weekend 😂",
      "created_utc": 1748562236.0,
      "score": 1,
      "context": [
        {
          "id": "mutfuf5",
          "author": "crazyrainbowoctopus",
          "body": "Omg yes i waste so much food and feel horrible! I love all my friends and their families, but every time i go over and they try to be nice and cook for me and stuff I feel like a horrible person when I pick at it and dont eat it. One time i stayed a friends house for a weekend and i had to give her mom a list of the foods i eat because she wanted to accommodate me but i felt like such a burden",
          "created_utc": 1748486905.0
        }
      ]
    },
    {
      "id": "muz4bdc",
      "author": "ibelieveinaliens111",
      "body": "Seriously!!! 😭 I, no joke, spent a lot of my time in sophomore/junior year sleeping on the floor. I always brought a big coat in so I could use it as a blanket. I have no clue how I passed 🙃",
      "created_utc": 1748561315.0,
      "score": 2,
      "context": [
        {
          "id": "muxd0qc",
          "author": "brrratmobile",
          "body": "the lack of energy and tiredness from not getting enough nutrients ☹️",
          "created_utc": 1748542356.0
        }
      ]
    },
    {
      "id": "mv8nke1",
      "author": "ReadBeforeUse",
      "body": "i can sleep for 10 hours and feel the same way i do when i sleep for 6.",
      "created_utc": 1748697243.0,
      "score": 2,
      "context": [
        {
          "id": "muxd0qc",
          "author": "brrratmobile",
          "body": "the lack of energy and tiredness from not getting enough nutrients ☹️",
          "created_utc": 1748542356.0
        }
      ]
    },
    {
      "id": "n267k95",
      "author": "CaptainCold-",
      "body": "This one hits me so hard:(  and then the pervasive tiredness feeds into my depression and I just don't move for a couple days",
      "created_utc": 1752067719.0,
      "score": 1,
      "context": [
        {
          "id": "muxd0qc",
          "author": "brrratmobile",
          "body": "the lack of energy and tiredness from not getting enough nutrients ☹️",
          "created_utc": 1748542356.0
        }
      ]
    },
    {
      "id": "muz4gre",
      "author": "ibelieveinaliens111",
      "body": "Seriously I get that last part!! My family jokes I’ll start a restaurant called “no nothing” where we only serve plain food 😂",
      "created_utc": 1748561365.0,
      "score": 4,
      "context": [
        {
          "id": "muwu56t",
          "author": "Murgbot",
          "body": "The utter stress that comes with someone inviting you out to eat and just having to find one thing on the menu that you can eat because you don’t want them to have to change to fit in with you for once 😭 \n\nGenuinely I HATE that my diet is so limited but the thought of changing it is horrible too. I would love if places could just put normal fucking meals on their menus instead of trying to be fancy 🙄",
          "created_utc": 1748537161.0
        }
      ]
    },
    {
      "id": "muz5e16",
      "author": "ibelieveinaliens111",
      "body": "God, all of this is so relatable. Going to the grocery store sucks because if I get hungry suddenly everything looks good, and then I can’t register what I’ll actually eat and what I won’t!! :(",
      "created_utc": 1748561671.0,
      "score": 7,
      "context": [
        {
          "id": "muv2asl",
          "author": "noivern_plus_cats",
          "body": "The good ol \"Oh man I love apples they taste so good and are the only fruit that's actively consistent in texture and flavor (dependent on variety but I love almost all varieties) I can't wait to get them\" and proceeding to eat three of them because I can't be bothered to eat sometimes or my body just doesn't want to put a cold and wet food into it because it'll make me feel colder...\n\nThe worst part for me (undiagnosed but well... considering I can't eat most vegetables, many fruits, all seafood...) is that I can't eat certain foods and people keep trying to convince me I'm too picky and doing this to myself. I can register that a dish made with certain foods looks good! I would love to eat a Krabby Patty if I could but the lettuce, tomatoes, and pickles would be too moist and crunchy and soft and sour and the bread would be soggy... I hate it so much because something looks so good but I know that it just won't be. I know that certain foods in certain ways just won't do well with any of my texture issues, and I HATE bitter foods and can not stand them. \n\nA lot of the time people will go \"oh but you liked this food that had this\" and the reason why is that the food wasn't made to where the ingredient goes against all of my texture and taste issues. I have no reason to hate something that has cooked onions and celery because I built up the courage over a decade and a half to finally try them and found out I can eat them if they're cooked to softness. If the food isn't a texture tornado and isn't bitter, but I don't like it, I just won't eat a lot either. The social pressure sucks because sure I can eat pad thai or my dad's porkchops, but I don't like either. So I just take a few bites until I'm \"full\" and then leave. There are just so many people who think they know more than you about what you like and so many people think that because you're \"a bit picky\", you're just being a jerk to everyone around you. They don't understand that being unable to eat certain foods physically and mentally without getting sick or vomiting is a genuine issue for you.",
          "created_utc": 1748516697.0
        }
      ]
    },
    {
      "id": "muz63k0",
      "author": "ibelieveinaliens111",
      "body": "I really wish it was more trustworthy to take food from others without worrying they did something to it. I’d start a drive where people can take the stuff I won’t eat.",
      "created_utc": 1748561907.0,
      "score": 6,
      "context": [
        {
          "id": "muutnie",
          "author": "AccomplishedPrint465",
          "body": "same as you, stuff spoils in my fridge so often and I feel like shit because people are literally starving because they can’t afford food. it makes me really emotional tbh",
          "created_utc": 1748512338.0
        }
      ]
    },
    {
      "id": "muz3v7o",
      "author": "ibelieveinaliens111",
      "body": "I hate this, too… I actually love going out to eat… but only when the food is so processed it’s predictable 😬\nUsually I find myself asking “does anyone want this?” a few times at the end of the meal because I feel bad leaving it all.",
      "created_utc": 1748561168.0,
      "score": 4,
      "context": [
        {
          "id": "muycyp1",
          "author": "BillyYumYumTwo-byTwo",
          "body": "I don’t like going out to eat, but it’s pretty hard to avoid. My husband is amazing at being accommodating, but you never know if your meal will be not what you were expecting. I hate the looks I get from waiters when they see my plate. And even when the food is good, my body is not used to eating an entire restaurant sized meal. Sometimes I ask for a box, even though I mostly can’t do leftovers, just to avoid the judgmental look (and I’m sure 95% of the time they aren’t judgey, just maybe a bit confused or even mildly concerned)",
          "created_utc": 1748552660.0
        }
      ]
    },
    {
      "id": "muz4ocb",
      "author": "ibelieveinaliens111",
      "body": "Hope you feel better!! :( 💐💞",
      "created_utc": 1748561434.0,
      "score": 3,
      "context": [
        {
          "id": "muwb38a",
          "author": "Propsicle405",
          "body": "Osteopenia and osteoporosis by far.  This year I fractured my back in two places, and also broke my shoulder :(",
          "created_utc": 1748531792.0
        }
      ]
    },
    {
      "id": "muz4531",
      "author": "ibelieveinaliens111",
      "body": "I totally get it. I saw kids my age actually enjoying fruits and vegetables and thought I was broken for the longest time. That was the specific wording I used- I’m sure my mom could count all the different times I cried because I was “broken” :( I hope you know to trust your decisions now- or at least understand where they come from.",
      "created_utc": 1748561257.0,
      "score": 4,
      "context": [
        {
          "id": "muxsonn",
          "author": "Angelangepange",
          "body": "For me the worse consequences was becoming afraid to make any choice. Not just food related.    \nBecause my body only wants to eat \"bad foods\" I started believing I was unable to make good choices in any context.   \n    \nAs a kid I started believing I was evil because \"good children eat vegetables\" and I was unable to (back then I didn't know what arfid was and thought I was the only person like this)    \nBecause I also had undiagnosed adhd my family told me I did not care about them because I kept forgetting things and it all cemented into my head that I was just genetically evil or something.   \nI think the worst of all was the mental health stuff that came along due to no one understanding what was going on with me.",
          "created_utc": 1748546848.0
        }
      ]
    },
    {
      "id": "muz81rj",
      "author": "ibelieveinaliens111",
      "body": "Anemia is the worssst 😭 Either I eat too much and get sick or I eat too little and get loopy!",
      "created_utc": 1748562549.0,
      "score": 2,
      "context": [
        {
          "id": "muyhru2",
          "author": "Puzzleheaded-Arm4170",
          "body": "Being deficient in EVERYTHING! B12, Iron, magnesium, vitamin D, vitamin B6, vitamin C… etc. all the complications, symptoms, and knowing that most vitamin supplements take months to kick in!\n\nSome complications that I ( personally) struggle with:\n\nSevere anemia\nScurvy \nPeripheral neuropathy \nWeakness\nFatigue\nConstipation\nDiarrhea\nHeart conditions\nPale/gaunt\n\nAnd that’s just me! I imagine for anyone else the list could be far more expansive, and people don’t like to hear the same complaints all the time, but it’s a real struggle!",
          "created_utc": 1748554096.0
        }
      ]
    },
    {
      "id": "muz4ly2",
      "author": "ibelieveinaliens111",
      "body": "I’m totally the opposite… I think I wait until the food expires so I DONT feel guilty throwing it out!! 😬 I’m glad to hear you’re getting better at it though!",
      "created_utc": 1748561413.0,
      "score": 4,
      "context": [
        {
          "id": "muwcf2d",
          "author": "Gashi_The_Fangirl_75",
          "body": "Intentionally eating spoiled food. It takes me hours to eat, so oftentimes my food will go bad because it’s been sitting out for too long before I can finish a reasonable portion, and then I’ll eat it anyways because I feel so guilty for wasting it. I am getting better about this one though!",
          "created_utc": 1748532167.0
        }
      ]
    },
    {
      "id": "muz7kyl",
      "author": "ibelieveinaliens111",
      "body": "I’m on ADHD meds too. My appetite kind of evens out, until my meds get delayed and I get off track 🫠",
      "created_utc": 1748562396.0,
      "score": 2,
      "context": [
        {
          "id": "mux0hi6",
          "author": "Suspicious_Low8430",
          "body": "Being on ADHD medication and having ARFID. I’m 23 and have been on XR stimulants for over 10 years. My appetite is so fucked up and makes it way harder to eat as well as giving me chronic dry mouth. I panic every morning cuz eating breakfast is so hard because I wake up take my pill and have about an hour or so to eat before it kicks in which obviously puts more pressure on breakfast.",
          "created_utc": 1748538907.0
        }
      ]
    },
    {
      "id": "mutmza2",
      "author": "No_Reach3179",
      "body": "missed a few calorie payments & the repo man took my digestive system😩",
      "created_utc": 1748489651.0,
      "score": 23,
      "context": [
        {
          "id": "muth072",
          "author": "No_Reach3179",
          "body": "C O N S T I P A T I O N 🗣️  i can’t be the only one who’s (at one point) eaten so little that their colon stopped working to save energy",
          "created_utc": 1748487331.0
        },
        {
          "id": "mutkr3h",
          "author": "Desert_Fairy",
          "body": "As a cost saving measure, The light at the end of the tunnel has been turned off. \n\nI second this, constipation is the absolute worst.",
          "created_utc": 1748488755.0
        }
      ]
    },
    {
      "id": "mutr7lw",
      "author": "No_Reach3179",
      "body": "Yup. It makes sense once you think about it like if you’re not eating, you aren’t making poop. Don’t need to poop if you don’t have anything to poop🥲 Dehydration & not enough fiber also contribute to it. \n\nBasically if you’re not using a body part enough, your body kinda shuts the lights off til you pay your bills lolll. Preserved energy is redirected to vital organ function, prioritizing them to perform more efficiently with limited energy.",
      "created_utc": 1748491435.0,
      "score": 13,
      "context": [
        {
          "id": "muth072",
          "author": "No_Reach3179",
          "body": "C O N S T I P A T I O N 🗣️  i can’t be the only one who’s (at one point) eaten so little that their colon stopped working to save energy",
          "created_utc": 1748487331.0
        },
        {
          "id": "muto754",
          "author": "OneEyedTreeHugger",
          "body": "Wait, that’s a thing?! That might explain some stuff recently…",
          "created_utc": 1748490155.0
        }
      ]
    },
    {
      "id": "muvk039",
      "author": "acnerd5",
      "body": "Honestly I wouldn't be surprised. I'm really good at overthinking things when it comes to food now. I won't make myself food because if I throw it out I feel super guilty for wasting food, my parents always made a big deal out of it. \n\nTbf, they are also boomers and both of them grew up poor af in the 1940s and 50s, so they havent had a lot. My dad's family had 7 kids and both parents were immigrants and barely spoke English, and my mom's family was single mom for most of her life, so they grew up POOR. You ate what was there or nothing at all. \n\nUnfortunately this is one of those times where their insecurities made issues in my head down the line on top of the ARFID because now I hear in my head that Im an awful person leaving food behind - it took their food control and insecurity issues and made them a whole new level in my head. \n\nIf you can, its been a big help for me having someone willing to make food for me and help me find ways to feel its not wasted. My husband is happy to make things during flare ups, like the last few months have been hard... so he gets home from work, Ive been feeding the toddler all day and he asks if I ate. No... so he kinda just steps in and makes food after naming things he could make and if I don't finish it, or can't even start it, he helps me through the mental issues of wasting it. \"It's not wasted, it's just not being eaten by you.\" If it's something that can have the bitten parts cut off, he trims it up and if my toddler was trying to steal it he'll cut it up for her so I don't feel guilty. Sometimes he just cuts it up smaller to begin with so I dont even need to think to bite it - i can do \"mindless snack\" style eating and split it with her from the start, so it comes across as \"i can have what i can, and the rest is hers\" and I'm not as stressed. If I cant cut it up or the toddler doesnt want it, and it's dog friendly? My dog has a great snack!\n\nYou deserve to eat. Your body deserves it. Its been through so much already <3 try and find a \"food buddy\", any friends or family members that are willing to just have a meal with you and help with talking through it. Its hard, I know it is. I have 2 friends that are on board too - and it turns out they are willing to help just as much as I would be for them :)\n\nYou've got this. Try and have an extra snack today, and I'll try too. Ok?",
      "created_utc": 1748523623.0,
      "score": 7,
      "context": [
        {
          "id": "musuvd1",
          "author": "acnerd5",
          "body": "The fear of wasting food though omg - because I've wasted so much food thanks to my ARFID, has now made my ARFID worse - because of course, why not have fears about not finishing food to make eating food harder?\n\nThat's one of the biggest consequences that has coincidentally led to things being worse :(",
          "created_utc": 1748479647.0
        },
        {
          "id": "muuaq1m",
          "author": "cattbug",
          "body": "Oh, is this it? I'd been wondering why my food issues have gotten worse since being in remission from anorexia 🫠",
          "created_utc": 1748501287.0
        }
      ]
    },
    {
      "id": "muzckmu",
      "author": "purplechunkymonkey",
      "body": "As a parent, it gets frustrating. But we've found a method with our daughter. There's a restaurant that my husband and I like. We go like twice a year. When we go, we grab her McDonald's on the way. She eats in the car. Then she's free to get a lemonade and cheese sticks if she wants. \n\nBut we will also make the 2 hour drive to get the cheese sticks she really likes. They have good burgers. She gets her own thing of cheese sticks.",
      "created_utc": 1748564100.0,
      "score": 3,
      "context": [
        {
          "id": "mute676",
          "author": "Quinns_Quirks",
          "body": "The social anxiety around food 😅\nI have a near fear of eating in public. At least eating around people I know, because I know comments will be made.",
          "created_utc": 1748486303.0
        },
        {
          "id": "muy5f1u",
          "author": "kippenon",
          "body": "This omg! Every time I'm able to eat something/we go out to eat, my family ALWAYS makes a comment about my eating habits. I've told them so many times why I can't eat like they can, and it's always met with the same dismissive reactions. I know they don't realize that their comments make things worse, but it still sucks that if I were to explain that to them, they'd still do it. :p\n\nPlus their comments inadvertently caused my inability to eat in front of anyone at all, even supportive friends of mine.",
          "created_utc": 1748550499.0
        }
      ]
    },
    {
      "id": "muzts2e",
      "author": "lembready",
      "body": "Feel this. I'm still getting \"Oh, and of COURSE you're going for [safe food]\", \"Oh, [deadname]'s going for [safe food] again\", etc. when I go to my grandparents' for holidays. This is actually an improvement over how things used to be, but it *still* stings and leads to me not eating with the family so I can eat at all. 😅",
      "created_utc": 1748570007.0,
      "score": 2,
      "context": [
        {
          "id": "mute676",
          "author": "Quinns_Quirks",
          "body": "The social anxiety around food 😅\nI have a near fear of eating in public. At least eating around people I know, because I know comments will be made.",
          "created_utc": 1748486303.0
        },
        {
          "id": "muy5f1u",
          "author": "kippenon",
          "body": "This omg! Every time I'm able to eat something/we go out to eat, my family ALWAYS makes a comment about my eating habits. I've told them so many times why I can't eat like they can, and it's always met with the same dismissive reactions. I know they don't realize that their comments make things worse, but it still sucks that if I were to explain that to them, they'd still do it. :p\n\nPlus their comments inadvertently caused my inability to eat in front of anyone at all, even supportive friends of mine.",
          "created_utc": 1748550499.0
        }
      ]
    },
    {
      "id": "muxq4pi",
      "author": "___disaster___",
      "body": "same here with orthorexia. almost always (or maybe always, idk) im \"getting better\" by jumping right in some new wonderful plan for making myself healthy again, obsessing about new and old ideas for deficiencies and trying desperately to fix those issues (which often pushes me deeper into ARFID because *maybe, just maybe* eating canned beans when you hate beans the most out of all foods known to humanity is not a good idea - just take a guess how this one ended for me; and i just wanted to have enough protein in my diet)",
      "created_utc": 1748546108.0,
      "score": 4,
      "context": [
        {
          "id": "mut0pcm",
          "author": "Dykeryy",
          "body": "The fact that it can make other eating disorders worse or more likely. I was anorexic for a while, and ARFID made it a hundred times worse, because I was already used to not eating, and other people praised me for being able to not eat for days, which just fed into the disordered mindset.",
          "created_utc": 1748481642.0
        },
        {
          "id": "muticoc",
          "author": "No_Reach3179",
          "body": "Yup, mines definitely crossed with orthorexia/health anxiety. I have no body image issues but I have paranoia about food harming me. Doesn’t matter if it’s food poisoning, “toxic” ingredients, choking, contamination, weird pieces of meat, unknown or hidden ingredients, basically anything used to prevent me from eating. \n\nSince then I’ve learned any food is better than none. Even if the only food someone was willing to eat were junk foods, eating junk everyday will always be better for you than not eating at all. Any calories will take you farther than no calories.",
          "created_utc": 1748487830.0
        }
      ]
    },
    {
      "id": "muz6z2y",
      "author": "ibelieveinaliens111",
      "body": "Because when you did explain, they just moved the two to different plates after they were touching, and you can’t just say it’ll still taste like they’re touching!!! 😭",
      "created_utc": 1748562196.0,
      "score": 6,
      "context": [
        {
          "id": "muuzzj4",
          "author": "strawberrywool",
          "body": "how frustrated you feel with yourself all the time like why am i crying over a slice of toast💔",
          "created_utc": 1748515623.0
        },
        {
          "id": "muwuk7u",
          "author": "Murgbot",
          "body": "This! Especially when it happens in public and you can’t explain that the reason you’re crying is because your safe food is touching unsafe food and you’ll be able to taste the remnants of the unsafe food!!!",
          "created_utc": 1748537279.0
        }
      ]
    },
    {
      "id": "muz5c4b",
      "author": "QuixoticRuin",
      "body": "The wooooorst!",
      "created_utc": 1748561654.0,
      "score": 3,
      "context": [
        {
          "id": "muuzzj4",
          "author": "strawberrywool",
          "body": "how frustrated you feel with yourself all the time like why am i crying over a slice of toast💔",
          "created_utc": 1748515623.0
        },
        {
          "id": "muwuk7u",
          "author": "Murgbot",
          "body": "This! Especially when it happens in public and you can’t explain that the reason you’re crying is because your safe food is touching unsafe food and you’ll be able to taste the remnants of the unsafe food!!!",
          "created_utc": 1748537279.0
        }
      ]
    },
    {
      "id": "mv5zwgk",
      "author": "Constant_Recipe_2832",
      "body": "It took me such a long time to realize I hated brushing my teeth because I hate the taste of toothpaste!!! I never connected the two, but then tried out a strawberry flavored children’s toothpaste and now I’m doing so much better at brushing twice a day (specifically before bed) … It’s still a sensory nightmare but genuinely kinda delicious so it helps a lot!",
      "created_utc": 1748651420.0,
      "score": 2,
      "context": [
        {
          "id": "mutiurv",
          "author": "Ginger_Cat_Ventures",
          "body": "My TEETH are terrible because I eat a lot of sugary things and I swish drinks (that are sugary) around in my mouth. I cannot eat acidic things like fruit anymore because it hurts my teeth.",
          "created_utc": 1748488019.0
        },
        {
          "id": "muz6hwx",
          "author": "ibelieveinaliens111",
          "body": "I’ve been unable to brush my teeth for a long time due to depression and arfid (taste + texture of toothpaste…) and I have the same problem :( It’s not so much it hurts, but some sugary foods always make my teeth feel odd! like a weird film.",
          "created_utc": 1748562039.0
        }
      ]
    },
    {
      "id": "mvuvu14",
      "author": "thisislikemytenthalt",
      "body": "McDonald’s and dominos and 7 eleven were my main food source in Japan (I got apple slices, donuts, and cheese sticks consistently at the 7 eleven)",
      "created_utc": 1748992306.0,
      "score": 2,
      "context": [
        {
          "id": "muw3a0w",
          "author": "indiapursuingart",
          "body": "I desperately want to travel the world, ESPECIALLY Asia but I know I’d get extremely sick over there because I wouldn’t be able to eat anything :( makes me scared to travel despite how badly I want to see different places.",
          "created_utc": 1748529596.0
        },
        {
          "id": "muwuwvz",
          "author": "Murgbot",
          "body": "Honestly, McDonald’s is my absolute saviour when I travel! I absolutely love that I can just get cheeseburger and chips there in any country and it’ll taste exactly the same!",
          "created_utc": 1748537376.0
        }
      ]
    },
    {
      "id": "mv0r9je",
      "author": "3rdthrow",
      "body": "I imagine every food allergy sufferer in the World flocking yo your restaurant, where they can finally eat food, without fear of cross-contamination.",
      "created_utc": 1748584062.0,
      "score": 4,
      "context": [
        {
          "id": "muwu56t",
          "author": "Murgbot",
          "body": "The utter stress that comes with someone inviting you out to eat and just having to find one thing on the menu that you can eat because you don’t want them to have to change to fit in with you for once 😭 \n\nGenuinely I HATE that my diet is so limited but the thought of changing it is horrible too. I would love if places could just put normal fucking meals on their menus instead of trying to be fancy 🙄",
          "created_utc": 1748537161.0
        },
        {
          "id": "muz4gre",
          "author": "ibelieveinaliens111",
          "body": "Seriously I get that last part!! My family jokes I’ll start a restaurant called “no nothing” where we only serve plain food 😂",
          "created_utc": 1748561365.0
        }
      ]
    },
    {
      "id": "mv1439a",
      "author": "noivern_plus_cats",
      "body": "Exactly! I get so hungry seeing everyone else eating and when it's my turn I'm just...bleck because a food I don't like is there",
      "created_utc": 1748591309.0,
      "score": 4,
      "context": [
        {
          "id": "muv2asl",
          "author": "noivern_plus_cats",
          "body": "The good ol \"Oh man I love apples they taste so good and are the only fruit that's actively consistent in texture and flavor (dependent on variety but I love almost all varieties) I can't wait to get them\" and proceeding to eat three of them because I can't be bothered to eat sometimes or my body just doesn't want to put a cold and wet food into it because it'll make me feel colder...\n\nThe worst part for me (undiagnosed but well... considering I can't eat most vegetables, many fruits, all seafood...) is that I can't eat certain foods and people keep trying to convince me I'm too picky and doing this to myself. I can register that a dish made with certain foods looks good! I would love to eat a Krabby Patty if I could but the lettuce, tomatoes, and pickles would be too moist and crunchy and soft and sour and the bread would be soggy... I hate it so much because something looks so good but I know that it just won't be. I know that certain foods in certain ways just won't do well with any of my texture issues, and I HATE bitter foods and can not stand them. \n\nA lot of the time people will go \"oh but you liked this food that had this\" and the reason why is that the food wasn't made to where the ingredient goes against all of my texture and taste issues. I have no reason to hate something that has cooked onions and celery because I built up the courage over a decade and a half to finally try them and found out I can eat them if they're cooked to softness. If the food isn't a texture tornado and isn't bitter, but I don't like it, I just won't eat a lot either. The social pressure sucks because sure I can eat pad thai or my dad's porkchops, but I don't like either. So I just take a few bites until I'm \"full\" and then leave. There are just so many people who think they know more than you about what you like and so many people think that because you're \"a bit picky\", you're just being a jerk to everyone around you. They don't understand that being unable to eat certain foods physically and mentally without getting sick or vomiting is a genuine issue for you.",
          "created_utc": 1748516697.0
        },
        {
          "id": "muz5e16",
          "author": "ibelieveinaliens111",
          "body": "God, all of this is so relatable. Going to the grocery store sucks because if I get hungry suddenly everything looks good, and then I can’t register what I’ll actually eat and what I won’t!! :(",
          "created_utc": 1748561671.0
        }
      ]
    },
    {
      "id": "muz6w3w",
      "author": "Propsicle405",
      "body": "Awwww thank you!",
      "created_utc": 1748562169.0,
      "score": 2,
      "context": [
        {
          "id": "muwb38a",
          "author": "Propsicle405",
          "body": "Osteopenia and osteoporosis by far.  This year I fractured my back in two places, and also broke my shoulder :(",
          "created_utc": 1748531792.0
        },
        {
          "id": "muz4ocb",
          "author": "ibelieveinaliens111",
          "body": "Hope you feel better!! :( 💐💞",
          "created_utc": 1748561434.0
        }
      ]
    },
    {
      "id": "mv19ipr",
      "author": "Angelangepange",
      "body": "Thank you, I'm working on it, trying to see them as neutral and just trying to be ok with just things going wrong some times 🥲   \nI hope you too can feel whole and not broken anymore",
      "created_utc": 1748594536.0,
      "score": 2,
      "context": [
        {
          "id": "muxsonn",
          "author": "Angelangepange",
          "body": "For me the worse consequences was becoming afraid to make any choice. Not just food related.    \nBecause my body only wants to eat \"bad foods\" I started believing I was unable to make good choices in any context.   \n    \nAs a kid I started believing I was evil because \"good children eat vegetables\" and I was unable to (back then I didn't know what arfid was and thought I was the only person like this)    \nBecause I also had undiagnosed adhd my family told me I did not care about them because I kept forgetting things and it all cemented into my head that I was just genetically evil or something.   \nI think the worst of all was the mental health stuff that came along due to no one understanding what was going on with me.",
          "created_utc": 1748546848.0
        },
        {
          "id": "muz4531",
          "author": "ibelieveinaliens111",
          "body": "I totally get it. I saw kids my age actually enjoying fruits and vegetables and thought I was broken for the longest time. That was the specific wording I used- I’m sure my mom could count all the different times I cried because I was “broken” :( I hope you know to trust your decisions now- or at least understand where they come from.",
          "created_utc": 1748561257.0
        }
      ]
    },
    {
      "id": "muu2e5h",
      "author": "Desert_Fairy",
      "body": "Yeah… I don’t have issues with calories, my issues are fiber based. \n\nAnd when it gets so rock hard that you blow out the capillaries in your eyes and face, you know you have a problem.",
      "created_utc": 1748496762.0,
      "score": 15,
      "context": [
        {
          "id": "muth072",
          "author": "No_Reach3179",
          "body": "C O N S T I P A T I O N 🗣️  i can’t be the only one who’s (at one point) eaten so little that their colon stopped working to save energy",
          "created_utc": 1748487331.0
        },
        {
          "id": "mutkr3h",
          "author": "Desert_Fairy",
          "body": "As a cost saving measure, The light at the end of the tunnel has been turned off. \n\nI second this, constipation is the absolute worst.",
          "created_utc": 1748488755.0
        },
        {
          "id": "mutmza2",
          "author": "No_Reach3179",
          "body": "missed a few calorie payments & the repo man took my digestive system😩",
          "created_utc": 1748489651.0
        }
      ]
    }
  ]
}