{
  "id": "1kxzqjd",
  "subreddit": "ARFID",
  "author": "Previous_Deal4481",
  "created_utc": 1748486038.0,
  "title": "Am I the only obese person with ARFID?",
  "selftext": "Ok so I’ve been reading posts on here and let me first say y’all are strong and resilient and it’s so amazing to see people who are trying to get better and building community.\n\nThat said I feel like I must be some kind of unicorn?  Im diagnosed restrictive of food based on fear of allergic reactions. I have about 5-7 things I cycle through and don’t branch out for fear of dying.  I am a mature and self reflective adult. I am aware this is a mental health issue etc.  but just because I can’t eat more than a few safe foods doesn’t mean I don’t eat at all.  As a matter of fact through the power of getting older and PCOS I’m quite a bit overweight (by about 80 pounds) for my height.  I can’t help but feel like I’m missing something? Are there people like me in this community? I don’t want to dismiss the absolute horrible struggle that those with fear of eating for other more dangerous reasons. It’s just I’m feeling a little imposter syndrome here. ",
  "url": "https://www.reddit.com/r/ARFID/comments/1kxzqjd/am_i_the_only_obese_person_with_arfid/",
  "score": 193,
  "num_comments": 129,
  "comments": [
    {
      "id": "muteqlq",
      "author": "Peanutbutternmtn2",
      "body": "Nope. My diet consists of horrible fattening things too. Right there with ya pal. Only reason I’m not like, morbidly obese, is bc I work out a ton.",
      "created_utc": 1748486509.0,
      "score": 155,
      "context": []
    },
    {
      "id": "mutf6e0",
      "author": "tiniestfriend",
      "body": "Me too, friend 🤍 I am overweight and mostly cause my safe foods are mostly just fast food 😭 plus it doesn’t help that I am bad at moderation with them. I always feel so bad about it but idk what to do. I also have PCOS so that doesn’t help either but I feel you, honey. You’re not alone 🫶🏼",
      "created_utc": 1748486664.0,
      "score": 99,
      "context": []
    },
    {
      "id": "mutg329",
      "author": "SituationSad4304",
      "body": "I highly doubt it as a fellow sufferer (who is overweight) who works in the medical field. Obese patients tend to be picky and only eat foods that objectively should be eaten in moderation (chips, McDonald’s, soda, chain pizza). Which I understand intimately since they’re consistent in texture and flavor no matter what town you’re in. But it’s hard for people who are dangerously underweight from ARFID to get appropriate treatment without a more “normal” eating disorder comorbidity. People who can eat enough calories to appear normal face both medical misunderstanding and fat bias",
      "created_utc": 1748486995.0,
      "score": 75,
      "context": []
    },
    {
      "id": "muter19",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1748486513.0,
      "score": 20,
      "context": []
    },
    {
      "id": "mutfecw",
      "author": "crazyrainbowoctopus",
      "body": "Hi! I am also overweight with arfid. I think it is mostly because of my thyroid disease but also because my safe foods are mostly processed foods",
      "created_utc": 1748486743.0,
      "score": 19,
      "context": []
    },
    {
      "id": "mutjckq",
      "author": "OneEyedTreeHugger",
      "body": "I’m also fairly overweight. A few foods I’ve managed to add in the last couple of years are mostly healthy (roasted carrots and roasted broccoli), but the rest are highly processed foods or refined carbs. \n\nI really hate it because people are constantly telling me to eat all of these other more healthy foods. And I’m trying so hard. But, I just can’t. Or at least, I can’t in a way that is in any way sustainable. And so few people understand that. Especially the doctor. I hate going and being told that I’m deficient in all of these vitamins and minerals and need to eat more protein and less of everything I do actually manage to eat. I already know what would be better to eat instead; they don’t have to keep telling me.",
      "created_utc": 1748488211.0,
      "score": 19,
      "context": []
    },
    {
      "id": "mutlv6w",
      "author": "rigathrow",
      "body": "yep. i starve myself a lot (sometimes unintentionally, sometimes on purpose) and as a whole, i don't really experience hunger? the feeling of weakness and my blood pressure dropping reminds me i need to eat but i get no signals before i get to that point. i don't crave anything or have any desire to eat. \n\ni don't like the vast majority of foods and then foods that i can tolerate, i'm so bored of. literally just pizza, plain burgers, or processed chicken and potato in various shapes. i don't snack at all. eating is an absolute chore for me that i can and do so easily go without doing. i usually have one meal a day and can't comprehend how or why people have three plus snacks.\n\nstill fat though. i feel like it makes it impossible for people to take me and my EDs seriously. i *should* be underweight given it all but i'm just not. shit sucks.",
      "created_utc": 1748489202.0,
      "score": 13,
      "context": []
    },
    {
      "id": "muthp2k",
      "author": "Affectionate_Rub3318",
      "body": "I am 5'4 and 250, so yeah, you're not the only one. I have a fear similar, but instead of an allergic reaction it is more chaotic like my brain saying ill 'literally explode' or 'projectile vomit', and more chaos like that. Im working on losing weight but it is HARD!",
      "created_utc": 1748487588.0,
      "score": 10,
      "context": []
    },
    {
      "id": "muti5fx",
      "author": "sympathizings",
      "body": "You are definitely not alone, I’m considered medically obese and also have diagnosed ARFID.",
      "created_utc": 1748487755.0,
      "score": 9,
      "context": []
    },
    {
      "id": "mutjq8r",
      "author": "Tall_Wolf1093",
      "body": "My ARFID is mostly texture and taste based so I have a fair bit of unhealthy fatty foods as safe foods. I am a bit overweight but if I weren’t a 6 ft lady and hyperactive as heck, I’d definitely be closer to the obese side.",
      "created_utc": 1748488356.0,
      "score": 8,
      "context": []
    },
    {
      "id": "mutmi6z",
      "author": "saintceciliax",
      "body": "I’m headed there now that I’m getting older. I eat like shit. None of my safe foods are good for me. You’re not alone.",
      "created_utc": 1748489459.0,
      "score": 9,
      "context": []
    },
    {
      "id": "mutn983",
      "author": "kittysparkles85",
      "body": "Yup overweight with huge weight fluctuations because of health issues and drugs.",
      "created_utc": 1748489765.0,
      "score": 6,
      "context": []
    },
    {
      "id": "muultrs",
      "author": "Isadum",
      "body": "I get how you’re feeling, I was starting to think that people were getting ARFID confused with other eating disorders. But I realized ARFID is a wide range. There are definitely overweight people. I’m one of them. I crave sugar and carbs they are consistent and safe. When I find a food I like I tend to binge eat it until I’m sick of it which can take a long time.",
      "created_utc": 1748507784.0,
      "score": 5,
      "context": []
    },
    {
      "id": "muvn57h",
      "author": "NorthStarMidnightSky",
      "body": "I'm an emotional eater with a short food acceptable list. That means I eat foods I shouldn't more often and have been morbidly obese my whole life. Doctors don't believe me on the ARFID because \"clearly, I eat\". \n\nIf I could handle salads more often and be emotionally sated, then maybe I wouldn't be overweight, but I'd rather not eat at all which causes it's own problems and no one will help me navigate this.",
      "created_utc": 1748524679.0,
      "score": 7,
      "context": []
    },
    {
      "id": "mutnwvo",
      "author": "carbonatedcobalt",
      "body": "nope. me too. i'm at like 285lb and its because i drink too much soda and have fast food/junk foods as my safe options",
      "created_utc": 1748490037.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mutyel6",
      "author": "socraticalastor",
      "body": "I am too! I actually don’t eat a ton, but when I do eat, I “snake meal” (1 meal for a 24 hour period) which isn’t ideal… I also have multiple physical disabilities that cause chronic pain flares and fainting when exercising, so despite my absolute love for sports and physical activity, as well as my interest in nutrition, I’m 5’9 and ~220-230.",
      "created_utc": 1748494755.0,
      "score": 4,
      "context": []
    },
    {
      "id": "muurhqk",
      "author": "AppropriatePick3927",
      "body": "Overweight with ARFID and PCOS here! You are not alone but I get the feeling. I have to keep reminding myself that too.. \nLots of love ❤️",
      "created_utc": 1748511113.0,
      "score": 5,
      "context": []
    },
    {
      "id": "muv29cw",
      "author": "XxLexxyXx",
      "body": "I am overweight and some of my doctor's paperwork will say that I have obesity though that's based off of BMI and I'm kind of rolling my eyes. I developed arphid after trauma. So it came on later in my adult life and it came with a fear of anaphylaxis and death. I've been seeing a lot of progress lately because I have to get gallbladder removal surgery and that completely upended most of my safe foods because I was so afraid of eating my safe foods lately because I don't want another gallbladder attack is that hurt. \n\nI definitely feel the frustration of not being taken seriously because it's already hard enough that I feel most places don't recognize our eating disorder. And then there's like the furthest stigma of not being critically underweight so it's almost like well you're fine. And I feel like even worse yet the fat phobia that we see in the medical system that would say oh well you should probably lose weight anyways. But the body doesn't work like that. When you're restricting as much as you probably are You're probably not going to lose weight. Or you know you might just be eating enough calories it's just not nutrient dense calories you know?\n\nOne thing that's really helped me in recovery is doing EMDR. I'm not saying it's a cure-all, but it could be worth looking into. I've also been seeing an individualized eating disorder specialist and that's helped too. Again, though my situation is different because I haven't always had this eating disorder it came on much later in my adult life and I actually used to love eating and I lived abroad for 2 years and I enjoyed trying new foods and whatnot so it's been quite the 180 to go from that to being afraid to eat most food and only having a small selection of foods that I feel okay eating.",
      "created_utc": 1748516679.0,
      "score": 5,
      "context": []
    },
    {
      "id": "muvmlte",
      "author": "RealityTVfan28",
      "body": "I’ve had weight issues my entire life. All my safe foods are high in calories except very few. I’m in my late 60’s and have lost 60 pounds like 3 years ago. I’m on weight watchers and I take weight loss injections. Lucky for me I’m a super responder so on a small maintenance dose now.  Weight Watchers keeps me accountable and offers support and lots of food ideas I can try. \n\nBad part of all? I’ve noticed I’m eating fewer things. Eating peanut butter and crackers daily as I know portion I can have and maintain my weight. So that concerns me. Like did the medication make my ARFID more dominant? Or is it just me sticking with what I know?",
      "created_utc": 1748524501.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mutsug4",
      "author": "positively-negative7",
      "body": "nah i used to be fat but i lost 50 pounds in 4 months with pure willpower and gym (and safe foods)",
      "created_utc": 1748492155.0,
      "score": 3,
      "context": []
    },
    {
      "id": "muv3klg",
      "author": "Avbitten",
      "body": "present!",
      "created_utc": 1748517271.0,
      "score": 3,
      "context": []
    },
    {
      "id": "muvynpd",
      "author": "nalycat",
      "body": "I am overweight and I chronically undereat. I don't undereat to lose weight, it's just ARFID being ARFID. I don't know why I'm overweight. A dietician said I'm holding on to fat from the few unhealthy things I do eat (and drink soda). She says once I start getting more regular meals, I will actually lose weight. I'm skeptical, but she swears she's seen it happen",
      "created_utc": 1748528271.0,
      "score": 3,
      "context": []
    },
    {
      "id": "muwqdiz",
      "author": "NayanaGor",
      "body": "Nope!\n\nWhile I am not obese ANYMORE, I was diagnosed at 255lbs when I lost about half of my safe foods due to severe stress conditions and it started causing issues at home.\n\nWe missed it for over 30 years because I had a bunch of safe foods that were processed, fatty junk and I ate entirely too much (BED as well, though I've mostly conquered that). I was clearly not starving to death, even though I could go days without eating for not having access to safe food.\n\nI am thankfully in a much better place with food now, but it's still a struggle.",
      "created_utc": 1748536105.0,
      "score": 3,
      "context": []
    },
    {
      "id": "muwv8vo",
      "author": "Agitated-Sir8926",
      "body": "Oh no I am here too. Almost 300 pounds, partially because all of my safe foods are carbs or super processed stuff. Any attempts at weight loss are a big trigger to just stop eating all together. Remember also that just because you're overweight doesn't mean you have all your nutrition needs met, which can contribute to health issues. You aren't alone. <3",
      "created_utc": 1748537467.0,
      "score": 3,
      "context": []
    },
    {
      "id": "muufr48",
      "author": "ageckonamedelaine",
      "body": "It is completely normal because arfid is different per person! Most of my safe foods are very unhealthy, but my arfid causes me to not be able to eat a lot. I get a good amount of my daily calories out of crisps and jelly beans because it is easy to eat when I am having a bad day with arfid, it is food that is the same every time unlike stuff like apples",
      "created_utc": 1748504189.0,
      "score": 2,
      "context": []
    },
    {
      "id": "muuwkm2",
      "author": "funkydyke",
      "body": "Nope. Plenty of fat people have ARFID. Myself included. ARFID contributed a lot to my weight gain.",
      "created_utc": 1748513897.0,
      "score": 2,
      "context": []
    },
    {
      "id": "muw0b2m",
      "author": "jodiecomerstan",
      "body": "I’m 177lbs and I have it! Mine was bc of trauma. I had H Pylori",
      "created_utc": 1748528745.0,
      "score": 2,
      "context": []
    },
    {
      "id": "muwgn9i",
      "author": "ApollonNike",
      "body": "THANK YOU for saying this because when I found out about ARFID and realized I have it, the fact that being thin is a huge symptom made me rethink if I actually do have ARFID or not.\n\nMy safe foods are all carbohydrate based (like plain pasta, french fries etc.) and I can't eat cheese (it has to be certain cheese and 100% cooked for me to just eat it), vegetables (i only eat lettuce, carrot and onion, I hate tomato with my whole heart it makes me throw up even something touches it, it also gives me wierd ick idk why), meat (I only eat fish as a meat, especially no no no chicken, the smell is enough to make me run away). Also I drink a lot of milk so my diet is like FAT FAT FAT.\n\nSo I am fat too. I was really thin till the end of primary school, probably because I was an energetic child I moved around a lot (my diet was a bit more strict also, I didn't had as many foods as I can eat right now, I really ate like 3 or 4 foods) but as time went, I started to sit around more and added some different food variants to my diet thankfully (but still not really healthy), so now my bad diet makes me have weight, but I can't even go for a meat/vegetable diet because I can't eat them 💀 Whenever I look around for a healthy food recipe they always have things I strictly stay away from.\n\nI am also not obese but like I have some wieght to lose that's for sure.",
      "created_utc": 1748533351.0,
      "score": 2,
      "context": []
    },
    {
      "id": "muwlgf8",
      "author": "MundaneVillian",
      "body": "Right over here. My appetite is gone because eating is so dreadful but I still eat because I have to, just not as much. Still gaining weight.",
      "created_utc": 1748534703.0,
      "score": 2,
      "context": []
    },
    {
      "id": "muwx6t6",
      "author": "JoshIsASoftie",
      "body": "I feel like a black sheep with ARFID, too. My safe foods are all raw fruits and veggies. Texture doesn't affect me at all. Everyone's experience is so different and the diagnosis is still not very well known so it will take time for our understanding to round out.",
      "created_utc": 1748537999.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mux34hi",
      "author": "Angelangepange",
      "body": "I'm not sure if I qualify as obese, all I know is I am 13 kilograms heavier than that number of hight to weight ratio that is obviously generic and its not like a set in stone rule.   \nI used to be thinner before but not only I have hypothyroidism now which makes it easy to gain weight but I'm also 40 and not 18 anymore so I feel like it's just... normal that I'm heavier. I do struggle with body image but I'm just trying really hard to not think about it too much and accept that this is what my body looks like now.    \nI think it's fairly common to be overweight with arfid as much as it is being underweight.   \nI think one thing we have all in common is that it's just really hard to change out weight because we have a hard time changing our eating habits.    \nIt's all about the kinds of food we are stuck with. When they are more high kalory it's easy to be overweight.",
      "created_utc": 1748539627.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mux43uw",
      "author": "Neat_Classroom_2209",
      "body": "I am!",
      "created_utc": 1748539894.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mux4z9t",
      "author": "Okdorkestra37",
      "body": "Me too. My safe foods mostly come from fast food since there’s little variation in taste and texture",
      "created_utc": 1748540133.0,
      "score": 2,
      "context": []
    },
    {
      "id": "muxibzh",
      "author": "Pnyxhillmart",
      "body": "It’s because you eat a lot of empty calories and have PCOS as well. I am quite thin, if one of my safe foods was not high in calories and is actually pretty nutritious, I’d be back on a feeding tube. I have to work to eat and get enough food in me to keep me from that thing.",
      "created_utc": 1748543871.0,
      "score": 2,
      "context": []
    },
    {
      "id": "muxkpkp",
      "author": "Darth_Celeste",
      "body": "I’m also obese. I tend not to eat often because part of my issue is hating the feeling of digesting stuff, and just overall feeling like eating is a chore and that I struggle so much with food that I find very little joy in eating. But regardless of that, sometimes the only thing I feel comfortable eating is junk. Sugary things, processed foods, takeout. So despite being incredibly active and feeling like I’m not getting enough food in day by day, the food that I do eat is calorically dense enough to prevent me from losing weight. It definitely feels very imposter-y. When I try to talk about my disordered eating, people always assume I’m talking about BED, because how could a “fat girl” have an issue with over restriction??? It’s difficult to cope with on top of all the other issues that arise from this disorder.",
      "created_utc": 1748544547.0,
      "score": 2,
      "context": []
    },
    {
      "id": "muyi8i9",
      "author": "Slow_Saboteur",
      "body": "Over 200lbs here. Trying to learn how to eat as an adult so I dont get diabetes",
      "created_utc": 1748554235.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mv0pgpx",
      "author": "transplantintexas",
      "body": "It’s as if I wrote this post myself…",
      "created_utc": 1748583125.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mv0rsao",
      "author": "calmingthechaos",
      "body": "I'm not diagnosed, but I have a very restrictive diet. I didn't even know ARFID was a thing until a couple years ago. I thought I was just weird. I'm overweight by about 100 lbs. Mine isn't mostly food, though. I pretty much only drink soda and sweet tea. I switched to the zero versions and dropped 20 lbs.",
      "created_utc": 1748584337.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mv2jt8j",
      "author": "melinda_lane",
      "body": "nope, I am too. my anxiety with trying new foods causes my diet to consist of a lot of high carb safe foods - pasta, pizza, grilled cheese, salty snacks, etc. only way I’ve ever been able to lose weight is by a huge calorie deficit.",
      "created_utc": 1748614065.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mutri0g",
      "author": "ohyeahokayfine",
      "body": "After my first real bought with arfid where I lost a ton of weight, my weight evened out at like slightly overweight. Now no matter how little I eat, I stay the same weight",
      "created_utc": 1748491561.0,
      "score": 1,
      "context": []
    },
    {
      "id": "muu2djq",
      "author": "Bulky_Influence_4914",
      "body": "no. i was obese for a looooooong time. mania slimmed me down",
      "created_utc": 1748496753.0,
      "score": 1,
      "context": []
    },
    {
      "id": "muu3dyd",
      "author": "Lord_Atmo",
      "body": "No I am too",
      "created_utc": 1748497278.0,
      "score": 1,
      "context": []
    },
    {
      "id": "muu9wan",
      "author": "Ok-Marsupial-9897",
      "body": "No",
      "created_utc": 1748500826.0,
      "score": 1,
      "context": []
    },
    {
      "id": "muuw9yc",
      "author": "Owlmaescia",
      "body": "I'm a heavy girl and tall but I weigh a lot. My safe foods are junk food and I don't like fruits and veggies due to texture and taste.",
      "created_utc": 1748513740.0,
      "score": 1,
      "context": []
    },
    {
      "id": "muv29y7",
      "author": "The_DM25",
      "body": "Hi, I’m not diagnosed with ARFID but I do have a fear of food because of allergic/ anaphylactic reactions. Do you find yourself less scared if you can check and verify ingredients or is it still difficult? No worries if you don’t answer this I know it’s not on the topic of the post but I’m just curious.",
      "created_utc": 1748516687.0,
      "score": 1,
      "context": []
    },
    {
      "id": "muvxvpp",
      "author": "julzbrx",
      "body": "Not at all",
      "created_utc": 1748528047.0,
      "score": 1,
      "context": []
    },
    {
      "id": "muw6hhb",
      "author": "euphoria110",
      "body": "Nope I am too",
      "created_utc": 1748530498.0,
      "score": 1,
      "context": []
    },
    {
      "id": "muwcvqj",
      "author": "iamtheultimateshoe",
      "body": "nope. hey",
      "created_utc": 1748532295.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mux57kz",
      "author": "More-Professor-1755",
      "body": "I'm in treatment for an ED rn and I was one of like TWO fat people when I was in IOP? \n\nIt was difficult for me to accept at first. Not being able to physically relate to people bothered me. \n\nBut I realized what we all had in common was good being the enemy when it's not SUPPOSED to be. \n\nOnce I addressed my people pleasing behavior of pretending to care about my weight, learning to nourish myself became a little bit easier.",
      "created_utc": 1748540196.0,
      "score": 1,
      "context": []
    },
    {
      "id": "muxgy4u",
      "author": "Meowzabubbers",
      "body": "I mean, I'm technically seen as obese, even though I'm only around 185 lbs.",
      "created_utc": 1748543476.0,
      "score": 1,
      "context": []
    },
    {
      "id": "muxlcz3",
      "author": "None",
      "body": "I am diagnosed with ARFID had it sense I was born basically and I’ve been overweight/obese sense I was in my mid 20s. I’m 43 now and still about 120 pounds overweight. I think it has to do with PCOS , genetics and that my few safe foods have been consistently unhealthy types of foods.",
      "created_utc": 1748544732.0,
      "score": 1,
      "context": []
    },
    {
      "id": "muxmfy4",
      "author": "monicathehuman",
      "body": "Not at all!",
      "created_utc": 1748545039.0,
      "score": 1,
      "context": []
    },
    {
      "id": "muxryni",
      "author": "acnerd5",
      "body": "I was overweight due to how restricted my diet was, and it was mainly processed things because theyre the same every. Single. Time.\n\nNow I'm only underweight because I've entirely stopped eating any survivable amount of solid food. I think, realistically, both are going to be indicative of ARFID. I was fat at my friend's wedding and my husband noticed after I lost a ton during pregnancy (hyperemesis gravidium, ended my pregnancy 50 pounds lighter than I started)... he looked at a picture and said, \"holy shit you were fat I didn't even notice!\"\n\nEssentially,  no you arent, but this can be a rotating chain of symptoms as well that will affect body weight, and theres a LOT of people on the sub who are overweight as well <3",
      "created_utc": 1748546639.0,
      "score": 1,
      "context": []
    },
    {
      "id": "muxt57v",
      "author": "mayinaro",
      "body": "nope, we might be more of a minority but we’re definitely not uncommon. i think many expect those with arfid to be constantly starved but it’s not like we don’t inherently enjoy eating. many of us have plenty of foods we love, it just happens to be because it’s hyper processed and full of fat, salt, carbs and sugar. these foods are so accessible and are consistent everytime. \n\nof course other elements of my mental health weigh into those eating habits but i’m overweight due to needing to depend on these foods",
      "created_utc": 1748546981.0,
      "score": 1,
      "context": []
    },
    {
      "id": "muxtfvf",
      "author": "Ancient_Parsnip9628",
      "body": "i got diagnosed at 16 and i was considered obese. i’m 21 now and still obese. my safe foods are literally bread, pasta, fast food, deserts and like dr pepper. i don’t overeat on a daily basis but the foods i can eat are high carb/sugar leading to me being obese. i always gaslit myself into thinking i didn’t have arfid because of that “key symptom” of being underweight. don’t let it get to your head. there are lots of people just like you and me that exist. eating something is far better than eating nothing at all.",
      "created_utc": 1748547067.0,
      "score": 1,
      "context": []
    },
    {
      "id": "muy1uoq",
      "author": "xThyQueen",
      "body": "Nope. I barely eat and yet I'm fat. And it's not like I eat so much fatty foods or something, like yes I don't eat healthy healthy but I barely eat, yet my weight stays on. It's very odd. I think it might have to do with my endometriosis and my thyroid as well though.",
      "created_utc": 1748549486.0,
      "score": 1,
      "context": []
    },
    {
      "id": "muy79a7",
      "author": "Autistic_Human02",
      "body": "I am also fat for my height and also have PCOS and ARFID and a plethora of other health stuff you are definitely not alone",
      "created_utc": 1748551023.0,
      "score": 1,
      "context": []
    },
    {
      "id": "muyg0v8",
      "author": "Puzzleheaded-Arm4170",
      "body": "There’s at least two because I’m right here with you! I don’t have PCOS, I just eat a lot of my safe foods! Considering all my safe foods are mostly carbs and I have a slow metabolism, it’s no wonder I’ve naturally been bigger my entire life. I can’t do most textures or strong smells, but I have no fear of vomiting or getting sick. I don’t blame you for your imposter syndrome, as I still often will just tell people I’m a “picky eater” instead of ARFID because I dont have autism or ADHD, which makes me feel like I don’t fit in the box for ARFID… just know you’re not alone! :)",
      "created_utc": 1748553570.0,
      "score": 1,
      "context": []
    },
    {
      "id": "muyweoh",
      "author": "Domestic_Fox",
      "body": "My daughter is overweight and has arfid. It has to do with her adhd and binge eating disorder. I have all of them as well and vyvanse “cured” my binge eating disorder, but my arfid is out of control. But I’m a mom and have to cook food all the time so I just hate food.",
      "created_utc": 1748558719.0,
      "score": 1,
      "context": []
    },
    {
      "id": "muz3xy4",
      "author": "Meadow_Edge",
      "body": "No, you aren't alone. Im the same. I just eat massive amounts of the few foods I like.",
      "created_utc": 1748561193.0,
      "score": 1,
      "context": []
    },
    {
      "id": "muz8oc8",
      "author": "ibelieveinaliens111",
      "body": "Not too overweight, but I’m definitely chubbier than most, and definitely more than average for my age. I’m trying to eat less, not differently, for now…",
      "created_utc": 1748562758.0,
      "score": 1,
      "context": []
    },
    {
      "id": "muza614",
      "author": "citykittycat",
      "body": "All my safe foods are beige carbs so nope.",
      "created_utc": 1748563266.0,
      "score": 1,
      "context": []
    },
    {
      "id": "muzez7t",
      "author": "janetsnakehole319",
      "body": "I'm obese too",
      "created_utc": 1748564930.0,
      "score": 1,
      "context": []
    },
    {
      "id": "muzgqig",
      "author": "NoPantsPenny",
      "body": "I don’t have an official diagnosis, but I do believe I may have ARFID. I do have binge eating disorder, and even my therapist for it can’t figure out why I only binge one or two things… well I don’t eat much of a variety. \n\nI’m more overweight than I’ve ever been. I often feel completely consumed by either my desire to binge, or my inability to eat most things other people do.",
      "created_utc": 1748565531.0,
      "score": 1,
      "context": []
    },
    {
      "id": "muzi8rq",
      "author": "blaiiiiir",
      "body": "I feel the same way as you. I’m overweight too and I’ve struggled with arfid my whole life. It’s hard seeing all the posts of people who struggle to gain weight due to arfid when I’m the complete opposite. all my safe foods are fattening. I feel like I’m not valid a lot of the time. \nBut we *are* just as valid as anybody else with an eating disorder",
      "created_utc": 1748566043.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mv0rylb",
      "author": "OriginalWish8",
      "body": "I actually just learned this was a thing tonight. An ad for treatment randomly popped up when scrolling on Facebook and I’d never heard of it, but it stopped me in my tracks because I think this is why we are struggling so hard with our child. People keep giving us tips and tricks and nothing works for getting them to eat more than what they always eat and always have. There are maybe five meals total we can get in and maybe two vegetables. Fruits are a little better, but it’s mainly pasta, Mac and cheese, and chicken nuggets from a specific place. I asked about a list of foods and why they were on the “no” list and taste and texture are both always the culprit. They absolutely have actually gagged on food before, due to texture. They will sometimes ask to eat something new, but eat two bites and that’s it. It’s to the point I have to tell people not to be worried or offended if they don’t eat their food when they go to other’s homes, because they are “so picky” (or so I thought). I actually think I may have even learned some things about myself while researching this. \n\nAnyway, the one thing stopping me was the mention of weight loss as a symptom on all the information I found and that not being the case. I think it being processed foods is why we don’t have that. I am overweight. My kid isn’t actually overweight, but “solid” and definitely not underweight. I was thinking maybe it couldn’t be it because of that and then I saw this thread. The last bloodwork at the doctor showed that numbers are starting to be thrown off and diet and exercise were mentioned as fixes and I wanted to cry because we have been trying it all to improve that and literally can’t. I actually told my husband before our kid was ever born that I didn’t want them to be picky like me and I made sure they had a huge variety of foods and then they got older and it just morphed into only eating those items. They will just not eat if offered anything else. I’ve even made a three bite rule (again, being told it was pickiness and to keep offering) and also offer a side of “safe” foods and they will end up only finishing those foods or will ask for them. People on the outside think it’s just spoiling them, but I do think it’s way more than that. They are willing to try new, but most of it is written off never to be tried again.",
      "created_utc": 1748584429.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mv14y4i",
      "author": "Fit-Cauliflower-9229",
      "body": "Trust me, as someone who used to weight 43kg and now weight 50kg, you and I have much more in common than me with an underweight bulimia patient.\n\nI feel like the medical field do not know how to treat ARFID. I had to take matters in my own hands.",
      "created_utc": 1748591811.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mv1l4hy",
      "author": "Gloomy-Hyena5707",
      "body": "I am too and it's the reason why I haven't seeked help for years. I first brought it up with my childhood doctor in my early 20s, said I only eat one meal a day and he looked me up and down and said something like 'clearly not' 😑 so I've just struggled through, going through not eating most of the day and getting hypoglycaemic every few days then eating til I'm sick\n\nWhat has made me seek help is I started Vyvance 6 months ago and that took away any sense of hunger, and seems to stop the hypoglycaemic response too, so I've happily been eating at night and nothing else, til I starting fainting at work last week\n\nI luckily have a doctor that actually listens and understands it's not all black and white\n\nPlease note I haven't been diagnosed yet but will be going through it with my doctor asap to get treatment\n\nI absolutely feel like an imposter by the way I look, but I also know I need help or it will keep getting worse\n\nLots of love and hugs to you",
      "created_utc": 1748601082.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mv2kuyq",
      "author": "Specter_Inspector_",
      "body": "You're not alone, I'm overweight too and the lack of exercise doesn't help. Weirdly enough I'm really happy to read that there are other people like me, it's a little tiring when I tell people I have an ED and they instantly go on about how I'm 'not fat' and I shouldn't worry about my weight ect, I think it goes to show how ED's are still not talked about widely enough.\n\nI wish everyone here luck on their journeys!!",
      "created_utc": 1748614376.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mv2lk91",
      "author": "turtlewings2o5",
      "body": "I’m so glad (if that’s not weird to say) that there’s so many other people here like me! I’ve seen so many posts here from people who are dangerously thin or even close to starvation, and oh gosh my heart goes out to them, but it’s so different from my experience, lmao. Like many others have said, my safe foods are mostly processed, high-calorie things (I eat almost no fruits or vegetables at all), and I eat a LOT of them. In an ideal world I’d lose about a hundred pounds. In the real world, I’m the single mom of an infant, with a full-time job, an eating disorder, and an absolute loathing of physical effort and sweat, so I don’t see it happening any time soon. 😅",
      "created_utc": 1748614580.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mv2s520",
      "author": "Squirrel_Worth",
      "body": "Nope, I’m currently trying to lose weight. \n\nMy safe foods are carbohydrates, cheese etc. \n\nI have medical conditions and take medication which increase my appetite and reduce my metabolism (including PCOS).  All of it combined has lead to steady weight increase since childhood.",
      "created_utc": 1748616460.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mv42myj",
      "author": "EnvironmentalAge9671",
      "body": "you're not alone! based on bmi, i am what would be considered \"obese\". i have a lack of variety and fear of aversion to some foods",
      "created_utc": 1748629507.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mv5jzi9",
      "author": "lesbiangerardway",
      "body": "I have PCOS and am significantly overweight as well. It can definitely feel isolating when people are worried about not taking in enough calories when I can’t seem to lose weight and my doctors are so alarmist about it.",
      "created_utc": 1748645879.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mv5l52u",
      "author": "lesbiangerardway",
      "body": "anyone on here want to create a community for arfid/PCOS overlap hmu lol",
      "created_utc": 1748646273.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mv5ufyy",
      "author": "bungoustraypups",
      "body": "i'm considered \"morbidly ob*se\" by doctors but have no conditions related to my weight and i still have ARFID. weight is largely genetic, almost everyone in my family is fat, and most who aren't fat are only thinner due to weight loss surgery (even then they're not thin just thinner) or some other physical health disorder\n\nall this is to say: most people with all kinds of EDs are actually not thin. you're far from alone.\n\nand for everyone else in the comments: losing weight probably wouldn't make you feel better either, nor would you keep the weight off for very long. you'd either be working out and thus gain weight through muscle, or your starvation diet will end and your body will gain back more weight because you tricked it into thinking you were starving",
      "created_utc": 1748649445.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mv663ae",
      "author": "TheManicPossum",
      "body": "I was incredibly underweight when I was younger, now I’m overweight. To be fair, my safe food list has shrunk significantly as I’ve aged and 50% of is cheesy pasta, tater tots, and chicken strips. \n\nI had a very difficult time with my diagnosis at first because one of the main symptoms that’s always mentioned is being underweight and I didn’t fit into that category. \n\nYou’re not alone ♥️",
      "created_utc": 1748653725.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mv6f2j1",
      "author": "HourDimension1040",
      "body": "nope my bmi says morbidly obese but all i eat is redbull, cheese and crackers",
      "created_utc": 1748657116.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mv7jauw",
      "author": "Little_Bit_87",
      "body": "Nope! Fellow fatty here. There is actually a lot of people who think they are just picky eaters because they are overweight. This is because healthier foods like meats and vegetables vary in texture and consistency so eventually you encounter a negative experience with it and it becomes forever a no no food. Unhealthier processed food are nearly the same every single time. So they become safe foods. As a kid you're developing and active and growing so you don't see the weight gain. Then you become an adult and everything slows down but you're still eating the same. So you start gaining weight.",
      "created_utc": 1748676133.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mv8dkip",
      "author": "Happy_Jack_Flash",
      "body": "Yes, I had been medically obese for years when I was finally diagnosed with ARFID (which I've definitely had my whole life, I just didn't see someone who diagnosed it for a long time).\n\nI also feel really frustrated by how much being underweight is emphasized whenever you Google ARFID. Would it be so hard to phrase instead as something like \"Many ARFID patients struggle with weight due to their restricted diet. Many are underweight, while some struggle with obesity.\"",
      "created_utc": 1748693188.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mv9pi8n",
      "author": "GummyWurmX3",
      "body": "Nope! I have afrid and am fat\nIt honestly deposit on what your safe foods are and how many you have, I sadly don't have many healthy safe foods so I eat a lot of carbs and meat, and due to medical issues I can't exercise as much as I should be so therefore, I am chubby\nYou 100% aren't alone, a lot of factors go into how a person's body looks",
      "created_utc": 1748709634.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mvaok3c",
      "author": "self-lovin",
      "body": "common misconception with ARFID or almost any ED for that matter is that you must be underweight to be struggling with it. its just not true. and those who are overweight are not taken seriously as a result. people who are overweight are not taken seriously in general with healthcare. there are lots of us who are overweight with arfid. you are not alone.",
      "created_utc": 1748720619.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mvaqr63",
      "author": "Hedwigsong8908",
      "body": "🙋 not obese but I'm a bit overweight.",
      "created_utc": 1748721316.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mvcjts4",
      "author": "v3tt3grave",
      "body": "I have ARFID on several levels, and I am a fat person. We exist!",
      "created_utc": 1748744041.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mve2zic",
      "author": "Effective-Arm7302",
      "body": "We come in all shapes and sizes- literally. ARFID doesn’t discriminate. People can be overweight and have anorexia/bulimia/orthorexia as well. When I was at my worst I was eating almost primarily cheetahs because they felt safe to me. Didn’t even matter to me at the time that they were junk, any food = healthy because no food was worse than trash.",
      "created_utc": 1748772243.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mvkk6mz",
      "author": "Parking_Ad2668",
      "body": "You’re definitely not the only one. Arfid isn’t based on how much you weigh but on what you eat and how many DIFFERENT things you can eat. You can be completely healthy and have arfid, be underweight, or obese. People with arfid don’t usually care or even think about what they weigh. Some people with arfid naturally have a faster metabolism or are perchance athletic and can burn the fatty foods that they tend to eat.",
      "created_utc": 1748863735.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mvy71nk",
      "author": "birb-lady",
      "body": "My ED-specialized dietician (who is fantastic) explains it this way: ARFID bodies don't always respond to the eating less and the malnutrition by dropping weight. Often they sort-of sense the malnutrition coming before it hits and prepare your body for it by holding onto the fat reserves. So ARFID people are often normal weight/BMI or even obese/high BMI. She said she has a client whose ideal body weight, based on whatever metrics are generally used, is 250lbs, and if she goes much below that she can get into malnutrition problems.\n\nIt's the reason Denver ACUTE ED hospital's admission criteria of a patient generally being below 15 BMI before they can be admitted (a policy dictated by their insurance company, BTW) is so unfortunate and harmful. I asked my dietician and my ED doctor what it would take for me to get to that point so I could get admitted, and they both said I would die before I could get that low. I'm 62, 5 feet, 7 inches tall and weigh 145 lbs, but am in a malnutrition state as proven by my lab work (low pre-albumin, anemic, etc,) \n\nARFID has a long way to go towards being very well understood by the medical profession, much less the families and friends of those who have it.",
      "created_utc": 1749044270.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mw19tj8",
      "author": "runnawaycucumber",
      "body": "Being overweight is very common with ARFID. There's a lot of research papers and credible medical sources that show that ARFID and obesity can and does occur at a pretty decent percentage",
      "created_utc": 1749076235.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mwe1jym",
      "author": "newsharks",
      "body": "Yeah I'm 5'4 and 200 pounds cuz the only thing I can easily eat is sweets and I have PCOS. I actually just joked that it's just my luck that I'd develop an eating disorder that doesn't even let me lose weight 😂 I'm with you friend",
      "created_utc": 1749246107.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mwmac0n",
      "author": "Maximum_Hurry_3708",
      "body": "I used to be obese and got diagnosed with ARFID. You’re not alone!",
      "created_utc": 1749366087.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mws655b",
      "author": "plussizedtwink",
      "body": "I am also overweight but I have a thyroid condition and PCOS so I’m very bloated most of the time! No matter your size, you are valid <3",
      "created_utc": 1749446305.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mxt7hw6",
      "author": "Open-Anything-7086",
      "body": "I am too and that can happen if you only like high carb/sugary foods/drinks",
      "created_utc": 1749938252.0,
      "score": 1,
      "context": []
    },
    {
      "id": "myksu3u",
      "author": "Hashiyukas",
      "body": "ARFID is the reason of my weight gain too, I don't eat fruits, vegetables or legumes; only carbs like pasta, rice and potatoes, and very specific types of protein. Fast food is a 100% safe option, so I'm trying to restrict my takeout orders to no more than once or twice a month. I particularly gained a lot of weight when I was a child because of my diet, and I've been like this since then. You're not alone!",
      "created_utc": 1750307332.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mz3t5x2",
      "author": "UnicornWig",
      "body": "Nope.  Carbs are easy and not scary.",
      "created_utc": 1750568688.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mza9fj5",
      "author": "existentialcrisesyay",
      "body": "I've always had ARFID, for a good chunk of my teens into my early 20s I have been very overweight or considered obese as back in middle school I was only 4' 9\" & nearly 180lb, got up to 210lb within the last few years at 5' 1\". I was like 90lb or something when I was in elementary school because my digestion & metabolism were higher, with the stress, food allergies, & mental health issues I dealt with unmedicated in middle school both slowed down greatly, at 24 those are both still quite slow compared to everyone I know. The last few years I've been dealing with health issues so my weight has gotten up to 210 because you know safe food/comfort foods aren't always healthy & it definitely got me. 😅 (Fun fact, remembered how slow my digestion & metabolism is when a medicine I took recently for nausea  knocked me out for 19 hours, yes promethazine is a sedative but I can assure you *it should not have knocked me out for 19 hours* & haven't taken it since)\n\nAnyone with ARFID can weigh any amount, it's an eating disorder that doesn't have a set weight to it\n\nTo contrast what I weighed in 2023 when I wasn't dealing with my current health issues, I'm now down to 165 & yes its a much better weight for my height it is not lost in the healthiest way, it's all been lost through getting sick then my ARFID going into hyperdrive because it's trying to find some sense of control in a situation completely out of my control.",
      "created_utc": 1750658768.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mzerwqk",
      "author": "Mickeycore0202",
      "body": "i am also fat and it’s because my safe foods are things that aren’t super healthy- and unfortunately as much as i love cesar salad… that shits expensive. frozen pizza and strawberries when they go on sale are my go to 😭😭",
      "created_utc": 1750717000.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mzn3e7j",
      "author": "annoyomous1983747382",
      "body": "I’ve had arfid pretty much since I started eating, I used to be very skinny till I suddenly put on weight at around 10-11 (im 18 now) I’m over weight and I too felt like an odd one out. I eat very few different things, my arfid stems from a big fear of textures and vomiting. And the majority of what I eat is very fattening. Your not alone, I personally try not to think myself as being an odd one out, I am trying to lose weight, it’s hard when you need to eat to live but what you eat isn’t healthy. but as someone who has been both under and overweight, I prefer myself now.",
      "created_utc": 1750824871.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mutf8jr",
      "author": "Previous_Deal4481",
      "body": "Ugh I miss being able to do that! I developed an autoimmune disease. Everyday is pain now 🙃🫠 Doctors keep telling me I’d feel so much better if I simply changed my diet.  Like dude.. I KNOW. I work in healthcare, I knoooowww. My psychiatrist just said why don’t you just eat some fruit? I looked and her and said wow, you cured me.  All it took to change almost 40 years of an eating disorder was you saying “eat some fruit”. She had the good sense to be embarrassed and recommended a ED therapist.",
      "created_utc": 1748486686.0,
      "score": 84,
      "context": [
        {
          "id": "muteqlq",
          "author": "Peanutbutternmtn2",
          "body": "Nope. My diet consists of horrible fattening things too. Right there with ya pal. Only reason I’m not like, morbidly obese, is bc I work out a ton.",
          "created_utc": 1748486509.0
        }
      ]
    },
    {
      "id": "mux47vy",
      "author": "prettyskittys",
      "body": "me too I’m very active with my sport but if it wasn’t for that I’d be a lot heavier",
      "created_utc": 1748539924.0,
      "score": 3,
      "context": [
        {
          "id": "muteqlq",
          "author": "Peanutbutternmtn2",
          "body": "Nope. My diet consists of horrible fattening things too. Right there with ya pal. Only reason I’m not like, morbidly obese, is bc I work out a ton.",
          "created_utc": 1748486509.0
        }
      ]
    },
    {
      "id": "muxejsb",
      "author": "boytoy421",
      "body": "Just wait until something happens to you and you can't",
      "created_utc": 1748542790.0,
      "score": 0,
      "context": [
        {
          "id": "muteqlq",
          "author": "Peanutbutternmtn2",
          "body": "Nope. My diet consists of horrible fattening things too. Right there with ya pal. Only reason I’m not like, morbidly obese, is bc I work out a ton.",
          "created_utc": 1748486509.0
        }
      ]
    },
    {
      "id": "muth4pv",
      "author": "Previous_Deal4481",
      "body": "I’m glad I’m not crazy! lol it’s nice to know that we exist! Not a ton of ED representation for the fluffy",
      "created_utc": 1748487378.0,
      "score": 22,
      "context": [
        {
          "id": "mutf6e0",
          "author": "tiniestfriend",
          "body": "Me too, friend 🤍 I am overweight and mostly cause my safe foods are mostly just fast food 😭 plus it doesn’t help that I am bad at moderation with them. I always feel so bad about it but idk what to do. I also have PCOS so that doesn’t help either but I feel you, honey. You’re not alone 🫶🏼",
          "created_utc": 1748486664.0
        }
      ]
    },
    {
      "id": "mvnpk6x",
      "author": "PsychologicalDiet216",
      "body": "fast food is like the worst for my afrid because of the contamination risk😭",
      "created_utc": 1748898477.0,
      "score": 2,
      "context": [
        {
          "id": "mutf6e0",
          "author": "tiniestfriend",
          "body": "Me too, friend 🤍 I am overweight and mostly cause my safe foods are mostly just fast food 😭 plus it doesn’t help that I am bad at moderation with them. I always feel so bad about it but idk what to do. I also have PCOS so that doesn’t help either but I feel you, honey. You’re not alone 🫶🏼",
          "created_utc": 1748486664.0
        }
      ]
    },
    {
      "id": "muvz2vf",
      "author": "nalycat",
      "body": "I feel like people, especially the medical field, won't take me seriously if I say I have ARFID because I'm overweight. But oh well. I can't control that. I did have a positive experience recently where a doctor decided that I shouldn't go on a specific diet for GERD based on the fact that I have ARFID so she knew my list of safe foods was small and so she didn't want to restrict any further",
      "created_utc": 1748528393.0,
      "score": 23,
      "context": [
        {
          "id": "mutg329",
          "author": "SituationSad4304",
          "body": "I highly doubt it as a fellow sufferer (who is overweight) who works in the medical field. Obese patients tend to be picky and only eat foods that objectively should be eaten in moderation (chips, McDonald’s, soda, chain pizza). Which I understand intimately since they’re consistent in texture and flavor no matter what town you’re in. But it’s hard for people who are dangerously underweight from ARFID to get appropriate treatment without a more “normal” eating disorder comorbidity. People who can eat enough calories to appear normal face both medical misunderstanding and fat bias",
          "created_utc": 1748486995.0
        }
      ]
    },
    {
      "id": "mutgnyv",
      "author": "Previous_Deal4481",
      "body": "I worked in the ED until I developed an autoimmune disease in the last 4 months and people couldn’t believe my diet. Which isn’t inherently unhealthy.  My safe foods are whole wheat flour that I make into my own bread, chicken thighs, peas/corn, velvetta, pasta, apple juice and Diet Coke.  I was the only person I worked with who brought home cooked meals, I don’t binge eat.  With the PCOS I either needs massive restriction or insane exercise.  It’s so frustrating.  I feel like if I told any friend I had an ED they wouldn’t believe me lol",
      "created_utc": 1748487207.0,
      "score": 20,
      "context": [
        {
          "id": "mutg329",
          "author": "SituationSad4304",
          "body": "I highly doubt it as a fellow sufferer (who is overweight) who works in the medical field. Obese patients tend to be picky and only eat foods that objectively should be eaten in moderation (chips, McDonald’s, soda, chain pizza). Which I understand intimately since they’re consistent in texture and flavor no matter what town you’re in. But it’s hard for people who are dangerously underweight from ARFID to get appropriate treatment without a more “normal” eating disorder comorbidity. People who can eat enough calories to appear normal face both medical misunderstanding and fat bias",
          "created_utc": 1748486995.0
        }
      ]
    },
    {
      "id": "mutg2tb",
      "author": "Previous_Deal4481",
      "body": "Hyponatremia is definitely a one way ticket to the ICU! I mostly eat whole wheat bread, chicken thighs, velvetta, pasta, peas/corn, apple juice and Diet Coke. I’m 228lbs and 5’5.  For a few years I only did chicken and brown rice and that got me down to 200 - but I ended up getting sick and being sedentary and re-added carbs and instantly threw 28 pounds back on without trying.  And I don’t binge - I don’t overeat - my A1c is 🤌 perfect. I just have a body that needs calorie restriction and massive exercise and I can’t right now. And even when I could I always felt hypoglycemic after workouts.",
      "created_utc": 1748486992.0,
      "score": 6,
      "context": [
        {
          "id": "muter19",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1748486513.0
        }
      ]
    },
    {
      "id": "mve35p9",
      "author": "Effective-Arm7302",
      "body": "Ive never met a fellow allergy fearing ARFID sufferer, hello there! Glad to know im not the only one",
      "created_utc": 1748772344.0,
      "score": 3,
      "context": [
        {
          "id": "muter19",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1748486513.0
        }
      ]
    },
    {
      "id": "muy275f",
      "author": "xThyQueen",
      "body": "This I believe is me as well. Thyroid and Processed foods.. I wish I could eat anything.",
      "created_utc": 1748549585.0,
      "score": 5,
      "context": [
        {
          "id": "mutfecw",
          "author": "crazyrainbowoctopus",
          "body": "Hi! I am also overweight with arfid. I think it is mostly because of my thyroid disease but also because my safe foods are mostly processed foods",
          "created_utc": 1748486743.0
        }
      ]
    },
    {
      "id": "muw04o7",
      "author": "Previous_Deal4481",
      "body": "That is so frustrating!! Like people - if I could I would!!!",
      "created_utc": 1748528694.0,
      "score": 4,
      "context": [
        {
          "id": "mutjckq",
          "author": "OneEyedTreeHugger",
          "body": "I’m also fairly overweight. A few foods I’ve managed to add in the last couple of years are mostly healthy (roasted carrots and roasted broccoli), but the rest are highly processed foods or refined carbs. \n\nI really hate it because people are constantly telling me to eat all of these other more healthy foods. And I’m trying so hard. But, I just can’t. Or at least, I can’t in a way that is in any way sustainable. And so few people understand that. Especially the doctor. I hate going and being told that I’m deficient in all of these vitamins and minerals and need to eat more protein and less of everything I do actually manage to eat. I already know what would be better to eat instead; they don’t have to keep telling me.",
          "created_utc": 1748488211.0
        }
      ]
    },
    {
      "id": "mv5kxt8",
      "author": "lesbiangerardway",
      "body": "Yes processed foods are so safe <3 feel free to ignore unsolicited advice, but have you considered supplements to get in nutrients so you don’t have to add whole new foods? like a pill or a vitamin?",
      "created_utc": 1748646205.0,
      "score": 2,
      "context": [
        {
          "id": "mutjckq",
          "author": "OneEyedTreeHugger",
          "body": "I’m also fairly overweight. A few foods I’ve managed to add in the last couple of years are mostly healthy (roasted carrots and roasted broccoli), but the rest are highly processed foods or refined carbs. \n\nI really hate it because people are constantly telling me to eat all of these other more healthy foods. And I’m trying so hard. But, I just can’t. Or at least, I can’t in a way that is in any way sustainable. And so few people understand that. Especially the doctor. I hate going and being told that I’m deficient in all of these vitamins and minerals and need to eat more protein and less of everything I do actually manage to eat. I already know what would be better to eat instead; they don’t have to keep telling me.",
          "created_utc": 1748488211.0
        }
      ]
    },
    {
      "id": "muw0fyi",
      "author": "Previous_Deal4481",
      "body": "Yeah I had a “friend” I worked with in the hospital, who should have absolutely known better, say Damn - sucks you couldn’t have the skinny ED! \n\n🤦🏼‍♀️",
      "created_utc": 1748528785.0,
      "score": 3,
      "context": [
        {
          "id": "mutlv6w",
          "author": "rigathrow",
          "body": "yep. i starve myself a lot (sometimes unintentionally, sometimes on purpose) and as a whole, i don't really experience hunger? the feeling of weakness and my blood pressure dropping reminds me i need to eat but i get no signals before i get to that point. i don't crave anything or have any desire to eat. \n\ni don't like the vast majority of foods and then foods that i can tolerate, i'm so bored of. literally just pizza, plain burgers, or processed chicken and potato in various shapes. i don't snack at all. eating is an absolute chore for me that i can and do so easily go without doing. i usually have one meal a day and can't comprehend how or why people have three plus snacks.\n\nstill fat though. i feel like it makes it impossible for people to take me and my EDs seriously. i *should* be underweight given it all but i'm just not. shit sucks.",
          "created_utc": 1748489202.0
        }
      ]
    },
    {
      "id": "muw1183",
      "author": "Previous_Deal4481",
      "body": "I feel like I started having health issues around 31ish and it’s been downhill from there for the last 6 years.  Before that I was a pretty active person.  I mean I’ve never been “skinny” but I kept it under 180ish for most of my life",
      "created_utc": 1748528954.0,
      "score": 1,
      "context": [
        {
          "id": "mutyel6",
          "author": "socraticalastor",
          "body": "I am too! I actually don’t eat a ton, but when I do eat, I “snake meal” (1 meal for a 24 hour period) which isn’t ideal… I also have multiple physical disabilities that cause chronic pain flares and fainting when exercising, so despite my absolute love for sports and physical activity, as well as my interest in nutrition, I’m 5’9 and ~220-230.",
          "created_utc": 1748494755.0
        }
      ]
    },
    {
      "id": "muw17o6",
      "author": "Previous_Deal4481",
      "body": "❤️❤️❤️",
      "created_utc": 1748529006.0,
      "score": 6,
      "context": [
        {
          "id": "muurhqk",
          "author": "AppropriatePick3927",
          "body": "Overweight with ARFID and PCOS here! You are not alone but I get the feeling. I have to keep reminding myself that too.. \nLots of love ❤️",
          "created_utc": 1748511113.0
        }
      ]
    },
    {
      "id": "muw22yc",
      "author": "Previous_Deal4481",
      "body": "I totally get this.  I was a “picky eater” my whole life but the circle of tolerable foods was much wider. I had me first severe allergic reaction at 32.  Then multiple afterwards due to it being an unlabeled non top 9 allergen.  The list of food got so small I was not eating. Got checked in inpatient and that got me a few more foods. And I’ve slowly readded one or two over the years (and have really worked hard on fear of touching other people/surfaces). It was an unfortunate and reaffirming traumatic experience that told my mind all my lifelong fears were true.  It’s been a long road.  Recently started with an ED specific therapist and her plan is immersion.  Don’t know how I feel about that other than just terror.",
      "created_utc": 1748529255.0,
      "score": 4,
      "context": [
        {
          "id": "muv29cw",
          "author": "XxLexxyXx",
          "body": "I am overweight and some of my doctor's paperwork will say that I have obesity though that's based off of BMI and I'm kind of rolling my eyes. I developed arphid after trauma. So it came on later in my adult life and it came with a fear of anaphylaxis and death. I've been seeing a lot of progress lately because I have to get gallbladder removal surgery and that completely upended most of my safe foods because I was so afraid of eating my safe foods lately because I don't want another gallbladder attack is that hurt. \n\nI definitely feel the frustration of not being taken seriously because it's already hard enough that I feel most places don't recognize our eating disorder. And then there's like the furthest stigma of not being critically underweight so it's almost like well you're fine. And I feel like even worse yet the fat phobia that we see in the medical system that would say oh well you should probably lose weight anyways. But the body doesn't work like that. When you're restricting as much as you probably are You're probably not going to lose weight. Or you know you might just be eating enough calories it's just not nutrient dense calories you know?\n\nOne thing that's really helped me in recovery is doing EMDR. I'm not saying it's a cure-all, but it could be worth looking into. I've also been seeing an individualized eating disorder specialist and that's helped too. Again, though my situation is different because I haven't always had this eating disorder it came on much later in my adult life and I actually used to love eating and I lived abroad for 2 years and I enjoyed trying new foods and whatnot so it's been quite the 180 to go from that to being afraid to eat most food and only having a small selection of foods that I feel okay eating.",
          "created_utc": 1748516679.0
        }
      ]
    },
    {
      "id": "muw0nz6",
      "author": "Previous_Deal4481",
      "body": "Ok? Maybe not the right post to comment in an ED forum but go off",
      "created_utc": 1748528849.0,
      "score": 1,
      "context": [
        {
          "id": "mutsug4",
          "author": "positively-negative7",
          "body": "nah i used to be fat but i lost 50 pounds in 4 months with pure willpower and gym (and safe foods)",
          "created_utc": 1748492155.0
        }
      ]
    },
    {
      "id": "muw2kj2",
      "author": "Previous_Deal4481",
      "body": "Hugs friend.  I had cDiff that caused an adult onset food allergy",
      "created_utc": 1748529395.0,
      "score": 1,
      "context": [
        {
          "id": "muw0b2m",
          "author": "jodiecomerstan",
          "body": "I’m 177lbs and I have it! Mine was bc of trauma. I had H Pylori",
          "created_utc": 1748528745.0
        }
      ]
    },
    {
      "id": "muw2a6h",
      "author": "Previous_Deal4481",
      "body": "My allergen is a non labeled, non top 9. Companies do not have to disclose and a majority refuse to.  I feel like if it was labeled I wouldn’t feel so powerless all the time.",
      "created_utc": 1748529313.0,
      "score": 2,
      "context": [
        {
          "id": "muv29y7",
          "author": "The_DM25",
          "body": "Hi, I’m not diagnosed with ARFID but I do have a fear of food because of allergic/ anaphylactic reactions. Do you find yourself less scared if you can check and verify ingredients or is it still difficult? No worries if you don’t answer this I know it’s not on the topic of the post but I’m just curious.",
          "created_utc": 1748516687.0
        }
      ]
    },
    {
      "id": "mv7jf50",
      "author": "Little_Bit_87",
      "body": "Also to add my ARFID is sensory based for context.",
      "created_utc": 1748676204.0,
      "score": 1,
      "context": [
        {
          "id": "mv7jauw",
          "author": "Little_Bit_87",
          "body": "Nope! Fellow fatty here. There is actually a lot of people who think they are just picky eaters because they are overweight. This is because healthier foods like meats and vegetables vary in texture and consistency so eventually you encounter a negative experience with it and it becomes forever a no no food. Unhealthier processed food are nearly the same every single time. So they become safe foods. As a kid you're developing and active and growing so you don't see the weight gain. Then you become an adult and everything slows down but you're still eating the same. So you start gaining weight.",
          "created_utc": 1748676133.0
        }
      ]
    },
    {
      "id": "muu3yo6",
      "author": "SachiKaM",
      "body": "Why don’t you just smile? /s",
      "created_utc": 1748497583.0,
      "score": 20,
      "context": [
        {
          "id": "muteqlq",
          "author": "Peanutbutternmtn2",
          "body": "Nope. My diet consists of horrible fattening things too. Right there with ya pal. Only reason I’m not like, morbidly obese, is bc I work out a ton.",
          "created_utc": 1748486509.0
        },
        {
          "id": "mutf8jr",
          "author": "Previous_Deal4481",
          "body": "Ugh I miss being able to do that! I developed an autoimmune disease. Everyday is pain now 🙃🫠 Doctors keep telling me I’d feel so much better if I simply changed my diet.  Like dude.. I KNOW. I work in healthcare, I knoooowww. My psychiatrist just said why don’t you just eat some fruit? I looked and her and said wow, you cured me.  All it took to change almost 40 years of an eating disorder was you saying “eat some fruit”. She had the good sense to be embarrassed and recommended a ED therapist.",
          "created_utc": 1748486686.0
        }
      ]
    },
    {
      "id": "mutfss3",
      "author": "Peanutbutternmtn2",
      "body": "Oh, I feel that so much lol you don’t even know…",
      "created_utc": 1748486889.0,
      "score": 13,
      "context": [
        {
          "id": "muteqlq",
          "author": "Peanutbutternmtn2",
          "body": "Nope. My diet consists of horrible fattening things too. Right there with ya pal. Only reason I’m not like, morbidly obese, is bc I work out a ton.",
          "created_utc": 1748486509.0
        },
        {
          "id": "mutf8jr",
          "author": "Previous_Deal4481",
          "body": "Ugh I miss being able to do that! I developed an autoimmune disease. Everyday is pain now 🙃🫠 Doctors keep telling me I’d feel so much better if I simply changed my diet.  Like dude.. I KNOW. I work in healthcare, I knoooowww. My psychiatrist just said why don’t you just eat some fruit? I looked and her and said wow, you cured me.  All it took to change almost 40 years of an eating disorder was you saying “eat some fruit”. She had the good sense to be embarrassed and recommended a ED therapist.",
          "created_utc": 1748486686.0
        }
      ]
    },
    {
      "id": "mv5unom",
      "author": "bungoustraypups",
      "body": "they're probably actually wrong anyway. losing weight rarely helps people feel better, or if it does, it's only a few pounds, you often don't need to lose ten twenty thirty etc like doctors will push for. doctors are not immune to societal pressures sadly ",
      "created_utc": 1748649522.0,
      "score": 1,
      "context": [
        {
          "id": "muteqlq",
          "author": "Peanutbutternmtn2",
          "body": "Nope. My diet consists of horrible fattening things too. Right there with ya pal. Only reason I’m not like, morbidly obese, is bc I work out a ton.",
          "created_utc": 1748486509.0
        },
        {
          "id": "mutf8jr",
          "author": "Previous_Deal4481",
          "body": "Ugh I miss being able to do that! I developed an autoimmune disease. Everyday is pain now 🙃🫠 Doctors keep telling me I’d feel so much better if I simply changed my diet.  Like dude.. I KNOW. I work in healthcare, I knoooowww. My psychiatrist just said why don’t you just eat some fruit? I looked and her and said wow, you cured me.  All it took to change almost 40 years of an eating disorder was you saying “eat some fruit”. She had the good sense to be embarrassed and recommended a ED therapist.",
          "created_utc": 1748486686.0
        }
      ]
    },
    {
      "id": "muwrufl",
      "author": "NeuroSpicyMeowMeow",
      "body": "im so glad about your doctor!\n\nmy nephrologist wants me on a low oxalate diet and wants me to remove some very important foods for me. i asked him if he knew about ARFID, and he doesnt.\n\ni think i will keep my foods and risk the kidney stones, until i cant.",
      "created_utc": 1748536523.0,
      "score": 3,
      "context": [
        {
          "id": "mutg329",
          "author": "SituationSad4304",
          "body": "I highly doubt it as a fellow sufferer (who is overweight) who works in the medical field. Obese patients tend to be picky and only eat foods that objectively should be eaten in moderation (chips, McDonald’s, soda, chain pizza). Which I understand intimately since they’re consistent in texture and flavor no matter what town you’re in. But it’s hard for people who are dangerously underweight from ARFID to get appropriate treatment without a more “normal” eating disorder comorbidity. People who can eat enough calories to appear normal face both medical misunderstanding and fat bias",
          "created_utc": 1748486995.0
        },
        {
          "id": "muvz2vf",
          "author": "nalycat",
          "body": "I feel like people, especially the medical field, won't take me seriously if I say I have ARFID because I'm overweight. But oh well. I can't control that. I did have a positive experience recently where a doctor decided that I shouldn't go on a specific diet for GERD based on the fact that I have ARFID so she knew my list of safe foods was small and so she didn't want to restrict any further",
          "created_utc": 1748528393.0
        }
      ]
    },
    {
      "id": "muth0wt",
      "author": "SituationSad4304",
      "body": "Yup I’ve got PCOS too. Which I manage by ensuring my meals have equal fat and carbs. I’ve been off metformin for 5 years. But a new doc would look and see me being fat and assume something needed to change (while probably ignoring that the metformin made me stool incontinent). I’d rather be fat than shit my pants once a day",
      "created_utc": 1748487338.0,
      "score": 12,
      "context": [
        {
          "id": "mutg329",
          "author": "SituationSad4304",
          "body": "I highly doubt it as a fellow sufferer (who is overweight) who works in the medical field. Obese patients tend to be picky and only eat foods that objectively should be eaten in moderation (chips, McDonald’s, soda, chain pizza). Which I understand intimately since they’re consistent in texture and flavor no matter what town you’re in. But it’s hard for people who are dangerously underweight from ARFID to get appropriate treatment without a more “normal” eating disorder comorbidity. People who can eat enough calories to appear normal face both medical misunderstanding and fat bias",
          "created_utc": 1748486995.0
        },
        {
          "id": "mutgnyv",
          "author": "Previous_Deal4481",
          "body": "I worked in the ED until I developed an autoimmune disease in the last 4 months and people couldn’t believe my diet. Which isn’t inherently unhealthy.  My safe foods are whole wheat flour that I make into my own bread, chicken thighs, peas/corn, velvetta, pasta, apple juice and Diet Coke.  I was the only person I worked with who brought home cooked meals, I don’t binge eat.  With the PCOS I either needs massive restriction or insane exercise.  It’s so frustrating.  I feel like if I told any friend I had an ED they wouldn’t believe me lol",
          "created_utc": 1748487207.0
        }
      ]
    },
    {
      "id": "muth5gx",
      "author": "SituationSad4304",
      "body": "Your diet sounds like my childhood diet. Spoiler, I lived and grew into a tall woman 🤦‍♀️ your diet is simple but pretty healthy",
      "created_utc": 1748487386.0,
      "score": 3,
      "context": [
        {
          "id": "mutg329",
          "author": "SituationSad4304",
          "body": "I highly doubt it as a fellow sufferer (who is overweight) who works in the medical field. Obese patients tend to be picky and only eat foods that objectively should be eaten in moderation (chips, McDonald’s, soda, chain pizza). Which I understand intimately since they’re consistent in texture and flavor no matter what town you’re in. But it’s hard for people who are dangerously underweight from ARFID to get appropriate treatment without a more “normal” eating disorder comorbidity. People who can eat enough calories to appear normal face both medical misunderstanding and fat bias",
          "created_utc": 1748486995.0
        },
        {
          "id": "mutgnyv",
          "author": "Previous_Deal4481",
          "body": "I worked in the ED until I developed an autoimmune disease in the last 4 months and people couldn’t believe my diet. Which isn’t inherently unhealthy.  My safe foods are whole wheat flour that I make into my own bread, chicken thighs, peas/corn, velvetta, pasta, apple juice and Diet Coke.  I was the only person I worked with who brought home cooked meals, I don’t binge eat.  With the PCOS I either needs massive restriction or insane exercise.  It’s so frustrating.  I feel like if I told any friend I had an ED they wouldn’t believe me lol",
          "created_utc": 1748487207.0
        }
      ]
    },
    {
      "id": "mv5kkv2",
      "author": "lesbiangerardway",
      "body": "I’ve tried it all — glp, metformin, etc. the only thing that worked was extreme restriction. i was so miserable. Working on a new plan now, mainly focused on increasing protein and fiber and reducing *amount* of carbs but not *restricting* types of food. praying this works",
      "created_utc": 1748646080.0,
      "score": 2,
      "context": [
        {
          "id": "mutg329",
          "author": "SituationSad4304",
          "body": "I highly doubt it as a fellow sufferer (who is overweight) who works in the medical field. Obese patients tend to be picky and only eat foods that objectively should be eaten in moderation (chips, McDonald’s, soda, chain pizza). Which I understand intimately since they’re consistent in texture and flavor no matter what town you’re in. But it’s hard for people who are dangerously underweight from ARFID to get appropriate treatment without a more “normal” eating disorder comorbidity. People who can eat enough calories to appear normal face both medical misunderstanding and fat bias",
          "created_utc": 1748486995.0
        },
        {
          "id": "mutgnyv",
          "author": "Previous_Deal4481",
          "body": "I worked in the ED until I developed an autoimmune disease in the last 4 months and people couldn’t believe my diet. Which isn’t inherently unhealthy.  My safe foods are whole wheat flour that I make into my own bread, chicken thighs, peas/corn, velvetta, pasta, apple juice and Diet Coke.  I was the only person I worked with who brought home cooked meals, I don’t binge eat.  With the PCOS I either needs massive restriction or insane exercise.  It’s so frustrating.  I feel like if I told any friend I had an ED they wouldn’t believe me lol",
          "created_utc": 1748487207.0
        }
      ]
    },
    {
      "id": "mw2vwwo",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1749097155.0,
      "score": 1,
      "context": [
        {
          "id": "muter19",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1748486513.0
        },
        {
          "id": "mve35p9",
          "author": "Effective-Arm7302",
          "body": "Ive never met a fellow allergy fearing ARFID sufferer, hello there! Glad to know im not the only one",
          "created_utc": 1748772344.0
        }
      ]
    },
    {
      "id": "muu7rfz",
      "author": "mstrobach",
      "body": "*It’s not that hard! You just gotta push past it! Mind over matter, you can do anything you put your mind to!!* **/s**",
      "created_utc": 1748499635.0,
      "score": 14,
      "context": [
        {
          "id": "muteqlq",
          "author": "Peanutbutternmtn2",
          "body": "Nope. My diet consists of horrible fattening things too. Right there with ya pal. Only reason I’m not like, morbidly obese, is bc I work out a ton.",
          "created_utc": 1748486509.0
        },
        {
          "id": "mutf8jr",
          "author": "Previous_Deal4481",
          "body": "Ugh I miss being able to do that! I developed an autoimmune disease. Everyday is pain now 🙃🫠 Doctors keep telling me I’d feel so much better if I simply changed my diet.  Like dude.. I KNOW. I work in healthcare, I knoooowww. My psychiatrist just said why don’t you just eat some fruit? I looked and her and said wow, you cured me.  All it took to change almost 40 years of an eating disorder was you saying “eat some fruit”. She had the good sense to be embarrassed and recommended a ED therapist.",
          "created_utc": 1748486686.0
        },
        {
          "id": "muu3yo6",
          "author": "SachiKaM",
          "body": "Why don’t you just smile? /s",
          "created_utc": 1748497583.0
        }
      ]
    },
    {
      "id": "mutgzlf",
      "author": "Previous_Deal4481",
      "body": "🫶😬",
      "created_utc": 1748487325.0,
      "score": 9,
      "context": [
        {
          "id": "muteqlq",
          "author": "Peanutbutternmtn2",
          "body": "Nope. My diet consists of horrible fattening things too. Right there with ya pal. Only reason I’m not like, morbidly obese, is bc I work out a ton.",
          "created_utc": 1748486509.0
        },
        {
          "id": "mutf8jr",
          "author": "Previous_Deal4481",
          "body": "Ugh I miss being able to do that! I developed an autoimmune disease. Everyday is pain now 🙃🫠 Doctors keep telling me I’d feel so much better if I simply changed my diet.  Like dude.. I KNOW. I work in healthcare, I knoooowww. My psychiatrist just said why don’t you just eat some fruit? I looked and her and said wow, you cured me.  All it took to change almost 40 years of an eating disorder was you saying “eat some fruit”. She had the good sense to be embarrassed and recommended a ED therapist.",
          "created_utc": 1748486686.0
        },
        {
          "id": "mutfss3",
          "author": "Peanutbutternmtn2",
          "body": "Oh, I feel that so much lol you don’t even know…",
          "created_utc": 1748486889.0
        }
      ]
    },
    {
      "id": "mw00n6c",
      "author": "lenthatswho",
      "body": "Ugh, having to explain to my dialysis dietician that I had ARFID as he was explaining all the foods I needed to cut out was so painful.",
      "created_utc": 1749062969.0,
      "score": 2,
      "context": [
        {
          "id": "mutg329",
          "author": "SituationSad4304",
          "body": "I highly doubt it as a fellow sufferer (who is overweight) who works in the medical field. Obese patients tend to be picky and only eat foods that objectively should be eaten in moderation (chips, McDonald’s, soda, chain pizza). Which I understand intimately since they’re consistent in texture and flavor no matter what town you’re in. But it’s hard for people who are dangerously underweight from ARFID to get appropriate treatment without a more “normal” eating disorder comorbidity. People who can eat enough calories to appear normal face both medical misunderstanding and fat bias",
          "created_utc": 1748486995.0
        },
        {
          "id": "muvz2vf",
          "author": "nalycat",
          "body": "I feel like people, especially the medical field, won't take me seriously if I say I have ARFID because I'm overweight. But oh well. I can't control that. I did have a positive experience recently where a doctor decided that I shouldn't go on a specific diet for GERD based on the fact that I have ARFID so she knew my list of safe foods was small and so she didn't want to restrict any further",
          "created_utc": 1748528393.0
        },
        {
          "id": "muwrufl",
          "author": "NeuroSpicyMeowMeow",
          "body": "im so glad about your doctor!\n\nmy nephrologist wants me on a low oxalate diet and wants me to remove some very important foods for me. i asked him if he knew about ARFID, and he doesnt.\n\ni think i will keep my foods and risk the kidney stones, until i cant.",
          "created_utc": 1748536523.0
        }
      ]
    },
    {
      "id": "mutijon",
      "author": "Previous_Deal4481",
      "body": "I don’t know - I’ve been chronically constipated for years from drugs.  I might sign up for the diaper lol.  😂 but ive avoided metformin solely due to a good A12. I’ve considered a glp, but I have other more pressing issues.",
      "created_utc": 1748487903.0,
      "score": 6,
      "context": [
        {
          "id": "mutg329",
          "author": "SituationSad4304",
          "body": "I highly doubt it as a fellow sufferer (who is overweight) who works in the medical field. Obese patients tend to be picky and only eat foods that objectively should be eaten in moderation (chips, McDonald’s, soda, chain pizza). Which I understand intimately since they’re consistent in texture and flavor no matter what town you’re in. But it’s hard for people who are dangerously underweight from ARFID to get appropriate treatment without a more “normal” eating disorder comorbidity. People who can eat enough calories to appear normal face both medical misunderstanding and fat bias",
          "created_utc": 1748486995.0
        },
        {
          "id": "mutgnyv",
          "author": "Previous_Deal4481",
          "body": "I worked in the ED until I developed an autoimmune disease in the last 4 months and people couldn’t believe my diet. Which isn’t inherently unhealthy.  My safe foods are whole wheat flour that I make into my own bread, chicken thighs, peas/corn, velvetta, pasta, apple juice and Diet Coke.  I was the only person I worked with who brought home cooked meals, I don’t binge eat.  With the PCOS I either needs massive restriction or insane exercise.  It’s so frustrating.  I feel like if I told any friend I had an ED they wouldn’t believe me lol",
          "created_utc": 1748487207.0
        },
        {
          "id": "muth0wt",
          "author": "SituationSad4304",
          "body": "Yup I’ve got PCOS too. Which I manage by ensuring my meals have equal fat and carbs. I’ve been off metformin for 5 years. But a new doc would look and see me being fat and assume something needed to change (while probably ignoring that the metformin made me stool incontinent). I’d rather be fat than shit my pants once a day",
          "created_utc": 1748487338.0
        }
      ]
    },
    {
      "id": "mutirfk",
      "author": "Previous_Deal4481",
      "body": "Yeah it’s def not like an inherently “bad” diet - just bad for me due to the insulin resistance and genetics lol. Very frustrating!",
      "created_utc": 1748487984.0,
      "score": 5,
      "context": [
        {
          "id": "mutg329",
          "author": "SituationSad4304",
          "body": "I highly doubt it as a fellow sufferer (who is overweight) who works in the medical field. Obese patients tend to be picky and only eat foods that objectively should be eaten in moderation (chips, McDonald’s, soda, chain pizza). Which I understand intimately since they’re consistent in texture and flavor no matter what town you’re in. But it’s hard for people who are dangerously underweight from ARFID to get appropriate treatment without a more “normal” eating disorder comorbidity. People who can eat enough calories to appear normal face both medical misunderstanding and fat bias",
          "created_utc": 1748486995.0
        },
        {
          "id": "mutgnyv",
          "author": "Previous_Deal4481",
          "body": "I worked in the ED until I developed an autoimmune disease in the last 4 months and people couldn’t believe my diet. Which isn’t inherently unhealthy.  My safe foods are whole wheat flour that I make into my own bread, chicken thighs, peas/corn, velvetta, pasta, apple juice and Diet Coke.  I was the only person I worked with who brought home cooked meals, I don’t binge eat.  With the PCOS I either needs massive restriction or insane exercise.  It’s so frustrating.  I feel like if I told any friend I had an ED they wouldn’t believe me lol",
          "created_utc": 1748487207.0
        },
        {
          "id": "muth5gx",
          "author": "SituationSad4304",
          "body": "Your diet sounds like my childhood diet. Spoiler, I lived and grew into a tall woman 🤦‍♀️ your diet is simple but pretty healthy",
          "created_utc": 1748487386.0
        }
      ]
    },
    {
      "id": "mw9qpqa",
      "author": "Effective-Arm7302",
      "body": "Last year I was 92 pounds and now I can eat again so I’m thriving compared to how I was. We truly are fighters and this really is a disease.",
      "created_utc": 1749188960.0,
      "score": 1,
      "context": [
        {
          "id": "muter19",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1748486513.0
        },
        {
          "id": "mve35p9",
          "author": "Effective-Arm7302",
          "body": "Ive never met a fellow allergy fearing ARFID sufferer, hello there! Glad to know im not the only one",
          "created_utc": 1748772344.0
        },
        {
          "id": "mw2vwwo",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1749097155.0
        }
      ]
    },
    {
      "id": "mv5knl7",
      "author": "lesbiangerardway",
      "body": "The IR is soooo hard :(",
      "created_utc": 1748646106.0,
      "score": 2,
      "context": [
        {
          "id": "mutg329",
          "author": "SituationSad4304",
          "body": "I highly doubt it as a fellow sufferer (who is overweight) who works in the medical field. Obese patients tend to be picky and only eat foods that objectively should be eaten in moderation (chips, McDonald’s, soda, chain pizza). Which I understand intimately since they’re consistent in texture and flavor no matter what town you’re in. But it’s hard for people who are dangerously underweight from ARFID to get appropriate treatment without a more “normal” eating disorder comorbidity. People who can eat enough calories to appear normal face both medical misunderstanding and fat bias",
          "created_utc": 1748486995.0
        },
        {
          "id": "mutgnyv",
          "author": "Previous_Deal4481",
          "body": "I worked in the ED until I developed an autoimmune disease in the last 4 months and people couldn’t believe my diet. Which isn’t inherently unhealthy.  My safe foods are whole wheat flour that I make into my own bread, chicken thighs, peas/corn, velvetta, pasta, apple juice and Diet Coke.  I was the only person I worked with who brought home cooked meals, I don’t binge eat.  With the PCOS I either needs massive restriction or insane exercise.  It’s so frustrating.  I feel like if I told any friend I had an ED they wouldn’t believe me lol",
          "created_utc": 1748487207.0
        },
        {
          "id": "muth5gx",
          "author": "SituationSad4304",
          "body": "Your diet sounds like my childhood diet. Spoiler, I lived and grew into a tall woman 🤦‍♀️ your diet is simple but pretty healthy",
          "created_utc": 1748487386.0
        },
        {
          "id": "mutirfk",
          "author": "Previous_Deal4481",
          "body": "Yeah it’s def not like an inherently “bad” diet - just bad for me due to the insulin resistance and genetics lol. Very frustrating!",
          "created_utc": 1748487984.0
        }
      ]
    }
  ]
}