{
  "id": "1l1ry1d",
  "subreddit": "ARFID",
  "author": "undercovercatman",
  "created_utc": 1748894242.0,
  "title": "My bf is helping me realize that flavor and texture isn’t always the enemy",
  "selftext": "For context, growing up I had a VERY challenging relationship with food. I’ve always eaten very bland, processed, textureless foods and rarely deviated from my short list of safe foods. When I was a kid I would sit at the table for hours when my parents cooked something new for me to try, so meals were always very socially challenging and extremely anxiety inducing for me. To avoid the texture of meat I would drench it in ketchup, and I’d take blueberries like pills to avoid the fruit inside. I’ve been attempting to take this disorder and turn it into something more positive now that I’m an adult and have started living on my own, and have encouraged my boyfriend to cook things that will push me out of my comfort zone. \n\nSlide 1 (the most challenging one): seasoned chicken taco with fresh tomatoes, onions, and avocado \n\nThe combination of flavorful chicken, crunchy onions, acidic tomatoes, and cold soft avocado was a sensory overload at first. I definitely know now that I don’t like raw tomatoes lol, but once I took some of those off I actually finished both tacos! I’m really impressed that I managed to get through it all, since foods with more texture and flavor usually make me shut down and lose my appetite from spending so much mental energy on processing what was going on in my mouth. \n\nSlide 2: salmon teriyaki street tacos with coleslaw and green onion\n\nThis was my first meal from him that I had tried, and I was so shocked that I liked it that I almost cried lmao. I only made it through one taco since I was overwhelmed, but it’s the first meal I’ve tried that has made me want to try it again which is huge. I think if I tried it again I would totally finish it all. \n\nApologies for the long post, but I’ve been so emotional and proud of myself for these huge steps I’ve taken. If I told myself even just a year ago that I’d be eating this, I would’ve laughed in my own face. ",
  "url": "https://www.reddit.com/gallery/1l1ry1d",
  "score": 160,
  "num_comments": 15,
  "comments": [
    {
      "id": "mvncsk4",
      "author": "a-d_m_c-o",
      "body": "very proud of you and your progress !!! my boyfriend has been helping me similarly (:",
      "created_utc": 1748894833.0,
      "score": 28,
      "context": []
    },
    {
      "id": "mvngmqy",
      "author": "LuxandGold",
      "body": "I'm so proud of you! \n\nGiven this massive breakthrough, I'd suggest fajitas as another food you could try that's extremely similar to those two you've had. Especially because it's also incredibly customisable in every way. Fajitas were and are one of my biggest breakthrough foods, the combination of textures and flavours took me literally weeks to break into, until I finally have it fairly \"normally\", (I don't have salsa and guac as I just... can't) but I have learned it's a preference and it's ok! \n\nKeep up with it! I hope more food becomes easier for you!",
      "created_utc": 1748895920.0,
      "score": 14,
      "context": []
    },
    {
      "id": "mvnj7o9",
      "author": "sapphic_prism",
      "body": "wait swallowing blueberries like that is genius",
      "created_utc": 1748896652.0,
      "score": 8,
      "context": []
    },
    {
      "id": "mvo02u8",
      "author": "feenthehuman",
      "body": "I was cringing just reading the second description, wow!!! I don't know you or your safe foods but that is certainly a LOT of new/uncomfy foods for me, so I'm incredibly impressed! Congrats!",
      "created_utc": 1748901648.0,
      "score": 7,
      "context": []
    },
    {
      "id": "mvor1im",
      "author": "Designmetoo",
      "body": "Onion in literally any form is the bane of my existence, I can't eat it at all. It's so frustrating cause it's in everyyything.\n\nHappy to see you have a breakthrough and sucess, you got this",
      "created_utc": 1748910677.0,
      "score": 6,
      "context": []
    },
    {
      "id": "mvpqeyi",
      "author": "SituationSad4304",
      "body": "My husband has been the most helpful person in my whole life with helping me try foods. He understands I find “hiding” foods a breach of trust. He understands that sometimes I’m in a brave taste something mood and sometimes I’m not. Between him and cooking I’ve come a long way. He’s happy to explain the flavor and texture of something, compare it to things I’m familiar with, and offer to taste without pressure (or the pressure of ordering a whole plate of something myself)\n\nHold onto your boyfriend, he’s a good one",
      "created_utc": 1748924189.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mvo8mqc",
      "author": "Honest-Garbage9256",
      "body": "So proud of you!! That’s really amazing progress! My partner also has been helping me with food exposures. It’s so wonderful to be able to trust someone in that way and it’s a really lovely way to bond (:",
      "created_utc": 1748904425.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mvo8dna",
      "author": "TashaT50",
      "body": "Congrats that’s awesome.",
      "created_utc": 1748904344.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mvppmd2",
      "author": "reallynicegirl57",
      "body": "This is the exact situation ive been in! Im so happy my boyfriend cooks for me as often as he does. When we first started dating me he made a stir fry, which was crazy intimidating to me at the time, but now its a complete safe food. We're winning!! Small victories 🎉🎉",
      "created_utc": 1748923839.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mvqbvxi",
      "author": "jimbobhas",
      "body": "I love finding a new meal that I like. Especially one where I don’t have to make any amendments to it. Makes me feel more like an adult",
      "created_utc": 1748935317.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mvvx9c4",
      "author": "solitudanrian",
      "body": "This is a HUGE win and you should be proud. I'm certainly proud of you. Looks like you've got a keeper.",
      "created_utc": 1749005490.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mwjkz5q",
      "author": "Affectionate-Sky3360",
      "body": "IM SO PROUD OF YOU INTERNET STRANGER!!",
      "created_utc": 1749326817.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mvo8c22",
      "author": "TashaT50",
      "body": "That’s how I managed peas as a kid.",
      "created_utc": 1748904329.0,
      "score": 6,
      "context": [
        {
          "id": "mvnj7o9",
          "author": "sapphic_prism",
          "body": "wait swallowing blueberries like that is genius",
          "created_utc": 1748896652.0
        }
      ]
    },
    {
      "id": "mvsoaee",
      "author": "undercovercatman",
      "body": "Despite how difficult it is, exposure really is the only effective way I’ve found to start tackling this condition, and I especially liked what you said about the loss of trust in hiding details about foods. I used to not want to know what I was eating, but actually taking the time to engage in the uncomfortable sensation of being in the kitchen (I have zero cooking skills and am super sensitive to smells) and knowing EXACTLY what I’m eating has helped me become so much more confident! Congrats to you on your progress!",
      "created_utc": 1748968357.0,
      "score": 3,
      "context": [
        {
          "id": "mvpqeyi",
          "author": "SituationSad4304",
          "body": "My husband has been the most helpful person in my whole life with helping me try foods. He understands I find “hiding” foods a breach of trust. He understands that sometimes I’m in a brave taste something mood and sometimes I’m not. Between him and cooking I’ve come a long way. He’s happy to explain the flavor and texture of something, compare it to things I’m familiar with, and offer to taste without pressure (or the pressure of ordering a whole plate of something myself)\n\nHold onto your boyfriend, he’s a good one",
          "created_utc": 1748924189.0
        }
      ]
    },
    {
      "id": "mvson6q",
      "author": "undercovercatman",
      "body": "Yes!! Feeling more like an adult has been the thing that made me want to get out of my comfort zone. Sometimes it’s harder to deal with others’ perception of my ARFID than it is for me to actually experience it lol",
      "created_utc": 1748968457.0,
      "score": 2,
      "context": [
        {
          "id": "mvqbvxi",
          "author": "jimbobhas",
          "body": "I love finding a new meal that I like. Especially one where I don’t have to make any amendments to it. Makes me feel more like an adult",
          "created_utc": 1748935317.0
        }
      ]
    }
  ]
}