{
  "id": "1l304lm",
  "subreddit": "ARFID",
  "author": "PhilosopherExact4483",
  "created_utc": 1749024988.0,
  "title": "So turns out ARFID is the same thing as Substance Use Disorder guys [Possible TW: mentions of drug abuse]",
  "selftext": "So a bit of background, I (16n) was sent to stay with my grandmother for a week against my will and I kid you not, on the very first day this conversation happened.\nHer: “So (birthname) do you plan on ever getting over your food thing?”\nMe: “I don’t know, it’s complicated. There’s two main problems I get from it, which is the restrictive diet and then the general lack of interest in eating and trouble processing/ignoring hunger signals. I don’t really want to do the treatment for my diet because it seems long and painful and I’m pretty stable with that right now always—the problem is really regularly not eating three meals a day, or eating three very small meals a day. That’s the part I need to worry about.”\nHer: “Okay…you know I struggled with picky eating when I was a kid once too...”\nMe: *sits in uncomfortable silence while she explains something that is not at all the issue I have*\nMe: “I mean I might consider getting treatment someday but right now I just have so much going on that I just couldn’t handle it.”\nHer: “That’s fair. So you might someday?”\nMe: “Yep.”\nHer: “That’s good. So you know this affects the people around you too right?”\nMe: *instantly flabbergasted*\nHer: “You know it’s like the same thing with drug addicts.”\nMe: *thoroughly and utterly flabbergasted* She is not…\nHer: “They think, ‘well it’s my body it’s my choice and I can put drugs into it if I want to’. And they don’t ever think about how it affects those people that care about them.”\nMe: *speechless* How is my eating disorder at all relevant to that?\nHer: “Take my cousin for instance. He struggled with drug addiction for a really long time and (something in here I don’t entirely remember what) What about his parents? What about the money they spent on treatment? What about the PRAYERS they spent on him? What about the love they had for him?”\nMe: *Too mortified to try forming a coherent argument* How- how does ANY of that apply to me?\n\nWe rode home in silence, and now I know what it’s like to have my eating disorder directly compared to drug abuse.",
  "url": "https://www.reddit.com/r/ARFID/comments/1l304lm/so_turns_out_arfid_is_the_same_thing_as_substance/",
  "score": 94,
  "num_comments": 18,
  "comments": [
    {
      "id": "mvxz9xs",
      "author": "Perchance09",
      "body": "No offense, but she kinda sounds like someone who would use someone else's illness to gain sympathy for herself. Sorry you had hear something so stupid!",
      "created_utc": 1749041648.0,
      "score": 85,
      "context": []
    },
    {
      "id": "mvyd07p",
      "author": "Angelangepange",
      "body": "Not the precious, precious prayers!! All wasted 🤦🏻‍♀️ nooo what will god say?! Look, they are on the floor and god does not believe in the 5 second rule!!    \n     \nBut jokes aside I feel like we do have something in common with addicts and it's the fact that people believe isolating us and treating us worse will cure us...",
      "created_utc": 1749046109.0,
      "score": 52,
      "context": []
    },
    {
      "id": "mvyi6zi",
      "author": "BuildingOk6614",
      "body": "Soooo is she implying the money, prayers, and love are thus wasted on such? Cause that’s just wrong..",
      "created_utc": 1749047631.0,
      "score": 41,
      "context": []
    },
    {
      "id": "mvzw21d",
      "author": "More-Professor-1755",
      "body": "That seems like a REALLY backhanded way of her expressing that your condition makes HER feel uncomfortable. \n\nIt seems very emotionally immature. She's projecting her own fear about not being able to handle her own nutrition. \n\nIt's probably difficult for her to see you struggle with something she perceives as similar (even if it's actually completely different) and instead of handling that like an adult, she pushed it onto you. \n\nI'm sorry she handled that so poorly. \n\nI hope she gets the help she needs to be able to support you better or at least leave her unsolicited opinions unspoken.",
      "created_utc": 1749061666.0,
      "score": 20,
      "context": []
    },
    {
      "id": "mvzxw7y",
      "author": "lenthatswho",
      "body": "Honestly people think it’s the same because all they can see is us “choosing” not to eat something, which equates us to picky children. They can’t feel the things we feel, or hear the thoughts, or experience the mental and physical sensations we experience. All they see is a person not eating the meal they lovingly made, or not going to dinner with them, or even perhaps embarrassing them in a social situation. \n\nIt sucks, especially the last one - but they just don’t and can’t get it. The one reason I decided to pursue some sort of treatment was because of a post in the AITAH sub from a chef who was embarrassed by her boyfriend being a “picky eater,” and at first I was mad on his behalf. But hearing the story only from her perspective made me think. She didn’t say he had ARFID specifically, and as far as boyfriends go he was being a little ridiculous from her context, but in their situation she kind of had a right to be embarrassed?\n\nAnd I was suddenly struck by the thought that I never wanted to be that person. I don’t want to be unable to eat a lovingly prepared meal because someone happened to forget to ask - or didn’t know to ask - for a list of “safe foods” or if I had specific or odd aversions. I dunno about y’all but “Are you allergic to anything or have dietary restrictions?” is always way too broad a question for ME. Technically the answer is no, sure - but how do I spout off all the things that make my skin crawl if I put them in my mouth?? Or the ones that trigger a gag reflex? How do I explain that if eggs are store bought they’re fine but if they came from someone’s backyard from pet chickens my brain refuses to accept them as food?!\n\nThe simple explanation is, I can’t. So I don’t. And sometimes it’s fine, but sometimes I end up fighting for my life trying not to offend or embarrass someone I care about. So that’s what I focused on in treatment…tamping down the visceral reactions to foods that trigger me so that I can go about a meal without feeling like the world is about to end. I just wanted to be able to realize a food wasn’t trying to kill me - or whatever tf my body thinks is happening. \n\nAnyway, thinking about it like that is what helped me. And all of that to say, it’s the WAY your grandmother said what she did that’s the problem here. Eating disorders ARE hard on the people who love us, but not understanding what’s actually happening is part of the problem. If you’re offended and need to keep away from her then that’s entirely valid. But it also might be a good time to sit and try to tell her how YOU feel. We don’t choose to be this way. Some people can finally come to terms with that, and some can’t. See which one she is first.",
      "created_utc": 1749062189.0,
      "score": 10,
      "context": []
    },
    {
      "id": "mvxuslb",
      "author": "paradigm_mgmt",
      "body": "i'm sorry you had to go through that 🫤 i love it when people say harmful things from a place of care/s (i edited because reddit has weird typography features 🙄)",
      "created_utc": 1749040032.0,
      "score": 10,
      "context": []
    },
    {
      "id": "mvzjf78",
      "author": "Historical_Spell_772",
      "body": "Stay away from her. She gon make everything worse",
      "created_utc": 1749058136.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mvzftxt",
      "author": "dumbroad",
      "body": "It's not exactly the same and the delivery is awful, but it is the same in the sense that the people that love us and dont experience what we do: 1) cant truly understand it - addiction and arfid are both debated by those who dont* understand or experience either as pure 'choice' 2)care about us and dont want us to have negative health impacts.\n\n\nAs someone with arfid in my 30s, I have malnutrition (low alkaline phosphatase and other things in blood panels), and other negative health impacts - that I would have never predicted when I was 16. These health implications, like many others, can lead to bigger issues. If someone loves you they wouldn't want this for you. Try to focus on that instead of the poor delivery of the message",
      "created_utc": 1749057153.0,
      "score": 13,
      "context": []
    },
    {
      "id": "mw00lfs",
      "author": "_FirstOfHerName_",
      "body": "It doesn't impact people the same way as a drug addiction, not does it function the same way as an addiction, and I'm probably going to get downvoted into oblivion... but it definitely impacts people around us. \n\nI've been in what I would consider recovery for a few years and it's been like night and day with my relationships. Work colleagues can now plan a social that involves food without feeling bad or me triple checking a menu and needing support, I can spontaneously go out on trips with my partner without stopping and making sure I've got safe food (in snack pack format) so I can eat, and my mum isn't worried about my heart giving out or me getting diabetes anymore. \n\nI didn't notice all of these things that much when I was eating in a disordered way, it was just how things had to be and I was ignorant of other people's adaptions. In my mind I couldn't change anything so people would have to accommodate me. \n\nNow it's so obvious to me the way my diet and eating impacted the people around me, and how much my choice to improve has improved everyone's life.",
      "created_utc": 1749062956.0,
      "score": 9,
      "context": []
    },
    {
      "id": "mw4i06q",
      "author": "PhazonOmega",
      "body": "I'm glad I came across this story simply because the description of what you go through internally is EXACTLY what I go through, and it's helped to quell the doubts I still had about whether or not I have ARFID. Upvote for that!",
      "created_utc": 1749126976.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mw7a7po",
      "author": "saltil",
      "body": "Sometimes I do feel like a burden in the way she describes, then I realise how unfair that is, if I could eat like them I would and I'd love knowing my health was taken care of, but my body isn't going to let me and it's help we all need not shame",
      "created_utc": 1749156272.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mwwv716",
      "author": "TraditionalClerk9017",
      "body": "Wow, all I can say is that you seem very mature and well balanced, which is fantastic. Do your best to ignore that kind of conversation and feel proud of how well you're doing. So many people with ARFID might not even be able to express their issues the way you did. I'm rooting for you!",
      "created_utc": 1749507432.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mw5nls5",
      "author": "Sure-Lecture-2542",
      "body": "I love my husband very much. He has struggled with both alcoholism and ARFID. Thankfully, he has been able to overcome alcoholism and has been sober for many years now. He can’t really make any progress on ARFID. It’s much more difficult for him. \n\nThere are certainly many similarities but the main one is denial. For both conditions, denial is the first and biggest challenge. You must admit there’s an actual problem before you can start to heal. It’s difficult, because helping someone realize their behavior is harmful, means you have to *tell them* how it’s impacting everyone. It’s really hard to tell people these things. And it’s even harder to hear. These are always going to be very difficult and uncomfortable conversations. But necessary. \n\nMy husband convinces himself that he’s ‘stable’ because he ignores or minimizes any evidence to the contrary. He sets up his day everyday so that he never has to confront his disordered eating. Then something unexpected will happen -because life happens-and suddenly the ED will be painfully obvious and he’ll spiral into self loathing. But, he’ll easily default to his same habits that allow him to avoid food and within a day or 2 he’s back to convinced that he’s ‘stable.’ He convinces himself that the food itself is the problem, not his emotions about the food and his inability and unwillingness to learn to manage those emotions. The coworkers and customers that worry about his low weight and awkwardly ask if he’s sick and dying…those people are just incredibly rude. Can’t be a sign that he needs help. He just happens to know a lot of really rude people, that all act in the same rude way. Coincidentally. \n\nSame way he convinced himself that drinking 12+ beers every single night and being drunk before noon every weekend was “functional” and didn’t impact our family at all.  He literally compared it to other dads that go golfing or fishing. As if his drinking was just a unique type of hobby and therefore can’t be a legitimate problem. Because really the problem is me. I should stop nagging him about his “hobby” and stop being sad all the time (from the emotional and verbal abuse he issued while drunk but could never remember the next day). Deflection. Minimizing. Ignoring. Rationalizing. All effective ways to maintain denial and therefore never have to do anything about the problem. Not because he’s some worthless, heartless monster. But because he had a condition that took him over and controlled him. And made him think there was no other way, no escape. \n\nI understand you’re offended, anybody would be. Nobody wants to be compared to a drug addict. But if someone feels the need to have this sort of conversation, understand that they are trying to help you. Try to be curious and open to hearing her concerns. A very limited diet can have serious medical consequences that can be lifelong and irreversible. Your grandma loves you and wants you to be healthy and happy. I promise.",
      "created_utc": 1749139743.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mwdaazj",
      "author": "Deep_Willingness6071",
      "body": "Using prayer, something sacred and loving, to guilt trip you is wild. I’m so sorry you had to go through that.",
      "created_utc": 1749237647.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mwhih0t",
      "author": "Specific-Deer7287",
      "body": "She had some good points and expressed a harsh reality living with  a desease. Its simply hard BC u want help but simply can't. Because a person with a desease needs to admit and want to work on his/her desease. \nI had a picky child and finally its over. Stressing about her eating 5 times per day? What a torture!",
      "created_utc": 1749302670.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mvy1p4d",
      "author": "None",
      "body": "I actually agree with her as a person with ARFID. It really depends on where your health is if that extreme language was in any way appropriate. And where it's been previously \n\nSuicide does hurt the people around you. People watching you self harm and not get help, hurts\n\nReally depends on the severity we are talking about here",
      "created_utc": 1749042484.0,
      "score": -14,
      "context": []
    },
    {
      "id": "mvyz54y",
      "author": "luminousjoy",
      "body": "Shouldn't have had to be spent. The family member was a burden because of the effort they put into their health, and they're telling OP they're concerned for the rest of the family because OP's issues could also cost them money, love, and prayers.\n\n\n How rude of them, having medical issues, shouldn't they think of the family instead and just not be ill?\n\n\n I think it's fucked, and they avoid having any empathy for OP or the family member, putting family as a figure-head for money and effort.\n\n\n They're concerned about the money, and they didn't like family spending time praying for each other. They have bad priorities, imo. It seems manipulative to me, to cause guilt.",
      "created_utc": 1749052451.0,
      "score": 17,
      "context": [
        {
          "id": "mvyi6zi",
          "author": "BuildingOk6614",
          "body": "Soooo is she implying the money, prayers, and love are thus wasted on such? Cause that’s just wrong..",
          "created_utc": 1749047631.0
        }
      ]
    },
    {
      "id": "mw4htho",
      "author": "PhazonOmega",
      "body": "Beautifully and wisely said!\n\nAs someone who didn't know my problem had a name (or even WAS a problem) until recently, I know my problem affects people, and it has been difficult to know for certain if I have ARFID. After the description by OP and you of what it's like, I KNOW I have it. I am grateful to hear of others' experiences that uncannily match my own.\n\nI am also grateful to hear someone speak so thoughtfully on the issue as you have. The grandmother sounds like she didn't approach this well at all, and that's likely an understatement. However, her position of feeling uncomfortable and not understanding is completely valid. That's where I was about myself for most of my life! And the idea of getting help sounds wonderful. I didn't realize there really was such a thing!  It does feel like a drug addiction, but kind of in reverse. You could argue I am addicted to certain foods, or you could argue I am the opposite of addicted to food in general. I just wouldn't want someone arrogantly and ignorantly lecturing me and guilt tripping me on the topic like the grandmother seemed to be.",
      "created_utc": 1749126906.0,
      "score": 3,
      "context": [
        {
          "id": "mvzxw7y",
          "author": "lenthatswho",
          "body": "Honestly people think it’s the same because all they can see is us “choosing” not to eat something, which equates us to picky children. They can’t feel the things we feel, or hear the thoughts, or experience the mental and physical sensations we experience. All they see is a person not eating the meal they lovingly made, or not going to dinner with them, or even perhaps embarrassing them in a social situation. \n\nIt sucks, especially the last one - but they just don’t and can’t get it. The one reason I decided to pursue some sort of treatment was because of a post in the AITAH sub from a chef who was embarrassed by her boyfriend being a “picky eater,” and at first I was mad on his behalf. But hearing the story only from her perspective made me think. She didn’t say he had ARFID specifically, and as far as boyfriends go he was being a little ridiculous from her context, but in their situation she kind of had a right to be embarrassed?\n\nAnd I was suddenly struck by the thought that I never wanted to be that person. I don’t want to be unable to eat a lovingly prepared meal because someone happened to forget to ask - or didn’t know to ask - for a list of “safe foods” or if I had specific or odd aversions. I dunno about y’all but “Are you allergic to anything or have dietary restrictions?” is always way too broad a question for ME. Technically the answer is no, sure - but how do I spout off all the things that make my skin crawl if I put them in my mouth?? Or the ones that trigger a gag reflex? How do I explain that if eggs are store bought they’re fine but if they came from someone’s backyard from pet chickens my brain refuses to accept them as food?!\n\nThe simple explanation is, I can’t. So I don’t. And sometimes it’s fine, but sometimes I end up fighting for my life trying not to offend or embarrass someone I care about. So that’s what I focused on in treatment…tamping down the visceral reactions to foods that trigger me so that I can go about a meal without feeling like the world is about to end. I just wanted to be able to realize a food wasn’t trying to kill me - or whatever tf my body thinks is happening. \n\nAnyway, thinking about it like that is what helped me. And all of that to say, it’s the WAY your grandmother said what she did that’s the problem here. Eating disorders ARE hard on the people who love us, but not understanding what’s actually happening is part of the problem. If you’re offended and need to keep away from her then that’s entirely valid. But it also might be a good time to sit and try to tell her how YOU feel. We don’t choose to be this way. Some people can finally come to terms with that, and some can’t. See which one she is first.",
          "created_utc": 1749062189.0
        }
      ]
    }
  ]
}