{
  "id": "1l4nx8d",
  "subreddit": "ARFID",
  "author": "Whjoy",
  "created_utc": 1749201169.0,
  "title": "My dad went on ozempic and finally understands",
  "selftext": "Just thought I’d share a funny thing that happened. I was diagnosed with ARFID about a year ago and my family (particularly my dad) have had a hard time understanding. My dad has always picked on me for being so particular about food and never being very hungry. He has been overweight for most of his adult life and loves to eat everything lol. Well, he was recently prescribed a weight loss medication similar to ozempic and has been complaining recently about how he feels sick when he eats and has lost interest in food and feels that he needs to force himself to eat. I heard this statement and laughed because I told him this was exactly how I feel all the time and it’s why I hate eating. He looked at me in surprise and I think he finally realized how miserable it is! Since then he has not picked on me for not eating most of my plate because he isn’t either ;)",
  "url": "https://www.reddit.com/r/ARFID/comments/1l4nx8d/my_dad_went_on_ozempic_and_finally_understands/",
  "score": 402,
  "num_comments": 15,
  "comments": [
    {
      "id": "mwauqv2",
      "author": "None",
      "body": "I have had this conversation over and over again the last few years. It's weird finally getting some empathy from the people who were most dismissive of what I have been dealing with",
      "created_utc": 1749210811.0,
      "score": 104,
      "context": []
    },
    {
      "id": "mwah9w3",
      "author": "Front-Cat-2438",
      "body": "Your compassion exceeds what he deserves. At least you are no longer suffering alone, but really would not wish this upon either of you.",
      "created_utc": 1749204444.0,
      "score": 88,
      "context": []
    },
    {
      "id": "mwbyzlv",
      "author": "giraffemoo",
      "body": "My partner was never mean or anything about my arfid but a similar thing happened when he started that med too. He was like \"I understand better now\". I felt like a superhero because I was able to share tips with him about how to manage constant nausea.",
      "created_utc": 1749223886.0,
      "score": 40,
      "context": []
    },
    {
      "id": "mwcv5a6",
      "author": "jols0543",
      "body": "many people can’t be empathic about something until they’ve experienced the exact same thing, it’s really shallow",
      "created_utc": 1749233103.0,
      "score": 40,
      "context": []
    },
    {
      "id": "mwc5frb",
      "author": "Hot_Razzmatazz316",
      "body": "I always liken it to [this scene ](https://youtu.be/4_1GA8AFx7c?si=kd5T0sunjpR6zOKZ) from Oliver! I'll tell people you look at something and you'll see the table that the adults are eating from. People with ARFID see the gruel. And no one, not even the adults, wanted to eat the gruel.",
      "created_utc": 1749225727.0,
      "score": 14,
      "context": []
    },
    {
      "id": "mwhy37p",
      "author": "Affectionate_Desk_43",
      "body": "I had a similar experience! My mom became much more understanding when she started dealing with her own stomach issues. Very frustrating that it took so much for her to be understanding but I’m glad we got here somehow lol",
      "created_utc": 1749308046.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mxjk2wy",
      "author": "RealityTVfan28",
      "body": "I think one of the main reasons we receive little empathy is we don’t look sick. If we avoid certain foods there is no physical thing to see. Hard for people to understand things they cannot “see”.",
      "created_utc": 1749812908.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mwhfzgs",
      "author": "Specific-Deer7287",
      "body": "Now you can return to yr dad whatever he said to you. How long is he going to be on the med? How many extra pounds does he have?",
      "created_utc": 1749301715.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mwtn62b",
      "author": "Consistent-Can7951",
      "body": "Man that must be nice to have a person in person to understand what you’re going through. I’d love that but unfortunately I feel it’s only my children that understands and that is a fail on my side as they’re children not adults.",
      "created_utc": 1749473624.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n1kl0th",
      "author": "Key-March-5228",
      "body": "unfortunately I feel sometimes like this is the only way people are able to sympathize with people. my sister has been experiencing this a lot, and while I struggle with a different form of arfid, it feels nice to be understood. I feel bad for her obviously, but it is nice to have someone else to relate to outside of my friends from treatment.",
      "created_utc": 1751768804.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mwes08c",
      "author": "LacrimaNymphae",
      "body": "probably is going to end up with gastroparesis and vitamin deficiencies if he doesn't have those things already",
      "created_utc": 1749255333.0,
      "score": 0,
      "context": []
    },
    {
      "id": "mwbsktl",
      "author": "RavenLunatic512",
      "body": "Quite often their empathy comes with the expectation that you keep being empathetic no matter what",
      "created_utc": 1749222037.0,
      "score": 34,
      "context": [
        {
          "id": "mwauqv2",
          "author": "None",
          "body": "I have had this conversation over and over again the last few years. It's weird finally getting some empathy from the people who were most dismissive of what I have been dealing with",
          "created_utc": 1749210811.0
        }
      ]
    },
    {
      "id": "mweug84",
      "author": "kangaroorecondit",
      "body": "^^^^",
      "created_utc": 1749256256.0,
      "score": 4,
      "context": [
        {
          "id": "mwcv5a6",
          "author": "jols0543",
          "body": "many people can’t be empathic about something until they’ve experienced the exact same thing, it’s really shallow",
          "created_utc": 1749233103.0
        }
      ]
    },
    {
      "id": "mwh0ff1",
      "author": "crazy_cowgirl_444",
      "body": "such a ray of sunshine you are. any reason for commenting this?",
      "created_utc": 1749294817.0,
      "score": 3,
      "context": [
        {
          "id": "mwes08c",
          "author": "LacrimaNymphae",
          "body": "probably is going to end up with gastroparesis and vitamin deficiencies if he doesn't have those things already",
          "created_utc": 1749255333.0
        }
      ]
    },
    {
      "id": "mwh0jpq",
      "author": "LacrimaNymphae",
      "body": "those are the reasons i can't take it myself and i've been pressured to by my primary care. there are a lot of GI issues it can cause and i have tons right from the get go so i didn't want to make things any worse. i've also been called 'picky' which is an understatement and been accused of eating in excess in an almost jokingly way when i can only eat certain things that are easier for me to eat and digest like processed stuff and no matter what it is it just sits there. i eat basically every 24 hours and it's a big-ish meal. anything fibrous or leafy is a nightmare and comes out the way it looked when i ate it plus causes me serious cramping and pain so i assume i'm not digesting bulky things properly and i even have issues with bile\n\nplus i doubt losing 10 pounds and staying that way albeit still ill for a few months (if not more so) would get them to shut up and actually look into what's going on. i'm on the spectrum as well so i was probably blunt here. people of all different weights can have gp and arfid as comorbidities but doctors think you need to be paper-thin and visibly deficient to have even just one of those things. it's not always that apparent. with me it's more of a silent thing as i'm clinically obese. but there's a subset of people who are 'gainers' who put weight on instead of dropping it with gp\n\nmy vitamin d and b12 are critically low even NOT on weight loss drugs designed to make you absorb less and it's already enough to complicate daily life without having any of that introduced so i hope no one in the same boat as me ends up even more fucked up if they decide to go that route. otherwise i may have tried by now",
      "created_utc": 1749294878.0,
      "score": 6,
      "context": [
        {
          "id": "mwes08c",
          "author": "LacrimaNymphae",
          "body": "probably is going to end up with gastroparesis and vitamin deficiencies if he doesn't have those things already",
          "created_utc": 1749255333.0
        },
        {
          "id": "mwh0ff1",
          "author": "crazy_cowgirl_444",
          "body": "such a ray of sunshine you are. any reason for commenting this?",
          "created_utc": 1749294817.0
        }
      ]
    }
  ]
}