{
  "id": "1l662wf",
  "subreddit": "ARFID",
  "author": "Maximum_Hurry_3708",
  "created_utc": 1749366366.0,
  "title": "IM ALWAYS EMBARRASSED AT RESTAURANTS. Nothing on the menu works, and I will always ask for things on the menu like “can I have the —- without the —-, ——, ——, —-, —-……” etc. does anyone else do this? How do you get over the embarrassment? I would like some advice :)",
  "selftext": "",
  "url": "https://www.reddit.com/r/ARFID/comments/1l662wf/im_always_embarrassed_at_restaurants_nothing_on/",
  "score": 113,
  "num_comments": 30,
  "comments": [
    {
      "id": "mwmngnu",
      "author": "Original_Cable6719",
      "body": "A lot of real restaurants are super accommodating. I also appreciate places that are set up in the manner of Subway/Chipotle (I don’t eat at either of those places, but I like the model). They expect you to choose every ingredient!",
      "created_utc": 1749373864.0,
      "score": 37,
      "context": []
    },
    {
      "id": "mwmq8cf",
      "author": "tucnakpingwin",
      "body": "I used to get embarrassed about it but now customisation in restaurants is more commonly asked for/available, it’s not really an issue for me now. McDonald’s double cheeseburgers are my safe food, and you bet I customise the shit out of them. No ketchup, no pickles, no onions 🤣\n\nI used to be a waiter, then manager in a restaurant, and we’d have people ask for all sorts of random customisations. Generally, if it’s a simple remove item or swap item it’s never an issue if you ask politely. \n\nThe only time it was ever unachievable was when customers wanted no garlic in their soup, for example. The soup would be made earlier in the day in advance; so it’s not possible to remove it; but in this situation any waiter worth their salt would recommend a dish that could accommodate such a request. \n\nIt would be worth phoning in advance if you have your heart set on a specific dish on the menu, and you want to ensure there’s no unsafe foods in the meal, and the menu isn’t forthcoming with what exactly is in it. \n\nNo one will judge you, we only ever judged(in our heads)  the people who said they were allergic to tomatoes or something when they weren’t, they just didn’t like them. We’d prefer people to be upfront and say “I don’t like them” rather than panic us and cause us to deep clean the restaurant to ensure no allergens are near your meal. If you just don’t like something it’s easier to accommodate than an allergy as it doesn’t have a cross contamination risk, or risk of anaphylaxis. I hope this puts your mind at ease a little! :)",
      "created_utc": 1749375570.0,
      "score": 27,
      "context": []
    },
    {
      "id": "mwmnm4h",
      "author": "Original_Cable6719",
      "body": "I will add, I do have a lot of anxiety ordering and it takes me way too long to choose. I often google the menu of new restaurants before going so I have a plan of what to order!",
      "created_utc": 1749373959.0,
      "score": 19,
      "context": []
    },
    {
      "id": "mwo0n6c",
      "author": "Foreign_Objective748",
      "body": "It happens to me and also I often have to ask what's EXACTLY is in the meal, like \"vegetables\" ok what vegetables, \"oh some summer vegetables\" WHICH ONES ?   \nBut I actualy like going to the restaurant when it's meals I like, so I'm kinda used to it even if it's not convenient. If I'm embarassed I remember that if I had allergies or something would I be ashamed ? No, because it's not my fault, well, it's not my fault either, and I will end up paying for the whole plate anyway so why should they be mad ?",
      "created_utc": 1749395146.0,
      "score": 15,
      "context": []
    },
    {
      "id": "mwo1ght",
      "author": "kittybabylarry",
      "body": "I always check the menu before I go somewhere. Some places look cool but have NOTHING I would ever eat on the menu. Half the time I ask for the kids menu. I won’t go out on holidays cuz the menu is usually pre fixe and you can’t make substitutions.",
      "created_utc": 1749395399.0,
      "score": 7,
      "context": []
    },
    {
      "id": "mwodda3",
      "author": "No-Leather8413",
      "body": "i’m a bartender/server at a pub and just know that mostly every restaurant has buttons on their system to remove/add items to meals. the only time we can’t do that is if something is premade, like a dip or a soup. also restaurants have an “open item” button if you wanted something as simple as a couple pieces of bacon. i have arfid also and trust me, modding food doesn’t bother 90% of wait staff, we’re more than used to it!",
      "created_utc": 1749399068.0,
      "score": 8,
      "context": []
    },
    {
      "id": "mwoiiia",
      "author": "TashaT50",
      "body": "I’m always ordering off the menu. I’ve been doing this since I was under 10 back in the 1970s. It’s gotten so much easier now that allergies, eating disorders, vegan, vegetarian, fad diets, and religious restrictions have gotten more acceptable. It’s also much easier now that menus are online so I can figure out what I’m going to order, make notes in my phone, and am prepared for the rare freeze moments where I’ll show the waitstaff my notes because I’m tongue tied.\n\nI was a waitress for a few years. The only thing I cared about my customers orders was getting them right. No judgments on the food. \n\nTips from 50 years of ordering off menu\n* Look at online menus and pick 2-3 options in case they are out of your #1 \n* Look at children’s and lunch menus as those are smaller portions and frequently have fewer ingredients - talk to a manager if waitstaff says no you can’t order off those and explain your making this request due to food restrictions/smaller appetite for medical reasons. I’ll offer to pay more for the kids menu if I sense this is the issue.\n* I find it can be easier to create something new based off of ingredients so instead of asking for menu item X but having them remove 10 things I’ll ask can they make me a grilled chicken with garlic with a side of mashed potatoes with only butter. \n* Write down what you’ve decided to order in a note on your phone so if you have a brain fart you can remember what you decided & can even show it to waitstaff if your having a hard time speaking due to anxiety \n* Don’t be afraid to ask to talk to the chef if you’re at a fancy/very expensive restaurant as they are frequently willing to work with you based on your safe food restrictions - calling ahead at a quieter hour (ex. 10-11:30am & 2-5pm on weekdays) as someone else mentioned may be easier \n* Order a drink and an appetizer or drink and dessert if that’s the only thing on the menu you feel confident eating. I’m including soda, lemonade, tea, and coffee as drinks no matter the time of day.\n* I joke with the waitstaff that “I’m going to be the complicated order in our party are you ready?” it “disarms” anyone I’m eating with - kinda hard to give me a hard time when I’m joking and laughing about my food restrictions \n* It’s ok to request a complete list of all ingredients including all seasonings - just say you’re sensitive to a lot of ingredients and it’s easier to see a recipe list than carry around pages of ingredients that your unable to enjoy",
      "created_utc": 1749400663.0,
      "score": 8,
      "context": []
    },
    {
      "id": "mwn1rbk",
      "author": "Upset-Lavishness-522",
      "body": "I have celiac too. I hate it, im embarrassed, but I guarantee the serving staff don't care.",
      "created_utc": 1749382016.0,
      "score": 7,
      "context": []
    },
    {
      "id": "mwoa5jq",
      "author": "jkjwysa",
      "body": "I worked in food and learned how much worse some people are. There are customers who want you to do 15 modifications AND they're rude about it. I know that if I'm at least nice I'm better that most.",
      "created_utc": 1749398071.0,
      "score": 7,
      "context": []
    },
    {
      "id": "mwmdx5n",
      "author": "thatsnuckinfutz",
      "body": "I think for me because I have a common food allergy I'm used to having to say something about my food but it *does* get tiring. I don't eat out often for other reasons but when i do i just try to order the least complicated thing that I'm willing to eat.",
      "created_utc": 1749368150.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mwmxzzc",
      "author": "darkprincess3112",
      "body": "I just decided to order drinks only. This is still a burden if it is in public, and sometimes quite distracting, but this can be relieved by the addition of alcohol.\n\nYou have to forgive yourself that these conditions are a torture for you, no matter whether others \"enjoy\" it or not. Ask yourself \"how can I find out whether the others really enjoy it? Or is it possible that it is just a convention, a habit that is judged as good by the ruling classes?\".\n\nIt is hard for many people to admit that they feel uncomfortable in or with something that is labelled as \"normal\" by social dogma.\n\nBut is the latter really created by \"the majority\"?\n\nLearn to question everything.",
      "created_utc": 1749380068.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mwpe6zh",
      "author": "Honest-Garbage9256",
      "body": "I rarely go to restaurants anymore, but when asking for menu item customization, I would always tell them it was an allergy if they gave me crap about it. It usually worked out okay and I was taken more seriously. Sometimes asking to speak directly to the cook (sometimes calling ahead of time to do so) has helped to be taken more seriously because they are actually making the food and tend to care a little more. I worked in restaurants for years as wait staff and sometimes there can be a lot of pressure and fear when asked to customize menu items because you are told you aren’t allowed to do that unless it’s allergy related. I hope this helps a little!",
      "created_utc": 1749410150.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mwr0b1c",
      "author": "Dragon_enby",
      "body": "Honestly, you're paying them to serve you the food you want. If your requests are reasonable substitutions or removals, it shouldn't be an issue if you bring it up politely. \n\nI always look at the menu beforehand and pick out a first and hopefully second option. If I am concerned that the restaurant will be unable to accommodate one of my requests, I'll occasionally call during a quiet time and ask to speak to a chef or manager to explain that I have specific restrictions and ask if they can do X thing. \n\nIf I am ordering off of the kids menu, I'll tend to say \"You're welcome to charge me whatever you'd like for this, as I know that it's only offered on the kid's menu.\" They'll often ring it in as a similar main dish or just give it to you for the kids price.\n\nIf you feel that you were particularly difficult at any point, leave an extra big tip if you can afford it.",
      "created_utc": 1749429374.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mwp2du0",
      "author": "Dull-Touch283",
      "body": "I feel for you. Working in restaurants though, I can assure you that if what you’re doing is just removing a bunch of stuff, no one is annoyed about having less food to prepare lol. Plenty of kitchen guys have told me that when making my food because I get stuff that’s really simple. However, I generally tend to get whatever requires the least amount of customizations when I go to other places even if it’s not what I’m in the mood for because it’s easier all around. \n\nI wouldn’t worry too much about this though, at the end of the day you are one of a ton of orders throughout the day and no one is thinking about it after you’re out the door. Something I had to learn myself.",
      "created_utc": 1749406604.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mwrk4zk",
      "author": "Naejakire",
      "body": "Yes. I mean, I don't eat at many restaurants but I would absolutely get things I can eat if they exist. If it's too much and would be like, impossible to customize? I won't bother.. Like with Mexican food, there's literally nothing I could eat even modified. If it was a burger? I could with mods. It just takes time to get over the embarrassment. With practice and with age, you will feel better. I've realized that food service workers have dealt with everything. They're not judging you, they don't care. The ONLY thing they care about and you need to worry about is being kind and respectful. If someone was being rude as hell and demanding all these mods? Yeah, they'd be annoyed.. But if you're just friendly and kind? Its no issue. I'll be like \"sorry I have food restrictions, I know it sounds crazy lol\" like self depricating and letting them know you're self aware and know how weird your food request is. They'll laugh with ya. Also, maybe tip more if it's an extreme ask. \n\nEither way, you're fine and no one cares as much as you think they do. Everyone has their own lives and shit to think about so they're forgetting you as soon as you leave (in a good way). \n\nThe main takeaway here is CONFIDENCE and being \"in on the joke\" and self aware. Laugh at yourself before others can, and they'll be laughing with you. Think about it - if you saw someone trip and then get all embarrassed or cry, you feel embarrassed with them and feel bad for them. If you see them trip and they start laughing, it breaks the tension and you don't feel that secondhand embarrassment.",
      "created_utc": 1749436593.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mwpyiky",
      "author": "-Spookbait-",
      "body": "Just tell them you have some restrictions, you don't need to over explain or be embarrassed, I think most places are pretty happy to be accommodating if you're polite and respectful",
      "created_utc": 1749416446.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mwrmr3l",
      "author": "calmingthechaos",
      "body": "At a restaurant I am familiar with, I'm fine. I love the restaurants that have their full menu available online because I can pick what I am going to order beforehand. It's more embarrassing for me if I go out with someone who isn't aware of my food issues beforehand, or at least not the extent of it. A lot of my family is picky, and the friends I go out to eat with the most are aware and super accommodating. 🥹\n\nIn all honesty, I think it's much more common now to customize orders with allergies and intolerances being more recognized and talked about these days. My best advice is to always look ahead at menus if possible and just be polite about it. And if it doesn't come out, politely inform the server or counter person. Even people without ARFID have preferences!",
      "created_utc": 1749437596.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mwszngw",
      "author": "LeakyFountainPen",
      "body": "It seemed bad in America, but then I traveled to Europe and found out that while customizing your food is taken for granted in America (if sometimes a little odd) it can be seen as an insult in many parts of Europe. \n\nMy heart goes out to the European ARFIDers because I thought I was going to get *murdered* by the French.",
      "created_utc": 1749463179.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mwt6wuj",
      "author": "the_artsykawaii_girl",
      "body": "I just order from the kid’s menu",
      "created_utc": 1749466924.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mwv6oil",
      "author": "Kelmeckis94",
      "body": "I always check the menu from any restaurant before I go. Just to see if they have at least one or two options that I can and will eat. Usually I get lucky and have more options to choose from. \n\nI don't feel embarrassed, I always think they appreciate it more if I ask to leave an ingredient out than them finding it on my plate. Because it's a waste of the ingredient otherwise.",
      "created_utc": 1749490153.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mwvl27j",
      "author": "kelslawpy",
      "body": "Honestly the biggest thing that’s helped me was surrounding myself with people (my spouse) that don’t make a big deal out of me asking for changes. Growing up, I was ridiculed by my father for needing any special change when eating. He’d also get worse if god forbid the food came out wrong. I’ve been screamed at in restaurants more than I’d care to think about..\n\nBut my friends now and especially my husband couldn’t care less that I need changes. He’s my biggest advocate and cheerleader. The anxiety of eating out has slowly lessened over the years",
      "created_utc": 1749494106.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mwzfjmq",
      "author": "Afraid-Flan5154",
      "body": "Oh god yes, me too, I go through the drive through when I can to get food because every single person working those things is dead inside, but trying to order food at a restaurant actually makes me panic. I get a friend of family member to order for me while I go to the bathroom, since usually it’s something off the kids menu or just bits of meals",
      "created_utc": 1749545185.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mxnytiv",
      "author": "Maximum_Hurry_3708",
      "body": "Thank you",
      "created_utc": 1749863337.0,
      "score": 1,
      "context": [
        {
          "id": "mwmngnu",
          "author": "Original_Cable6719",
          "body": "A lot of real restaurants are super accommodating. I also appreciate places that are set up in the manner of Subway/Chipotle (I don’t eat at either of those places, but I like the model). They expect you to choose every ingredient!",
          "created_utc": 1749373864.0
        }
      ]
    },
    {
      "id": "mwu6ybh",
      "author": "lime-green-casefiles",
      "body": "This helps! I went to a mexican restaurant yesterday and didn't order something that sounded nice because I thought asking for a substitution would be rude or something. What I did end up ordering was really good, but now I know it'll be easier for me to try other stuff.",
      "created_utc": 1749480076.0,
      "score": 4,
      "context": [
        {
          "id": "mwmq8cf",
          "author": "tucnakpingwin",
          "body": "I used to get embarrassed about it but now customisation in restaurants is more commonly asked for/available, it’s not really an issue for me now. McDonald’s double cheeseburgers are my safe food, and you bet I customise the shit out of them. No ketchup, no pickles, no onions 🤣\n\nI used to be a waiter, then manager in a restaurant, and we’d have people ask for all sorts of random customisations. Generally, if it’s a simple remove item or swap item it’s never an issue if you ask politely. \n\nThe only time it was ever unachievable was when customers wanted no garlic in their soup, for example. The soup would be made earlier in the day in advance; so it’s not possible to remove it; but in this situation any waiter worth their salt would recommend a dish that could accommodate such a request. \n\nIt would be worth phoning in advance if you have your heart set on a specific dish on the menu, and you want to ensure there’s no unsafe foods in the meal, and the menu isn’t forthcoming with what exactly is in it. \n\nNo one will judge you, we only ever judged(in our heads)  the people who said they were allergic to tomatoes or something when they weren’t, they just didn’t like them. We’d prefer people to be upfront and say “I don’t like them” rather than panic us and cause us to deep clean the restaurant to ensure no allergens are near your meal. If you just don’t like something it’s easier to accommodate than an allergy as it doesn’t have a cross contamination risk, or risk of anaphylaxis. I hope this puts your mind at ease a little! :)",
          "created_utc": 1749375570.0
        }
      ]
    },
    {
      "id": "mwzubr6",
      "author": "RamsGirl0207",
      "body": "Don't be embarrassed, that is terrible they aren't specific. My husband is allergic (big time) to everything in the squash family. Summer vegetables seem to always include yellow squash and/or zucchini. We learned the hard way to ask before ordering (the hard way was I noticed before he took a bite when we were served, thankfully).\n\nHis niece is the only other person we have met allergic to squash, so I have no idea how common it is, but vegetable allergies exist. They need to be specific what is in something when asked.",
      "created_utc": 1749553217.0,
      "score": 1,
      "context": [
        {
          "id": "mwo0n6c",
          "author": "Foreign_Objective748",
          "body": "It happens to me and also I often have to ask what's EXACTLY is in the meal, like \"vegetables\" ok what vegetables, \"oh some summer vegetables\" WHICH ONES ?   \nBut I actualy like going to the restaurant when it's meals I like, so I'm kinda used to it even if it's not convenient. If I'm embarassed I remember that if I had allergies or something would I be ashamed ? No, because it's not my fault, well, it's not my fault either, and I will end up paying for the whole plate anyway so why should they be mad ?",
          "created_utc": 1749395146.0
        }
      ]
    },
    {
      "id": "mxnyvj6",
      "author": "Maximum_Hurry_3708",
      "body": "Kids menu good idea",
      "created_utc": 1749863357.0,
      "score": 2,
      "context": [
        {
          "id": "mwo1ght",
          "author": "kittybabylarry",
          "body": "I always check the menu before I go somewhere. Some places look cool but have NOTHING I would ever eat on the menu. Half the time I ask for the kids menu. I won’t go out on holidays cuz the menu is usually pre fixe and you can’t make substitutions.",
          "created_utc": 1749395399.0
        }
      ]
    },
    {
      "id": "mwpf08u",
      "author": "Honest-Garbage9256",
      "body": "If you do mention allergy, just make sure you let them know it’s not something that you are deadly allergic to. That can cause a lot of chaos and fear in the kitchen. I do have a few legitimate allergies, but none that would cause a visit to the hospital. I also only mention allergy as a last resort if they are being really insensitive about it. One of my allergies is to red meat, so cross contamination is a big one for me so I usually choose to only get food from vegetarian and vegan restaurants.",
      "created_utc": 1749410400.0,
      "score": 2,
      "context": [
        {
          "id": "mwpe6zh",
          "author": "Honest-Garbage9256",
          "body": "I rarely go to restaurants anymore, but when asking for menu item customization, I would always tell them it was an allergy if they gave me crap about it. It usually worked out okay and I was taken more seriously. Sometimes asking to speak directly to the cook (sometimes calling ahead of time to do so) has helped to be taken more seriously because they are actually making the food and tend to care a little more. I worked in restaurants for years as wait staff and sometimes there can be a lot of pressure and fear when asked to customize menu items because you are told you aren’t allowed to do that unless it’s allergy related. I hope this helps a little!",
          "created_utc": 1749410150.0
        }
      ]
    },
    {
      "id": "mwuohx1",
      "author": "MysticCollective",
      "body": "I'm not one to go around and shout \"America is better!\" But I will make an exception for this case. Honestly, other place's people need to grow up. I get it, it takes time and effort to prepare a meal but you made the decision to serve others. If you can't handle a modification to the order then maybe you should rethink your choices. Some modifications are medically necessary, some are religious and some are just because. Me wanting something a certain way is not disrespectful to the cook. It's actually respectful because it lessens the chances that I will send the order back or ordering something else. By modifying my meal it means that I am still enjoying the meal the cook spent time preparing. Meaning I save them time by not having to redo my order and they can use that time for other orders.",
      "created_utc": 1749485096.0,
      "score": 3,
      "context": [
        {
          "id": "mwszngw",
          "author": "LeakyFountainPen",
          "body": "It seemed bad in America, but then I traveled to Europe and found out that while customizing your food is taken for granted in America (if sometimes a little odd) it can be seen as an insult in many parts of Europe. \n\nMy heart goes out to the European ARFIDers because I thought I was going to get *murdered* by the French.",
          "created_utc": 1749463179.0
        }
      ]
    },
    {
      "id": "mx08jw5",
      "author": "turtlewings2o5",
      "body": "I once forgot to order a beloved pasta dish without the “steamed vegetables,” which was already a meal-breaker, but I was startled that one of the “vegetables” it arrived with was mushrooms. They’re not a vegetable! They’re not even a plant! And enough people find them gross that it’s a very bad idea, I think, to include them as a surprise. Wtf. \n\n(Also an appalling number of grilled cheese sandwiches get served with a surprise pickle. What do they gain by not mentioning the pickle in the menu description??)",
      "created_utc": 1749559025.0,
      "score": 2,
      "context": [
        {
          "id": "mwo0n6c",
          "author": "Foreign_Objective748",
          "body": "It happens to me and also I often have to ask what's EXACTLY is in the meal, like \"vegetables\" ok what vegetables, \"oh some summer vegetables\" WHICH ONES ?   \nBut I actualy like going to the restaurant when it's meals I like, so I'm kinda used to it even if it's not convenient. If I'm embarassed I remember that if I had allergies or something would I be ashamed ? No, because it's not my fault, well, it's not my fault either, and I will end up paying for the whole plate anyway so why should they be mad ?",
          "created_utc": 1749395146.0
        },
        {
          "id": "mwzubr6",
          "author": "RamsGirl0207",
          "body": "Don't be embarrassed, that is terrible they aren't specific. My husband is allergic (big time) to everything in the squash family. Summer vegetables seem to always include yellow squash and/or zucchini. We learned the hard way to ask before ordering (the hard way was I noticed before he took a bite when we were served, thankfully).\n\nHis niece is the only other person we have met allergic to squash, so I have no idea how common it is, but vegetable allergies exist. They need to be specific what is in something when asked.",
          "created_utc": 1749553217.0
        }
      ]
    },
    {
      "id": "mx0yg9y",
      "author": "Foreign_Objective748",
      "body": "I totally get that. I'm allergic to strawberries but I like all the other red fruits. Sometimes even on supermarket products they don't even bother to say what are the red fruits. I hate it sooooooooo much, and when I order a cheesecake ? Boom surprise, strawberry sauce on it ! I'm at one point when I can't eat raspberry cake without wondering \"did they put strawberry without saying ?\"  \n I'm a calm person but this is making me angry :')",
      "created_utc": 1749567188.0,
      "score": 1,
      "context": [
        {
          "id": "mwo0n6c",
          "author": "Foreign_Objective748",
          "body": "It happens to me and also I often have to ask what's EXACTLY is in the meal, like \"vegetables\" ok what vegetables, \"oh some summer vegetables\" WHICH ONES ?   \nBut I actualy like going to the restaurant when it's meals I like, so I'm kinda used to it even if it's not convenient. If I'm embarassed I remember that if I had allergies or something would I be ashamed ? No, because it's not my fault, well, it's not my fault either, and I will end up paying for the whole plate anyway so why should they be mad ?",
          "created_utc": 1749395146.0
        },
        {
          "id": "mwzubr6",
          "author": "RamsGirl0207",
          "body": "Don't be embarrassed, that is terrible they aren't specific. My husband is allergic (big time) to everything in the squash family. Summer vegetables seem to always include yellow squash and/or zucchini. We learned the hard way to ask before ordering (the hard way was I noticed before he took a bite when we were served, thankfully).\n\nHis niece is the only other person we have met allergic to squash, so I have no idea how common it is, but vegetable allergies exist. They need to be specific what is in something when asked.",
          "created_utc": 1749553217.0
        }
      ]
    }
  ]
}