{
  "id": "1l7zl18",
  "subreddit": "ARFID",
  "author": "Necessary-Shop1055",
  "created_utc": 1749564282.0,
  "title": "Just made me mad",
  "selftext": "Accidentally saw this tweet and holy if this didn't make me angry. Mind you she's dead serious too.",
  "url": "https://i.redd.it/x6ez4y3vw36f1.png",
  "score": 252,
  "num_comments": 64,
  "comments": [
    {
      "id": "mx0uqqn",
      "author": "boytoy421",
      "body": "Dude I can't eat a salad, you think I'm putting a whole-ass dick in my mouth?",
      "created_utc": 1749566123.0,
      "score": 153,
      "context": []
    },
    {
      "id": "mx0q5bq",
      "author": "phejster",
      "body": "Here's a tip: if someone uses \"gay\" to mean \"bad\" or \"gross\", you can freely ignore them because they are a terrible person.",
      "created_utc": 1749564782.0,
      "score": 355,
      "context": []
    },
    {
      "id": "mx0rjcg",
      "author": "tenth",
      "body": "This is just rage bait. How do you know she's dead serious? Is this account known for it's thoughtful discussion of dietary information? \n\n\n\"Fake & gay\" makes me take this pretty unseriously. It seems like posting it here would only serve to upset others, so I'm not following the logic there either. ",
      "created_utc": 1749565189.0,
      "score": 94,
      "context": []
    },
    {
      "id": "mx0q0ey",
      "author": "TheMadHatterWasHere",
      "body": "Fake AND gay? I guess this person is a homophobe as well.",
      "created_utc": 1749564742.0,
      "score": 38,
      "context": []
    },
    {
      "id": "mx0vfdx",
      "author": "beomint",
      "body": "While I agree this is likely ragebait (doesn't change how much it hurts to see ofc, but just a hopeful thought this person doesn't actually go around irl saying shit like this) I really never understood the hate against people with ARFID and the idea that people with ARFID are trying to victimize ourselves or something. It's not an excuse, it's an explanation. I've only ever used it as an explanation and nothing more. I do what I need to do with the doctors I need to do it with to move towards a happier and healthier self. I'm using all of the resources available to live my life as close to normal as everybody else and at the end of the day, what I do or don't eat only affects me, not anybody else. At that point it genuinely just feels like power tripping and control freaking when people have an issue with it because they want to control every aspect of how you live your life.",
      "created_utc": 1749566321.0,
      "score": 39,
      "context": []
    },
    {
      "id": "mx1galf",
      "author": "TaraBURGER",
      "body": "Look, I might be gay but I doubt that has anything to do with my ARFID.",
      "created_utc": 1749572242.0,
      "score": 30,
      "context": []
    },
    {
      "id": "mx16x87",
      "author": "Whatever-She-Chose",
      "body": "Gay?  The '80s called - they want their insult back. Lol \n\n(Said as someone who grew up in the 70s and 80s - which is about how long ago that was considered a legit insult, lol)",
      "created_utc": 1749569607.0,
      "score": 15,
      "context": []
    },
    {
      "id": "mx0sc5z",
      "author": "two-of-me",
      "body": "Oh we’re gay now too? Who uses that word like that after second grade anymore?",
      "created_utc": 1749565422.0,
      "score": 13,
      "context": []
    },
    {
      "id": "mx19gvy",
      "author": "ControlOk8832",
      "body": "A woman calling me gay? Even though she’s the one who likes men??? Bait used to be believable and this is woman is NOT the master baiter",
      "created_utc": 1749570324.0,
      "score": 11,
      "context": []
    },
    {
      "id": "mx1fxcu",
      "author": "Wolvii_404",
      "body": "If you use gay as an insult, you are immediately discredited and I won't believe a single word that comes out of your mouth lol",
      "created_utc": 1749572137.0,
      "score": 7,
      "context": []
    },
    {
      "id": "mx19bf7",
      "author": "angeltay",
      "body": "Ragebait. Ignore.",
      "created_utc": 1749570282.0,
      "score": 6,
      "context": []
    },
    {
      "id": "mx1e2ts",
      "author": "feistymummy",
      "body": "Try to keep in mind that social media had turned into the extreme and controversial because that’s what gets the highest interactions and views.",
      "created_utc": 1749571610.0,
      "score": 6,
      "context": []
    },
    {
      "id": "mx1oyao",
      "author": "Mysterious_Alarm_160",
      "body": "Definitely got a fake disorder yep yep cause in my 23 years of living on this planet i can count the number of times i have actually eaten fruit, only learned to eat vegetables in the past 7 years or so totally a \"CHOICE OF LIFESTYLE\" to not eat nutritious food yall.",
      "created_utc": 1749574681.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mxapiz6",
      "author": "lydiar34",
      "body": "Wait is my gayness caused by arfid or vice versa??",
      "created_utc": 1749687645.0,
      "score": 6,
      "context": []
    },
    {
      "id": "mx1anod",
      "author": "ceciliabee",
      "body": "Small minded beliefs from small minded people shouldn't upset you, it should evoke pity. This is the best they can do to feel special, isn't that sad? No skills, talents, abilities, nothing worth bragging about, nothing worth praising, no ideas worth celebrating, nothing special worth paying any mind to. No hobbies to distract, no friends to be around.\n\nMaking asinine posts like this are IT for this type of person. There is nothing that makes them feel valuable like sharing ignorant opinions with other sad, ignorant people. It's frustrating to hear, yes, but don't get upset. Let them have it and pity them while you laugh. Their opinions matter as little as they do.",
      "created_utc": 1749570654.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mx1w5oj",
      "author": "spookiestbread",
      "body": "if i could of chosen to not cry over my oatmeal this morning i would of. i’m tired of the arfid is fake nonsense",
      "created_utc": 1749576645.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mx1k712",
      "author": "Akumu9K",
      "body": "Bait used to be believable",
      "created_utc": 1749573350.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mx231b8",
      "author": "extremely_displeased",
      "body": "honestly i don’t lose it over these ppl anymore, if someone says that to me i just chuckle and go “okay”. they want us to argue and try to justify ourselves. nah.",
      "created_utc": 1749578522.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mx2elj5",
      "author": "FlemFatale",
      "body": "Hah. My safe food right now is cookies. I am not fake and gay, I am a cookie monster, thank you very much.",
      "created_utc": 1749581774.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mx2epc0",
      "author": "Affectionate-Stay-51",
      "body": "Well… my first thought was: after years of my life thinking I am not normal bc no one eats like this and finding out there might be a word describing what’s going on in my life since forever - and realizing I’m not alone with my eating habits - this post is so mean 😂. I mean, I don’t know for sure it’s ARFID, but it might be and for whatever reason this community helped me when I first got onto Reddit to read more about arfid. I now finally realize how others must feel when they get told something like that within other topics. But after seeing the comment section: yes, this might be just someone having rage bait going on, still mean though. \n\nI can laugh about this right now, but on other days I might have felt the same as OP. \n\nMy god, I still feel so weird in public talking about how my body thinks about food intake of certain foods. This just makes me feel like I shouldn’t talk about it and instead just refer to myself as a picky eater instead of educating people in public about possible eating disorders …",
      "created_utc": 1749581805.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mx9ad4l",
      "author": "v4morant",
      "body": "definitely a fake disorder, not like i nearly got hospitalized several times in tti facilities because i was starving and malnourished from genuinely not being able to eat the food they served lol",
      "created_utc": 1749671457.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mxa5r56",
      "author": "saintceciliax",
      "body": "It’s rage bait",
      "created_utc": 1749680894.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mx1mc10",
      "author": "Gashi_The_Fangirl_75",
      "body": "What a bitter clown 💀",
      "created_utc": 1749573961.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mx1sg04",
      "author": "SimpleArmadillo9911",
      "body": "If we dissect this comment. The OP is saying arfid is a made up disorder by   individuals who are just pretending (fake) and happy or homosexual (gay).  It is at least nice that these lying people are happy and/or individuals living their true and hopefully best lives, I am guessing this person is completely uneducated, rude, individual stirring up rage due to their on lack of compassion, medical knowledge, and basic human decency! \n\nFor all those suffering from Arfid, I am so sorry, this must be awful. Any medical issue can be so hard to live and deal with. I do not have Arfid but other medical issues and feel your pain. For all the happy people, we should be so lucky to be happy,obviously not about Arfid! OP should have said compassion if they had a soul. For all my gay friends out there, obviously that has no relation to a horrible medical condition. We are all worthy of “love”, it should be celebrated and the world needs more of it! OP Is ignorant and full of hate, and what a horrible existence to be living. I hope they get counseling and stop emotionally terrorizing people!  They are not worthy of anyone’s time or attention when all they do is spew hate.",
      "created_utc": 1749575636.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mx1xqdo",
      "author": "cryptidqt",
      "body": "it’s bait but a lot of people sincerely hold these sort of views. twitter is teeming with these sort of boilerplate takes on mental illness/etc. none of them have any idea what they’re talking about of course but it’s very easy to sit back and detachedly deem somebody else’s suffering as fake and gay. low iq contrarianism disguised as profundity",
      "created_utc": 1749577080.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mx2sb3j",
      "author": "MyMoreOriginalName",
      "body": "Who uses gay as a negative connotation in 2025? Seriously I haven't heard my brother say it and he used to be constant about it. Id disregard this immediately, this person is an asshole",
      "created_utc": 1749585701.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mx2xas8",
      "author": "LessEntertainment363",
      "body": "They're still in the headspace where they think gay is an insult. Ignore it. Also, if they think it's gay, sorry, but no, I wanted to eat some nuts and couldn't even suck on them. Walnuts, obviously.",
      "created_utc": 1749587091.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mx3m8cl",
      "author": "pyroc1astic",
      "body": "you heard it here first ladies and gents, have an eating disorder that isn’t anorexia? you’re gay.",
      "created_utc": 1749594538.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mx3tbum",
      "author": "SomeTraits",
      "body": "If \"gay\" means \"happy\", then yes ma'am, I'm a fake gay",
      "created_utc": 1749596878.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mx896i7",
      "author": "Sad_Way7719",
      "body": "lol, as a 20yo male I’ve heard this from “friends” countless times 🤣. It’s almost seems like that dad from 1950s “your gonna eat what I put in front of you!”",
      "created_utc": 1749660864.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mx8o129",
      "author": "Tako_Asteris",
      "body": "I've heard this so much, even people saying that they could cure me. My response always was: \"Well, I'm gonna vomit in your face if you want to try\" and they always looked at me disgusted, lolol",
      "created_utc": 1749664961.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mx8zqdg",
      "author": "princessuuke",
      "body": "Atp im mad killing myself didnt work im tired",
      "created_utc": 1749668320.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mxaynm3",
      "author": "hereforkittensonly",
      "body": "I mean I cannot deny the gay accusations but fake? Hell no",
      "created_utc": 1749690954.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mxcqiic",
      "author": "DunyaOfPain",
      "body": "fuck maureen",
      "created_utc": 1749721585.0,
      "score": 1,
      "context": []
    },
    {
      "id": "my7dr5z",
      "author": "Civil_Buffalo_4783",
      "body": "I have suffered from this disorder for 30 years, and to see someone mock me for this nearly breaks my heart. Is it so hard to understand others and respect things you dont understand these days? Why must people have such radical opinions about issues that dont affect them? I have desperately looked for help to fix this problem, my whole life was ridiculed my whole childhood as if I was just being a bad child... to this day i go days without eating and feeling full and nauosus all my life and just wish someone just realized that im not doing this for any reason... Is it that hard to give someone the benefit of the doubt before being an uneducated radical against people who never asked for their problems?",
      "created_utc": 1750131739.0,
      "score": 1,
      "context": []
    },
    {
      "id": "myjgqkg",
      "author": "DragonflyOne1190",
      "body": "I'm guessing she's also the type of person to say emetophobia is made up for attention as well, coming from someone who's heard both \"\"ARFID\" is just picky eating\" and \"emetophobia is made up for attention\" coming from mainly the same type of person",
      "created_utc": 1750289405.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mzabecg",
      "author": "existentialcrisesyay",
      "body": "Nah calling it gay as well, damn she called me out for both me being gay & having ARFID 😔 \nI don't get why people need to get their panties in a twist when someone is different than them, one where we're still functioning as they believe but in reality its a hell of a lot deeper than \"picky eating\". Wouldn't be surprised if she doesn't believe how debilitating Ehlers Danlos syndrome actually is because all you see is these external things when surprisingly, it's doing a lot inside too & it can lead to complications. Invisible doesn't mean it doesn't exist.",
      "created_utc": 1750659847.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n1knr4q",
      "author": "Key-March-5228",
      "body": "I just don’t get why she cares, like even if it was a made up thing (which it’s not) how does that affect her quality of life at all?!? the only person it’s effecting is the person living with it?",
      "created_utc": 1751769945.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n2n559n",
      "author": "idk-ijustgot-here",
      "body": "I genuinely wish it was fake. Living with this fucking sucks.",
      "created_utc": 1752277778.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mx24vno",
      "author": "tenth",
      "body": "Does arfid affect oral for some people? I know you were joking but I just got to thinking. ",
      "created_utc": 1749579033.0,
      "score": 32,
      "context": [
        {
          "id": "mx0uqqn",
          "author": "boytoy421",
          "body": "Dude I can't eat a salad, you think I'm putting a whole-ass dick in my mouth?",
          "created_utc": 1749566123.0
        }
      ]
    },
    {
      "id": "mx3xb1a",
      "author": "itslostintranslation",
      "body": "😭",
      "created_utc": 1749598186.0,
      "score": 1,
      "context": [
        {
          "id": "mx0uqqn",
          "author": "boytoy421",
          "body": "Dude I can't eat a salad, you think I'm putting a whole-ass dick in my mouth?",
          "created_utc": 1749566123.0
        }
      ]
    },
    {
      "id": "mx1ejgq",
      "author": "JoshIsASoftie",
      "body": "Also if they're still on X......",
      "created_utc": 1749571742.0,
      "score": 81,
      "context": [
        {
          "id": "mx0q5bq",
          "author": "phejster",
          "body": "Here's a tip: if someone uses \"gay\" to mean \"bad\" or \"gross\", you can freely ignore them because they are a terrible person.",
          "created_utc": 1749564782.0
        }
      ]
    },
    {
      "id": "my5pwqt",
      "author": "Langrisser_John",
      "body": "Here's a tip: people over 40 and under 48 grew up where this is normal language and your tip lame. If they are 35 - 39, they are posers and thus still lame. If they are below 35, then they have no excuse and were raised during times where 'Gay' should've been no longer used in mass media and social situations as a norm. Stop holding expecting everyone to conform to your standards.",
      "created_utc": 1750111215.0,
      "score": 1,
      "context": [
        {
          "id": "mx0q5bq",
          "author": "phejster",
          "body": "Here's a tip: if someone uses \"gay\" to mean \"bad\" or \"gross\", you can freely ignore them because they are a terrible person.",
          "created_utc": 1749564782.0
        }
      ]
    },
    {
      "id": "mx1g6dv",
      "author": "TaraBURGER",
      "body": "Either way like, ew of her.",
      "created_utc": 1749572208.0,
      "score": 25,
      "context": [
        {
          "id": "mx0rjcg",
          "author": "tenth",
          "body": "This is just rage bait. How do you know she's dead serious? Is this account known for it's thoughtful discussion of dietary information? \n\n\n\"Fake & gay\" makes me take this pretty unseriously. It seems like posting it here would only serve to upset others, so I'm not following the logic there either. ",
          "created_utc": 1749565189.0
        }
      ]
    },
    {
      "id": "mx6kv0c",
      "author": "NonStickBakingPaper",
      "body": "Yeah it’s 100% rage bait. Roll your eyes and ignore, it’s not worth your energy",
      "created_utc": 1749641619.0,
      "score": 6,
      "context": [
        {
          "id": "mx0rjcg",
          "author": "tenth",
          "body": "This is just rage bait. How do you know she's dead serious? Is this account known for it's thoughtful discussion of dietary information? \n\n\n\"Fake & gay\" makes me take this pretty unseriously. It seems like posting it here would only serve to upset others, so I'm not following the logic there either. ",
          "created_utc": 1749565189.0
        }
      ]
    },
    {
      "id": "mx0x6hz",
      "author": "xserenity520",
      "body": "its exactly that, power and control. Theres also a lot of people who think because they were forcefed and food punished that everyone else should be as well. They arent able to let it go so they tell themselves that the norm is being forced to consume things that make you ill and then get mad when others dont drink the koolaid",
      "created_utc": 1749566822.0,
      "score": 20,
      "context": [
        {
          "id": "mx0vfdx",
          "author": "beomint",
          "body": "While I agree this is likely ragebait (doesn't change how much it hurts to see ofc, but just a hopeful thought this person doesn't actually go around irl saying shit like this) I really never understood the hate against people with ARFID and the idea that people with ARFID are trying to victimize ourselves or something. It's not an excuse, it's an explanation. I've only ever used it as an explanation and nothing more. I do what I need to do with the doctors I need to do it with to move towards a happier and healthier self. I'm using all of the resources available to live my life as close to normal as everybody else and at the end of the day, what I do or don't eat only affects me, not anybody else. At that point it genuinely just feels like power tripping and control freaking when people have an issue with it because they want to control every aspect of how you live your life.",
          "created_utc": 1749566321.0
        }
      ]
    },
    {
      "id": "mx1fm1u",
      "author": "Ok-Huckleberry-2257",
      "body": "fr that brought me back to 2010😬",
      "created_utc": 1749572047.0,
      "score": 5,
      "context": [
        {
          "id": "mx0sc5z",
          "author": "two-of-me",
          "body": "Oh we’re gay now too? Who uses that word like that after second grade anymore?",
          "created_utc": 1749565422.0
        }
      ]
    },
    {
      "id": "mx2f0y3",
      "author": "Affectionate-Stay-51",
      "body": "THIS. 👀",
      "created_utc": 1749581895.0,
      "score": 2,
      "context": [
        {
          "id": "mx1oyao",
          "author": "Mysterious_Alarm_160",
          "body": "Definitely got a fake disorder yep yep cause in my 23 years of living on this planet i can count the number of times i have actually eaten fruit, only learned to eat vegetables in the past 7 years or so totally a \"CHOICE OF LIFESTYLE\" to not eat nutritious food yall.",
          "created_utc": 1749574681.0
        }
      ]
    },
    {
      "id": "my5qj1k",
      "author": "Langrisser_John",
      "body": "Might be a good one for r/showerthoughts",
      "created_utc": 1750111411.0,
      "score": 0,
      "context": [
        {
          "id": "mxapiz6",
          "author": "lydiar34",
          "body": "Wait is my gayness caused by arfid or vice versa??",
          "created_utc": 1749687645.0
        }
      ]
    },
    {
      "id": "mx2v94w",
      "author": "MyMoreOriginalName",
      "body": "I'm glad you found this community because I know how freeing it is to finally be able to talk about food trouble without being heavily judged. I think you should talk about it, at the very least here where you know you will have people in your corner who understand and can even relate their experience.\n\nAs for others, There's always going to be people who will downplay us. Those people aren't the ones we can reach yet.  I've found it's best to try and educate those who you love and trust first. Those who are around you and willing to listen. The close ones. Because the average joe isn't gonna hear you out especially on the internet where everyone is faceless. But the ones that respect you as a person will, and those are the people who matter.",
      "created_utc": 1749586520.0,
      "score": 2,
      "context": [
        {
          "id": "mx2epc0",
          "author": "Affectionate-Stay-51",
          "body": "Well… my first thought was: after years of my life thinking I am not normal bc no one eats like this and finding out there might be a word describing what’s going on in my life since forever - and realizing I’m not alone with my eating habits - this post is so mean 😂. I mean, I don’t know for sure it’s ARFID, but it might be and for whatever reason this community helped me when I first got onto Reddit to read more about arfid. I now finally realize how others must feel when they get told something like that within other topics. But after seeing the comment section: yes, this might be just someone having rage bait going on, still mean though. \n\nI can laugh about this right now, but on other days I might have felt the same as OP. \n\nMy god, I still feel so weird in public talking about how my body thinks about food intake of certain foods. This just makes me feel like I shouldn’t talk about it and instead just refer to myself as a picky eater instead of educating people in public about possible eating disorders …",
          "created_utc": 1749581805.0
        }
      ]
    },
    {
      "id": "mx3amgf",
      "author": "tucnakpingwin",
      "body": "As a proud gay man unfortunately I’m still having to remind people in 2025 that it’s wrong to use the word “gay” as a pejorative. In my experience even some of the most well intentioned people can be the biggest culprits.",
      "created_utc": 1749590904.0,
      "score": 3,
      "context": [
        {
          "id": "mx2sb3j",
          "author": "MyMoreOriginalName",
          "body": "Who uses gay as a negative connotation in 2025? Seriously I haven't heard my brother say it and he used to be constant about it. Id disregard this immediately, this person is an asshole",
          "created_utc": 1749585701.0
        }
      ]
    },
    {
      "id": "mx2qbnv",
      "author": "littleghool",
      "body": "It absolutely does. People's genitals are disgusting tasting. Like sweat and salt. Even if it's someone overly clean or groomed. It's still an appendage that does not taste good. And do not get me started on baby batter 🤢",
      "created_utc": 1749585138.0,
      "score": 43,
      "context": [
        {
          "id": "mx0uqqn",
          "author": "boytoy421",
          "body": "Dude I can't eat a salad, you think I'm putting a whole-ass dick in my mouth?",
          "created_utc": 1749566123.0
        },
        {
          "id": "mx24vno",
          "author": "tenth",
          "body": "Does arfid affect oral for some people? I know you were joking but I just got to thinking. ",
          "created_utc": 1749579033.0
        }
      ]
    },
    {
      "id": "mx3jhlz",
      "author": "Ginger_Cat_Ventures",
      "body": "Yup, I’m afraid of choking. And I don’t want things shooting into my mouth😂 in my early 20s I had a lot of guys reject me for it.",
      "created_utc": 1749593645.0,
      "score": 8,
      "context": [
        {
          "id": "mx0uqqn",
          "author": "boytoy421",
          "body": "Dude I can't eat a salad, you think I'm putting a whole-ass dick in my mouth?",
          "created_utc": 1749566123.0
        },
        {
          "id": "mx24vno",
          "author": "tenth",
          "body": "Does arfid affect oral for some people? I know you were joking but I just got to thinking. ",
          "created_utc": 1749579033.0
        }
      ]
    },
    {
      "id": "mx84d89",
      "author": "Barbie-Necromancer",
      "body": "Bi with ARFID here, opinions on both sets of oral sex, technical sexual language to follow.\n\n>!I’m lucky where my ARFID doesn’t actually impact my ability to participate in oral sex, but for fellatio, i do not like ejaculate, taste/texture, i have no issues with the penis itself unless there’s a body odor issue (usually solved with a shower. With cunnilingus, idk but everyone’s Ive practiced on has been good, I would qualify as tasty, even. I find both experiences fun, and my ARFID is rarely triggered during the experience, and it’s one of the few times i feel like a normal human. I always figured i could used flavored condoms, if needed, but i never needed that. it helped that no one had any STIs, since these can cause genitals to smell. (also good that i have no STIs, but that was less of a concern because partners would get tested)!<",
      "created_utc": 1749659485.0,
      "score": 8,
      "context": [
        {
          "id": "mx0uqqn",
          "author": "boytoy421",
          "body": "Dude I can't eat a salad, you think I'm putting a whole-ass dick in my mouth?",
          "created_utc": 1749566123.0
        },
        {
          "id": "mx24vno",
          "author": "tenth",
          "body": "Does arfid affect oral for some people? I know you were joking but I just got to thinking. ",
          "created_utc": 1749579033.0
        }
      ]
    },
    {
      "id": "mx2obwy",
      "author": "_littering-and_",
      "body": "I feel like it does for me! Im so grossed out by it",
      "created_utc": 1749584567.0,
      "score": 4,
      "context": [
        {
          "id": "mx0uqqn",
          "author": "boytoy421",
          "body": "Dude I can't eat a salad, you think I'm putting a whole-ass dick in my mouth?",
          "created_utc": 1749566123.0
        },
        {
          "id": "mx24vno",
          "author": "tenth",
          "body": "Does arfid affect oral for some people? I know you were joking but I just got to thinking. ",
          "created_utc": 1749579033.0
        }
      ]
    },
    {
      "id": "mx2soni",
      "author": "MyMoreOriginalName",
      "body": "I think Yes. at least for me, I struggle with everything oral related.",
      "created_utc": 1749585808.0,
      "score": 5,
      "context": [
        {
          "id": "mx0uqqn",
          "author": "boytoy421",
          "body": "Dude I can't eat a salad, you think I'm putting a whole-ass dick in my mouth?",
          "created_utc": 1749566123.0
        },
        {
          "id": "mx24vno",
          "author": "tenth",
          "body": "Does arfid affect oral for some people? I know you were joking but I just got to thinking. ",
          "created_utc": 1749579033.0
        }
      ]
    },
    {
      "id": "mx2b4ya",
      "author": "awkward_chaos21",
      "body": "arfid can be caused due to a fear of choking so i don’t see why it couldn’t",
      "created_utc": 1749580799.0,
      "score": 4,
      "context": [
        {
          "id": "mx0uqqn",
          "author": "boytoy421",
          "body": "Dude I can't eat a salad, you think I'm putting a whole-ass dick in my mouth?",
          "created_utc": 1749566123.0
        },
        {
          "id": "mx24vno",
          "author": "tenth",
          "body": "Does arfid affect oral for some people? I know you were joking but I just got to thinking. ",
          "created_utc": 1749579033.0
        }
      ]
    },
    {
      "id": "n23wx8j",
      "author": "toomanyabstractnouns",
      "body": "Sorry resurrecting an old thread but in my last relationship I started using flavoured condoms for giving head so I could accommodate my sensory issues lmaooo.",
      "created_utc": 1752030048.0,
      "score": 1,
      "context": [
        {
          "id": "mx0uqqn",
          "author": "boytoy421",
          "body": "Dude I can't eat a salad, you think I'm putting a whole-ass dick in my mouth?",
          "created_utc": 1749566123.0
        },
        {
          "id": "mx24vno",
          "author": "tenth",
          "body": "Does arfid affect oral for some people? I know you were joking but I just got to thinking. ",
          "created_utc": 1749579033.0
        }
      ]
    },
    {
      "id": "my5q36m",
      "author": "Langrisser_John",
      "body": "Nice Virtue Signal",
      "created_utc": 1750111271.0,
      "score": -1,
      "context": [
        {
          "id": "mx0q5bq",
          "author": "phejster",
          "body": "Here's a tip: if someone uses \"gay\" to mean \"bad\" or \"gross\", you can freely ignore them because they are a terrible person.",
          "created_utc": 1749564782.0
        },
        {
          "id": "mx1ejgq",
          "author": "JoshIsASoftie",
          "body": "Also if they're still on X......",
          "created_utc": 1749571742.0
        }
      ]
    },
    {
      "id": "my7eob5",
      "author": "Civil_Buffalo_4783",
      "body": "Ah, because they grew up that way, we can't expect them to adjust respectfully for reasons? Bro, these people are adults, and we should just forgive their inability to learn respect because they are from another time where people didn't respect others, right? If that's what you are saying, then my gawd, it must be true that at a certain age you just stop learning, right? We should just accept people for their inability to change for others because they are older than a certain age. After all, by your standards, accountability isn't real, and no one needs to improve, as it's ok to just stay the same.\n\nEdit: Calling things and people gay as an insult was and is always wrong. They know it's wrong and always have. Insults are wrong. Accepting a bully in any way is wrong. Excusing an insult is wrong. Pleading ignorance is wrong. Pretending that just based of time that it made things right is wrong. Justifying the inability to change or respecting others is wrong. YOU ARE WRONG.",
      "created_utc": 1750132120.0,
      "score": 4,
      "context": [
        {
          "id": "mx0q5bq",
          "author": "phejster",
          "body": "Here's a tip: if someone uses \"gay\" to mean \"bad\" or \"gross\", you can freely ignore them because they are a terrible person.",
          "created_utc": 1749564782.0
        },
        {
          "id": "my5pwqt",
          "author": "Langrisser_John",
          "body": "Here's a tip: people over 40 and under 48 grew up where this is normal language and your tip lame. If they are 35 - 39, they are posers and thus still lame. If they are below 35, then they have no excuse and were raised during times where 'Gay' should've been no longer used in mass media and social situations as a norm. Stop holding expecting everyone to conform to your standards.",
          "created_utc": 1750111215.0
        }
      ]
    },
    {
      "id": "mx39rez",
      "author": "tucnakpingwin",
      "body": "I must be an outlier because I quite like the taste of my boyfriend’s genitals - minus the baby batter part, where I’m in full agreement with your assessment! 🤢\n\nIt tastes like bleach, and burns my throat like bleach 😂",
      "created_utc": 1749590645.0,
      "score": 22,
      "context": [
        {
          "id": "mx0uqqn",
          "author": "boytoy421",
          "body": "Dude I can't eat a salad, you think I'm putting a whole-ass dick in my mouth?",
          "created_utc": 1749566123.0
        },
        {
          "id": "mx24vno",
          "author": "tenth",
          "body": "Does arfid affect oral for some people? I know you were joking but I just got to thinking. ",
          "created_utc": 1749579033.0
        },
        {
          "id": "mx2qbnv",
          "author": "littleghool",
          "body": "It absolutely does. People's genitals are disgusting tasting. Like sweat and salt. Even if it's someone overly clean or groomed. It's still an appendage that does not taste good. And do not get me started on baby batter 🤢",
          "created_utc": 1749585138.0
        }
      ]
    },
    {
      "id": "my7et30",
      "author": "Civil_Buffalo_4783",
      "body": "Nice Virtue Signal",
      "created_utc": 1750132175.0,
      "score": 0,
      "context": [
        {
          "id": "mx0q5bq",
          "author": "phejster",
          "body": "Here's a tip: if someone uses \"gay\" to mean \"bad\" or \"gross\", you can freely ignore them because they are a terrible person.",
          "created_utc": 1749564782.0
        },
        {
          "id": "mx1ejgq",
          "author": "JoshIsASoftie",
          "body": "Also if they're still on X......",
          "created_utc": 1749571742.0
        },
        {
          "id": "my5q36m",
          "author": "Langrisser_John",
          "body": "Nice Virtue Signal",
          "created_utc": 1750111271.0
        }
      ]
    },
    {
      "id": "mx5xdyd",
      "author": "PistachiNO",
      "body": "You might be allergic. I once dated a girl who was allergic and she described it like that.",
      "created_utc": 1749628811.0,
      "score": 8,
      "context": [
        {
          "id": "mx0uqqn",
          "author": "boytoy421",
          "body": "Dude I can't eat a salad, you think I'm putting a whole-ass dick in my mouth?",
          "created_utc": 1749566123.0
        },
        {
          "id": "mx24vno",
          "author": "tenth",
          "body": "Does arfid affect oral for some people? I know you were joking but I just got to thinking. ",
          "created_utc": 1749579033.0
        },
        {
          "id": "mx2qbnv",
          "author": "littleghool",
          "body": "It absolutely does. People's genitals are disgusting tasting. Like sweat and salt. Even if it's someone overly clean or groomed. It's still an appendage that does not taste good. And do not get me started on baby batter 🤢",
          "created_utc": 1749585138.0
        },
        {
          "id": "mx39rez",
          "author": "tucnakpingwin",
          "body": "I must be an outlier because I quite like the taste of my boyfriend’s genitals - minus the baby batter part, where I’m in full agreement with your assessment! 🤢\n\nIt tastes like bleach, and burns my throat like bleach 😂",
          "created_utc": 1749590645.0
        }
      ]
    },
    {
      "id": "mx512un",
      "author": "oddistrange",
      "body": "Essence of indoor pool. Bleh.",
      "created_utc": 1749612380.0,
      "score": 6,
      "context": [
        {
          "id": "mx0uqqn",
          "author": "boytoy421",
          "body": "Dude I can't eat a salad, you think I'm putting a whole-ass dick in my mouth?",
          "created_utc": 1749566123.0
        },
        {
          "id": "mx24vno",
          "author": "tenth",
          "body": "Does arfid affect oral for some people? I know you were joking but I just got to thinking. ",
          "created_utc": 1749579033.0
        },
        {
          "id": "mx2qbnv",
          "author": "littleghool",
          "body": "It absolutely does. People's genitals are disgusting tasting. Like sweat and salt. Even if it's someone overly clean or groomed. It's still an appendage that does not taste good. And do not get me started on baby batter 🤢",
          "created_utc": 1749585138.0
        },
        {
          "id": "mx39rez",
          "author": "tucnakpingwin",
          "body": "I must be an outlier because I quite like the taste of my boyfriend’s genitals - minus the baby batter part, where I’m in full agreement with your assessment! 🤢\n\nIt tastes like bleach, and burns my throat like bleach 😂",
          "created_utc": 1749590645.0
        }
      ]
    }
  ]
}