{
  "id": "1lbvd3g",
  "subreddit": "ARFID",
  "author": "TyeDyeMewy",
  "created_utc": 1749975846.0,
  "title": "Pregnancy opened my eyes to what a “normal” appetite was. And now I’m so depressed that my taste is back to normal that I’m going insane.",
  "selftext": "I thought my ARFID (clinically diagnosed by my psychiatrist around 3 years ago) was bad enough. Every guy I dated HATED it. I tried every food they offered me, but near nothing tasted good. They thought I was just being picky, they didn’t understand why I was so afraid of choking/suffocating. I’m diagnosed autistic (back in the 6th grade my therapist diagnosed me) and back then Autistic kids were just normally seen as picky. My parents just fed me what I would eat.\n\nMy husband and I have been through quite a bit with my eating habits. He thought it was pickiness but after therapy and a lot of communication, he’s learned that I hate my tastes more than anyone. Thankfully I don’t care what others think, I’ll order chicken strips anywhere and bite back at anyone who is judgey about it. That was just how it was. Then my husband and I tried for our beautiful daughter.\n\nAs soon as I got pregnant, maybe like 2 weeks in, I could EAT. It didn’t matter if it was salad, or different ranch dressings. I loved all meats, not just the fast food garbage. I could stomach different pastas, even WATER tasted divine. Fancy dinners with my parents I could try new meals and LIKE them. I didn’t have to order a burger or Mac and cheese! I could eat veil picatta or fancy lasagna and complex soups without going home hungry.\n\nI could eat all I wanted, all day every day it felt. Obviously I wasn’t going to drink alcohol, eat fish (which I’ve always hated), and kept my diet clear of the bad things like caffeine that could harm my little one. But all the other foods I could have were AMAZING. I felt like such a glutton but it was AWESOME. I didn’t have to have the same meal all the time. New things I tried ACTUALLY had a chance of me liking them. Coffee tasted sweeter. I never went to bed hungry. My thirst was always quenched. IT WAS HEAVEN.\n\nNow, three weeks having my healthy, beautiful baby girl… I’m back to hating nearly everything I put in my mouth.\n\nI’m so fucking destroyed. I’m so depressed. I was so happy to taste normally. To love everything on my plate. To lick the plate clean after nearly every meal. To relish to taste of ANY soda, not just Dr. Pepper.\n\nIt’s 2am. I’m sitting up crying, wondering how to get it back. I want it back, that appetite. But I obviously can’t just stay pregnant forever. And there were HORRIBLE things that came with my pregnancy that I can’t just jump back into. \n\nI’m mourning the ability to taste. The ability to eat and feel full. The ability to like what I eat. The ability to ignore textures.\n\nEating brought me so much fucking joy and now that I know what I can’t have, I’m ready to rip my hair out.\n\nTomorrow I meet with my therapist. I’ve met with a dietician before, too to try and fix the ARFID. But they’ve done NOTHING like pregnancy has for my tastes.\n\nHOW CAN I GET THAT LOVE FOR FOOD BACK?",
  "url": "https://www.reddit.com/r/ARFID/comments/1lbvd3g/pregnancy_opened_my_eyes_to_what_a_normal/",
  "score": 124,
  "num_comments": 31,
  "comments": [
    {
      "id": "mxyaxr4",
      "author": "bloodreina_",
      "body": "I wonder if birth control or synthetic estrogen etc could help your AFRID?",
      "created_utc": 1750013361.0,
      "score": 47,
      "context": []
    },
    {
      "id": "mxw6vc0",
      "author": "General-Candy5326",
      "body": "Hey — thank you for sharing all of this. It’s so clear how deeply food, taste, and joy were tied together for you during pregnancy, and I just want to say how valid your grief is. What you’re describing isn’t just “missing a craving” — it’s mourning the experience of finally being able to eat freely, enjoyably, and without fear, after a lifetime of ARFID. That’s a huge emotional loss, and it makes sense that it’s hitting so hard.\n\nThe shift that happened during pregnancy — where taste, texture, and even fear loosened their grip — isn’t uncommon, and it’s something we hear about from other people with ARFID or sensory issues. Hormonal changes during pregnancy can alter sensory processing, appetite regulation, and even how the brain interprets reward from food. That version of you who was finally able to explore and enjoy meals — she’s still there. Your body and brain just aren’t in the same state right now, and that’s not your fault.\n\nIt’s amazing that you’ve already done so much work with therapy, and it’s good that you’re seeing someone again soon. It’s also completely okay that you’re still hurting — ARFID is complex, especially when it intersects with neurodivergence and postnatal changes. There isn’t one switch that fixes it. But the fact that your brain did allow you to enjoy food at one point is also meaningful — it means your relationship with food isn’t broken, just in hiding.\n\nIf it ever feels helpful to talk to someone who really gets the nutrition and the emotional side of things, I help run a team of registered dietitians and clinical psychologists who specialise in women’s health, sensory-based eating, and postnatal recovery. We offer free initial consultations — no pressure at all, just a space to talk if you ever want help figuring out what’s next.\n\nYou’re not broken. What you experienced was real, and there are ways to gently move toward that joy again — even if it looks different now. You’re doing the best you can in a hard moment. Be kind to yourself.",
      "created_utc": 1749987420.0,
      "score": 39,
      "context": []
    },
    {
      "id": "mxy0kjt",
      "author": "paintnclouds",
      "body": "Wow that's wildly fascinating. Do you feel like this implies your ARFID is hormonal in some way? Were there other things that were different during your pregnancy that could contribute to explaining this difference in your felt experience (did you take off work? was your stress lower? was your partner more helpful and supportive?)? \n\nIn my self-work to try to slowly alchemize my ARFID feelings into something else, I've mostly approached it as a nervous system problem. Thinking like, if I'm in chronic fight/flight I'm not in rest/digest, perhaps thats why I keep perceiving new foods as threatening and hard to accept. So I've focused on trying to down shift my nervous system, increase my felt sense of safety, and slowly try new things with as much support as possible and no sense of forcing or having to. And I'm very slowly stretching and expanding what's okay. \n\nBut if I had your experience I think I'd be thinking my ARFID was hormonal somehow. That something about having a different balance of hormones made things suddenly able to just actually taste better. I think I'd think maybe there's something off about my normal hormone levels, maybe if I supplemented some hormone levels (not necessarily to pregnancy levels, but seeing if there is some minimum effective dose between here and there) maybe I could feel that way again. I think I'd probably try a functional medicine doctor and I'd walk in and explain my experience and say help me see if we can figure out what it was about pregnancy that made this possible and if we can recreate it outside of pregnancy. \n\nSorry if that got rambly, but yeah that's wildly fascinating and if I were in your shoes I'd also be feeling a little crazy and desperate to figure out wtf made that possible and if it could happen again. 🫂 That sounds like such a magical time. And I bet it is possible to bring that experience into your non-pregnant life, you just have some experimenting to do to find what exactly it is that made that possible 💗",
      "created_utc": 1750010159.0,
      "score": 12,
      "context": []
    },
    {
      "id": "my2fe0d",
      "author": "myhotelpanic",
      "body": "I dealt with something similar but not quite the same. I just found I had so much more appetite when I was pregnant and after 1st trimester none of my “iffy” textures made me gag.",
      "created_utc": 1750075712.0,
      "score": 6,
      "context": []
    },
    {
      "id": "my0xsh8",
      "author": "BillyYumYumTwo-byTwo",
      "body": "Hi!! I’m so sorry you’re dealing with this. It sucks. I’m not trying to compare our situations at all, but when I’m sick, the same thing happens to me. I don’t know why, I’ve been hospitalized for not eating so it’s not my brain jumps to survival mode and stop “being picky”.\n\nYou mentioned therapist and dietician, and those are both great! But, neither are medical doctors. Your pregnancy was a medical event that caused a change in your ARFID! So make you meet with someone who understands hormones and the physical effects pregnancy. Someone who can prescribe something. Your gyno might be a good place to start!",
      "created_utc": 1750046898.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mym7h5o",
      "author": "Civil-Law529",
      "body": "I’m also currently pregnant and already sad that my big appetite and desire for food will be gone. I have a wide palette for someone with ARFID but frequently go through regressions where I narrows what I eat down to only 2-3 foods and it’s an awful time. Plus I don’t often enjoy foods. But pregnancy has been awesome because I LOVE food, even things I couldn’t usually stomach. Even eggs!! I’ll miss this. ",
      "created_utc": 1750334016.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mxzs7q1",
      "author": "Original_Cable6719",
      "body": "I’m so sorry you’re grieving. I totally get it. I have always been very emotional about food, but didn’t develop ARFID until later in life. I miss being able to eat anything I want.",
      "created_utc": 1750030786.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mxzvf83",
      "author": "TashaT50",
      "body": "I feel for you. To have the experience of being able to eat anything and then back to full restrictions is my worst nightmare. \n\nMy experience isn’t as extreme. After being in a bad accident years ago I’ve been able to eat more foods including a number that were gag foods just thinking about. Something in my brain changed. Not to the extreme where everything taste amazing but I can eat them and over time I get more and more enjoyment doing so. But during times of crisis or high stress my restrictions come back.\n\nI hope this will be encouraging for you. I’ve found when the high stress/crisis lessens it takes very little for my to add the newer safe foods back in. Like simply only having frozen omelette makings for the rest of the family which normally I can’t eat but just before my most recent stress time I was able to eat it so I gave it a try the other day and I could eat half my normal portion. Sometimes I don’t even notice I’ve done it. I know that sounds weird like how can you not notice? So I like my eggs a particular way and any bits that aren’t cooked perfect I slide onto my partner’s plate. As the situation gets less stressful I just eat what’s on my plate and only notice when my partner passes his plate to me and I don’t have anything to put on it. \n\nYou’ve just had a baby and your hormones are all over the place. You’re stress levels are through the roof. It’s possible in 18 months when things settle down you’ll find it easier to add a number of the new foods you enjoyed back in. It may take a bit of effort - I’ve sometimes had to do it a few bites at a time over weeks or longer and work my way up to a full portions but I hold in my mind what it tasted like and how I felt eating it before the current crisis and it does come back. But during the stressful time not being able to enjoy those new foods adds to my stress and if I were in your situation I’d be completely destroyed too.",
      "created_utc": 1750031931.0,
      "score": 2,
      "context": []
    },
    {
      "id": "my579rz",
      "author": "GeneRizotto",
      "body": "I actually had a similar experience with pregnancy. I was able to extend my palette to stuff I never thought I would eat, like olives, and tolerate spices and herbs (a bit). And although I’m back to not tolerating strong tastes and smells, at least I don’t have a meltdown if accidentally exposed (for now, heh). OP, maybe try some of the stuff you liked while pregnant, when you’re in a good mood? Maybe you were lucky to gain some new safe foods too.",
      "created_utc": 1750105742.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mybca24",
      "author": "Responsible-Hat-4186",
      "body": "Have you ever tried any medications for appetite? What came to my mind for you is mirtazapine it’s an appetite stimulant. If this could give you back your enjoyment for food that would make me so happy for you! I’m currently in the hospital unable to eat or drink or tolerate peg tube feeds so I’m on iv nutrition pending a j tube. Ive had a mostly bad relationship with food for 10 years due to nausea and abdominal pain but now that I can’t eat or drink at all I find myself missing it and wishing I could.. especially if there was a healed version of me without the negative effects to eating. I see everyone else loving to eat and drink and I want to experience that too. I hope you can get that back ❤️❤️ good luck!",
      "created_utc": 1750187072.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mybdptc",
      "author": "finalnoms",
      "body": "This is what it felt like for me on hormonal birth control! It was AMAZING. I was eating 3 healthy meals a day every day! Unfortunately I got a blood clot and had to go off, but that’s a very rare side effect and I was just unlucky. Maybe bc could help ",
      "created_utc": 1750187480.0,
      "score": 2,
      "context": []
    },
    {
      "id": "myija60",
      "author": "Specific-Deer7287",
      "body": "I am thinking yr experience  is because of high estrogen during pregnancy and during breastfeeding its very low that's the reason a lot of women get depression after birth.  You can try a diet which helps yr body to make more hormones through food and supplements. I haven't tried BC I got HRT. I am very sensitive to low estrogen. I don't have appetite when my estrogen is low and I am very depressive",
      "created_utc": 1750278939.0,
      "score": 2,
      "context": []
    },
    {
      "id": "myn9nwg",
      "author": "sunflowey123",
      "body": "I always wondered about this, as a woman who wants to get pregnant some day. Idk if I actually have ARFID or not, but losing that pickiness or aversion to certain foods was kind of a fear for me if I ever got pregnant. Lol\n\nI know for a fact if that adventurous love of all food ever goes away for me, so many people would be let down by that, including my own family. They'd be like, \"What do you mean you hate vegetables again?! You liked them when you were pregnant!\" It's sad how so many people can willingly not understand others.",
      "created_utc": 1750346616.0,
      "score": 2,
      "context": []
    },
    {
      "id": "myndacs",
      "author": "sunflowey123",
      "body": "Also, this makes me want there to be more scientific studies done about how pregnancy and hormones affect ARFID in women and AFABs. I don't know how a study like that would be done though, I guess have people who have ARFID and plan to become pregnant volunteer to be a part of the study, and survey them on how their eating was affected before and after the pregnancy. A study like this for picky eaters (both neurodivergent and neurotypical) should be done as well, maybe the study could include them too.\n\n\nSeperate studies could also be done about specifically just hormonal affects with ARFID and picky eating for women and AFABs, like for women or AFABs on birth control for example.\n\n\nI do wonder, on the topic of hormones changing ARFID eating habits, I wonder if any trans people with ARFID have had changes to their eating habits after taking HRT. Like have any trans women had their eating habits changed after going on estrogen, or have any trans men had their eating habits changed after taking testosterone? Have any non-binary people that are on either had any changes to their eating habits?\n\n(Also, for those who don't know what AFAB means, [here](https://www.dictionary.com/browse/afab) is a definition for it.)",
      "created_utc": 1750347660.0,
      "score": 2,
      "context": []
    },
    {
      "id": "n1kqhqd",
      "author": "Key-March-5228",
      "body": "I think when you’re pregnant certain hormones are elevated, and a lot of times those same hormones are used for gender affirming care, and with people who have hormone deficiencies. it might be something to look into? I’m still a minor so I’m not fully educated on what happens when pregnant, but I would suggest going to a hormone specialist or a doctor that perscribes those types of medications!",
      "created_utc": 1751771123.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mxzrs5e",
      "author": "TashaT50",
      "body": "I was wondering if hormones might help. For me the best thing to help my ARFID was being in a very severe accident although the change wasn’t nearly this drastic.",
      "created_utc": 1750030632.0,
      "score": 20,
      "context": [
        {
          "id": "mxyaxr4",
          "author": "bloodreina_",
          "body": "I wonder if birth control or synthetic estrogen etc could help your AFRID?",
          "created_utc": 1750013361.0
        }
      ]
    },
    {
      "id": "mym7lml",
      "author": "Civil-Law529",
      "body": "Idk about everyone but pregnancy made my ARFID better but hormonal birth control made it wayyyy worse! I ate tater tots from sonic every day for lunch 😅 ",
      "created_utc": 1750334069.0,
      "score": 2,
      "context": [
        {
          "id": "mxyaxr4",
          "author": "bloodreina_",
          "body": "I wonder if birth control or synthetic estrogen etc could help your AFRID?",
          "created_utc": 1750013361.0
        }
      ]
    },
    {
      "id": "myn9x7z",
      "author": "sunflowey123",
      "body": "I'm on birth control pills (Turquoz is the brand), and have been since around 2023 I think, and they're to help regulate my period, and I haven't noticed any changes. I still eat the same things I did before.",
      "created_utc": 1750346691.0,
      "score": 2,
      "context": [
        {
          "id": "mxyaxr4",
          "author": "bloodreina_",
          "body": "I wonder if birth control or synthetic estrogen etc could help your AFRID?",
          "created_utc": 1750013361.0
        }
      ]
    },
    {
      "id": "myyy76d",
      "author": "TyeDyeMewy",
      "body": "I haven’t gone back on birth control since having my baby and the appetite is still gone :( I think just my baby made me love food more cuz she is a little glutton herself lol",
      "created_utc": 1750505459.0,
      "score": 1,
      "context": [
        {
          "id": "mxyaxr4",
          "author": "bloodreina_",
          "body": "I wonder if birth control or synthetic estrogen etc could help your AFRID?",
          "created_utc": 1750013361.0
        }
      ]
    },
    {
      "id": "myyyc4d",
      "author": "TyeDyeMewy",
      "body": "I appreciate this. Where can I go to follow up with you on some of the ARFID stuff?",
      "created_utc": 1750505527.0,
      "score": 3,
      "context": [
        {
          "id": "mxw6vc0",
          "author": "General-Candy5326",
          "body": "Hey — thank you for sharing all of this. It’s so clear how deeply food, taste, and joy were tied together for you during pregnancy, and I just want to say how valid your grief is. What you’re describing isn’t just “missing a craving” — it’s mourning the experience of finally being able to eat freely, enjoyably, and without fear, after a lifetime of ARFID. That’s a huge emotional loss, and it makes sense that it’s hitting so hard.\n\nThe shift that happened during pregnancy — where taste, texture, and even fear loosened their grip — isn’t uncommon, and it’s something we hear about from other people with ARFID or sensory issues. Hormonal changes during pregnancy can alter sensory processing, appetite regulation, and even how the brain interprets reward from food. That version of you who was finally able to explore and enjoy meals — she’s still there. Your body and brain just aren’t in the same state right now, and that’s not your fault.\n\nIt’s amazing that you’ve already done so much work with therapy, and it’s good that you’re seeing someone again soon. It’s also completely okay that you’re still hurting — ARFID is complex, especially when it intersects with neurodivergence and postnatal changes. There isn’t one switch that fixes it. But the fact that your brain did allow you to enjoy food at one point is also meaningful — it means your relationship with food isn’t broken, just in hiding.\n\nIf it ever feels helpful to talk to someone who really gets the nutrition and the emotional side of things, I help run a team of registered dietitians and clinical psychologists who specialise in women’s health, sensory-based eating, and postnatal recovery. We offer free initial consultations — no pressure at all, just a space to talk if you ever want help figuring out what’s next.\n\nYou’re not broken. What you experienced was real, and there are ways to gently move toward that joy again — even if it looks different now. You’re doing the best you can in a hard moment. Be kind to yourself.",
          "created_utc": 1749987420.0
        }
      ]
    },
    {
      "id": "mxzrcvb",
      "author": "DrG2390",
      "body": "I can say my tastes drastically changed like OP’s did, not with pregnancy so much, but once I really got my supplement and exercise routine dialed in I also suddenly started craving fruit and vegetables and complex dishes like they describe. I’m also suddenly repelled by the fast food and super sugary ultra processed foods I was eating before which has been holding steady for three years now and isn’t going away. I’m just one person of course, but I really really think there’s something to their theory.",
      "created_utc": 1750030482.0,
      "score": 7,
      "context": [
        {
          "id": "mxy0kjt",
          "author": "paintnclouds",
          "body": "Wow that's wildly fascinating. Do you feel like this implies your ARFID is hormonal in some way? Were there other things that were different during your pregnancy that could contribute to explaining this difference in your felt experience (did you take off work? was your stress lower? was your partner more helpful and supportive?)? \n\nIn my self-work to try to slowly alchemize my ARFID feelings into something else, I've mostly approached it as a nervous system problem. Thinking like, if I'm in chronic fight/flight I'm not in rest/digest, perhaps thats why I keep perceiving new foods as threatening and hard to accept. So I've focused on trying to down shift my nervous system, increase my felt sense of safety, and slowly try new things with as much support as possible and no sense of forcing or having to. And I'm very slowly stretching and expanding what's okay. \n\nBut if I had your experience I think I'd be thinking my ARFID was hormonal somehow. That something about having a different balance of hormones made things suddenly able to just actually taste better. I think I'd think maybe there's something off about my normal hormone levels, maybe if I supplemented some hormone levels (not necessarily to pregnancy levels, but seeing if there is some minimum effective dose between here and there) maybe I could feel that way again. I think I'd probably try a functional medicine doctor and I'd walk in and explain my experience and say help me see if we can figure out what it was about pregnancy that made this possible and if we can recreate it outside of pregnancy. \n\nSorry if that got rambly, but yeah that's wildly fascinating and if I were in your shoes I'd also be feeling a little crazy and desperate to figure out wtf made that possible and if it could happen again. 🫂 That sounds like such a magical time. And I bet it is possible to bring that experience into your non-pregnant life, you just have some experimenting to do to find what exactly it is that made that possible 💗",
          "created_utc": 1750010159.0
        }
      ]
    },
    {
      "id": "myyy1xg",
      "author": "TyeDyeMewy",
      "body": "I still worked during my pregnancy, and after it when I had time off, that love for all foods was gone when I had my baby.\n\nI do have an extremely stressful job as an addiction counselor for high schoolers, but I’ve never thought about it interfering with my appetite, moreso just making me so busy at work I don’t eat.\n\nYeah, I’m speaking with a RD and my therapist and psych about it all. Idk what they’ll say",
      "created_utc": 1750505387.0,
      "score": 1,
      "context": [
        {
          "id": "mxy0kjt",
          "author": "paintnclouds",
          "body": "Wow that's wildly fascinating. Do you feel like this implies your ARFID is hormonal in some way? Were there other things that were different during your pregnancy that could contribute to explaining this difference in your felt experience (did you take off work? was your stress lower? was your partner more helpful and supportive?)? \n\nIn my self-work to try to slowly alchemize my ARFID feelings into something else, I've mostly approached it as a nervous system problem. Thinking like, if I'm in chronic fight/flight I'm not in rest/digest, perhaps thats why I keep perceiving new foods as threatening and hard to accept. So I've focused on trying to down shift my nervous system, increase my felt sense of safety, and slowly try new things with as much support as possible and no sense of forcing or having to. And I'm very slowly stretching and expanding what's okay. \n\nBut if I had your experience I think I'd be thinking my ARFID was hormonal somehow. That something about having a different balance of hormones made things suddenly able to just actually taste better. I think I'd think maybe there's something off about my normal hormone levels, maybe if I supplemented some hormone levels (not necessarily to pregnancy levels, but seeing if there is some minimum effective dose between here and there) maybe I could feel that way again. I think I'd probably try a functional medicine doctor and I'd walk in and explain my experience and say help me see if we can figure out what it was about pregnancy that made this possible and if we can recreate it outside of pregnancy. \n\nSorry if that got rambly, but yeah that's wildly fascinating and if I were in your shoes I'd also be feeling a little crazy and desperate to figure out wtf made that possible and if it could happen again. 🫂 That sounds like such a magical time. And I bet it is possible to bring that experience into your non-pregnant life, you just have some experimenting to do to find what exactly it is that made that possible 💗",
          "created_utc": 1750010159.0
        }
      ]
    },
    {
      "id": "myyyfza",
      "author": "TyeDyeMewy",
      "body": "I only threw up once during my pregnancy because I got carsick. And the worst part of it all was the NONSTOP ITCHING",
      "created_utc": 1750505579.0,
      "score": 1,
      "context": [
        {
          "id": "my2fe0d",
          "author": "myhotelpanic",
          "body": "I dealt with something similar but not quite the same. I just found I had so much more appetite when I was pregnant and after 1st trimester none of my “iffy” textures made me gag.",
          "created_utc": 1750075712.0
        }
      ]
    },
    {
      "id": "myyyt5j",
      "author": "TyeDyeMewy",
      "body": "I took full advantage of it and ate so much garbage. But I was so underweight before that my family loved it!",
      "created_utc": 1750505755.0,
      "score": 1,
      "context": [
        {
          "id": "mym7h5o",
          "author": "Civil-Law529",
          "body": "I’m also currently pregnant and already sad that my big appetite and desire for food will be gone. I have a wide palette for someone with ARFID but frequently go through regressions where I narrows what I eat down to only 2-3 foods and it’s an awful time. Plus I don’t often enjoy foods. But pregnancy has been awesome because I LOVE food, even things I couldn’t usually stomach. Even eggs!! I’ll miss this. ",
          "created_utc": 1750334016.0
        }
      ]
    },
    {
      "id": "myyypue",
      "author": "TyeDyeMewy",
      "body": "There’s medications for appetite? I had no idea! Thank you :) I’m sorry to hear where you’re at. I don’t know if doctors would be willing to give me an appetite med without medical concerns like stomach problems or vomiting. It’s just me not standing the taste/texture :(",
      "created_utc": 1750505711.0,
      "score": 1,
      "context": [
        {
          "id": "mybca24",
          "author": "Responsible-Hat-4186",
          "body": "Have you ever tried any medications for appetite? What came to my mind for you is mirtazapine it’s an appetite stimulant. If this could give you back your enjoyment for food that would make me so happy for you! I’m currently in the hospital unable to eat or drink or tolerate peg tube feeds so I’m on iv nutrition pending a j tube. Ive had a mostly bad relationship with food for 10 years due to nausea and abdominal pain but now that I can’t eat or drink at all I find myself missing it and wishing I could.. especially if there was a healed version of me without the negative effects to eating. I see everyone else loving to eat and drink and I want to experience that too. I hope you can get that back ❤️❤️ good luck!",
          "created_utc": 1750187072.0
        }
      ]
    },
    {
      "id": "myyzayb",
      "author": "TyeDyeMewy",
      "body": "Yeah I was underweight going into my pregnancy so all my OBGYN docs would ask how I’m eating. One visit I had gained so much weight that their system said “not possible!” When they tried manually entering my weight. A doctor had to sign off to overwrite it. Apparently the program saw my weight from a month before and said I had gained way too much. But the nurses put me on three different scales and confirmed I was the weight they were trying to enter.\n\nI felt tubby. But then they told me I was just catching up on what I lacked in weight before pregnancy and that baby is happy and healthy ❤️ I continued to eat junk food and all that, I’ve never liked fish or alcohol so it all was good!\n\nI had to be induced at 38 weeks tho for possibility of choleostasis",
      "created_utc": 1750505996.0,
      "score": 2,
      "context": [
        {
          "id": "myn9nwg",
          "author": "sunflowey123",
          "body": "I always wondered about this, as a woman who wants to get pregnant some day. Idk if I actually have ARFID or not, but losing that pickiness or aversion to certain foods was kind of a fear for me if I ever got pregnant. Lol\n\nI know for a fact if that adventurous love of all food ever goes away for me, so many people would be let down by that, including my own family. They'd be like, \"What do you mean you hate vegetables again?! You liked them when you were pregnant!\" It's sad how so many people can willingly not understand others.",
          "created_utc": 1750346616.0
        }
      ]
    },
    {
      "id": "mzaxd8c",
      "author": "General-Candy5326",
      "body": "You are welcome to pm me, hopefully I can point you to the right direction",
      "created_utc": 1750672791.0,
      "score": 1,
      "context": [
        {
          "id": "mxw6vc0",
          "author": "General-Candy5326",
          "body": "Hey — thank you for sharing all of this. It’s so clear how deeply food, taste, and joy were tied together for you during pregnancy, and I just want to say how valid your grief is. What you’re describing isn’t just “missing a craving” — it’s mourning the experience of finally being able to eat freely, enjoyably, and without fear, after a lifetime of ARFID. That’s a huge emotional loss, and it makes sense that it’s hitting so hard.\n\nThe shift that happened during pregnancy — where taste, texture, and even fear loosened their grip — isn’t uncommon, and it’s something we hear about from other people with ARFID or sensory issues. Hormonal changes during pregnancy can alter sensory processing, appetite regulation, and even how the brain interprets reward from food. That version of you who was finally able to explore and enjoy meals — she’s still there. Your body and brain just aren’t in the same state right now, and that’s not your fault.\n\nIt’s amazing that you’ve already done so much work with therapy, and it’s good that you’re seeing someone again soon. It’s also completely okay that you’re still hurting — ARFID is complex, especially when it intersects with neurodivergence and postnatal changes. There isn’t one switch that fixes it. But the fact that your brain did allow you to enjoy food at one point is also meaningful — it means your relationship with food isn’t broken, just in hiding.\n\nIf it ever feels helpful to talk to someone who really gets the nutrition and the emotional side of things, I help run a team of registered dietitians and clinical psychologists who specialise in women’s health, sensory-based eating, and postnatal recovery. We offer free initial consultations — no pressure at all, just a space to talk if you ever want help figuring out what’s next.\n\nYou’re not broken. What you experienced was real, and there are ways to gently move toward that joy again — even if it looks different now. You’re doing the best you can in a hard moment. Be kind to yourself.",
          "created_utc": 1749987420.0
        },
        {
          "id": "myyyc4d",
          "author": "TyeDyeMewy",
          "body": "I appreciate this. Where can I go to follow up with you on some of the ARFID stuff?",
          "created_utc": 1750505527.0
        }
      ]
    },
    {
      "id": "mxzrve8",
      "author": "paintnclouds",
      "body": "That's so interesting. Can you say more about how you figured out which supplements and kinds of exercise your body was needing?",
      "created_utc": 1750030664.0,
      "score": 4,
      "context": [
        {
          "id": "mxy0kjt",
          "author": "paintnclouds",
          "body": "Wow that's wildly fascinating. Do you feel like this implies your ARFID is hormonal in some way? Were there other things that were different during your pregnancy that could contribute to explaining this difference in your felt experience (did you take off work? was your stress lower? was your partner more helpful and supportive?)? \n\nIn my self-work to try to slowly alchemize my ARFID feelings into something else, I've mostly approached it as a nervous system problem. Thinking like, if I'm in chronic fight/flight I'm not in rest/digest, perhaps thats why I keep perceiving new foods as threatening and hard to accept. So I've focused on trying to down shift my nervous system, increase my felt sense of safety, and slowly try new things with as much support as possible and no sense of forcing or having to. And I'm very slowly stretching and expanding what's okay. \n\nBut if I had your experience I think I'd be thinking my ARFID was hormonal somehow. That something about having a different balance of hormones made things suddenly able to just actually taste better. I think I'd think maybe there's something off about my normal hormone levels, maybe if I supplemented some hormone levels (not necessarily to pregnancy levels, but seeing if there is some minimum effective dose between here and there) maybe I could feel that way again. I think I'd probably try a functional medicine doctor and I'd walk in and explain my experience and say help me see if we can figure out what it was about pregnancy that made this possible and if we can recreate it outside of pregnancy. \n\nSorry if that got rambly, but yeah that's wildly fascinating and if I were in your shoes I'd also be feeling a little crazy and desperate to figure out wtf made that possible and if it could happen again. 🫂 That sounds like such a magical time. And I bet it is possible to bring that experience into your non-pregnant life, you just have some experimenting to do to find what exactly it is that made that possible 💗",
          "created_utc": 1750010159.0
        },
        {
          "id": "mxzrcvb",
          "author": "DrG2390",
          "body": "I can say my tastes drastically changed like OP’s did, not with pregnancy so much, but once I really got my supplement and exercise routine dialed in I also suddenly started craving fruit and vegetables and complex dishes like they describe. I’m also suddenly repelled by the fast food and super sugary ultra processed foods I was eating before which has been holding steady for three years now and isn’t going away. I’m just one person of course, but I really really think there’s something to their theory.",
          "created_utc": 1750030482.0
        }
      ]
    },
    {
      "id": "mz0apqp",
      "author": "myhotelpanic",
      "body": "Oh my gosh my belly was so itchy lol",
      "created_utc": 1750523149.0,
      "score": 1,
      "context": [
        {
          "id": "my2fe0d",
          "author": "myhotelpanic",
          "body": "I dealt with something similar but not quite the same. I just found I had so much more appetite when I was pregnant and after 1st trimester none of my “iffy” textures made me gag.",
          "created_utc": 1750075712.0
        },
        {
          "id": "myyyfza",
          "author": "TyeDyeMewy",
          "body": "I only threw up once during my pregnancy because I got carsick. And the worst part of it all was the NONSTOP ITCHING",
          "created_utc": 1750505579.0
        }
      ]
    },
    {
      "id": "myz4n9q",
      "author": "Responsible-Hat-4186",
      "body": "It’s worth asking!! ☺️ the worst they can say is no!",
      "created_utc": 1750508423.0,
      "score": 1,
      "context": [
        {
          "id": "mybca24",
          "author": "Responsible-Hat-4186",
          "body": "Have you ever tried any medications for appetite? What came to my mind for you is mirtazapine it’s an appetite stimulant. If this could give you back your enjoyment for food that would make me so happy for you! I’m currently in the hospital unable to eat or drink or tolerate peg tube feeds so I’m on iv nutrition pending a j tube. Ive had a mostly bad relationship with food for 10 years due to nausea and abdominal pain but now that I can’t eat or drink at all I find myself missing it and wishing I could.. especially if there was a healed version of me without the negative effects to eating. I see everyone else loving to eat and drink and I want to experience that too. I hope you can get that back ❤️❤️ good luck!",
          "created_utc": 1750187072.0
        },
        {
          "id": "myyypue",
          "author": "TyeDyeMewy",
          "body": "There’s medications for appetite? I had no idea! Thank you :) I’m sorry to hear where you’re at. I don’t know if doctors would be willing to give me an appetite med without medical concerns like stomach problems or vomiting. It’s just me not standing the taste/texture :(",
          "created_utc": 1750505711.0
        }
      ]
    },
    {
      "id": "mz0at72",
      "author": "myhotelpanic",
      "body": "I used a ton of Aveeno after each shower and it helped soooo much.",
      "created_utc": 1750523180.0,
      "score": 1,
      "context": [
        {
          "id": "my2fe0d",
          "author": "myhotelpanic",
          "body": "I dealt with something similar but not quite the same. I just found I had so much more appetite when I was pregnant and after 1st trimester none of my “iffy” textures made me gag.",
          "created_utc": 1750075712.0
        },
        {
          "id": "myyyfza",
          "author": "TyeDyeMewy",
          "body": "I only threw up once during my pregnancy because I got carsick. And the worst part of it all was the NONSTOP ITCHING",
          "created_utc": 1750505579.0
        },
        {
          "id": "mz0apqp",
          "author": "myhotelpanic",
          "body": "Oh my gosh my belly was so itchy lol",
          "created_utc": 1750523149.0
        }
      ]
    }
  ]
}