{
  "id": "1lmwdc1",
  "subreddit": "ARFID",
  "author": "HuckleberryTop5278",
  "created_utc": 1751142049.0,
  "title": "Any ARFID adults in here?",
  "selftext": "I’m currently a teen suffering from ARFID, and I\\`m not sure it’ll ever end. I have a couple of questions to ask you guys so that I can consider my future.\n\nWhat do you do during important dinners? I often lose my appetite when being around foods I find disgusting, and I don’t know what I’m going to do in the future.\n\nDue to the Scandinavian school system, I am going to have a subject involving actual cooking, and I have a lot of difficulties touching food. Any advice?\n\nHow do you not die?\n\n(Sorry if my English feels broken)",
  "url": "https://www.reddit.com/r/ARFID/comments/1lmwdc1/any_arfid_adults_in_here/",
  "score": 117,
  "num_comments": 66,
  "comments": [
    {
      "id": "n0az7uy",
      "author": "desperation2000",
      "body": "i’m an adult and it honestly just came with exposure to different foods. it helps having a partner that’s vegetarian, bc he has helped me to branch out a little bit. familial support helps immensely. i also will cook foods i haven’t tried before and just sit with them in front of me sometimes (and then i usually have my partner eat them haha) but it’s helped me to actually sit in the same room as food\nanother thing that’s helped me is generally just telling myself that even if i touch something that’s a bad texture, i can simply wash my hands and it’s like i didn’t touch it. i also have a therapist i can talk to about it that’s helped me with coping strategies. i also worked at a starbucks for awhile and that helped me to realize that if im not eating something, it shouldn’t affect me (there are still times things are too much and i have bad days but overall im able to be at important dinners even near things that aren’t something i could eat!) i also would recommend talking to people about arfid and educating them, a lot of professors can be really understanding. good luck!",
      "created_utc": 1751144986.0,
      "score": 36,
      "context": []
    },
    {
      "id": "n0ayk8s",
      "author": "ZWiloh",
      "body": "I am an adult and I don't have a lot of experience with \"important\" dinners, but when nothing appeals to me when with company, I usually say I'm getting a migraine and feel too nauseous to eat. Everyone who knows me knows I have terrible headaches and chronic pain so I don't really get questioned about it. If people insist I eat something, I'll usually request buttered toast or rolls if they're available. It's easy on the stomach when I really am sick and it is usually super easy for someone to throw together for me so I do get some calories in and they don't feel like a neglectful host.",
      "created_utc": 1751144768.0,
      "score": 40,
      "context": []
    },
    {
      "id": "n0ayl0w",
      "author": "crown-jewel",
      "body": "Regarding the important dinners piece, often there’s some sort of chicken option available, which is typically relatively safe for me (depending on if there’s sauce), so I usually get that. I’ve also gotten to the point where I can tolerate some common sides (ie broccoli and carrots, plain mashed potatoes), so will eat those as well. \n\nIf it’s a restaurant situation, I look at the menu ahead of time, try to find pics, etc and then eat what I can slowly and then sort of just try to make it seem like I’ve eaten more than I have if I wasn’t able to make a decent dent in the meal. \n\nAt a formal meal (for a fundraiser/auction) that had set menus, i just try my best. I did once also swap soup with a friend who was beside me when she was halfway through her bowl so it looked like I ate least had some of it 😅\n\nThat being said, as I’ve gotten older, I’ve also gotten a little better at trying things and/or forcing myself to eat something I don’t like. I find it’s a little easier in situations like work dinners, because most people don’t know how picky I am going in, and it therefore feels like there’s less pressure. \n\nAlso, I find people tend not to pay too much attention to what you eat. They may ask if you’re sure, but usually a polite “no thank you” and they’ve already moved on and forgotten about it.",
      "created_utc": 1751144775.0,
      "score": 13,
      "context": []
    },
    {
      "id": "n0azbr6",
      "author": "_FirstOfHerName_",
      "body": "I'm in what I consider to be recovery at age 32. It involved a tonne of exposure, avoidance just prolonged the issue I had with food.\n\nI started cooking with foods I wasn't comfortable with no pressure to eat it, and that helped enormously. It gave me a sense of new things I could cook with safe foods, in new combinations.\n\nOne I'd eaten new combinations of safe foods I added new ingredients that were unsafe, from my time cooking. \n\nI would not avoid the cooking lessons, like others have suggested. Avoidance is a breeding ground for worsening anxiety. I would just not pressure yourself to eat the food you cook.\n\nMy journey was a long one and didn't just involve exposure, but a drive to make myself be healthy, and even an LSD trip. Who knows what actually helped the most... But now I can go on work dinners, order off menus without adaptions, and I very rarely get anxious about food.",
      "created_utc": 1751145022.0,
      "score": 9,
      "context": []
    },
    {
      "id": "n0aspqq",
      "author": "AttentionHelpful3996",
      "body": "Would you be able to get a note from your doctor to opt you out of certain days that include the foods you can’t handle touching? \n\nI try really hard to not look at the food that grosses me out but that’s certainly hard in a lot of cases so I would probably just make up an excuse and leave. I’ve had it for a very long time but just recently diagnosed and I feel like it’s getting worse. Although I haven’t done specific therapy for the ARFID yet, just trying to find foods that I can eat so unfortunately I’m not much help there.",
      "created_utc": 1751142864.0,
      "score": 6,
      "context": []
    },
    {
      "id": "n0b0bru",
      "author": "carbonatedcobalt",
      "body": "i'm an adult and while i don't really go to many important dinners, saying you have dietary restrictions is a good out if there's absolutely nothing there you can stomach. or \"no thank you, i plan to eat what i have at home\"/\"i have leftovers waiting for me\"/\"my S/O is cooking and i want to be able to eat that\" \n\nif there's some things there you could eat, do so - most people won't call you out on that and if they do, it's pretty rude",
      "created_utc": 1751145356.0,
      "score": 4,
      "context": []
    },
    {
      "id": "n0be2ji",
      "author": "twatwater",
      "body": "I’m an adult and have gone to many important dinners. Some things that help: relaxing and drinking wine gives me a little confidence to try a single bite of something new on rare occasions; eating before hand so I’m not starving so if all there is for me to eat is a roll, I’m gonna survive; being honest about it with my friends so they already know my deal. Honestly though no one has ever said anything about what I’m eating or how much I’m eating ever since I became an adult.",
      "created_utc": 1751150146.0,
      "score": 3,
      "context": []
    },
    {
      "id": "n0bgad6",
      "author": "esor_rose",
      "body": "I'm 25 years old with ARFID. I also live in America, so I don't know what your schooling is like with cooking. I usually eat beforehand for important events or try to find some stuff I do like. I would talk to your school about cooking. If you have received an official diagnosis, I would talk with your school. I'm sure people who have allergies get exempt from cooking some stuff (if there are things with allergies that people cook with, I'm unfamiliar with your education system).",
      "created_utc": 1751150958.0,
      "score": 3,
      "context": []
    },
    {
      "id": "n4fpq0d",
      "author": "vvreath",
      "body": "for me, I have safe foods that I know im usually okay with ( beef, breaf, potatos. ). when i'm eating, I usually focus on those, and try to sit away from any foods that I dislike. After eating as much as I can, I usually clean up and excuse myself to a different area of the gathering where it isn't as bad.\n\n\nas for cooking, post covid has helped IMMENSELY. wearing masks helps so much with smells, just say you're afraid of germs or contaminating food or smth if you don't want to be honest w your classmates and teacher, and wear disposable gloves. you might have to bring in your own, but I doubt any cooking class will really say no, especially because gloves and now masks are often a part of food safety anyway.",
      "created_utc": 1753142164.0,
      "score": 2,
      "context": []
    },
    {
      "id": "n0bfftj",
      "author": "blaiiiiir",
      "body": "28 and i’ve dealt with it my whole life. sorry I don’t have any advice, I only have a handful of safe foods I can actually eat",
      "created_utc": 1751150647.0,
      "score": 4,
      "context": []
    },
    {
      "id": "n0bc0ty",
      "author": "HuckleberryTop5278",
      "body": "I’m glad for the advice around the whole dinner thing, but I desperately need advice around what to do next school year when I’m graded around my cooking. I’ve previously had the subject in sixth grade and I don’t see it working out very well in a high school environment. We were divided into groups and I felt like a burden",
      "created_utc": 1751149403.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n0be5uf",
      "author": "LeakyFountainPen",
      "body": "Sometimes during important dinners, I eat beforehand, then order something like a water or a side dish that I can eat, then if anyone asks, just claim my stomach hasn't been feeling so good. If I'm not sure if the food will be something I can eat or not, I'll shove a granola bar or two in my purse and eat it in the car or the bathroom or something.\n\nAs for the cooking class, I've actually found that learning to cook was one of the best things for my ARFID. I've been able to slowly add more meals to my safe foods when I'm in control of the food. So I wish you luck in that class.",
      "created_utc": 1751150180.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n0bi4yb",
      "author": "EliotTheGreat20",
      "body": "Recently I took a cooking class and sinks were near by so that was nice but also they had gloves so I could wear gloves when I was touching things like raw meat which.. was still very unpleasant but it helped 😭",
      "created_utc": 1751151630.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n0bih57",
      "author": "PresentHat6725",
      "body": "Yes, went from anorexia to afrid. Both are stressful.",
      "created_utc": 1751151752.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n0bjr5m",
      "author": "TashaT50",
      "body": "I’m in my late 50s. I’ve survived, my safe food list has expanded over the years, it hasn’t seriously impacted my ability to socialize, eat out, or attend events in years. It can get better. I consider myself fairly recovered during good times but during crisis and times of great stress various of my food restrictions reappear but not as severe as they were. \n\nMy mom started me on cooking with her at 3 - somewhat age appropriate as I grew up. This helped in many ways.\n* I got over much of my gag reflex from touching or being around unsafe/gross foods. I wash my hands a lot when cooking and go through many paper towels so I can throw them away as soon as I’ve used them. \n* It increased my ability to eat around most foods I found gross, not all, fish/seafood still had a “cannot eat anything for up to 6 hours if I smell it at eating times”. \n* Having control over cooking and learning to modify recipes expanded my safe foods. More so when I got older than as a minor living at home but even as a kid. I’d sometimes be distracted and lick my fingers which led to finding recipes I wanted to modify because what we were making was interesting but not to my taste.  Learned doubling and tripling seasonings I liked could increase the chances I’d eat something which made a huge difference in the number of chicken, pasta, beef, and pork dishes I can eat - instead of having a single dish or brand I could eat 10-20 dishes by my teen years\n* My knowledge of recipes made it easier to order off menu in restaurants as I knew what ingredients they had on hand based on the menu and I knew what quick easy dishes they could make with those ingredients \n\nImportant dinners: Check menu beforehand to see if there is anything you can eat. If not eat beforehand hand. If possible have bread, something to drink, if you eat salad or some of the salad vegetables eat those (ask for no dressing). At events I’ve always said the smell of food is making me nauseous and kicking off a headache due to one of my various chronic illnesses but otherwise I’m fine and no I don’t have something anyone needs to worry is catching.\n\nYou may find cooking in school helps with your ARFID but see about wearing gloves and a mask (keep in mind these may help with ARFID but cause social issues), maybe getting an anti-anxiety med just for that class, sitting down with your parents and the teacher to explain ARFID, your particular issues, and why you may need to walk out of class sometimes. You may want to start trying this at home to see what works for you (gloves, mask) and what doesn’t. It’s not going to be easy but it likely will help you in the long run. You can start out at home just sitting in the room close to foods/ingredients you expect will be part of the class. \n\nHow do we not die? Thankfully we live in a modern world and for many of us we have access to our safe foods, meal replacement drinks and bars, and feeding tubes if things get really bad. That said it’s important to take supplements, expand our safe food list, get regular checkups and blood test, as lack of good nutrition can cause a number health issues some which may not show up until later in life.",
      "created_utc": 1751152217.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n0bpfmw",
      "author": "Speed_Plastic",
      "body": "I'm 37, I actually found learning to cook really help me. It grew from knowing how to prepare my safe foods and my parents teaching me the more complicated recipes I liked. \nHonestly cooking shows are so fun to watch and maybe a little thrilling, people just eating whatever! What kind of life that would be! \n\nWhen you get to the cooking class ask if you can were gloves! Gloves are soooooo nice when touching new foods. \n\nImportant dinners. I assume you mean like family means, holidays and parties maybe eating out. \nHonestly try and get a feel for the food ahead of time, of you know what to expect you can mentally prepare. \nI still will maybe eat a heavier/later lunch so maybe I won't be as hungry for a dinner I know won't have much safe food for me to eat.\n I keep shelf stable high calorie/protein/vitamin things in my car/worlbag/purse for times when I need food and nothing is available \nI find my arfid is much better controlled when I'm eating steadily, and more balanced. \n\nI take supplements based on blood work I got to monitor my levels. Im still trying to find a dietitian to work with but US healthcare system \n\nIt gets better, I posted some food I made in a group chat and someone asked if I'd be their in home cook just the other day. \n\nYou got this. I really hope your cooking class maybe helps you take hold of your own food.",
      "created_utc": 1751154256.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n0bpv8k",
      "author": "Riokaii",
      "body": "Im 30 years old, I've had ARFID for as long as I can remember, I think my parents recognized i was beyond regular picky somewhere between age 2 and 5. \n\nI eat my own thing before/after the dinner, and often nothing at an important dinner. I avoided cooking and other food related classes and activities. I make my own meals via frozen stuff i put in the oven and whatnot.",
      "created_utc": 1751154412.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n0br24y",
      "author": "APleasantMartini",
      "body": "Yeah, no, it doesn’t stop. It gets more annoying as time goes on, and you just have to survive it.",
      "created_utc": 1751154848.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n0br7zs",
      "author": "purplechunkymonkey",
      "body": "I'm the mom of an ARFID teen. But I can't touch raw meat without gagging. Gloves are my solution.",
      "created_utc": 1751154909.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n0c630f",
      "author": "Bri_bug",
      "body": "Gloves have helped me immensely with touching food and “eating beforehand” has helped me at important events. I don’t have to explain myself either either as well",
      "created_utc": 1751160592.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n0c7hha",
      "author": "Clean_Structure_1500",
      "body": "I’m 24, not sure if I count! I got medical help in my teens, taken to the ER and put into a program to help my eating disorder. I recommend this however, thats a daunting thing and I only know about how America works and I dont know what options u have in Scandinavia.\nRegardless, I have some tips from my times struggling as a teen and as an adult.\n\nWhat to remember: eat what you can, something is better than nothing (even if its sweets/ “bad”), its ok if u cant finish the whole meal. U did good.\n\n1. Dopamine/relaxation. Watching my favorite youtubers/movies/anything that is comforting like reading while I eat has gotten me thru my formative years and even now when my symptoms return. Focusing on something really relaxing, getting my comfort foods, then tiny bite by tiny bite. (My personal favorite is Bluey haha)\n\n2. Sometimes a change in environment can help. Maximizing feeling safe and comfortable will make it more likely my appetite will return. I cant speak for you, but my ARFID is mainly stress/anxiety based. I am most relaxed in the afternoon, and sitting outside watching the birds and rabbits makes me feel better. Otherwise I eat in my room.\n\n3. Start with an appetizer. Usually a small sip from some sort of drink that isnt water (because of sugar) will actually stabilize your blood sugar and your appetite should return in around 10-15 minutes, specifically if you’re too nauseous to eat because you’re so hungry! Trick I learned in the hospital. Then, just have something small (I like sweets, so fruit gummies) like one or two tiny pieces, and see how your appetite is. 9/10, you’re just /really/ hungry and it’s ruining your appetite (ironic, I hate it here!)\n\n4. A whiff of isopropyl alcohol or anti nausea pills usually return my appetite. My anxiety makes my stomach clench and makes me feel sick, so I dont know if this applies to you.\n\n5. Meal plan, if planning the meal is your struggle. Even if i can only eat snacks I try to get a little bit if everything (protein, fruit, veggie etc). Would putting your favorite snacks and cutting them into small portions help? Place them in a lunch bag or something discreet if that helps.",
      "created_utc": 1751161156.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n0chh3s",
      "author": "lindser31",
      "body": "Hi! I am 33. I usually just eat bread at important dinners. If I am feeling self-conscious, I have my husband put some of his food on my plate discreetly so it looks like I am going to eat it. If I know I’m not going to eat, I will snack beforehand or just eat a meal after. I also will just say I ate a late *insert previous meal here.* At this point in life, everyone who knows me knows the food situation so if it’s them I just do what I need to do. I WILL order the kids menu option at a wedding 😂. \n\nMy only advice on touching the food is gloves, which you will likely already have!",
      "created_utc": 1751165195.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n0cqxpo",
      "author": "lime-green-casefiles",
      "body": "im an arfid 19 y/o so young adult ig. likely will have to wear gloves for the cooking subject which may help. i typically ignore looking at other folks' food if i think it will be gross.",
      "created_utc": 1751169286.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n0cz9xq",
      "author": "IndependenceOld8708",
      "body": "I'll be 40 next month. Growing up I just used to tell people I was a vegetarian because the only meat I can handle is boneless, skinless chicken breast and bacon lol. It was easier to eat a salad or a side rather than explain I couldn't handle the texture of meat. I also have celiacs disease, but I didn't know that back then. Now I can use my fear of gluten contamination as an excuse. \n\n\nMy friends and family know I have ARFID. My family knew I wouldn't eat things like ground meat even as a young child (before ARFID was an official diagnosis), and luckily never tried to force me. My friends don't try to force me to eat, but they will offer food and double check with me to make sure there's food i will eat if we're having a dinner party. \n\n\nARFID almost killed me in my 20s. Now at almost 40 I've learned that for me what works is supplements and safe food. My fridge basically has hummus and carrots, cheese, salad, and microwave cheesy potatoes in it. I also have white rice and eggs, which is my go to comfort food. I try to grab fruit when I shop, strawberries, apples, tangerines, etc. I know i won't eat them daily, but i want to make sure I get some fruit in my diet. Today it was a few grapes. 2 days ago it was some strawberries with whipped cream. If I'm having a bad day I try to at least have a nutrition shake. I don't do anything fancy, usually just a chocolate slim fast shake. ",
      "created_utc": 1751173185.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n0d9j8i",
      "author": "Mister_Rabbit",
      "body": "45 here, strong ARFID symptoms since pre-school, formal diagnosis close to 10 years ago. You’ll adapt quickly and develop a gentle way of dealing with social situations.\n\nFor me I will typically stick to ‘oh I just have an upset stomach’ or ‘I’m so sorry, I lost track of time and ate right before this meal’ and stick to bland foods. If I’m truly forced to take a plate of food then I will push things around at the same cadence of other people so that it looks like I ate some of it. 90 percent of the time I’m not shy about sharing the ARFID thing if someone asks, otherwise I don’t make a big deal of it. There are a handful of foods that smell so awful to me that I have to really focus on not letting it show, sometimes with those I’ll find a reason to step outside or excuse myself.\n\nIf you’re like me and the social awkwardness ramps up your anxiety then having something to fidget with helps, same with focusing on the feel or temperature of something nearby. Sometimes I’ll discreetly grab an ice cube and focus on the cold and feeling of it melting, usually lasts long enough that whatever the gross food was has either been consumed or the smell has dissipated.\n\nNot sure what the Scandinavian mental health system looks like but in the US I was able to find an eating disorder therapy practice that had excellent experience with ARFID. My diet doesn’t look drastically different following the year of treatment but I did pick up a lot of coping methods for trying new foods and a lot of validation.",
      "created_utc": 1751178579.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n0daan7",
      "author": "vonoddly",
      "body": "I’m an adult with ARFID. When I had to take cooking classes in school, I explained my situation to the instructors and they were actually pretty understanding about it. They allowed me to wear disposable gloves while cooking and rubber gloves when washing dishes. \n\nThe last day of the class would involve cooking a meal with a group and inviting a teacher to eat with us. We were required to eat the food, and my group was not willing to work with in my safe foods which I understood. I’ve gotten pretty good and moving food around on a plate to make it seem like I’ve taken a few bites. No one pushed the issue forward. \n\nMy advice is that it is okay to let people know if you need reasonable accommodations. Sometimes you can just say that you’re not feeling well or that you already ate and people will accept that.",
      "created_utc": 1751179011.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n0dj8oz",
      "author": "keepslippingaway",
      "body": "Late 20s. I'm a vegetarian so that gets me out of most standard meals. If people ask why I'm not eating, I say I feel sick or already ate before.",
      "created_utc": 1751184272.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n0drs6b",
      "author": "_Blue_Raspberries_",
      "body": "I have ARFID, but I'm not often in situations where I'm unable to find *anything* I can eat... At least, not due to ARFID. I am allergic to peanuts and tree nuts, and recently developed diabetes as well, so finding myself in these situations more now. \n\nPrevious to the diabetes, I would ask the restaurant staff to adjust a dish on the menu to better fit what I can eat. Like, if it's something I almost like, but has nuts, I'll ask to have nuts not included because of allergies. \n\nWith diabetes it's a lot harder and I just avoid functions with food involved... No one really considers diabetics when planning food.\n\n(My ARFID comes out more about food contamination fear and texture issues, though I am certainly picky as well, but most foods I won't touch aren't super common ones I come across in restaurants, except for like raw fish lol)",
      "created_utc": 1751189547.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n0dyne4",
      "author": "jaysxiu",
      "body": "Yes. I’m 28",
      "created_utc": 1751193661.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n0e99mz",
      "author": "hfbluebleu",
      "body": "When I know where I will be eating, I check the menu beforehand. It's truly okay if you even have to message them or call them up to ask about their dishes and their servings. \n\nIf I'm going in blind, I go for any dish that has some sort of fried chicken, steak, or fries. (If any of those have any sauce I can't eat, I do make sure to request the server if they can exclude it from the meal I chose.)\n\nWorst case scenario, and they don't have anything I can eat and I have to pretend to eat to not be rude. I order whatever that doesn't sound too bad and sounds like a small serving. Once I receive it, I cut it in pieces slowly and move them around while talking and laughing. And often taking a sip of my drink of choice. Then I make sure to go eat or order something yummy afterward 🩵",
      "created_utc": 1751199052.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n0ed21d",
      "author": "Ok_Theme_6480",
      "body": "I’m adult with Arfid & tbh the best way I’ve found to navigate it socially is to be honest- a lot of people just don’t know that this is a thing and most will be very kind about it if you give them the chance to. \n\nIf possible, start packing safe snacks in your purse/bag/whatever and try and find a nutrition/meal replacement drink that feels safe as well. Eat what you can and if you can’t, try your best to get the meal replacement drink down. That’s the best way I’ve survived up to this point. \n\n“Important” dinners (ie. At restaurants, parties, weddings, etc.) are still extremely difficult for me, but after letting my support system know what was going on helped. My partner is able to see that I’m uncomfortable and give me a way out, and when I eat with my family I am usually allowed to eat when I’m ready. This fully depends on your support system though, unfortunately. If you don’t feel like you have the social means necessary, it may be worth looking to seeing a nutritionist. \nSee your doctor often, get nutritional panels as often as you can. Take multivitamins and supplements as needed. \n\nIt does get easier, I doubt I’ll ever be fully “cured” but I’m a lot better than I was as a teen. Good luck!",
      "created_utc": 1751200707.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n0elplz",
      "author": "2cat007",
      "body": "Hello, I’m an adult with ARFID. For important dinners, I try to find anything I like there and eat that. If I don’t know if there will be food I like, I eat a head of time and just nibble on something and use the excuse I ate earlier. \n\n  \nFor your second question, sorry but I’m not sure what to do because I had that issue with meat, but I had to make myself push through it. I still gag when I have to touch meat. I hope you find a solution. \n\n  \nNow for your final question, I have no idea how I’m still alive. I didn’t eat much as a kid.",
      "created_utc": 1751204075.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n0f4d7c",
      "author": "Nooshy1978",
      "body": "I'm an adult (46) and usually just say I have already eaten even if I haven't.\nI can cook, up to a point mostly just assist my partner though cause no touching raw meat and chopping is difficult. So I open cans, or stir, or grab utensils or take things in and out of the oven.\nGood luck to you☘️",
      "created_utc": 1751210323.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n0fqrs7",
      "author": "Starbalance",
      "body": "I'm 26, only just learned what ARFID was last year. Every since I was a little kid, eating foods I didn't like made me vomit. I thought I was just a really picky eater but I went to the doctor for the first time in over a decade last year, and I told her about this problem I have with food. She told me about ARFID and said while she can't diagnose me as she's not licensed to, I check off pretty much every criteria. \n\n  \nShe explained it to me and for the first time in my life, I felt seen, understood, about my complicated relationship with food. I try to explain it to people but they still just call me a picky eater, so they either don't understand or don't WANT to. But I know what I know, and I know others are like me.",
      "created_utc": 1751217391.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n0fxlc5",
      "author": "DysfunctionalTree",
      "body": "I’m an adult and I just work around it: eat before public dinners and then pick at what I can; pack snacks to make sure I’m not hungry and push food around my plate like I’m eating; carve out safe times in my day to eat safe foods. It’s annoying, but it doesn’t severely impact my life any more.",
      "created_utc": 1751219483.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n0hsxwx",
      "author": "JustbyLlama",
      "body": "I’m an adult. Definitely agree with comments about looking at the menu ahead. My partner and I have both have different levels of ARFID and we Always look at menus ahead of time. You can also choose to remove something from a dish by saying you have an allergy to it.\n\nAs far as touching food, I’m not sure. That’s not one of my issues. But maybe if you have trouble with touching it you can wear gloves, if its smells, they sell nose plugs.",
      "created_utc": 1751241785.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n0i76ix",
      "author": "stillabadkid",
      "body": "I'm an adult with ARFID, and mine has gotten easier to manage with time and therapy. Goin vegan helped me a lot, too, but that isn't for everyone.",
      "created_utc": 1751247131.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n0ibrqc",
      "author": "Nananonomous",
      "body": "So for me I'm only 23 so I haven't even to many important dinners but the few I have been (like prom and doing certain programs where we have a fancier dinner at the end) I usually just don't eat the food or try and pick at what is the plainest thing to have like if it's chicken but lime idk lemon. I'll usually pick around it maybe chop it up and try and eat just the inside but if I don't like it ill leave it and eat when I'm home and tell ppl I'm just not feeling well st that point. Honestly tho I try and avoid it where I can",
      "created_utc": 1751248870.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n0k55tk",
      "author": "neurowarrier",
      "body": "Hello 👋 I’m 26 years old and I’ve suffered from Arfid almost all of my life, with waves of it being particularly worse at times than others, depending on what else has been going on in my life at certain stages. \n\nI have found looking at the menu of the place we will be attending in advance to be very helpful for calming any anxiety surrounding important dinners etc - if there is something on the menu you would eat if it did not contain X, Y or Z just politely ask the restaurant if they could please make it for you this way. Similarly if you see items on the menu you could make a meal out of such as asking for plain pasta instead of a pasta and sauce dish, or asking for the fries that come on the side with another dish and some bread - you will find hospitality staff can be very accommodating if you ask kindly. \n\nAs for the food prep… If you’d find it easier touching the food with gloves on I’ve found it to act as a little barrier and it is beneficial to the sensory overwhelming experience I can get from touching certain textures of food. \n\nIf you’re struggling with your intake, try to keep your body full of nutrients by taking multivitamins, drinking protein shakes, milkshakes, or having yogurt drinks / soup. - obviously I’m not familiar with your safe foods but where physically eating is a struggle you should try to get any liquid your body allows you to which is still somewhat healthy for you. \n\nAll the best! Any questions just ask! \n\nPs. Don’t be afraid to seek medical help / contact any helplines available in your area. 😊",
      "created_utc": 1751282560.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n136t4c",
      "author": "Paypaljesus",
      "body": "nitrile gloves, multivitamins, dissociative parts that do the cooking and living in complete isolation so nobody can give me shit for my eating habits ( grew up with a hypochondriac mom that compounded my issues 9 billion times). \n\nThat and living in poverty means my food issues are somewhat handled by the very limited availability of stuff I can afford, so lot of plain noodles and milk basically. \n\nIt’s hell. I pray the other comments can help you and you never have to end up in an adult life like mine ",
      "created_utc": 1751527666.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n1krsxz",
      "author": "Key-March-5228",
      "body": "I’m not an adult, but during important dinners, I used to eat beforehand, or pack a safe meal to eat. I did this during holiday meals etc.",
      "created_utc": 1751771694.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n42fa65",
      "author": "Happy_Resolve2103",
      "body": "I am 25 with ARFID and was diagnosed when I was 5, I never knew what it was, my gran used to say it all the time so I would go and tell ppl at school because I thought it was something cool. I think we should educate this in schools and talk with minors about this because it’s a horrible ordeal, I made a lot of ppl cry over the years which I’m not proud of and hope people make a steady recovery. Thank you",
      "created_utc": 1752962518.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n4dkftu",
      "author": "Homrabsexual",
      "body": "Hello, an adult with ARFID here. I don’t really have advice for the dinner thing since I’ve never been to an important dinner yet. However, for your class would it be possible to contact the school for disability aid or something like that? In the states we have Individualized Education Plans, which are personalized plans for students with disabilities or mental health issues (including eating disorders). For example, students with ADHD are allowed extra time on exams and such. Maybe in your case they could either excuse the class or modify it to make it less painful. If that doesn’t work then I’d suggest to start some exposure therapy. I’ve found it helpful to control as many of the 5 senses as possible during it. For example, I wear thick gloves (touch), a face mask with menthol rub (smell), and headphones (sound) when I’m forced to touch stuff I find repulsive. It gives me back some control during these situations which stops me from panicking. Maybe you can do something similar?",
      "created_utc": 1753119128.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n0b5wug",
      "author": "TashaT50",
      "body": "Excellent advice. My mom had me cooking as a very young child, starting at 3, we still cook and laugh together now, I’m in my late 50s. It definitely helped me be around food I can’t eat and cut back on my gag reflex on many of my problem foods although on bad days I still occasionally revert back and some foods like fish/seafood were problematic to be around until my late 40s.",
      "created_utc": 1751147255.0,
      "score": 11,
      "context": [
        {
          "id": "n0az7uy",
          "author": "desperation2000",
          "body": "i’m an adult and it honestly just came with exposure to different foods. it helps having a partner that’s vegetarian, bc he has helped me to branch out a little bit. familial support helps immensely. i also will cook foods i haven’t tried before and just sit with them in front of me sometimes (and then i usually have my partner eat them haha) but it’s helped me to actually sit in the same room as food\nanother thing that’s helped me is generally just telling myself that even if i touch something that’s a bad texture, i can simply wash my hands and it’s like i didn’t touch it. i also have a therapist i can talk to about it that’s helped me with coping strategies. i also worked at a starbucks for awhile and that helped me to realize that if im not eating something, it shouldn’t affect me (there are still times things are too much and i have bad days but overall im able to be at important dinners even near things that aren’t something i could eat!) i also would recommend talking to people about arfid and educating them, a lot of professors can be really understanding. good luck!",
          "created_utc": 1751144986.0
        }
      ]
    },
    {
      "id": "n0bmmmo",
      "author": "Spoonie_Scully",
      "body": "This is what I do as well. I am often nauseous anyway from my illnesses so I usually say I’m just not doing well that day. I also try to get as much water in me as possible so I’m not lacking in both food and water.",
      "created_utc": 1751153251.0,
      "score": 8,
      "context": [
        {
          "id": "n0ayk8s",
          "author": "ZWiloh",
          "body": "I am an adult and I don't have a lot of experience with \"important\" dinners, but when nothing appeals to me when with company, I usually say I'm getting a migraine and feel too nauseous to eat. Everyone who knows me knows I have terrible headaches and chronic pain so I don't really get questioned about it. If people insist I eat something, I'll usually request buttered toast or rolls if they're available. It's easy on the stomach when I really am sick and it is usually super easy for someone to throw together for me so I do get some calories in and they don't feel like a neglectful host.",
          "created_utc": 1751144768.0
        }
      ]
    },
    {
      "id": "n0d4arw",
      "author": "General_Writer_1664",
      "body": "How do u cope with eating with your colleagues? Does they know your situation?",
      "created_utc": 1751175718.0,
      "score": 1,
      "context": [
        {
          "id": "n0ayk8s",
          "author": "ZWiloh",
          "body": "I am an adult and I don't have a lot of experience with \"important\" dinners, but when nothing appeals to me when with company, I usually say I'm getting a migraine and feel too nauseous to eat. Everyone who knows me knows I have terrible headaches and chronic pain so I don't really get questioned about it. If people insist I eat something, I'll usually request buttered toast or rolls if they're available. It's easy on the stomach when I really am sick and it is usually super easy for someone to throw together for me so I do get some calories in and they don't feel like a neglectful host.",
          "created_utc": 1751144768.0
        }
      ]
    },
    {
      "id": "n0bb1ar",
      "author": "HuckleberryTop5278",
      "body": "I don’t how I would do that as I would have to opt out every day we have that subject lol",
      "created_utc": 1751149047.0,
      "score": 1,
      "context": [
        {
          "id": "n0aspqq",
          "author": "AttentionHelpful3996",
          "body": "Would you be able to get a note from your doctor to opt you out of certain days that include the foods you can’t handle touching? \n\nI try really hard to not look at the food that grosses me out but that’s certainly hard in a lot of cases so I would probably just make up an excuse and leave. I’ve had it for a very long time but just recently diagnosed and I feel like it’s getting worse. Although I haven’t done specific therapy for the ARFID yet, just trying to find foods that I can eat so unfortunately I’m not much help there.",
          "created_utc": 1751142864.0
        }
      ]
    },
    {
      "id": "n0c3ojr",
      "author": "R0da",
      "body": "This is the hack. \"I have a ton of food sensitivities\" gets me out of so much potential whinging from those I might be sharing a table with.",
      "created_utc": 1751159646.0,
      "score": 3,
      "context": [
        {
          "id": "n0b0bru",
          "author": "carbonatedcobalt",
          "body": "i'm an adult and while i don't really go to many important dinners, saying you have dietary restrictions is a good out if there's absolutely nothing there you can stomach. or \"no thank you, i plan to eat what i have at home\"/\"i have leftovers waiting for me\"/\"my S/O is cooking and i want to be able to eat that\" \n\nif there's some things there you could eat, do so - most people won't call you out on that and if they do, it's pretty rude",
          "created_utc": 1751145356.0
        }
      ]
    },
    {
      "id": "n0be1k7",
      "author": "desperation2000",
      "body": "my best recommendation is just to do your best with what\nyou have. don’t let arfid be the limiter. you could possibly ask a teacher to allow you to be in your own group by yourself if it would help your dynamic with other people (and not seeing yourself as a burden, which either way you’re not ! you’re working with something many people have never experienced and it’s not fair to put yourself on the same footing as other people)",
      "created_utc": 1751150137.0,
      "score": 2,
      "context": [
        {
          "id": "n0bc0ty",
          "author": "HuckleberryTop5278",
          "body": "I’m glad for the advice around the whole dinner thing, but I desperately need advice around what to do next school year when I’m graded around my cooking. I’ve previously had the subject in sixth grade and I don’t see it working out very well in a high school environment. We were divided into groups and I felt like a burden",
          "created_utc": 1751149403.0
        }
      ]
    },
    {
      "id": "n0bt2wq",
      "author": "WTFIsAMeta",
      "body": "I was in the same boat and also had a cooking class (where they wanted me to try everything, I simply just didn't, is what it is). But, think about why touching food is difficult. Know that there is a sink with soap and water to wash your hands at any given point. Think about how much worse there is in life that you have touched, whether it be cleaning up animal feces, vomit, dirt, etc. I'm sure there are a lot worse than just simple old food that most people eat! And just remember you can wash your hands after don't let that be the limiting factor! \n\nBut full honestly, I know it sounds stressful now, but I promise you are overthinking it & you shouldn't! I know it sounds easier said than done but you'll be done with the class in no-time and you will be asking yourself what you were even worried about!",
      "created_utc": 1751155595.0,
      "score": 1,
      "context": [
        {
          "id": "n0bc0ty",
          "author": "HuckleberryTop5278",
          "body": "I’m glad for the advice around the whole dinner thing, but I desperately need advice around what to do next school year when I’m graded around my cooking. I’ve previously had the subject in sixth grade and I don’t see it working out very well in a high school environment. We were divided into groups and I felt like a burden",
          "created_utc": 1751149403.0
        }
      ]
    },
    {
      "id": "n0bq3zl",
      "author": "Speed_Plastic",
      "body": "Just read some more responses, do you maybe the ability this summer to take a cooking class. Or possibly get together with supportive daily to practice cooking?",
      "created_utc": 1751154502.0,
      "score": 1,
      "context": [
        {
          "id": "n0bpfmw",
          "author": "Speed_Plastic",
          "body": "I'm 37, I actually found learning to cook really help me. It grew from knowing how to prepare my safe foods and my parents teaching me the more complicated recipes I liked. \nHonestly cooking shows are so fun to watch and maybe a little thrilling, people just eating whatever! What kind of life that would be! \n\nWhen you get to the cooking class ask if you can were gloves! Gloves are soooooo nice when touching new foods. \n\nImportant dinners. I assume you mean like family means, holidays and parties maybe eating out. \nHonestly try and get a feel for the food ahead of time, of you know what to expect you can mentally prepare. \nI still will maybe eat a heavier/later lunch so maybe I won't be as hungry for a dinner I know won't have much safe food for me to eat.\n I keep shelf stable high calorie/protein/vitamin things in my car/worlbag/purse for times when I need food and nothing is available \nI find my arfid is much better controlled when I'm eating steadily, and more balanced. \n\nI take supplements based on blood work I got to monitor my levels. Im still trying to find a dietitian to work with but US healthcare system \n\nIt gets better, I posted some food I made in a group chat and someone asked if I'd be their in home cook just the other day. \n\nYou got this. I really hope your cooking class maybe helps you take hold of your own food.",
          "created_utc": 1751154256.0
        }
      ]
    },
    {
      "id": "n0d4so3",
      "author": "General_Writer_1664",
      "body": "Hi, how do u cope with eating with your colleagues?",
      "created_utc": 1751175979.0,
      "score": 1,
      "context": [
        {
          "id": "n0cz9xq",
          "author": "IndependenceOld8708",
          "body": "I'll be 40 next month. Growing up I just used to tell people I was a vegetarian because the only meat I can handle is boneless, skinless chicken breast and bacon lol. It was easier to eat a salad or a side rather than explain I couldn't handle the texture of meat. I also have celiacs disease, but I didn't know that back then. Now I can use my fear of gluten contamination as an excuse. \n\n\nMy friends and family know I have ARFID. My family knew I wouldn't eat things like ground meat even as a young child (before ARFID was an official diagnosis), and luckily never tried to force me. My friends don't try to force me to eat, but they will offer food and double check with me to make sure there's food i will eat if we're having a dinner party. \n\n\nARFID almost killed me in my 20s. Now at almost 40 I've learned that for me what works is supplements and safe food. My fridge basically has hummus and carrots, cheese, salad, and microwave cheesy potatoes in it. I also have white rice and eggs, which is my go to comfort food. I try to grab fruit when I shop, strawberries, apples, tangerines, etc. I know i won't eat them daily, but i want to make sure I get some fruit in my diet. Today it was a few grapes. 2 days ago it was some strawberries with whipped cream. If I'm having a bad day I try to at least have a nutrition shake. I don't do anything fancy, usually just a chocolate slim fast shake. ",
          "created_utc": 1751173185.0
        }
      ]
    },
    {
      "id": "n19psff",
      "author": "Bubbly-Mix-9093",
      "body": "Do you mind sharing the coping methods that helped you?",
      "created_utc": 1751614503.0,
      "score": 1,
      "context": [
        {
          "id": "n0d9j8i",
          "author": "Mister_Rabbit",
          "body": "45 here, strong ARFID symptoms since pre-school, formal diagnosis close to 10 years ago. You’ll adapt quickly and develop a gentle way of dealing with social situations.\n\nFor me I will typically stick to ‘oh I just have an upset stomach’ or ‘I’m so sorry, I lost track of time and ate right before this meal’ and stick to bland foods. If I’m truly forced to take a plate of food then I will push things around at the same cadence of other people so that it looks like I ate some of it. 90 percent of the time I’m not shy about sharing the ARFID thing if someone asks, otherwise I don’t make a big deal of it. There are a handful of foods that smell so awful to me that I have to really focus on not letting it show, sometimes with those I’ll find a reason to step outside or excuse myself.\n\nIf you’re like me and the social awkwardness ramps up your anxiety then having something to fidget with helps, same with focusing on the feel or temperature of something nearby. Sometimes I’ll discreetly grab an ice cube and focus on the cold and feeling of it melting, usually lasts long enough that whatever the gross food was has either been consumed or the smell has dissipated.\n\nNot sure what the Scandinavian mental health system looks like but in the US I was able to find an eating disorder therapy practice that had excellent experience with ARFID. My diet doesn’t look drastically different following the year of treatment but I did pick up a lot of coping methods for trying new foods and a lot of validation.",
          "created_utc": 1751178579.0
        }
      ]
    },
    {
      "id": "n0dd3lv",
      "author": "HuckleberryTop5278",
      "body": "This is useful, thanks ",
      "created_utc": 1751180612.0,
      "score": 1,
      "context": [
        {
          "id": "n0daan7",
          "author": "vonoddly",
          "body": "I’m an adult with ARFID. When I had to take cooking classes in school, I explained my situation to the instructors and they were actually pretty understanding about it. They allowed me to wear disposable gloves while cooking and rubber gloves when washing dishes. \n\nThe last day of the class would involve cooking a meal with a group and inviting a teacher to eat with us. We were required to eat the food, and my group was not willing to work with in my safe foods which I understood. I’ve gotten pretty good and moving food around on a plate to make it seem like I’ve taken a few bites. No one pushed the issue forward. \n\nMy advice is that it is okay to let people know if you need reasonable accommodations. Sometimes you can just say that you’re not feeling well or that you already ate and people will accept that.",
          "created_utc": 1751179011.0
        }
      ]
    },
    {
      "id": "n0edd7l",
      "author": "Ok_Theme_6480",
      "body": "As for the difficulties touching food, I’m not sure how your school system works, but if you have a guidance counselor or some sort of student support figure, maybe you could talk to them about accommodations? Gloves, sitting out from certain foods/cooking, maybe even a drs note to opt out entirely?\n\nETA: I agree with others when they say that learning to cook can help a lot, but you know your mind best. If you think touching unsafe foods will set you that far back, then that’s that. But I will say cooking food myself made me a lot more comfortable eating it",
      "created_utc": 1751200837.0,
      "score": 1,
      "context": [
        {
          "id": "n0ed21d",
          "author": "Ok_Theme_6480",
          "body": "I’m adult with Arfid & tbh the best way I’ve found to navigate it socially is to be honest- a lot of people just don’t know that this is a thing and most will be very kind about it if you give them the chance to. \n\nIf possible, start packing safe snacks in your purse/bag/whatever and try and find a nutrition/meal replacement drink that feels safe as well. Eat what you can and if you can’t, try your best to get the meal replacement drink down. That’s the best way I’ve survived up to this point. \n\n“Important” dinners (ie. At restaurants, parties, weddings, etc.) are still extremely difficult for me, but after letting my support system know what was going on helped. My partner is able to see that I’m uncomfortable and give me a way out, and when I eat with my family I am usually allowed to eat when I’m ready. This fully depends on your support system though, unfortunately. If you don’t feel like you have the social means necessary, it may be worth looking to seeing a nutritionist. \nSee your doctor often, get nutritional panels as often as you can. Take multivitamins and supplements as needed. \n\nIt does get easier, I doubt I’ll ever be fully “cured” but I’m a lot better than I was as a teen. Good luck!",
          "created_utc": 1751200707.0
        }
      ]
    },
    {
      "id": "n0exjvp",
      "author": "ZWiloh",
      "body": "I don't currently work, and when I did it was mostly retail and some office admin work, so I rarely ate with others. I'm generally fairly open about my health issues, including with food, if it comes up in conversation. I just say that I'm \"insanely picky\" and sometimes describe it as \"if an 8 year old had full control of their diet\", or \"I never outgrew the vegetables are icky phase\". I say it with a chuckle and a smile, try to be friendly. I've never had anyone who wasn't family give me any problems, but I know not everyone is that lucky.",
      "created_utc": 1751208155.0,
      "score": 4,
      "context": [
        {
          "id": "n0ayk8s",
          "author": "ZWiloh",
          "body": "I am an adult and I don't have a lot of experience with \"important\" dinners, but when nothing appeals to me when with company, I usually say I'm getting a migraine and feel too nauseous to eat. Everyone who knows me knows I have terrible headaches and chronic pain so I don't really get questioned about it. If people insist I eat something, I'll usually request buttered toast or rolls if they're available. It's easy on the stomach when I really am sick and it is usually super easy for someone to throw together for me so I do get some calories in and they don't feel like a neglectful host.",
          "created_utc": 1751144768.0
        },
        {
          "id": "n0d4arw",
          "author": "General_Writer_1664",
          "body": "How do u cope with eating with your colleagues? Does they know your situation?",
          "created_utc": 1751175718.0
        }
      ]
    },
    {
      "id": "n0bqazz",
      "author": "AttentionHelpful3996",
      "body": "Ahhh, yes that would absolutely pose a problem. I’m sorry I don’t have any advice for how to navigate that",
      "created_utc": 1751154572.0,
      "score": 1,
      "context": [
        {
          "id": "n0aspqq",
          "author": "AttentionHelpful3996",
          "body": "Would you be able to get a note from your doctor to opt you out of certain days that include the foods you can’t handle touching? \n\nI try really hard to not look at the food that grosses me out but that’s certainly hard in a lot of cases so I would probably just make up an excuse and leave. I’ve had it for a very long time but just recently diagnosed and I feel like it’s getting worse. Although I haven’t done specific therapy for the ARFID yet, just trying to find foods that I can eat so unfortunately I’m not much help there.",
          "created_utc": 1751142864.0
        },
        {
          "id": "n0bb1ar",
          "author": "HuckleberryTop5278",
          "body": "I don’t how I would do that as I would have to opt out every day we have that subject lol",
          "created_utc": 1751149047.0
        }
      ]
    },
    {
      "id": "n0j1ahk",
      "author": "RainbowGeoNerd",
      "body": "I have been the primary cook for my family for over a decade, and i don't make them eat my safe foods. I also took a culinary course. I knew intellectually that I wasn't cooking for me, so the requirement to eat it wasn't there. If it was a texture issue, I'd wear gloves, same with worry about food poisoning, germs, etc. If I get stressed, my ARFID gets worse. I try to meditate. I also eat what I can when I can. I don't leave myself out of family dinners if I can't eat unless I'm nauseated (from chronic health issues) because the smell of food doesn't usually bother me. Even if I don't eat, I do get joy knowing I'm providing good, nutritious food for my loved ones. I also have no hunger cues, no real interest in food, it's a means to an end.",
      "created_utc": 1751259888.0,
      "score": 1,
      "context": [
        {
          "id": "n0aspqq",
          "author": "AttentionHelpful3996",
          "body": "Would you be able to get a note from your doctor to opt you out of certain days that include the foods you can’t handle touching? \n\nI try really hard to not look at the food that grosses me out but that’s certainly hard in a lot of cases so I would probably just make up an excuse and leave. I’ve had it for a very long time but just recently diagnosed and I feel like it’s getting worse. Although I haven’t done specific therapy for the ARFID yet, just trying to find foods that I can eat so unfortunately I’m not much help there.",
          "created_utc": 1751142864.0
        },
        {
          "id": "n0bb1ar",
          "author": "HuckleberryTop5278",
          "body": "I don’t how I would do that as I would have to opt out every day we have that subject lol",
          "created_utc": 1751149047.0
        }
      ]
    },
    {
      "id": "n0bk1wt",
      "author": "HuckleberryTop5278",
      "body": "I’ll see what I can do, but space is limited and groups are pre made and all. This is of course a difficult situation as on one hand, I don’t want to be separated from everyone else due to the fact it’d make me stick out even more. (If that’s even an option) But on the other, I wouldn’t be able to do anything in a group. Either way I can’t really do any work. Luckily I don’t think any of my grades matter until 10th grade",
      "created_utc": 1751152324.0,
      "score": 1,
      "context": [
        {
          "id": "n0bc0ty",
          "author": "HuckleberryTop5278",
          "body": "I’m glad for the advice around the whole dinner thing, but I desperately need advice around what to do next school year when I’m graded around my cooking. I’ve previously had the subject in sixth grade and I don’t see it working out very well in a high school environment. We were divided into groups and I felt like a burden",
          "created_utc": 1751149403.0
        },
        {
          "id": "n0be1k7",
          "author": "desperation2000",
          "body": "my best recommendation is just to do your best with what\nyou have. don’t let arfid be the limiter. you could possibly ask a teacher to allow you to be in your own group by yourself if it would help your dynamic with other people (and not seeing yourself as a burden, which either way you’re not ! you’re working with something many people have never experienced and it’s not fair to put yourself on the same footing as other people)",
          "created_utc": 1751150137.0
        }
      ]
    },
    {
      "id": "n0d88va",
      "author": "IndependenceOld8708",
      "body": "I've never worked a job where I HAD to eat with people, my first jobs were fast food cashier jobs or as a waitress, so during my breaks I'd just go for walks. My next major jobs (including the one I'm working now), I worked solo or remote. Recently during a week long in person school thing I just turned down snacks with a \"no thank you.\", not going into why, and no one asked. I met them for dinner one night and just got a drink and sat with them. \n\n\nIn general I've found if you don't make a big deal about it people don't usually pry, they just assume you already ate or have medical food restrictions. I used to kinda eat safe food if it was available, but now I don't even do that because of the celiacs disease.\n\n\nIf pushed you can say you have a special diet for a medical condition. If they keep pushing you can just tell them you'd rather not talk about it. \n\n\nAs long as it doesn't interfere with your job, you don't owe your colleagues personal details. ",
      "created_utc": 1751177863.0,
      "score": 1,
      "context": [
        {
          "id": "n0cz9xq",
          "author": "IndependenceOld8708",
          "body": "I'll be 40 next month. Growing up I just used to tell people I was a vegetarian because the only meat I can handle is boneless, skinless chicken breast and bacon lol. It was easier to eat a salad or a side rather than explain I couldn't handle the texture of meat. I also have celiacs disease, but I didn't know that back then. Now I can use my fear of gluten contamination as an excuse. \n\n\nMy friends and family know I have ARFID. My family knew I wouldn't eat things like ground meat even as a young child (before ARFID was an official diagnosis), and luckily never tried to force me. My friends don't try to force me to eat, but they will offer food and double check with me to make sure there's food i will eat if we're having a dinner party. \n\n\nARFID almost killed me in my 20s. Now at almost 40 I've learned that for me what works is supplements and safe food. My fridge basically has hummus and carrots, cheese, salad, and microwave cheesy potatoes in it. I also have white rice and eggs, which is my go to comfort food. I try to grab fruit when I shop, strawberries, apples, tangerines, etc. I know i won't eat them daily, but i want to make sure I get some fruit in my diet. Today it was a few grapes. 2 days ago it was some strawberries with whipped cream. If I'm having a bad day I try to at least have a nutrition shake. I don't do anything fancy, usually just a chocolate slim fast shake. ",
          "created_utc": 1751173185.0
        },
        {
          "id": "n0d4so3",
          "author": "General_Writer_1664",
          "body": "Hi, how do u cope with eating with your colleagues?",
          "created_utc": 1751175979.0
        }
      ]
    },
    {
      "id": "n0edmdm",
      "author": "HuckleberryTop5278",
      "body": "I\\`ll see what I can do, the best solution I\\`ve seen is using replaceable gloves to touch food",
      "created_utc": 1751200942.0,
      "score": 2,
      "context": [
        {
          "id": "n0ed21d",
          "author": "Ok_Theme_6480",
          "body": "I’m adult with Arfid & tbh the best way I’ve found to navigate it socially is to be honest- a lot of people just don’t know that this is a thing and most will be very kind about it if you give them the chance to. \n\nIf possible, start packing safe snacks in your purse/bag/whatever and try and find a nutrition/meal replacement drink that feels safe as well. Eat what you can and if you can’t, try your best to get the meal replacement drink down. That’s the best way I’ve survived up to this point. \n\n“Important” dinners (ie. At restaurants, parties, weddings, etc.) are still extremely difficult for me, but after letting my support system know what was going on helped. My partner is able to see that I’m uncomfortable and give me a way out, and when I eat with my family I am usually allowed to eat when I’m ready. This fully depends on your support system though, unfortunately. If you don’t feel like you have the social means necessary, it may be worth looking to seeing a nutritionist. \nSee your doctor often, get nutritional panels as often as you can. Take multivitamins and supplements as needed. \n\nIt does get easier, I doubt I’ll ever be fully “cured” but I’m a lot better than I was as a teen. Good luck!",
          "created_utc": 1751200707.0
        },
        {
          "id": "n0edd7l",
          "author": "Ok_Theme_6480",
          "body": "As for the difficulties touching food, I’m not sure how your school system works, but if you have a guidance counselor or some sort of student support figure, maybe you could talk to them about accommodations? Gloves, sitting out from certain foods/cooking, maybe even a drs note to opt out entirely?\n\nETA: I agree with others when they say that learning to cook can help a lot, but you know your mind best. If you think touching unsafe foods will set you that far back, then that’s that. But I will say cooking food myself made me a lot more comfortable eating it",
          "created_utc": 1751200837.0
        }
      ]
    },
    {
      "id": "n0bm14w",
      "author": "Original_Cable6719",
      "body": "I would try to expose yourself to more foods in preparation for the class. Can you talk to the teacher about your issues at all?",
      "created_utc": 1751153037.0,
      "score": 3,
      "context": [
        {
          "id": "n0bc0ty",
          "author": "HuckleberryTop5278",
          "body": "I’m glad for the advice around the whole dinner thing, but I desperately need advice around what to do next school year when I’m graded around my cooking. I’ve previously had the subject in sixth grade and I don’t see it working out very well in a high school environment. We were divided into groups and I felt like a burden",
          "created_utc": 1751149403.0
        },
        {
          "id": "n0be1k7",
          "author": "desperation2000",
          "body": "my best recommendation is just to do your best with what\nyou have. don’t let arfid be the limiter. you could possibly ask a teacher to allow you to be in your own group by yourself if it would help your dynamic with other people (and not seeing yourself as a burden, which either way you’re not ! you’re working with something many people have never experienced and it’s not fair to put yourself on the same footing as other people)",
          "created_utc": 1751150137.0
        },
        {
          "id": "n0bk1wt",
          "author": "HuckleberryTop5278",
          "body": "I’ll see what I can do, but space is limited and groups are pre made and all. This is of course a difficult situation as on one hand, I don’t want to be separated from everyone else due to the fact it’d make me stick out even more. (If that’s even an option) But on the other, I wouldn’t be able to do anything in a group. Either way I can’t really do any work. Luckily I don’t think any of my grades matter until 10th grade",
          "created_utc": 1751152324.0
        }
      ]
    },
    {
      "id": "n0d8vb9",
      "author": "General_Writer_1664",
      "body": "I wish I can work in solo or remote. That's like my dream job. I work in office and my colleagues always invite me for lunch but I keep reject them. If I join them, I don't think I can just buy a drink (since they know whether I got eat something in morning?)",
      "created_utc": 1751178209.0,
      "score": 1,
      "context": [
        {
          "id": "n0cz9xq",
          "author": "IndependenceOld8708",
          "body": "I'll be 40 next month. Growing up I just used to tell people I was a vegetarian because the only meat I can handle is boneless, skinless chicken breast and bacon lol. It was easier to eat a salad or a side rather than explain I couldn't handle the texture of meat. I also have celiacs disease, but I didn't know that back then. Now I can use my fear of gluten contamination as an excuse. \n\n\nMy friends and family know I have ARFID. My family knew I wouldn't eat things like ground meat even as a young child (before ARFID was an official diagnosis), and luckily never tried to force me. My friends don't try to force me to eat, but they will offer food and double check with me to make sure there's food i will eat if we're having a dinner party. \n\n\nARFID almost killed me in my 20s. Now at almost 40 I've learned that for me what works is supplements and safe food. My fridge basically has hummus and carrots, cheese, salad, and microwave cheesy potatoes in it. I also have white rice and eggs, which is my go to comfort food. I try to grab fruit when I shop, strawberries, apples, tangerines, etc. I know i won't eat them daily, but i want to make sure I get some fruit in my diet. Today it was a few grapes. 2 days ago it was some strawberries with whipped cream. If I'm having a bad day I try to at least have a nutrition shake. I don't do anything fancy, usually just a chocolate slim fast shake. ",
          "created_utc": 1751173185.0
        },
        {
          "id": "n0d4so3",
          "author": "General_Writer_1664",
          "body": "Hi, how do u cope with eating with your colleagues?",
          "created_utc": 1751175979.0
        },
        {
          "id": "n0d88va",
          "author": "IndependenceOld8708",
          "body": "I've never worked a job where I HAD to eat with people, my first jobs were fast food cashier jobs or as a waitress, so during my breaks I'd just go for walks. My next major jobs (including the one I'm working now), I worked solo or remote. Recently during a week long in person school thing I just turned down snacks with a \"no thank you.\", not going into why, and no one asked. I met them for dinner one night and just got a drink and sat with them. \n\n\nIn general I've found if you don't make a big deal about it people don't usually pry, they just assume you already ate or have medical food restrictions. I used to kinda eat safe food if it was available, but now I don't even do that because of the celiacs disease.\n\n\nIf pushed you can say you have a special diet for a medical condition. If they keep pushing you can just tell them you'd rather not talk about it. \n\n\nAs long as it doesn't interfere with your job, you don't owe your colleagues personal details. ",
          "created_utc": 1751177863.0
        }
      ]
    },
    {
      "id": "n0daz3f",
      "author": "IndependenceOld8708",
      "body": "Lol I'm going to school to be a therapist specifically so I have no boss or coworkers 😂 I'm currently remote I.T. support and before that I was a semi truck driver, and before that I was a medical courier.\n\n\nARFID is complex and different for everyone, so it's hard to tell you what to do, but some ideas that come to mind are looking into the menus at local restaurants ahead of time and seeing if they have any safe foods for you. Back before I found out about celiacs that would be stuff like fries, a simple salad, chicken breast, or even ice cream for me. \n\n\nYou could use the special medical diet excuse. It's kinda true. That way you can hangout and just get a water or coffee. \n\n\nYou could say you have a sensitive stomach and don't really like eating away from home because you don't know what will upset it, but you'd be happy to just keep them company, if that doesn't embarrass you. \n\n\nHonestly the only people who have ever commented on my eating are people I spend 24 hours a day with. I went on a 10 day road trip across the US with my best friend last year. She knew I didn't eat much ahead of time, and that she'd have to tell me when she wanted food, but about 3 days in she commented that she had no idea how little I actually ate until spending a few days non stop with her. Mind you, this girl has been to my house, spent day trips with me, even worked conventions with me, and we've been friends for over a decade, and she didn't notice. I think we worry more than other people notice. ",
      "created_utc": 1751179398.0,
      "score": 1,
      "context": [
        {
          "id": "n0cz9xq",
          "author": "IndependenceOld8708",
          "body": "I'll be 40 next month. Growing up I just used to tell people I was a vegetarian because the only meat I can handle is boneless, skinless chicken breast and bacon lol. It was easier to eat a salad or a side rather than explain I couldn't handle the texture of meat. I also have celiacs disease, but I didn't know that back then. Now I can use my fear of gluten contamination as an excuse. \n\n\nMy friends and family know I have ARFID. My family knew I wouldn't eat things like ground meat even as a young child (before ARFID was an official diagnosis), and luckily never tried to force me. My friends don't try to force me to eat, but they will offer food and double check with me to make sure there's food i will eat if we're having a dinner party. \n\n\nARFID almost killed me in my 20s. Now at almost 40 I've learned that for me what works is supplements and safe food. My fridge basically has hummus and carrots, cheese, salad, and microwave cheesy potatoes in it. I also have white rice and eggs, which is my go to comfort food. I try to grab fruit when I shop, strawberries, apples, tangerines, etc. I know i won't eat them daily, but i want to make sure I get some fruit in my diet. Today it was a few grapes. 2 days ago it was some strawberries with whipped cream. If I'm having a bad day I try to at least have a nutrition shake. I don't do anything fancy, usually just a chocolate slim fast shake. ",
          "created_utc": 1751173185.0
        },
        {
          "id": "n0d4so3",
          "author": "General_Writer_1664",
          "body": "Hi, how do u cope with eating with your colleagues?",
          "created_utc": 1751175979.0
        },
        {
          "id": "n0d88va",
          "author": "IndependenceOld8708",
          "body": "I've never worked a job where I HAD to eat with people, my first jobs were fast food cashier jobs or as a waitress, so during my breaks I'd just go for walks. My next major jobs (including the one I'm working now), I worked solo or remote. Recently during a week long in person school thing I just turned down snacks with a \"no thank you.\", not going into why, and no one asked. I met them for dinner one night and just got a drink and sat with them. \n\n\nIn general I've found if you don't make a big deal about it people don't usually pry, they just assume you already ate or have medical food restrictions. I used to kinda eat safe food if it was available, but now I don't even do that because of the celiacs disease.\n\n\nIf pushed you can say you have a special diet for a medical condition. If they keep pushing you can just tell them you'd rather not talk about it. \n\n\nAs long as it doesn't interfere with your job, you don't owe your colleagues personal details. ",
          "created_utc": 1751177863.0
        },
        {
          "id": "n0d8vb9",
          "author": "General_Writer_1664",
          "body": "I wish I can work in solo or remote. That's like my dream job. I work in office and my colleagues always invite me for lunch but I keep reject them. If I join them, I don't think I can just buy a drink (since they know whether I got eat something in morning?)",
          "created_utc": 1751178209.0
        }
      ]
    },
    {
      "id": "n0ddfy3",
      "author": "General_Writer_1664",
      "body": "I not sure whether I can use medical diet as an excuse as I used to join them for lunch sometimes until around 2 years ago I stop eating and avoid with them..",
      "created_utc": 1751180805.0,
      "score": 1,
      "context": [
        {
          "id": "n0cz9xq",
          "author": "IndependenceOld8708",
          "body": "I'll be 40 next month. Growing up I just used to tell people I was a vegetarian because the only meat I can handle is boneless, skinless chicken breast and bacon lol. It was easier to eat a salad or a side rather than explain I couldn't handle the texture of meat. I also have celiacs disease, but I didn't know that back then. Now I can use my fear of gluten contamination as an excuse. \n\n\nMy friends and family know I have ARFID. My family knew I wouldn't eat things like ground meat even as a young child (before ARFID was an official diagnosis), and luckily never tried to force me. My friends don't try to force me to eat, but they will offer food and double check with me to make sure there's food i will eat if we're having a dinner party. \n\n\nARFID almost killed me in my 20s. Now at almost 40 I've learned that for me what works is supplements and safe food. My fridge basically has hummus and carrots, cheese, salad, and microwave cheesy potatoes in it. I also have white rice and eggs, which is my go to comfort food. I try to grab fruit when I shop, strawberries, apples, tangerines, etc. I know i won't eat them daily, but i want to make sure I get some fruit in my diet. Today it was a few grapes. 2 days ago it was some strawberries with whipped cream. If I'm having a bad day I try to at least have a nutrition shake. I don't do anything fancy, usually just a chocolate slim fast shake. ",
          "created_utc": 1751173185.0
        },
        {
          "id": "n0d4so3",
          "author": "General_Writer_1664",
          "body": "Hi, how do u cope with eating with your colleagues?",
          "created_utc": 1751175979.0
        },
        {
          "id": "n0d88va",
          "author": "IndependenceOld8708",
          "body": "I've never worked a job where I HAD to eat with people, my first jobs were fast food cashier jobs or as a waitress, so during my breaks I'd just go for walks. My next major jobs (including the one I'm working now), I worked solo or remote. Recently during a week long in person school thing I just turned down snacks with a \"no thank you.\", not going into why, and no one asked. I met them for dinner one night and just got a drink and sat with them. \n\n\nIn general I've found if you don't make a big deal about it people don't usually pry, they just assume you already ate or have medical food restrictions. I used to kinda eat safe food if it was available, but now I don't even do that because of the celiacs disease.\n\n\nIf pushed you can say you have a special diet for a medical condition. If they keep pushing you can just tell them you'd rather not talk about it. \n\n\nAs long as it doesn't interfere with your job, you don't owe your colleagues personal details. ",
          "created_utc": 1751177863.0
        },
        {
          "id": "n0d8vb9",
          "author": "General_Writer_1664",
          "body": "I wish I can work in solo or remote. That's like my dream job. I work in office and my colleagues always invite me for lunch but I keep reject them. If I join them, I don't think I can just buy a drink (since they know whether I got eat something in morning?)",
          "created_utc": 1751178209.0
        },
        {
          "id": "n0daz3f",
          "author": "IndependenceOld8708",
          "body": "Lol I'm going to school to be a therapist specifically so I have no boss or coworkers 😂 I'm currently remote I.T. support and before that I was a semi truck driver, and before that I was a medical courier.\n\n\nARFID is complex and different for everyone, so it's hard to tell you what to do, but some ideas that come to mind are looking into the menus at local restaurants ahead of time and seeing if they have any safe foods for you. Back before I found out about celiacs that would be stuff like fries, a simple salad, chicken breast, or even ice cream for me. \n\n\nYou could use the special medical diet excuse. It's kinda true. That way you can hangout and just get a water or coffee. \n\n\nYou could say you have a sensitive stomach and don't really like eating away from home because you don't know what will upset it, but you'd be happy to just keep them company, if that doesn't embarrass you. \n\n\nHonestly the only people who have ever commented on my eating are people I spend 24 hours a day with. I went on a 10 day road trip across the US with my best friend last year. She knew I didn't eat much ahead of time, and that she'd have to tell me when she wanted food, but about 3 days in she commented that she had no idea how little I actually ate until spending a few days non stop with her. Mind you, this girl has been to my house, spent day trips with me, even worked conventions with me, and we've been friends for over a decade, and she didn't notice. I think we worry more than other people notice. ",
          "created_utc": 1751179398.0
        }
      ]
    },
    {
      "id": "n0dhavh",
      "author": "IndependenceOld8708",
      "body": "The medical diet could still work. I found out I had celiacs disease 2 years ago at almost 38 years old. My entire diet had to change and I don't eat at restaurants anymore unless it's absolutely necessary (such as traveling), because the risk of cross contamination is too high. Before that my friends and I were always going places to eat (I was usually eating some type of potato, but i went).\n\n\nYou can say something you were eating started making you sick a couple years ago, but you're not sure what exactly, so you stick to a strict diet of food you make at home and that's seemed to help. \n\n\nYou can even mention you're working on trying to figure out what food makes you sick if you feel like you need to add more. They don't need to know it's ARFID. \n\n\nWe knew something I was eating was having a bad effect on my body. It's part of why I ended up with ARFID, we just didn't know what. I even tried cutting gluten out at one point, but I didn't realize how sensitive I was to it, so I didn't cut it out enough (I can't even touch something with gluten, say a piece of bread, then touch a food I'm going to eat). After I cut it out totally we realized it had been making me sick since I was 2. So it's not unheard of for people to realize something they eat was making them sick as they get older. I have a few friends with histamine issues and sometimes they can eat like normal, and other times they're even more strict than I am. ",
      "created_utc": 1751183108.0,
      "score": 1,
      "context": [
        {
          "id": "n0cz9xq",
          "author": "IndependenceOld8708",
          "body": "I'll be 40 next month. Growing up I just used to tell people I was a vegetarian because the only meat I can handle is boneless, skinless chicken breast and bacon lol. It was easier to eat a salad or a side rather than explain I couldn't handle the texture of meat. I also have celiacs disease, but I didn't know that back then. Now I can use my fear of gluten contamination as an excuse. \n\n\nMy friends and family know I have ARFID. My family knew I wouldn't eat things like ground meat even as a young child (before ARFID was an official diagnosis), and luckily never tried to force me. My friends don't try to force me to eat, but they will offer food and double check with me to make sure there's food i will eat if we're having a dinner party. \n\n\nARFID almost killed me in my 20s. Now at almost 40 I've learned that for me what works is supplements and safe food. My fridge basically has hummus and carrots, cheese, salad, and microwave cheesy potatoes in it. I also have white rice and eggs, which is my go to comfort food. I try to grab fruit when I shop, strawberries, apples, tangerines, etc. I know i won't eat them daily, but i want to make sure I get some fruit in my diet. Today it was a few grapes. 2 days ago it was some strawberries with whipped cream. If I'm having a bad day I try to at least have a nutrition shake. I don't do anything fancy, usually just a chocolate slim fast shake. ",
          "created_utc": 1751173185.0
        },
        {
          "id": "n0d4so3",
          "author": "General_Writer_1664",
          "body": "Hi, how do u cope with eating with your colleagues?",
          "created_utc": 1751175979.0
        },
        {
          "id": "n0d88va",
          "author": "IndependenceOld8708",
          "body": "I've never worked a job where I HAD to eat with people, my first jobs were fast food cashier jobs or as a waitress, so during my breaks I'd just go for walks. My next major jobs (including the one I'm working now), I worked solo or remote. Recently during a week long in person school thing I just turned down snacks with a \"no thank you.\", not going into why, and no one asked. I met them for dinner one night and just got a drink and sat with them. \n\n\nIn general I've found if you don't make a big deal about it people don't usually pry, they just assume you already ate or have medical food restrictions. I used to kinda eat safe food if it was available, but now I don't even do that because of the celiacs disease.\n\n\nIf pushed you can say you have a special diet for a medical condition. If they keep pushing you can just tell them you'd rather not talk about it. \n\n\nAs long as it doesn't interfere with your job, you don't owe your colleagues personal details. ",
          "created_utc": 1751177863.0
        },
        {
          "id": "n0d8vb9",
          "author": "General_Writer_1664",
          "body": "I wish I can work in solo or remote. That's like my dream job. I work in office and my colleagues always invite me for lunch but I keep reject them. If I join them, I don't think I can just buy a drink (since they know whether I got eat something in morning?)",
          "created_utc": 1751178209.0
        },
        {
          "id": "n0daz3f",
          "author": "IndependenceOld8708",
          "body": "Lol I'm going to school to be a therapist specifically so I have no boss or coworkers 😂 I'm currently remote I.T. support and before that I was a semi truck driver, and before that I was a medical courier.\n\n\nARFID is complex and different for everyone, so it's hard to tell you what to do, but some ideas that come to mind are looking into the menus at local restaurants ahead of time and seeing if they have any safe foods for you. Back before I found out about celiacs that would be stuff like fries, a simple salad, chicken breast, or even ice cream for me. \n\n\nYou could use the special medical diet excuse. It's kinda true. That way you can hangout and just get a water or coffee. \n\n\nYou could say you have a sensitive stomach and don't really like eating away from home because you don't know what will upset it, but you'd be happy to just keep them company, if that doesn't embarrass you. \n\n\nHonestly the only people who have ever commented on my eating are people I spend 24 hours a day with. I went on a 10 day road trip across the US with my best friend last year. She knew I didn't eat much ahead of time, and that she'd have to tell me when she wanted food, but about 3 days in she commented that she had no idea how little I actually ate until spending a few days non stop with her. Mind you, this girl has been to my house, spent day trips with me, even worked conventions with me, and we've been friends for over a decade, and she didn't notice. I think we worry more than other people notice. ",
          "created_utc": 1751179398.0
        },
        {
          "id": "n0ddfy3",
          "author": "General_Writer_1664",
          "body": "I not sure whether I can use medical diet as an excuse as I used to join them for lunch sometimes until around 2 years ago I stop eating and avoid with them..",
          "created_utc": 1751180805.0
        }
      ]
    }
  ]
}