{
  "id": "1lptgpe",
  "subreddit": "ARFID",
  "author": "CastersTheOneAndOnly",
  "created_utc": 1751455983.0,
  "title": "Anyone else 100% have arfid but doesn’t have a diagnosis?",
  "selftext": "Sorry I’m posting lots of questions in this sub recently but i just discovered it. So i found about arfid a year ago and it’s very confusing because I went to a psychologist my whole life and she never seems to know I have arfid. I explained to her I found out about arfid and that it’s fairly new since it appeared in the DSM-V but she just thinks it’s related to trauma and doesn’t seem to be aware about arfid. It doesn’t seem like a major problem",
  "url": "https://www.reddit.com/r/ARFID/comments/1lptgpe/anyone_else_100_have_arfid_but_doesnt_have_a/",
  "score": 133,
  "num_comments": 48,
  "comments": [
    {
      "id": "n0xlit1",
      "author": "Thedailybee",
      "body": "lol I have had to teach many providers what ARFID is 🙂 I honestly stopped saying I think I have and just tell them I have ARFID and leave it at that. They rarely know what it even is so I don’t expect much help in that department from any of them unfortunately. Sucks when things get rough and idk what to do ?? But fr they don’t know what to do with it so it’s pointless and exhausting to just keep explaining it and why I think I have it and stuff. I’ll just suffer quietly and figure it out on my own 🌚 I’m also AuDHD tho and food issues come with that territory I think, or most drs assume so at least",
      "created_utc": 1751459998.0,
      "score": 23,
      "context": []
    },
    {
      "id": "n0xtdqx",
      "author": "Super_Spooky_",
      "body": "ARFID is relatively new in the mental health world, but it’s also something that you can pretty easily pin down if you’ve had it for most of your life, since anxiety around food and trouble eating (without the signs of anorexia or other eating disorders) doesn’t leave too much for the imagination in terms of what it is. If you fit the criteria, especially more than one category like me, then you’ve probably got it. If only because not much else fits",
      "created_utc": 1751462696.0,
      "score": 24,
      "context": []
    },
    {
      "id": "n0xcj84",
      "author": "DizzyMine4964",
      "body": "Yes, but I am diagnosed autistic. The NHS where I live does nothing for any mental illness - they let people rot and die - so a diagnosis is unlikely.",
      "created_utc": 1751456515.0,
      "score": 40,
      "context": []
    },
    {
      "id": "n0xc48t",
      "author": "Murgbot",
      "body": "Yeah but I have AuDHD so I think it’s acknowledged as part of that and doctors tend to take it more seriously because of that even if it’s not labelled specifically as ARFID.",
      "created_utc": 1751456341.0,
      "score": 18,
      "context": []
    },
    {
      "id": "n0xq990",
      "author": "RealityTVfan28",
      "body": "I’m nearly 69 and not diagnosed but I definitely have ARFID. For years since internet I’ve tried searching online about extremely picky eaters. Never came across ARFID. When I heard the term I asked what is ARFID? The response was you—you have ARFID the way you eat. Since then I come here often for knowledge, support, and try to help others dealing with it. \n\nI’ve never actually discussed it with any medical doctor or nurse. I was always made to feel like I was such an oddball with all the things I wouldn’t eat that I just hid it as much as I possibly could. I always say I could be at a wedding and even if you sat next to me you’d think I ate, but all I did was cut things and move them around. In my 20’s, with the support of my hubby, I was able to add enough good and health foods to ensure I was healthy enough to have kids. \n\nSo yeah, compared to others my diet may be restricted, but for me I’ve come leaps and bounds from where I was. Now I’m ok with it and don’t actually give one F what anyone else thinks of it. Also BTW I’m healthier than most people my age. I have no chronic illness or conditions and take only an eyedrop to prevent glaucoma. I attribute this to my never having eaten meat. Who knows if I’m right??",
      "created_utc": 1751461655.0,
      "score": 9,
      "context": []
    },
    {
      "id": "n0xekux",
      "author": "n8rnerd",
      "body": "Yes, I've had a restricted diet since I was 2 (now 38). Diagnosis wasn't available through childhood and I've learned to manage it well enough that it doesn't really matter to me whether I'm labelled clinically.",
      "created_utc": 1751457349.0,
      "score": 11,
      "context": []
    },
    {
      "id": "n0xlgwu",
      "author": "Alarow",
      "body": "An arfid diagnosis doesn't exist in my country but I've seen like 5-6 speech therapists (they also focus on food issues for kids and adults) and they all agree I have MAJOR issues around food",
      "created_utc": 1751459979.0,
      "score": 3,
      "context": []
    },
    {
      "id": "n0xr986",
      "author": "S-quinn7292",
      "body": "I do, i tried to get a diagnosis but was told it would take a few sessions with a specialist that cost about $500 per session to get the diagnosis and I just can’t justify spending over $1k just to have someone say “this thing that you’re 1000% sure you have, you have it.”",
      "created_utc": 1751461993.0,
      "score": 3,
      "context": []
    },
    {
      "id": "n0yxvtp",
      "author": "angelneliel",
      "body": "My psychiatrist told me getting a separate diagnosis for ARFID was unnecessary, as I already had my autism diagnosis which specified my eating troubles. He told me since the two conditions are highly comorbid, it was not necessary. However I am on the path to getting supports for it, though I'm not sure there are many in my area.\n\nI have read comments in the past saying how getting an additional diagnosis on top of their autism diagnosis was bad as insurance started to charge more for flights and healthcare if I remember correctly.",
      "created_utc": 1751474480.0,
      "score": 3,
      "context": []
    },
    {
      "id": "n0xpuk6",
      "author": "giraffemoo",
      "body": "My doctor said \"yeah that sounds like arfid\" but never officially diagnosed me. But she's not that great of a doctor, lol.",
      "created_utc": 1751461516.0,
      "score": 2,
      "context": []
    },
    {
      "id": "n0y2mh7",
      "author": "perhapsalittleslow",
      "body": "It’s been confirmed by my doctors but they wouldn’t give me an official diagnosis.",
      "created_utc": 1751465598.0,
      "score": 2,
      "context": []
    },
    {
      "id": "n0yhtw9",
      "author": "acnerd5",
      "body": "I know for a few years thanks to the internet before being diagnosed, and when I went to a specialty eating disorder clinic I was so disappointed by the lack of services offered (and also had a bunch of old trauma dug up as the lady kept threatening to lock me up??? Idfk)...\n\nLike she literally told me if I wasn't going to go inpatient, they couldn't help me. I was going through a bad flare and struggling to stand without my vision going most days, and I was finally begging someone for help after weeks of supplement shakes only. That was TERRIBLE. \n\nIve seen others have a lot more luck, but I dont really have the energy to try again right now - I did get my diagnosis, but I already knew. Its ok to know ahead of time, and i think its so new that a lot of doctors are unsure of things.",
      "created_utc": 1751469961.0,
      "score": 2,
      "context": []
    },
    {
      "id": "n0ys5e1",
      "author": "Foreign_Objective748",
      "body": "Of course ! A lot of therapist don't know this disorder. I'm in France and I didn't hear that word in my cursus in psychology (I didn't do clinical psychology but we study psychopathology during the 3 first years).\n\nIt can also be linked to autism, or maybe trauma, but like the other eating disorders. The root of ARFID is different depending on people. But, your therapist should not tell you if it's a major problem or not, she should get informed on ARFID since you told her. Only you can say if it's a big problem for you (can you eat enough ? Are you struggling with deficiencies because of that ? Does it have an impact on your social life ?)\n\nMaybe it would be difficult to find a psychologist who knows a lot about ARFID (depending where you live) but you can find a psychologist who try to stay informed about what you are going through and not be like \"nah, I know everything\", it can make a huge difference",
      "created_utc": 1751472831.0,
      "score": 2,
      "context": []
    },
    {
      "id": "n0z3667",
      "author": "saintceciliax",
      "body": "Yes and I’ve rarely if ever met any medical/psych professionals who have heard of it. Self dx is good enough for me",
      "created_utc": 1751475965.0,
      "score": 2,
      "context": []
    },
    {
      "id": "n0zap0w",
      "author": "Fit-Incident-1207",
      "body": "I’d say yes just because of the amount of people that are undiagnosed. For me I’ve been this way since a baby and have never been able to change, if it resonates with you I think that’s all that matters.",
      "created_utc": 1751478062.0,
      "score": 2,
      "context": []
    },
    {
      "id": "n0zxaek",
      "author": "TashaT50",
      "body": "I’m self-diagnosed with ARFID, autism, and ADHD (AuDHD), I’m nonbinary and in my late 50s. I’ve had ARFID since I came out of the womb and rejected breast milk, rejected all but one formula just released the year before I was born (infant with failure to thrive), and rejected many solid foods refusing to eat for up to 6 hours whenever they were reintroduced. I also have cPTSD, depression, anxiety, fibromyalgia, chronic fatigue syndrome, migraines, hard of hearing, and a slew of other health issues all of which make the others worse at times. \n\nIn the 1970s, girls weren’t being diagnosed with ADHD or autism. Then ADHD was considered something kids grew out of. I mask heavily so autism has never been considered. At this point in my life, with my other health issues, and lack of finances, fighting the system to get diagnosed is a waste of my time and money. I’m finding tools to help me survive thanks to various subs. It’s been hard enough to get doctors to take any of my invisible illnesses seriously I’m not pushing to add more for them to question. \n\nI have my ARFID reasonably under control although my diet could improve. I’m still trying to add more veggies to my safe food list.",
      "created_utc": 1751484734.0,
      "score": 2,
      "context": []
    },
    {
      "id": "n10o6ul",
      "author": "averagecryptid",
      "body": "I don't have a formal diagnosis but haven't felt a need for it. I think if I wanted to access specific treatment it might be different. I've talked to a dietician before about what my safe foods are and they are mostly keeping my vitamin needs up to snuff, and I get bloodwork to check on my levels regularly anyway because of other stuff. (I have been anemic before because of ARFID, so I try to keep an eye on that.)",
      "created_utc": 1751492673.0,
      "score": 2,
      "context": []
    },
    {
      "id": "n11l7rq",
      "author": "Full_Painter_1807",
      "body": "yes, not autistic but severely ADHD. probably not related to trauma (unless my mom thinking you cook broccoli by boiling it is a trauma)",
      "created_utc": 1751503404.0,
      "score": 2,
      "context": []
    },
    {
      "id": "n12j74f",
      "author": "magnasollertia",
      "body": "i had a couple appointments with dieticians, including an eating disorder specialist, who told me it sounds like i have arfid but it’s not that important to get diagnosed by a psychiatrist unless i wanted to go through therapy for it. so i didn’t pursue it and just live as though i have it, which has been very helpful.",
      "created_utc": 1751515737.0,
      "score": 2,
      "context": []
    },
    {
      "id": "n12kogz",
      "author": "probablyjustamagpie",
      "body": "I had ARFID before it was ARFID. I was originally diagnosed with “sensory integration disorder”, now called sensory processing disorder, and was in intensive outpatient feeding therapy almost 15 years ago, due to my then extremely avoidant behavior around food. I might have been diagnosed with ARFID around 2018, when I was in an eating disorder treatment clinic, but they treated me like an anorexia or bulimia patient and never called my condition ARFID as far as I can remember. I left that program because they simply couldn’t help me. Since then my family and I have called it ARFID and I openly discuss it with my doctors, but as far as I’m aware it’s still technically a self diagnosis.",
      "created_utc": 1751516386.0,
      "score": 2,
      "context": []
    },
    {
      "id": "n14ethu",
      "author": "Noodles_uses_reddit",
      "body": "I have it (diagnosed by a nutritionist specialising in eating disorders) but to get a “true” diagnosis I would have to be put into an inpatient hospital which is too traumatic for me. I have it yes, but I cannot have it placed on my medical history without a traumatic event.",
      "created_utc": 1751548753.0,
      "score": 2,
      "context": []
    },
    {
      "id": "n0ye9o3",
      "author": "paradigm_mgmt",
      "body": "i have a confirmation from a psychiatrist - but as they were part of the diabetes team, not actually seeing me for my mental health long term, it wasnt what i would call a diagnosis (which typically takes more than talking to a person 3 times)\n\ni highly suspect ASD- but was missed as a child so now there's basically nothing i can do about it 🙄 even tho many of the physical co-morbidities are also present (GI & joint issues)\n\ni attempt to educate myself and try out remediations because that's all i can do at this point, sadly.",
      "created_utc": 1751468956.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n0ykps6",
      "author": "RealisticPepper5308",
      "body": "i definitely have arfid, and i have for all my life. but i've been diagnosed with autism for 8 years and anorexia for 2 years so i don't really mind my arfid being undiagnosed",
      "created_utc": 1751470758.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n0yve4w",
      "author": "ShuileBhride",
      "body": "\n\nI have Arfid, and while I had a diagnosis when I was living in Canada for a few years, I haven't been able to get one when I moved back home here in the States. My family Doctor is old school, and doesn't believe that Arfid exists. He's close to retiring, and the guy He's training to eventually replace Him does believe it exists, and will be willing to help Me get a dianogis, but not until the Clenic changes Doctors.",
      "created_utc": 1751473757.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n0z8rjx",
      "author": "Sophia_HJ22",
      "body": "Definitely",
      "created_utc": 1751477522.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n0zm7n2",
      "author": "Barbie-Necromancer",
      "body": "I knew I had ARFID for 3 years before I got my official diagnosis, and qualified myself as correctly self-diagnosed when I found out about it. With Diagnosis came treatment, and that was immensely helpful",
      "created_utc": 1751481412.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n0zt4zw",
      "author": "StressorAnxiety",
      "body": "I'm not diagnosed but I heard about it from my counselor and then went to look it up and every single thing about it matches so yeah",
      "created_utc": 1751483476.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n0zykid",
      "author": "Niseryuu",
      "body": "yes but for me it can't be argued that it's related to trauma because I had it since I began eating solid foods, there are common foods out there that I don't know what taste like and I know I will not like them based on other cues, but i'm still not diagnosed",
      "created_utc": 1751485127.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n0zzbd9",
      "author": "GaydrianTheRainbow",
      "body": "No diagnosis for ARFID or for most of my other stuff either. Doctors consistently prove themselves useless to me unfortunately.",
      "created_utc": 1751485354.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n108eqx",
      "author": "FlemFatale",
      "body": "Yup. My GP even thinks that it's ARFID, but as the NHS don't treat ARFID in my area, getting help has been an uphill struggle. My GP applied for funding from the ICB, so hopefully something will happen soonish.",
      "created_utc": 1751488035.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n10emom",
      "author": "janetsnakehole319",
      "body": "Me",
      "created_utc": 1751489812.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n10hf76",
      "author": "vibinandtrying",
      "body": "Technically I can’t be diagnosed bc I also have anorexia. But it’s on my chart fuck the dsm",
      "created_utc": 1751490626.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n10qh0b",
      "author": "HezaLeNormandy",
      "body": "Yup. None of my providers knew what it was so I just leave it alone now",
      "created_utc": 1751493372.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n10v1w5",
      "author": "Capital-Ad-6349",
      "body": "I can't eat 99% of any fruits or vegetables but the PCP I had until I was 16 was not the slightest bit concerned about that. \n\nHealthcare is just expensive at this point and I haven't had a PCP since so I just live with it and try to work on it as I can.",
      "created_utc": 1751494854.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n11zhkt",
      "author": "neptune_pirate",
      "body": "yup",
      "created_utc": 1751508073.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n14sbwq",
      "author": "weaktreeiz",
      "body": "I've been told NHS (UK) will not diagnose me with ARFID as that will restrict me from all help. \nED services dont deal with ARFID unless I get super underweight or develop another eating disorder like anorexia or bulimia. So there is no high level specific care for ARFID however self-referral CBT therapies will not accept me if I have an official ARFID diagnosis. ",
      "created_utc": 1751552971.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n16ydh2",
      "author": "Aggravating-Ad3234",
      "body": "I only got a diagnosis when I got to a point where I was rly severely underweight/very malnourished",
      "created_utc": 1751575406.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n1aqy6k",
      "author": "Pretty_Appointment82",
      "body": "Having a diagnosis would help with treatment options.But personally, me. I have enough safe foods that I can survive. It's still a small number. A  daily fight. It's not.\nIdeal. But I'm managing.\n\nFor some, it can be very beneficial to have a diagnosis. \nI think it depends on the person.\nYou gotta do what works for you.",
      "created_utc": 1751633240.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n1d65ee",
      "author": "Honest-Garbage9256",
      "body": "Yup! I have had symptoms of ARFID since I was an infant(still eating baby food) and never got diagnosed. The only diagnosis a dr would give me was anorexia, which I did struggle with for a time, but have been recovered for over 10 years now and it’s still on my chart right at the top. I am 31 btw. Just yesterday I had to explain what ARFID was to a psychiatrist during a psych evaluation and she said she knew a little about it, but after me explaining she pretty much told me I’m just traumatized and am doing it to myself. She was also not a very good dr in general. There was a lot of victim blaming about my traumas during the evaluation. I presented symptoms of ARFID before my childhood trauma and I explained that very clearly to her. It seems like it’s nearly impossible to get a diagnosis at this point. I’m so sorry you’re having to deal with drs being dismissive. You deserve proper care <3\n\nEdited for typos*",
      "created_utc": 1751660903.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n1fyxop",
      "author": "xXbellamuerteXx",
      "body": "arfid isn’t a recognised ed in my country (it’s classified as a “feeding problem” which is even dumber in my native language) so my siblings and i will never get diagnosed lmao",
      "created_utc": 1751706294.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n1ncpj1",
      "author": "Charming-Scallion747",
      "body": "Me!! I don’t have a diagnosis nor is it possible for me to get one but I am SURE I do have it. While it is very important to get diagnosed, I think we are the ones who know our bodies most and if you know something is wrong, there’s a good chance that there is !",
      "created_utc": 1751815714.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n1xcj6g",
      "author": "Plastic_Secretary208",
      "body": "me too! i’ve been “picky” nd underweight my whole life but doctors don’t diagnose it maybe due to how rare it is. most doctors don’t even know what arfid is unfortunately:(",
      "created_utc": 1751945892.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n2snldm",
      "author": "Interesting_Face_258",
      "body": "yes.....no matter how hard i try, i just cant eat things such as noodles with sauce, restaraunt mac and cheese, yes restaurant or any brand other than velveeta idk why. and still, nausious all the time, peple still think its fake i dont eat 3 meals a day.. litterly 1",
      "created_utc": 1752356247.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n4dm47a",
      "author": "hurrypotta",
      "body": "I was diagnosed as a selective eater around 10. I think this would be ARFID now.",
      "created_utc": 1753119589.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n0xrlzj",
      "author": "MaleficentSwan0223",
      "body": "I used to tell the nhs I had arfid and doctors would just nod along because they had no idea what it was. Now I’ve been clinically diagnosed due to severe physical health problems linked to malnutrition and they’ve automatically sent me for an autism assessment. \n\nThe nhs is so backwards for mental health - everything to them is just anxiety. ",
      "created_utc": 1751462112.0,
      "score": 16,
      "context": [
        {
          "id": "n0xcj84",
          "author": "DizzyMine4964",
          "body": "Yes, but I am diagnosed autistic. The NHS where I live does nothing for any mental illness - they let people rot and die - so a diagnosis is unlikely.",
          "created_utc": 1751456515.0
        }
      ]
    },
    {
      "id": "n0zgyho",
      "author": "gameofgroans_",
      "body": "I hope you don’t mind me asking, but have you had any benefit with being diagnosed with ARFID? I’m in the UK too and having just been diagnosed with autism I’m unsure on whether to pursue it, was diagnosed with anxiety early on and it was felt like an easy thing to blame for the GP’s and I’m a bit scared of that happening again",
      "created_utc": 1751479846.0,
      "score": 3,
      "context": [
        {
          "id": "n0xcj84",
          "author": "DizzyMine4964",
          "body": "Yes, but I am diagnosed autistic. The NHS where I live does nothing for any mental illness - they let people rot and die - so a diagnosis is unlikely.",
          "created_utc": 1751456515.0
        },
        {
          "id": "n0xrlzj",
          "author": "MaleficentSwan0223",
          "body": "I used to tell the nhs I had arfid and doctors would just nod along because they had no idea what it was. Now I’ve been clinically diagnosed due to severe physical health problems linked to malnutrition and they’ve automatically sent me for an autism assessment. \n\nThe nhs is so backwards for mental health - everything to them is just anxiety. ",
          "created_utc": 1751462112.0
        }
      ]
    },
    {
      "id": "n14slrw",
      "author": "weaktreeiz",
      "body": "I already commented this but not really. \nIt might cause adversity as you won't even be able to access the self-referal CBT therapies and ED services don't deal with ARFID ",
      "created_utc": 1751553052.0,
      "score": 2,
      "context": [
        {
          "id": "n0xcj84",
          "author": "DizzyMine4964",
          "body": "Yes, but I am diagnosed autistic. The NHS where I live does nothing for any mental illness - they let people rot and die - so a diagnosis is unlikely.",
          "created_utc": 1751456515.0
        },
        {
          "id": "n0xrlzj",
          "author": "MaleficentSwan0223",
          "body": "I used to tell the nhs I had arfid and doctors would just nod along because they had no idea what it was. Now I’ve been clinically diagnosed due to severe physical health problems linked to malnutrition and they’ve automatically sent me for an autism assessment. \n\nThe nhs is so backwards for mental health - everything to them is just anxiety. ",
          "created_utc": 1751462112.0
        },
        {
          "id": "n0zgyho",
          "author": "gameofgroans_",
          "body": "I hope you don’t mind me asking, but have you had any benefit with being diagnosed with ARFID? I’m in the UK too and having just been diagnosed with autism I’m unsure on whether to pursue it, was diagnosed with anxiety early on and it was felt like an easy thing to blame for the GP’s and I’m a bit scared of that happening again",
          "created_utc": 1751479846.0
        }
      ]
    },
    {
      "id": "n19mxvb",
      "author": "gameofgroans_",
      "body": "Yeah this is exactly what I was scared of, thank you!",
      "created_utc": 1751612908.0,
      "score": 1,
      "context": [
        {
          "id": "n0xcj84",
          "author": "DizzyMine4964",
          "body": "Yes, but I am diagnosed autistic. The NHS where I live does nothing for any mental illness - they let people rot and die - so a diagnosis is unlikely.",
          "created_utc": 1751456515.0
        },
        {
          "id": "n0xrlzj",
          "author": "MaleficentSwan0223",
          "body": "I used to tell the nhs I had arfid and doctors would just nod along because they had no idea what it was. Now I’ve been clinically diagnosed due to severe physical health problems linked to malnutrition and they’ve automatically sent me for an autism assessment. \n\nThe nhs is so backwards for mental health - everything to them is just anxiety. ",
          "created_utc": 1751462112.0
        },
        {
          "id": "n0zgyho",
          "author": "gameofgroans_",
          "body": "I hope you don’t mind me asking, but have you had any benefit with being diagnosed with ARFID? I’m in the UK too and having just been diagnosed with autism I’m unsure on whether to pursue it, was diagnosed with anxiety early on and it was felt like an easy thing to blame for the GP’s and I’m a bit scared of that happening again",
          "created_utc": 1751479846.0
        },
        {
          "id": "n14slrw",
          "author": "weaktreeiz",
          "body": "I already commented this but not really. \nIt might cause adversity as you won't even be able to access the self-referal CBT therapies and ED services don't deal with ARFID ",
          "created_utc": 1751553052.0
        }
      ]
    }
  ]
}