{
  "id": "1lwt0qx",
  "subreddit": "ARFID",
  "author": "Unaatennista",
  "created_utc": 1752193981.0,
  "title": "How to tell my ARFID friend I don’t want to eat at the same place.",
  "selftext": "Hi I know the title is going to come across as ableist. So basically my friend only eats fast food (McDonald’s, Wendy’s, Taco Bell etc) and gets pissy at me when I don’t want to eat wherever she wants. The thing is I have a health condition where I should not be eating things high in sodium. I don’t see why it’s a big deal for her to get food from one place and me from another. \n\nEdit: Thank you all for the advice. I think I should just be really blunt with her and tell her that food isn’t good for me.",
  "url": "https://www.reddit.com/r/ARFID/comments/1lwt0qx/how_to_tell_my_arfid_friend_i_dont_want_to_eat_at/",
  "score": 96,
  "num_comments": 32,
  "comments": [
    {
      "id": "n2gx07p",
      "author": "bell83",
      "body": "It's not ableist. You're trying to be accommodating for your friend, which is commendable. \n\nPersonally, I would not have a problem with your suggestion. I've done it countless times.",
      "created_utc": 1752196267.0,
      "score": 98,
      "context": []
    },
    {
      "id": "n2h336u",
      "author": "boytoy421",
      "body": "\"hey i have a medical issue that precludes me from eating at places that typically work for you, why don't we both each just get what works for us? and eat separate food together?\"   \ntry that scripting and see if it works. it might be that she's uncomfortable going to places like those without you (as if you're ND and sensory avoidant they can be a bit much) so if you're ok with it offer to go with her but get the food to go so you guys can both eat together but accommodate each of your needs. or try food courts if you have a mall near you",
      "created_utc": 1752198386.0,
      "score": 79,
      "context": []
    },
    {
      "id": "n2h4cl5",
      "author": "BadList",
      "body": "You BOTH deserve food that works for you and your body and your unique health needs. You support her by going to the place where she can get food that works for her, it’s incredibly unkind and unfair of her to not grant you the same. How would it feel for her if you DEMANDED that you both get food from a place that works for you, but not for her? This is exactly what she is doing to you. ",
      "created_utc": 1752198829.0,
      "score": 43,
      "context": []
    },
    {
      "id": "n2haxp1",
      "author": "Feeling-Disaster7180",
      "body": "You’re accomodating her needs so I don’t see why she won’t accomodate yours. IMO I think you should just outright say “I can’t eat at these places because I’m not meant to have so much sodium”",
      "created_utc": 1752201163.0,
      "score": 30,
      "context": []
    },
    {
      "id": "n2gzqu5",
      "author": "bishyfishyriceball",
      "body": "Maybe you guys could do a double dash order? Then you can order from two different places at the same time.",
      "created_utc": 1752197216.0,
      "score": 15,
      "context": []
    },
    {
      "id": "n2gr58u",
      "author": "emptyhellebore",
      "body": "It wouldn’t be a big deal to me.  Do they have a routine that they feel is being ruined or something?  It might be about change of any type more than the food.  It can be hard for some neurodivergent people to change things up.",
      "created_utc": 1752194226.0,
      "score": 27,
      "context": []
    },
    {
      "id": "n2har5c",
      "author": "OkorOvorO",
      "body": "You're free to invite someone out, and they're free to refuse. If she only invites you out to fast food, you're free to refuse. Neither party is obligated to extend further accommodations. Snapping at you isn't some miscommunication due to neurodivergence, it's just rude.",
      "created_utc": 1752201095.0,
      "score": 12,
      "context": []
    },
    {
      "id": "n2gseog",
      "author": "AttentionHelpful3996",
      "body": "Would it be possible for your friend to get something at a place she wants and you get something from where you want and then eat it together? Maybe at one of your houses or the park? You absolutely shouldn’t have to eat somewhere that affects your health.",
      "created_utc": 1752194670.0,
      "score": 19,
      "context": []
    },
    {
      "id": "n2hugjc",
      "author": "girlmosh07",
      "body": "I have ARFID and I would never do this. I feel bad for my fiancé and encourage him to eat at other restaurants whenever possible. \n\nI find a side that I can nibble on and eat something else after. \n\nOr we each get our own takeout from different restaurants and eat at home. \nSometimes it smells too strongly and I have to eat in another room. It’s just life.\n\nYour friend is being an AH by not respecting your needs. \nIf it’s too hard, you guys should eat separately and find another way to spend time together.",
      "created_utc": 1752209105.0,
      "score": 9,
      "context": []
    },
    {
      "id": "n2hyww8",
      "author": "Gaymer7437",
      "body": "My whole life my mom and I have always gotten food from two different places. I love bread and sandwiches and she doesn't so for years she would get a thin crust pizza and bring it to the local sandwich shop to eat with me, we both have ARFID and have different preferences. Sometimes I would bring my sandwich to the pizza place.",
      "created_utc": 1752211191.0,
      "score": 6,
      "context": []
    },
    {
      "id": "n2hwv8s",
      "author": "Same-Speaker7628",
      "body": "I visited my bestie with ARFID in South Korea (we're both American), and she has very limited taste obviously but I did not want to eat American fast food considering where I was. \n\nI'd just dip out on my own! She didn't feel weird and completely understood! Or we'd both grab our respective take out and meet back up! I'm confident your friend will be understanding 🥰",
      "created_utc": 1752210219.0,
      "score": 6,
      "context": []
    },
    {
      "id": "n2islia",
      "author": "Cassio_Taylor",
      "body": "Having ARFID really means needing to compromise. You can’t eat a lot of food but that doesn’t give your friend the right to demand you also eat their food. For me, it has meant eleven years of walking all round town to pick up others food first and separate meals from my family and cooking my own food at an age my parents would cook everyone else’s (not all the time but I tried to take the pressure off)",
      "created_utc": 1752227464.0,
      "score": 3,
      "context": []
    },
    {
      "id": "n2jwowr",
      "author": "boo-raspberry",
      "body": "I have arfid, My family doesnt usually like to eat at the places I like, if anything I find it a little embarrassing that they have to go out of their way to accommodate me. But getting mad at you for not wanting to eat what she wants to eat is super unreasonable. hate that.",
      "created_utc": 1752243054.0,
      "score": 3,
      "context": []
    },
    {
      "id": "n2i6x7v",
      "author": "SituationSad4304",
      "body": "Not to be a dick, but many many sit down restaurants will serve you a plain hamburger, French fries, or an up charge on a kids meal of chicken nuggets. \n\nI grew up with ARFID but didn’t eat fast food until I was like 15. Hell I only tried Taco Bell like two years ago. I had the reverse experience of eating salad at McDonalds because I’d never had French fries before.",
      "created_utc": 1752215247.0,
      "score": 3,
      "context": []
    },
    {
      "id": "n2k9kmp",
      "author": "DisablednDisordered",
      "body": "Fyi part of it might be insecurity. You saying that you don't want to always eat at the same fast food restaurants might be coming off to her as you judging her for doing so or she might be upset with herself for not having the \"willpower\" to eat \"healthier\". I've definitely been an asshole to people for similar reasons and I just eventually had to learn that people having different preferences isn't about me.",
      "created_utc": 1752246753.0,
      "score": 3,
      "context": []
    },
    {
      "id": "n2o8x83",
      "author": "TinyAgent0",
      "body": "you both deserve food you can enjoy !!! u are not being ableist at all",
      "created_utc": 1752292805.0,
      "score": 3,
      "context": []
    },
    {
      "id": "n3f7igp",
      "author": "Noodles_uses_reddit",
      "body": "As someone with ARFID, that is no excuse to be rude to someone with a medical condition/issue that limits your sodium intake just because you won’t eat the same food as them. \nIf the smell/sight factor is hard for them, you can offer a video-call where they don’t need to see/smell the food, as I often cannot be around people who use condiments due to smell/sight factor, but if so they should state that and continue to work with you for a solution. \nI hope you figure out what to do.",
      "created_utc": 1752661638.0,
      "score": 2,
      "context": []
    },
    {
      "id": "n2h3ltd",
      "author": "Unaatennista",
      "body": "This is great advice thank you 💗",
      "created_utc": 1752198567.0,
      "score": 16,
      "context": [
        {
          "id": "n2h336u",
          "author": "boytoy421",
          "body": "\"hey i have a medical issue that precludes me from eating at places that typically work for you, why don't we both each just get what works for us? and eat separate food together?\"   \ntry that scripting and see if it works. it might be that she's uncomfortable going to places like those without you (as if you're ND and sensory avoidant they can be a bit much) so if you're ok with it offer to go with her but get the food to go so you guys can both eat together but accommodate each of your needs. or try food courts if you have a mall near you",
          "created_utc": 1752198386.0
        }
      ]
    },
    {
      "id": "n2ht51q",
      "author": "Unaatennista",
      "body": "You’re completely right. I would never do that though I would call restaurants before hand and would make sure they would have something she would eat even if it wasn’t on the menu when we went out with our other friends and never told her I did. I would be like I bet they can do pasta with butter or grilled cheese and she would just order it.",
      "created_utc": 1752208516.0,
      "score": 14,
      "context": [
        {
          "id": "n2h4cl5",
          "author": "BadList",
          "body": "You BOTH deserve food that works for you and your body and your unique health needs. You support her by going to the place where she can get food that works for her, it’s incredibly unkind and unfair of her to not grant you the same. How would it feel for her if you DEMANDED that you both get food from a place that works for you, but not for her? This is exactly what she is doing to you. ",
          "created_utc": 1752198829.0
        }
      ]
    },
    {
      "id": "n2hu6u3",
      "author": "Unaatennista",
      "body": "Yeah I really should because this happens mostly in Manhattan where I could walk a block and get something else but she gets so annoyed.",
      "created_utc": 1752208984.0,
      "score": 12,
      "context": [
        {
          "id": "n2haxp1",
          "author": "Feeling-Disaster7180",
          "body": "You’re accomodating her needs so I don’t see why she won’t accomodate yours. IMO I think you should just outright say “I can’t eat at these places because I’m not meant to have so much sodium”",
          "created_utc": 1752201163.0
        }
      ]
    },
    {
      "id": "n2hucm5",
      "author": "Unaatennista",
      "body": "We’re normally in Manhattan when this happens I could literally walk a couple blocks but she gets really annoyed.",
      "created_utc": 1752209056.0,
      "score": 3,
      "context": [
        {
          "id": "n2gzqu5",
          "author": "bishyfishyriceball",
          "body": "Maybe you guys could do a double dash order? Then you can order from two different places at the same time.",
          "created_utc": 1752197216.0
        }
      ]
    },
    {
      "id": "n2gsy8y",
      "author": "Unaatennista",
      "body": "She is neurodivergent but is only assertive with the food when it’s the two of us and gets only annoyed when I don’t want to eat where she does (I do think she feels comfortable unmasking around me though).",
      "created_utc": 1752194861.0,
      "score": 16,
      "context": [
        {
          "id": "n2gr58u",
          "author": "emptyhellebore",
          "body": "It wouldn’t be a big deal to me.  Do they have a routine that they feel is being ruined or something?  It might be about change of any type more than the food.  It can be hard for some neurodivergent people to change things up.",
          "created_utc": 1752194226.0
        }
      ]
    },
    {
      "id": "n2htzku",
      "author": "Unaatennista",
      "body": "This mainly happens when we’re in Manhattan so I feel like it makes it worse. I could literally walk ten feet and get something else.",
      "created_utc": 1752208895.0,
      "score": 3,
      "context": [
        {
          "id": "n2har5c",
          "author": "OkorOvorO",
          "body": "You're free to invite someone out, and they're free to refuse. If she only invites you out to fast food, you're free to refuse. Neither party is obligated to extend further accommodations. Snapping at you isn't some miscommunication due to neurodivergence, it's just rude.",
          "created_utc": 1752201095.0
        }
      ]
    },
    {
      "id": "n2gtymi",
      "author": "Unaatennista",
      "body": "That’s exactly what I want to do! She keeps getting mad when I suggest it so I’m torn. We used to go to restaurants together and could order something we both would eat but she doesn’t like spending money on them anymore which I totally get. Like McDonald’s isn’t going to care if I bring SweetGreen (if they do I’ll buy a water.)",
      "created_utc": 1752195214.0,
      "score": 19,
      "context": [
        {
          "id": "n2gseog",
          "author": "AttentionHelpful3996",
          "body": "Would it be possible for your friend to get something at a place she wants and you get something from where you want and then eat it together? Maybe at one of your houses or the park? You absolutely shouldn’t have to eat somewhere that affects your health.",
          "created_utc": 1752194670.0
        }
      ]
    },
    {
      "id": "n2if77g",
      "author": "two-of-me",
      "body": "From the comments it sounds like their friend is not understanding though and is getting upset whenever OP asks to go somewhere else. She becomes irritated and irate when she doesn’t get to go to one of her preferred fast food places, which isn’t at all fair to OP. A vast majority of us are understanding that *we* have the problem, but it’s incredibly rude to insist that we only eat at fast food places, in nyc no less where there is somewhere we can all find something to eat within a block or two.",
      "created_utc": 1752219784.0,
      "score": 4,
      "context": [
        {
          "id": "n2hwv8s",
          "author": "Same-Speaker7628",
          "body": "I visited my bestie with ARFID in South Korea (we're both American), and she has very limited taste obviously but I did not want to eat American fast food considering where I was. \n\nI'd just dip out on my own! She didn't feel weird and completely understood! Or we'd both grab our respective take out and meet back up! I'm confident your friend will be understanding 🥰",
          "created_utc": 1752210219.0
        }
      ]
    },
    {
      "id": "n2idj3t",
      "author": "two-of-me",
      "body": "I’m close to nyc and there is definitely something I can eat within a block or two in any given direction. If you were in a rural area where you’d have to drive for half an hour to get to another restaurant I would kind of understand why she would feel like there wasn’t another option for her (although it’s still not ok that she isn’t even willing to accommodate YOUR health needs the way you have been accommodating hers) but most restaurants these days have their menus online and she can find a restaurant that serves something she could eat. But in the city? No. \n\nYou’ve been very kind by prioritizing her needs but your needs are important too. Fast food is VERY high in sodium so this isn’t just you getting tired of going to the same places all the time. This is literally something your doctors have told you is mandatory for your health condition.",
      "created_utc": 1752218838.0,
      "score": 8,
      "context": [
        {
          "id": "n2haxp1",
          "author": "Feeling-Disaster7180",
          "body": "You’re accomodating her needs so I don’t see why she won’t accomodate yours. IMO I think you should just outright say “I can’t eat at these places because I’m not meant to have so much sodium”",
          "created_utc": 1752201163.0
        },
        {
          "id": "n2hu6u3",
          "author": "Unaatennista",
          "body": "Yeah I really should because this happens mostly in Manhattan where I could walk a block and get something else but she gets so annoyed.",
          "created_utc": 1752208984.0
        }
      ]
    },
    {
      "id": "n2iedx5",
      "author": "two-of-me",
      "body": "It sounds like she’s so used to people caving in and going wherever she wants that she’s not used to hearing “no.” Let her know that you understand it might be frustrating for her, but it’s frustrating for you too because your diet is also limited, just like hers but in a different way. It seems like this has been going on for quite some time and she is so used to getting her way that the idea that anyone would take away that routine is upsetting. You are both adults (I’m assuming) so she needs to act like one. I understand she is ND but a lot of us with ARFID are (it’s common with people who have sensory issues, so it’s no surprise when we have food issues too) so the responses you’re getting here are all from people who do truly understand where she’s coming from and we are all STILL on your side here. Let that sink in.",
      "created_utc": 1752219322.0,
      "score": 8,
      "context": [
        {
          "id": "n2gzqu5",
          "author": "bishyfishyriceball",
          "body": "Maybe you guys could do a double dash order? Then you can order from two different places at the same time.",
          "created_utc": 1752197216.0
        },
        {
          "id": "n2hucm5",
          "author": "Unaatennista",
          "body": "We’re normally in Manhattan when this happens I could literally walk a couple blocks but she gets really annoyed.",
          "created_utc": 1752209056.0
        }
      ]
    },
    {
      "id": "n2hvedd",
      "author": "OkorOvorO",
      "body": "I'm not really sure how the conversation is going down, but insisting every time is impolite, neurodivergence aside. Leave them while you eat elsewhere. You asked them to join, but they declined. That's as far as you need to go.",
      "created_utc": 1752209535.0,
      "score": 8,
      "context": [
        {
          "id": "n2har5c",
          "author": "OkorOvorO",
          "body": "You're free to invite someone out, and they're free to refuse. If she only invites you out to fast food, you're free to refuse. Neither party is obligated to extend further accommodations. Snapping at you isn't some miscommunication due to neurodivergence, it's just rude.",
          "created_utc": 1752201095.0
        },
        {
          "id": "n2htzku",
          "author": "Unaatennista",
          "body": "This mainly happens when we’re in Manhattan so I feel like it makes it worse. I could literally walk ten feet and get something else.",
          "created_utc": 1752208895.0
        }
      ]
    },
    {
      "id": "n2h2gnm",
      "author": "CalmGur5301",
      "body": "I have ARFID and my boyfriend and I do this all the time--getting food from different places and then eating it together. This is a reasonable compromise, so I don't understand why this would make her mad.",
      "created_utc": 1752198167.0,
      "score": 16,
      "context": [
        {
          "id": "n2gseog",
          "author": "AttentionHelpful3996",
          "body": "Would it be possible for your friend to get something at a place she wants and you get something from where you want and then eat it together? Maybe at one of your houses or the park? You absolutely shouldn’t have to eat somewhere that affects your health.",
          "created_utc": 1752194670.0
        },
        {
          "id": "n2gtymi",
          "author": "Unaatennista",
          "body": "That’s exactly what I want to do! She keeps getting mad when I suggest it so I’m torn. We used to go to restaurants together and could order something we both would eat but she doesn’t like spending money on them anymore which I totally get. Like McDonald’s isn’t going to care if I bring SweetGreen (if they do I’ll buy a water.)",
          "created_utc": 1752195214.0
        }
      ]
    },
    {
      "id": "n2gv42o",
      "author": "AttentionHelpful3996",
      "body": "Haha I skipped over the last part of your post where you said that, my bad!, I would definitely not be ok with brining outside food into any restaurant. But a neutral place totally fine. If she can’t allow you to eat what you want and still allow her to eat what she wants, that’s too controlling for me. \n\nHave you tried offering to pay for the meal from time to time if you want to go to a sit down restaurant? This sounds more like a finance/immaturity issue vs ARFID since you used to go different places and she doesn’t want to pay that much anymore.",
      "created_utc": 1752195611.0,
      "score": 11,
      "context": [
        {
          "id": "n2gseog",
          "author": "AttentionHelpful3996",
          "body": "Would it be possible for your friend to get something at a place she wants and you get something from where you want and then eat it together? Maybe at one of your houses or the park? You absolutely shouldn’t have to eat somewhere that affects your health.",
          "created_utc": 1752194670.0
        },
        {
          "id": "n2gtymi",
          "author": "Unaatennista",
          "body": "That’s exactly what I want to do! She keeps getting mad when I suggest it so I’m torn. We used to go to restaurants together and could order something we both would eat but she doesn’t like spending money on them anymore which I totally get. Like McDonald’s isn’t going to care if I bring SweetGreen (if they do I’ll buy a water.)",
          "created_utc": 1752195214.0
        }
      ]
    },
    {
      "id": "n2hw9i0",
      "author": "Unaatennista",
      "body": "That’s great advice thanks! Pretty much her personality changes if I don’t go where she wants-it’s frustrating because she is my friend.",
      "created_utc": 1752209933.0,
      "score": 4,
      "context": [
        {
          "id": "n2har5c",
          "author": "OkorOvorO",
          "body": "You're free to invite someone out, and they're free to refuse. If she only invites you out to fast food, you're free to refuse. Neither party is obligated to extend further accommodations. Snapping at you isn't some miscommunication due to neurodivergence, it's just rude.",
          "created_utc": 1752201095.0
        },
        {
          "id": "n2htzku",
          "author": "Unaatennista",
          "body": "This mainly happens when we’re in Manhattan so I feel like it makes it worse. I could literally walk ten feet and get something else.",
          "created_utc": 1752208895.0
        },
        {
          "id": "n2hvedd",
          "author": "OkorOvorO",
          "body": "I'm not really sure how the conversation is going down, but insisting every time is impolite, neurodivergence aside. Leave them while you eat elsewhere. You asked them to join, but they declined. That's as far as you need to go.",
          "created_utc": 1752209535.0
        }
      ]
    },
    {
      "id": "n2hi3uj",
      "author": "Unaatennista",
      "body": "This is a whole other story but we generally went to restaurants because of my sister (I would always call and make sure they had something my friend would eat even if it wasn’t on the menu) but my sister became really ill (she is doing better) and then it was just the two of us and I asked my friend where she likes to eat and basically she gets mad at me now if I want to eat anywhere else than she does (which is Wendy’s, McDonald’s, or Taco Bell).",
      "created_utc": 1752203900.0,
      "score": 9,
      "context": [
        {
          "id": "n2gseog",
          "author": "AttentionHelpful3996",
          "body": "Would it be possible for your friend to get something at a place she wants and you get something from where you want and then eat it together? Maybe at one of your houses or the park? You absolutely shouldn’t have to eat somewhere that affects your health.",
          "created_utc": 1752194670.0
        },
        {
          "id": "n2gtymi",
          "author": "Unaatennista",
          "body": "That’s exactly what I want to do! She keeps getting mad when I suggest it so I’m torn. We used to go to restaurants together and could order something we both would eat but she doesn’t like spending money on them anymore which I totally get. Like McDonald’s isn’t going to care if I bring SweetGreen (if they do I’ll buy a water.)",
          "created_utc": 1752195214.0
        },
        {
          "id": "n2gv42o",
          "author": "AttentionHelpful3996",
          "body": "Haha I skipped over the last part of your post where you said that, my bad!, I would definitely not be ok with brining outside food into any restaurant. But a neutral place totally fine. If she can’t allow you to eat what you want and still allow her to eat what she wants, that’s too controlling for me. \n\nHave you tried offering to pay for the meal from time to time if you want to go to a sit down restaurant? This sounds more like a finance/immaturity issue vs ARFID since you used to go different places and she doesn’t want to pay that much anymore.",
          "created_utc": 1752195611.0
        }
      ]
    }
  ]
}