{
  "id": "1m5qfjx",
  "subreddit": "ARFID",
  "author": "barzfrommarzz",
  "created_utc": 1753121611.0,
  "title": "Gonna scream and cry if I see one more comment dismissing ARFID as a “privilege” or “first world problem”",
  "selftext": "Recently on tiktok, arfid content has been flooded with a lot of hate. It’s not the usual hate though (like telling us to just stop being picky) people are calling us all privileged and saying “poor people don’t have this”. And sure, I can somewhat understand that theoretically, ARFID can maybe be somewhat of a privilege for a select few (like being able to have access to the food that’s safe), but I don’t think it’s a good one. I don’t understand what privilege I get from starving and being malnourished, My body probably has had irreversible damage done to it that could lead to health issues in the future, but sure i’m living the good life. I feel like those factors outweigh the possible good that I struggle to see coming from arfid. It’s also just rude to poor people who do have arfid. If their lucky, their safe foods are cheap and protein rich, if they aren’t, to be blunt they probably didn’t make it far and that’s sad, so idk why people are comfortable using them as a gotcha moment against us. It’s also funny because i’ve never seen people call other EDS privileged (rightfully so) so why us??\n\n(also this is an edit, Im not trying to say that there can’t be any privilege people with arfid can have nor am I trying to deny any exists, im upset that people are using this in bad faith to dismiss a serious ED)",
  "url": "https://www.reddit.com/r/ARFID/comments/1m5qfjx/gonna_scream_and_cry_if_i_see_one_more_comment/",
  "score": 158,
  "num_comments": 41,
  "comments": [
    {
      "id": "n4dz52m",
      "author": "Big-Formal408",
      "body": "I've always liked this perspective for ARFID that really displays that it's NOT *just being picky*: If a picky person is starving to death and served something they don't like they'll probably eat the food eventually. If someone with ARFID is served an unsafe food many of them would still not eat it even if it meant they would die of starvation. \n\n\nThat's obviously not the case or severity for everyone with ARFID but it's a good look into how debilitating the symptoms can be. Because it's not a matter of privilege, it's a very real and genuine mental illness and eating disorder. Tbh most of the people making those comments are probably children who don't know anything about how nuanced the \"real world\" actually is.",
      "created_utc": 1753123203.0,
      "score": 78,
      "context": []
    },
    {
      "id": "n4dv5mp",
      "author": "MaleficentSwan0223",
      "body": "It makes me laugh because I was poor growing up. It didn’t mean I didn’t have arfid, I just struggled with food availability so only ate 4 times a week. When I could afford to eat daily I remember only affording 2 meals a week and the rest of the time it was a pack of biscuits a day which cost of 30p a day. ",
      "created_utc": 1753122078.0,
      "score": 86,
      "context": []
    },
    {
      "id": "n4dvp98",
      "author": "crashdavis87",
      "body": "Ignorance is pretty powerful and humans love judging other humans. It will be our downfall. \n\nOh, and delete TikTok,. You'll be happier.",
      "created_utc": 1753122233.0,
      "score": 28,
      "context": []
    },
    {
      "id": "n4e23qi",
      "author": "nerd-boy-03",
      "body": "Bro at my poorest (disabled, no job, mom sent me money when she could) id just eat 1 box of pasta roni shells and white cheddar every day, like $1-$2 per box. Thats such a wild take i would NOT consider this diagnosis a privilege",
      "created_utc": 1753124040.0,
      "score": 21,
      "context": []
    },
    {
      "id": "n4e4xyv",
      "author": "Breakingchunk57",
      "body": "Honestly, I think growing up poor made my ARFID worse. Parents couldn't afford to gamble what meals I may like or try. I was stuck eating the same thing with no new exposure to foods until my 20s. Annoying that people gatekeep a problem like this :(",
      "created_utc": 1753124843.0,
      "score": 22,
      "context": []
    },
    {
      "id": "n4dwo11",
      "author": "texanlady1",
      "body": "I grew up poor and have this. My parents still think I’m a “picky eater.” I often went without eating growing up.",
      "created_utc": 1753122505.0,
      "score": 19,
      "context": []
    },
    {
      "id": "n4e2job",
      "author": "Original_Cable6719",
      "body": "I’m still poor.",
      "created_utc": 1753124165.0,
      "score": 17,
      "context": []
    },
    {
      "id": "n4e59b5",
      "author": "Charmaine_kakashi11",
      "body": "I grew up poor with ARFID (didn't know what it was then). I'm still working class but my partner and I manage to afford what foods we want so we're not as poor as we both were growing up. \n\nI can tell you I struggle now, I'd struggle if I had more money tomorrow and I struggled then. It's just I struggled a LOT more then. My mum never cared about my struggles with food she always saw it ase being \"bad\" and annoying on purpose. There's a few main meals I had growing up that are to this day some of my few safe meals. Spaghetti Bolognese only with dolmio sauce. Chicken curry only with the homepride curry sauce etc. I used to beg my mum to get the smooth dolmio sauce but that was seen as a luxury because it was like 50p more expensive. So my mum would get like Asda's own make sauce with all the bits. I'd sit and pick out every single piece of onion and tomato before I ate. My dinner would be cold. And I wouldn't like it. I'd try to eat a mouthful or 2 and give up. I'd go hungry. \n\nSadly my safest foods are sweets, chocolate and fizzy drinks. I always know what I'm getting. They taste nice. They're always the same etc. Well the more I struggled with meals the more I'd sneak biscuits and whatnot (I'd still get in trouble for that). I think being poor with ARFID pushed me to have more sweets. On my break at work and don't know what to have? Scared of what they're serving in the canteen? Grab a mars bar and can of coke. Honestly sweets became like rations for me. Easy to store, easy to carry, easy to eat and safe. \n\nThe irony is now I still struggle immensely. But now I can eat proper meals. My favourite thing to eat for dinner and probably in general is chicken, rice and spinach. I can have that every day with plenty of seasonings. Or curry. Or wraps. I can have spaghetti Bolognese with the smooth sauce I like. I can have homepride curry and sieve out the bits. \n\nIf I was on a desert island tomorrow I wouldn't all of a sudden not have ARFID. I'd struggle. But I'd hopefully find something I can eat and just eat that.\n\nI lived in Japan for a year and I was terrified I wouldn't be able to eat anything. At first I didn't eat. Again I found chocolate in the convenience stores and had that. But I found things I knew I liked. They had McDonald's, dominos, even TGI Fridays where I was. But I also found at uni I liked the spaghetti Bolognese they made. Plus just rice and curry sauce. Slowly I found more foods I liked. Udon curry noodles. Ramen just not eating all the bits. \n\nThe people who say these things about ARFID no doubt don't have it. And they've probably never lived around someone who has it. ARFID has existed forever. Just people would see those who only ate X as just a bit different back in the day.",
      "created_utc": 1753124932.0,
      "score": 10,
      "context": []
    },
    {
      "id": "n4e2r0e",
      "author": "Angelangepange",
      "body": "As usual they are just trying to implying that ours is a choice.    \nIt's the classic \"if you were actually starving you would eat anything\" or when they try to prove someone is not actually poor because they don't accept a specific food or other kind of \"aid\" 🤦🏻‍♀️      \n          \nBack in the day they used to say this about allergies. As if a poor person should get sick or hurt themselves because otherwise it's not real poverty if you don't accept to eat dirt or something, if you don't accept all kinds of humiliation it means you are not actually in need.    \n    \nIt's like ableism and classism had a baby.",
      "created_utc": 1753124223.0,
      "score": 8,
      "context": []
    },
    {
      "id": "n4e3hjj",
      "author": "_Blue_Raspberries_",
      "body": "Growing up, I was very poor and had limited food availability. I think that actually played a part in some of my ARFID issues. I always had issues with certain food textures, though my issues are far less than others with ARFID. My issues don't limit most foods, I'm fine with most vegetables and fruits... Its mostly just certain mushy or grainy textures, and I think that can be attributed to my autism.\n\nBut my biggest issue as an adult is contamination fear. As a child, if I did get food at home, it was often spoiled, or close to spoiled. Even at school, there have been times I was given spoiled food. As an adult, I have a lot of fear around food spoiling.",
      "created_utc": 1753124433.0,
      "score": 9,
      "context": []
    },
    {
      "id": "n4f2q6t",
      "author": "Lyrical_starlet",
      "body": "As someone from a third world country who might probably have it, I think it’s really insensitive for people to do a comment like that. Disorders do not choose people because of the place they are from, their resources or their economic status. The thing is that unfortunately, in places like my country things like this are often not seen as real problems, they are dismissed, which make getting help or even information extremely hard. Just because they don’t hear about it, it doesn’t mean it doesn’t exist.",
      "created_utc": 1753134651.0,
      "score": 6,
      "context": []
    },
    {
      "id": "n4e6ljh",
      "author": "StrawbraryLiberry",
      "body": "I have seen people call anorexia and ARFID first world problems. \n\nThe shitty part is that I know the bullies saying this are completely incorrect, and stress actually can make eating disorders MUCH worse. \n\nSo yeah, surely people are struggling with EDs in the worst situations, and a lot of them are probably unable to access any help or get diagnosed, and I bet more of them die.",
      "created_utc": 1753125309.0,
      "score": 4,
      "context": []
    },
    {
      "id": "n4e86wf",
      "author": "Importance_Dizzy",
      "body": "One of the symptoms/criteria of ARFID is aversion to food based on food trauma or contamination fears. I grew up very poor: my parents had 4 kids, and they were both on disability for serious conditions. I was the oldest, so often was expected to share even when that was impossible. Between food scarcity, and actual contamination issues (I once made tea with sugar that had been infested with sugar ants), I was already in a bad place. We often could only afford fruit and vegetables that were overripe or about to go bad, because they would be on clearance. I would rather die than eat an overripe banana now. As a kid, I couldn’t understand why so many of the things I ate were gross or would give me some extreme reaction. I’m working class now, and my ARFID has only gotten worse. Classism is pure and simple bullshit.",
      "created_utc": 1753125763.0,
      "score": 4,
      "context": []
    },
    {
      "id": "n4f8eti",
      "author": "CrazyCatLushie",
      "body": "I’m diabetic. I could literally DIE if I go too long without eating, but guess what doesn’t care? ARFID. \n\nI regularly get to the point where I’m trembling, sweating like crazy, and getting angrier and more unreasonable by the minute due to hypoglycaemia and I still can’t make myself eat. I have to take glucose tablets, drink some juice, or let a candy dissolve in my mouth to get myself back to a safe glucose level.\n\nHypoglycaemia is a medical emergency. I fully understand the threat to my life that it poses and how important it is to avoid at all costs, but ARFID doesn’t respond to logic because *eating disorders aren’t logical.* That’s what makes them disorders!",
      "created_utc": 1753136484.0,
      "score": 4,
      "context": []
    },
    {
      "id": "n4f9ncg",
      "author": "acnerd5",
      "body": "Im broke af now and I legit just don't eat for DAYS sometimes because we already bought groceries and now none of them are safe. Whoops I guess im too privileged though and I dont feel awful seeing things rot in my fridge when I cant afford to literally see my money rot",
      "created_utc": 1753136890.0,
      "score": 4,
      "context": []
    },
    {
      "id": "n4e2pqr",
      "author": "magnasollertia",
      "body": "l o l sure… mine got worse when i moved out of my parents house. i have no income so i was even more limited in the things i could buy, and finding safe food among those options is difficult when my fear foods are things that are highly processed, and it’s hard for me to prepare my own food. there’s also a limited range of fruit/veg that i can eat, so cheap produce is pretty much out. there’s also the fear/guilt of using up money that contributes to restricting the actual amount of food i eat. but yeah, poor people don’t have arfid 🙄",
      "created_utc": 1753124212.0,
      "score": 3,
      "context": []
    },
    {
      "id": "n4emxji",
      "author": "TheAnxiousAutistic58",
      "body": "I'm poor and I have ARFID. I'm lucky enough to be on SNAP (food stamps) and SSDI (a monthly assistance program for disabled people), otherwise, I wouldn't be able to afford food at all. But I guess that's what those haters want: for us poor people with eating disorders to just die slowly. They're sick in the head; no one in their right mind would want others to die, especially from an eating disorder. I feel glad that I don't have a TikTok account. Seems like they're more trouble than they're worth, at least judging by the comments.",
      "created_utc": 1753129980.0,
      "score": 3,
      "context": []
    },
    {
      "id": "n4ewj69",
      "author": "BasOutten",
      "body": "...does arfid exist in developing countries? That's an interesting question actually.",
      "created_utc": 1753132763.0,
      "score": 2,
      "context": []
    },
    {
      "id": "n4eygva",
      "author": "GotTheLife3",
      "body": "I’d say, even if it were related to some “privileged” lifestyle that doesn’t make it any less valid of a problem. I mean, I can see when people say “if you were struggling like this you wouldn’t have time to be depressed”. I mean, maybe? But that’s probably because you have extreme stress and anxiety levels and that’s not anywhere healthier, and also, it’s very simplistic saying poor people are happier because they don’t need that much stuff to thrive. That sounds a little bit insulting imo. \n\nI think ARFID might be related to stuff like the environment you live in and that might be related to privilege, or the opposite. I think growing up eating instant noodles because of scarcity could make processed food your safe food. But ARFID goes way beyond just being picky. What your brain somehow decided that it’s safe or not is not just how expensive the food is.",
      "created_utc": 1753133349.0,
      "score": 2,
      "context": []
    },
    {
      "id": "n4ezbw4",
      "author": "Pretty_Appointment82",
      "body": "I don't live our life. That's why. If they did, they wouldn't be saying that. It's not easy.",
      "created_utc": 1753133616.0,
      "score": 2,
      "context": []
    },
    {
      "id": "n4f2vjt",
      "author": "Desert_Fairy",
      "body": "This condition exists in all walks of life, the privilege is if you were born with the means to survive until adulthood with this condition. \n\nThe poorest people who truly have no other options, probably just died from malnutrition.",
      "created_utc": 1753134698.0,
      "score": 2,
      "context": []
    },
    {
      "id": "n4f3kk0",
      "author": "Maxusam",
      "body": "Being poor caused my and my sisters ARFID. We didn’t have choices as kids in my house, everything we ate was microwave meals and ramen. It put me off food altogether. I’m still poor - I still eat nothing but ramen and bread. These people are idiots.",
      "created_utc": 1753134918.0,
      "score": 2,
      "context": []
    },
    {
      "id": "n4fabzs",
      "author": "gameofgroans_",
      "body": "I don’t wanna come across as insensitive here but growing up I would say my family wasn’t rich but I wasn’t aware of money problems. I struggle with so many foods, especially wet foods or foods with smells. My mum always used to force me (and sometimes tbh still does) to eat everything because ‘there are starving kids who would love that’. So I would force myself to eat it and then be sick. I was often then called pathetic etc. \n\nI’m in my 30’s now and still have such a guilt problem with food. Eating makes me feel so nervous because I feel like I’m going to be forced somethjng I don’t want. Like food isn’t enjoyable for me and I’m only now coming to accept that I need to almost look after my ARFID to look after me. Trying to develop a healthy relationship with food. \n\nWhat I’m trying to say is not only are comments like that bs, but trying to imply those attitudes on people with ARFID (and other EDs) is so unhelpful it can make everything worse. You’re right you wouldn’t (or shouldn’t) say that about someone with bulimia, so why is it okay to say it to ARFID. I’m sorry this probably makes no sense but I agree.",
      "created_utc": 1753137113.0,
      "score": 2,
      "context": []
    },
    {
      "id": "n4fhwkg",
      "author": "drosekelley",
      "body": "People want to believe it is a choice so they don’t have to worry that someone they love could be impacted by it. Things outside of one’s control are scary.",
      "created_utc": 1753139589.0,
      "score": 2,
      "context": []
    },
    {
      "id": "n4fouid",
      "author": "amh8011",
      "body": "There were times I lived off of potatoes, oats, and milk like some irish peasant. Sometimes I’d have bread and crackers or mcdonalds. Yes, I am privileged enough to be american and have access to potatoes, oats, milk, bread, crackers, and mcdonald’s but it’s not like I was eating anything particularly expensive.\n\nAlso, there’s usually bland, carbohydrates and starches available even in less privileged places. There’s some sort of plain bread thing and some sort of cooked grain like rice or oats. And those things are usually more accessible than meat and produce.\n\nObviously not all people with ARFID like bland carbohydrates but you can be poor and still have ARFID. In severe cases you might have failure to thrive but it’s possible to have ARFID and not live off of mac n cheese and chicken nuggets.\n\nAnd ARFID in different cultures looks very different. What is considered a safe food for one person might not be a common safe food for a person from a different culture. I know someone whose safe foods are Indian foods because she’s half Indian and that’s what she ate growing up. There are very few Indian foods I will eat. Indian foods are not my safe foods.",
      "created_utc": 1753141872.0,
      "score": 2,
      "context": []
    },
    {
      "id": "n4fss32",
      "author": "MegaBabz0806",
      "body": "Yup I grew up poor and I have ARFID. Still struggle in the crap economy, and my daughter has ARFID…",
      "created_utc": 1753143220.0,
      "score": 2,
      "context": []
    },
    {
      "id": "n4fv3ak",
      "author": "bipolarat",
      "body": "I’m apart of the lower class of America, I’ve struggled with feeding myself financially on and off all of my adult life, I still won’t eat what we have in the pantry/fridge if that’s all we have if it’s a trigger for me.",
      "created_utc": 1753144028.0,
      "score": 2,
      "context": []
    },
    {
      "id": "n4gxpsb",
      "author": "No-Ebb4307",
      "body": "People call other eating disordered privileged and first world problem as well, particularly anorexia and orthorexia... :/",
      "created_utc": 1753158544.0,
      "score": 2,
      "context": []
    },
    {
      "id": "n4h5y7q",
      "author": "EeveeWizard",
      "body": "I've seen similar comments about food allergies or medical allergies being \"privilege based\", so truly, these are people that don't understand how privilege is multilayered in each individual or how the human brain can just... flip the fuck out and not behave in expected ways.",
      "created_utc": 1753162470.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n4iqsth",
      "author": "angel_of_satan",
      "body": "I say all the time how LUCKY i was to be born in the time and in the place that i was. When i was a baby, i REFUSED bottled breast milk. My parents didn't know at the time, but a chemical reaction happens when you don't scorch the milk first (heat it up to a certain temperature before putting it in the freezer) that slightly changes the way it tastes. I, as a literal days old infant, would have starved to death if it were not for formula. \n\nMaybe in some way it's a privilege like i said to be born in the time and place that I was, but thats not the way these people mean it, they mean that we are snobs and \"just picky\" and they really think we would eat normal if it was life or death.\n\nWhen I was seven or eight my parents DID starve me, for an entire week, trying to get me to eat normal. And when we were poor when I was a kid, I would simply go hungry for meals at a time because I would literally throw up if i put a non-safe food in my mouth. To this day I would literally just starve to death if I didn't have access to my safe foods.\n\nThe blatant misunderstanding and even CONTEMPT towards all 'picky eaters', especially when it literally does not effect other people in any way, is truly exhausting, and a main factor as to why I don't tell people about my ARFID unless absolutely necessary. It's literally worse than trying to explain my autism to people who think all autistic people are nonverbal and whatnot.",
      "created_utc": 1753190199.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n4isbjj",
      "author": "uterus1991",
      "body": "Tiktok is so dumb bro, mental health problems are not a privilege (affecting a privileged person =/= a privilege) in any circumstances, period.",
      "created_utc": 1753190699.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n4jgphk",
      "author": "throw0OO0away",
      "body": "Ya. This is a stupid take and I don’t get it either. \n\nMy ARFID resulted from orphanage neglect, failure to obtain medical attention, and autism. The orphanage I lived in was not privileged by any means. They were involved in illegal activity. I did not get proper medical care (I have cleft lip and palate) beyond the bare minimum, which set me back even more. Other children suffered in addition to me. Upon adoption, I had like 3-5 safe foods, one of them being baby formula all the way to age 3. \n\nARFID isn’t a “privilege”.",
      "created_utc": 1753197824.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n4e114z",
      "author": "ageckonamedelaine",
      "body": "Exactly a picky eater can eat food they don't like, if I eat it I get sick, have to spit it out or can't even touch it. You can never force me to touch, let alone eat a banana, even with a gun against my head. When there is no safe food I just don't eat, my (or my parents) economic situation is irrelevant. Maybe when I am starving there are some things I might eat maybe but most are a hell no, i would rather starve, unlike a picky eater",
      "created_utc": 1753123739.0,
      "score": 25,
      "context": [
        {
          "id": "n4dz52m",
          "author": "Big-Formal408",
          "body": "I've always liked this perspective for ARFID that really displays that it's NOT *just being picky*: If a picky person is starving to death and served something they don't like they'll probably eat the food eventually. If someone with ARFID is served an unsafe food many of them would still not eat it even if it meant they would die of starvation. \n\n\nThat's obviously not the case or severity for everyone with ARFID but it's a good look into how debilitating the symptoms can be. Because it's not a matter of privilege, it's a very real and genuine mental illness and eating disorder. Tbh most of the people making those comments are probably children who don't know anything about how nuanced the \"real world\" actually is.",
          "created_utc": 1753123203.0
        }
      ]
    },
    {
      "id": "n4dwdf6",
      "author": "barzfrommarzz",
      "body": "Thank you for sharing your experience. Unfortunately ARFID doesn’t discriminate. I hope you are in a better place now ^^",
      "created_utc": 1753122423.0,
      "score": 26,
      "context": [
        {
          "id": "n4dv5mp",
          "author": "MaleficentSwan0223",
          "body": "It makes me laugh because I was poor growing up. It didn’t mean I didn’t have arfid, I just struggled with food availability so only ate 4 times a week. When I could afford to eat daily I remember only affording 2 meals a week and the rest of the time it was a pack of biscuits a day which cost of 30p a day. ",
          "created_utc": 1753122078.0
        }
      ]
    },
    {
      "id": "n4eepog",
      "author": "WeirdUnion5605",
      "body": "Me too, if there wasn't anything I was able to eat without puking I would just pass out, thank god we always had bread at least and bread helped me a lot to avoid puking constantly. It's very tiresome hearing people who know nothing about a subject feel in the right to give an uninformed, ignorant and judgemental opinion.",
      "created_utc": 1753127632.0,
      "score": 12,
      "context": [
        {
          "id": "n4dv5mp",
          "author": "MaleficentSwan0223",
          "body": "It makes me laugh because I was poor growing up. It didn’t mean I didn’t have arfid, I just struggled with food availability so only ate 4 times a week. When I could afford to eat daily I remember only affording 2 meals a week and the rest of the time it was a pack of biscuits a day which cost of 30p a day. ",
          "created_utc": 1753122078.0
        }
      ]
    },
    {
      "id": "n4egw27",
      "author": "Spoonie_Scully",
      "body": "I didn’t have this exact experience but I can relate. My dad relied on food pantry food for most of my childhood so I had even less say in the food we had in our house. It definitely was a struggle to get any food in me as a kid. It doesn’t help that my mom was okay ish financially but she was more of the “just eat what’s on your plate if you’re hungry” kind of parent at the time (thankfully she’s not like that anymore and actually validates my diagnosis) so even when I was at my moms house every other week, I was still struggling. So I sorta saw both sides of the coins in the privilege department. I also had to have free school “lunches” most of my childhood and those were not the best. A milk carton (I’m severely lactose intolerant so I couldn’t have it), a “sandwhich” (it was basically a slice of bread folded in half with a slice of cheese in the middle) which I had to force myself to eat so I would have SOMETHING in my body, and if I was lucky, a fruit I actually liked. So while some people think it’s a “first world problem”it’s still a problem and it’s a valid real experience. Also, you can’t tell me people in lesser developed countries don’t have eating disorders. People are so ridiculous",
      "created_utc": 1753128256.0,
      "score": 7,
      "context": [
        {
          "id": "n4dv5mp",
          "author": "MaleficentSwan0223",
          "body": "It makes me laugh because I was poor growing up. It didn’t mean I didn’t have arfid, I just struggled with food availability so only ate 4 times a week. When I could afford to eat daily I remember only affording 2 meals a week and the rest of the time it was a pack of biscuits a day which cost of 30p a day. ",
          "created_utc": 1753122078.0
        }
      ]
    },
    {
      "id": "n4ez9lo",
      "author": "Pretty_Appointment82",
      "body": "Exactly, it doesn't discriminate \nPeople just judge",
      "created_utc": 1753133596.0,
      "score": 3,
      "context": [
        {
          "id": "n4dv5mp",
          "author": "MaleficentSwan0223",
          "body": "It makes me laugh because I was poor growing up. It didn’t mean I didn’t have arfid, I just struggled with food availability so only ate 4 times a week. When I could afford to eat daily I remember only affording 2 meals a week and the rest of the time it was a pack of biscuits a day which cost of 30p a day. ",
          "created_utc": 1753122078.0
        }
      ]
    },
    {
      "id": "n4ft5i9",
      "author": "Bri_bug",
      "body": "Lmao I can’t even smell a banana or be in the same room with a peel without gagging",
      "created_utc": 1753143353.0,
      "score": 2,
      "context": [
        {
          "id": "n4dz52m",
          "author": "Big-Formal408",
          "body": "I've always liked this perspective for ARFID that really displays that it's NOT *just being picky*: If a picky person is starving to death and served something they don't like they'll probably eat the food eventually. If someone with ARFID is served an unsafe food many of them would still not eat it even if it meant they would die of starvation. \n\n\nThat's obviously not the case or severity for everyone with ARFID but it's a good look into how debilitating the symptoms can be. Because it's not a matter of privilege, it's a very real and genuine mental illness and eating disorder. Tbh most of the people making those comments are probably children who don't know anything about how nuanced the \"real world\" actually is.",
          "created_utc": 1753123203.0
        },
        {
          "id": "n4e114z",
          "author": "ageckonamedelaine",
          "body": "Exactly a picky eater can eat food they don't like, if I eat it I get sick, have to spit it out or can't even touch it. You can never force me to touch, let alone eat a banana, even with a gun against my head. When there is no safe food I just don't eat, my (or my parents) economic situation is irrelevant. Maybe when I am starving there are some things I might eat maybe but most are a hell no, i would rather starve, unlike a picky eater",
          "created_utc": 1753123739.0
        }
      ]
    },
    {
      "id": "n4g1bkb",
      "author": "MultiFandomShipperr",
      "body": "Me too!! In the third grade my friend used to make me sick with her banana so I wouldn't be able to participate in gym and beat her",
      "created_utc": 1753146189.0,
      "score": 3,
      "context": [
        {
          "id": "n4dz52m",
          "author": "Big-Formal408",
          "body": "I've always liked this perspective for ARFID that really displays that it's NOT *just being picky*: If a picky person is starving to death and served something they don't like they'll probably eat the food eventually. If someone with ARFID is served an unsafe food many of them would still not eat it even if it meant they would die of starvation. \n\n\nThat's obviously not the case or severity for everyone with ARFID but it's a good look into how debilitating the symptoms can be. Because it's not a matter of privilege, it's a very real and genuine mental illness and eating disorder. Tbh most of the people making those comments are probably children who don't know anything about how nuanced the \"real world\" actually is.",
          "created_utc": 1753123203.0
        },
        {
          "id": "n4e114z",
          "author": "ageckonamedelaine",
          "body": "Exactly a picky eater can eat food they don't like, if I eat it I get sick, have to spit it out or can't even touch it. You can never force me to touch, let alone eat a banana, even with a gun against my head. When there is no safe food I just don't eat, my (or my parents) economic situation is irrelevant. Maybe when I am starving there are some things I might eat maybe but most are a hell no, i would rather starve, unlike a picky eater",
          "created_utc": 1753123739.0
        },
        {
          "id": "n4ft5i9",
          "author": "Bri_bug",
          "body": "Lmao I can’t even smell a banana or be in the same room with a peel without gagging",
          "created_utc": 1753143353.0
        }
      ]
    },
    {
      "id": "n4h71ck",
      "author": "ageckonamedelaine",
      "body": "That is why I am grateful I don't have a properly functioning sense of smell because if I could smell that I'd probably gag too",
      "created_utc": 1753163033.0,
      "score": 1,
      "context": [
        {
          "id": "n4dz52m",
          "author": "Big-Formal408",
          "body": "I've always liked this perspective for ARFID that really displays that it's NOT *just being picky*: If a picky person is starving to death and served something they don't like they'll probably eat the food eventually. If someone with ARFID is served an unsafe food many of them would still not eat it even if it meant they would die of starvation. \n\n\nThat's obviously not the case or severity for everyone with ARFID but it's a good look into how debilitating the symptoms can be. Because it's not a matter of privilege, it's a very real and genuine mental illness and eating disorder. Tbh most of the people making those comments are probably children who don't know anything about how nuanced the \"real world\" actually is.",
          "created_utc": 1753123203.0
        },
        {
          "id": "n4e114z",
          "author": "ageckonamedelaine",
          "body": "Exactly a picky eater can eat food they don't like, if I eat it I get sick, have to spit it out or can't even touch it. You can never force me to touch, let alone eat a banana, even with a gun against my head. When there is no safe food I just don't eat, my (or my parents) economic situation is irrelevant. Maybe when I am starving there are some things I might eat maybe but most are a hell no, i would rather starve, unlike a picky eater",
          "created_utc": 1753123739.0
        },
        {
          "id": "n4ft5i9",
          "author": "Bri_bug",
          "body": "Lmao I can’t even smell a banana or be in the same room with a peel without gagging",
          "created_utc": 1753143353.0
        }
      ]
    },
    {
      "id": "n4i3obr",
      "author": "Spacegirl-Alyxia",
      "body": "Interestingly bananas are a safe food for me. One of the 3 uncooked fruits/vegetables (Apple, Carrots and Bananas are all of them) that are safe for me. Though have an apple lie besides a banana for too long and the taste of an apple is ruined for me and also makes me gag 🫠\n\nWhat’s it about bananas that are hurtful to so many of us? 🤔",
      "created_utc": 1753181168.0,
      "score": 1,
      "context": [
        {
          "id": "n4dz52m",
          "author": "Big-Formal408",
          "body": "I've always liked this perspective for ARFID that really displays that it's NOT *just being picky*: If a picky person is starving to death and served something they don't like they'll probably eat the food eventually. If someone with ARFID is served an unsafe food many of them would still not eat it even if it meant they would die of starvation. \n\n\nThat's obviously not the case or severity for everyone with ARFID but it's a good look into how debilitating the symptoms can be. Because it's not a matter of privilege, it's a very real and genuine mental illness and eating disorder. Tbh most of the people making those comments are probably children who don't know anything about how nuanced the \"real world\" actually is.",
          "created_utc": 1753123203.0
        },
        {
          "id": "n4e114z",
          "author": "ageckonamedelaine",
          "body": "Exactly a picky eater can eat food they don't like, if I eat it I get sick, have to spit it out or can't even touch it. You can never force me to touch, let alone eat a banana, even with a gun against my head. When there is no safe food I just don't eat, my (or my parents) economic situation is irrelevant. Maybe when I am starving there are some things I might eat maybe but most are a hell no, i would rather starve, unlike a picky eater",
          "created_utc": 1753123739.0
        },
        {
          "id": "n4ft5i9",
          "author": "Bri_bug",
          "body": "Lmao I can’t even smell a banana or be in the same room with a peel without gagging",
          "created_utc": 1753143353.0
        }
      ]
    }
  ]
}