{
  "id": "c82zqv",
  "subreddit": "ARFID",
  "author": "No_clowns_here",
  "created_utc": 1562030820.0,
  "title": "I ate my first vegetable!",
  "selftext": "I'm 19, have had arfid as long as I can remember, and have never actually eaten a vegetable. Growing up, my parents tried to make me eat all the food on my plate but most things would make me gag or throw up, especially the vegetables. Then I'd just get yelled at which made me hate food more. I've been trying to be healthier lately since most of my safe foods are junk foods and decided to buy a little vegetable sampler with broccoli, carrots, and celery. The broccoli wasn't good, I only ate a little bit but it didn't make me gag. The celery was horrible and made me gag a little after a tiny bite so that's a definite no. BUT the baby carrots actually weren't bad. I ate 6 whole baby carrots which is something I never thought I'd do. I actually thought I would die before eating a whole vegetable. I then cried in my husband's arms because I was so proud of myself. He's been really supportive and it's been great. After this success, I feel like I could do anything. Hoping to try more vegetables soon.",
  "url": "https://www.reddit.com/r/ARFID/comments/c82zqv/i_ate_my_first_vegetable/",
  "score": 88,
  "num_comments": 8,
  "comments": [
    {
      "id": "esjdftj",
      "author": "None",
      "body": "Wow! Thanks for sharing! Good job!",
      "created_utc": 1562030914.0,
      "score": 9,
      "context": []
    },
    {
      "id": "esjggsv",
      "author": "FiendFyreFox",
      "body": "Congrats! I find that just knowing you can handle a certain food can boost your confidence a lot, whether you eat it often or not.",
      "created_utc": 1562032644.0,
      "score": 8,
      "context": []
    },
    {
      "id": "esjlur8",
      "author": "Ihaveapeach",
      "body": "Congrats! It’s victories like that that add up and make you feel invincible. ❤️",
      "created_utc": 1562036059.0,
      "score": 3,
      "context": []
    },
    {
      "id": "esjme6b",
      "author": "Eiokupokehelp",
      "body": "That's great! Working up the courage to do that can feel great,  and overall has better impact then being forced,  ect.",
      "created_utc": 1562036413.0,
      "score": 1,
      "context": []
    },
    {
      "id": "eslc0s8",
      "author": "Deathbybroccoli",
      "body": "Good job! I know how hard it is with veggies...\n\nI found roasted parsnips are not too bad, they have a slightly nutty flavour. Cooked red cabbage in apple sauce is actually pretty good too. \n\nI have never even managed a tiny bite of broccoli.....",
      "created_utc": 1562082973.0,
      "score": 1,
      "context": []
    },
    {
      "id": "esm87li",
      "author": "yamiryukia330",
      "body": "congratulations. also something to consider is adding seasonings and different ways of preparing them too. i'm not hot on raw broccoli but love it cooked and used as part of a pasta dish or in say mac and cheese. good job and keep at it.",
      "created_utc": 1562100160.0,
      "score": 1,
      "context": []
    },
    {
      "id": "esmd2z2",
      "author": "Fookin_Dave",
      "body": " CONGRATULATIONS I was the same age when I ate my first fruit and I can tell you if you keep at it, it will get easier 6 whole baby carrots you should feel proud of yourself well done!",
      "created_utc": 1562102928.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ethp0mi",
      "author": "throwaway-m1",
      "body": "I saw this and was inspired and ate a few bites of a carrot!!! I gagged but I did it. I like carrots until it comes to the actual swallowing, the texture is weird. I eat small bites of veggies like, maybe once a year.",
      "created_utc": 1562822438.0,
      "score": 1,
      "context": []
    }
  ]
}