{
  "id": "c9bgwi",
  "subreddit": "ARFID",
  "author": "ObviousNefariousnes",
  "created_utc": 1562299420.0,
  "title": "Supporting loved ones with ARFID: Tips from a spouse after a decade of learning.",
  "selftext": "Hi there, \n\nI wrote this as a comment to a post from a month ago about ARFID and relationships but thought I might just post it anyway as it could be helpful. \n\nI periodically check this sub as my partner was officially diagnosed a few years ago. \n\nWe've been together about a decade, I'm a foodie and ex-Chef, she has ARFID. \n\nWhen we met she ate 5 things, that was it. White pasta (well over boiled and the water couldn't even be salted without a full anxiety attack meltdown), white rice, carrots (boiled again), apple juice and milk chocolate. That was it. \n\nShe now basically eats whatever I do. It's been a very long process of working together and therapy. But thought I would share some things that we did and it helped. \n\nThere were some rules I had for me, that I try really hard to remember: \n\n1. Never ever any negatives about eating. At all no matter what, there are no judgments about food/eating. Only positives and love.\n2. Never comment if she skips a meal or only eats half or something, eating is ONLY ever encouraged. Instead of my concern being \"You've only had half the sandwich\" it is \"Wow, great job on the sandwich at lunch today, you're kicking ARFIDs ass!!\"\n\nSo to help with the anxiety we did a couple of things. \n\n* Talked openly that it might need to be diagnosed. The disorder had landed her in hospital a few times (fainting, infertility, organ function etc). We noted that while it is scary to open up, once someone knows we can make sure we avoid the hospital. \n* Every time she didn't feel she could eat a meal, she would just let me know and we could do something else or change the topic so the anxiety about food was redirected. \n* If there was ever anything that she didn't like, let me know and I'll remove it/eat it. One time we were at an Italian place and she ordered her plain pasta and it came with a few strips of shaved Parmesan. I just put the cheese on my plate and we overcame what otherwise would have been a get up and leave situation. \n\nOnce we focused on the anxiety and fear we talked about how a few new foods could be cool. Entirely the foods she wanted to try. Not the ones I wanted her to. \n\nSo, knowing that when we would go out we had a system (we still use it). \n\nShe will order something that is a safe food. \n\nThe other order is something she would like to try. \n\nThat way if she hates it (and its happened a bit!) then I eat it as I am adventurous and eat anything. But most often, she would love it and then there was a new food she liked in an environment of no judgment and no pressure. \n\nThe other thing I did, as I worked with food, love it and know a bit about it is that if she tried something she liked then I would talk about another food that she might like and relate it to how its like something she already likes and is ok with. \n\nFor example, a few months ago we reached the point of liking burritos. Which was awesome!!! When she was talking about things to try next I mentioned a kebab might be a good idea to try. I love them and their basically a middle-eastern version of a burrito. Meat and whatever toppings you want in a bread. She thought about it, looked them up, looked up restaurants and about a month later we went to try one. She said what toppings she wanted, I ordered it and she liked some of it! She ended up changing some topics and adding others, but, it was a nice bridge to trying other things in a nice safe way. \n\n&#x200B;\n\nThe other thing that we talk about a lot is this thing her therapist talks to her about. When she was talking about how its nice to just eat the safe foods, she is in control etc. \n\n*The therapist has said: You're in control the same way an animal is in control in the zoo.* \n\nShe has found that helpful to talk about it all, she knows sometimes she is the animal is the zoo and sometimes she needs to be. Other times, she realises how much she likes open spaces and wants to run free. \n\n&#x200B;\n\nFor family, friends and others who have a love one with ARFID I think its important to remember that you're doing an awesome job and yeah this lasts a while, but you're stronger together on the road to recovery than alone. We can help and be there everyday for the victories and difficulties of our loved one. Even if that means fries and chicken for their dinner for a few months etc.\n\n&#x200B;\n\nYou're all doing awesome.",
  "url": "https://www.reddit.com/r/ARFID/comments/c9bgwi/supporting_loved_ones_with_arfid_tips_from_a/",
  "score": 324,
  "num_comments": 14,
  "comments": [
    {
      "id": "esvm945",
      "author": "LumpyLord420",
      "body": "People like you make me believe that humanity has a chance. Thank you, you’re amazing.",
      "created_utc": 1562301008.0,
      "score": 32,
      "context": []
    },
    {
      "id": "esvqv6w",
      "author": "Taeyiing",
      "body": "Thank you! As a partner to someone who has ARFID, it's really good to hear more tips and tricks when it comes to encouraging them to expand their palette. I agree completely with the 'always encouraging' part, never any negatives. \n\nSince I've been with my partner, he's started eating (on a semi-regular basis) approx 5 new foods in 2 years and whilst in the moment it feels like it's a very slow process but looking back now, it's big for him. Thank you for showing that patience really works/pays off and I hope that we will be in your position someday! I admit sometimes I do get frustrated because I'm a huge foodie and to a certain extent, I cannot understand the struggle people with ARFID go through.\n\n&#x200B;\n\nAnd I'm glad that I'm not the only one that does the whole \"one person orders their safe food, and the other dish is something that they might like to try\" too since I'm super SUPER adventurous with my food and I'm up to trying anything / eating anything that he doesn't eat.  \n\n\nIn saying that, does your partner still get days/weeks/months where she doesn't feel up to it and would just like to keep to her safe foods? (eg. during times of stress, after a few days of trying new foods etc)",
      "created_utc": 1562302858.0,
      "score": 12,
      "context": []
    },
    {
      "id": "et77ypa",
      "author": "obsessive-convulsive",
      "body": ">never ever any negatives about eating \n\nThis is so important. Sometimes people close to me who know about my ARFID think that my sensory issues with food are my only issues with food. For the most part thats true, but when people start making comments about my eating habits, how little I eat, calories, my weight, etc, it really, really negatively affects me.",
      "created_utc": 1562526646.0,
      "score": 11,
      "context": []
    },
    {
      "id": "esyn4lo",
      "author": "DreamDroplet",
      "body": "This is crucial: \"Never comment if she skips a meal or only eats half or something, eating is ONLY ever encouraged. Instead of my concern being \"You've only had half the sandwich\" it is \"Wow, great job on the sandwich at lunch today, you're kicking ARFIDs ass!!\" \"\n\n&#x200B;\n\nThank you so much for being an understanding human being!",
      "created_utc": 1562345927.0,
      "score": 18,
      "context": []
    },
    {
      "id": "esxi9vf",
      "author": "Amazon_UK",
      "body": "You’re a freaking amazing guy oh my god",
      "created_utc": 1562330958.0,
      "score": 7,
      "context": []
    },
    {
      "id": "eti93oc",
      "author": "fkl5",
      "body": "I'm so glad to read your story.  My 9 year old son has arfid and rarely in my research do i come across people getting better, so its encouraging to hear how far your partner has come.  Well done to you both.",
      "created_utc": 1562842867.0,
      "score": 4,
      "context": []
    },
    {
      "id": "f3yyzat",
      "author": "chickenvilles",
      "body": "Very helpful tips to use with my girlfriend. Thank you!",
      "created_utc": 1571261092.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l3344u1",
      "author": "mushroombandit222",
      "body": "thank you for this. i was searching reddit for real tips and tools for my partner and this hit the spot. i appreciate your approach to ARFID & care for your partner. 🌟🫀 wishing all folks navigating ARFID the absolute best and big high five to partners supporting their partners & loved ones with  w/ ARFID!",
      "created_utc": 1715141660.0,
      "score": 2,
      "context": []
    },
    {
      "id": "htt6v6j",
      "author": "Far-Club-8001",
      "body": "I am trying so hard to eat.  My husband is worried but his trying to help makes me less likely to eat.\n\nHe does not understand",
      "created_utc": 1642895806.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ete5d6i",
      "author": "ObviousNefariousnes",
      "body": "I'm so sorry it's taken me ages to reply. My work schedule is kinda crazy. \n\nIt's so nice to hear that you and your partner have made such huge leaps and bounds! I agree as the SO without the ED it can be really challenging to not be frustrated at times, I found that especially earlier on in my relationship as ARFID is still so under diagnosed and just flat out not recognised by people. How have you been dealing with that? \n\nI found that I have a specific time once a month for a night out with my mates and that is when I go out and eat where/what I really like and know that my partner is having fun with her friends at the same time. Not only a nice time apart, but also a time for me to look at my interests too. I totally agree that it is so hard to understand the struggle of the partner with an ED. I honestly cannot imagine how hard it must be to have so much of social life, family gatherings, meetings at work etc that are all tied up with food/drinks. When I spoke to my partner about it she told me how isolating it was and I felt my freaking heart break. She is a social person, but says no so often because of the fear that being around the food and having people watch/judge. It was one of those times I realised how much of her struggle I didn't see or even realise. \n\nAlso 5 new foods in 2 years is freaking AMAZING progress! You both have so much to celebrate and be proud of. What are some of the new favourite foods? \n\n&#x200B;\n\nI honestly was smiling so wide when I read that you do the share meal thing too!! We thought it was such a great system and we still use it. What has been something your SO has discovered he liked with the sharing system? One of the first things for my partner was fried rice, she bloody loved it. \n\nWith the question of the time after trying something I had one answer and I asked my SO what she thought and we had totally different answers, which I thought was interesting. She feels like it is only a few days after trying something that she will just stick with safe foods, when I would have said its a 2 week minimum. \n\nStress though, that is a massive one. My SO had a bad case of workplace bullying (she ended up quitting because of it) and in that period of time the ED was so bad. Her safe food list has expanded from when we first met, but in those 3 months it was one meal a day of about 1/2 a cup of white rice. Maybe and that was about it. Stress is linked to EDs and obviously makes it worse, but even now when things are stressful at her work I notice that she gravitates toward the safe foods and ED patterns again. \n\nDoes your SO need to take time after/during a period of stress or trying new foods? An important thing my SO's therapist told her is that hiccups and periods of rest are a vital part of recovery. It's not a set back, its a pause to build up strength again. We've both found that useful to remember in those periods of keeping to the safe foods.\n\n&#x200B;\n\nIn saying all this, anyone who struggles with ARFID and EDs is insanely strong willed, like this something that impacts every waking minute and they're strong enough to function and get through their day.",
      "created_utc": 1562723332.0,
      "score": 1,
      "context": [
        {
          "id": "esvqv6w",
          "author": "Taeyiing",
          "body": "Thank you! As a partner to someone who has ARFID, it's really good to hear more tips and tricks when it comes to encouraging them to expand their palette. I agree completely with the 'always encouraging' part, never any negatives. \n\nSince I've been with my partner, he's started eating (on a semi-regular basis) approx 5 new foods in 2 years and whilst in the moment it feels like it's a very slow process but looking back now, it's big for him. Thank you for showing that patience really works/pays off and I hope that we will be in your position someday! I admit sometimes I do get frustrated because I'm a huge foodie and to a certain extent, I cannot understand the struggle people with ARFID go through.\n\n&#x200B;\n\nAnd I'm glad that I'm not the only one that does the whole \"one person orders their safe food, and the other dish is something that they might like to try\" too since I'm super SUPER adventurous with my food and I'm up to trying anything / eating anything that he doesn't eat.  \n\n\nIn saying that, does your partner still get days/weeks/months where she doesn't feel up to it and would just like to keep to her safe foods? (eg. during times of stress, after a few days of trying new foods etc)",
          "created_utc": 1562302858.0
        }
      ]
    },
    {
      "id": "ete5pjt",
      "author": "ObviousNefariousnes",
      "body": "I'm sorry people think it's ok to comment to you about this. It really isn't ok and you're doing brilliantly for tackling the ED every day. \n\nAs I don't really know what it is like to have peoples comments like that effect me I asked my SO how she has dealt with it. She said she used to ignore it and then once in public when someone said something she just said \"This is my meal, not yours\" and thats how she shuts down those kind of comments now. \n\nYou're doing great and its great that you have people in your life who know about your struggles with ARFID, even if they don't understand the extent of it.",
      "created_utc": 1562723582.0,
      "score": 5,
      "context": [
        {
          "id": "et77ypa",
          "author": "obsessive-convulsive",
          "body": ">never ever any negatives about eating \n\nThis is so important. Sometimes people close to me who know about my ARFID think that my sensory issues with food are my only issues with food. For the most part thats true, but when people start making comments about my eating habits, how little I eat, calories, my weight, etc, it really, really negatively affects me.",
          "created_utc": 1562526646.0
        }
      ]
    },
    {
      "id": "eszy6rx",
      "author": "ObviousNefariousnes",
      "body": "Thank you so much! That is really, really kind of you. \n\nIt is seriously so important to make sure that food/meal times are a place of zero stress or judgement. Trying or knowing the limits are an amazing feat on its own. The amount of anxiety, stress, fear etc that must come 3 times a day is unimaginable to me and so many others who don't have EDs its the least we can do to just be relentlessly positive and supportive. \n\nY'all are fighting and surviving everyday and it takes WAY more courage and strength to face it. We're all here supporting every step of the way. :)",
      "created_utc": 1562369755.0,
      "score": 10,
      "context": [
        {
          "id": "esyn4lo",
          "author": "DreamDroplet",
          "body": "This is crucial: \"Never comment if she skips a meal or only eats half or something, eating is ONLY ever encouraged. Instead of my concern being \"You've only had half the sandwich\" it is \"Wow, great job on the sandwich at lunch today, you're kicking ARFIDs ass!!\" \"\n\n&#x200B;\n\nThank you so much for being an understanding human being!",
          "created_utc": 1562345927.0
        }
      ]
    },
    {
      "id": "kyos5ge",
      "author": "CatButtsInSpace",
      "body": "I know this is an old post, but this is so helpful, and I'm so relieved to know my husband and I are not alone. I strongly suspect my husband has ARFID and I am an absolute foodie. I'm very much looking forward to trying the share meals!",
      "created_utc": 1712616987.0,
      "score": 3,
      "context": [
        {
          "id": "esvqv6w",
          "author": "Taeyiing",
          "body": "Thank you! As a partner to someone who has ARFID, it's really good to hear more tips and tricks when it comes to encouraging them to expand their palette. I agree completely with the 'always encouraging' part, never any negatives. \n\nSince I've been with my partner, he's started eating (on a semi-regular basis) approx 5 new foods in 2 years and whilst in the moment it feels like it's a very slow process but looking back now, it's big for him. Thank you for showing that patience really works/pays off and I hope that we will be in your position someday! I admit sometimes I do get frustrated because I'm a huge foodie and to a certain extent, I cannot understand the struggle people with ARFID go through.\n\n&#x200B;\n\nAnd I'm glad that I'm not the only one that does the whole \"one person orders their safe food, and the other dish is something that they might like to try\" too since I'm super SUPER adventurous with my food and I'm up to trying anything / eating anything that he doesn't eat.  \n\n\nIn saying that, does your partner still get days/weeks/months where she doesn't feel up to it and would just like to keep to her safe foods? (eg. during times of stress, after a few days of trying new foods etc)",
          "created_utc": 1562302858.0
        },
        {
          "id": "ete5d6i",
          "author": "ObviousNefariousnes",
          "body": "I'm so sorry it's taken me ages to reply. My work schedule is kinda crazy. \n\nIt's so nice to hear that you and your partner have made such huge leaps and bounds! I agree as the SO without the ED it can be really challenging to not be frustrated at times, I found that especially earlier on in my relationship as ARFID is still so under diagnosed and just flat out not recognised by people. How have you been dealing with that? \n\nI found that I have a specific time once a month for a night out with my mates and that is when I go out and eat where/what I really like and know that my partner is having fun with her friends at the same time. Not only a nice time apart, but also a time for me to look at my interests too. I totally agree that it is so hard to understand the struggle of the partner with an ED. I honestly cannot imagine how hard it must be to have so much of social life, family gatherings, meetings at work etc that are all tied up with food/drinks. When I spoke to my partner about it she told me how isolating it was and I felt my freaking heart break. She is a social person, but says no so often because of the fear that being around the food and having people watch/judge. It was one of those times I realised how much of her struggle I didn't see or even realise. \n\nAlso 5 new foods in 2 years is freaking AMAZING progress! You both have so much to celebrate and be proud of. What are some of the new favourite foods? \n\n&#x200B;\n\nI honestly was smiling so wide when I read that you do the share meal thing too!! We thought it was such a great system and we still use it. What has been something your SO has discovered he liked with the sharing system? One of the first things for my partner was fried rice, she bloody loved it. \n\nWith the question of the time after trying something I had one answer and I asked my SO what she thought and we had totally different answers, which I thought was interesting. She feels like it is only a few days after trying something that she will just stick with safe foods, when I would have said its a 2 week minimum. \n\nStress though, that is a massive one. My SO had a bad case of workplace bullying (she ended up quitting because of it) and in that period of time the ED was so bad. Her safe food list has expanded from when we first met, but in those 3 months it was one meal a day of about 1/2 a cup of white rice. Maybe and that was about it. Stress is linked to EDs and obviously makes it worse, but even now when things are stressful at her work I notice that she gravitates toward the safe foods and ED patterns again. \n\nDoes your SO need to take time after/during a period of stress or trying new foods? An important thing my SO's therapist told her is that hiccups and periods of rest are a vital part of recovery. It's not a set back, its a pause to build up strength again. We've both found that useful to remember in those periods of keeping to the safe foods.\n\n&#x200B;\n\nIn saying all this, anyone who struggles with ARFID and EDs is insanely strong willed, like this something that impacts every waking minute and they're strong enough to function and get through their day.",
          "created_utc": 1562723332.0
        }
      ]
    },
    {
      "id": "kypyxfx",
      "author": "ObviousNefariousnes",
      "body": "I hope it all goes really well! 🤞",
      "created_utc": 1712634161.0,
      "score": 1,
      "context": [
        {
          "id": "esvqv6w",
          "author": "Taeyiing",
          "body": "Thank you! As a partner to someone who has ARFID, it's really good to hear more tips and tricks when it comes to encouraging them to expand their palette. I agree completely with the 'always encouraging' part, never any negatives. \n\nSince I've been with my partner, he's started eating (on a semi-regular basis) approx 5 new foods in 2 years and whilst in the moment it feels like it's a very slow process but looking back now, it's big for him. Thank you for showing that patience really works/pays off and I hope that we will be in your position someday! I admit sometimes I do get frustrated because I'm a huge foodie and to a certain extent, I cannot understand the struggle people with ARFID go through.\n\n&#x200B;\n\nAnd I'm glad that I'm not the only one that does the whole \"one person orders their safe food, and the other dish is something that they might like to try\" too since I'm super SUPER adventurous with my food and I'm up to trying anything / eating anything that he doesn't eat.  \n\n\nIn saying that, does your partner still get days/weeks/months where she doesn't feel up to it and would just like to keep to her safe foods? (eg. during times of stress, after a few days of trying new foods etc)",
          "created_utc": 1562302858.0
        },
        {
          "id": "ete5d6i",
          "author": "ObviousNefariousnes",
          "body": "I'm so sorry it's taken me ages to reply. My work schedule is kinda crazy. \n\nIt's so nice to hear that you and your partner have made such huge leaps and bounds! I agree as the SO without the ED it can be really challenging to not be frustrated at times, I found that especially earlier on in my relationship as ARFID is still so under diagnosed and just flat out not recognised by people. How have you been dealing with that? \n\nI found that I have a specific time once a month for a night out with my mates and that is when I go out and eat where/what I really like and know that my partner is having fun with her friends at the same time. Not only a nice time apart, but also a time for me to look at my interests too. I totally agree that it is so hard to understand the struggle of the partner with an ED. I honestly cannot imagine how hard it must be to have so much of social life, family gatherings, meetings at work etc that are all tied up with food/drinks. When I spoke to my partner about it she told me how isolating it was and I felt my freaking heart break. She is a social person, but says no so often because of the fear that being around the food and having people watch/judge. It was one of those times I realised how much of her struggle I didn't see or even realise. \n\nAlso 5 new foods in 2 years is freaking AMAZING progress! You both have so much to celebrate and be proud of. What are some of the new favourite foods? \n\n&#x200B;\n\nI honestly was smiling so wide when I read that you do the share meal thing too!! We thought it was such a great system and we still use it. What has been something your SO has discovered he liked with the sharing system? One of the first things for my partner was fried rice, she bloody loved it. \n\nWith the question of the time after trying something I had one answer and I asked my SO what she thought and we had totally different answers, which I thought was interesting. She feels like it is only a few days after trying something that she will just stick with safe foods, when I would have said its a 2 week minimum. \n\nStress though, that is a massive one. My SO had a bad case of workplace bullying (she ended up quitting because of it) and in that period of time the ED was so bad. Her safe food list has expanded from when we first met, but in those 3 months it was one meal a day of about 1/2 a cup of white rice. Maybe and that was about it. Stress is linked to EDs and obviously makes it worse, but even now when things are stressful at her work I notice that she gravitates toward the safe foods and ED patterns again. \n\nDoes your SO need to take time after/during a period of stress or trying new foods? An important thing my SO's therapist told her is that hiccups and periods of rest are a vital part of recovery. It's not a set back, its a pause to build up strength again. We've both found that useful to remember in those periods of keeping to the safe foods.\n\n&#x200B;\n\nIn saying all this, anyone who struggles with ARFID and EDs is insanely strong willed, like this something that impacts every waking minute and they're strong enough to function and get through their day.",
          "created_utc": 1562723332.0
        },
        {
          "id": "kyos5ge",
          "author": "CatButtsInSpace",
          "body": "I know this is an old post, but this is so helpful, and I'm so relieved to know my husband and I are not alone. I strongly suspect my husband has ARFID and I am an absolute foodie. I'm very much looking forward to trying the share meals!",
          "created_utc": 1712616987.0
        }
      ]
    }
  ]
}