{
  "id": "cellqp",
  "subreddit": "ARFID",
  "author": "heraldo19",
  "created_utc": 1563411549.0,
  "title": "I just ate broccoli for the first time",
  "selftext": "I always hated vegetables. A little piece of onion would make me want to throw up. Not eating vegetables made me eat lot's of rice potatoes and meat, so my belly wouldn't go away even though I work out a lot.\n\nSo I decided that it was time for a change. Took a lot of courage but I prepared some steamed broccoli to try it out. I can't say I loved ot but it wasn't so bad. \n\nBaby steps from now on but always moving forward looking for better health. Next stop is spinach I think.",
  "url": "https://www.reddit.com/r/ARFID/comments/cellqp/i_just_ate_broccoli_for_the_first_time/",
  "score": 110,
  "num_comments": 16,
  "comments": [
    {
      "id": "eu3nt7n",
      "author": "auner01",
      "body": "Baby steps are good, and broccoli's a good choice.. hard to ruin, and you can slice and dice it so many ways and spice the heck out of it.. or not, and be just fine.",
      "created_utc": 1563419821.0,
      "score": 9,
      "context": []
    },
    {
      "id": "eu3ojmu",
      "author": "karaanne19",
      "body": "I find broccoli way more tolerable with some garlic salt sprinkled on top, if that’s something you might like. Congratulations, this is a huge win!",
      "created_utc": 1563420434.0,
      "score": 7,
      "context": []
    },
    {
      "id": "eu3hsl5",
      "author": "Alivebutnotawake",
      "body": "I don’t know you but I’m proud of you!!! I recently tried sugar snap peas, not my favorite but I only gagged on the first bite!",
      "created_utc": 1563415040.0,
      "score": 4,
      "context": []
    },
    {
      "id": "eu3klb4",
      "author": "spicyycrab",
      "body": "You’re braver than me! I’d nibble cold broccoli (still dislike it) but I think I’d starve before trying it cooked. Good job!",
      "created_utc": 1563417217.0,
      "score": 4,
      "context": []
    },
    {
      "id": "eu40wm1",
      "author": "wellishitalot",
      "body": "We Stan steady growth",
      "created_utc": 1563433075.0,
      "score": 3,
      "context": []
    },
    {
      "id": "eu54g1l",
      "author": "Danyell619",
      "body": "Try it with different cheeses if your into that, or hollandaise.",
      "created_utc": 1563469686.0,
      "score": 4,
      "context": []
    },
    {
      "id": "eu68b0d",
      "author": "jouan87",
      "body": "That's so exciting, congratulations! My first vegetable I actually ate and not just in a smoothie was a carrot, I don't love them but I can eat them with peanut butter. But smoothies have been the only way I eat real veggies other than potatoes.",
      "created_utc": 1563494396.0,
      "score": 4,
      "context": []
    },
    {
      "id": "eu6tpf3",
      "author": "SapphireWharf74",
      "body": "Nice work! I find lettuce better than spinach for me because lettuce has a crunchier texture and spinach doesn’t. either way, good luck to you! (if you can manage, I find Paul Newman’s Caesar dressing, not creamy, helps get rid of the .. well... vegetable taste. baby steps r so important with ARFID. yay for you!!",
      "created_utc": 1563508748.0,
      "score": 4,
      "context": []
    },
    {
      "id": "eu3f43m",
      "author": "Charle_65",
      "body": "fresh baby spinach have a sweetness to them.. my gf have arfid and tried a avocado+strawberry+spinach and she liked it.. I suggest apple and watermelon cuts with salad.",
      "created_utc": 1563413010.0,
      "score": 6,
      "context": []
    },
    {
      "id": "eu3q5o6",
      "author": "Smelly_Scientist",
      "body": "Congratulations! That's an amazing step!  \n\n\nI'm still terrified of eating greens. If possible, could you describe what it tastes and feels like?",
      "created_utc": 1563421830.0,
      "score": 7,
      "context": []
    },
    {
      "id": "eu5jrhi",
      "author": "None",
      "body": "I'm proud of you. Keep it up pal!",
      "created_utc": 1563479048.0,
      "score": 2,
      "context": []
    },
    {
      "id": "eu7kczy",
      "author": "chickenmonkeypenis",
      "body": "No thank you. Broccoli is horrible.",
      "created_utc": 1563534731.0,
      "score": 2,
      "context": []
    },
    {
      "id": "eurk3ys",
      "author": "ArtsyTeacher95",
      "body": "Congrats! Brocolli is one that still scares the crap out of me. A really good way to start with spinach though is in a smoothie (if fruit is something you like). I usually do blue berries, strawberries, orange juice, ice, and pre-chopped frozen spinach. Since the pieces are really small they blend in nicely with any of the icy texture or seeds from the berries.",
      "created_utc": 1563995139.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ezpdgxk",
      "author": "Feroc",
      "body": "Sorry for the late comment, but I am just reading through the top posts and I can so much relate to this one.\n\nBroccoli was one of those \"why should I ever try that\" vegetables. I can't even remember the reason why I finally gave it a try, but it quickly became my go-to vegetable if I want a quick and easy vegetable addition to my food.",
      "created_utc": 1568038485.0,
      "score": 1,
      "context": []
    },
    {
      "id": "eu6tryu",
      "author": "SapphireWharf74",
      "body": "it took me a while to get used to sugar snap peas but thankfully crunchier textures are easier for me. good job on trying them tho!!",
      "created_utc": 1563508797.0,
      "score": 2,
      "context": [
        {
          "id": "eu3hsl5",
          "author": "Alivebutnotawake",
          "body": "I don’t know you but I’m proud of you!!! I recently tried sugar snap peas, not my favorite but I only gagged on the first bite!",
          "created_utc": 1563415040.0
        }
      ]
    },
    {
      "id": "eu5j9ax",
      "author": "bekaz13",
      "body": "Hi! I love broccoli so I hope you don't mind me cutting in.\n\nFirst of all, with broccoli you may find it easier to separate the stems from the buds. While most greens have a bit of a grassy flavor, broccoli stems are pretty mild even when raw. Raw stems have a nice crunch to them as well, so that may be a good place to start. Some stems do have leaves on them, but they are easy to peel off. It's also possible to peel off the tougher outside of the stalks and just eat the milder inner flesh.\n\nBuds are fairly gritty when raw, so I recommend they be steamed first. That will also help remove the grassy flavor and make them almost sweet. If the taste is a bit too strong, I recommend adding some melted butter and salt, or cheese if that is a safe option for you. Parmesan is a personal favorite of mine.\n\nGood luck!",
      "created_utc": 1563478746.0,
      "score": 5,
      "context": [
        {
          "id": "eu3q5o6",
          "author": "Smelly_Scientist",
          "body": "Congratulations! That's an amazing step!  \n\n\nI'm still terrified of eating greens. If possible, could you describe what it tastes and feels like?",
          "created_utc": 1563421830.0
        }
      ]
    }
  ]
}