{
  "id": "d24bkb",
  "subreddit": "ARFID",
  "author": "wernerherzogsurethra",
  "created_utc": 1568101248.0,
  "title": "Wondering if you'll ever get over your ARFID?",
  "selftext": "I finally \"beat\" my ARFID at about age 30; I've been successfully in remission for the past 3 years since. \n\nI'll spare you my bio and long journey to getting over my ARFID. Suffice to say mine was the usual sob story you see on this subreddit, and it took me some 3-4 years on my 3rd attempt at therapy to get here.\n\nInstead, I'll tell you about \\*the\\* turning point in my journey. This turning point hinged on how I grappled with the question of whether or not I'll ever \"eat normally.\"\n\nGrowing up with ARFID, I had ambivalent views on whether or not I'd ever get better. One part of me was certain that I'd beat it eventually; another part of me felt completely hopeless and helpless. I vacillated wildly between both views depending on my mood and how life was going. \n\nNot that the question really mattered in my youth. I was going nowhere fast. I was unhealthy, obese, and isolated. Unable to share a meal with friends, I overcompensated with alcohol--drinking prodigiously (on an empty stomach) then gorging on junk food when I would finally get back home. It was a miserable lifestyle.\n\nI finally bottomed out after a horrible New Year's Eve vacation in Sydney at age 26. I needed to know once and for all: should I still hold out hope of eating normally? Or should I just give up and make peace with my strange, juvenile, shallow feeding repertoire?\n\nI was in such a terrible state that I knew I wouldn't be able to get answers on my own. I decided to see a counselor. It wasn't the first time I'd sought therapy for stuff relating to ARFID--all my previous attempt were wildly unsuccessful--but this time I felt like I had a new question and angle to explore. I didn't want a cure. I just wanted to know if it was time to give up.\n\nSo, I met the counselor (who would eventually guide me out of ARFID) and posed my burning question to her: keep hoping or give up?\n\nHer answer to me was *the* turning point in my ARFID journey.\n\nWhat was her answer? ***Do both***.\n\n***Accept that you will be like this forever; commit to changing things anyway.*** \n\nI eventually learned this simple principle at the heart of all genuinely consequential questions in life: the truth is in the paradox. Accept yourself entirely as you are and make peace that things will never change. At the same time, commit to trying to change regardless of whether or not it works.\n\nI had to learn how to do two opposite things at the same time. Accept and commit.\n\nReader, I don't know who you are or what you're going through. I don't know how severe or protracted or complex your condition is. I don't know how many times and how many years you've tried and failed at getting better. I don't know how much you've suffered. And I certainly can't promise that you'll ever get better. But I know for sure that you will always have room for acceptance and commitment. These things are entirely in your control: you can choose to make peace with who you are and how things are; you can choose to keep marching regardless, expanding your diet bit by bit by bit by bit.\n\nThese days I forget that I ever had ARFID at all, believe it or not. To think I once felt like I was an abomination because of my ARFID. Now it's just a distant, abstract memory.\n\nThey say \"hope is the belief in a stranger future.\" In retrospect, this post-ARFID future is stranger than anything I could ever have imagined, even just 5 years ago in the height of my therapy. I freaking cooked myself a delicious plate of scrambled eggs this morning, which sounds completely ludicrous. I not only eat fish now; it turns out I actually love fish! FISH! My 28-year old ARFID-soaked self could scarcely have imagined it. \n\nI wish you a future far, far stranger than you can imagine.",
  "url": "https://www.reddit.com/r/ARFID/comments/d24bkb/wondering_if_youll_ever_get_over_your_arfid/",
  "score": 104,
  "num_comments": 10,
  "comments": [
    {
      "id": "ezt6b6j",
      "author": "cas1313",
      "body": "Thank you for this!",
      "created_utc": 1568122485.0,
      "score": 10,
      "context": []
    },
    {
      "id": "ezt3vpp",
      "author": "probopassed",
      "body": "Congratulations!",
      "created_utc": 1568120516.0,
      "score": 6,
      "context": []
    },
    {
      "id": "ezt86kw",
      "author": "LuxandGold",
      "body": "Thank you for typing this up today. I've just returned from a meeting with a nutritionist in my own journey in recovery. I can't tell you the number of times I have felt like a failure before getting help. This is the first time I've been able to actually meet properly with doctors and been taken seriously about my eating disorder and I am terrified that once again, I'm going to fail. \n\nI needed to read this today. Thank you.",
      "created_utc": 1568123924.0,
      "score": 3,
      "context": []
    },
    {
      "id": "f0ygknl",
      "author": "Riiella",
      "body": "\"You can choose to make peace with who you are and how things are; and you can choose to keep marching regardless.\" A beautiful paradox. Is it alright if I hang that on my wall? I could use a little everyday support. Thank you.",
      "created_utc": 1569070034.0,
      "score": 2,
      "context": []
    },
    {
      "id": "eztuihn",
      "author": "Prof_Gutnacht",
      "body": "probably never getting out of this. i'm getting into my mid 20's and i havent gotten any better",
      "created_utc": 1568138931.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ezuqg1y",
      "author": "FiveThirteenGirl",
      "body": "Can you tell us some things you’re able to eat (preferably healthy)? Just so I can dream?",
      "created_utc": 1568158725.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ezwikfi",
      "author": "ravanbak",
      "body": "I did not expect Werner Herzog's urethra to be so well-spoken. But seriously, congrats! Very encouraging to read.",
      "created_utc": 1568217500.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ezt92ev",
      "author": "wernerherzogsurethra",
      "body": "I am so pleased to hear you're getting proper support! It really, truly helps to have someone on your side who actually cares.\n\nIf you ever want to talk or need a buddy for the journey, please don't hesitate to reach out. I'm happy to listen and help.",
      "created_utc": 1568124584.0,
      "score": 1,
      "context": [
        {
          "id": "ezt86kw",
          "author": "LuxandGold",
          "body": "Thank you for typing this up today. I've just returned from a meeting with a nutritionist in my own journey in recovery. I can't tell you the number of times I have felt like a failure before getting help. This is the first time I've been able to actually meet properly with doctors and been taken seriously about my eating disorder and I am terrified that once again, I'm going to fail. \n\nI needed to read this today. Thank you.",
          "created_utc": 1568123924.0
        }
      ]
    },
    {
      "id": "eztsh9r",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1568137633.0,
      "score": 1,
      "context": [
        {
          "id": "ezt86kw",
          "author": "LuxandGold",
          "body": "Thank you for typing this up today. I've just returned from a meeting with a nutritionist in my own journey in recovery. I can't tell you the number of times I have felt like a failure before getting help. This is the first time I've been able to actually meet properly with doctors and been taken seriously about my eating disorder and I am terrified that once again, I'm going to fail. \n\nI needed to read this today. Thank you.",
          "created_utc": 1568123924.0
        }
      ]
    },
    {
      "id": "eztdbi6",
      "author": "LuxandGold",
      "body": "Thank you, that means the world.",
      "created_utc": 1568127599.0,
      "score": 1,
      "context": [
        {
          "id": "ezt86kw",
          "author": "LuxandGold",
          "body": "Thank you for typing this up today. I've just returned from a meeting with a nutritionist in my own journey in recovery. I can't tell you the number of times I have felt like a failure before getting help. This is the first time I've been able to actually meet properly with doctors and been taken seriously about my eating disorder and I am terrified that once again, I'm going to fail. \n\nI needed to read this today. Thank you.",
          "created_utc": 1568123924.0
        },
        {
          "id": "ezt92ev",
          "author": "wernerherzogsurethra",
          "body": "I am so pleased to hear you're getting proper support! It really, truly helps to have someone on your side who actually cares.\n\nIf you ever want to talk or need a buddy for the journey, please don't hesitate to reach out. I'm happy to listen and help.",
          "created_utc": 1568124584.0
        }
      ]
    },
    {
      "id": "eztvp4d",
      "author": "LuxandGold",
      "body": "To put it bluntly, I burst into tears in a doctors office. \n\nI had been registering as underweight at my doctors for years but hadn't been picked up. I moved across the country, and, at my registering appointment, I was weighed, and burst into tears. \n\nI said I was sick of not being taken seriously, that I had a completely debilitating eating disorder that was completely taking over every aspect of my life, and if I wasn't going to get help, then what was the actual point of doctors. \n\nYou may find your particular case is symptomatic of something else. I am surprised you haven't been tested for Autism, as this particular kind of eating disorder falls under the sensory issues that those with Autism usually have. \n\nI'm afraid you may have to start writing complaints, but keep trying. If I got there, you can too.",
      "created_utc": 1568139687.0,
      "score": 2,
      "context": [
        {
          "id": "ezt86kw",
          "author": "LuxandGold",
          "body": "Thank you for typing this up today. I've just returned from a meeting with a nutritionist in my own journey in recovery. I can't tell you the number of times I have felt like a failure before getting help. This is the first time I've been able to actually meet properly with doctors and been taken seriously about my eating disorder and I am terrified that once again, I'm going to fail. \n\nI needed to read this today. Thank you.",
          "created_utc": 1568123924.0
        },
        {
          "id": "eztsh9r",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1568137633.0
        }
      ]
    }
  ]
}