{
  "id": "d4dwqo",
  "subreddit": "ARFID",
  "author": "c21h30o2--",
  "created_utc": 1568509799.0,
  "title": "I really wish menus were more descriptive",
  "selftext": "I just hate it when you deliberately order something simple and it comes with some topping or sauce that wasn’t mentioned anywhere. I don’t remember to ask every time and it bugs me. It’s unfair to people with ARFID as well as people with allergies. Going out to eat is already hard enough, I just want to know what I’m getting.",
  "url": "https://www.reddit.com/r/ARFID/comments/d4dwqo/i_really_wish_menus_were_more_descriptive/",
  "score": 140,
  "num_comments": 12,
  "comments": [
    {
      "id": "f0a4cka",
      "author": "MattT127",
      "body": "That reminds me, I was at this bar the other night, and saw something called “bag o’ fries”. Figured it was right up my alley, so I ordered it. Little bit later, waitress comes out with something that is nothing but colors: green, white, orange, etc; looked more like a Mexican meal. \n\nI told her she must have the wrong order, and she looks at me funny and says “bag of fries, right?” Turns out that it was fries smothered in all kinda of nonsense. Yet this was never even remotely stated on the menu, only “bag o’ fries”",
      "created_utc": 1568510470.0,
      "score": 52,
      "context": []
    },
    {
      "id": "f0a9z4x",
      "author": "leafo777",
      "body": "I hate having to ask questions too, especially about stuff that should be fairly simple. It just brings more attention to the fact that I'm \"picky\".",
      "created_utc": 1568512309.0,
      "score": 37,
      "context": []
    },
    {
      "id": "f0aw8z6",
      "author": "jesd2",
      "body": "This reminds me of the time I went to Cheesecake Factory, I got the chicken teriyaki which was described as chicken teriyaki with white rice. The plate comes, it has weird salsa and vegetables everywhere. I had to get all the veggies off and something in their pineapple salsa made me sick and I don’t know what. It was awful",
      "created_utc": 1568519606.0,
      "score": 22,
      "context": []
    },
    {
      "id": "f0eauxf",
      "author": "Tranquilcobra",
      "body": "One time I ordered a plain margherita pizza because it's my safe choice, the waiter brings it over and there's just big slices of tomato on it. This wasn't mentioned, it wasn't pictured. I'm not yet someone who tells them it wasnt what I ordered but I felt so embarrassed having to take them off or slice around them.",
      "created_utc": 1568565611.0,
      "score": 11,
      "context": []
    },
    {
      "id": "f0fs8o3",
      "author": "cera52",
      "body": "Anytime I go out to eat I plan what I’m going to order by checking pictures of what I think I’d like on Yelp/google reviews. It’s saved me from wasting money and feeling embarrassed so many times.",
      "created_utc": 1568588402.0,
      "score": 8,
      "context": []
    },
    {
      "id": "f0o3csk",
      "author": "auspostery",
      "body": "I moved to another country, from the nyc area, and I ask every. Single. Time. If the sandwich/burger comes with mayo. 95% of the time the answer is yes, and probably 90% of the time it wasn’t written on the menu. It’s horrifying, and makes me so annoyed. Sometimes if I’m feeling snarky I’ll act really surprised and say “oh it doesss??? It’s not anywhere on the menu!!”",
      "created_utc": 1568792806.0,
      "score": 7,
      "context": []
    },
    {
      "id": "f0knvwl",
      "author": "prettypeepers",
      "body": "Dude, i had this experience when i was in disney world, animal kingdom! we went to eat at this place near the avatar themed rides, and already i was very cautious of the menu. eventually the thing i got comes out- and its full of weird vegetables and junk! these were not listed on the menu at all. and to top it all off, the food was INSANELY expensive! I felt so bad because i didn't end up eating all of it, and it just felt like such a waste of money",
      "created_utc": 1568683626.0,
      "score": 4,
      "context": []
    },
    {
      "id": "f6keuw0",
      "author": "None",
      "body": "I know this post is old but this is me ordering anything with ground beef (quesadilla, tacos, etc) praying it isn’t seasoned and is, just in fact, the plain meat",
      "created_utc": 1572911181.0,
      "score": 1,
      "context": []
    },
    {
      "id": "f0w1hrk",
      "author": "c21h30o2--",
      "body": "I always find myself scanning the restaurant looking at the food to see if it’s covered in anything. But I feel weird looking at people’s food because I always feel like people are looking at my food and judging me for being boring or immature.",
      "created_utc": 1568996815.0,
      "score": 1,
      "context": [
        {
          "id": "f0fs8o3",
          "author": "cera52",
          "body": "Anytime I go out to eat I plan what I’m going to order by checking pictures of what I think I’d like on Yelp/google reviews. It’s saved me from wasting money and feeling embarrassed so many times.",
          "created_utc": 1568588402.0
        }
      ]
    },
    {
      "id": "f0ohqyj",
      "author": "c21h30o2--",
      "body": "Mayo is such a commonly disliked food as well. I know loads of people without ARFID who can’t stand it. \n\nIt’s just so annoying when things aren’t listed on the menu. If you go to buy a product in a store you expect to get exactly what’s written on the website or catalogue, not a bunch of extra stuff you didn’t want. It’s weird that when it’s food, businesses are for some reason allowed to be less descriptive, especially when there’s people literally dying because their allergies weren’t written on the menu. How is it so hard to state everything that you’re selling??",
      "created_utc": 1568811452.0,
      "score": 4,
      "context": [
        {
          "id": "f0o3csk",
          "author": "auspostery",
          "body": "I moved to another country, from the nyc area, and I ask every. Single. Time. If the sandwich/burger comes with mayo. 95% of the time the answer is yes, and probably 90% of the time it wasn’t written on the menu. It’s horrifying, and makes me so annoyed. Sometimes if I’m feeling snarky I’ll act really surprised and say “oh it doesss??? It’s not anywhere on the menu!!”",
          "created_utc": 1568792806.0
        }
      ]
    },
    {
      "id": "f0oi0c7",
      "author": "c21h30o2--",
      "body": "It’s ridiculous that we’re expected to pay for food that we can’t eat when it’s not even what we ordered. Food at amusement parks and stuff is always so overpriced and you’re limited to what’s there, so to not put the whole meal on the menu is especially bad in this case. I don’t have a bunch of money lying around to order fries at 3 different places until I get plain ones.",
      "created_utc": 1568811671.0,
      "score": 3,
      "context": [
        {
          "id": "f0knvwl",
          "author": "prettypeepers",
          "body": "Dude, i had this experience when i was in disney world, animal kingdom! we went to eat at this place near the avatar themed rides, and already i was very cautious of the menu. eventually the thing i got comes out- and its full of weird vegetables and junk! these were not listed on the menu at all. and to top it all off, the food was INSANELY expensive! I felt so bad because i didn't end up eating all of it, and it just felt like such a waste of money",
          "created_utc": 1568683626.0
        }
      ]
    },
    {
      "id": "f1btg58",
      "author": "prettypeepers",
      "body": "Yeah exactly! Like, how hard is it to be descriptive? Like, what if someone was allergic to whats in there and had an allergic reaction? Like, it feels just super lazy on the people at the restaurants",
      "created_utc": 1569342581.0,
      "score": 2,
      "context": [
        {
          "id": "f0knvwl",
          "author": "prettypeepers",
          "body": "Dude, i had this experience when i was in disney world, animal kingdom! we went to eat at this place near the avatar themed rides, and already i was very cautious of the menu. eventually the thing i got comes out- and its full of weird vegetables and junk! these were not listed on the menu at all. and to top it all off, the food was INSANELY expensive! I felt so bad because i didn't end up eating all of it, and it just felt like such a waste of money",
          "created_utc": 1568683626.0
        },
        {
          "id": "f0oi0c7",
          "author": "c21h30o2--",
          "body": "It’s ridiculous that we’re expected to pay for food that we can’t eat when it’s not even what we ordered. Food at amusement parks and stuff is always so overpriced and you’re limited to what’s there, so to not put the whole meal on the menu is especially bad in this case. I don’t have a bunch of money lying around to order fries at 3 different places until I get plain ones.",
          "created_utc": 1568811671.0
        }
      ]
    }
  ]
}