{
  "id": "d8nl25",
  "subreddit": "ARFID",
  "author": "shutthe_fukup",
  "created_utc": 1569333567.0,
  "title": "Found this subreddit and feel super privileged",
  "selftext": "I didn't know this was a disorder,I was just always labeled as a \"picky eater\".The reason why I feel so privileged is because I've been reading some of the stories on this sub and am shocked that some people were abused by their parents for it.\n\nFor as long as I can remember,my mom was always accepting and accomodating.Even if she didn't understand my anxiety and unwillingness around most foods,she would never say anything hurtful.She was encouraging and even found ways for me to eat healthy.\n\nOne example is the soup she made.Ordinary soup with noodles but what I didn't know was that she would strain/filter the soup cause it cooked with vegetables.It was expertly made so that the vegetable taste wasn't prominent but the nutrients were still there.\n\nI love my mom and can't thank her enough for everything she did for me.",
  "url": "https://www.reddit.com/r/ARFID/comments/d8nl25/found_this_subreddit_and_feel_super_privileged/",
  "score": 143,
  "num_comments": 3,
  "comments": [
    {
      "id": "f1bukk9",
      "author": "roslya-1234",
      "body": "That’s the same as my mum too. Bless her soul.",
      "created_utc": 1569343299.0,
      "score": 17,
      "context": []
    },
    {
      "id": "f1ccvwm",
      "author": "friendlyyan",
      "body": "I have supportive parents too (I'm 27 now & have had ARFID since very, very young). They push sometimes because they obviously want me to be healthy. But they NEVER force fed me. I was even luckier that I also had a supportive doctor who told my mom not to try that anyway.\n\nToo bad the rest of my family (aunts/uncles/etc) wasn't like that! Sometimes when I went to their houses, I would have to go home from hyperventilating when they tried to make eat something I didn't like.",
      "created_utc": 1569354949.0,
      "score": 16,
      "context": []
    },
    {
      "id": "f1e67vq",
      "author": "ock_wrong_lee_neck",
      "body": "Same, my mum would make broth specially for me just so I could get some extra nutrients/ calories in. She would cook my food aside just so it wouldn't get spices. Make lunch for me. Separate food on my plate....\n\nThen my granny would choke down milk soup with pasta down my throat and call me a child of Satan. (Not in those words lol)",
      "created_utc": 1569413976.0,
      "score": 4,
      "context": [
        {
          "id": "f1ccvwm",
          "author": "friendlyyan",
          "body": "I have supportive parents too (I'm 27 now & have had ARFID since very, very young). They push sometimes because they obviously want me to be healthy. But they NEVER force fed me. I was even luckier that I also had a supportive doctor who told my mom not to try that anyway.\n\nToo bad the rest of my family (aunts/uncles/etc) wasn't like that! Sometimes when I went to their houses, I would have to go home from hyperventilating when they tried to make eat something I didn't like.",
          "created_utc": 1569354949.0
        }
      ]
    }
  ]
}