{
  "id": "djlblg",
  "subreddit": "ARFID",
  "author": "Jojolynes",
  "created_utc": 1571393062.0,
  "title": "I don’t feel alone.",
  "selftext": "Seeing this sub made me legit burst out in tears, mainly because I finally found a place where people can understand where I’m coming from. The struggle I have with food, and how difficult it can be to cope. I’m 21, been diagnosed with OCD, and food plays a big part in my everyday anxiety.\n\nI can’t stand eating in front of others, I avoid it like the plague. I order food off the kids menu and come up with excuses that it’s for a younger sibling. Every time I eat with people, they look at me weird. I tend to eat before going out, and it’s easy to feel so isolated when food is involved. \n\nI wish I didn’t have this, and so many people don’t understand how you can’t just “try it” and be okay. But now, I have the support and knowledge from you guys. I’ve gone all these years frustrated and alone, but I’m glad we can all relate to those feelings. Thank you 💕",
  "url": "https://www.reddit.com/r/ARFID/comments/djlblg/i_dont_feel_alone/",
  "score": 89,
  "num_comments": 7,
  "comments": [
    {
      "id": "f45xk95",
      "author": "snakeofsilver",
      "body": "offend ink start silky chubby edge berserk humorous simplistic seemly\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
      "created_utc": 1571399518.0,
      "score": 9,
      "context": []
    },
    {
      "id": "f46654j",
      "author": "AshleyVakarian",
      "body": "I completely agree!! Just found this sub today after some googling and I am so grateful. Work events cause me so much anxiety it's unbearable, especially because most of them are centered around food. It's so embarrassing, I've had coworkers ask if I'm doing intermittent fasting and I just went along with it to explain my lack of eating.",
      "created_utc": 1571404631.0,
      "score": 5,
      "context": []
    },
    {
      "id": "f489hli",
      "author": "ebm420",
      "body": "You’re not alone!!! I have ocd and arfid as well... they go hand and hand in the fear of eating. There are a few great Facebook groups for ocd and arfid both. I’d love to talk about how it effects you , I don’t know anyone else with both!",
      "created_utc": 1571434695.0,
      "score": 2,
      "context": []
    },
    {
      "id": "f46p28s",
      "author": "giraffemoo",
      "body": "I am 35 and I recently found this group. The only reason I'm in an okay place with my ARFID right now is because I'm kind of a shut in, I totally get the feelings of not wanting to eat around other people and it sucks that this is a thing that I have to warn people about before we hang out. I'm glad I found this group and so many other people like me.",
      "created_utc": 1571411648.0,
      "score": 1,
      "context": []
    },
    {
      "id": "f49zm57",
      "author": "Jintje",
      "body": "I went to a choir weekend last week, and I had to call in advance to ask the restaurant if I could order things off the kid's menu instead of the set menu my choir had. I was almost in tears on the phone and I DREADED going to the weekend, even though it was supposed to be fun. When we had dinner I got all the questions and comments and I just wanted to vanish. During lunch time I lied and said I'd eaten already just to avoid the subject. It's so good to find out I'm not alone!",
      "created_utc": 1571486675.0,
      "score": 1,
      "context": []
    },
    {
      "id": "f46e7il",
      "author": "lilmzmetalhead",
      "body": "Yes. Now that I'm almost in my 30s, I have been more upfront about it and I just tell people I have a disorder.",
      "created_utc": 1571407609.0,
      "score": 3,
      "context": [
        {
          "id": "f45xk95",
          "author": "snakeofsilver",
          "body": "offend ink start silky chubby edge berserk humorous simplistic seemly\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
          "created_utc": 1571399518.0
        }
      ]
    }
  ]
}