{
  "id": "doc4ay",
  "subreddit": "ARFID",
  "author": "c21h30o2--",
  "created_utc": 1572284018.0,
  "title": "Just goes to show you how many people don’t know that ARFID is a legitimate eating disorder",
  "selftext": "",
  "url": "https://www.reddit.com/r/AmItheAsshole/comments/do9m6f/aita_for_getting_frustrated_at_my_sos_eating/",
  "score": 91,
  "num_comments": 34,
  "comments": [
    {
      "id": "f5lwpsr",
      "author": "c21h30o2--",
      "body": "It really gets me that so many people see ARFID as immaturity or closed mindedness, when it’s an illness that severely affects people’s lives. Nobody is trying to spite their partner by having a limited diet. None of us asked for this to happen.",
      "created_utc": 1572284196.0,
      "score": 76,
      "context": []
    },
    {
      "id": "f5msysn",
      "author": "fruitcup94",
      "body": "seeing how many people saying their SO is a toddler for being uncomfortable trying new foods is making me really sad. makes me grateful for the people in my life who are actually patient with me instead of calling me a toddler and forcing me into something i’m not ready for.",
      "created_utc": 1572293351.0,
      "score": 72,
      "context": []
    },
    {
      "id": "f5nwmxr",
      "author": "None",
      "body": "2nd top comment: “Your SO sounds immature, stubborn, and selfish.”\n\nMy father and I went to Germany.  I ate tons of authentic German food that was new to me.  My father ate entirely McDonalds, pretzels, and bier, and really nothing else.\n\nWe both enjoyed our vacation equally.  Nothing about my experience was changed by my father dropping by McDonalds after dinner to get something he would like to eat and eating it on the way home.\n\nIs there anything more “selfish” that trying to control what your SO eats at a restaurant?  If he wants to order a plain steak in Spain and skips the paella, what does that change?  What’s more important is that you both find food you enjoy and support each other.",
      "created_utc": 1572305096.0,
      "score": 70,
      "context": []
    },
    {
      "id": "f5ogw59",
      "author": "None",
      "body": "The sad part is that so many people have it and don't know it's a thing. That struggle is the worst. \n\nMy therapist was telling me there's more dsm changes to the eating disorder category in the making, so I really hope that helps us out.",
      "created_utc": 1572317822.0,
      "score": 21,
      "context": []
    },
    {
      "id": "f5n1dx3",
      "author": "Mem-Boi-901",
      "body": "Lmao if I could overcome it I would immediately.  It so hard deal with it because its a legit disorder but at the same time how tf do you truly explain it to someone without looking like a freak.",
      "created_utc": 1572295711.0,
      "score": 45,
      "context": []
    },
    {
      "id": "f5mlusu",
      "author": "Jintje",
      "body": "This makes me so sad. I've been this person while on a mandatory school trip to Spain, and 2 of the 3 nights I went with friends to their restaurant of choice and got myself some McDonalds on the way back to the hotel. The 3rd night I just went to McDonalds on my own because nobody even wanted to take me to a restaurant because they felt too awkward having me only drink something there and not eat. If my partner expected me to eat paella which contains about 10 ingredients I can't handle, I'd just not go on the trip at all.",
      "created_utc": 1572291241.0,
      "score": 29,
      "context": []
    },
    {
      "id": "f5opp6y",
      "author": "omega206",
      "body": "It's crazy to think how many people dont know what arfid is and how bad it can affect someone. I'm sorry I can't eat stuff without immediately throwing up I dont know why it happens but it just does, also fuck people who say \"you wont know if you like it if you havent tried it\" cause I do know if I wont like it and it shouldn't matter to you if I do or not.",
      "created_utc": 1572326110.0,
      "score": 13,
      "context": []
    },
    {
      "id": "f5oxa15",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1572337510.0,
      "score": 12,
      "context": []
    },
    {
      "id": "f5prs2p",
      "author": "luvdisclover",
      "body": "“id rather be a picky eater then a pushy eater” amen",
      "created_utc": 1572366326.0,
      "score": 11,
      "context": []
    },
    {
      "id": "f5po2td",
      "author": "None",
      "body": "Having ARFID is more frustrating for me than my SO because I wish I could just order off menu and not cry and sweat and do everything to not gag and throw up in public. Let me tell you there is nothing good about breaking down in a taco bell because there's sour cream on your chips and beans. So I eat beforehand and we go out to dinner and I get drinks and a side salad maybe with everything on the side. I can't imagine my husband coming to Reddit to complain about me and then agreeing with everyone calling me a selfish child. He wouldn't be my husband for much longer acting like a douche canoe.",
      "created_utc": 1572363947.0,
      "score": 9,
      "context": []
    },
    {
      "id": "f5pjoub",
      "author": "ManicInnkeeper",
      "body": "It does suck, but it seems every time one of these pops up someone in the comments points straight to ARFID. There may be hope yet!",
      "created_utc": 1572361002.0,
      "score": 3,
      "context": []
    },
    {
      "id": "f5tfiw1",
      "author": "None",
      "body": "People get so riled up over other people’s eating habits. There seems to be an especially strong dislike for ‘picky eaters’. \n\nRandom thought, personally I’ve never come across an adult who was truly a ‘picky eater’ apart from myself (or maybe I have and didn’t know it). I feel like some people’s standards of what constitutes picky are ridiculously high on that thread.",
      "created_utc": 1572457488.0,
      "score": 3,
      "context": []
    },
    {
      "id": "f5p2ntx",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1572346009.0,
      "score": -3,
      "context": []
    },
    {
      "id": "f5lxqal",
      "author": "Squids_be_like__-0-",
      "body": "So what do you suggest I do? Swallow my frustration and miss out on a major part of exploring another country because my SO can't stand eating something he doesn't like? I'm not antagonizing him, but I refuse to have a trip abroad dictated by his strict eating habits. I normally conform to him, and what I need is for him to conform a little bit more to me for this trip.",
      "created_utc": 1572284542.0,
      "score": -84,
      "context": [
        {
          "id": "f5lwpsr",
          "author": "c21h30o2--",
          "body": "It really gets me that so many people see ARFID as immaturity or closed mindedness, when it’s an illness that severely affects people’s lives. Nobody is trying to spite their partner by having a limited diet. None of us asked for this to happen.",
          "created_utc": 1572284196.0
        }
      ]
    },
    {
      "id": "f5nbx6h",
      "author": "None",
      "body": "Hear, hear!  I'm glad I like enough foods that I can disguise my issues.  It's only when people want ethnic food(Chinese, Mexican, etc) that there's a problem.  Thankfully most of my friends are poor like me, so it's usually fast food for us. :P",
      "created_utc": 1572298595.0,
      "score": 16,
      "context": [
        {
          "id": "f5msysn",
          "author": "fruitcup94",
          "body": "seeing how many people saying their SO is a toddler for being uncomfortable trying new foods is making me really sad. makes me grateful for the people in my life who are actually patient with me instead of calling me a toddler and forcing me into something i’m not ready for.",
          "created_utc": 1572293351.0
        }
      ]
    },
    {
      "id": "f5ol5y8",
      "author": "shewshine",
      "body": "Exactly! All the top comments say that they’re being childish and it’s so sad to see how many people are agreeing with them. Definitely makes you appreciate those around you that understand where you’re coming from.",
      "created_utc": 1572321383.0,
      "score": 12,
      "context": [
        {
          "id": "f5msysn",
          "author": "fruitcup94",
          "body": "seeing how many people saying their SO is a toddler for being uncomfortable trying new foods is making me really sad. makes me grateful for the people in my life who are actually patient with me instead of calling me a toddler and forcing me into something i’m not ready for.",
          "created_utc": 1572293351.0
        }
      ]
    },
    {
      "id": "f5oygfm",
      "author": "c21h30o2--",
      "body": "It’s probably ignorance. Maybe if there was more awareness about ARFID, less people would see us like that. Maybe if a video or an article came out that wasn’t about someone having extreme health consequences or didn’t frame them as being strange or unordinary. It makes me sad and angry that people that I don’t even though are basically judging me by proxy about something I can’t control. I’ve lost family members and friends because of my disorder. Maybe if they could’ve understood that wouldn’t have happened. We need more awareness.",
      "created_utc": 1572339485.0,
      "score": 9,
      "context": [
        {
          "id": "f5msysn",
          "author": "fruitcup94",
          "body": "seeing how many people saying their SO is a toddler for being uncomfortable trying new foods is making me really sad. makes me grateful for the people in my life who are actually patient with me instead of calling me a toddler and forcing me into something i’m not ready for.",
          "created_utc": 1572293351.0
        }
      ]
    },
    {
      "id": "f5njdd7",
      "author": "Melon_Cooler",
      "body": "\"Yeah hey guys, can you please stop shoving cucumbers in my face and telling me to try it, I'd rather not gag and potentially vomit in the middle of the cafeteria.\"",
      "created_utc": 1572300806.0,
      "score": 21,
      "context": [
        {
          "id": "f5n1dx3",
          "author": "Mem-Boi-901",
          "body": "Lmao if I could overcome it I would immediately.  It so hard deal with it because its a legit disorder but at the same time how tf do you truly explain it to someone without looking like a freak.",
          "created_utc": 1572295711.0
        }
      ]
    },
    {
      "id": "f5oysv7",
      "author": "c21h30o2--",
      "body": "This guy is whining that he’s not going to enjoy his perfect vacation because his partner has a mental illness. Yeah, food is a big part of exploring a new culture, but it’s not like their partner has a mental illness out of spite. They’re probably upset that they’re missing out because of something out of their control, and instead of getting, I don’t know, an ounce of support from their partner, they get ridiculed on the internet by a bunch of ignorant strangers. \n\nI genuinely believe that if ARFID was a well known mental illness, the comments would all be telling OP that they’re the asshole. I just wish there was more awareness. It would pave the way to acceptable, accommodation, and better treatment. Maybe I’m just being hopeful, but if people knew and tried to understand, I don’t think they’d be so cruel.",
      "created_utc": 1572340074.0,
      "score": 10,
      "context": [
        {
          "id": "f5oxa15",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1572337510.0
        }
      ]
    },
    {
      "id": "f5skfkq",
      "author": "c21h30o2--",
      "body": "I’m definitely stealing this saying",
      "created_utc": 1572434478.0,
      "score": 1,
      "context": [
        {
          "id": "f5prs2p",
          "author": "luvdisclover",
          "body": "“id rather be a picky eater then a pushy eater” amen",
          "created_utc": 1572366326.0
        }
      ]
    },
    {
      "id": "f61my37",
      "author": "joshb44231",
      "body": "While I don’t agree with your delivery and calling everyone there an incel, I do agree that she is being an asshole in that she’s making it all about her. He does sound like he has SED or ARFID, and it’s a shame nobody seems to care enough to look into it. I’m glad a lot of our people here came to the comments to raise awareness though.",
      "created_utc": 1572642803.0,
      "score": 1,
      "context": [
        {
          "id": "f5p2ntx",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1572346009.0
        }
      ]
    },
    {
      "id": "f5m0m0p",
      "author": "c21h30o2--",
      "body": "Someone else suggested that your SO could eat beforehand at a fast food restaurant or have a meal at your hotel, and then they could get drinks or a side at the restaurants that you want to go to. That’s what my ex-partner and I used to do when we travelled. He’s a very adventurous eater so I agreed to try three new things every time we travelled. I almost threw up a few times, and I was never able to handle more than a bite of his food, but it was a way of sharing his experience with me. Keep in mind this might be difficult for your SO depending on the severity of their disorder. \n\nAt the end of the day, if this is a reoccurring issue, it might be time to assess if this is a deal breaker or not. There’s only a certain degree to which a person with ARFID can conform to “normal” eating habits, and there’s only so much others are willing to tolerate. Look into treatment or therapy if that’s available, but keep in mind that for a lot of people this is a life long thing. In the mean time, have a discussion about working around things. If you can’t, might be time to have a hard talk.",
      "created_utc": 1572285301.0,
      "score": 58,
      "context": [
        {
          "id": "f5lwpsr",
          "author": "c21h30o2--",
          "body": "It really gets me that so many people see ARFID as immaturity or closed mindedness, when it’s an illness that severely affects people’s lives. Nobody is trying to spite their partner by having a limited diet. None of us asked for this to happen.",
          "created_utc": 1572284196.0
        },
        {
          "id": "f5lxqal",
          "author": "Squids_be_like__-0-",
          "body": "So what do you suggest I do? Swallow my frustration and miss out on a major part of exploring another country because my SO can't stand eating something he doesn't like? I'm not antagonizing him, but I refuse to have a trip abroad dictated by his strict eating habits. I normally conform to him, and what I need is for him to conform a little bit more to me for this trip.",
          "created_utc": 1572284542.0
        }
      ]
    },
    {
      "id": "f5mdwe7",
      "author": "joan-117",
      "body": "This of it as he is physically incapable of just “conforming a little bit”. Yes its frustrating, it is very hard for you to navigate his eating habits, but it is much harder for him to live his own life. You wouldn’t ask a person with anxiety to just be “less anxious for a bit so I can feel better”. There are ways to go about it without being hostile, which can in turn make a condition like ARFID worse. My husband is learning with me, and is open to working it out despite our frustrations. He is a huge food enthusiast and doesn’t live his life with any less enjoyment because of me. Its compromise and sacrifice on both ends, but there is no need to take it out on him.",
      "created_utc": 1572289059.0,
      "score": 45,
      "context": [
        {
          "id": "f5lwpsr",
          "author": "c21h30o2--",
          "body": "It really gets me that so many people see ARFID as immaturity or closed mindedness, when it’s an illness that severely affects people’s lives. Nobody is trying to spite their partner by having a limited diet. None of us asked for this to happen.",
          "created_utc": 1572284196.0
        },
        {
          "id": "f5lxqal",
          "author": "Squids_be_like__-0-",
          "body": "So what do you suggest I do? Swallow my frustration and miss out on a major part of exploring another country because my SO can't stand eating something he doesn't like? I'm not antagonizing him, but I refuse to have a trip abroad dictated by his strict eating habits. I normally conform to him, and what I need is for him to conform a little bit more to me for this trip.",
          "created_utc": 1572284542.0
        }
      ]
    },
    {
      "id": "f5ml0uw",
      "author": "Jintje",
      "body": "Speaking from experience, the conforming you ask of could be him vomiting all over your and his plate in a restaurant while trying something new. Happened to me several times when trying something at home, so I don't wanna try anything in a restaurant where vomiting would ruin the appetite and night out of several people. u/c21h30o2\\--'s suggestion of your SO eating something before or after your meals out could be the perfect compromise.",
      "created_utc": 1572291063.0,
      "score": 36,
      "context": [
        {
          "id": "f5lwpsr",
          "author": "c21h30o2--",
          "body": "It really gets me that so many people see ARFID as immaturity or closed mindedness, when it’s an illness that severely affects people’s lives. Nobody is trying to spite their partner by having a limited diet. None of us asked for this to happen.",
          "created_utc": 1572284196.0
        },
        {
          "id": "f5lxqal",
          "author": "Squids_be_like__-0-",
          "body": "So what do you suggest I do? Swallow my frustration and miss out on a major part of exploring another country because my SO can't stand eating something he doesn't like? I'm not antagonizing him, but I refuse to have a trip abroad dictated by his strict eating habits. I normally conform to him, and what I need is for him to conform a little bit more to me for this trip.",
          "created_utc": 1572284542.0
        }
      ]
    },
    {
      "id": "f5nku9a",
      "author": "centsy",
      "body": "Another way to think of it is that it’s like being mad at a partner who refuses to go mountain climbing with you because they won’t get out of their wheelchair. We look at that situation and think it’s obviously ridiculous, but ARFID is similar, only the disability isn’t visible and obvious. \n\nI hate to say it, but your relationship may hinge on being able to work with him in this illness and find a solution that works for you both. If adventurous eating is vital to your lifestyle and it’s important you you have someone to share that with, it’s possible that’s just going to be an incompatibility between you and your partner.",
      "created_utc": 1572301285.0,
      "score": 31,
      "context": [
        {
          "id": "f5lwpsr",
          "author": "c21h30o2--",
          "body": "It really gets me that so many people see ARFID as immaturity or closed mindedness, when it’s an illness that severely affects people’s lives. Nobody is trying to spite their partner by having a limited diet. None of us asked for this to happen.",
          "created_utc": 1572284196.0
        },
        {
          "id": "f5lxqal",
          "author": "Squids_be_like__-0-",
          "body": "So what do you suggest I do? Swallow my frustration and miss out on a major part of exploring another country because my SO can't stand eating something he doesn't like? I'm not antagonizing him, but I refuse to have a trip abroad dictated by his strict eating habits. I normally conform to him, and what I need is for him to conform a little bit more to me for this trip.",
          "created_utc": 1572284542.0
        }
      ]
    },
    {
      "id": "f5nykwd",
      "author": "flaiad",
      "body": "If he were anorexic would you be able to understand this a little better? It's not a decision he's making that he can just change to suit you.",
      "created_utc": 1572306119.0,
      "score": 29,
      "context": [
        {
          "id": "f5lwpsr",
          "author": "c21h30o2--",
          "body": "It really gets me that so many people see ARFID as immaturity or closed mindedness, when it’s an illness that severely affects people’s lives. Nobody is trying to spite their partner by having a limited diet. None of us asked for this to happen.",
          "created_utc": 1572284196.0
        },
        {
          "id": "f5lxqal",
          "author": "Squids_be_like__-0-",
          "body": "So what do you suggest I do? Swallow my frustration and miss out on a major part of exploring another country because my SO can't stand eating something he doesn't like? I'm not antagonizing him, but I refuse to have a trip abroad dictated by his strict eating habits. I normally conform to him, and what I need is for him to conform a little bit more to me for this trip.",
          "created_utc": 1572284542.0
        }
      ]
    },
    {
      "id": "f5p6xgi",
      "author": "SevenLight",
      "body": "I think it's such a pity that your reaction to finding out your partner likely has an eating disorder is \"So what, I just have to swallow my frustration?\"\n\nLook, food is not the be all and end all of a country's culture. You can handle enjoying that *one* part of it on your own. You got validated by a bunch of similarly righteous redditors, but in my opinion, you actually are kinda the ass, because you're expecting something of your partner that he can't do yet (with actual support and help, he maybe could in the future). Come on, lady, there's people with real problems in the world.",
      "created_utc": 1572350919.0,
      "score": 22,
      "context": [
        {
          "id": "f5lwpsr",
          "author": "c21h30o2--",
          "body": "It really gets me that so many people see ARFID as immaturity or closed mindedness, when it’s an illness that severely affects people’s lives. Nobody is trying to spite their partner by having a limited diet. None of us asked for this to happen.",
          "created_utc": 1572284196.0
        },
        {
          "id": "f5lxqal",
          "author": "Squids_be_like__-0-",
          "body": "So what do you suggest I do? Swallow my frustration and miss out on a major part of exploring another country because my SO can't stand eating something he doesn't like? I'm not antagonizing him, but I refuse to have a trip abroad dictated by his strict eating habits. I normally conform to him, and what I need is for him to conform a little bit more to me for this trip.",
          "created_utc": 1572284542.0
        }
      ]
    },
    {
      "id": "f5ofck3",
      "author": "exnihilocreatio",
      "body": "it's not his fault he \"doesn't like\" a lot of foods. people with arfid genuinely can't eat some foods. i personally will gag if i try to eat something i can't, and in more severe cases than mine people can throw up without even swallowing the food. it's a genuine disorder and a lot of us can't even try new foods.\n\ni know your so probably isn't diagnosed with arfid, but it definitely sounds like something's up. get him to talk to a psychologist or nutritionist or even his general doctor. there's treatment. it isn't his fault he's picky.",
      "created_utc": 1572316684.0,
      "score": 17,
      "context": [
        {
          "id": "f5lwpsr",
          "author": "c21h30o2--",
          "body": "It really gets me that so many people see ARFID as immaturity or closed mindedness, when it’s an illness that severely affects people’s lives. Nobody is trying to spite their partner by having a limited diet. None of us asked for this to happen.",
          "created_utc": 1572284196.0
        },
        {
          "id": "f5lxqal",
          "author": "Squids_be_like__-0-",
          "body": "So what do you suggest I do? Swallow my frustration and miss out on a major part of exploring another country because my SO can't stand eating something he doesn't like? I'm not antagonizing him, but I refuse to have a trip abroad dictated by his strict eating habits. I normally conform to him, and what I need is for him to conform a little bit more to me for this trip.",
          "created_utc": 1572284542.0
        }
      ]
    },
    {
      "id": "f5p1djz",
      "author": "morerokk",
      "body": "What part of \"eating disorder\" do you not understand?\n\nThere are so many different ways to fix this. Have him eat something else or somewhere else. Why is it *his* problem that **you** want to try out the local food? Go try it out, nobody is stopping you.\n\nHe has ARFID and he's stuck with it. If you force him to go with you, he will *certainly* end up gagging and might even end up vomiting. And of course when that happens, you'll be angry *too*. There's no winning.\n\n> and what I need is for him to conform a little bit more to me for this trip.\n\nYou are trying to control where and what he eats because *you* can't/won't eat by yourself. That is entirely your own problem. Your boyfriend suggested several compromises, but for you it's \"my way or the highway\".",
      "created_utc": 1572344195.0,
      "score": 13,
      "context": [
        {
          "id": "f5lwpsr",
          "author": "c21h30o2--",
          "body": "It really gets me that so many people see ARFID as immaturity or closed mindedness, when it’s an illness that severely affects people’s lives. Nobody is trying to spite their partner by having a limited diet. None of us asked for this to happen.",
          "created_utc": 1572284196.0
        },
        {
          "id": "f5lxqal",
          "author": "Squids_be_like__-0-",
          "body": "So what do you suggest I do? Swallow my frustration and miss out on a major part of exploring another country because my SO can't stand eating something he doesn't like? I'm not antagonizing him, but I refuse to have a trip abroad dictated by his strict eating habits. I normally conform to him, and what I need is for him to conform a little bit more to me for this trip.",
          "created_utc": 1572284542.0
        }
      ]
    },
    {
      "id": "f5p6vw9",
      "author": "Kelekona",
      "body": "Would you be more understanding if he were physically allergic to most foods?  He probably would love to be able to eat out with you if he could.",
      "created_utc": 1572350875.0,
      "score": 6,
      "context": [
        {
          "id": "f5lwpsr",
          "author": "c21h30o2--",
          "body": "It really gets me that so many people see ARFID as immaturity or closed mindedness, when it’s an illness that severely affects people’s lives. Nobody is trying to spite their partner by having a limited diet. None of us asked for this to happen.",
          "created_utc": 1572284196.0
        },
        {
          "id": "f5lxqal",
          "author": "Squids_be_like__-0-",
          "body": "So what do you suggest I do? Swallow my frustration and miss out on a major part of exploring another country because my SO can't stand eating something he doesn't like? I'm not antagonizing him, but I refuse to have a trip abroad dictated by his strict eating habits. I normally conform to him, and what I need is for him to conform a little bit more to me for this trip.",
          "created_utc": 1572284542.0
        }
      ]
    },
    {
      "id": "f5ohyjw",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1572318635.0,
      "score": 12,
      "context": [
        {
          "id": "f5lwpsr",
          "author": "c21h30o2--",
          "body": "It really gets me that so many people see ARFID as immaturity or closed mindedness, when it’s an illness that severely affects people’s lives. Nobody is trying to spite their partner by having a limited diet. None of us asked for this to happen.",
          "created_utc": 1572284196.0
        },
        {
          "id": "f5lxqal",
          "author": "Squids_be_like__-0-",
          "body": "So what do you suggest I do? Swallow my frustration and miss out on a major part of exploring another country because my SO can't stand eating something he doesn't like? I'm not antagonizing him, but I refuse to have a trip abroad dictated by his strict eating habits. I normally conform to him, and what I need is for him to conform a little bit more to me for this trip.",
          "created_utc": 1572284542.0
        }
      ]
    },
    {
      "id": "f5pbyww",
      "author": "capitannn",
      "body": "Then go eat what you want without him and let him eat where hes comfortable. He physically cant 'conform' to you, it's not a choice hes making.",
      "created_utc": 1572355431.0,
      "score": 4,
      "context": [
        {
          "id": "f5lwpsr",
          "author": "c21h30o2--",
          "body": "It really gets me that so many people see ARFID as immaturity or closed mindedness, when it’s an illness that severely affects people’s lives. Nobody is trying to spite their partner by having a limited diet. None of us asked for this to happen.",
          "created_utc": 1572284196.0
        },
        {
          "id": "f5lxqal",
          "author": "Squids_be_like__-0-",
          "body": "So what do you suggest I do? Swallow my frustration and miss out on a major part of exploring another country because my SO can't stand eating something he doesn't like? I'm not antagonizing him, but I refuse to have a trip abroad dictated by his strict eating habits. I normally conform to him, and what I need is for him to conform a little bit more to me for this trip.",
          "created_utc": 1572284542.0
        }
      ]
    },
    {
      "id": "f5pj699",
      "author": "Sm0k3inth3tr33s",
      "body": "YTA",
      "created_utc": 1572360650.0,
      "score": 6,
      "context": [
        {
          "id": "f5lwpsr",
          "author": "c21h30o2--",
          "body": "It really gets me that so many people see ARFID as immaturity or closed mindedness, when it’s an illness that severely affects people’s lives. Nobody is trying to spite their partner by having a limited diet. None of us asked for this to happen.",
          "created_utc": 1572284196.0
        },
        {
          "id": "f5lxqal",
          "author": "Squids_be_like__-0-",
          "body": "So what do you suggest I do? Swallow my frustration and miss out on a major part of exploring another country because my SO can't stand eating something he doesn't like? I'm not antagonizing him, but I refuse to have a trip abroad dictated by his strict eating habits. I normally conform to him, and what I need is for him to conform a little bit more to me for this trip.",
          "created_utc": 1572284542.0
        }
      ]
    },
    {
      "id": "f5si9z5",
      "author": "morerokk",
      "body": "I fucking hate it so much. They judge you for not wanting to eat it, but then they judge you even harder when you gag.",
      "created_utc": 1572431793.0,
      "score": 2,
      "context": [
        {
          "id": "f5n1dx3",
          "author": "Mem-Boi-901",
          "body": "Lmao if I could overcome it I would immediately.  It so hard deal with it because its a legit disorder but at the same time how tf do you truly explain it to someone without looking like a freak.",
          "created_utc": 1572295711.0
        },
        {
          "id": "f5njdd7",
          "author": "Melon_Cooler",
          "body": "\"Yeah hey guys, can you please stop shoving cucumbers in my face and telling me to try it, I'd rather not gag and potentially vomit in the middle of the cafeteria.\"",
          "created_utc": 1572300806.0
        }
      ]
    },
    {
      "id": "f5ozmgi",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1572341454.0,
      "score": 3,
      "context": [
        {
          "id": "f5oxa15",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1572337510.0
        },
        {
          "id": "f5oysv7",
          "author": "c21h30o2--",
          "body": "This guy is whining that he’s not going to enjoy his perfect vacation because his partner has a mental illness. Yeah, food is a big part of exploring a new culture, but it’s not like their partner has a mental illness out of spite. They’re probably upset that they’re missing out because of something out of their control, and instead of getting, I don’t know, an ounce of support from their partner, they get ridiculed on the internet by a bunch of ignorant strangers. \n\nI genuinely believe that if ARFID was a well known mental illness, the comments would all be telling OP that they’re the asshole. I just wish there was more awareness. It would pave the way to acceptable, accommodation, and better treatment. Maybe I’m just being hopeful, but if people knew and tried to understand, I don’t think they’d be so cruel.",
          "created_utc": 1572340074.0
        }
      ]
    },
    {
      "id": "f5shxvv",
      "author": "morerokk",
      "body": "> Your SO is the bigger AH in my opinion though because he’s not willing to compromise.\n\nHow so? He was willing to compromise by eating separately. I'm sure he would be fine tagging along too, if he went to a fast-food place on his own first. His partner insists that he should eat with him. There is no compromise on OP's end.",
      "created_utc": 1572431328.0,
      "score": 7,
      "context": [
        {
          "id": "f5lwpsr",
          "author": "c21h30o2--",
          "body": "It really gets me that so many people see ARFID as immaturity or closed mindedness, when it’s an illness that severely affects people’s lives. Nobody is trying to spite their partner by having a limited diet. None of us asked for this to happen.",
          "created_utc": 1572284196.0
        },
        {
          "id": "f5lxqal",
          "author": "Squids_be_like__-0-",
          "body": "So what do you suggest I do? Swallow my frustration and miss out on a major part of exploring another country because my SO can't stand eating something he doesn't like? I'm not antagonizing him, but I refuse to have a trip abroad dictated by his strict eating habits. I normally conform to him, and what I need is for him to conform a little bit more to me for this trip.",
          "created_utc": 1572284542.0
        },
        {
          "id": "f5ohyjw",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1572318635.0
        }
      ]
    },
    {
      "id": "f5p193i",
      "author": "c21h30o2--",
      "body": "I agree, I voted NAH because at the end of the day no one’s mental illness is anyone else’s  responsibility. The people in the comments though, insulting someone they don’t know for having a mental illness (or at the very least symptoms of one) are definitely assholes.",
      "created_utc": 1572344012.0,
      "score": 4,
      "context": [
        {
          "id": "f5oxa15",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1572337510.0
        },
        {
          "id": "f5oysv7",
          "author": "c21h30o2--",
          "body": "This guy is whining that he’s not going to enjoy his perfect vacation because his partner has a mental illness. Yeah, food is a big part of exploring a new culture, but it’s not like their partner has a mental illness out of spite. They’re probably upset that they’re missing out because of something out of their control, and instead of getting, I don’t know, an ounce of support from their partner, they get ridiculed on the internet by a bunch of ignorant strangers. \n\nI genuinely believe that if ARFID was a well known mental illness, the comments would all be telling OP that they’re the asshole. I just wish there was more awareness. It would pave the way to acceptable, accommodation, and better treatment. Maybe I’m just being hopeful, but if people knew and tried to understand, I don’t think they’d be so cruel.",
          "created_utc": 1572340074.0
        },
        {
          "id": "f5ozmgi",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1572341454.0
        }
      ]
    }
  ]
}