{
  "id": "dsb8gl",
  "subreddit": "ARFID",
  "author": "DBtheEmcee",
  "created_utc": 1573014819.0,
  "title": "It’s approaching my most hated time of year.. Thanksgiving.",
  "selftext": "Year after year as a kid I would go to Thanksgiving dinner with my whole family. Grandparents, parents, aunts, uncles, cousins and so on. Every single year I would get the same response. “That’s all you’re going to eat!?” “You’re not eating the turkey or ham!?” and finally my favorite responses “You don’t know what you’re missing” and  “Someday you’ll realize how good it is and wished you would have eaten it the whole time” for reference the only meat that I can eat is beef. So chicken, turkey and ham are out of the question for me. When I try to explain to other people how much I hate Thanksgiving they always look at me like I’m a moron. I figured y’all would be the most likely to understand.",
  "url": "https://www.reddit.com/r/ARFID/comments/dsb8gl/its_approaching_my_most_hated_time_of_year/",
  "score": 109,
  "num_comments": 28,
  "comments": [
    {
      "id": "f6ofidb",
      "author": "LongtimelurkerWaley",
      "body": "Ah, yes. Rolls, Dessert, and harassment. \nHolidays about eating are awesome! (Note sarcasm)",
      "created_utc": 1573016080.0,
      "score": 59,
      "context": []
    },
    {
      "id": "f6oi2ut",
      "author": "love_rin_bell",
      "body": "Also Known as: I eat like 4 dinner rolls while everybody gets offended one by one when I dont eat what they brought.",
      "created_utc": 1573018665.0,
      "score": 38,
      "context": []
    },
    {
      "id": "f6og96b",
      "author": "himydandelion",
      "body": "I’m dreading it too. Even now that they understand I have a disorder, I still get some comments. They don’t try to force me to eat it anymore, or complain as much. But the smell is always so overwhelming that it makes me want to be an entire house away from it. \n\nI wish we could have an ARFID Thanksgiving. Bring your own food and eat whatever you want, and we all hang out, give thanks, and NOT talk about what we’re all eating.",
      "created_utc": 1573016804.0,
      "score": 30,
      "context": []
    },
    {
      "id": "f6ohp5s",
      "author": "None",
      "body": "Eating rolls while being harassed and having disgusting food shoved in my face is totally the best time of year! (Sarcasm)",
      "created_utc": 1573018261.0,
      "score": 18,
      "context": []
    },
    {
      "id": "f6ojy76",
      "author": "Valiant__Dust",
      "body": "I'm truly among my people to have others around me that hate Thanksgiving. It's always Ben most stressful holiday for me for that same reason. Last year, my bf and I didn't go visit our families, or try to do a friendsgiving. We just chose our favorite foods too eat and made them. For him, who likes a lot of the traditional foods, I baked a pheasant  with veggies instead of a big turkey so we wouldn't have an ungodly amount of meat, stuffing, mashed potatoes, and gravy. For me, I made Mac and cheese and potato wedges! We both had pumpkin pie and cake and rolls. It was a lot of cooking but so worth it, the best Thanksgiving I've ever had hands down.",
      "created_utc": 1573020728.0,
      "score": 17,
      "context": []
    },
    {
      "id": "f6oh3wa",
      "author": "Amazon_UK",
      "body": "I am so grateful to my family. Thanksgiving is also my birthday so we always get what I want, and no one from my fanily particularly likes turkey so we always have something else like spaghetti or chicken or whatever and no one judges ❤️",
      "created_utc": 1573017653.0,
      "score": 15,
      "context": []
    },
    {
      "id": "f6ohpku",
      "author": "Marenge",
      "body": "Ah yes the time of the year where i go somewhere in the house to sit after we give our thanks. Most times the stairs or a corner. I always try to eat enough of my safe food before the event starts so no family members will worry about me straving to the point of fatigue or knockouts.",
      "created_utc": 1573018274.0,
      "score": 9,
      "context": []
    },
    {
      "id": "f6oxg52",
      "author": "None",
      "body": "Rolls and turkey for me. I don’t like turkey but I can eat it if I have to(since I like whole chickens). Turkey is so dry that I spend so much time chewing the damned thing. And no, I don’t want any gravy! Stop asking like I wasn’t aware it was there or like I was afraid to ask for it! I’m not soft in the head, I just don’t like gravy!\nThanksgiving is like a huge chore.",
      "created_utc": 1573039950.0,
      "score": 5,
      "context": []
    },
    {
      "id": "f6p0l40",
      "author": "xXDevious",
      "body": "I dont get invited to Thanksgiving anymore. When did it become a food holiday and not a family holiday? Sad",
      "created_utc": 1573043535.0,
      "score": 4,
      "context": []
    },
    {
      "id": "f6p2m2t",
      "author": "HorrorHamster",
      "body": "I’ve been able to maneuvered myself into being the person bringing Mac and cheese now. We didn’t have it every year, so I asked if I could bring it last year (out of fear it wouldn’t be there again). I made it homemade last year but in the past we’ve just done velveeta shells which is fine. They were super excited about the homemade though and wanted me to bring it again this year. It means I have at least 3 things I can eat at Thanksgiving (luckily I like Turkey and I LOVE rolls).\n\nIf there’s a particular dish you like maybe give it a shot. Even if it’s not super traditional at least it’ll give you another thing to eat. My aunt makes oyster casserole cause she loves it, only like 3 people eat it but she loves it so she makes it.",
      "created_utc": 1573045482.0,
      "score": 4,
      "context": []
    },
    {
      "id": "f6pa1ey",
      "author": "None",
      "body": "This is where I’m glad I’m in the UK where we don’t celebrate thanksgiving.",
      "created_utc": 1573051458.0,
      "score": 3,
      "context": []
    },
    {
      "id": "f6p0nqa",
      "author": "DifferentIsPossble",
      "body": "... I'm the one in my family who decides what to cook for Thanksgiving. I didn't used to be, but nowadays I managed to maneuver myself into that spot.\n\nOfc you have to have a few *traditional* dishes, but you get to slip in a whole bunch of safe foods under the radar.\n\nIdk if this will help anyone, but it's easier to slip food past the radar that way.\n\nI'm Polish, so Christmas is a nightmare though... Traditional Foods ™ out the ass and nothing I'm able to eat",
      "created_utc": 1573043608.0,
      "score": 3,
      "context": []
    },
    {
      "id": "f6p589a",
      "author": "None",
      "body": "my family is well trained on giving me pizza or something while everyone else eats thanksgiving food. it doesn’t feel great but at least i have something to eat lol",
      "created_utc": 1573047776.0,
      "score": 3,
      "context": []
    },
    {
      "id": "f6q6kjj",
      "author": "Mem-Boi-901",
      "body": "LMAO this sub is anti-thanks giving and I love it.  Tbh I hate holidays that revolve eating at the dinner table because its generally just fucking toxic.  My family is pretty decent but most family's seem to always have something negative to say.  Its one thing to comment on something that needs to be address but its another thing to be conservative, controlling family members.  I feel like its not hard to understand that the dinner table is **not** the place to talk to someone about their problems.  Anyway screw Thanksgiving and people need to mind their business.\n\nEdit: I wish everyone good luck at Thanksgiving, my family understands and makes what I want and I wish my folks could be their to cook y'all's actual favorite food. :((((",
      "created_utc": 1573071775.0,
      "score": 3,
      "context": []
    },
    {
      "id": "f6p404d",
      "author": "duckduckholoduck",
      "body": "We don't have Thanksgiving here, but Christmas is the same. In my family, it's basically three days of eating. Every single year for as long as I can remember I've gotten the same comments and laughter about my safe foods (\"You eat like a child!\" \"Are you STILL not eating (insert random food here)?\" \"Even my toddler isn't as picky as you!\" \"Can't you just TRY to eat normally FOR ONCE?\"). Every. Single. Year. My mom was about ready to fight my aunt and cousin last year when they wouldn't back off lmao. I just deal with it for those couple of days and remind myself that I won't have to see those people again for a year.",
      "created_utc": 1573046738.0,
      "score": 2,
      "context": []
    },
    {
      "id": "f6p7sa2",
      "author": "LairaLuna",
      "body": "Thanksgiving is whack. I try to make little sandwiches out of rolls with some butter, mashed potato and a bit of turkey. But the array of textures in everything else is vile.",
      "created_utc": 1573049790.0,
      "score": 2,
      "context": []
    },
    {
      "id": "f6p9pak",
      "author": "None",
      "body": "Thankfully my family has never been pushy about what I eat and even 10-15 years ago I was just eating a veggie burger with mashed potatoes for the holiday.  As a kid I just ate potatoes, corn, and boxed stuffing at dinner.  I have my own family now and don’t live near extended family anymore, so the meal is whatever my husband and I want.  He’s planning on making a small turkey breast for himself, the rest of us will just eat sides (no gross cranberry sauce or other “slop” textured foods) and pumpkin pie.  \n\nI feel for anyone who has to put up with opinionated family members.  Can’t imagine not seeing relatives all year and then the only thing they want to talk about is negative bullshit that doesn’t affect them.",
      "created_utc": 1573051214.0,
      "score": 2,
      "context": []
    },
    {
      "id": "f6pbleu",
      "author": "unicorn_in-training",
      "body": "Even \"better\" is that my birthday is on Thanksgiving this year 🙄 The world can be so cruel!",
      "created_utc": 1573052558.0,
      "score": 2,
      "context": []
    },
    {
      "id": "f6pffn6",
      "author": "LunarToast7",
      "body": "Ugh I’m sorry! I hate thanksgiving as well! I’m Canadian so mine is in October but I honestly feel you so much! On thanksgiving I normally have a bit of mashed potatoes and buttered pasta but there is nothing more embarrassing than sitting around your family and not being able to eat the turkey grandma brought or the ham my Aunt brought. And then all they do ALL NIGHT is make fun of you for missing out, and being too thin! Honestly can thanks giving just not be a thing?",
      "created_utc": 1573055147.0,
      "score": 2,
      "context": []
    },
    {
      "id": "f6pwgg3",
      "author": "shattered-vase",
      "body": "I felt those responses in my soul lol. I usually tell people I’m not that hungry or I lie and say I have a stomach ache. \n\nMy cousin waits until everyone is done eating and then he goes and gets a plate so no one bothers him. I don’t know for sure if he has ARFID, but he doesn’t eat much and I know he hates when people comment about it. Maybe that’s something worth trying?",
      "created_utc": 1573065773.0,
      "score": 2,
      "context": []
    },
    {
      "id": "f72ysbh",
      "author": "nicohusko",
      "body": "Some turkey, rolls, and applesauce...they cant touch either! I'm always embarrassed by how empty my plate looks and I'm always made fun of for it by my dad. My brother is the same way except without the turkey, so he gets most of the bullying. Sometimes he just refuses to eat Thanksgiving dinner with the family and I think that's why :(",
      "created_utc": 1573384791.0,
      "score": 1,
      "context": []
    },
    {
      "id": "f6ozdsr",
      "author": "apk5005",
      "body": "I hate the food holiday season. Thankfully, my family understands and accepts that I (as an adult) just do my own thing.",
      "created_utc": 1573042252.0,
      "score": 10,
      "context": [
        {
          "id": "f6ofidb",
          "author": "LongtimelurkerWaley",
          "body": "Ah, yes. Rolls, Dessert, and harassment. \nHolidays about eating are awesome! (Note sarcasm)",
          "created_utc": 1573016080.0
        }
      ]
    },
    {
      "id": "f6slyx0",
      "author": "Linkynet",
      "body": "This is exactly my experience. I've stopped going to my family thanksgiving entirely because I hate that conversation so much. That and \"Do you like this? What about this? Why not? What *do* you eat?\"",
      "created_utc": 1573136349.0,
      "score": 3,
      "context": [
        {
          "id": "f6oi2ut",
          "author": "love_rin_bell",
          "body": "Also Known as: I eat like 4 dinner rolls while everybody gets offended one by one when I dont eat what they brought.",
          "created_utc": 1573018665.0
        }
      ]
    },
    {
      "id": "f6pflze",
      "author": "LunarToast7",
      "body": "Yes! We need an arfid thanks giving. I feel like all of us just need to hang out... I don’t know about you but I’ve never met a fellow ARFID person in real life and honestly I need to.",
      "created_utc": 1573055260.0,
      "score": 4,
      "context": [
        {
          "id": "f6og96b",
          "author": "himydandelion",
          "body": "I’m dreading it too. Even now that they understand I have a disorder, I still get some comments. They don’t try to force me to eat it anymore, or complain as much. But the smell is always so overwhelming that it makes me want to be an entire house away from it. \n\nI wish we could have an ARFID Thanksgiving. Bring your own food and eat whatever you want, and we all hang out, give thanks, and NOT talk about what we’re all eating.",
          "created_utc": 1573016804.0
        }
      ]
    },
    {
      "id": "f6ophsx",
      "author": "Jintje",
      "body": "Ever since I left my parents house to live on my own I've hosted all holidays and made all food myself to ensure I have plenty to eat. It's a lot of work but it's way better than spending a night eating literally nothing",
      "created_utc": 1573028012.0,
      "score": 8,
      "context": [
        {
          "id": "f6ojy76",
          "author": "Valiant__Dust",
          "body": "I'm truly among my people to have others around me that hate Thanksgiving. It's always Ben most stressful holiday for me for that same reason. Last year, my bf and I didn't go visit our families, or try to do a friendsgiving. We just chose our favorite foods too eat and made them. For him, who likes a lot of the traditional foods, I baked a pheasant  with veggies instead of a big turkey so we wouldn't have an ungodly amount of meat, stuffing, mashed potatoes, and gravy. For me, I made Mac and cheese and potato wedges! We both had pumpkin pie and cake and rolls. It was a lot of cooking but so worth it, the best Thanksgiving I've ever had hands down.",
          "created_utc": 1573020728.0
        }
      ]
    },
    {
      "id": "f6pw1ud",
      "author": "giraffemoo",
      "body": "My birthday isnt around this time but my family is also understanding of my disorder and they also don't like Turkey. We have a big meal of stuff we like and we dont invite anyone over who will judge us for that.",
      "created_utc": 1573065522.0,
      "score": 2,
      "context": [
        {
          "id": "f6oh3wa",
          "author": "Amazon_UK",
          "body": "I am so grateful to my family. Thanksgiving is also my birthday so we always get what I want, and no one from my fanily particularly likes turkey so we always have something else like spaghetti or chicken or whatever and no one judges ❤️",
          "created_utc": 1573017653.0
        }
      ]
    },
    {
      "id": "f6p3cmn",
      "author": "LongtimelurkerWaley",
      "body": "Yeah, my family has given up on me at this point (which I love) so I can just eat rolls and dessert without a word.",
      "created_utc": 1573046153.0,
      "score": 6,
      "context": [
        {
          "id": "f6ofidb",
          "author": "LongtimelurkerWaley",
          "body": "Ah, yes. Rolls, Dessert, and harassment. \nHolidays about eating are awesome! (Note sarcasm)",
          "created_utc": 1573016080.0
        },
        {
          "id": "f6ozdsr",
          "author": "apk5005",
          "body": "I hate the food holiday season. Thankfully, my family understands and accepts that I (as an adult) just do my own thing.",
          "created_utc": 1573042252.0
        }
      ]
    },
    {
      "id": "f77adkb",
      "author": "None",
      "body": "Pizza, chicken nuggets, french fries ooooh sounds like the best thanksgiving ever",
      "created_utc": 1573448692.0,
      "score": 1,
      "context": [
        {
          "id": "f6og96b",
          "author": "himydandelion",
          "body": "I’m dreading it too. Even now that they understand I have a disorder, I still get some comments. They don’t try to force me to eat it anymore, or complain as much. But the smell is always so overwhelming that it makes me want to be an entire house away from it. \n\nI wish we could have an ARFID Thanksgiving. Bring your own food and eat whatever you want, and we all hang out, give thanks, and NOT talk about what we’re all eating.",
          "created_utc": 1573016804.0
        },
        {
          "id": "f6pflze",
          "author": "LunarToast7",
          "body": "Yes! We need an arfid thanks giving. I feel like all of us just need to hang out... I don’t know about you but I’ve never met a fellow ARFID person in real life and honestly I need to.",
          "created_utc": 1573055260.0
        }
      ]
    }
  ]
}