{
  "id": "dx91xp",
  "subreddit": "ARFID",
  "author": "c21h30o2--",
  "created_utc": 1573921972.0,
  "title": "Advice for Parents of People with ARFID",
  "selftext": "I saw a post recently about a parent who was struggling with coping with their child's illness, which gave me the idea for this post. A lot of this is what my mom did that helped me as a child/teen with ARFID, but some of it has been compiled from other members of this sub. Hopefully you might understand this condition better and learn some things that might help. If you anyone has any tips that I left out, please comment! \n\nEveryone is different. Each of our experiences is unique, so not all of these will apply to everyone. \n\n* There's a *big* difference between not liking a food and being physically unable to eat it. I have foods that I don't like but I can physically stand. I don't take pleasure in the taste, but I can stand to have it in my mouth, chew, and swallow without gagging. But not liking a food and being unable to eat it are *very* different concepts. One is mild discomfort or neutral feeling, the other is an extreme disgust reaction. When I put a danger food in my mouth, there's this surge of disgust once I feel it in my mouth. My body wants to reject it. It's like holding vomit in your mouth. You can't control the gagging because the disgust is just so overwhelming and unbearable. We're not being rude. It's a physical reaction.\n* \"How do you know if you don't like it if you won't try it?\" is one of the most frustrating questions in the world. I understand when I won't like something because I've been struggling for my entire life. If you had allergies for your whole life, and you saw something that you knew triggered a reaction, nobody would be telling you to try sniffing it again. Smells and visuals also allow us to determine if something is edible to us or not. A big thing for me is texture and consistency, which is something that's pretty easy to see. We're not being closed-minded or stubborn. We are using past experiences to determine the most likely outcome.\n* Forcing us to eat more foods will not help. It will actively make our situation worse. If we refuse to eat something, it is not out of stubbornness, it's out of fear at the disgust that we will most likely experience eating that food. It's not out of spite for you. In fact, it has nothing to do with you. We didn't choose this. We're trying our hardest to cope with a severe mental illness. Please don't make it any harder.\n* Yes, we can taste the difference between those brands. Yes, buying the wrong one could be a big deal.\n* For a lot of us, social anxiety comes with ARFID. Personally, I really struggle ordering food because I feel like what I'm ordering is strange, weirdly plain, or very little in quantity compared to other people's. I'll often order a side and get \"that's all? but you're so thin!\" comments from food workers which make me really uncomfortable. So if we ask you to order for us, please don't make a big deal out of it. Please just don't draw extra attention to us at restaurants. It can be difficult enough admitting our disorder to you or others we're close with. It's infinitely more difficult when a stranger is involved.\n* Accept that seemingly \"little\" accomplishments can be a really big deal for us. Eating out at a restaurant, for example, is a feat. For me, I have to overcome my social anxiety about the waiter, my anxiety about the food, and the depression around not just being able to enjoy this like a normal person. Some things may not seem impressive to you, but they are to us.\n* We understand that the typical ARFID diet is not healthy. Believe me, we know. It doesn't feel good when your body lacks nutrition. It doesn't feel good to be clinically underweight/overweight. We're aware, lots of us are ashamed. We don't need reminding of what is obvious every day. We already have our symptoms.\n* As hard as it is to not do this, please don't push us to eat. ARFID is a cyclical condition. When something sets us off, it reinforces and exacerbates our symptoms. This doesn't just apply to new/danger foods. ARFID caused me to be clinically underweight, which lead to a lot of nausea and abdominal pain, which severely decreased my appetite. Eating was even more of a challenge during this time. Force feeding will make the disgust response worse and make coping more difficult.\n* Help us advocate with health care professionals. Not everyone is educated about ARFID and a lot of us end up with an incorrect diagnosis. When I was clinically underweight and anaemic from ARFID, I saw my doctor about it and walked out with an anorexia diagnosis, even though body image issues had nothing to do with what was happening to me. Lots of treatment programs for eating disorders focus on body image, so they aren't always right for people with ARFID. Believe your child when they open up and stand up for them when others try to discount their struggles.\n* Most importantly, you don't have to understand ARFID to accept it. Odds are, you will never experience a reaction to food as severe as ours. (No, being a picky eater does not count. Saying you can relate because you were picky too is like saying you relate to someone with depression because you've been sad before. They are not the same.) The most important thing is that you are kind, sympathetic, and *accommodating*. Listen to us when we tell you how we feel and what we need. Please don't put us in a situation that you know will be hard. Accept that we might not want to go to some events because of the food. Be considerate and accept the reality of our situation.",
  "url": "https://www.reddit.com/r/ARFID/comments/dx91xp/advice_for_parents_of_people_with_arfid/",
  "score": 84,
  "num_comments": 6,
  "comments": [
    {
      "id": "f7oyb7a",
      "author": "purplechunkymonkey",
      "body": "Thank you for this. It was probably my post. We try our best to be accommodating of her preferences.  We always look up menus to make sure there is something she will eat. I HATE the term picky eater but it is one doctors use. I grew up being called a picky eater. Turns out I just don't like to eat what my family does. Anyway, my pediatrician says that my daughter is a difficult feeder. She loves most vegetables but they have to be raw. I just give her raw veg and cook it for the rest of us. She eats a fairly good variety of foods so I am not sure of she is ARFID but reading your guys stories helps me to understand her a bit better. I do make her take a good vitamin every day so she is getting nutrients she needs. \n\nMy biggest fear with her food issues is that she develops a bad relationship with food and ends up anorexic because of it. My younger sister struggled with anorexia for years.",
      "created_utc": 1573937421.0,
      "score": 8,
      "context": []
    },
    {
      "id": "f7olwv5",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1573929636.0,
      "score": 16,
      "context": []
    },
    {
      "id": "f7prus8",
      "author": "Threnodyyo",
      "body": "Thank you for sharing! Is there -for lack of a better word- an advanced version of this? For those of us who’ve received a diagnosis for our kids, but still aren’t 100% sure about the most helpful strategies? We tried therapy, but apparently feeding therapy is not covered unless there is a physical disorder, so now I have a $3000+ bill. We’re very familiar with our son’s safe foods, so he’s never required to eat anything unsafe but we do require, for example, that he eats a safe protein before having chocolate milk. I won’t lie, it can be really hard figuring out the line between pressuring him about food and worrying about him eating what he needs to live a healthy life. Have a printed, categorized list of safe foods helps, but boy ARFID is hard on everyone in the family.",
      "created_utc": 1573953593.0,
      "score": 5,
      "context": []
    },
    {
      "id": "f7oba44",
      "author": "Vacticspore259",
      "body": "👏👏",
      "created_utc": 1573924495.0,
      "score": 7,
      "context": []
    },
    {
      "id": "f7qji65",
      "author": "tenredtoes",
      "body": "Thanks so much for this.  Do you have stickies in this sub?  Might be useful.",
      "created_utc": 1573964850.0,
      "score": 1,
      "context": []
    },
    {
      "id": "f7os78j",
      "author": "c21h30o2--",
      "body": "I don't know your situation, but I agree with u/wolvesaregreat that you should share it with her dad. I always knew that my eating habits were abnormal, but I didn't find out that it was a disorder until recently. This sub helped me feel less different because I saw other people who ate like I did. On here, I'm not weird for ordering just fries or not being able to eat pasta with sauce because I'm surrounded by those who are like me. \n\nI'm glad that you feel sympathy for your boyfriend's daughter. When I moved away from home, I stayed with my aunt for about a week and she was very unsympathetic to my illness. I didn't know what it was at the time so I couldn't explain myself. I was also undereating due to the stress of leaving home. She took my not eating her meals very personally and saw me as being rude and entitled. Instead of learning to be understanding, like you, we had a falling out and I just ended up blocking her on everything. Maybe if she understood that it was an illness she wouldn't have kicked me out of her house. Arming her with knowledge about ARFID and a community of similar people could really help her. I absolutely wish I had known sooner.",
      "created_utc": 1573933050.0,
      "score": 6,
      "context": [
        {
          "id": "f7olwv5",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1573929636.0
        }
      ]
    },
    {
      "id": "f7oq70p",
      "author": "None",
      "body": "I think you should share it with her (or get her dad to). she’s probably already aware that her eating habits are different - it might help to see that other people struggle in the same way.",
      "created_utc": 1573931843.0,
      "score": 4,
      "context": [
        {
          "id": "f7olwv5",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1573929636.0
        }
      ]
    }
  ]
}