{
  "id": "e7k1ll",
  "subreddit": "ARFID",
  "author": "LuxandGold",
  "created_utc": 1575753210.0,
  "title": "Try With Me?",
  "selftext": "So, I was wondering if we could set up some form of weekly sticky thread or something, where in we all state what new food we are going to try this week and others can comment on good tips to help with that particular food, or just give some encouragement to those trying. \n\nThere are so many fantastic tips in this sub, but I think a weekly thread in which we actively pick a new food to try - perhaps seeing that there are three or four others trying the same new food as yourself at the same time can really help mentally. \n\nARFID is something I find particularly hard to deal with alone, and this sub has been so beneficial to me in it's discovery, but I think this might help us all a bit more. \n\nThoughts?",
  "url": "https://www.reddit.com/r/ARFID/comments/e7k1ll/try_with_me/",
  "score": 82,
  "num_comments": 13,
  "comments": [
    {
      "id": "fa0qi2f",
      "author": "joan-117",
      "body": "This is scary but I would be down. Its like having a gym buddy that keeps you accountable.",
      "created_utc": 1575758703.0,
      "score": 29,
      "context": []
    },
    {
      "id": "fa0wef9",
      "author": "Finagles_Law",
      "body": "This sounds like a great idea.  As a non-ARFID foodie guy who cooks for a pretty picky eater, I'd love to help, maybe give some tips on how those foods might be more acceptable (texture, cooking method, etc).",
      "created_utc": 1575761293.0,
      "score": 13,
      "context": []
    },
    {
      "id": "fa0n5r5",
      "author": "The_Ajna",
      "body": "Amazing idea",
      "created_utc": 1575757536.0,
      "score": 10,
      "context": []
    },
    {
      "id": "fa0umk9",
      "author": "Amazon_UK",
      "body": "I think it could be useful for others, but personally I usually find that I try new foods in the spur of the moment. Like my goal right now is just to try one new food a week at dinner, doesn’t matter what, but just to try one",
      "created_utc": 1575760395.0,
      "score": 7,
      "context": []
    },
    {
      "id": "fa1b9js",
      "author": "None",
      "body": "I’m super on board! I’ve found several new safe foods by reading about what works for other people on this sub. I bet many of us share preferences/intolerances.",
      "created_utc": 1575767611.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fa1nkjz",
      "author": "Kelekona",
      "body": "I'm just picky, but I would love to help by describing what to expect from different foods.\n\nIt's sweet potato season, or is that too ambitious?",
      "created_utc": 1575772110.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fa1r2j8",
      "author": "rocks_rock4",
      "body": "Great idea!! Let’s do it!",
      "created_utc": 1575773319.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fa1uhm3",
      "author": "Threnodyyo",
      "body": "Love this idea!",
      "created_utc": 1575774449.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fa27qwh",
      "author": "duquesne419",
      "body": "Next week I'm going out with a buddy to try the 'smoothies with green shit hidden in them' idea. I'm kinda terrified, the last time I had a smoothie it was too pulpy and didn't go well. Still, excited to have a plan for something new that could potentially be a real boost to my diet.\n\nSorry, there's not a sticky post yet, so I thought I get rolling here. This is a great idea.",
      "created_utc": 1575778830.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fa0ulf1",
      "author": "LuxandGold",
      "body": "That was sort of part of my thought process. Alone, it's so easy to go weeks, months and even years between trying a food, and obviously health wise, that just isn't ok. \n\nI mean, the thought of this terrifies me too, but I can't go on like this and half the threads in this sub tells me I'm not alone in that line of thought.\n\nHaving a group of people all try something makes it so much more achievable somehow to me.",
      "created_utc": 1575760378.0,
      "score": 13,
      "context": [
        {
          "id": "fa0qi2f",
          "author": "joan-117",
          "body": "This is scary but I would be down. Its like having a gym buddy that keeps you accountable.",
          "created_utc": 1575758703.0
        }
      ]
    },
    {
      "id": "fa66tvs",
      "author": "50colt30",
      "body": "Start a YouTube channel!",
      "created_utc": 1575821616.0,
      "score": 3,
      "context": [
        {
          "id": "fa0wef9",
          "author": "Finagles_Law",
          "body": "This sounds like a great idea.  As a non-ARFID foodie guy who cooks for a pretty picky eater, I'd love to help, maybe give some tips on how those foods might be more acceptable (texture, cooking method, etc).",
          "created_utc": 1575761293.0
        }
      ]
    },
    {
      "id": "fa7nd1o",
      "author": "animejaz",
      "body": "Technically it's a root/starch just like a potato and for people that are potato lovers is not a bad stretch. My ARFID BF went From Potato to sweet potato with good success. It was before he met me so I can't explain his process, but I do know texture can still make ways of preparing sweet potatoes complicated for him. But he's more likely to try different ways to cook sweet potatoes now because he knows he can like the base taste of sweet potatoes.  So I'd suggest when your trying it, bake it plain to start. That way you know what a neutral/natural sweet potato tastes like, as a control, and depending on that, if you feeling up for it, with each bite try it with different seasoning. Like plain bite, salted bite, and sugar bite. (if you can get that far) it's kinda a scientific breakdown way to try it but I feel like it would give you less variables when your trying something new. (if that helps to think that way). \n\nSomething to keep in mind, if you have the option, buy from a farmers market. As a foodie, grocery store foods make even my favorite produce taste bad. It's hard to find a ripe/good/nutritional vegetable easily in the market. Just as an example from my experience - blueberries in the store: it's around 80% more likely your options are sour, not ripe, and firm, but in a farmers market it's dramatically more (like 90%) more likely you find sweet, ripe, and juicy produce. Not to scare people away from the store if it's what you have, but it's just more likely you'll find a bad tasting fruit or vegetable by anyone's pallet. No one would want you to get a upsetting start to your produce journey because you got a bad sample.  (I'm also going to make this a separate post)\n\nGood luck! 😁",
      "created_utc": 1575836344.0,
      "score": 1,
      "context": [
        {
          "id": "fa1nkjz",
          "author": "Kelekona",
          "body": "I'm just picky, but I would love to help by describing what to expect from different foods.\n\nIt's sweet potato season, or is that too ambitious?",
          "created_utc": 1575772110.0
        }
      ]
    },
    {
      "id": "fa90apy",
      "author": "YouMakeMyHeartHappy",
      "body": "Good luck! The Vitamix or Blendec blenders used at most smoothie places pulverizes everything extremely smoothly. I would try a smoothie places over another restaurant that just happens to have smoothies for this reason!",
      "created_utc": 1575859129.0,
      "score": 2,
      "context": [
        {
          "id": "fa27qwh",
          "author": "duquesne419",
          "body": "Next week I'm going out with a buddy to try the 'smoothies with green shit hidden in them' idea. I'm kinda terrified, the last time I had a smoothie it was too pulpy and didn't go well. Still, excited to have a plan for something new that could potentially be a real boost to my diet.\n\nSorry, there's not a sticky post yet, so I thought I get rolling here. This is a great idea.",
          "created_utc": 1575778830.0
        }
      ]
    }
  ]
}