{
  "id": "ekxjno",
  "subreddit": "ARFID",
  "author": "bluejen",
  "created_utc": 1578333155.0,
  "title": "Found a chart that helps people like me/us enjoy vegetables and I FINALLY enjoy asparagus now. Hoping to eat even more veggies in 2020!",
  "selftext": "So, my biggest nemesis in ARFID are vegetables. I so badly want to be healthy and treat my body well, but to me if a food is green, that means it's bad, right? Food shouldn't be green? And bitter? That's why my silly ARFID-riddled brain tells me at least. So, proper nutrition has been hard to acquire and I can tell my body is suffering for it at way too young of an age.\n\nSO I did some digging around with various Google searches such as \"how to eat vegetables when you hate them\" and I came across this chart: https://www.precisionnutrition.com/dont-like-vegetables\n\nIt includes a bitterness scale of vegetables and and sort-of flow chart of which ways to cook certain vegetables and suggested flavors to pair with the veggies to help offset the bitterness and etc. I'm not even explaining it that well but once you open the link, you'll see how fool-proof it is. \n\nSo I picked asparagus, and paired it with crushed red pepper flakes, cayenne pepper, garlic and some butter, sauteed it, and actually really liked it! One thing that ARFID didn't take from me is a love of spice, so, I coated those m-fers in spice and it really helped to just pile on lots of seasoning and garlic to help introduce the new flavor to myself. \n\nI was so happy I could cry. After years of literally dry heaving at the thought of most vegetables, and especially asparagus, I finally enjoyed it and actually look forward to trying it again.\n\nThis isn't an overnight success story, I'm sure the next vegetable I try won't be so easy because asparagus is about as least bitter as it gets, vegetable-wise.\n\nBut, for anyone here who struggles with vegetables, I thought I'd include this very helpful link in case someone feels up to trying out something new.",
  "url": "https://www.reddit.com/r/ARFID/comments/ekxjno/found_a_chart_that_helps_people_like_meus_enjoy/",
  "score": 145,
  "num_comments": 18,
  "comments": [
    {
      "id": "fdee0w1",
      "author": "LuxandGold",
      "body": "Holy shit, what a god send of a chart. \n\nAlso, something I've noticed is that people can't cook. So that vegetables that are supposed to be sweet and easy to eat suddenly turn into a grey, brownish soggy mess that looks revolting and makes me want to vomit. \n\nI highly reccomend watching cooking channels to see how things should be prepared! It makes a whole world of difference to me.",
      "created_utc": 1578336974.0,
      "score": 30,
      "context": []
    },
    {
      "id": "fdeisj5",
      "author": "flower_milk",
      "body": "I'll try this out, but it's usually the texture of the food for me, not the bitterness. I love bitter stuff.",
      "created_utc": 1578339920.0,
      "score": 21,
      "context": []
    },
    {
      "id": "fdee32e",
      "author": "Putyourmoneyonme80",
      "body": "Vegetables are SO hard for me too! I think I may be able to try this! Thanks for sharing!",
      "created_utc": 1578337012.0,
      "score": 8,
      "context": []
    },
    {
      "id": "fdeqnhj",
      "author": "Purplerazor",
      "body": "Cooking my own food really changed everything for me. Being able to put exactly what I want in it and knowing nothing “weird” was secretly hiding in it, and also being able to taste along the way. I’m not sure if I actually have this ED or if I was just a very picky eater, but I relate to a lot on here as far as “safe foods” and the way “unsafe foods” just seem so vomit inducing even though you logically know it should be fine. I had a lot of issues with liking things separately but not combined (sandwiches and burgers are still hard to eat). \n\nBut yeah, this chart is awesome, and the concept of it in general is too. So many foods I thought were gross growing up, I like now, either because the way my mom cooked them was not the best, or because I wasn’t physically putting them together myself, so they didn’t feel safe. Also, I’m not sure if you like bacon or olive oil, but my favorite way to cook veggies (broccoli, asparagus, brussels) is roasted in the oven with a ton of olive oil, fresh garlic, and seasoning salt. For asparagus, if you wrap pieces of bacon around each piece.... omg so good. Obviously not the healthiest but a great treat.",
      "created_utc": 1578344585.0,
      "score": 7,
      "context": []
    },
    {
      "id": "fdec3yq",
      "author": "None",
      "body": "Thank you!!! I hate bitter things, I think this will be very useful!! Enjoy your asparagus.\n\nI will try what you shared, my boyfriend loves asparagus and said he would make some for me a few months ago and never did, I will remind him. :)",
      "created_utc": 1578335781.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fdefis4",
      "author": "btodorovaaa",
      "body": "Thanks a lot for sharing that!",
      "created_utc": 1578337910.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fdeva9y",
      "author": "Gobble-Girl",
      "body": "Amazing, and the detailed information was really good too.\n\nI especially loved the step by step additions to the veggies, what a great way to make it all seem less scary. \n\nThanks for sharing",
      "created_utc": 1578347335.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fdexlic",
      "author": "DifferentIsPossble",
      "body": "Ohhh my goodness\n\nYou're a lifesaver",
      "created_utc": 1578348742.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fdfco8q",
      "author": "she-huulk",
      "body": "Oh wow, I hope people take the time to read the article, as well as the accompanying graphic! SO DANG GOOD. I'm happy that I learned a lot of this on my own in the last few years....but damn, If I had this information 10 years ago I would have probably started to cry! This article made me feel totally understood in a way that was funny and encouraging while also being full of really great information and plain language science. Really blown away, thank you so much OP for sharing! Is there a way to have the mods pin this info? I feel like this will help SO MANY PEOPLE!!!",
      "created_utc": 1578358574.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fovcskr",
      "author": "Eireann_9",
      "body": "Interesting. I've actually just discovered this sub and ARFID but I've been desensitizing myself to flavours for the last year or so. A year ago i didn't eat any of the vegetables in the chart. Now I eat asparagus (first i tried), brocoli (discovered about 6 months ago) and yesterday i tried spinach and i see potential there. I guess I'll try the sprouts next\n\nI thinks it's interesting how all those vegetables are the ones that are indicated to begin with. It's not even that I've tried others and didn't like them, it just happens that i decided to start with those.\n\n\nFor me the process is:\n\n1 Try it but not eat a full plate: Literally just taking a bit with the fork and then keep eating a safe food. Normally I'm absolutely disgusted by it even if i recognize that it's ok. It's just that the flavour profile is very different from all my safe foods.\n\n2 Full small plate with safe food alternative: Even if I've liked it i wait for another day to eat it as a meal. That way i can mentally prepare myself for it and it isn't scary as I'm not trying something that i don't know. Usually i don't enjoy it at this point but is doable. If I'm really struggling I stop and eat the alternative. It's weird cause even if I can't stand the food i know that there's potential for me to like it. It's like i like it but my brain doesn't want me to.\n\n3 Keep eating it: i find that after a couple or three times i start enjoying it and become used to it. I tend to have a phase in which i eat it A LOT and it's the only food in that food group that i want to eat. Then i get bored and stop for a while and then i integrate it normally to my repertoire.\n\nCurrently I'm in the \"like it but it's gross\" phase with spinach, mainly due to texture, \"omg this is the only vegetable i ever want to eat again\" with broccoli, and \"welp another nice food\" with asparagus. Once spinach has passed to the next phase i will introduce Brussel sprouts",
      "created_utc": 1588099159.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fdfhlwg",
      "author": "tenredtoes",
      "body": "That's great, thank you!  I'll talk to my son about it.",
      "created_utc": 1578361886.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fdgjkn8",
      "author": "nicohusko",
      "body": "All veggies are a big no for me but I want to try some based on this chart. the cushions honey and maple syrup confuse me tho, what veggies would taste good with that?",
      "created_utc": 1578399398.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fdee7re",
      "author": "bluejen",
      "body": "Yes, great tip to watch some people cook them first beforehand because I definitely can’t cook and being intimidated by the kitchen is another big factor in me putting off trying vegetables.",
      "created_utc": 1578337094.0,
      "score": 16,
      "context": [
        {
          "id": "fdee0w1",
          "author": "LuxandGold",
          "body": "Holy shit, what a god send of a chart. \n\nAlso, something I've noticed is that people can't cook. So that vegetables that are supposed to be sweet and easy to eat suddenly turn into a grey, brownish soggy mess that looks revolting and makes me want to vomit. \n\nI highly reccomend watching cooking channels to see how things should be prepared! It makes a whole world of difference to me.",
          "created_utc": 1578336974.0
        }
      ]
    },
    {
      "id": "fdek2t7",
      "author": "bluejen",
      "body": "Yeah in that case I’m not too sure how this will help. I also have a problem with texture and the stringiness of the stalk of asparagus almost upset me but for some reason I persevered and it turned out well.",
      "created_utc": 1578340697.0,
      "score": 12,
      "context": [
        {
          "id": "fdeisj5",
          "author": "flower_milk",
          "body": "I'll try this out, but it's usually the texture of the food for me, not the bitterness. I love bitter stuff.",
          "created_utc": 1578339920.0
        }
      ]
    },
    {
      "id": "fdemk1o",
      "author": "axw3555",
      "body": "Same problem for me. Wrong texture and even something I like becomes unpalatable (bread a fraction too dry, base of a pizza a bit too tough, etc and I go from \"this is my favourite food\" to \"I am about to throw up\"). \n\nFlavour is only really an issue if the flavour is being slightly overdone for the way I like it cooked (I have a real complex about things being even fractionally burnt or overcooked).",
      "created_utc": 1578342183.0,
      "score": 7,
      "context": [
        {
          "id": "fdeisj5",
          "author": "flower_milk",
          "body": "I'll try this out, but it's usually the texture of the food for me, not the bitterness. I love bitter stuff.",
          "created_utc": 1578339920.0
        }
      ]
    },
    {
      "id": "fovj5rq",
      "author": "bluejen",
      "body": "That's how I tried it, too. Introduced it not as even a full serving. Right now I'm stuck on just asparagus and will try broccoli once I trust asparagus fully. I like it a lot, but I still feel afraid of it? I have to try it to remember that it's still tasty to me. And even now, it's just a side to something \"safe\" like a season chicken breast and mashed potatoes (my other safe food.) \n\nThen yeah, don't eat it with every meal but go back to it semi-frequently. Let the process unfold naturally. Think about flavorings to try next in between meals.\n\nSpinach! Yes, I struggle with spinach as I enjoy salad add-ons but the actual spinach leaf itself is kind of bitter so I usually do iceberg lettuce. \n\nI know this is going to sound crazy because most of us here have an aversion to things being liquified that aren't supposed to be liquified as well as mixed consistencies BUT...\n\nOut of desperation to get some more green in my diet, I finally started trying green smoothies AND HONESTLY IT ISN'T BAD. If you blend spinach, you actually cannot taste it. It *will* be green yes but you can drink it and it'll just taste like fruit and yogurt/milk that you put in it. I do a big handful of spinach, strawberries, banana, blueberries, almond milk and chia seeds. I honestly love it. The first day I tried it and loved it, the second day I had two for breakfast, and I'm gonna keep having them for breakfast. I feel so much better knowing I'm getting more greens in. Next I will try putting kale in there too. \n\nI know no one is going to believe me because I also never believed people when they say you can't taste the spinach but you really can't.",
      "created_utc": 1588102206.0,
      "score": 1,
      "context": [
        {
          "id": "fovcskr",
          "author": "Eireann_9",
          "body": "Interesting. I've actually just discovered this sub and ARFID but I've been desensitizing myself to flavours for the last year or so. A year ago i didn't eat any of the vegetables in the chart. Now I eat asparagus (first i tried), brocoli (discovered about 6 months ago) and yesterday i tried spinach and i see potential there. I guess I'll try the sprouts next\n\nI thinks it's interesting how all those vegetables are the ones that are indicated to begin with. It's not even that I've tried others and didn't like them, it just happens that i decided to start with those.\n\n\nFor me the process is:\n\n1 Try it but not eat a full plate: Literally just taking a bit with the fork and then keep eating a safe food. Normally I'm absolutely disgusted by it even if i recognize that it's ok. It's just that the flavour profile is very different from all my safe foods.\n\n2 Full small plate with safe food alternative: Even if I've liked it i wait for another day to eat it as a meal. That way i can mentally prepare myself for it and it isn't scary as I'm not trying something that i don't know. Usually i don't enjoy it at this point but is doable. If I'm really struggling I stop and eat the alternative. It's weird cause even if I can't stand the food i know that there's potential for me to like it. It's like i like it but my brain doesn't want me to.\n\n3 Keep eating it: i find that after a couple or three times i start enjoying it and become used to it. I tend to have a phase in which i eat it A LOT and it's the only food in that food group that i want to eat. Then i get bored and stop for a while and then i integrate it normally to my repertoire.\n\nCurrently I'm in the \"like it but it's gross\" phase with spinach, mainly due to texture, \"omg this is the only vegetable i ever want to eat again\" with broccoli, and \"welp another nice food\" with asparagus. Once spinach has passed to the next phase i will introduce Brussel sprouts",
          "created_utc": 1588099159.0
        }
      ]
    },
    {
      "id": "fdhgox6",
      "author": "bluejen",
      "body": "I had the same thought! I’ve never heard of those pairing with veggies.",
      "created_utc": 1578422266.0,
      "score": 1,
      "context": [
        {
          "id": "fdgjkn8",
          "author": "nicohusko",
          "body": "All veggies are a big no for me but I want to try some based on this chart. the cushions honey and maple syrup confuse me tho, what veggies would taste good with that?",
          "created_utc": 1578399398.0
        }
      ]
    },
    {
      "id": "fovlv3x",
      "author": "Eireann_9",
      "body": "I relate to liking it but still being afraid of it. It was a big issue with fish, i hadn't eaten any for at least 10 years and it was so different that it freaked me out. Like my mom would make salmon and offer me some and I'd always chose to est something else even if i rationally knew that i liked it. It was part inertia part not feeling safe enough, and also there are days i couldn't bring myself to be adventurous and i would go in \"yeah no\" mode.\n\nAnd I'll definitely try the smoothy thing, I didn't know it wasn't common to like liquified stuff. Purees are the only thing (along broccoli now lol) that make me excited about eating vegetables, and that's how i introduced potatoes and carrots, although i still struggle with both in solid form. \n\nAbout spinach i haven't tried them raw yet, salads make me miserable and i dislike mixed ones, i tend to eat the ingredients separately. I tried it baled with bechamel sauce and a bit of cheese. It's both fatty and sweet so it masks the bitterness. The problem then is that you have a viscous thing in a semi solid sauce and well... texture issues 😅. I may try doing spinach lasagna and see if the separation of the layers help with that",
      "created_utc": 1588103512.0,
      "score": 1,
      "context": [
        {
          "id": "fovcskr",
          "author": "Eireann_9",
          "body": "Interesting. I've actually just discovered this sub and ARFID but I've been desensitizing myself to flavours for the last year or so. A year ago i didn't eat any of the vegetables in the chart. Now I eat asparagus (first i tried), brocoli (discovered about 6 months ago) and yesterday i tried spinach and i see potential there. I guess I'll try the sprouts next\n\nI thinks it's interesting how all those vegetables are the ones that are indicated to begin with. It's not even that I've tried others and didn't like them, it just happens that i decided to start with those.\n\n\nFor me the process is:\n\n1 Try it but not eat a full plate: Literally just taking a bit with the fork and then keep eating a safe food. Normally I'm absolutely disgusted by it even if i recognize that it's ok. It's just that the flavour profile is very different from all my safe foods.\n\n2 Full small plate with safe food alternative: Even if I've liked it i wait for another day to eat it as a meal. That way i can mentally prepare myself for it and it isn't scary as I'm not trying something that i don't know. Usually i don't enjoy it at this point but is doable. If I'm really struggling I stop and eat the alternative. It's weird cause even if I can't stand the food i know that there's potential for me to like it. It's like i like it but my brain doesn't want me to.\n\n3 Keep eating it: i find that after a couple or three times i start enjoying it and become used to it. I tend to have a phase in which i eat it A LOT and it's the only food in that food group that i want to eat. Then i get bored and stop for a while and then i integrate it normally to my repertoire.\n\nCurrently I'm in the \"like it but it's gross\" phase with spinach, mainly due to texture, \"omg this is the only vegetable i ever want to eat again\" with broccoli, and \"welp another nice food\" with asparagus. Once spinach has passed to the next phase i will introduce Brussel sprouts",
          "created_utc": 1588099159.0
        },
        {
          "id": "fovj5rq",
          "author": "bluejen",
          "body": "That's how I tried it, too. Introduced it not as even a full serving. Right now I'm stuck on just asparagus and will try broccoli once I trust asparagus fully. I like it a lot, but I still feel afraid of it? I have to try it to remember that it's still tasty to me. And even now, it's just a side to something \"safe\" like a season chicken breast and mashed potatoes (my other safe food.) \n\nThen yeah, don't eat it with every meal but go back to it semi-frequently. Let the process unfold naturally. Think about flavorings to try next in between meals.\n\nSpinach! Yes, I struggle with spinach as I enjoy salad add-ons but the actual spinach leaf itself is kind of bitter so I usually do iceberg lettuce. \n\nI know this is going to sound crazy because most of us here have an aversion to things being liquified that aren't supposed to be liquified as well as mixed consistencies BUT...\n\nOut of desperation to get some more green in my diet, I finally started trying green smoothies AND HONESTLY IT ISN'T BAD. If you blend spinach, you actually cannot taste it. It *will* be green yes but you can drink it and it'll just taste like fruit and yogurt/milk that you put in it. I do a big handful of spinach, strawberries, banana, blueberries, almond milk and chia seeds. I honestly love it. The first day I tried it and loved it, the second day I had two for breakfast, and I'm gonna keep having them for breakfast. I feel so much better knowing I'm getting more greens in. Next I will try putting kale in there too. \n\nI know no one is going to believe me because I also never believed people when they say you can't taste the spinach but you really can't.",
          "created_utc": 1588102206.0
        }
      ]
    }
  ]
}