{
  "id": "f3f39v",
  "subreddit": "ARFID",
  "author": "miss--diagnosed",
  "created_utc": 1581621140.0,
  "title": "Why do people hate picky eaters so much?",
  "selftext": "Why are they so determined to shame us for \"having the tastebuds of children\"? They act like we've insulted them personally. I'm the one with the eating disorder, I'm absolutely revolted by some of the things most people eat, yet I keep quiet about it because I'm not a fucking child. I can't control what people eat, and I won't try because I don't get to make choices for other people. So why do they try to force *us* to eat things? Their hatred is so weirdly intense. \n\nThat recent thread on r/whitepeopletwitter about onion hate is filled with condescending comments towards people who hate onions and treating us like we're mentally delayed or something for it. Well we're not the ones throwing hissy fits because someone doesn't like the same things we do. \n\nI'm lucky my disorder isn't as bad as a lot of people here (there is quite a lot on willing to eat just to avoid being shamed) but it still affects my life quite a bit. I just can't understand caring about what other people don't like to eat.\n\nAnd on the topic of onion hating - why the fuck do onion lovers always tell you you can't even taste the onions, and when you ask why they even bother adding them then, they tell you it's because it \"adds to the flavor\"? Either it has flavor, or it doesn't (and it most definitely does lol).",
  "url": "https://www.reddit.com/r/ARFID/comments/f3f39v/why_do_people_hate_picky_eaters_so_much/",
  "score": 383,
  "num_comments": 114,
  "comments": [
    {
      "id": "fhinqb0",
      "author": "Prof_Gutnacht",
      "body": "r/AmITheAsshole is filled with these kinds of people. I don't understand why they hate people with arfid so much either. probably  just bigotry",
      "created_utc": 1581628318.0,
      "score": 109,
      "context": []
    },
    {
      "id": "fhii6bc",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1581625232.0,
      "score": 144,
      "context": []
    },
    {
      "id": "fhiry7e",
      "author": "Gaminbro91",
      "body": "People often get pissed at me for not eating stuff. Like today i had a teacher cooking some stuff and she was giving it out to the class and I'm just like nah I'm good but apparently not eating a damn fried banana is a sin against humanity",
      "created_utc": 1581630636.0,
      "score": 44,
      "context": []
    },
    {
      "id": "fhjfxue",
      "author": "flower_milk",
      "body": "I've been done with people like that for years now. If someone is going to bitch at me for my choice in food, I'm just going to not eat then in protest. I've spent many a meal going hungry because I am not going to put up with people trying to force feed me and trying to make me throw up in front of them. I don't give a shit anymore, I've spent way too many years feeling shitty about myself because of people making fun of me because I can't eat certain foods without throwing up and I got tired of not being able to like myself because of it.",
      "created_utc": 1581645227.0,
      "score": 25,
      "context": []
    },
    {
      "id": "fhim43i",
      "author": "DifferentIsPossble",
      "body": "\"If I had to suffer through it, so do you\" mentality.\n\nForget that it wasn't nearly as intense for them or that it doesn't hurt anyone to not do it.\n\nThat, or \"normalizing\" your kids/people socially ranked below you by force. Same shit they do during ABA for autistic kids. Basically torturing them into masking.",
      "created_utc": 1581627420.0,
      "score": 38,
      "context": []
    },
    {
      "id": "fhj60g8",
      "author": "it_was_you_fredo",
      "body": "Let me see if I can draw an analogy.  I may have a near-unique perspective to answer this question.\n\nThing 1 is I don't have ARFID.  In fact, what draws me to this subreddit and similar forums is I'm the opposite.  I *love* food, and I'll eat anything.  Most of the analogies ARFID sufferers draw are lost on me.  I *would*, in fact, eat raw liver.  Have.  So I hang out here because I find it fascinating, and also because my deep knowledge of food sometimes enables me to make genuine suggestions.\n\nThing 2 is I don't like music.  It's mostly annoying noise to me.  Yes, I've tried all the genres.  Yes, that one, and that one too.  I just don't get most of it.  And I'm nearly 50, so I've had plenty of experiences to form an opinion.\n\nIf you're like most people, you'd respond to Thing 2 with near-disbelief.  And then you might think there's something seriously wrong with me.  And then it might upset you, because I don't like your favorite singer.  It's incomprehensible to you, maybe.  *How can somebody not like this thing I like?*\n\nDo you see what I'm getting at?\n\nFood, music, and a few others are near-universal shared human experiences.  Substitute \"music\" for food in the rest of this paragraph.  If you're like me, you think about food a lot.  You invest time, money, and effort into this food thing on a bunch of levels.  When you're planning an evening, the central event involves food.  And then, when you find out there's somebody who dislikes or is indifferent to the entire subject of food, it seems weird and off-putting.  Like that person is insulting this thing you've put so much into.\n\nThis is just speculation based on personal experience.  I admit, I was stunned when I first heard of ARFID, which goes back many years before ARFID was even officially A Thing.  I felt the things you've probably all heard.  You eat like a child, you just have to try it, etc.  But I understand it better now, and I'm pretty sure there's merit to my analogy.\n\nJust my $0.02.\n\nTL;DR: I don't like music.  People tend to react toward me the same way they react toward ARFID sufferers.  If you can understand the reaction toward my indifference to music, perhaps you can understand others' reactions toward ARFID.",
      "created_utc": 1581638752.0,
      "score": 46,
      "context": []
    },
    {
      "id": "fhiy9yf",
      "author": "boring-unicorn",
      "body": "I just spent a week with 2 picky kids, it's just the options are so limited we all ended up eating shit we didn't enjoy which sucked.  On the last day we found a buffet tho which was amazing because we all enjoyed it!! You just need to plan ahead better so that you can all get what you like, food courts, buffets or Cheesecake Factory are all good options in my experience. Also if you're a picky eater just eat before meeting up with people just in case so that you don't starve",
      "created_utc": 1581634272.0,
      "score": 15,
      "context": []
    },
    {
      "id": "fhk1wrz",
      "author": "pleaseletmesleepp",
      "body": "Hate how people think they are superior for eating onions. I also get extremely angry when I see the same people talking about other prejudices and not shaming people. Fucking hypocrites. \n\nI avoid these people as much as I can nowadays, but in the internet I swear to god its hard to not tell these people to go fuck themselves and mind their own business.\n\nI just want to dislike ice cream, mayo and the textures of tomatoes in peace.",
      "created_utc": 1581663297.0,
      "score": 13,
      "context": []
    },
    {
      "id": "fhkehne",
      "author": "FurballFather",
      "body": "I had a incident with a non-tolerant person like that, was eating with parents and said \"person\" plus their SO, just as we are about to start, she thinks I'm \"too childish\" or something and feel it's okay to pour unsafe food onto my plate with my safefood, resulting in me storming off, and didn't eat a bite of that meal, I'm sorry to say that I don't see this \"person\" as a \"human\" anymore, for not respecting others boundaries, and I am very careful about having my food exposed now, these experiences can really have an impact on how we proceive people who doesn't understand, or are prejudice. Peace & Love",
      "created_utc": 1581680433.0,
      "score": 11,
      "context": []
    },
    {
      "id": "fhlqvga",
      "author": "capitannn",
      "body": "It's a weird little fucked up way to feel superior to you.",
      "created_utc": 1581703575.0,
      "score": 9,
      "context": []
    },
    {
      "id": "fhih911",
      "author": "The1579",
      "body": ">So why do they try to force *us* to eat things?\n\nAre people really doing this? Sounds like a crime to me.",
      "created_utc": 1581624715.0,
      "score": 21,
      "context": []
    },
    {
      "id": "fhie95v",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1581623038.0,
      "score": 18,
      "context": []
    },
    {
      "id": "fk347nu",
      "author": "Xcxcvxc",
      "body": "Was prepared to award the post if I had any coins left. Absolutely spot on.\n\nI get reactions from weird to concern to actual hate for almost exclusively eating a meal replacement, no matter it’s one of the best things to happen to me and I’m actually feeling well for once. At least my actual friends are happy for me.",
      "created_utc": 1583817180.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fip9up3",
      "author": "None",
      "body": "I just discovered this subreddit and I didn't know that ARFID existed. After reading up a little, I have this to say:\n\nI don't hate people with eating disorders. I hate \"normal\" picky eaters. People who \\*can\\* eat almost any food with no distress and who don't have a disorder, but instead who turn their noses up at most things, say they won't try new things because \"that food just doesn't sound like it goes with that\", and who are in various ways wasteful with food.\n\nI am sorry that you have a disorder, but to me it seems that in generalizing \"people who hate picky eaters\", you're inadvertently generalizing \"picky eaters\" and people with ARFID (or whatever else) into the same category.",
      "created_utc": 1582601314.0,
      "score": 3,
      "context": []
    },
    {
      "id": "j7yp1cl",
      "author": "cyberpunk-ymir",
      "body": "My dad is literally allergic to onions. People have tried to feed him onions, sneak them into his food. They make him sick. Onion lovers need to stop. Like yeah I like onion rings, but your veggie isn't a god.\n\nAlso, I'm a picky eater. I bet my autism plays a part in this. Do I have something to say on the topic of picky eating though!\n\nMy egg donor has this really terrible mother and she would give me shit about my eating habits at every opportunity. \"You're holding your knife wrong!\", \"If you're so picky, no man will want to marry you! What're you going to do when his mother cooks you something you don't like?\" \"I'm so proud of you for [masking- I mean,] making yourself eat the pizza despite the toppings.\"\n\nShe's blocked and will never see me again. She and egg donor made me feel bad about it, but also made me double down at the same time, because their \"help\" was criticism. Since Dad and I have moved out, things have been improving. I still have to get used to the advice I receive being from love and not from rudeness, but I want to try new foods most of the time now. But I still like my food very much on the plain side.\n\nThat said, I hate how picky eaters are always compared to kids. I'm twenty-one years old. Stop infantilizing me. I would never pick on you for how spicy you like your food to be or how many flavours you want your meal to have. I'm no less grown up or respectable for being satisfied with simpler foods.",
      "created_utc": 1676024092.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fhk5u7t",
      "author": "bubbles5810",
      "body": "A fucking man!!!!!",
      "created_utc": 1581668190.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fk2xvk8",
      "author": "ShebanotDoge",
      "body": "Probably left over from when you couldn't afford to not eat any food that was available.",
      "created_utc": 1583811859.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kfcf0us",
      "author": "killer_koff",
      "body": "Im on the spectrum so I’m not about to eat a LOT of things, and no amount of anger or crying or pleading is going to make me eat something I do not like. It’s not something that I can help, my tastebuds are super sensitive and I am texture sensitive. People really do take it very personally for some reason, and even to the point where it pisses em off if you won’t eat or try something… and honestly at this point, I could two fucks less about how they feel on the issue. Imo I’m the one who should be mad, because I constantly have some dick head trying to force/pressure me to eat something I already know I do not like while acting like I am the problem. They’re in the wrong, not you. Another thing I really fucking hate is when you ask what is in/on something and they refuse to tell you, they just keep going “just try it!”. No. Not gonna do that, I want to know what is on/in it because if I bite into something I do not like… I’m gonna be really fucking pissed about it",
      "created_utc": 1703809775.0,
      "score": 2,
      "context": []
    },
    {
      "id": "le5cmnb",
      "author": "Serious-Piglet5694",
      "body": "that's because picky eaters have an air of insolence and hubris around the food that others enjoy eating. make your own food, i wish i could say that to kids who cannot cook for themselves. they dont say just no, but they have to make a huge fuss about it. but if you are just saying no and people still get upset then that's on them",
      "created_utc": 1721516174.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mu9jyap",
      "author": "CoolDrag6099",
      "body": "You can ABSOLUTELY taste onion. That's kinda the point.  I'm hyposensitive to taste, so alliums and capsicum are the first 2 things I go to to try and make things palatable. (Texture can still kill a dish for me no matter how I flavor it)\nIf someone says they can barely taste onion, test them for covid.",
      "created_utc": 1748220599.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fhim3ku",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1581627413.0,
      "score": -1,
      "context": []
    },
    {
      "id": "iwsvecp",
      "author": "None",
      "body": "Reading the comments, I can understand why people get annoyed by picky eaters.",
      "created_utc": 1668738201.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kfgecf4",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1703879316.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fhj5ezo",
      "author": "wandadetroit",
      "body": "Like [this one](https://www.reddit.com/r/AmItheAsshole/comments/f31hyy/aita_for_telling_my_sister_she_could_starve_if/?utm_medium=android_app&utm_source=share) yesterday. Had me fuming.",
      "created_utc": 1581638454.0,
      "score": 31,
      "context": [
        {
          "id": "fhinqb0",
          "author": "Prof_Gutnacht",
          "body": "r/AmITheAsshole is filled with these kinds of people. I don't understand why they hate people with arfid so much either. probably  just bigotry",
          "created_utc": 1581628318.0
        }
      ]
    },
    {
      "id": "fhjcys5",
      "author": "miss--diagnosed",
      "body": "Yeah, that's the first place I ever saw how much some people seem to hate us. I mean, I've been made fun of for it my whole life, but I always thought it was just ignorance. I didn't realize some people actually get fired up when you don't have the same tastebuds as them lol.",
      "created_utc": 1581643118.0,
      "score": 28,
      "context": [
        {
          "id": "fhinqb0",
          "author": "Prof_Gutnacht",
          "body": "r/AmITheAsshole is filled with these kinds of people. I don't understand why they hate people with arfid so much either. probably  just bigotry",
          "created_utc": 1581628318.0
        }
      ]
    },
    {
      "id": "fhkls7z",
      "author": "mlputnam",
      "body": "The way I saw that AITA was that it wasn't so much about food but about the way the younger sister was treating her sibling. I think OP had already gone to great lengths to help, provider for, and understand their sib's eating disorder. At this point the sister, in my opinion, was being TA. \nPersonally the way I see it is that my ARFID isn't everyone else's problem. We deserve compassion and understanding, but we don't get to be jerks. Learn to make your own safe foods. It's not someone else's responsibility to cater to our exact whims and it's never an excuse to abuse people.\n\nThe hatred in the comments was unsettling. Let's be better than that. Let's treat others with respect. \n(Talking about the girl in the post-i don't see any disrespect coming from this community ❤️)",
      "created_utc": 1581686520.0,
      "score": 8,
      "context": [
        {
          "id": "fhinqb0",
          "author": "Prof_Gutnacht",
          "body": "r/AmITheAsshole is filled with these kinds of people. I don't understand why they hate people with arfid so much either. probably  just bigotry",
          "created_utc": 1581628318.0
        }
      ]
    },
    {
      "id": "m343ouk",
      "author": "0z79",
      "body": "Were you ever forbidden from eating a crumb while the rest of your family went to the buffet? Or are you just a rich bitch who wants their chicken nuggies?",
      "created_utc": 1734772664.0,
      "score": 1,
      "context": [
        {
          "id": "fhinqb0",
          "author": "Prof_Gutnacht",
          "body": "r/AmITheAsshole is filled with these kinds of people. I don't understand why they hate people with arfid so much either. probably  just bigotry",
          "created_utc": 1581628318.0
        }
      ]
    },
    {
      "id": "fhijt88",
      "author": "cas1313",
      "body": "I’ve had so many similar experiences. It was so strange to me that they cared so much about what I didn’t want to eat. I’m not your child. I’m sorry you had to go through this as well. It was definitely really damaging to be attacked by an adult when I’m just a young child.",
      "created_utc": 1581626141.0,
      "score": 43,
      "context": [
        {
          "id": "fhii6bc",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1581625232.0
        }
      ]
    },
    {
      "id": "fhip9pn",
      "author": "miss--diagnosed",
      "body": "When I was a kid my best friend's parents would always laugh at me and say they were going to feed me something I didn't want to eat and tell me it was something else to trick me into eating it. I was never banned from anyone's house but yes, parents weren't too happy with my food choices either.",
      "created_utc": 1581629163.0,
      "score": 41,
      "context": [
        {
          "id": "fhii6bc",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1581625232.0
        }
      ]
    },
    {
      "id": "fhj7k9q",
      "author": "KingTalis",
      "body": "Luckily for me all of my friends' parents growing up were actually good people. My biggest problem was they were determined to go out of their way to make me something I'd eat and I always felt bad about them doing extra work just for me.",
      "created_utc": 1581639566.0,
      "score": 25,
      "context": [
        {
          "id": "fhii6bc",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1581625232.0
        }
      ]
    },
    {
      "id": "fi6kibv",
      "author": "None",
      "body": "The only friend I had growing up was Russian, and his parents were VERY Russian. Whenever I went over, they would make Russian food. They were very insistent on feeding everyone. His mom, bless her soul, must have noticed that it made me uncomfortable because she began talking about it with my mom. She started keeping a small cupboard full of little things for when I came over. \n\n>\n\nEven today I automatically say not thanks to any offer of food without any thought as to what they may have. But I feel like I was lucky to not be shunned there at least..",
      "created_utc": 1582198967.0,
      "score": 12,
      "context": [
        {
          "id": "fhii6bc",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1581625232.0
        }
      ]
    },
    {
      "id": "m711wcy",
      "author": "SnakeItch",
      "body": "There are many implications in your story which points at the idea that it wasn't the mothers' fault, rather it was yours.\n\nFirst of all, if you refused to eat their food you would be banned. In a sweeter sense they might have banned you because they knew you wouldn't like their food and they wouldn't want to be responsible for a child to starve while in their house.   \n  \nSecondly, they might have felt that they didn't have to accommodate for your picky diet of chicken nuggets and a grilled cheese sandwich or whatever.\n\nIf you made gagging noises or made a fuss over eating food, obviously you'd get banned.\n\nAnd the fact that NUMEROUS mothers banned you, not one, implicates these ideas.",
      "created_utc": 1736820310.0,
      "score": 2,
      "context": [
        {
          "id": "fhii6bc",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1581625232.0
        }
      ]
    },
    {
      "id": "kfgdzta",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1703879187.0,
      "score": 1,
      "context": [
        {
          "id": "fhii6bc",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1581625232.0
        }
      ]
    },
    {
      "id": "fhiwqsy",
      "author": "Singitqueen",
      "body": "That is always a nightmare. I had a teacher bring us cupcakes, and they were fantastic. But, they were strawberry. I had to ask the person across from me if she wanted my strawberry, which was sorta embarrassing, but she didn't mention anything and accepted. This was a tame experience compared to some of the times I've had this happen. \n\nThe worst time I ever had in elementary school was when they started giving us a fresh fruit or vegetable every day. We weren't ever forced to eat them but come on, we were forced to eat them. Anyway, yeah that is the worst.",
      "created_utc": 1581633372.0,
      "score": 22,
      "context": [
        {
          "id": "fhiry7e",
          "author": "Gaminbro91",
          "body": "People often get pissed at me for not eating stuff. Like today i had a teacher cooking some stuff and she was giving it out to the class and I'm just like nah I'm good but apparently not eating a damn fried banana is a sin against humanity",
          "created_utc": 1581630636.0
        }
      ]
    },
    {
      "id": "fhpwd5h",
      "author": "abbymazing1201",
      "body": "I remember in freaking *middle school* counselors and staff at church camps would try to force me to eat the same meals as everyone else. At one of the camps I wasn't allowed to eat dessert (something I liked) because I didn't eat the meal, and at the other one they threatened to make my mom drive 5 hours to pick me up. It was miserable.",
      "created_utc": 1581795958.0,
      "score": 8,
      "context": [
        {
          "id": "fhiry7e",
          "author": "Gaminbro91",
          "body": "People often get pissed at me for not eating stuff. Like today i had a teacher cooking some stuff and she was giving it out to the class and I'm just like nah I'm good but apparently not eating a damn fried banana is a sin against humanity",
          "created_utc": 1581630636.0
        }
      ]
    },
    {
      "id": "fhjlgop",
      "author": "miss--diagnosed",
      "body": "Good for you, I admire that. I try to avoid these people as much as I can but I definitely need to stand my ground a bit more when the situation calls for it.",
      "created_utc": 1581649142.0,
      "score": 9,
      "context": [
        {
          "id": "fhjfxue",
          "author": "flower_milk",
          "body": "I've been done with people like that for years now. If someone is going to bitch at me for my choice in food, I'm just going to not eat then in protest. I've spent many a meal going hungry because I am not going to put up with people trying to force feed me and trying to make me throw up in front of them. I don't give a shit anymore, I've spent way too many years feeling shitty about myself because of people making fun of me because I can't eat certain foods without throwing up and I got tired of not being able to like myself because of it.",
          "created_utc": 1581645227.0
        }
      ]
    },
    {
      "id": "fhjck7f",
      "author": "miss--diagnosed",
      "body": "That's interesting, I've never heard of anyone hating music before. But while I certainly may have a hard time finding common ground with someone who hates music, I also wouldn't respond with the vitriol that a lot of people do towards picky eaters. Though I'm sure there are people who act that way towards you. \n\nThe thing is, I think people who judge you for not liking music are idiots as well. Is it hard to understand? Yes, maybe. Will they feel there is a huge part of you that they aren't able to relate to? Also yes. But they shouldn't make judgements on you as a person.\n\nSo I still don't understand, because as someone who has constantly been made fun of for things such as my limited diet, I've developed empathy and I just chose to accept when people don't like the same things I like. It would be one thing, of course, if they were to directly insult the thing I like and make judgements on me for liking said thing, but that's usually not the case with picky eaters/people with ARFID when speaking of the foods we dislike. \n\nAlso, ARFID is an eating disorder and not something that's simply annoying. I have an actual phobia of certain foods, to the point that there are things I wouldn't even touch if my life depended on it. A more accurate comparison would be people responding with anger toward someone with severe sensory issues who can't physically can't handle listening to music. \n\nThanks for sharing your thoughts though, I get where you're coming from but I have to disagree for the most part.",
      "created_utc": 1581642828.0,
      "score": 23,
      "context": [
        {
          "id": "fhj60g8",
          "author": "it_was_you_fredo",
          "body": "Let me see if I can draw an analogy.  I may have a near-unique perspective to answer this question.\n\nThing 1 is I don't have ARFID.  In fact, what draws me to this subreddit and similar forums is I'm the opposite.  I *love* food, and I'll eat anything.  Most of the analogies ARFID sufferers draw are lost on me.  I *would*, in fact, eat raw liver.  Have.  So I hang out here because I find it fascinating, and also because my deep knowledge of food sometimes enables me to make genuine suggestions.\n\nThing 2 is I don't like music.  It's mostly annoying noise to me.  Yes, I've tried all the genres.  Yes, that one, and that one too.  I just don't get most of it.  And I'm nearly 50, so I've had plenty of experiences to form an opinion.\n\nIf you're like most people, you'd respond to Thing 2 with near-disbelief.  And then you might think there's something seriously wrong with me.  And then it might upset you, because I don't like your favorite singer.  It's incomprehensible to you, maybe.  *How can somebody not like this thing I like?*\n\nDo you see what I'm getting at?\n\nFood, music, and a few others are near-universal shared human experiences.  Substitute \"music\" for food in the rest of this paragraph.  If you're like me, you think about food a lot.  You invest time, money, and effort into this food thing on a bunch of levels.  When you're planning an evening, the central event involves food.  And then, when you find out there's somebody who dislikes or is indifferent to the entire subject of food, it seems weird and off-putting.  Like that person is insulting this thing you've put so much into.\n\nThis is just speculation based on personal experience.  I admit, I was stunned when I first heard of ARFID, which goes back many years before ARFID was even officially A Thing.  I felt the things you've probably all heard.  You eat like a child, you just have to try it, etc.  But I understand it better now, and I'm pretty sure there's merit to my analogy.\n\nJust my $0.02.\n\nTL;DR: I don't like music.  People tend to react toward me the same way they react toward ARFID sufferers.  If you can understand the reaction toward my indifference to music, perhaps you can understand others' reactions toward ARFID.",
          "created_utc": 1581638752.0
        }
      ]
    },
    {
      "id": "fhjxnb6",
      "author": "Telaneo",
      "body": "Literally *all* music? I mean, not that I don't believe you, but even most people with ARFID and picky eaters will have some favourite food. Hence the chicken tenders meme. It's just that the vast majority of 'genres' of food are off the table, while the foods that are safe can still be enjoyable.\n\nAlthough there are definitly people with ARFID who have problems with food in general, so there's not like there's no equivelent to not liking music at all in the food world.\n\n> It's mostly annoying noise to me.\n\nYou say mostly, so maybe there are some genres better than others? Or some individual songs that are good? Or is no music always preferable, and some songs are just more tolerable than others? You should look up [musical anhedonia](https://en.wikipedia.org/wiki/Musical_anhedonia) if you haven't.\n\nYour analogy's spot on by the way.",
      "created_utc": 1581658824.0,
      "score": 9,
      "context": [
        {
          "id": "fhj60g8",
          "author": "it_was_you_fredo",
          "body": "Let me see if I can draw an analogy.  I may have a near-unique perspective to answer this question.\n\nThing 1 is I don't have ARFID.  In fact, what draws me to this subreddit and similar forums is I'm the opposite.  I *love* food, and I'll eat anything.  Most of the analogies ARFID sufferers draw are lost on me.  I *would*, in fact, eat raw liver.  Have.  So I hang out here because I find it fascinating, and also because my deep knowledge of food sometimes enables me to make genuine suggestions.\n\nThing 2 is I don't like music.  It's mostly annoying noise to me.  Yes, I've tried all the genres.  Yes, that one, and that one too.  I just don't get most of it.  And I'm nearly 50, so I've had plenty of experiences to form an opinion.\n\nIf you're like most people, you'd respond to Thing 2 with near-disbelief.  And then you might think there's something seriously wrong with me.  And then it might upset you, because I don't like your favorite singer.  It's incomprehensible to you, maybe.  *How can somebody not like this thing I like?*\n\nDo you see what I'm getting at?\n\nFood, music, and a few others are near-universal shared human experiences.  Substitute \"music\" for food in the rest of this paragraph.  If you're like me, you think about food a lot.  You invest time, money, and effort into this food thing on a bunch of levels.  When you're planning an evening, the central event involves food.  And then, when you find out there's somebody who dislikes or is indifferent to the entire subject of food, it seems weird and off-putting.  Like that person is insulting this thing you've put so much into.\n\nThis is just speculation based on personal experience.  I admit, I was stunned when I first heard of ARFID, which goes back many years before ARFID was even officially A Thing.  I felt the things you've probably all heard.  You eat like a child, you just have to try it, etc.  But I understand it better now, and I'm pretty sure there's merit to my analogy.\n\nJust my $0.02.\n\nTL;DR: I don't like music.  People tend to react toward me the same way they react toward ARFID sufferers.  If you can understand the reaction toward my indifference to music, perhaps you can understand others' reactions toward ARFID.",
          "created_utc": 1581638752.0
        }
      ]
    },
    {
      "id": "fhjc78v",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1581642572.0,
      "score": 11,
      "context": [
        {
          "id": "fhj60g8",
          "author": "it_was_you_fredo",
          "body": "Let me see if I can draw an analogy.  I may have a near-unique perspective to answer this question.\n\nThing 1 is I don't have ARFID.  In fact, what draws me to this subreddit and similar forums is I'm the opposite.  I *love* food, and I'll eat anything.  Most of the analogies ARFID sufferers draw are lost on me.  I *would*, in fact, eat raw liver.  Have.  So I hang out here because I find it fascinating, and also because my deep knowledge of food sometimes enables me to make genuine suggestions.\n\nThing 2 is I don't like music.  It's mostly annoying noise to me.  Yes, I've tried all the genres.  Yes, that one, and that one too.  I just don't get most of it.  And I'm nearly 50, so I've had plenty of experiences to form an opinion.\n\nIf you're like most people, you'd respond to Thing 2 with near-disbelief.  And then you might think there's something seriously wrong with me.  And then it might upset you, because I don't like your favorite singer.  It's incomprehensible to you, maybe.  *How can somebody not like this thing I like?*\n\nDo you see what I'm getting at?\n\nFood, music, and a few others are near-universal shared human experiences.  Substitute \"music\" for food in the rest of this paragraph.  If you're like me, you think about food a lot.  You invest time, money, and effort into this food thing on a bunch of levels.  When you're planning an evening, the central event involves food.  And then, when you find out there's somebody who dislikes or is indifferent to the entire subject of food, it seems weird and off-putting.  Like that person is insulting this thing you've put so much into.\n\nThis is just speculation based on personal experience.  I admit, I was stunned when I first heard of ARFID, which goes back many years before ARFID was even officially A Thing.  I felt the things you've probably all heard.  You eat like a child, you just have to try it, etc.  But I understand it better now, and I'm pretty sure there's merit to my analogy.\n\nJust my $0.02.\n\nTL;DR: I don't like music.  People tend to react toward me the same way they react toward ARFID sufferers.  If you can understand the reaction toward my indifference to music, perhaps you can understand others' reactions toward ARFID.",
          "created_utc": 1581638752.0
        }
      ]
    },
    {
      "id": "fhk3ha9",
      "author": "Singitqueen",
      "body": "I love that analogy. I'm definitely going to use it, as my grandma doesn't like music either and it'll help my family understand. I appreciate your 2 cents.",
      "created_utc": 1581665164.0,
      "score": 4,
      "context": [
        {
          "id": "fhj60g8",
          "author": "it_was_you_fredo",
          "body": "Let me see if I can draw an analogy.  I may have a near-unique perspective to answer this question.\n\nThing 1 is I don't have ARFID.  In fact, what draws me to this subreddit and similar forums is I'm the opposite.  I *love* food, and I'll eat anything.  Most of the analogies ARFID sufferers draw are lost on me.  I *would*, in fact, eat raw liver.  Have.  So I hang out here because I find it fascinating, and also because my deep knowledge of food sometimes enables me to make genuine suggestions.\n\nThing 2 is I don't like music.  It's mostly annoying noise to me.  Yes, I've tried all the genres.  Yes, that one, and that one too.  I just don't get most of it.  And I'm nearly 50, so I've had plenty of experiences to form an opinion.\n\nIf you're like most people, you'd respond to Thing 2 with near-disbelief.  And then you might think there's something seriously wrong with me.  And then it might upset you, because I don't like your favorite singer.  It's incomprehensible to you, maybe.  *How can somebody not like this thing I like?*\n\nDo you see what I'm getting at?\n\nFood, music, and a few others are near-universal shared human experiences.  Substitute \"music\" for food in the rest of this paragraph.  If you're like me, you think about food a lot.  You invest time, money, and effort into this food thing on a bunch of levels.  When you're planning an evening, the central event involves food.  And then, when you find out there's somebody who dislikes or is indifferent to the entire subject of food, it seems weird and off-putting.  Like that person is insulting this thing you've put so much into.\n\nThis is just speculation based on personal experience.  I admit, I was stunned when I first heard of ARFID, which goes back many years before ARFID was even officially A Thing.  I felt the things you've probably all heard.  You eat like a child, you just have to try it, etc.  But I understand it better now, and I'm pretty sure there's merit to my analogy.\n\nJust my $0.02.\n\nTL;DR: I don't like music.  People tend to react toward me the same way they react toward ARFID sufferers.  If you can understand the reaction toward my indifference to music, perhaps you can understand others' reactions toward ARFID.",
          "created_utc": 1581638752.0
        }
      ]
    },
    {
      "id": "fk2y6wn",
      "author": "ShebanotDoge",
      "body": "You might be tone deaf. People with tone deafness can't differentiate between different notes, so music just sounds like random noises.",
      "created_utc": 1583812098.0,
      "score": 1,
      "context": [
        {
          "id": "fhj60g8",
          "author": "it_was_you_fredo",
          "body": "Let me see if I can draw an analogy.  I may have a near-unique perspective to answer this question.\n\nThing 1 is I don't have ARFID.  In fact, what draws me to this subreddit and similar forums is I'm the opposite.  I *love* food, and I'll eat anything.  Most of the analogies ARFID sufferers draw are lost on me.  I *would*, in fact, eat raw liver.  Have.  So I hang out here because I find it fascinating, and also because my deep knowledge of food sometimes enables me to make genuine suggestions.\n\nThing 2 is I don't like music.  It's mostly annoying noise to me.  Yes, I've tried all the genres.  Yes, that one, and that one too.  I just don't get most of it.  And I'm nearly 50, so I've had plenty of experiences to form an opinion.\n\nIf you're like most people, you'd respond to Thing 2 with near-disbelief.  And then you might think there's something seriously wrong with me.  And then it might upset you, because I don't like your favorite singer.  It's incomprehensible to you, maybe.  *How can somebody not like this thing I like?*\n\nDo you see what I'm getting at?\n\nFood, music, and a few others are near-universal shared human experiences.  Substitute \"music\" for food in the rest of this paragraph.  If you're like me, you think about food a lot.  You invest time, money, and effort into this food thing on a bunch of levels.  When you're planning an evening, the central event involves food.  And then, when you find out there's somebody who dislikes or is indifferent to the entire subject of food, it seems weird and off-putting.  Like that person is insulting this thing you've put so much into.\n\nThis is just speculation based on personal experience.  I admit, I was stunned when I first heard of ARFID, which goes back many years before ARFID was even officially A Thing.  I felt the things you've probably all heard.  You eat like a child, you just have to try it, etc.  But I understand it better now, and I'm pretty sure there's merit to my analogy.\n\nJust my $0.02.\n\nTL;DR: I don't like music.  People tend to react toward me the same way they react toward ARFID sufferers.  If you can understand the reaction toward my indifference to music, perhaps you can understand others' reactions toward ARFID.",
          "created_utc": 1581638752.0
        }
      ]
    },
    {
      "id": "fhj5mtw",
      "author": "wandadetroit",
      "body": "I spent $70 on a buffet in Vegas to end up eating only a slice of prime rib, a plain baked potato (with butter) and two rolls. But it was safe. \n\nBuffets are the absolute best.",
      "created_utc": 1581638562.0,
      "score": 12,
      "context": [
        {
          "id": "fhiy9yf",
          "author": "boring-unicorn",
          "body": "I just spent a week with 2 picky kids, it's just the options are so limited we all ended up eating shit we didn't enjoy which sucked.  On the last day we found a buffet tho which was amazing because we all enjoyed it!! You just need to plan ahead better so that you can all get what you like, food courts, buffets or Cheesecake Factory are all good options in my experience. Also if you're a picky eater just eat before meeting up with people just in case so that you don't starve",
          "created_utc": 1581634272.0
        }
      ]
    },
    {
      "id": "mu9toyc",
      "author": "CoolDrag6099",
      "body": "Ugh, yes. Ketchup and red sauce are both great, so it's not a taste thing, but give me chunks of tomato and I am out. Cucumber, on the other hand, it's both taste AND texture.",
      "created_utc": 1748224309.0,
      "score": 1,
      "context": [
        {
          "id": "fhk1wrz",
          "author": "pleaseletmesleepp",
          "body": "Hate how people think they are superior for eating onions. I also get extremely angry when I see the same people talking about other prejudices and not shaming people. Fucking hypocrites. \n\nI avoid these people as much as I can nowadays, but in the internet I swear to god its hard to not tell these people to go fuck themselves and mind their own business.\n\nI just want to dislike ice cream, mayo and the textures of tomatoes in peace.",
          "created_utc": 1581663297.0
        }
      ]
    },
    {
      "id": "fhilz4e",
      "author": "DifferentIsPossble",
      "body": "Yup. Ever seen parents of a picky eater? They show off and brag about how they're tough on their kids.",
      "created_utc": 1581627342.0,
      "score": 36,
      "context": [
        {
          "id": "fhih911",
          "author": "The1579",
          "body": ">So why do they try to force *us* to eat things?\n\nAre people really doing this? Sounds like a crime to me.",
          "created_utc": 1581624715.0
        }
      ]
    },
    {
      "id": "fhj0vx0",
      "author": "ThrowItAllAway003",
      "body": "Absolutely. My aunt is one. She decided it was time I learned to like broccoli while I was on a trip with her. She tried to ground me on vacation because I cried and threw up while he young grandkids ate them while just making a face. \n\nSpoiler-I’ve never gone anywhere with her again and don’t actually speak to her more than once a year or so",
      "created_utc": 1581635866.0,
      "score": 16,
      "context": [
        {
          "id": "fhih911",
          "author": "The1579",
          "body": ">So why do they try to force *us* to eat things?\n\nAre people really doing this? Sounds like a crime to me.",
          "created_utc": 1581624715.0
        }
      ]
    },
    {
      "id": "fhiobj3",
      "author": "miss--diagnosed",
      "body": "Yeah I know I'm being overly sensitive, I just wanted to vent.",
      "created_utc": 1581628643.0,
      "score": 10,
      "context": [
        {
          "id": "fhie95v",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1581623038.0
        }
      ]
    },
    {
      "id": "fipd3fn",
      "author": "miss--diagnosed",
      "body": "I'm saying \"picky eaters\" as opposed to \"people with ARFID\" because most people view people with ARFID as \"just\" picky eaters. It's good that you can distinguish between the two but unfortunately in my experience most people can't and honestly just don't want to. I asked why people hate picky eaters because that's how the majority see us. They have no idea what ARFID is nor do they care. Everyone is quick to assume that we simply don't want to eat certain things, not that those things will make us physically sick.",
      "created_utc": 1582603634.0,
      "score": 10,
      "context": [
        {
          "id": "fip9up3",
          "author": "None",
          "body": "I just discovered this subreddit and I didn't know that ARFID existed. After reading up a little, I have this to say:\n\nI don't hate people with eating disorders. I hate \"normal\" picky eaters. People who \\*can\\* eat almost any food with no distress and who don't have a disorder, but instead who turn their noses up at most things, say they won't try new things because \"that food just doesn't sound like it goes with that\", and who are in various ways wasteful with food.\n\nI am sorry that you have a disorder, but to me it seems that in generalizing \"people who hate picky eaters\", you're inadvertently generalizing \"picky eaters\" and people with ARFID (or whatever else) into the same category.",
          "created_utc": 1582601314.0
        }
      ]
    },
    {
      "id": "fmdx0pp",
      "author": "ATXstripperella",
      "body": "> who turn their noses up at most things, say they won't try new things\n\nI just don’t understand at all why people care. Most of the time I just lie to people, “Yeah I tried it already, didn’t like it.” They’re always satisfied, even happy, because just the act of trying it is the entire goal. But like Y THO? What is the purpose?\n\nI’m tired of hearing that it’s about nutrition because it’s absolutely not. I’ve never in my entire life had a “just try it” person been truly concerned over my health or nutrition. Because if they really were, it wouldn’t be about *trying* a single food (How does pestering me over some mayonnaise laden dish or dessert help btw?), it be an intervention with the goal of getting me to a doctor.\n\nAnd can’t you get all the necessary nutrition from like 5 things anyway? But if I’m perfectly healthy by subsisting on those 5 things people still get annoyed and then it’s suddenly not about nutrition anymore but about ~variety~.\n\nI just don’t get it! I’m uninterested in trying food or having an arbitrary variety and that should be okay; I don’t understand why that is or should be a negative thing! Why can’t some people like variety and to try new things and some not? Why is it an ideal forced on everyone that goes completely unexamined??",
      "created_utc": 1585980769.0,
      "score": 10,
      "context": [
        {
          "id": "fip9up3",
          "author": "None",
          "body": "I just discovered this subreddit and I didn't know that ARFID existed. After reading up a little, I have this to say:\n\nI don't hate people with eating disorders. I hate \"normal\" picky eaters. People who \\*can\\* eat almost any food with no distress and who don't have a disorder, but instead who turn their noses up at most things, say they won't try new things because \"that food just doesn't sound like it goes with that\", and who are in various ways wasteful with food.\n\nI am sorry that you have a disorder, but to me it seems that in generalizing \"people who hate picky eaters\", you're inadvertently generalizing \"picky eaters\" and people with ARFID (or whatever else) into the same category.",
          "created_utc": 1582601314.0
        }
      ]
    },
    {
      "id": "fk364kn",
      "author": "Xcxcvxc",
      "body": "Everything OP said is right, and isn’t ARFID included under “picky eaters” so they covered everyone? (i.e. not all people who are picky have ARFID, but all people with ARFID are picky)\n\nIs there really a problem with being picky though? Like, I’m not sure if you said why you think that, and I was pretty sure that being selective about meals doesn’t hurt anyone.",
      "created_utc": 1583819096.0,
      "score": 4,
      "context": [
        {
          "id": "fip9up3",
          "author": "None",
          "body": "I just discovered this subreddit and I didn't know that ARFID existed. After reading up a little, I have this to say:\n\nI don't hate people with eating disorders. I hate \"normal\" picky eaters. People who \\*can\\* eat almost any food with no distress and who don't have a disorder, but instead who turn their noses up at most things, say they won't try new things because \"that food just doesn't sound like it goes with that\", and who are in various ways wasteful with food.\n\nI am sorry that you have a disorder, but to me it seems that in generalizing \"people who hate picky eaters\", you're inadvertently generalizing \"picky eaters\" and people with ARFID (or whatever else) into the same category.",
          "created_utc": 1582601314.0
        }
      ]
    },
    {
      "id": "mu9ukh1",
      "author": "CoolDrag6099",
      "body": "I think we need to stop infantilizing people in general, ESPECIALLY kids! They have no say in anything and get blamed for it anyway!",
      "created_utc": 1748224641.0,
      "score": 1,
      "context": [
        {
          "id": "j7yp1cl",
          "author": "cyberpunk-ymir",
          "body": "My dad is literally allergic to onions. People have tried to feed him onions, sneak them into his food. They make him sick. Onion lovers need to stop. Like yeah I like onion rings, but your veggie isn't a god.\n\nAlso, I'm a picky eater. I bet my autism plays a part in this. Do I have something to say on the topic of picky eating though!\n\nMy egg donor has this really terrible mother and she would give me shit about my eating habits at every opportunity. \"You're holding your knife wrong!\", \"If you're so picky, no man will want to marry you! What're you going to do when his mother cooks you something you don't like?\" \"I'm so proud of you for [masking- I mean,] making yourself eat the pizza despite the toppings.\"\n\nShe's blocked and will never see me again. She and egg donor made me feel bad about it, but also made me double down at the same time, because their \"help\" was criticism. Since Dad and I have moved out, things have been improving. I still have to get used to the advice I receive being from love and not from rudeness, but I want to try new foods most of the time now. But I still like my food very much on the plain side.\n\nThat said, I hate how picky eaters are always compared to kids. I'm twenty-one years old. Stop infantilizing me. I would never pick on you for how spicy you like your food to be or how many flavours you want your meal to have. I'm no less grown up or respectable for being satisfied with simpler foods.",
          "created_utc": 1676024092.0
        }
      ]
    },
    {
      "id": "mu9xayh",
      "author": "CoolDrag6099",
      "body": "I'm very lucky that my taste buds are hyposensitive and it's mostly a texture thing.\nI'm also more adventurous about new food, probably BECAUSE I already know what I don't like, and I figure durian can't be any worse than cucumber. And if it is, no one is gonna get mad if I don't like durian, but so many people like cucumber and corn and stringy-ass cooked vegetables that they're in frickin everything!\nMy advice: carry around some black licorice with you everywhere (you won't have to eat it) and whenever someone tries to force you to try something, give them a piece of licorice and say \"you first.\" This only works if they don't like licorice, but most people don't.",
      "created_utc": 1748225678.0,
      "score": 1,
      "context": [
        {
          "id": "kfcf0us",
          "author": "killer_koff",
          "body": "Im on the spectrum so I’m not about to eat a LOT of things, and no amount of anger or crying or pleading is going to make me eat something I do not like. It’s not something that I can help, my tastebuds are super sensitive and I am texture sensitive. People really do take it very personally for some reason, and even to the point where it pisses em off if you won’t eat or try something… and honestly at this point, I could two fucks less about how they feel on the issue. Imo I’m the one who should be mad, because I constantly have some dick head trying to force/pressure me to eat something I already know I do not like while acting like I am the problem. They’re in the wrong, not you. Another thing I really fucking hate is when you ask what is in/on something and they refuse to tell you, they just keep going “just try it!”. No. Not gonna do that, I want to know what is on/in it because if I bite into something I do not like… I’m gonna be really fucking pissed about it",
          "created_utc": 1703809775.0
        }
      ]
    },
    {
      "id": "fhiopk5",
      "author": "miss--diagnosed",
      "body": "Yep, I just wanted to vent.",
      "created_utc": 1581628856.0,
      "score": 7,
      "context": [
        {
          "id": "fhim3ku",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1581627413.0
        }
      ]
    },
    {
      "id": "kfiju1v",
      "author": "ARFID-ModTeam",
      "body": "Your post or comment was removed due to being rude to the ARFID community. ARFID is a diagnosable eating disorder, a diagnosis backed up by doctors and psychiatrists. Comments or responses that bully or harass sufferers of the condition are not acceptable.",
      "created_utc": 1703910808.0,
      "score": 2,
      "context": [
        {
          "id": "kfgecf4",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1703879316.0
        }
      ]
    },
    {
      "id": "fhj7jfk",
      "author": "ohhyouknow",
      "body": "Omg it does sound like she has ARFID or certainly some sort of issue going on. He said that their parents brought her in when she was younger because they suspected an eating disorder but the likelihood of being diagnosed 5 years ago is pretty much literally zero because it technically didn't even exist or was only just being added to the DSM5. I get that it is unreasonable for her to expect him to cook for her all the time but she probably isn't lazy, she probably just has ZERO energy because she isn't getting the right nutrition and when you are starving, you get angry as well. I mean really I can't think straight when I'm starving or not taking supplements, goddamn that sucks for everyone involved.",
      "created_utc": 1581639551.0,
      "score": 52,
      "context": [
        {
          "id": "fhinqb0",
          "author": "Prof_Gutnacht",
          "body": "r/AmITheAsshole is filled with these kinds of people. I don't understand why they hate people with arfid so much either. probably  just bigotry",
          "created_utc": 1581628318.0
        },
        {
          "id": "fhj5ezo",
          "author": "wandadetroit",
          "body": "Like [this one](https://www.reddit.com/r/AmItheAsshole/comments/f31hyy/aita_for_telling_my_sister_she_could_starve_if/?utm_medium=android_app&utm_source=share) yesterday. Had me fuming.",
          "created_utc": 1581638454.0
        }
      ]
    },
    {
      "id": "fhkt4cj",
      "author": "ALT_enveetee",
      "body": "But OP’s sister had a history of demanding for OP to make her food, and just wouldn’t eat if she was expected to make it herself. Or would get upset if OP only made food for herself.  You’re “fuming” that an entitled brat didn’t get her way...? Why on earth would you support someone so selfish?",
      "created_utc": 1581690749.0,
      "score": 12,
      "context": [
        {
          "id": "fhinqb0",
          "author": "Prof_Gutnacht",
          "body": "r/AmITheAsshole is filled with these kinds of people. I don't understand why they hate people with arfid so much either. probably  just bigotry",
          "created_utc": 1581628318.0
        },
        {
          "id": "fhj5ezo",
          "author": "wandadetroit",
          "body": "Like [this one](https://www.reddit.com/r/AmItheAsshole/comments/f31hyy/aita_for_telling_my_sister_she_could_starve_if/?utm_medium=android_app&utm_source=share) yesterday. Had me fuming.",
          "created_utc": 1581638454.0
        }
      ]
    },
    {
      "id": "fusn6nh",
      "author": "None",
      "body": "OP is fair enough on this one though. She might  have a disorder but laziness is not a part of it. She's a child through and through. Fuck her.",
      "created_utc": 1592138062.0,
      "score": 1,
      "context": [
        {
          "id": "fhinqb0",
          "author": "Prof_Gutnacht",
          "body": "r/AmITheAsshole is filled with these kinds of people. I don't understand why they hate people with arfid so much either. probably  just bigotry",
          "created_utc": 1581628318.0
        },
        {
          "id": "fhj5ezo",
          "author": "wandadetroit",
          "body": "Like [this one](https://www.reddit.com/r/AmItheAsshole/comments/f31hyy/aita_for_telling_my_sister_she_could_starve_if/?utm_medium=android_app&utm_source=share) yesterday. Had me fuming.",
          "created_utc": 1581638454.0
        }
      ]
    },
    {
      "id": "fhis0fe",
      "author": "None",
      "body": "I hated this !! A lot of them would say 'ohhh you'll eat them the way I make it, I chop them up SO small you won't even notice' like my own parents hadn't tried that? No I won't like it. Yes I will notice. Just give me some chicken nuggets and leave me alone. Haha",
      "created_utc": 1581630670.0,
      "score": 40,
      "context": [
        {
          "id": "fhii6bc",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1581625232.0
        },
        {
          "id": "fhip9pn",
          "author": "miss--diagnosed",
          "body": "When I was a kid my best friend's parents would always laugh at me and say they were going to feed me something I didn't want to eat and tell me it was something else to trick me into eating it. I was never banned from anyone's house but yes, parents weren't too happy with my food choices either.",
          "created_utc": 1581629163.0
        }
      ]
    },
    {
      "id": "fi6kkcm",
      "author": "None",
      "body": "I used to have teachers at school who had to watch me at lunch to make sure I ate. It is considerably harder to eat something you don't want when people make a big deal out of it. I'm sorry this happened to you :(",
      "created_utc": 1582199033.0,
      "score": 7,
      "context": [
        {
          "id": "fhii6bc",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1581625232.0
        },
        {
          "id": "fhip9pn",
          "author": "miss--diagnosed",
          "body": "When I was a kid my best friend's parents would always laugh at me and say they were going to feed me something I didn't want to eat and tell me it was something else to trick me into eating it. I was never banned from anyone's house but yes, parents weren't too happy with my food choices either.",
          "created_utc": 1581629163.0
        }
      ]
    },
    {
      "id": "fi6kmdq",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1582199099.0,
      "score": 9,
      "context": [
        {
          "id": "fhii6bc",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1581625232.0
        },
        {
          "id": "fi6kibv",
          "author": "None",
          "body": "The only friend I had growing up was Russian, and his parents were VERY Russian. Whenever I went over, they would make Russian food. They were very insistent on feeding everyone. His mom, bless her soul, must have noticed that it made me uncomfortable because she began talking about it with my mom. She started keeping a small cupboard full of little things for when I came over. \n\n>\n\nEven today I automatically say not thanks to any offer of food without any thought as to what they may have. But I feel like I was lucky to not be shunned there at least..",
          "created_utc": 1582198967.0
        }
      ]
    },
    {
      "id": "kfifmf5",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1703908828.0,
      "score": 2,
      "context": [
        {
          "id": "fhii6bc",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1581625232.0
        },
        {
          "id": "kfgdzta",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1703879187.0
        }
      ]
    },
    {
      "id": "fhjdzml",
      "author": "Gaminbro91",
      "body": "I had something like that in preschool. I got school lunches and there was absolutely nothing I ate and the teacher would sit there and try to force it in my mouth. I would just not eat and wait until I got home.",
      "created_utc": 1581643840.0,
      "score": 14,
      "context": [
        {
          "id": "fhiry7e",
          "author": "Gaminbro91",
          "body": "People often get pissed at me for not eating stuff. Like today i had a teacher cooking some stuff and she was giving it out to the class and I'm just like nah I'm good but apparently not eating a damn fried banana is a sin against humanity",
          "created_utc": 1581630636.0
        },
        {
          "id": "fhiwqsy",
          "author": "Singitqueen",
          "body": "That is always a nightmare. I had a teacher bring us cupcakes, and they were fantastic. But, they were strawberry. I had to ask the person across from me if she wanted my strawberry, which was sorta embarrassing, but she didn't mention anything and accepted. This was a tame experience compared to some of the times I've had this happen. \n\nThe worst time I ever had in elementary school was when they started giving us a fresh fruit or vegetable every day. We weren't ever forced to eat them but come on, we were forced to eat them. Anyway, yeah that is the worst.",
          "created_utc": 1581633372.0
        }
      ]
    },
    {
      "id": "fhk0zna",
      "author": "tommy91110",
      "body": "I hated when I went to school, didn't eat lunch cause I didn't want what was being served that day, go hungry, and people give me granola bars and apples cause I tell them about it, but I can't say no thank you cause that's rude. So I'd have to shove it in my back pack and throw it away later.",
      "created_utc": 1581662261.0,
      "score": 8,
      "context": [
        {
          "id": "fhiry7e",
          "author": "Gaminbro91",
          "body": "People often get pissed at me for not eating stuff. Like today i had a teacher cooking some stuff and she was giving it out to the class and I'm just like nah I'm good but apparently not eating a damn fried banana is a sin against humanity",
          "created_utc": 1581630636.0
        },
        {
          "id": "fhiwqsy",
          "author": "Singitqueen",
          "body": "That is always a nightmare. I had a teacher bring us cupcakes, and they were fantastic. But, they were strawberry. I had to ask the person across from me if she wanted my strawberry, which was sorta embarrassing, but she didn't mention anything and accepted. This was a tame experience compared to some of the times I've had this happen. \n\nThe worst time I ever had in elementary school was when they started giving us a fresh fruit or vegetable every day. We weren't ever forced to eat them but come on, we were forced to eat them. Anyway, yeah that is the worst.",
          "created_utc": 1581633372.0
        }
      ]
    },
    {
      "id": "m713m2c",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1736820854.0,
      "score": 1,
      "context": [
        {
          "id": "fhiry7e",
          "author": "Gaminbro91",
          "body": "People often get pissed at me for not eating stuff. Like today i had a teacher cooking some stuff and she was giving it out to the class and I'm just like nah I'm good but apparently not eating a damn fried banana is a sin against humanity",
          "created_utc": 1581630636.0
        },
        {
          "id": "fhiwqsy",
          "author": "Singitqueen",
          "body": "That is always a nightmare. I had a teacher bring us cupcakes, and they were fantastic. But, they were strawberry. I had to ask the person across from me if she wanted my strawberry, which was sorta embarrassing, but she didn't mention anything and accepted. This was a tame experience compared to some of the times I've had this happen. \n\nThe worst time I ever had in elementary school was when they started giving us a fresh fruit or vegetable every day. We weren't ever forced to eat them but come on, we were forced to eat them. Anyway, yeah that is the worst.",
          "created_utc": 1581633372.0
        }
      ]
    },
    {
      "id": "fhk4nbh",
      "author": "it_was_you_fredo",
      "body": "> I also wouldn't respond with the vitriol that a lot of people do towards picky eaters.\n\nThat's what I get from most people, and good for you.  Don't you find that most people respond to your ARFID with indifference rather than vitriol, though?  I work with somebody who I genuinely think has a somewhat mild case...nobody really cares.\n\nBut every once in a while, I run across somebody who is deeply insulted that I don't like Taylor Swift or whomever.  Then I get a laundry list of musical suggestions.  It's like suggesting different types of raw fish to an ARFID sufferer who can't stand sushi.\n\n> ARFID is an eating disorder and not something that's simply annoying. I have an actual phobia of certain foods\n\nYou nailed it.  My analogy isn't perfect.  I can, and have to, tolerate all types of music.  It's pervasive.",
      "created_utc": 1581666632.0,
      "score": 6,
      "context": [
        {
          "id": "fhj60g8",
          "author": "it_was_you_fredo",
          "body": "Let me see if I can draw an analogy.  I may have a near-unique perspective to answer this question.\n\nThing 1 is I don't have ARFID.  In fact, what draws me to this subreddit and similar forums is I'm the opposite.  I *love* food, and I'll eat anything.  Most of the analogies ARFID sufferers draw are lost on me.  I *would*, in fact, eat raw liver.  Have.  So I hang out here because I find it fascinating, and also because my deep knowledge of food sometimes enables me to make genuine suggestions.\n\nThing 2 is I don't like music.  It's mostly annoying noise to me.  Yes, I've tried all the genres.  Yes, that one, and that one too.  I just don't get most of it.  And I'm nearly 50, so I've had plenty of experiences to form an opinion.\n\nIf you're like most people, you'd respond to Thing 2 with near-disbelief.  And then you might think there's something seriously wrong with me.  And then it might upset you, because I don't like your favorite singer.  It's incomprehensible to you, maybe.  *How can somebody not like this thing I like?*\n\nDo you see what I'm getting at?\n\nFood, music, and a few others are near-universal shared human experiences.  Substitute \"music\" for food in the rest of this paragraph.  If you're like me, you think about food a lot.  You invest time, money, and effort into this food thing on a bunch of levels.  When you're planning an evening, the central event involves food.  And then, when you find out there's somebody who dislikes or is indifferent to the entire subject of food, it seems weird and off-putting.  Like that person is insulting this thing you've put so much into.\n\nThis is just speculation based on personal experience.  I admit, I was stunned when I first heard of ARFID, which goes back many years before ARFID was even officially A Thing.  I felt the things you've probably all heard.  You eat like a child, you just have to try it, etc.  But I understand it better now, and I'm pretty sure there's merit to my analogy.\n\nJust my $0.02.\n\nTL;DR: I don't like music.  People tend to react toward me the same way they react toward ARFID sufferers.  If you can understand the reaction toward my indifference to music, perhaps you can understand others' reactions toward ARFID.",
          "created_utc": 1581638752.0
        },
        {
          "id": "fhjck7f",
          "author": "miss--diagnosed",
          "body": "That's interesting, I've never heard of anyone hating music before. But while I certainly may have a hard time finding common ground with someone who hates music, I also wouldn't respond with the vitriol that a lot of people do towards picky eaters. Though I'm sure there are people who act that way towards you. \n\nThe thing is, I think people who judge you for not liking music are idiots as well. Is it hard to understand? Yes, maybe. Will they feel there is a huge part of you that they aren't able to relate to? Also yes. But they shouldn't make judgements on you as a person.\n\nSo I still don't understand, because as someone who has constantly been made fun of for things such as my limited diet, I've developed empathy and I just chose to accept when people don't like the same things I like. It would be one thing, of course, if they were to directly insult the thing I like and make judgements on me for liking said thing, but that's usually not the case with picky eaters/people with ARFID when speaking of the foods we dislike. \n\nAlso, ARFID is an eating disorder and not something that's simply annoying. I have an actual phobia of certain foods, to the point that there are things I wouldn't even touch if my life depended on it. A more accurate comparison would be people responding with anger toward someone with severe sensory issues who can't physically can't handle listening to music. \n\nThanks for sharing your thoughts though, I get where you're coming from but I have to disagree for the most part.",
          "created_utc": 1581642828.0
        }
      ]
    },
    {
      "id": "fhk3w76",
      "author": "it_was_you_fredo",
      "body": "No!  Not literally all music, but I'd posit that makes my analogy even better.\n\nJust like somebody with ARFID who likes a *very* few foods, so it's like with me and music.\n\nWhere the analogy breaks down: I can tolerate basically any music.  I have to, it's everywhere.  Somebody whose ARFID kicks in around, say, onions?  Not so much.",
      "created_utc": 1581665682.0,
      "score": 7,
      "context": [
        {
          "id": "fhj60g8",
          "author": "it_was_you_fredo",
          "body": "Let me see if I can draw an analogy.  I may have a near-unique perspective to answer this question.\n\nThing 1 is I don't have ARFID.  In fact, what draws me to this subreddit and similar forums is I'm the opposite.  I *love* food, and I'll eat anything.  Most of the analogies ARFID sufferers draw are lost on me.  I *would*, in fact, eat raw liver.  Have.  So I hang out here because I find it fascinating, and also because my deep knowledge of food sometimes enables me to make genuine suggestions.\n\nThing 2 is I don't like music.  It's mostly annoying noise to me.  Yes, I've tried all the genres.  Yes, that one, and that one too.  I just don't get most of it.  And I'm nearly 50, so I've had plenty of experiences to form an opinion.\n\nIf you're like most people, you'd respond to Thing 2 with near-disbelief.  And then you might think there's something seriously wrong with me.  And then it might upset you, because I don't like your favorite singer.  It's incomprehensible to you, maybe.  *How can somebody not like this thing I like?*\n\nDo you see what I'm getting at?\n\nFood, music, and a few others are near-universal shared human experiences.  Substitute \"music\" for food in the rest of this paragraph.  If you're like me, you think about food a lot.  You invest time, money, and effort into this food thing on a bunch of levels.  When you're planning an evening, the central event involves food.  And then, when you find out there's somebody who dislikes or is indifferent to the entire subject of food, it seems weird and off-putting.  Like that person is insulting this thing you've put so much into.\n\nThis is just speculation based on personal experience.  I admit, I was stunned when I first heard of ARFID, which goes back many years before ARFID was even officially A Thing.  I felt the things you've probably all heard.  You eat like a child, you just have to try it, etc.  But I understand it better now, and I'm pretty sure there's merit to my analogy.\n\nJust my $0.02.\n\nTL;DR: I don't like music.  People tend to react toward me the same way they react toward ARFID sufferers.  If you can understand the reaction toward my indifference to music, perhaps you can understand others' reactions toward ARFID.",
          "created_utc": 1581638752.0
        },
        {
          "id": "fhjxnb6",
          "author": "Telaneo",
          "body": "Literally *all* music? I mean, not that I don't believe you, but even most people with ARFID and picky eaters will have some favourite food. Hence the chicken tenders meme. It's just that the vast majority of 'genres' of food are off the table, while the foods that are safe can still be enjoyable.\n\nAlthough there are definitly people with ARFID who have problems with food in general, so there's not like there's no equivelent to not liking music at all in the food world.\n\n> It's mostly annoying noise to me.\n\nYou say mostly, so maybe there are some genres better than others? Or some individual songs that are good? Or is no music always preferable, and some songs are just more tolerable than others? You should look up [musical anhedonia](https://en.wikipedia.org/wiki/Musical_anhedonia) if you haven't.\n\nYour analogy's spot on by the way.",
          "created_utc": 1581658824.0
        }
      ]
    },
    {
      "id": "fhktiq1",
      "author": "ALT_enveetee",
      "body": "Funny how you are responding with dismissive disbelief about someone disliking something that you personally find unbelievable when people do the same thing to you. And you probably crave empathy and understanding from others.",
      "created_utc": 1581690958.0,
      "score": 2,
      "context": [
        {
          "id": "fhj60g8",
          "author": "it_was_you_fredo",
          "body": "Let me see if I can draw an analogy.  I may have a near-unique perspective to answer this question.\n\nThing 1 is I don't have ARFID.  In fact, what draws me to this subreddit and similar forums is I'm the opposite.  I *love* food, and I'll eat anything.  Most of the analogies ARFID sufferers draw are lost on me.  I *would*, in fact, eat raw liver.  Have.  So I hang out here because I find it fascinating, and also because my deep knowledge of food sometimes enables me to make genuine suggestions.\n\nThing 2 is I don't like music.  It's mostly annoying noise to me.  Yes, I've tried all the genres.  Yes, that one, and that one too.  I just don't get most of it.  And I'm nearly 50, so I've had plenty of experiences to form an opinion.\n\nIf you're like most people, you'd respond to Thing 2 with near-disbelief.  And then you might think there's something seriously wrong with me.  And then it might upset you, because I don't like your favorite singer.  It's incomprehensible to you, maybe.  *How can somebody not like this thing I like?*\n\nDo you see what I'm getting at?\n\nFood, music, and a few others are near-universal shared human experiences.  Substitute \"music\" for food in the rest of this paragraph.  If you're like me, you think about food a lot.  You invest time, money, and effort into this food thing on a bunch of levels.  When you're planning an evening, the central event involves food.  And then, when you find out there's somebody who dislikes or is indifferent to the entire subject of food, it seems weird and off-putting.  Like that person is insulting this thing you've put so much into.\n\nThis is just speculation based on personal experience.  I admit, I was stunned when I first heard of ARFID, which goes back many years before ARFID was even officially A Thing.  I felt the things you've probably all heard.  You eat like a child, you just have to try it, etc.  But I understand it better now, and I'm pretty sure there's merit to my analogy.\n\nJust my $0.02.\n\nTL;DR: I don't like music.  People tend to react toward me the same way they react toward ARFID sufferers.  If you can understand the reaction toward my indifference to music, perhaps you can understand others' reactions toward ARFID.",
          "created_utc": 1581638752.0
        },
        {
          "id": "fhjxnb6",
          "author": "Telaneo",
          "body": "Literally *all* music? I mean, not that I don't believe you, but even most people with ARFID and picky eaters will have some favourite food. Hence the chicken tenders meme. It's just that the vast majority of 'genres' of food are off the table, while the foods that are safe can still be enjoyable.\n\nAlthough there are definitly people with ARFID who have problems with food in general, so there's not like there's no equivelent to not liking music at all in the food world.\n\n> It's mostly annoying noise to me.\n\nYou say mostly, so maybe there are some genres better than others? Or some individual songs that are good? Or is no music always preferable, and some songs are just more tolerable than others? You should look up [musical anhedonia](https://en.wikipedia.org/wiki/Musical_anhedonia) if you haven't.\n\nYour analogy's spot on by the way.",
          "created_utc": 1581658824.0
        }
      ]
    },
    {
      "id": "fhns8qd",
      "author": "it_was_you_fredo",
      "body": "Really?  Thank you!\n\nThat actually makes me feel pretty good, because the last thing I want is for you guys to think I'm pursuing some type of schadenfreude.  I'm also on the vegan subreddit, even though I'm not vegan, because I'm interested in *all* types of food.  Those guys are very accepting of me, and it makes me happy that /r/ARFID seems so, too.\n\nHave you tried jicama, BTW?  That's my latest thing for ARFIDians.  A mild-tasting, slight-sweet, super-crunchy vegetable.  I think it's intimidating because it's usually sold as this cantaloupe-sized vegetable...but it's cheap and I think pretty ARFID-friendly.",
      "created_utc": 1581731774.0,
      "score": 8,
      "context": [
        {
          "id": "fhj60g8",
          "author": "it_was_you_fredo",
          "body": "Let me see if I can draw an analogy.  I may have a near-unique perspective to answer this question.\n\nThing 1 is I don't have ARFID.  In fact, what draws me to this subreddit and similar forums is I'm the opposite.  I *love* food, and I'll eat anything.  Most of the analogies ARFID sufferers draw are lost on me.  I *would*, in fact, eat raw liver.  Have.  So I hang out here because I find it fascinating, and also because my deep knowledge of food sometimes enables me to make genuine suggestions.\n\nThing 2 is I don't like music.  It's mostly annoying noise to me.  Yes, I've tried all the genres.  Yes, that one, and that one too.  I just don't get most of it.  And I'm nearly 50, so I've had plenty of experiences to form an opinion.\n\nIf you're like most people, you'd respond to Thing 2 with near-disbelief.  And then you might think there's something seriously wrong with me.  And then it might upset you, because I don't like your favorite singer.  It's incomprehensible to you, maybe.  *How can somebody not like this thing I like?*\n\nDo you see what I'm getting at?\n\nFood, music, and a few others are near-universal shared human experiences.  Substitute \"music\" for food in the rest of this paragraph.  If you're like me, you think about food a lot.  You invest time, money, and effort into this food thing on a bunch of levels.  When you're planning an evening, the central event involves food.  And then, when you find out there's somebody who dislikes or is indifferent to the entire subject of food, it seems weird and off-putting.  Like that person is insulting this thing you've put so much into.\n\nThis is just speculation based on personal experience.  I admit, I was stunned when I first heard of ARFID, which goes back many years before ARFID was even officially A Thing.  I felt the things you've probably all heard.  You eat like a child, you just have to try it, etc.  But I understand it better now, and I'm pretty sure there's merit to my analogy.\n\nJust my $0.02.\n\nTL;DR: I don't like music.  People tend to react toward me the same way they react toward ARFID sufferers.  If you can understand the reaction toward my indifference to music, perhaps you can understand others' reactions toward ARFID.",
          "created_utc": 1581638752.0
        },
        {
          "id": "fhjc78v",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1581642572.0
        }
      ]
    },
    {
      "id": "fhj6qnw",
      "author": "boring-unicorn",
      "body": "That actually sounds like a good meal!",
      "created_utc": 1581639114.0,
      "score": 3,
      "context": [
        {
          "id": "fhiy9yf",
          "author": "boring-unicorn",
          "body": "I just spent a week with 2 picky kids, it's just the options are so limited we all ended up eating shit we didn't enjoy which sucked.  On the last day we found a buffet tho which was amazing because we all enjoyed it!! You just need to plan ahead better so that you can all get what you like, food courts, buffets or Cheesecake Factory are all good options in my experience. Also if you're a picky eater just eat before meeting up with people just in case so that you don't starve",
          "created_utc": 1581634272.0
        },
        {
          "id": "fhj5mtw",
          "author": "wandadetroit",
          "body": "I spent $70 on a buffet in Vegas to end up eating only a slice of prime rib, a plain baked potato (with butter) and two rolls. But it was safe. \n\nBuffets are the absolute best.",
          "created_utc": 1581638562.0
        }
      ]
    },
    {
      "id": "fhinq5g",
      "author": "The1579",
      "body": "Yeah, I'm the parent of a picky eater.\n\nHowever, OP mentioned that they are not a child but references some group of people \"forcing\" another group of people to do something.\n\nMy comment was mostly tongue-in-cheek, as I highly doubt some band of miscreants is traveling the planet shoving food into unwanting people's mouths.",
      "created_utc": 1581628315.0,
      "score": -13,
      "context": [
        {
          "id": "fhih911",
          "author": "The1579",
          "body": ">So why do they try to force *us* to eat things?\n\nAre people really doing this? Sounds like a crime to me.",
          "created_utc": 1581624715.0
        },
        {
          "id": "fhilz4e",
          "author": "DifferentIsPossble",
          "body": "Yup. Ever seen parents of a picky eater? They show off and brag about how they're tough on their kids.",
          "created_utc": 1581627342.0
        }
      ]
    },
    {
      "id": "fhjmjq3",
      "author": "Telaneo",
      "body": "I hope she knows why.",
      "created_utc": 1581649911.0,
      "score": 5,
      "context": [
        {
          "id": "fhih911",
          "author": "The1579",
          "body": ">So why do they try to force *us* to eat things?\n\nAre people really doing this? Sounds like a crime to me.",
          "created_utc": 1581624715.0
        },
        {
          "id": "fhj0vx0",
          "author": "ThrowItAllAway003",
          "body": "Absolutely. My aunt is one. She decided it was time I learned to like broccoli while I was on a trip with her. She tried to ground me on vacation because I cried and threw up while he young grandkids ate them while just making a face. \n\nSpoiler-I’ve never gone anywhere with her again and don’t actually speak to her more than once a year or so",
          "created_utc": 1581635866.0
        }
      ]
    },
    {
      "id": "mu9z7ve",
      "author": "cyberpunk-ymir",
      "body": "YES! Kids get so much hate and they don't even have agency in their lives. It's honestly concerning how much hate they get sometimes. You're so right!",
      "created_utc": 1748226410.0,
      "score": 1,
      "context": [
        {
          "id": "j7yp1cl",
          "author": "cyberpunk-ymir",
          "body": "My dad is literally allergic to onions. People have tried to feed him onions, sneak them into his food. They make him sick. Onion lovers need to stop. Like yeah I like onion rings, but your veggie isn't a god.\n\nAlso, I'm a picky eater. I bet my autism plays a part in this. Do I have something to say on the topic of picky eating though!\n\nMy egg donor has this really terrible mother and she would give me shit about my eating habits at every opportunity. \"You're holding your knife wrong!\", \"If you're so picky, no man will want to marry you! What're you going to do when his mother cooks you something you don't like?\" \"I'm so proud of you for [masking- I mean,] making yourself eat the pizza despite the toppings.\"\n\nShe's blocked and will never see me again. She and egg donor made me feel bad about it, but also made me double down at the same time, because their \"help\" was criticism. Since Dad and I have moved out, things have been improving. I still have to get used to the advice I receive being from love and not from rudeness, but I want to try new foods most of the time now. But I still like my food very much on the plain side.\n\nThat said, I hate how picky eaters are always compared to kids. I'm twenty-one years old. Stop infantilizing me. I would never pick on you for how spicy you like your food to be or how many flavours you want your meal to have. I'm no less grown up or respectable for being satisfied with simpler foods.",
          "created_utc": 1676024092.0
        },
        {
          "id": "mu9ukh1",
          "author": "CoolDrag6099",
          "body": "I think we need to stop infantilizing people in general, ESPECIALLY kids! They have no say in anything and get blamed for it anyway!",
          "created_utc": 1748224641.0
        }
      ]
    },
    {
      "id": "fhjjno1",
      "author": "jennybean2442",
      "body": "Omg! I thought the same thing! The whole veggie thing sounds like ARFID to me",
      "created_utc": 1581647859.0,
      "score": 20,
      "context": [
        {
          "id": "fhinqb0",
          "author": "Prof_Gutnacht",
          "body": "r/AmITheAsshole is filled with these kinds of people. I don't understand why they hate people with arfid so much either. probably  just bigotry",
          "created_utc": 1581628318.0
        },
        {
          "id": "fhj5ezo",
          "author": "wandadetroit",
          "body": "Like [this one](https://www.reddit.com/r/AmItheAsshole/comments/f31hyy/aita_for_telling_my_sister_she_could_starve_if/?utm_medium=android_app&utm_source=share) yesterday. Had me fuming.",
          "created_utc": 1581638454.0
        },
        {
          "id": "fhj7jfk",
          "author": "ohhyouknow",
          "body": "Omg it does sound like she has ARFID or certainly some sort of issue going on. He said that their parents brought her in when she was younger because they suspected an eating disorder but the likelihood of being diagnosed 5 years ago is pretty much literally zero because it technically didn't even exist or was only just being added to the DSM5. I get that it is unreasonable for her to expect him to cook for her all the time but she probably isn't lazy, she probably just has ZERO energy because she isn't getting the right nutrition and when you are starving, you get angry as well. I mean really I can't think straight when I'm starving or not taking supplements, goddamn that sucks for everyone involved.",
          "created_utc": 1581639551.0
        }
      ]
    },
    {
      "id": "fhlqccz",
      "author": "wandadetroit",
      "body": "Oh I'm not at all okay with her attitude - what had me fuming is the way people commented about her eating like a toddler as that was her choice.",
      "created_utc": 1581703390.0,
      "score": 25,
      "context": [
        {
          "id": "fhinqb0",
          "author": "Prof_Gutnacht",
          "body": "r/AmITheAsshole is filled with these kinds of people. I don't understand why they hate people with arfid so much either. probably  just bigotry",
          "created_utc": 1581628318.0
        },
        {
          "id": "fhj5ezo",
          "author": "wandadetroit",
          "body": "Like [this one](https://www.reddit.com/r/AmItheAsshole/comments/f31hyy/aita_for_telling_my_sister_she_could_starve_if/?utm_medium=android_app&utm_source=share) yesterday. Had me fuming.",
          "created_utc": 1581638454.0
        },
        {
          "id": "fhkt4cj",
          "author": "ALT_enveetee",
          "body": "But OP’s sister had a history of demanding for OP to make her food, and just wouldn’t eat if she was expected to make it herself. Or would get upset if OP only made food for herself.  You’re “fuming” that an entitled brat didn’t get her way...? Why on earth would you support someone so selfish?",
          "created_utc": 1581690749.0
        }
      ]
    },
    {
      "id": "fi6kpvi",
      "author": "None",
      "body": "Same! My mom always fed me before I went anywhere too, so I felt even worse if I had to say no to food that people had specifically for me. But she never made a big deal out of it, she was just worried!",
      "created_utc": 1582199208.0,
      "score": 3,
      "context": [
        {
          "id": "fhii6bc",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1581625232.0
        },
        {
          "id": "fi6kibv",
          "author": "None",
          "body": "The only friend I had growing up was Russian, and his parents were VERY Russian. Whenever I went over, they would make Russian food. They were very insistent on feeding everyone. His mom, bless her soul, must have noticed that it made me uncomfortable because she began talking about it with my mom. She started keeping a small cupboard full of little things for when I came over. \n\n>\n\nEven today I automatically say not thanks to any offer of food without any thought as to what they may have. But I feel like I was lucky to not be shunned there at least..",
          "created_utc": 1582198967.0
        },
        {
          "id": "fi6kmdq",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1582199099.0
        }
      ]
    },
    {
      "id": "fhjxejz",
      "author": "5MoK3",
      "body": "I have a memory from when i was in preschool. I was sitting at a table and wasn't allowed to go out and play until i ate my snack. My snack was carrots. I sat in the room the whole time while a everyone else went outside to play.",
      "created_utc": 1581658591.0,
      "score": 10,
      "context": [
        {
          "id": "fhiry7e",
          "author": "Gaminbro91",
          "body": "People often get pissed at me for not eating stuff. Like today i had a teacher cooking some stuff and she was giving it out to the class and I'm just like nah I'm good but apparently not eating a damn fried banana is a sin against humanity",
          "created_utc": 1581630636.0
        },
        {
          "id": "fhiwqsy",
          "author": "Singitqueen",
          "body": "That is always a nightmare. I had a teacher bring us cupcakes, and they were fantastic. But, they were strawberry. I had to ask the person across from me if she wanted my strawberry, which was sorta embarrassing, but she didn't mention anything and accepted. This was a tame experience compared to some of the times I've had this happen. \n\nThe worst time I ever had in elementary school was when they started giving us a fresh fruit or vegetable every day. We weren't ever forced to eat them but come on, we were forced to eat them. Anyway, yeah that is the worst.",
          "created_utc": 1581633372.0
        },
        {
          "id": "fhjdzml",
          "author": "Gaminbro91",
          "body": "I had something like that in preschool. I got school lunches and there was absolutely nothing I ate and the teacher would sit there and try to force it in my mouth. I would just not eat and wait until I got home.",
          "created_utc": 1581643840.0
        }
      ]
    },
    {
      "id": "fhk3bgf",
      "author": "Singitqueen",
      "body": "I honestly can't remember what any of those years were like, but I do know I ate peanut butter and jelly almost every day during elementary school. I was so happy to see that we had options in high school. That sucks, I'm sure that's common around here.",
      "created_utc": 1581664967.0,
      "score": 6,
      "context": [
        {
          "id": "fhiry7e",
          "author": "Gaminbro91",
          "body": "People often get pissed at me for not eating stuff. Like today i had a teacher cooking some stuff and she was giving it out to the class and I'm just like nah I'm good but apparently not eating a damn fried banana is a sin against humanity",
          "created_utc": 1581630636.0
        },
        {
          "id": "fhiwqsy",
          "author": "Singitqueen",
          "body": "That is always a nightmare. I had a teacher bring us cupcakes, and they were fantastic. But, they were strawberry. I had to ask the person across from me if she wanted my strawberry, which was sorta embarrassing, but she didn't mention anything and accepted. This was a tame experience compared to some of the times I've had this happen. \n\nThe worst time I ever had in elementary school was when they started giving us a fresh fruit or vegetable every day. We weren't ever forced to eat them but come on, we were forced to eat them. Anyway, yeah that is the worst.",
          "created_utc": 1581633372.0
        },
        {
          "id": "fhjdzml",
          "author": "Gaminbro91",
          "body": "I had something like that in preschool. I got school lunches and there was absolutely nothing I ate and the teacher would sit there and try to force it in my mouth. I would just not eat and wait until I got home.",
          "created_utc": 1581643840.0
        }
      ]
    },
    {
      "id": "m718cbi",
      "author": "Singitqueen",
      "body": "I was like 8 bro. Are you like, okay? You're acting like I personally wrote an angry letter to you because you were the one who made me eat the food 15 years ago. \n\nSorry man, I'll go back and tell little autistic 8 year old me to suck it up and... DON'T try the food? Hmm. I'm at a loss. Anyway I also wrote this 4 years ago. What are you doing here? What did you Google to find my comment just to complain about it?",
      "created_utc": 1736822362.0,
      "score": 1,
      "context": [
        {
          "id": "fhiry7e",
          "author": "Gaminbro91",
          "body": "People often get pissed at me for not eating stuff. Like today i had a teacher cooking some stuff and she was giving it out to the class and I'm just like nah I'm good but apparently not eating a damn fried banana is a sin against humanity",
          "created_utc": 1581630636.0
        },
        {
          "id": "fhiwqsy",
          "author": "Singitqueen",
          "body": "That is always a nightmare. I had a teacher bring us cupcakes, and they were fantastic. But, they were strawberry. I had to ask the person across from me if she wanted my strawberry, which was sorta embarrassing, but she didn't mention anything and accepted. This was a tame experience compared to some of the times I've had this happen. \n\nThe worst time I ever had in elementary school was when they started giving us a fresh fruit or vegetable every day. We weren't ever forced to eat them but come on, we were forced to eat them. Anyway, yeah that is the worst.",
          "created_utc": 1581633372.0
        },
        {
          "id": "m713m2c",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1736820854.0
        }
      ]
    },
    {
      "id": "fhk46ja",
      "author": "Telaneo",
      "body": "A lot of people with ARFID can also tolerate being around unsafe foods (not all, of course), but actually eating and putting it in your mouth is the problem. I guess the analogy breaks down because being exposed to music and being exposed to unsafe foods are equivelent, but there's no music equivelent of actually eating an unsafe food. Depends on what you'd say is equivelent to what.",
      "created_utc": 1581666040.0,
      "score": 2,
      "context": [
        {
          "id": "fhj60g8",
          "author": "it_was_you_fredo",
          "body": "Let me see if I can draw an analogy.  I may have a near-unique perspective to answer this question.\n\nThing 1 is I don't have ARFID.  In fact, what draws me to this subreddit and similar forums is I'm the opposite.  I *love* food, and I'll eat anything.  Most of the analogies ARFID sufferers draw are lost on me.  I *would*, in fact, eat raw liver.  Have.  So I hang out here because I find it fascinating, and also because my deep knowledge of food sometimes enables me to make genuine suggestions.\n\nThing 2 is I don't like music.  It's mostly annoying noise to me.  Yes, I've tried all the genres.  Yes, that one, and that one too.  I just don't get most of it.  And I'm nearly 50, so I've had plenty of experiences to form an opinion.\n\nIf you're like most people, you'd respond to Thing 2 with near-disbelief.  And then you might think there's something seriously wrong with me.  And then it might upset you, because I don't like your favorite singer.  It's incomprehensible to you, maybe.  *How can somebody not like this thing I like?*\n\nDo you see what I'm getting at?\n\nFood, music, and a few others are near-universal shared human experiences.  Substitute \"music\" for food in the rest of this paragraph.  If you're like me, you think about food a lot.  You invest time, money, and effort into this food thing on a bunch of levels.  When you're planning an evening, the central event involves food.  And then, when you find out there's somebody who dislikes or is indifferent to the entire subject of food, it seems weird and off-putting.  Like that person is insulting this thing you've put so much into.\n\nThis is just speculation based on personal experience.  I admit, I was stunned when I first heard of ARFID, which goes back many years before ARFID was even officially A Thing.  I felt the things you've probably all heard.  You eat like a child, you just have to try it, etc.  But I understand it better now, and I'm pretty sure there's merit to my analogy.\n\nJust my $0.02.\n\nTL;DR: I don't like music.  People tend to react toward me the same way they react toward ARFID sufferers.  If you can understand the reaction toward my indifference to music, perhaps you can understand others' reactions toward ARFID.",
          "created_utc": 1581638752.0
        },
        {
          "id": "fhjxnb6",
          "author": "Telaneo",
          "body": "Literally *all* music? I mean, not that I don't believe you, but even most people with ARFID and picky eaters will have some favourite food. Hence the chicken tenders meme. It's just that the vast majority of 'genres' of food are off the table, while the foods that are safe can still be enjoyable.\n\nAlthough there are definitly people with ARFID who have problems with food in general, so there's not like there's no equivelent to not liking music at all in the food world.\n\n> It's mostly annoying noise to me.\n\nYou say mostly, so maybe there are some genres better than others? Or some individual songs that are good? Or is no music always preferable, and some songs are just more tolerable than others? You should look up [musical anhedonia](https://en.wikipedia.org/wiki/Musical_anhedonia) if you haven't.\n\nYour analogy's spot on by the way.",
          "created_utc": 1581658824.0
        },
        {
          "id": "fhk3w76",
          "author": "it_was_you_fredo",
          "body": "No!  Not literally all music, but I'd posit that makes my analogy even better.\n\nJust like somebody with ARFID who likes a *very* few foods, so it's like with me and music.\n\nWhere the analogy breaks down: I can tolerate basically any music.  I have to, it's everywhere.  Somebody whose ARFID kicks in around, say, onions?  Not so much.",
          "created_utc": 1581665682.0
        }
      ]
    },
    {
      "id": "hurbmv1",
      "author": "ADHDAntlion",
      "body": "Hey sorry for the replying to an ancient post but your music thing is just super interesting!\n\nI used to not enjoy or see the point in music when I was young, to to about the age of 12. I've never seen anyone else who shared that experience.\n\nFrom that point on I started finding that I liked really odd things like experimental music - stuff everyone else acted revulsed by. Now I'm really really into music because I keep digging up weird genres and interesting things to listen to.\n\nI used to not be able to stand listening to regular music - I'd feel really impatient and flustered trying to listen. But in recent years I'm finally more able to appreciate it.\n\nAre there types of sounds you enjoy? What do you tolerate the most & least?",
      "created_utc": 1643486074.0,
      "score": 1,
      "context": [
        {
          "id": "fhj60g8",
          "author": "it_was_you_fredo",
          "body": "Let me see if I can draw an analogy.  I may have a near-unique perspective to answer this question.\n\nThing 1 is I don't have ARFID.  In fact, what draws me to this subreddit and similar forums is I'm the opposite.  I *love* food, and I'll eat anything.  Most of the analogies ARFID sufferers draw are lost on me.  I *would*, in fact, eat raw liver.  Have.  So I hang out here because I find it fascinating, and also because my deep knowledge of food sometimes enables me to make genuine suggestions.\n\nThing 2 is I don't like music.  It's mostly annoying noise to me.  Yes, I've tried all the genres.  Yes, that one, and that one too.  I just don't get most of it.  And I'm nearly 50, so I've had plenty of experiences to form an opinion.\n\nIf you're like most people, you'd respond to Thing 2 with near-disbelief.  And then you might think there's something seriously wrong with me.  And then it might upset you, because I don't like your favorite singer.  It's incomprehensible to you, maybe.  *How can somebody not like this thing I like?*\n\nDo you see what I'm getting at?\n\nFood, music, and a few others are near-universal shared human experiences.  Substitute \"music\" for food in the rest of this paragraph.  If you're like me, you think about food a lot.  You invest time, money, and effort into this food thing on a bunch of levels.  When you're planning an evening, the central event involves food.  And then, when you find out there's somebody who dislikes or is indifferent to the entire subject of food, it seems weird and off-putting.  Like that person is insulting this thing you've put so much into.\n\nThis is just speculation based on personal experience.  I admit, I was stunned when I first heard of ARFID, which goes back many years before ARFID was even officially A Thing.  I felt the things you've probably all heard.  You eat like a child, you just have to try it, etc.  But I understand it better now, and I'm pretty sure there's merit to my analogy.\n\nJust my $0.02.\n\nTL;DR: I don't like music.  People tend to react toward me the same way they react toward ARFID sufferers.  If you can understand the reaction toward my indifference to music, perhaps you can understand others' reactions toward ARFID.",
          "created_utc": 1581638752.0
        },
        {
          "id": "fhjxnb6",
          "author": "Telaneo",
          "body": "Literally *all* music? I mean, not that I don't believe you, but even most people with ARFID and picky eaters will have some favourite food. Hence the chicken tenders meme. It's just that the vast majority of 'genres' of food are off the table, while the foods that are safe can still be enjoyable.\n\nAlthough there are definitly people with ARFID who have problems with food in general, so there's not like there's no equivelent to not liking music at all in the food world.\n\n> It's mostly annoying noise to me.\n\nYou say mostly, so maybe there are some genres better than others? Or some individual songs that are good? Or is no music always preferable, and some songs are just more tolerable than others? You should look up [musical anhedonia](https://en.wikipedia.org/wiki/Musical_anhedonia) if you haven't.\n\nYour analogy's spot on by the way.",
          "created_utc": 1581658824.0
        },
        {
          "id": "fhk3w76",
          "author": "it_was_you_fredo",
          "body": "No!  Not literally all music, but I'd posit that makes my analogy even better.\n\nJust like somebody with ARFID who likes a *very* few foods, so it's like with me and music.\n\nWhere the analogy breaks down: I can tolerate basically any music.  I have to, it's everywhere.  Somebody whose ARFID kicks in around, say, onions?  Not so much.",
          "created_utc": 1581665682.0
        }
      ]
    },
    {
      "id": "fhkvf02",
      "author": "Telaneo",
      "body": "Funny how you assume my intention was to be dismissive. I didn't doubt they don't like any music at all (even though they have since confirmed they do like some music), and the existence of musical anhedonia removes all doubt that there are people like that. It was ment to point out that a complete dismissal of all music/food must be extraordinary rare, given how even people with ARFID do like certain foods.\n\nAnd it's also funny how you assume that I have ARFID. I'm not diagnosed with it, and although I'd describe myself as picky, I don't engage in enough social interactions that it has a major impact on my life anymore.\n\nThe fact that I can't emotionally understand their dislike of music and how it affects their life, doesn't mean I can't intellectually understand it, be curious about it, and try to understand how to not be a dick about it. The same thing *should* apply to ARFID, which is what OP is ranting about. People don't need to emotionally understand not liking most foods, but they can (and probably should) intellectually understand it, be curious about it, and try to understand how not to be a dick about it. Or at the very least ignore it, and not shove food in people's faces or rant about how you just haven't heard the right type of music yet. But apparently, some people aren't capable of doing that.",
      "created_utc": 1581691922.0,
      "score": 6,
      "context": [
        {
          "id": "fhj60g8",
          "author": "it_was_you_fredo",
          "body": "Let me see if I can draw an analogy.  I may have a near-unique perspective to answer this question.\n\nThing 1 is I don't have ARFID.  In fact, what draws me to this subreddit and similar forums is I'm the opposite.  I *love* food, and I'll eat anything.  Most of the analogies ARFID sufferers draw are lost on me.  I *would*, in fact, eat raw liver.  Have.  So I hang out here because I find it fascinating, and also because my deep knowledge of food sometimes enables me to make genuine suggestions.\n\nThing 2 is I don't like music.  It's mostly annoying noise to me.  Yes, I've tried all the genres.  Yes, that one, and that one too.  I just don't get most of it.  And I'm nearly 50, so I've had plenty of experiences to form an opinion.\n\nIf you're like most people, you'd respond to Thing 2 with near-disbelief.  And then you might think there's something seriously wrong with me.  And then it might upset you, because I don't like your favorite singer.  It's incomprehensible to you, maybe.  *How can somebody not like this thing I like?*\n\nDo you see what I'm getting at?\n\nFood, music, and a few others are near-universal shared human experiences.  Substitute \"music\" for food in the rest of this paragraph.  If you're like me, you think about food a lot.  You invest time, money, and effort into this food thing on a bunch of levels.  When you're planning an evening, the central event involves food.  And then, when you find out there's somebody who dislikes or is indifferent to the entire subject of food, it seems weird and off-putting.  Like that person is insulting this thing you've put so much into.\n\nThis is just speculation based on personal experience.  I admit, I was stunned when I first heard of ARFID, which goes back many years before ARFID was even officially A Thing.  I felt the things you've probably all heard.  You eat like a child, you just have to try it, etc.  But I understand it better now, and I'm pretty sure there's merit to my analogy.\n\nJust my $0.02.\n\nTL;DR: I don't like music.  People tend to react toward me the same way they react toward ARFID sufferers.  If you can understand the reaction toward my indifference to music, perhaps you can understand others' reactions toward ARFID.",
          "created_utc": 1581638752.0
        },
        {
          "id": "fhjxnb6",
          "author": "Telaneo",
          "body": "Literally *all* music? I mean, not that I don't believe you, but even most people with ARFID and picky eaters will have some favourite food. Hence the chicken tenders meme. It's just that the vast majority of 'genres' of food are off the table, while the foods that are safe can still be enjoyable.\n\nAlthough there are definitly people with ARFID who have problems with food in general, so there's not like there's no equivelent to not liking music at all in the food world.\n\n> It's mostly annoying noise to me.\n\nYou say mostly, so maybe there are some genres better than others? Or some individual songs that are good? Or is no music always preferable, and some songs are just more tolerable than others? You should look up [musical anhedonia](https://en.wikipedia.org/wiki/Musical_anhedonia) if you haven't.\n\nYour analogy's spot on by the way.",
          "created_utc": 1581658824.0
        },
        {
          "id": "fhktiq1",
          "author": "ALT_enveetee",
          "body": "Funny how you are responding with dismissive disbelief about someone disliking something that you personally find unbelievable when people do the same thing to you. And you probably crave empathy and understanding from others.",
          "created_utc": 1581690958.0
        }
      ]
    },
    {
      "id": "fhkube6",
      "author": "it_was_you_fredo",
      "body": "This isn't a debate sub.  I'm not trying to prove anybody wrong, just trying to provide perspective.\n\nHave a little empathy, or go start /r/debatearfid.",
      "created_utc": 1581691368.0,
      "score": 4,
      "context": [
        {
          "id": "fhj60g8",
          "author": "it_was_you_fredo",
          "body": "Let me see if I can draw an analogy.  I may have a near-unique perspective to answer this question.\n\nThing 1 is I don't have ARFID.  In fact, what draws me to this subreddit and similar forums is I'm the opposite.  I *love* food, and I'll eat anything.  Most of the analogies ARFID sufferers draw are lost on me.  I *would*, in fact, eat raw liver.  Have.  So I hang out here because I find it fascinating, and also because my deep knowledge of food sometimes enables me to make genuine suggestions.\n\nThing 2 is I don't like music.  It's mostly annoying noise to me.  Yes, I've tried all the genres.  Yes, that one, and that one too.  I just don't get most of it.  And I'm nearly 50, so I've had plenty of experiences to form an opinion.\n\nIf you're like most people, you'd respond to Thing 2 with near-disbelief.  And then you might think there's something seriously wrong with me.  And then it might upset you, because I don't like your favorite singer.  It's incomprehensible to you, maybe.  *How can somebody not like this thing I like?*\n\nDo you see what I'm getting at?\n\nFood, music, and a few others are near-universal shared human experiences.  Substitute \"music\" for food in the rest of this paragraph.  If you're like me, you think about food a lot.  You invest time, money, and effort into this food thing on a bunch of levels.  When you're planning an evening, the central event involves food.  And then, when you find out there's somebody who dislikes or is indifferent to the entire subject of food, it seems weird and off-putting.  Like that person is insulting this thing you've put so much into.\n\nThis is just speculation based on personal experience.  I admit, I was stunned when I first heard of ARFID, which goes back many years before ARFID was even officially A Thing.  I felt the things you've probably all heard.  You eat like a child, you just have to try it, etc.  But I understand it better now, and I'm pretty sure there's merit to my analogy.\n\nJust my $0.02.\n\nTL;DR: I don't like music.  People tend to react toward me the same way they react toward ARFID sufferers.  If you can understand the reaction toward my indifference to music, perhaps you can understand others' reactions toward ARFID.",
          "created_utc": 1581638752.0
        },
        {
          "id": "fhjxnb6",
          "author": "Telaneo",
          "body": "Literally *all* music? I mean, not that I don't believe you, but even most people with ARFID and picky eaters will have some favourite food. Hence the chicken tenders meme. It's just that the vast majority of 'genres' of food are off the table, while the foods that are safe can still be enjoyable.\n\nAlthough there are definitly people with ARFID who have problems with food in general, so there's not like there's no equivelent to not liking music at all in the food world.\n\n> It's mostly annoying noise to me.\n\nYou say mostly, so maybe there are some genres better than others? Or some individual songs that are good? Or is no music always preferable, and some songs are just more tolerable than others? You should look up [musical anhedonia](https://en.wikipedia.org/wiki/Musical_anhedonia) if you haven't.\n\nYour analogy's spot on by the way.",
          "created_utc": 1581658824.0
        },
        {
          "id": "fhktiq1",
          "author": "ALT_enveetee",
          "body": "Funny how you are responding with dismissive disbelief about someone disliking something that you personally find unbelievable when people do the same thing to you. And you probably crave empathy and understanding from others.",
          "created_utc": 1581690958.0
        }
      ]
    },
    {
      "id": "fhj7321",
      "author": "wandadetroit",
      "body": "Delicious! Just really expensive.",
      "created_utc": 1581639284.0,
      "score": 5,
      "context": [
        {
          "id": "fhiy9yf",
          "author": "boring-unicorn",
          "body": "I just spent a week with 2 picky kids, it's just the options are so limited we all ended up eating shit we didn't enjoy which sucked.  On the last day we found a buffet tho which was amazing because we all enjoyed it!! You just need to plan ahead better so that you can all get what you like, food courts, buffets or Cheesecake Factory are all good options in my experience. Also if you're a picky eater just eat before meeting up with people just in case so that you don't starve",
          "created_utc": 1581634272.0
        },
        {
          "id": "fhj5mtw",
          "author": "wandadetroit",
          "body": "I spent $70 on a buffet in Vegas to end up eating only a slice of prime rib, a plain baked potato (with butter) and two rolls. But it was safe. \n\nBuffets are the absolute best.",
          "created_utc": 1581638562.0
        },
        {
          "id": "fhj6qnw",
          "author": "boring-unicorn",
          "body": "That actually sounds like a good meal!",
          "created_utc": 1581639114.0
        }
      ]
    },
    {
      "id": "fhj7o8z",
      "author": "whateverusername999",
      "body": "Ehh I mean there’s a decent amount of people whose ARFID was made exponentially worse because they were held down and had food literally forced into them (usually by a frustrated family member) against their will and now have PTSD and choke or gag when putting food in their mouths. A lot of abusive parents out there without empathy or patience for a kid with an eating disorder. \n\nBut more regularly: friends/family members shoving food *at* someone’s face, or trying to hide a food inside another food is pretty common. More of a threat of “eat it or else you’ll be socially punished and ostracized”.",
      "created_utc": 1581639634.0,
      "score": 18,
      "context": [
        {
          "id": "fhih911",
          "author": "The1579",
          "body": ">So why do they try to force *us* to eat things?\n\nAre people really doing this? Sounds like a crime to me.",
          "created_utc": 1581624715.0
        },
        {
          "id": "fhilz4e",
          "author": "DifferentIsPossble",
          "body": "Yup. Ever seen parents of a picky eater? They show off and brag about how they're tough on their kids.",
          "created_utc": 1581627342.0
        },
        {
          "id": "fhinq5g",
          "author": "The1579",
          "body": "Yeah, I'm the parent of a picky eater.\n\nHowever, OP mentioned that they are not a child but references some group of people \"forcing\" another group of people to do something.\n\nMy comment was mostly tongue-in-cheek, as I highly doubt some band of miscreants is traveling the planet shoving food into unwanting people's mouths.",
          "created_utc": 1581628315.0
        }
      ]
    },
    {
      "id": "fhioju2",
      "author": "miss--diagnosed",
      "body": "Notice the word \"try\". I didn't say anyone was literally forcing us to eat things we don't want to, though there certainly are in the case children and teenagers.",
      "created_utc": 1581628770.0,
      "score": 16,
      "context": [
        {
          "id": "fhih911",
          "author": "The1579",
          "body": ">So why do they try to force *us* to eat things?\n\nAre people really doing this? Sounds like a crime to me.",
          "created_utc": 1581624715.0
        },
        {
          "id": "fhilz4e",
          "author": "DifferentIsPossble",
          "body": "Yup. Ever seen parents of a picky eater? They show off and brag about how they're tough on their kids.",
          "created_utc": 1581627342.0
        },
        {
          "id": "fhinq5g",
          "author": "The1579",
          "body": "Yeah, I'm the parent of a picky eater.\n\nHowever, OP mentioned that they are not a child but references some group of people \"forcing\" another group of people to do something.\n\nMy comment was mostly tongue-in-cheek, as I highly doubt some band of miscreants is traveling the planet shoving food into unwanting people's mouths.",
          "created_utc": 1581628315.0
        }
      ]
    },
    {
      "id": "fhio279",
      "author": "DifferentIsPossble",
      "body": "I'm really glad you're breaking the mold, honestly. It's really refreshing to see a parent of a picky eater who's not Like That ™\n\nAnd as for OP... peer pressure among adults is still a thing. People get SO offended you don't like something they like, or try oto \"encourage\" you to do it while leaving you no way out (like proposing with a giant ceremony without being sure the proposal is requited) .",
      "created_utc": 1581628500.0,
      "score": 9,
      "context": [
        {
          "id": "fhih911",
          "author": "The1579",
          "body": ">So why do they try to force *us* to eat things?\n\nAre people really doing this? Sounds like a crime to me.",
          "created_utc": 1581624715.0
        },
        {
          "id": "fhilz4e",
          "author": "DifferentIsPossble",
          "body": "Yup. Ever seen parents of a picky eater? They show off and brag about how they're tough on their kids.",
          "created_utc": 1581627342.0
        },
        {
          "id": "fhinq5g",
          "author": "The1579",
          "body": "Yeah, I'm the parent of a picky eater.\n\nHowever, OP mentioned that they are not a child but references some group of people \"forcing\" another group of people to do something.\n\nMy comment was mostly tongue-in-cheek, as I highly doubt some band of miscreants is traveling the planet shoving food into unwanting people's mouths.",
          "created_utc": 1581628315.0
        }
      ]
    },
    {
      "id": "fhjdmxw",
      "author": "None",
      "body": "Yeah, I’ve had people try to physically force food into my mouth. Like touch my lips with the utensil with the food I don’t like on it. It’s happened too many times",
      "created_utc": 1581643594.0,
      "score": 9,
      "context": [
        {
          "id": "fhih911",
          "author": "The1579",
          "body": ">So why do they try to force *us* to eat things?\n\nAre people really doing this? Sounds like a crime to me.",
          "created_utc": 1581624715.0
        },
        {
          "id": "fhilz4e",
          "author": "DifferentIsPossble",
          "body": "Yup. Ever seen parents of a picky eater? They show off and brag about how they're tough on their kids.",
          "created_utc": 1581627342.0
        },
        {
          "id": "fhinq5g",
          "author": "The1579",
          "body": "Yeah, I'm the parent of a picky eater.\n\nHowever, OP mentioned that they are not a child but references some group of people \"forcing\" another group of people to do something.\n\nMy comment was mostly tongue-in-cheek, as I highly doubt some band of miscreants is traveling the planet shoving food into unwanting people's mouths.",
          "created_utc": 1581628315.0
        }
      ]
    },
    {
      "id": "jncebaz",
      "author": "IF_HellishRelish",
      "body": "Bruh, my parents and aunts and uncles shoved food down my throat as a kid. It happens. Its made it a lot worse and Ive had to undergo years of therapy to eat fucking carrots and broccoli. \n\nI will never eat corn again tho, all thanks to the texture of my dad’s fingers.",
      "created_utc": 1686191396.0,
      "score": 1,
      "context": [
        {
          "id": "fhih911",
          "author": "The1579",
          "body": ">So why do they try to force *us* to eat things?\n\nAre people really doing this? Sounds like a crime to me.",
          "created_utc": 1581624715.0
        },
        {
          "id": "fhilz4e",
          "author": "DifferentIsPossble",
          "body": "Yup. Ever seen parents of a picky eater? They show off and brag about how they're tough on their kids.",
          "created_utc": 1581627342.0
        },
        {
          "id": "fhinq5g",
          "author": "The1579",
          "body": "Yeah, I'm the parent of a picky eater.\n\nHowever, OP mentioned that they are not a child but references some group of people \"forcing\" another group of people to do something.\n\nMy comment was mostly tongue-in-cheek, as I highly doubt some band of miscreants is traveling the planet shoving food into unwanting people's mouths.",
          "created_utc": 1581628315.0
        }
      ]
    },
    {
      "id": "hsbxdrf",
      "author": "AtomicTimothy",
      "body": "I think the picky eating would be way less of a problem compared to the behaviour, if she'd just cook for herself then she can have plenty of food exactly the way she wants it. I saw more comments being angry about \"enabling this behaviour\"",
      "created_utc": 1641981551.0,
      "score": 5,
      "context": [
        {
          "id": "fhinqb0",
          "author": "Prof_Gutnacht",
          "body": "r/AmITheAsshole is filled with these kinds of people. I don't understand why they hate people with arfid so much either. probably  just bigotry",
          "created_utc": 1581628318.0
        },
        {
          "id": "fhj5ezo",
          "author": "wandadetroit",
          "body": "Like [this one](https://www.reddit.com/r/AmItheAsshole/comments/f31hyy/aita_for_telling_my_sister_she_could_starve_if/?utm_medium=android_app&utm_source=share) yesterday. Had me fuming.",
          "created_utc": 1581638454.0
        },
        {
          "id": "fhkt4cj",
          "author": "ALT_enveetee",
          "body": "But OP’s sister had a history of demanding for OP to make her food, and just wouldn’t eat if she was expected to make it herself. Or would get upset if OP only made food for herself.  You’re “fuming” that an entitled brat didn’t get her way...? Why on earth would you support someone so selfish?",
          "created_utc": 1581690749.0
        },
        {
          "id": "fhlqccz",
          "author": "wandadetroit",
          "body": "Oh I'm not at all okay with her attitude - what had me fuming is the way people commented about her eating like a toddler as that was her choice.",
          "created_utc": 1581703390.0
        }
      ]
    },
    {
      "id": "m72h7bs",
      "author": "SnakeItch",
      "body": "No one made you eat anything 😭 they handed out food you could have rejected. Stop trying to change the story that YOU TOLD to fit your own delusion lmao. And don't use autism as an excuse to write this obnoxious story probably 12 years later. You were too scared to say no to simple food and tried everything, and failed, to make it seem they shoved food down your throat when they just handed it out.",
      "created_utc": 1736843038.0,
      "score": 1,
      "context": [
        {
          "id": "fhiry7e",
          "author": "Gaminbro91",
          "body": "People often get pissed at me for not eating stuff. Like today i had a teacher cooking some stuff and she was giving it out to the class and I'm just like nah I'm good but apparently not eating a damn fried banana is a sin against humanity",
          "created_utc": 1581630636.0
        },
        {
          "id": "fhiwqsy",
          "author": "Singitqueen",
          "body": "That is always a nightmare. I had a teacher bring us cupcakes, and they were fantastic. But, they were strawberry. I had to ask the person across from me if she wanted my strawberry, which was sorta embarrassing, but she didn't mention anything and accepted. This was a tame experience compared to some of the times I've had this happen. \n\nThe worst time I ever had in elementary school was when they started giving us a fresh fruit or vegetable every day. We weren't ever forced to eat them but come on, we were forced to eat them. Anyway, yeah that is the worst.",
          "created_utc": 1581633372.0
        },
        {
          "id": "m713m2c",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1736820854.0
        },
        {
          "id": "m718cbi",
          "author": "Singitqueen",
          "body": "I was like 8 bro. Are you like, okay? You're acting like I personally wrote an angry letter to you because you were the one who made me eat the food 15 years ago. \n\nSorry man, I'll go back and tell little autistic 8 year old me to suck it up and... DON'T try the food? Hmm. I'm at a loss. Anyway I also wrote this 4 years ago. What are you doing here? What did you Google to find my comment just to complain about it?",
          "created_utc": 1736822362.0
        }
      ]
    },
    {
      "id": "fhk4xjs",
      "author": "it_was_you_fredo",
      "body": "Sometimes I even take my gf to concerts.  I'm able to zone out, or I focus on the technical aspect of the concert.  I am always able to find something to enjoy at a concert, it's just almost never the music itself.\n\nIt's far from a perfect analogy, but it's hopefully close enough to enable ARFIDs to get a glimpse of why sometimes they encounter hostility.\n\nAlso, you're very kind, and you should consider trying jicama.",
      "created_utc": 1581666994.0,
      "score": 2,
      "context": [
        {
          "id": "fhj60g8",
          "author": "it_was_you_fredo",
          "body": "Let me see if I can draw an analogy.  I may have a near-unique perspective to answer this question.\n\nThing 1 is I don't have ARFID.  In fact, what draws me to this subreddit and similar forums is I'm the opposite.  I *love* food, and I'll eat anything.  Most of the analogies ARFID sufferers draw are lost on me.  I *would*, in fact, eat raw liver.  Have.  So I hang out here because I find it fascinating, and also because my deep knowledge of food sometimes enables me to make genuine suggestions.\n\nThing 2 is I don't like music.  It's mostly annoying noise to me.  Yes, I've tried all the genres.  Yes, that one, and that one too.  I just don't get most of it.  And I'm nearly 50, so I've had plenty of experiences to form an opinion.\n\nIf you're like most people, you'd respond to Thing 2 with near-disbelief.  And then you might think there's something seriously wrong with me.  And then it might upset you, because I don't like your favorite singer.  It's incomprehensible to you, maybe.  *How can somebody not like this thing I like?*\n\nDo you see what I'm getting at?\n\nFood, music, and a few others are near-universal shared human experiences.  Substitute \"music\" for food in the rest of this paragraph.  If you're like me, you think about food a lot.  You invest time, money, and effort into this food thing on a bunch of levels.  When you're planning an evening, the central event involves food.  And then, when you find out there's somebody who dislikes or is indifferent to the entire subject of food, it seems weird and off-putting.  Like that person is insulting this thing you've put so much into.\n\nThis is just speculation based on personal experience.  I admit, I was stunned when I first heard of ARFID, which goes back many years before ARFID was even officially A Thing.  I felt the things you've probably all heard.  You eat like a child, you just have to try it, etc.  But I understand it better now, and I'm pretty sure there's merit to my analogy.\n\nJust my $0.02.\n\nTL;DR: I don't like music.  People tend to react toward me the same way they react toward ARFID sufferers.  If you can understand the reaction toward my indifference to music, perhaps you can understand others' reactions toward ARFID.",
          "created_utc": 1581638752.0
        },
        {
          "id": "fhjxnb6",
          "author": "Telaneo",
          "body": "Literally *all* music? I mean, not that I don't believe you, but even most people with ARFID and picky eaters will have some favourite food. Hence the chicken tenders meme. It's just that the vast majority of 'genres' of food are off the table, while the foods that are safe can still be enjoyable.\n\nAlthough there are definitly people with ARFID who have problems with food in general, so there's not like there's no equivelent to not liking music at all in the food world.\n\n> It's mostly annoying noise to me.\n\nYou say mostly, so maybe there are some genres better than others? Or some individual songs that are good? Or is no music always preferable, and some songs are just more tolerable than others? You should look up [musical anhedonia](https://en.wikipedia.org/wiki/Musical_anhedonia) if you haven't.\n\nYour analogy's spot on by the way.",
          "created_utc": 1581658824.0
        },
        {
          "id": "fhk3w76",
          "author": "it_was_you_fredo",
          "body": "No!  Not literally all music, but I'd posit that makes my analogy even better.\n\nJust like somebody with ARFID who likes a *very* few foods, so it's like with me and music.\n\nWhere the analogy breaks down: I can tolerate basically any music.  I have to, it's everywhere.  Somebody whose ARFID kicks in around, say, onions?  Not so much.",
          "created_utc": 1581665682.0
        },
        {
          "id": "fhk46ja",
          "author": "Telaneo",
          "body": "A lot of people with ARFID can also tolerate being around unsafe foods (not all, of course), but actually eating and putting it in your mouth is the problem. I guess the analogy breaks down because being exposed to music and being exposed to unsafe foods are equivelent, but there's no music equivelent of actually eating an unsafe food. Depends on what you'd say is equivelent to what.",
          "created_utc": 1581666040.0
        }
      ]
    },
    {
      "id": "fhj7f9o",
      "author": "boring-unicorn",
      "body": "Yeah, the first time i went to vegas i paid $80 to do a seafood buffet, because that's what everyone agreed to. I absolutely hate seafood and the smell, i paid and just drank wine and ate dry bread because im afraid of seafood touching any of my food, literally makes me nauseous. Worst night",
      "created_utc": 1581639477.0,
      "score": 3,
      "context": [
        {
          "id": "fhiy9yf",
          "author": "boring-unicorn",
          "body": "I just spent a week with 2 picky kids, it's just the options are so limited we all ended up eating shit we didn't enjoy which sucked.  On the last day we found a buffet tho which was amazing because we all enjoyed it!! You just need to plan ahead better so that you can all get what you like, food courts, buffets or Cheesecake Factory are all good options in my experience. Also if you're a picky eater just eat before meeting up with people just in case so that you don't starve",
          "created_utc": 1581634272.0
        },
        {
          "id": "fhj5mtw",
          "author": "wandadetroit",
          "body": "I spent $70 on a buffet in Vegas to end up eating only a slice of prime rib, a plain baked potato (with butter) and two rolls. But it was safe. \n\nBuffets are the absolute best.",
          "created_utc": 1581638562.0
        },
        {
          "id": "fhj6qnw",
          "author": "boring-unicorn",
          "body": "That actually sounds like a good meal!",
          "created_utc": 1581639114.0
        },
        {
          "id": "fhj7321",
          "author": "wandadetroit",
          "body": "Delicious! Just really expensive.",
          "created_utc": 1581639284.0
        }
      ]
    },
    {
      "id": "fhjeeok",
      "author": "The1579",
      "body": "I’m asking, as an adult, how has someone tried to force you to eat something?\n\nFor instance, a person could try to force their way into your house by prying at your door. \n\nHow, specifically, has some tried to “force” you to eat something as an adult?\n\nI ask because I think “force” denotes a use of physical strength or threat of violence. That’s literally the definition.",
      "created_utc": 1581644137.0,
      "score": -6,
      "context": [
        {
          "id": "fhih911",
          "author": "The1579",
          "body": ">So why do they try to force *us* to eat things?\n\nAre people really doing this? Sounds like a crime to me.",
          "created_utc": 1581624715.0
        },
        {
          "id": "fhilz4e",
          "author": "DifferentIsPossble",
          "body": "Yup. Ever seen parents of a picky eater? They show off and brag about how they're tough on their kids.",
          "created_utc": 1581627342.0
        },
        {
          "id": "fhinq5g",
          "author": "The1579",
          "body": "Yeah, I'm the parent of a picky eater.\n\nHowever, OP mentioned that they are not a child but references some group of people \"forcing\" another group of people to do something.\n\nMy comment was mostly tongue-in-cheek, as I highly doubt some band of miscreants is traveling the planet shoving food into unwanting people's mouths.",
          "created_utc": 1581628315.0
        },
        {
          "id": "fhioju2",
          "author": "miss--diagnosed",
          "body": "Notice the word \"try\". I didn't say anyone was literally forcing us to eat things we don't want to, though there certainly are in the case children and teenagers.",
          "created_utc": 1581628770.0
        }
      ]
    },
    {
      "id": "fhjdoft",
      "author": "The1579",
      "body": "As an adult?",
      "created_utc": 1581643623.0,
      "score": 2,
      "context": [
        {
          "id": "fhih911",
          "author": "The1579",
          "body": ">So why do they try to force *us* to eat things?\n\nAre people really doing this? Sounds like a crime to me.",
          "created_utc": 1581624715.0
        },
        {
          "id": "fhilz4e",
          "author": "DifferentIsPossble",
          "body": "Yup. Ever seen parents of a picky eater? They show off and brag about how they're tough on their kids.",
          "created_utc": 1581627342.0
        },
        {
          "id": "fhinq5g",
          "author": "The1579",
          "body": "Yeah, I'm the parent of a picky eater.\n\nHowever, OP mentioned that they are not a child but references some group of people \"forcing\" another group of people to do something.\n\nMy comment was mostly tongue-in-cheek, as I highly doubt some band of miscreants is traveling the planet shoving food into unwanting people's mouths.",
          "created_utc": 1581628315.0
        },
        {
          "id": "fhjdmxw",
          "author": "None",
          "body": "Yeah, I’ve had people try to physically force food into my mouth. Like touch my lips with the utensil with the food I don’t like on it. It’s happened too many times",
          "created_utc": 1581643594.0
        }
      ]
    },
    {
      "id": "m72jvyl",
      "author": "Singitqueen",
      "body": "'obnoxious' okay buster. You got me! They didn't force me to eat the food! \n\nMaybe get off reddit if you're this upset over a 4 year old comment about a story of me not liking broccoli and feeling peer pressured as a child. Go outside, see the sun. Speak to someone. Maybe a therapist.",
      "created_utc": 1736844805.0,
      "score": 1,
      "context": [
        {
          "id": "fhiry7e",
          "author": "Gaminbro91",
          "body": "People often get pissed at me for not eating stuff. Like today i had a teacher cooking some stuff and she was giving it out to the class and I'm just like nah I'm good but apparently not eating a damn fried banana is a sin against humanity",
          "created_utc": 1581630636.0
        },
        {
          "id": "fhiwqsy",
          "author": "Singitqueen",
          "body": "That is always a nightmare. I had a teacher bring us cupcakes, and they were fantastic. But, they were strawberry. I had to ask the person across from me if she wanted my strawberry, which was sorta embarrassing, but she didn't mention anything and accepted. This was a tame experience compared to some of the times I've had this happen. \n\nThe worst time I ever had in elementary school was when they started giving us a fresh fruit or vegetable every day. We weren't ever forced to eat them but come on, we were forced to eat them. Anyway, yeah that is the worst.",
          "created_utc": 1581633372.0
        },
        {
          "id": "m713m2c",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1736820854.0
        },
        {
          "id": "m718cbi",
          "author": "Singitqueen",
          "body": "I was like 8 bro. Are you like, okay? You're acting like I personally wrote an angry letter to you because you were the one who made me eat the food 15 years ago. \n\nSorry man, I'll go back and tell little autistic 8 year old me to suck it up and... DON'T try the food? Hmm. I'm at a loss. Anyway I also wrote this 4 years ago. What are you doing here? What did you Google to find my comment just to complain about it?",
          "created_utc": 1736822362.0
        },
        {
          "id": "m72h7bs",
          "author": "SnakeItch",
          "body": "No one made you eat anything 😭 they handed out food you could have rejected. Stop trying to change the story that YOU TOLD to fit your own delusion lmao. And don't use autism as an excuse to write this obnoxious story probably 12 years later. You were too scared to say no to simple food and tried everything, and failed, to make it seem they shoved food down your throat when they just handed it out.",
          "created_utc": 1736843038.0
        }
      ]
    },
    {
      "id": "fhj7mww",
      "author": "wandadetroit",
      "body": "I'm so sorry :(\n\nWine and bread sounds great to me though!!",
      "created_utc": 1581639611.0,
      "score": 2,
      "context": [
        {
          "id": "fhiy9yf",
          "author": "boring-unicorn",
          "body": "I just spent a week with 2 picky kids, it's just the options are so limited we all ended up eating shit we didn't enjoy which sucked.  On the last day we found a buffet tho which was amazing because we all enjoyed it!! You just need to plan ahead better so that you can all get what you like, food courts, buffets or Cheesecake Factory are all good options in my experience. Also if you're a picky eater just eat before meeting up with people just in case so that you don't starve",
          "created_utc": 1581634272.0
        },
        {
          "id": "fhj5mtw",
          "author": "wandadetroit",
          "body": "I spent $70 on a buffet in Vegas to end up eating only a slice of prime rib, a plain baked potato (with butter) and two rolls. But it was safe. \n\nBuffets are the absolute best.",
          "created_utc": 1581638562.0
        },
        {
          "id": "fhj6qnw",
          "author": "boring-unicorn",
          "body": "That actually sounds like a good meal!",
          "created_utc": 1581639114.0
        },
        {
          "id": "fhj7321",
          "author": "wandadetroit",
          "body": "Delicious! Just really expensive.",
          "created_utc": 1581639284.0
        },
        {
          "id": "fhj7f9o",
          "author": "boring-unicorn",
          "body": "Yeah, the first time i went to vegas i paid $80 to do a seafood buffet, because that's what everyone agreed to. I absolutely hate seafood and the smell, i paid and just drank wine and ate dry bread because im afraid of seafood touching any of my food, literally makes me nauseous. Worst night",
          "created_utc": 1581639477.0
        }
      ]
    },
    {
      "id": "fhjg5qa",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1581645382.0,
      "score": 14,
      "context": [
        {
          "id": "fhih911",
          "author": "The1579",
          "body": ">So why do they try to force *us* to eat things?\n\nAre people really doing this? Sounds like a crime to me.",
          "created_utc": 1581624715.0
        },
        {
          "id": "fhilz4e",
          "author": "DifferentIsPossble",
          "body": "Yup. Ever seen parents of a picky eater? They show off and brag about how they're tough on their kids.",
          "created_utc": 1581627342.0
        },
        {
          "id": "fhinq5g",
          "author": "The1579",
          "body": "Yeah, I'm the parent of a picky eater.\n\nHowever, OP mentioned that they are not a child but references some group of people \"forcing\" another group of people to do something.\n\nMy comment was mostly tongue-in-cheek, as I highly doubt some band of miscreants is traveling the planet shoving food into unwanting people's mouths.",
          "created_utc": 1581628315.0
        },
        {
          "id": "fhioju2",
          "author": "miss--diagnosed",
          "body": "Notice the word \"try\". I didn't say anyone was literally forcing us to eat things we don't want to, though there certainly are in the case children and teenagers.",
          "created_utc": 1581628770.0
        },
        {
          "id": "fhjeeok",
          "author": "The1579",
          "body": "I’m asking, as an adult, how has someone tried to force you to eat something?\n\nFor instance, a person could try to force their way into your house by prying at your door. \n\nHow, specifically, has some tried to “force” you to eat something as an adult?\n\nI ask because I think “force” denotes a use of physical strength or threat of violence. That’s literally the definition.",
          "created_utc": 1581644137.0
        }
      ]
    },
    {
      "id": "fhog8tu",
      "author": "None",
      "body": "Yes. As an adult. It’s crazy. Believe it or not, it’s happened more as an adult than it did when I was a kid",
      "created_utc": 1581755111.0,
      "score": 6,
      "context": [
        {
          "id": "fhih911",
          "author": "The1579",
          "body": ">So why do they try to force *us* to eat things?\n\nAre people really doing this? Sounds like a crime to me.",
          "created_utc": 1581624715.0
        },
        {
          "id": "fhilz4e",
          "author": "DifferentIsPossble",
          "body": "Yup. Ever seen parents of a picky eater? They show off and brag about how they're tough on their kids.",
          "created_utc": 1581627342.0
        },
        {
          "id": "fhinq5g",
          "author": "The1579",
          "body": "Yeah, I'm the parent of a picky eater.\n\nHowever, OP mentioned that they are not a child but references some group of people \"forcing\" another group of people to do something.\n\nMy comment was mostly tongue-in-cheek, as I highly doubt some band of miscreants is traveling the planet shoving food into unwanting people's mouths.",
          "created_utc": 1581628315.0
        },
        {
          "id": "fhjdmxw",
          "author": "None",
          "body": "Yeah, I’ve had people try to physically force food into my mouth. Like touch my lips with the utensil with the food I don’t like on it. It’s happened too many times",
          "created_utc": 1581643594.0
        },
        {
          "id": "fhjdoft",
          "author": "The1579",
          "body": "As an adult?",
          "created_utc": 1581643623.0
        }
      ]
    },
    {
      "id": "m72k9b5",
      "author": "SnakeItch",
      "body": "That's how lame and obnoxious your story was. It warranted a hate comment 5 years into the future.\n\nI'm not upset over your peer pressured 8 year old self (also why are you claiming you were 4 in elementary school??? stick with one story). \n\nIf I were upset over anything though, it'd be how obnoxious you are and the lack of growth. You didn't grow at all and from the implications through your comments, you still have the awful mentality of being catered to. You blame others for your own faults, holding no responsibility for problems you cause for yourself. I can tell that carried onto your adult life.\n\nGrow up honestly, it's genuinely pathetic.",
      "created_utc": 1736845053.0,
      "score": 1,
      "context": [
        {
          "id": "fhiry7e",
          "author": "Gaminbro91",
          "body": "People often get pissed at me for not eating stuff. Like today i had a teacher cooking some stuff and she was giving it out to the class and I'm just like nah I'm good but apparently not eating a damn fried banana is a sin against humanity",
          "created_utc": 1581630636.0
        },
        {
          "id": "fhiwqsy",
          "author": "Singitqueen",
          "body": "That is always a nightmare. I had a teacher bring us cupcakes, and they were fantastic. But, they were strawberry. I had to ask the person across from me if she wanted my strawberry, which was sorta embarrassing, but she didn't mention anything and accepted. This was a tame experience compared to some of the times I've had this happen. \n\nThe worst time I ever had in elementary school was when they started giving us a fresh fruit or vegetable every day. We weren't ever forced to eat them but come on, we were forced to eat them. Anyway, yeah that is the worst.",
          "created_utc": 1581633372.0
        },
        {
          "id": "m713m2c",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1736820854.0
        },
        {
          "id": "m718cbi",
          "author": "Singitqueen",
          "body": "I was like 8 bro. Are you like, okay? You're acting like I personally wrote an angry letter to you because you were the one who made me eat the food 15 years ago. \n\nSorry man, I'll go back and tell little autistic 8 year old me to suck it up and... DON'T try the food? Hmm. I'm at a loss. Anyway I also wrote this 4 years ago. What are you doing here? What did you Google to find my comment just to complain about it?",
          "created_utc": 1736822362.0
        },
        {
          "id": "m72h7bs",
          "author": "SnakeItch",
          "body": "No one made you eat anything 😭 they handed out food you could have rejected. Stop trying to change the story that YOU TOLD to fit your own delusion lmao. And don't use autism as an excuse to write this obnoxious story probably 12 years later. You were too scared to say no to simple food and tried everything, and failed, to make it seem they shoved food down your throat when they just handed it out.",
          "created_utc": 1736843038.0
        },
        {
          "id": "m72jvyl",
          "author": "Singitqueen",
          "body": "'obnoxious' okay buster. You got me! They didn't force me to eat the food! \n\nMaybe get off reddit if you're this upset over a 4 year old comment about a story of me not liking broccoli and feeling peer pressured as a child. Go outside, see the sun. Speak to someone. Maybe a therapist.",
          "created_utc": 1736844805.0
        }
      ]
    },
    {
      "id": "fhjg9ij",
      "author": "The1579",
      "body": "Okay, that’s what I thought. No actual use or threat of force. \n\nThat’s good. I can’t imagine how awful that would be.",
      "created_utc": 1581645456.0,
      "score": -5,
      "context": [
        {
          "id": "fhih911",
          "author": "The1579",
          "body": ">So why do they try to force *us* to eat things?\n\nAre people really doing this? Sounds like a crime to me.",
          "created_utc": 1581624715.0
        },
        {
          "id": "fhilz4e",
          "author": "DifferentIsPossble",
          "body": "Yup. Ever seen parents of a picky eater? They show off and brag about how they're tough on their kids.",
          "created_utc": 1581627342.0
        },
        {
          "id": "fhinq5g",
          "author": "The1579",
          "body": "Yeah, I'm the parent of a picky eater.\n\nHowever, OP mentioned that they are not a child but references some group of people \"forcing\" another group of people to do something.\n\nMy comment was mostly tongue-in-cheek, as I highly doubt some band of miscreants is traveling the planet shoving food into unwanting people's mouths.",
          "created_utc": 1581628315.0
        },
        {
          "id": "fhioju2",
          "author": "miss--diagnosed",
          "body": "Notice the word \"try\". I didn't say anyone was literally forcing us to eat things we don't want to, though there certainly are in the case children and teenagers.",
          "created_utc": 1581628770.0
        },
        {
          "id": "fhjeeok",
          "author": "The1579",
          "body": "I’m asking, as an adult, how has someone tried to force you to eat something?\n\nFor instance, a person could try to force their way into your house by prying at your door. \n\nHow, specifically, has some tried to “force” you to eat something as an adult?\n\nI ask because I think “force” denotes a use of physical strength or threat of violence. That’s literally the definition.",
          "created_utc": 1581644137.0
        },
        {
          "id": "fhjg5qa",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1581645382.0
        }
      ]
    },
    {
      "id": "m72kdi0",
      "author": "Singitqueen",
      "body": "Bro cannot read",
      "created_utc": 1736845130.0,
      "score": 1,
      "context": [
        {
          "id": "fhiry7e",
          "author": "Gaminbro91",
          "body": "People often get pissed at me for not eating stuff. Like today i had a teacher cooking some stuff and she was giving it out to the class and I'm just like nah I'm good but apparently not eating a damn fried banana is a sin against humanity",
          "created_utc": 1581630636.0
        },
        {
          "id": "fhiwqsy",
          "author": "Singitqueen",
          "body": "That is always a nightmare. I had a teacher bring us cupcakes, and they were fantastic. But, they were strawberry. I had to ask the person across from me if she wanted my strawberry, which was sorta embarrassing, but she didn't mention anything and accepted. This was a tame experience compared to some of the times I've had this happen. \n\nThe worst time I ever had in elementary school was when they started giving us a fresh fruit or vegetable every day. We weren't ever forced to eat them but come on, we were forced to eat them. Anyway, yeah that is the worst.",
          "created_utc": 1581633372.0
        },
        {
          "id": "m713m2c",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1736820854.0
        },
        {
          "id": "m718cbi",
          "author": "Singitqueen",
          "body": "I was like 8 bro. Are you like, okay? You're acting like I personally wrote an angry letter to you because you were the one who made me eat the food 15 years ago. \n\nSorry man, I'll go back and tell little autistic 8 year old me to suck it up and... DON'T try the food? Hmm. I'm at a loss. Anyway I also wrote this 4 years ago. What are you doing here? What did you Google to find my comment just to complain about it?",
          "created_utc": 1736822362.0
        },
        {
          "id": "m72h7bs",
          "author": "SnakeItch",
          "body": "No one made you eat anything 😭 they handed out food you could have rejected. Stop trying to change the story that YOU TOLD to fit your own delusion lmao. And don't use autism as an excuse to write this obnoxious story probably 12 years later. You were too scared to say no to simple food and tried everything, and failed, to make it seem they shoved food down your throat when they just handed it out.",
          "created_utc": 1736843038.0
        },
        {
          "id": "m72jvyl",
          "author": "Singitqueen",
          "body": "'obnoxious' okay buster. You got me! They didn't force me to eat the food! \n\nMaybe get off reddit if you're this upset over a 4 year old comment about a story of me not liking broccoli and feeling peer pressured as a child. Go outside, see the sun. Speak to someone. Maybe a therapist.",
          "created_utc": 1736844805.0
        },
        {
          "id": "m72k9b5",
          "author": "SnakeItch",
          "body": "That's how lame and obnoxious your story was. It warranted a hate comment 5 years into the future.\n\nI'm not upset over your peer pressured 8 year old self (also why are you claiming you were 4 in elementary school??? stick with one story). \n\nIf I were upset over anything though, it'd be how obnoxious you are and the lack of growth. You didn't grow at all and from the implications through your comments, you still have the awful mentality of being catered to. You blame others for your own faults, holding no responsibility for problems you cause for yourself. I can tell that carried onto your adult life.\n\nGrow up honestly, it's genuinely pathetic.",
          "created_utc": 1736845053.0
        }
      ]
    },
    {
      "id": "fhjgk8g",
      "author": "ohhyouknow",
      "body": "Abuse is abuse. Threatening/forcing people to do things with psychological abuse is abuse. It's horrifying no matter how you put it.",
      "created_utc": 1581645669.0,
      "score": 9,
      "context": [
        {
          "id": "fhih911",
          "author": "The1579",
          "body": ">So why do they try to force *us* to eat things?\n\nAre people really doing this? Sounds like a crime to me.",
          "created_utc": 1581624715.0
        },
        {
          "id": "fhilz4e",
          "author": "DifferentIsPossble",
          "body": "Yup. Ever seen parents of a picky eater? They show off and brag about how they're tough on their kids.",
          "created_utc": 1581627342.0
        },
        {
          "id": "fhinq5g",
          "author": "The1579",
          "body": "Yeah, I'm the parent of a picky eater.\n\nHowever, OP mentioned that they are not a child but references some group of people \"forcing\" another group of people to do something.\n\nMy comment was mostly tongue-in-cheek, as I highly doubt some band of miscreants is traveling the planet shoving food into unwanting people's mouths.",
          "created_utc": 1581628315.0
        },
        {
          "id": "fhioju2",
          "author": "miss--diagnosed",
          "body": "Notice the word \"try\". I didn't say anyone was literally forcing us to eat things we don't want to, though there certainly are in the case children and teenagers.",
          "created_utc": 1581628770.0
        },
        {
          "id": "fhjeeok",
          "author": "The1579",
          "body": "I’m asking, as an adult, how has someone tried to force you to eat something?\n\nFor instance, a person could try to force their way into your house by prying at your door. \n\nHow, specifically, has some tried to “force” you to eat something as an adult?\n\nI ask because I think “force” denotes a use of physical strength or threat of violence. That’s literally the definition.",
          "created_utc": 1581644137.0
        },
        {
          "id": "fhjg5qa",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1581645382.0
        },
        {
          "id": "fhjg9ij",
          "author": "The1579",
          "body": "Okay, that’s what I thought. No actual use or threat of force. \n\nThat’s good. I can’t imagine how awful that would be.",
          "created_utc": 1581645456.0
        }
      ]
    },
    {
      "id": "m72ky19",
      "author": "SnakeItch",
      "body": "Lil bro can't stick with 1 story",
      "created_utc": 1736845511.0,
      "score": 1,
      "context": [
        {
          "id": "fhiry7e",
          "author": "Gaminbro91",
          "body": "People often get pissed at me for not eating stuff. Like today i had a teacher cooking some stuff and she was giving it out to the class and I'm just like nah I'm good but apparently not eating a damn fried banana is a sin against humanity",
          "created_utc": 1581630636.0
        },
        {
          "id": "fhiwqsy",
          "author": "Singitqueen",
          "body": "That is always a nightmare. I had a teacher bring us cupcakes, and they were fantastic. But, they were strawberry. I had to ask the person across from me if she wanted my strawberry, which was sorta embarrassing, but she didn't mention anything and accepted. This was a tame experience compared to some of the times I've had this happen. \n\nThe worst time I ever had in elementary school was when they started giving us a fresh fruit or vegetable every day. We weren't ever forced to eat them but come on, we were forced to eat them. Anyway, yeah that is the worst.",
          "created_utc": 1581633372.0
        },
        {
          "id": "m713m2c",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1736820854.0
        },
        {
          "id": "m718cbi",
          "author": "Singitqueen",
          "body": "I was like 8 bro. Are you like, okay? You're acting like I personally wrote an angry letter to you because you were the one who made me eat the food 15 years ago. \n\nSorry man, I'll go back and tell little autistic 8 year old me to suck it up and... DON'T try the food? Hmm. I'm at a loss. Anyway I also wrote this 4 years ago. What are you doing here? What did you Google to find my comment just to complain about it?",
          "created_utc": 1736822362.0
        },
        {
          "id": "m72h7bs",
          "author": "SnakeItch",
          "body": "No one made you eat anything 😭 they handed out food you could have rejected. Stop trying to change the story that YOU TOLD to fit your own delusion lmao. And don't use autism as an excuse to write this obnoxious story probably 12 years later. You were too scared to say no to simple food and tried everything, and failed, to make it seem they shoved food down your throat when they just handed it out.",
          "created_utc": 1736843038.0
        },
        {
          "id": "m72jvyl",
          "author": "Singitqueen",
          "body": "'obnoxious' okay buster. You got me! They didn't force me to eat the food! \n\nMaybe get off reddit if you're this upset over a 4 year old comment about a story of me not liking broccoli and feeling peer pressured as a child. Go outside, see the sun. Speak to someone. Maybe a therapist.",
          "created_utc": 1736844805.0
        },
        {
          "id": "m72k9b5",
          "author": "SnakeItch",
          "body": "That's how lame and obnoxious your story was. It warranted a hate comment 5 years into the future.\n\nI'm not upset over your peer pressured 8 year old self (also why are you claiming you were 4 in elementary school??? stick with one story). \n\nIf I were upset over anything though, it'd be how obnoxious you are and the lack of growth. You didn't grow at all and from the implications through your comments, you still have the awful mentality of being catered to. You blame others for your own faults, holding no responsibility for problems you cause for yourself. I can tell that carried onto your adult life.\n\nGrow up honestly, it's genuinely pathetic.",
          "created_utc": 1736845053.0
        },
        {
          "id": "m72kdi0",
          "author": "Singitqueen",
          "body": "Bro cannot read",
          "created_utc": 1736845130.0
        }
      ]
    },
    {
      "id": "fhjgqka",
      "author": "The1579",
      "body": "No doubt, but tiers do exist. It’s like saying “a lie is a lie.” That’s true, but there’s a difference between lying about a murder and lying about how big of a fish you caught. \n\nThat’s why the imagery of “forcing” someone to eat was alarming to me.",
      "created_utc": 1581645792.0,
      "score": -2,
      "context": [
        {
          "id": "fhih911",
          "author": "The1579",
          "body": ">So why do they try to force *us* to eat things?\n\nAre people really doing this? Sounds like a crime to me.",
          "created_utc": 1581624715.0
        },
        {
          "id": "fhilz4e",
          "author": "DifferentIsPossble",
          "body": "Yup. Ever seen parents of a picky eater? They show off and brag about how they're tough on their kids.",
          "created_utc": 1581627342.0
        },
        {
          "id": "fhinq5g",
          "author": "The1579",
          "body": "Yeah, I'm the parent of a picky eater.\n\nHowever, OP mentioned that they are not a child but references some group of people \"forcing\" another group of people to do something.\n\nMy comment was mostly tongue-in-cheek, as I highly doubt some band of miscreants is traveling the planet shoving food into unwanting people's mouths.",
          "created_utc": 1581628315.0
        },
        {
          "id": "fhioju2",
          "author": "miss--diagnosed",
          "body": "Notice the word \"try\". I didn't say anyone was literally forcing us to eat things we don't want to, though there certainly are in the case children and teenagers.",
          "created_utc": 1581628770.0
        },
        {
          "id": "fhjeeok",
          "author": "The1579",
          "body": "I’m asking, as an adult, how has someone tried to force you to eat something?\n\nFor instance, a person could try to force their way into your house by prying at your door. \n\nHow, specifically, has some tried to “force” you to eat something as an adult?\n\nI ask because I think “force” denotes a use of physical strength or threat of violence. That’s literally the definition.",
          "created_utc": 1581644137.0
        },
        {
          "id": "fhjg5qa",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1581645382.0
        },
        {
          "id": "fhjg9ij",
          "author": "The1579",
          "body": "Okay, that’s what I thought. No actual use or threat of force. \n\nThat’s good. I can’t imagine how awful that would be.",
          "created_utc": 1581645456.0
        },
        {
          "id": "fhjgk8g",
          "author": "ohhyouknow",
          "body": "Abuse is abuse. Threatening/forcing people to do things with psychological abuse is abuse. It's horrifying no matter how you put it.",
          "created_utc": 1581645669.0
        }
      ]
    },
    {
      "id": "m72l3ak",
      "author": "Singitqueen",
      "body": "Whatever you say bestie. Figured I'd point out the 4 years ago thing was literally because my original comment is 4 years old. Genius. \n\nAnyway continue your crash out or don't, I don't care. Hope you learn and grow and find happiness someday.",
      "created_utc": 1736845607.0,
      "score": 1,
      "context": [
        {
          "id": "fhiry7e",
          "author": "Gaminbro91",
          "body": "People often get pissed at me for not eating stuff. Like today i had a teacher cooking some stuff and she was giving it out to the class and I'm just like nah I'm good but apparently not eating a damn fried banana is a sin against humanity",
          "created_utc": 1581630636.0
        },
        {
          "id": "fhiwqsy",
          "author": "Singitqueen",
          "body": "That is always a nightmare. I had a teacher bring us cupcakes, and they were fantastic. But, they were strawberry. I had to ask the person across from me if she wanted my strawberry, which was sorta embarrassing, but she didn't mention anything and accepted. This was a tame experience compared to some of the times I've had this happen. \n\nThe worst time I ever had in elementary school was when they started giving us a fresh fruit or vegetable every day. We weren't ever forced to eat them but come on, we were forced to eat them. Anyway, yeah that is the worst.",
          "created_utc": 1581633372.0
        },
        {
          "id": "m713m2c",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1736820854.0
        },
        {
          "id": "m718cbi",
          "author": "Singitqueen",
          "body": "I was like 8 bro. Are you like, okay? You're acting like I personally wrote an angry letter to you because you were the one who made me eat the food 15 years ago. \n\nSorry man, I'll go back and tell little autistic 8 year old me to suck it up and... DON'T try the food? Hmm. I'm at a loss. Anyway I also wrote this 4 years ago. What are you doing here? What did you Google to find my comment just to complain about it?",
          "created_utc": 1736822362.0
        },
        {
          "id": "m72h7bs",
          "author": "SnakeItch",
          "body": "No one made you eat anything 😭 they handed out food you could have rejected. Stop trying to change the story that YOU TOLD to fit your own delusion lmao. And don't use autism as an excuse to write this obnoxious story probably 12 years later. You were too scared to say no to simple food and tried everything, and failed, to make it seem they shoved food down your throat when they just handed it out.",
          "created_utc": 1736843038.0
        },
        {
          "id": "m72jvyl",
          "author": "Singitqueen",
          "body": "'obnoxious' okay buster. You got me! They didn't force me to eat the food! \n\nMaybe get off reddit if you're this upset over a 4 year old comment about a story of me not liking broccoli and feeling peer pressured as a child. Go outside, see the sun. Speak to someone. Maybe a therapist.",
          "created_utc": 1736844805.0
        },
        {
          "id": "m72k9b5",
          "author": "SnakeItch",
          "body": "That's how lame and obnoxious your story was. It warranted a hate comment 5 years into the future.\n\nI'm not upset over your peer pressured 8 year old self (also why are you claiming you were 4 in elementary school??? stick with one story). \n\nIf I were upset over anything though, it'd be how obnoxious you are and the lack of growth. You didn't grow at all and from the implications through your comments, you still have the awful mentality of being catered to. You blame others for your own faults, holding no responsibility for problems you cause for yourself. I can tell that carried onto your adult life.\n\nGrow up honestly, it's genuinely pathetic.",
          "created_utc": 1736845053.0
        },
        {
          "id": "m72kdi0",
          "author": "Singitqueen",
          "body": "Bro cannot read",
          "created_utc": 1736845130.0
        },
        {
          "id": "m72ky19",
          "author": "SnakeItch",
          "body": "Lil bro can't stick with 1 story",
          "created_utc": 1736845511.0
        }
      ]
    },
    {
      "id": "fhjh4kb",
      "author": "ohhyouknow",
      "body": "Most of the time it's guilt tripping but I've personally had a few people try to put something in my mouth after repeatedly being told no before. You've really never had someone be really excited about something they are eating try to offer you a bite by waving a fork around in your face? Imagine someone doing that, saying no several times, and still having them try to swoop in like someone feeding a toddler with choo choo train fork like \"come on, it's good, you'll like it.\" It's happened, several times.",
      "created_utc": 1581646074.0,
      "score": 9,
      "context": [
        {
          "id": "fhih911",
          "author": "The1579",
          "body": ">So why do they try to force *us* to eat things?\n\nAre people really doing this? Sounds like a crime to me.",
          "created_utc": 1581624715.0
        },
        {
          "id": "fhilz4e",
          "author": "DifferentIsPossble",
          "body": "Yup. Ever seen parents of a picky eater? They show off and brag about how they're tough on their kids.",
          "created_utc": 1581627342.0
        },
        {
          "id": "fhinq5g",
          "author": "The1579",
          "body": "Yeah, I'm the parent of a picky eater.\n\nHowever, OP mentioned that they are not a child but references some group of people \"forcing\" another group of people to do something.\n\nMy comment was mostly tongue-in-cheek, as I highly doubt some band of miscreants is traveling the planet shoving food into unwanting people's mouths.",
          "created_utc": 1581628315.0
        },
        {
          "id": "fhioju2",
          "author": "miss--diagnosed",
          "body": "Notice the word \"try\". I didn't say anyone was literally forcing us to eat things we don't want to, though there certainly are in the case children and teenagers.",
          "created_utc": 1581628770.0
        },
        {
          "id": "fhjeeok",
          "author": "The1579",
          "body": "I’m asking, as an adult, how has someone tried to force you to eat something?\n\nFor instance, a person could try to force their way into your house by prying at your door. \n\nHow, specifically, has some tried to “force” you to eat something as an adult?\n\nI ask because I think “force” denotes a use of physical strength or threat of violence. That’s literally the definition.",
          "created_utc": 1581644137.0
        },
        {
          "id": "fhjg5qa",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1581645382.0
        },
        {
          "id": "fhjg9ij",
          "author": "The1579",
          "body": "Okay, that’s what I thought. No actual use or threat of force. \n\nThat’s good. I can’t imagine how awful that would be.",
          "created_utc": 1581645456.0
        },
        {
          "id": "fhjgk8g",
          "author": "ohhyouknow",
          "body": "Abuse is abuse. Threatening/forcing people to do things with psychological abuse is abuse. It's horrifying no matter how you put it.",
          "created_utc": 1581645669.0
        },
        {
          "id": "fhjgqka",
          "author": "The1579",
          "body": "No doubt, but tiers do exist. It’s like saying “a lie is a lie.” That’s true, but there’s a difference between lying about a murder and lying about how big of a fish you caught. \n\nThat’s why the imagery of “forcing” someone to eat was alarming to me.",
          "created_utc": 1581645792.0
        }
      ]
    },
    {
      "id": "ka9riqj",
      "author": "SnekkinHell",
      "body": "Lmao I know it's been 3 years but of course you're a fucking cop.",
      "created_utc": 1700635939.0,
      "score": 2,
      "context": [
        {
          "id": "fhih911",
          "author": "The1579",
          "body": ">So why do they try to force *us* to eat things?\n\nAre people really doing this? Sounds like a crime to me.",
          "created_utc": 1581624715.0
        },
        {
          "id": "fhilz4e",
          "author": "DifferentIsPossble",
          "body": "Yup. Ever seen parents of a picky eater? They show off and brag about how they're tough on their kids.",
          "created_utc": 1581627342.0
        },
        {
          "id": "fhinq5g",
          "author": "The1579",
          "body": "Yeah, I'm the parent of a picky eater.\n\nHowever, OP mentioned that they are not a child but references some group of people \"forcing\" another group of people to do something.\n\nMy comment was mostly tongue-in-cheek, as I highly doubt some band of miscreants is traveling the planet shoving food into unwanting people's mouths.",
          "created_utc": 1581628315.0
        },
        {
          "id": "fhioju2",
          "author": "miss--diagnosed",
          "body": "Notice the word \"try\". I didn't say anyone was literally forcing us to eat things we don't want to, though there certainly are in the case children and teenagers.",
          "created_utc": 1581628770.0
        },
        {
          "id": "fhjeeok",
          "author": "The1579",
          "body": "I’m asking, as an adult, how has someone tried to force you to eat something?\n\nFor instance, a person could try to force their way into your house by prying at your door. \n\nHow, specifically, has some tried to “force” you to eat something as an adult?\n\nI ask because I think “force” denotes a use of physical strength or threat of violence. That’s literally the definition.",
          "created_utc": 1581644137.0
        },
        {
          "id": "fhjg5qa",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1581645382.0
        },
        {
          "id": "fhjg9ij",
          "author": "The1579",
          "body": "Okay, that’s what I thought. No actual use or threat of force. \n\nThat’s good. I can’t imagine how awful that would be.",
          "created_utc": 1581645456.0
        },
        {
          "id": "fhjgk8g",
          "author": "ohhyouknow",
          "body": "Abuse is abuse. Threatening/forcing people to do things with psychological abuse is abuse. It's horrifying no matter how you put it.",
          "created_utc": 1581645669.0
        },
        {
          "id": "fhjgqka",
          "author": "The1579",
          "body": "No doubt, but tiers do exist. It’s like saying “a lie is a lie.” That’s true, but there’s a difference between lying about a murder and lying about how big of a fish you caught. \n\nThat’s why the imagery of “forcing” someone to eat was alarming to me.",
          "created_utc": 1581645792.0
        }
      ]
    },
    {
      "id": "m753t9v",
      "author": "SnakeItch",
      "body": "ah my bad, I misread that part lmao.\n\nI do hope you lose that awful mentality though. Just because you have autism doesn't mean you can blame others for your own inability to say no.",
      "created_utc": 1736880564.0,
      "score": 1,
      "context": [
        {
          "id": "fhiry7e",
          "author": "Gaminbro91",
          "body": "People often get pissed at me for not eating stuff. Like today i had a teacher cooking some stuff and she was giving it out to the class and I'm just like nah I'm good but apparently not eating a damn fried banana is a sin against humanity",
          "created_utc": 1581630636.0
        },
        {
          "id": "fhiwqsy",
          "author": "Singitqueen",
          "body": "That is always a nightmare. I had a teacher bring us cupcakes, and they were fantastic. But, they were strawberry. I had to ask the person across from me if she wanted my strawberry, which was sorta embarrassing, but she didn't mention anything and accepted. This was a tame experience compared to some of the times I've had this happen. \n\nThe worst time I ever had in elementary school was when they started giving us a fresh fruit or vegetable every day. We weren't ever forced to eat them but come on, we were forced to eat them. Anyway, yeah that is the worst.",
          "created_utc": 1581633372.0
        },
        {
          "id": "m713m2c",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1736820854.0
        },
        {
          "id": "m718cbi",
          "author": "Singitqueen",
          "body": "I was like 8 bro. Are you like, okay? You're acting like I personally wrote an angry letter to you because you were the one who made me eat the food 15 years ago. \n\nSorry man, I'll go back and tell little autistic 8 year old me to suck it up and... DON'T try the food? Hmm. I'm at a loss. Anyway I also wrote this 4 years ago. What are you doing here? What did you Google to find my comment just to complain about it?",
          "created_utc": 1736822362.0
        },
        {
          "id": "m72h7bs",
          "author": "SnakeItch",
          "body": "No one made you eat anything 😭 they handed out food you could have rejected. Stop trying to change the story that YOU TOLD to fit your own delusion lmao. And don't use autism as an excuse to write this obnoxious story probably 12 years later. You were too scared to say no to simple food and tried everything, and failed, to make it seem they shoved food down your throat when they just handed it out.",
          "created_utc": 1736843038.0
        },
        {
          "id": "m72jvyl",
          "author": "Singitqueen",
          "body": "'obnoxious' okay buster. You got me! They didn't force me to eat the food! \n\nMaybe get off reddit if you're this upset over a 4 year old comment about a story of me not liking broccoli and feeling peer pressured as a child. Go outside, see the sun. Speak to someone. Maybe a therapist.",
          "created_utc": 1736844805.0
        },
        {
          "id": "m72k9b5",
          "author": "SnakeItch",
          "body": "That's how lame and obnoxious your story was. It warranted a hate comment 5 years into the future.\n\nI'm not upset over your peer pressured 8 year old self (also why are you claiming you were 4 in elementary school??? stick with one story). \n\nIf I were upset over anything though, it'd be how obnoxious you are and the lack of growth. You didn't grow at all and from the implications through your comments, you still have the awful mentality of being catered to. You blame others for your own faults, holding no responsibility for problems you cause for yourself. I can tell that carried onto your adult life.\n\nGrow up honestly, it's genuinely pathetic.",
          "created_utc": 1736845053.0
        },
        {
          "id": "m72kdi0",
          "author": "Singitqueen",
          "body": "Bro cannot read",
          "created_utc": 1736845130.0
        },
        {
          "id": "m72ky19",
          "author": "SnakeItch",
          "body": "Lil bro can't stick with 1 story",
          "created_utc": 1736845511.0
        },
        {
          "id": "m72l3ak",
          "author": "Singitqueen",
          "body": "Whatever you say bestie. Figured I'd point out the 4 years ago thing was literally because my original comment is 4 years old. Genius. \n\nAnyway continue your crash out or don't, I don't care. Hope you learn and grow and find happiness someday.",
          "created_utc": 1736845607.0
        }
      ]
    },
    {
      "id": "l641zh8",
      "author": "zellymon",
      "body": "Soft ass nigga",
      "created_utc": 1716946360.0,
      "score": 1,
      "context": [
        {
          "id": "fhih911",
          "author": "The1579",
          "body": ">So why do they try to force *us* to eat things?\n\nAre people really doing this? Sounds like a crime to me.",
          "created_utc": 1581624715.0
        },
        {
          "id": "fhilz4e",
          "author": "DifferentIsPossble",
          "body": "Yup. Ever seen parents of a picky eater? They show off and brag about how they're tough on their kids.",
          "created_utc": 1581627342.0
        },
        {
          "id": "fhinq5g",
          "author": "The1579",
          "body": "Yeah, I'm the parent of a picky eater.\n\nHowever, OP mentioned that they are not a child but references some group of people \"forcing\" another group of people to do something.\n\nMy comment was mostly tongue-in-cheek, as I highly doubt some band of miscreants is traveling the planet shoving food into unwanting people's mouths.",
          "created_utc": 1581628315.0
        },
        {
          "id": "fhioju2",
          "author": "miss--diagnosed",
          "body": "Notice the word \"try\". I didn't say anyone was literally forcing us to eat things we don't want to, though there certainly are in the case children and teenagers.",
          "created_utc": 1581628770.0
        },
        {
          "id": "fhjeeok",
          "author": "The1579",
          "body": "I’m asking, as an adult, how has someone tried to force you to eat something?\n\nFor instance, a person could try to force their way into your house by prying at your door. \n\nHow, specifically, has some tried to “force” you to eat something as an adult?\n\nI ask because I think “force” denotes a use of physical strength or threat of violence. That’s literally the definition.",
          "created_utc": 1581644137.0
        },
        {
          "id": "fhjg5qa",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1581645382.0
        },
        {
          "id": "fhjg9ij",
          "author": "The1579",
          "body": "Okay, that’s what I thought. No actual use or threat of force. \n\nThat’s good. I can’t imagine how awful that would be.",
          "created_utc": 1581645456.0
        },
        {
          "id": "fhjgk8g",
          "author": "ohhyouknow",
          "body": "Abuse is abuse. Threatening/forcing people to do things with psychological abuse is abuse. It's horrifying no matter how you put it.",
          "created_utc": 1581645669.0
        },
        {
          "id": "fhjgqka",
          "author": "The1579",
          "body": "No doubt, but tiers do exist. It’s like saying “a lie is a lie.” That’s true, but there’s a difference between lying about a murder and lying about how big of a fish you caught. \n\nThat’s why the imagery of “forcing” someone to eat was alarming to me.",
          "created_utc": 1581645792.0
        },
        {
          "id": "ka9riqj",
          "author": "SnekkinHell",
          "body": "Lmao I know it's been 3 years but of course you're a fucking cop.",
          "created_utc": 1700635939.0
        }
      ]
    },
    {
      "id": "l64br6q",
      "author": "SnekkinHell",
      "body": "K",
      "created_utc": 1716950310.0,
      "score": 1,
      "context": [
        {
          "id": "fhih911",
          "author": "The1579",
          "body": ">So why do they try to force *us* to eat things?\n\nAre people really doing this? Sounds like a crime to me.",
          "created_utc": 1581624715.0
        },
        {
          "id": "fhilz4e",
          "author": "DifferentIsPossble",
          "body": "Yup. Ever seen parents of a picky eater? They show off and brag about how they're tough on their kids.",
          "created_utc": 1581627342.0
        },
        {
          "id": "fhinq5g",
          "author": "The1579",
          "body": "Yeah, I'm the parent of a picky eater.\n\nHowever, OP mentioned that they are not a child but references some group of people \"forcing\" another group of people to do something.\n\nMy comment was mostly tongue-in-cheek, as I highly doubt some band of miscreants is traveling the planet shoving food into unwanting people's mouths.",
          "created_utc": 1581628315.0
        },
        {
          "id": "fhioju2",
          "author": "miss--diagnosed",
          "body": "Notice the word \"try\". I didn't say anyone was literally forcing us to eat things we don't want to, though there certainly are in the case children and teenagers.",
          "created_utc": 1581628770.0
        },
        {
          "id": "fhjeeok",
          "author": "The1579",
          "body": "I’m asking, as an adult, how has someone tried to force you to eat something?\n\nFor instance, a person could try to force their way into your house by prying at your door. \n\nHow, specifically, has some tried to “force” you to eat something as an adult?\n\nI ask because I think “force” denotes a use of physical strength or threat of violence. That’s literally the definition.",
          "created_utc": 1581644137.0
        },
        {
          "id": "fhjg5qa",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1581645382.0
        },
        {
          "id": "fhjg9ij",
          "author": "The1579",
          "body": "Okay, that’s what I thought. No actual use or threat of force. \n\nThat’s good. I can’t imagine how awful that would be.",
          "created_utc": 1581645456.0
        },
        {
          "id": "fhjgk8g",
          "author": "ohhyouknow",
          "body": "Abuse is abuse. Threatening/forcing people to do things with psychological abuse is abuse. It's horrifying no matter how you put it.",
          "created_utc": 1581645669.0
        },
        {
          "id": "fhjgqka",
          "author": "The1579",
          "body": "No doubt, but tiers do exist. It’s like saying “a lie is a lie.” That’s true, but there’s a difference between lying about a murder and lying about how big of a fish you caught. \n\nThat’s why the imagery of “forcing” someone to eat was alarming to me.",
          "created_utc": 1581645792.0
        },
        {
          "id": "ka9riqj",
          "author": "SnekkinHell",
          "body": "Lmao I know it's been 3 years but of course you're a fucking cop.",
          "created_utc": 1700635939.0
        },
        {
          "id": "l641zh8",
          "author": "zellymon",
          "body": "Soft ass nigga",
          "created_utc": 1716946360.0
        }
      ]
    },
    {
      "id": "l64skln",
      "author": "zellymon",
      "body": "Glad you accepted it nigga",
      "created_utc": 1716958385.0,
      "score": 1,
      "context": [
        {
          "id": "fhih911",
          "author": "The1579",
          "body": ">So why do they try to force *us* to eat things?\n\nAre people really doing this? Sounds like a crime to me.",
          "created_utc": 1581624715.0
        },
        {
          "id": "fhilz4e",
          "author": "DifferentIsPossble",
          "body": "Yup. Ever seen parents of a picky eater? They show off and brag about how they're tough on their kids.",
          "created_utc": 1581627342.0
        },
        {
          "id": "fhinq5g",
          "author": "The1579",
          "body": "Yeah, I'm the parent of a picky eater.\n\nHowever, OP mentioned that they are not a child but references some group of people \"forcing\" another group of people to do something.\n\nMy comment was mostly tongue-in-cheek, as I highly doubt some band of miscreants is traveling the planet shoving food into unwanting people's mouths.",
          "created_utc": 1581628315.0
        },
        {
          "id": "fhioju2",
          "author": "miss--diagnosed",
          "body": "Notice the word \"try\". I didn't say anyone was literally forcing us to eat things we don't want to, though there certainly are in the case children and teenagers.",
          "created_utc": 1581628770.0
        },
        {
          "id": "fhjeeok",
          "author": "The1579",
          "body": "I’m asking, as an adult, how has someone tried to force you to eat something?\n\nFor instance, a person could try to force their way into your house by prying at your door. \n\nHow, specifically, has some tried to “force” you to eat something as an adult?\n\nI ask because I think “force” denotes a use of physical strength or threat of violence. That’s literally the definition.",
          "created_utc": 1581644137.0
        },
        {
          "id": "fhjg5qa",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1581645382.0
        },
        {
          "id": "fhjg9ij",
          "author": "The1579",
          "body": "Okay, that’s what I thought. No actual use or threat of force. \n\nThat’s good. I can’t imagine how awful that would be.",
          "created_utc": 1581645456.0
        },
        {
          "id": "fhjgk8g",
          "author": "ohhyouknow",
          "body": "Abuse is abuse. Threatening/forcing people to do things with psychological abuse is abuse. It's horrifying no matter how you put it.",
          "created_utc": 1581645669.0
        },
        {
          "id": "fhjgqka",
          "author": "The1579",
          "body": "No doubt, but tiers do exist. It’s like saying “a lie is a lie.” That’s true, but there’s a difference between lying about a murder and lying about how big of a fish you caught. \n\nThat’s why the imagery of “forcing” someone to eat was alarming to me.",
          "created_utc": 1581645792.0
        },
        {
          "id": "ka9riqj",
          "author": "SnekkinHell",
          "body": "Lmao I know it's been 3 years but of course you're a fucking cop.",
          "created_utc": 1700635939.0
        },
        {
          "id": "l641zh8",
          "author": "zellymon",
          "body": "Soft ass nigga",
          "created_utc": 1716946360.0
        },
        {
          "id": "l64br6q",
          "author": "SnekkinHell",
          "body": "K",
          "created_utc": 1716950310.0
        }
      ]
    },
    {
      "id": "l64smng",
      "author": "SnekkinHell",
      "body": "Cooooool",
      "created_utc": 1716958417.0,
      "score": 1,
      "context": [
        {
          "id": "fhih911",
          "author": "The1579",
          "body": ">So why do they try to force *us* to eat things?\n\nAre people really doing this? Sounds like a crime to me.",
          "created_utc": 1581624715.0
        },
        {
          "id": "fhilz4e",
          "author": "DifferentIsPossble",
          "body": "Yup. Ever seen parents of a picky eater? They show off and brag about how they're tough on their kids.",
          "created_utc": 1581627342.0
        },
        {
          "id": "fhinq5g",
          "author": "The1579",
          "body": "Yeah, I'm the parent of a picky eater.\n\nHowever, OP mentioned that they are not a child but references some group of people \"forcing\" another group of people to do something.\n\nMy comment was mostly tongue-in-cheek, as I highly doubt some band of miscreants is traveling the planet shoving food into unwanting people's mouths.",
          "created_utc": 1581628315.0
        },
        {
          "id": "fhioju2",
          "author": "miss--diagnosed",
          "body": "Notice the word \"try\". I didn't say anyone was literally forcing us to eat things we don't want to, though there certainly are in the case children and teenagers.",
          "created_utc": 1581628770.0
        },
        {
          "id": "fhjeeok",
          "author": "The1579",
          "body": "I’m asking, as an adult, how has someone tried to force you to eat something?\n\nFor instance, a person could try to force their way into your house by prying at your door. \n\nHow, specifically, has some tried to “force” you to eat something as an adult?\n\nI ask because I think “force” denotes a use of physical strength or threat of violence. That’s literally the definition.",
          "created_utc": 1581644137.0
        },
        {
          "id": "fhjg5qa",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1581645382.0
        },
        {
          "id": "fhjg9ij",
          "author": "The1579",
          "body": "Okay, that’s what I thought. No actual use or threat of force. \n\nThat’s good. I can’t imagine how awful that would be.",
          "created_utc": 1581645456.0
        },
        {
          "id": "fhjgk8g",
          "author": "ohhyouknow",
          "body": "Abuse is abuse. Threatening/forcing people to do things with psychological abuse is abuse. It's horrifying no matter how you put it.",
          "created_utc": 1581645669.0
        },
        {
          "id": "fhjgqka",
          "author": "The1579",
          "body": "No doubt, but tiers do exist. It’s like saying “a lie is a lie.” That’s true, but there’s a difference between lying about a murder and lying about how big of a fish you caught. \n\nThat’s why the imagery of “forcing” someone to eat was alarming to me.",
          "created_utc": 1581645792.0
        },
        {
          "id": "ka9riqj",
          "author": "SnekkinHell",
          "body": "Lmao I know it's been 3 years but of course you're a fucking cop.",
          "created_utc": 1700635939.0
        },
        {
          "id": "l641zh8",
          "author": "zellymon",
          "body": "Soft ass nigga",
          "created_utc": 1716946360.0
        },
        {
          "id": "l64br6q",
          "author": "SnekkinHell",
          "body": "K",
          "created_utc": 1716950310.0
        },
        {
          "id": "l64skln",
          "author": "zellymon",
          "body": "Glad you accepted it nigga",
          "created_utc": 1716958385.0
        }
      ]
    },
    {
      "id": "l64t3ns",
      "author": "zellymon",
      "body": "Bum",
      "created_utc": 1716958690.0,
      "score": 1,
      "context": [
        {
          "id": "fhih911",
          "author": "The1579",
          "body": ">So why do they try to force *us* to eat things?\n\nAre people really doing this? Sounds like a crime to me.",
          "created_utc": 1581624715.0
        },
        {
          "id": "fhilz4e",
          "author": "DifferentIsPossble",
          "body": "Yup. Ever seen parents of a picky eater? They show off and brag about how they're tough on their kids.",
          "created_utc": 1581627342.0
        },
        {
          "id": "fhinq5g",
          "author": "The1579",
          "body": "Yeah, I'm the parent of a picky eater.\n\nHowever, OP mentioned that they are not a child but references some group of people \"forcing\" another group of people to do something.\n\nMy comment was mostly tongue-in-cheek, as I highly doubt some band of miscreants is traveling the planet shoving food into unwanting people's mouths.",
          "created_utc": 1581628315.0
        },
        {
          "id": "fhioju2",
          "author": "miss--diagnosed",
          "body": "Notice the word \"try\". I didn't say anyone was literally forcing us to eat things we don't want to, though there certainly are in the case children and teenagers.",
          "created_utc": 1581628770.0
        },
        {
          "id": "fhjeeok",
          "author": "The1579",
          "body": "I’m asking, as an adult, how has someone tried to force you to eat something?\n\nFor instance, a person could try to force their way into your house by prying at your door. \n\nHow, specifically, has some tried to “force” you to eat something as an adult?\n\nI ask because I think “force” denotes a use of physical strength or threat of violence. That’s literally the definition.",
          "created_utc": 1581644137.0
        },
        {
          "id": "fhjg5qa",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1581645382.0
        },
        {
          "id": "fhjg9ij",
          "author": "The1579",
          "body": "Okay, that’s what I thought. No actual use or threat of force. \n\nThat’s good. I can’t imagine how awful that would be.",
          "created_utc": 1581645456.0
        },
        {
          "id": "fhjgk8g",
          "author": "ohhyouknow",
          "body": "Abuse is abuse. Threatening/forcing people to do things with psychological abuse is abuse. It's horrifying no matter how you put it.",
          "created_utc": 1581645669.0
        },
        {
          "id": "fhjgqka",
          "author": "The1579",
          "body": "No doubt, but tiers do exist. It’s like saying “a lie is a lie.” That’s true, but there’s a difference between lying about a murder and lying about how big of a fish you caught. \n\nThat’s why the imagery of “forcing” someone to eat was alarming to me.",
          "created_utc": 1581645792.0
        },
        {
          "id": "ka9riqj",
          "author": "SnekkinHell",
          "body": "Lmao I know it's been 3 years but of course you're a fucking cop.",
          "created_utc": 1700635939.0
        },
        {
          "id": "l641zh8",
          "author": "zellymon",
          "body": "Soft ass nigga",
          "created_utc": 1716946360.0
        },
        {
          "id": "l64br6q",
          "author": "SnekkinHell",
          "body": "K",
          "created_utc": 1716950310.0
        },
        {
          "id": "l64skln",
          "author": "zellymon",
          "body": "Glad you accepted it nigga",
          "created_utc": 1716958385.0
        },
        {
          "id": "l64smng",
          "author": "SnekkinHell",
          "body": "Cooooool",
          "created_utc": 1716958417.0
        }
      ]
    },
    {
      "id": "l64tvxe",
      "author": "SnekkinHell",
      "body": "Whatever you say mate\n\nDo you get off insulting strangers on the internet?",
      "created_utc": 1716959153.0,
      "score": 1,
      "context": [
        {
          "id": "fhih911",
          "author": "The1579",
          "body": ">So why do they try to force *us* to eat things?\n\nAre people really doing this? Sounds like a crime to me.",
          "created_utc": 1581624715.0
        },
        {
          "id": "fhilz4e",
          "author": "DifferentIsPossble",
          "body": "Yup. Ever seen parents of a picky eater? They show off and brag about how they're tough on their kids.",
          "created_utc": 1581627342.0
        },
        {
          "id": "fhinq5g",
          "author": "The1579",
          "body": "Yeah, I'm the parent of a picky eater.\n\nHowever, OP mentioned that they are not a child but references some group of people \"forcing\" another group of people to do something.\n\nMy comment was mostly tongue-in-cheek, as I highly doubt some band of miscreants is traveling the planet shoving food into unwanting people's mouths.",
          "created_utc": 1581628315.0
        },
        {
          "id": "fhioju2",
          "author": "miss--diagnosed",
          "body": "Notice the word \"try\". I didn't say anyone was literally forcing us to eat things we don't want to, though there certainly are in the case children and teenagers.",
          "created_utc": 1581628770.0
        },
        {
          "id": "fhjeeok",
          "author": "The1579",
          "body": "I’m asking, as an adult, how has someone tried to force you to eat something?\n\nFor instance, a person could try to force their way into your house by prying at your door. \n\nHow, specifically, has some tried to “force” you to eat something as an adult?\n\nI ask because I think “force” denotes a use of physical strength or threat of violence. That’s literally the definition.",
          "created_utc": 1581644137.0
        },
        {
          "id": "fhjg5qa",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1581645382.0
        },
        {
          "id": "fhjg9ij",
          "author": "The1579",
          "body": "Okay, that’s what I thought. No actual use or threat of force. \n\nThat’s good. I can’t imagine how awful that would be.",
          "created_utc": 1581645456.0
        },
        {
          "id": "fhjgk8g",
          "author": "ohhyouknow",
          "body": "Abuse is abuse. Threatening/forcing people to do things with psychological abuse is abuse. It's horrifying no matter how you put it.",
          "created_utc": 1581645669.0
        },
        {
          "id": "fhjgqka",
          "author": "The1579",
          "body": "No doubt, but tiers do exist. It’s like saying “a lie is a lie.” That’s true, but there’s a difference between lying about a murder and lying about how big of a fish you caught. \n\nThat’s why the imagery of “forcing” someone to eat was alarming to me.",
          "created_utc": 1581645792.0
        },
        {
          "id": "ka9riqj",
          "author": "SnekkinHell",
          "body": "Lmao I know it's been 3 years but of course you're a fucking cop.",
          "created_utc": 1700635939.0
        },
        {
          "id": "l641zh8",
          "author": "zellymon",
          "body": "Soft ass nigga",
          "created_utc": 1716946360.0
        },
        {
          "id": "l64br6q",
          "author": "SnekkinHell",
          "body": "K",
          "created_utc": 1716950310.0
        },
        {
          "id": "l64skln",
          "author": "zellymon",
          "body": "Glad you accepted it nigga",
          "created_utc": 1716958385.0
        },
        {
          "id": "l64smng",
          "author": "SnekkinHell",
          "body": "Cooooool",
          "created_utc": 1716958417.0
        },
        {
          "id": "l64t3ns",
          "author": "zellymon",
          "body": "Bum",
          "created_utc": 1716958690.0
        }
      ]
    },
    {
      "id": "l652p7n",
      "author": "zellymon",
      "body": "I'm not here to have a conversation wit a bum ass nigga",
      "created_utc": 1716964840.0,
      "score": 1,
      "context": [
        {
          "id": "fhih911",
          "author": "The1579",
          "body": ">So why do they try to force *us* to eat things?\n\nAre people really doing this? Sounds like a crime to me.",
          "created_utc": 1581624715.0
        },
        {
          "id": "fhilz4e",
          "author": "DifferentIsPossble",
          "body": "Yup. Ever seen parents of a picky eater? They show off and brag about how they're tough on their kids.",
          "created_utc": 1581627342.0
        },
        {
          "id": "fhinq5g",
          "author": "The1579",
          "body": "Yeah, I'm the parent of a picky eater.\n\nHowever, OP mentioned that they are not a child but references some group of people \"forcing\" another group of people to do something.\n\nMy comment was mostly tongue-in-cheek, as I highly doubt some band of miscreants is traveling the planet shoving food into unwanting people's mouths.",
          "created_utc": 1581628315.0
        },
        {
          "id": "fhioju2",
          "author": "miss--diagnosed",
          "body": "Notice the word \"try\". I didn't say anyone was literally forcing us to eat things we don't want to, though there certainly are in the case children and teenagers.",
          "created_utc": 1581628770.0
        },
        {
          "id": "fhjeeok",
          "author": "The1579",
          "body": "I’m asking, as an adult, how has someone tried to force you to eat something?\n\nFor instance, a person could try to force their way into your house by prying at your door. \n\nHow, specifically, has some tried to “force” you to eat something as an adult?\n\nI ask because I think “force” denotes a use of physical strength or threat of violence. That’s literally the definition.",
          "created_utc": 1581644137.0
        },
        {
          "id": "fhjg5qa",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1581645382.0
        },
        {
          "id": "fhjg9ij",
          "author": "The1579",
          "body": "Okay, that’s what I thought. No actual use or threat of force. \n\nThat’s good. I can’t imagine how awful that would be.",
          "created_utc": 1581645456.0
        },
        {
          "id": "fhjgk8g",
          "author": "ohhyouknow",
          "body": "Abuse is abuse. Threatening/forcing people to do things with psychological abuse is abuse. It's horrifying no matter how you put it.",
          "created_utc": 1581645669.0
        },
        {
          "id": "fhjgqka",
          "author": "The1579",
          "body": "No doubt, but tiers do exist. It’s like saying “a lie is a lie.” That’s true, but there’s a difference between lying about a murder and lying about how big of a fish you caught. \n\nThat’s why the imagery of “forcing” someone to eat was alarming to me.",
          "created_utc": 1581645792.0
        },
        {
          "id": "ka9riqj",
          "author": "SnekkinHell",
          "body": "Lmao I know it's been 3 years but of course you're a fucking cop.",
          "created_utc": 1700635939.0
        },
        {
          "id": "l641zh8",
          "author": "zellymon",
          "body": "Soft ass nigga",
          "created_utc": 1716946360.0
        },
        {
          "id": "l64br6q",
          "author": "SnekkinHell",
          "body": "K",
          "created_utc": 1716950310.0
        },
        {
          "id": "l64skln",
          "author": "zellymon",
          "body": "Glad you accepted it nigga",
          "created_utc": 1716958385.0
        },
        {
          "id": "l64smng",
          "author": "SnekkinHell",
          "body": "Cooooool",
          "created_utc": 1716958417.0
        },
        {
          "id": "l64t3ns",
          "author": "zellymon",
          "body": "Bum",
          "created_utc": 1716958690.0
        },
        {
          "id": "l64tvxe",
          "author": "SnekkinHell",
          "body": "Whatever you say mate\n\nDo you get off insulting strangers on the internet?",
          "created_utc": 1716959153.0
        }
      ]
    },
    {
      "id": "l652un7",
      "author": "SnekkinHell",
      "body": "K pussy",
      "created_utc": 1716964944.0,
      "score": 1,
      "context": [
        {
          "id": "fhih911",
          "author": "The1579",
          "body": ">So why do they try to force *us* to eat things?\n\nAre people really doing this? Sounds like a crime to me.",
          "created_utc": 1581624715.0
        },
        {
          "id": "fhilz4e",
          "author": "DifferentIsPossble",
          "body": "Yup. Ever seen parents of a picky eater? They show off and brag about how they're tough on their kids.",
          "created_utc": 1581627342.0
        },
        {
          "id": "fhinq5g",
          "author": "The1579",
          "body": "Yeah, I'm the parent of a picky eater.\n\nHowever, OP mentioned that they are not a child but references some group of people \"forcing\" another group of people to do something.\n\nMy comment was mostly tongue-in-cheek, as I highly doubt some band of miscreants is traveling the planet shoving food into unwanting people's mouths.",
          "created_utc": 1581628315.0
        },
        {
          "id": "fhioju2",
          "author": "miss--diagnosed",
          "body": "Notice the word \"try\". I didn't say anyone was literally forcing us to eat things we don't want to, though there certainly are in the case children and teenagers.",
          "created_utc": 1581628770.0
        },
        {
          "id": "fhjeeok",
          "author": "The1579",
          "body": "I’m asking, as an adult, how has someone tried to force you to eat something?\n\nFor instance, a person could try to force their way into your house by prying at your door. \n\nHow, specifically, has some tried to “force” you to eat something as an adult?\n\nI ask because I think “force” denotes a use of physical strength or threat of violence. That’s literally the definition.",
          "created_utc": 1581644137.0
        },
        {
          "id": "fhjg5qa",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1581645382.0
        },
        {
          "id": "fhjg9ij",
          "author": "The1579",
          "body": "Okay, that’s what I thought. No actual use or threat of force. \n\nThat’s good. I can’t imagine how awful that would be.",
          "created_utc": 1581645456.0
        },
        {
          "id": "fhjgk8g",
          "author": "ohhyouknow",
          "body": "Abuse is abuse. Threatening/forcing people to do things with psychological abuse is abuse. It's horrifying no matter how you put it.",
          "created_utc": 1581645669.0
        },
        {
          "id": "fhjgqka",
          "author": "The1579",
          "body": "No doubt, but tiers do exist. It’s like saying “a lie is a lie.” That’s true, but there’s a difference between lying about a murder and lying about how big of a fish you caught. \n\nThat’s why the imagery of “forcing” someone to eat was alarming to me.",
          "created_utc": 1581645792.0
        },
        {
          "id": "ka9riqj",
          "author": "SnekkinHell",
          "body": "Lmao I know it's been 3 years but of course you're a fucking cop.",
          "created_utc": 1700635939.0
        },
        {
          "id": "l641zh8",
          "author": "zellymon",
          "body": "Soft ass nigga",
          "created_utc": 1716946360.0
        },
        {
          "id": "l64br6q",
          "author": "SnekkinHell",
          "body": "K",
          "created_utc": 1716950310.0
        },
        {
          "id": "l64skln",
          "author": "zellymon",
          "body": "Glad you accepted it nigga",
          "created_utc": 1716958385.0
        },
        {
          "id": "l64smng",
          "author": "SnekkinHell",
          "body": "Cooooool",
          "created_utc": 1716958417.0
        },
        {
          "id": "l64t3ns",
          "author": "zellymon",
          "body": "Bum",
          "created_utc": 1716958690.0
        },
        {
          "id": "l64tvxe",
          "author": "SnekkinHell",
          "body": "Whatever you say mate\n\nDo you get off insulting strangers on the internet?",
          "created_utc": 1716959153.0
        },
        {
          "id": "l652p7n",
          "author": "zellymon",
          "body": "I'm not here to have a conversation wit a bum ass nigga",
          "created_utc": 1716964840.0
        }
      ]
    },
    {
      "id": "l67e09g",
      "author": "zellymon",
      "body": "K bitch ass nigga",
      "created_utc": 1717004660.0,
      "score": 1,
      "context": [
        {
          "id": "fhih911",
          "author": "The1579",
          "body": ">So why do they try to force *us* to eat things?\n\nAre people really doing this? Sounds like a crime to me.",
          "created_utc": 1581624715.0
        },
        {
          "id": "fhilz4e",
          "author": "DifferentIsPossble",
          "body": "Yup. Ever seen parents of a picky eater? They show off and brag about how they're tough on their kids.",
          "created_utc": 1581627342.0
        },
        {
          "id": "fhinq5g",
          "author": "The1579",
          "body": "Yeah, I'm the parent of a picky eater.\n\nHowever, OP mentioned that they are not a child but references some group of people \"forcing\" another group of people to do something.\n\nMy comment was mostly tongue-in-cheek, as I highly doubt some band of miscreants is traveling the planet shoving food into unwanting people's mouths.",
          "created_utc": 1581628315.0
        },
        {
          "id": "fhioju2",
          "author": "miss--diagnosed",
          "body": "Notice the word \"try\". I didn't say anyone was literally forcing us to eat things we don't want to, though there certainly are in the case children and teenagers.",
          "created_utc": 1581628770.0
        },
        {
          "id": "fhjeeok",
          "author": "The1579",
          "body": "I’m asking, as an adult, how has someone tried to force you to eat something?\n\nFor instance, a person could try to force their way into your house by prying at your door. \n\nHow, specifically, has some tried to “force” you to eat something as an adult?\n\nI ask because I think “force” denotes a use of physical strength or threat of violence. That’s literally the definition.",
          "created_utc": 1581644137.0
        },
        {
          "id": "fhjg5qa",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1581645382.0
        },
        {
          "id": "fhjg9ij",
          "author": "The1579",
          "body": "Okay, that’s what I thought. No actual use or threat of force. \n\nThat’s good. I can’t imagine how awful that would be.",
          "created_utc": 1581645456.0
        },
        {
          "id": "fhjgk8g",
          "author": "ohhyouknow",
          "body": "Abuse is abuse. Threatening/forcing people to do things with psychological abuse is abuse. It's horrifying no matter how you put it.",
          "created_utc": 1581645669.0
        },
        {
          "id": "fhjgqka",
          "author": "The1579",
          "body": "No doubt, but tiers do exist. It’s like saying “a lie is a lie.” That’s true, but there’s a difference between lying about a murder and lying about how big of a fish you caught. \n\nThat’s why the imagery of “forcing” someone to eat was alarming to me.",
          "created_utc": 1581645792.0
        },
        {
          "id": "ka9riqj",
          "author": "SnekkinHell",
          "body": "Lmao I know it's been 3 years but of course you're a fucking cop.",
          "created_utc": 1700635939.0
        },
        {
          "id": "l641zh8",
          "author": "zellymon",
          "body": "Soft ass nigga",
          "created_utc": 1716946360.0
        },
        {
          "id": "l64br6q",
          "author": "SnekkinHell",
          "body": "K",
          "created_utc": 1716950310.0
        },
        {
          "id": "l64skln",
          "author": "zellymon",
          "body": "Glad you accepted it nigga",
          "created_utc": 1716958385.0
        },
        {
          "id": "l64smng",
          "author": "SnekkinHell",
          "body": "Cooooool",
          "created_utc": 1716958417.0
        },
        {
          "id": "l64t3ns",
          "author": "zellymon",
          "body": "Bum",
          "created_utc": 1716958690.0
        },
        {
          "id": "l64tvxe",
          "author": "SnekkinHell",
          "body": "Whatever you say mate\n\nDo you get off insulting strangers on the internet?",
          "created_utc": 1716959153.0
        },
        {
          "id": "l652p7n",
          "author": "zellymon",
          "body": "I'm not here to have a conversation wit a bum ass nigga",
          "created_utc": 1716964840.0
        },
        {
          "id": "l652un7",
          "author": "SnekkinHell",
          "body": "K pussy",
          "created_utc": 1716964944.0
        }
      ]
    }
  ]
}