{
  "id": "f7th2l",
  "subreddit": "ARFID",
  "author": "scar12346",
  "created_utc": 1582383039.0,
  "title": "I am really terrified of rotten/moldy food",
  "selftext": "I, ever since I can remember, have always been afraid of rotten food. Milk expires in a day? Trash it its already bad. That chicken/beef have been sitting for a second day in the fridge uncooked? Spoiled. It has been cooked? No matter too bad I didn't eat it. Cheese has a moldy dot? That's been contaminated. Raw eggs? It's all mold on the inside after 5 days. That mentality kind of got me into my ed's I would either overeat so that I don't throw away, or I wouldn't eat until it was brought new.\nI once let a glass with a bit of juice in it and it had grown mold, I threw that glass away. Even thinking about it sends shivers. I would at times only eat fresh veggies and fruits because I am afraid that when I open my fridge it would just have mold in it.\n\nMy childhood was fine, nothing bad concerning food. My mam always provided at least something for us. Didn't have filled fridge but there was always something to eat.\n\nSomeone else experienced that? My heart is pounding even by thinking about it.",
  "url": "https://www.reddit.com/r/ARFID/comments/f7th2l/i_am_really_terrified_of_rottenmoldy_food/",
  "score": 102,
  "num_comments": 21,
  "comments": [
    {
      "id": "figzk14",
      "author": "orvilleredenbachers",
      "body": "I'm in the exact same boat. Doesn't matter if it's the best by date or the sell by date. And if there's a misprint and I can't read the date it gets pitched immediately. The only time I don't check is if I'm eating it immediately after leaving the store and even then... I also won't eat any leftovers for that reason. Can't tell the expiry date by looking at a number? Trash. It really sucks because sell-by is for stores to get rid of still-good food and encourage product rotation and best-by is to get consumers to throw away perfectly fine food. Even that knowledge doesn't help me personally.",
      "created_utc": 1582404903.0,
      "score": 25,
      "context": []
    },
    {
      "id": "fihl7f0",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1582411596.0,
      "score": 13,
      "context": []
    },
    {
      "id": "fih8fn5",
      "author": "asleepunderthebridge",
      "body": "This is the exact same thing as me. I don’t understand it and I hate it. I’m so glad I’m not the only one!",
      "created_utc": 1582407641.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fihquzs",
      "author": "FiendFyreFox",
      "body": "I too get scared about spoiled food, I’ve had my fair share of accidentally eating moldy cheese or finding ants in my cereal. \n\nThe one thing I do try to bear in mind is that best by or sell by dates on produce are so ridiculously conservative as to be almost meaningless. Unless you leave milk sitting at room temperature it isn’t going to make you sick despite what the date on the carton says. An astonishing amount of good food is wasted every day just because some companies wanted to avoid legal trouble.",
      "created_utc": 1582413204.0,
      "score": 6,
      "context": []
    },
    {
      "id": "fii5n2e",
      "author": "Luai_lashire",
      "body": "I don't have it this bad, but yeah.  I definitely get rid of things before they're actually bad, especially produce, and if I'm too anxious about the possibility that something's gone bad it doesn't matter one bit if there's no signs, it will put me off eating.  Actually seeing some mold or bugs can make it almost impossible to eat for the rest of the day.  Makes me feel very guilty about waste, too.  I have to buy so much more food than I will actually eat, because I will have to toss it when I haven't finished it \"in time\".\n\nFor what it's worth, the \"official\" term I've heard for this is contamination phobia.  Looking that up should help you find some more resources aimed at coping with it.",
      "created_utc": 1582417675.0,
      "score": 6,
      "context": []
    },
    {
      "id": "fiii7tl",
      "author": "None",
      "body": "My life. I avoid the refrigerator because it had gotten a little dirty and there were containers that needed to be thrown away. I'd rather starve than eat anything from that fridge.",
      "created_utc": 1582421935.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fijjhz1",
      "author": "axw3555",
      "body": "Same. If I think a loaf of bread's a bit too dry, even if I bought it two hours ago and its date is 4 days away, I won't touch it. Same goes for most foods, if there's something off, I'm done.",
      "created_utc": 1582450895.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fj8ma7i",
      "author": "HLW10",
      "body": "I find the website stilltasty.com helpful for things that don’t have dates printed on them e.g. cooked food.",
      "created_utc": 1583116714.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fihkymq",
      "author": "None",
      "body": "Me too.",
      "created_utc": 1582411496.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fimmozb",
      "author": "WeLikeHappy",
      "body": "Have you seen the new Burger King Whopper ad?",
      "created_utc": 1582537431.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lw6ydey",
      "author": "daddysgoodlittlebrat",
      "body": "I’ve had a complete mental breakdown tonight as I ate my safe food, plums, but after 3 I realised one was rotten and I just cant. Not just the contamination, but my ocd can’t cope with the odd number, and then you have my ED kicking in with trying to make the taste go away. This is insanity.",
      "created_utc": 1731121447.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fihtvq0",
      "author": "rosesandboneses",
      "body": "Same! People think I’m so wasteful but I just can’t, even if it’s a soda once it’s warm and I stop drinking it it’s bad",
      "created_utc": 1582414052.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l5c5ir3",
      "author": "Personal_Lettuce_412",
      "body": "Ik this is late but thought I’d share, it’s gotten so bad for me that I’m tasting mold in the food I have, if it’s bread it’s moldy and there is nothing I can do to tell my brain otherwise, it’s upsetting that I need to pick apart the bread to ‘get out any mold spots’ because I know I look fucking crazy doing it, and I’m scared cus I will eventually end up eating something moldy but forcing my way thru it cus every bread tastes moldy to me. I still eat the bread after a while of working on those fears but there is still alot of picking and prodding and I think seeing actual mold on bread would horrify me out of eating it again, but moldy bread is super common and happens all the time so idk what I’d do when I encounter that. I wish I could accurately smell and taste things so I could just trust my sences",
      "created_utc": 1716478977.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lhdvto9",
      "author": "Annual_Newspaper_326",
      "body": "Honestly, I'm terrified of mold in drinks and in food. Looking at it sends me into a coughing fit, and I almost end up vomiting every time.\n\nI have a bad habit of leaving coffee mugs around the house, I don't know why. Maybe it's pure laziness, or I just forget. My husband usually takes care of my coffee cup conundrum, I don't leave them out all the time, I'm usually aware and take them straight to the sink/dishwasher, but on occasion there'll be a loose coffee cup hiding somewhere. \n\nToday, I found said hidden coffee cup. It had mold in it, and as hard as I tried not to gag or look at it, I still ended up in a coughing fit, tears running down my face and feeling the need to vomit. Luckily, I got it to the kitchen and poured it out and put it away, but I couldn't help but cry after. \n\nI can't stand the sight of mold on food or in drinks, if I see something has mold in it, I feel the need to put gloves on, even though it most likely wouldn't get on me in the first place. \n\nI'm ok with leftovers depending on what it is, after 2days in the fridge I don't want to look at it or touch it, the thought of cleaning the pot, bowl or plate that had food in it/on it makes me want to throw up. I can't help but gag and have to leave the room. \n\nThese things have caused me great distress in my life, and sometimes, it causes problems between me and my husband.\n\nToday was a huge accomplishment for me though, even though I gagged and cried, I managed to put the coffee cup away in the dishwasher. I usually wouldn't be able to do that much, but I'm proud of myself.",
      "created_utc": 1723260767.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ice47tb",
      "author": "chloe-dino",
      "body": "Same",
      "created_utc": 1655249817.0,
      "score": 1,
      "context": []
    },
    {
      "id": "id6uzu7",
      "author": "Universal-Krogoth",
      "body": "I am in a Different and Opposite Boat and Situation of a Serious Fear of Mine with Rotten/Moldy, Decaying and Decomposition Foods and Liquids.\n\nIn No Matter of How Much and Many Times that Any Rotten/Moldy, Decaying and Decomposition Foods or Liquids is Just Way Too Closely Physically around Me in Person by Face to Face is I Do Always Become Just Way Too Physically Ill, Sick and Unwell, And Feel Like that I am Going to Throw-up and Vomit.\n\nEven Just Thinking about Any Rotten/Moldy, Decaying and Decomposition Foods or Liquids does still Always Causes for Me to Become Just Way Too Physically Ill, Sick and Unwell, And Feel Like that I am Going to Throw-up and Vomit.",
      "created_utc": 1655824382.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fihu6l9",
      "author": "whateverusername999",
      "body": "Same. I feel horrible about wasting so much food. Can’t eat left overs... pizza refrigerated 1 day is maybe the only thing I’ll eat.",
      "created_utc": 1582414158.0,
      "score": 7,
      "context": [
        {
          "id": "figzk14",
          "author": "orvilleredenbachers",
          "body": "I'm in the exact same boat. Doesn't matter if it's the best by date or the sell by date. And if there's a misprint and I can't read the date it gets pitched immediately. The only time I don't check is if I'm eating it immediately after leaving the store and even then... I also won't eat any leftovers for that reason. Can't tell the expiry date by looking at a number? Trash. It really sucks because sell-by is for stores to get rid of still-good food and encourage product rotation and best-by is to get consumers to throw away perfectly fine food. Even that knowledge doesn't help me personally.",
          "created_utc": 1582404903.0
        }
      ]
    },
    {
      "id": "fii0qzi",
      "author": "sleepy-girl29",
      "body": "I feel you, i can rarely drink from soda cans or cups because i’m always too paranoid that a bug is going to crawl in and i’ll drink it. \n\nAlso this might sound weird, but i’m scared of using my ice machine too. One time i was getting ice from the ice dispenser on my fridge and a totinos pizza roll came out and landed in my cup.",
      "created_utc": 1582416037.0,
      "score": 4,
      "context": [
        {
          "id": "fihl7f0",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1582411596.0
        }
      ]
    },
    {
      "id": "fij8h7n",
      "author": "scar12346",
      "body": "Thank you for putting a name to it and sharing",
      "created_utc": 1582437726.0,
      "score": 2,
      "context": [
        {
          "id": "fii5n2e",
          "author": "Luai_lashire",
          "body": "I don't have it this bad, but yeah.  I definitely get rid of things before they're actually bad, especially produce, and if I'm too anxious about the possibility that something's gone bad it doesn't matter one bit if there's no signs, it will put me off eating.  Actually seeing some mold or bugs can make it almost impossible to eat for the rest of the day.  Makes me feel very guilty about waste, too.  I have to buy so much more food than I will actually eat, because I will have to toss it when I haven't finished it \"in time\".\n\nFor what it's worth, the \"official\" term I've heard for this is contamination phobia.  Looking that up should help you find some more resources aimed at coping with it.",
          "created_utc": 1582417675.0
        }
      ]
    },
    {
      "id": "fimxppe",
      "author": "scar12346",
      "body": "I just searched it up cus I don't watch the telly and oh my world did that make me want to barf. Honestly just by that alone I am never fucking eating a burger because that image will be the thing that I think of when I want a burger",
      "created_utc": 1582550355.0,
      "score": 2,
      "context": [
        {
          "id": "fimmozb",
          "author": "WeLikeHappy",
          "body": "Have you seen the new Burger King Whopper ad?",
          "created_utc": 1582537431.0
        }
      ]
    },
    {
      "id": "fiudh9k",
      "author": "CadetMeow",
      "body": "Idk totinos from a ice machine sounds like a gift from god himself",
      "created_utc": 1582739334.0,
      "score": 1,
      "context": [
        {
          "id": "fihl7f0",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1582411596.0
        },
        {
          "id": "fii0qzi",
          "author": "sleepy-girl29",
          "body": "I feel you, i can rarely drink from soda cans or cups because i’m always too paranoid that a bug is going to crawl in and i’ll drink it. \n\nAlso this might sound weird, but i’m scared of using my ice machine too. One time i was getting ice from the ice dispenser on my fridge and a totinos pizza roll came out and landed in my cup.",
          "created_utc": 1582416037.0
        }
      ]
    }
  ]
}