{
  "id": "fa3wxw",
  "subreddit": "ARFID",
  "author": "None",
  "created_utc": 1582765626.0,
  "title": "I tried Mac & Cheese!",
  "selftext": "I have SUCH an aversion for soft foods, and quite the big hatred for pasta in general ... but there was something about Mac and cheese that just made me want to try it at least once. Maybe it’s the fact that there was cheese involved, and I like cheese? The fact that it seems to be literally everyone’s comfort food? I don’t know. Whatever the reason is, I still couldn’t make myself take the leap and make a pot of Mac and cheese. But I recently got a dental procedure done where I need to eat soft foods (cue me, looking at a list of foods I can eat for the time being and struggling to find more than one) so my boyfriend and I went to the store and decided that it was time. Knowing that he would eat it if I didn’t like it definitely helped me overcome the fear, and also the fact that I got to stand there and make it with him. \n\nI took it one noodle at a time and wasn’t sure how I felt about it at first, I continued to pick at it periodically and decided that it was okay! I liked it. It was bland (it was Kraft, but unseasoned) which pushed me away from eating bigger bites but it wasn’t bad! \n\nToday, I went to the grocery store and bought more of the same kind I ate yesterday. I made it (and screwed up the ratio of milk to noodle and almost scrapped the whole pot), added salt, pepper, Italian seasoning and garlic powder .. and also a few different kinds of shredded cheese along with the packet it came with to try and personalize the taste and make it less bland. It worked! I’m currently eating full bites of it because it tastes so good. I’m thinking next time I’ll turn the cheese blend into more of a sauce so that it melts better but I think this is how I’ll be making Mac and cheese from now on. Cause I’m going to be eating it, for sure! I’m so proud of myself.",
  "url": "https://www.reddit.com/r/ARFID/comments/fa3wxw/i_tried_mac_cheese/",
  "score": 97,
  "num_comments": 16,
  "comments": [
    {
      "id": "fivrgey",
      "author": "NikkiAnonymous",
      "body": "Congratulations! Well done for giving it a red hot go!  \n\n\nHave you considered pumpkin pasta? I made it recently and it is a similar texture to mac and cheese, but the sauce is blended pumpkin, and cream. This would be an excellent way to get some nutrients in! No pressure at all - just a suggestion. But if you're keen let me know and I will send you a recipe.",
      "created_utc": 1582766393.0,
      "score": 10,
      "context": []
    },
    {
      "id": "fiw3ryn",
      "author": "None",
      "body": "Congrats! Mac and cheese is like 85% of my diet lol. Breadcrumbs on it are really good too. Gives it a nice crunch!",
      "created_utc": 1582774473.0,
      "score": 12,
      "context": []
    },
    {
      "id": "fivrhr4",
      "author": "Cephalophore",
      "body": "Congrats! I used to not be able to handle any kind of pasta but when I started eating mac and cheese it opened up a whole new world for me. Now it's probably my favorite food!",
      "created_utc": 1582766418.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fivze5s",
      "author": "None",
      "body": "Good job! Happy for you",
      "created_utc": 1582771517.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fiwgrsx",
      "author": "Shogun2049",
      "body": "If you don't want it as mushy, cook it one minute less than the directions say to.",
      "created_utc": 1582785331.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fiwh2a8",
      "author": "LostArtof33",
      "body": "wait til you try fried mac-n-cheese balls... yummm! It's like a mozzarella stick filled with mac n cheese. :)",
      "created_utc": 1582785653.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fiw7k3c",
      "author": "_deedubbleyew",
      "body": "Congrats!\n\nAlso it’s interesting to see how different everyone’s aversions can be",
      "created_utc": 1582777170.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fiwlsgc",
      "author": "Singitqueen",
      "body": "Highly suggest shells or even simply making your own with the same method. That way you can make your noodles less soft, and you might like the cheese better. \n\nI'm proud that you tried it and proud that you liked it! I hope you find some more foods to eat while you recover, but if not then mac and cheese is perfect!",
      "created_utc": 1582791408.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fiwurg2",
      "author": "RaggedToothRat",
      "body": "Macaroni cheese used to be my go to comfort food until my sister made it mixed with cauliflower pieces because \"you can't taste it and you can't tell it apart from the noodles\". I have had normal macaroni a few times since then but I've lost that easy trust in it.",
      "created_utc": 1582803899.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fix7rce",
      "author": "MythologicalMayhem",
      "body": "Mac and cheese is my fave! In restaurants, they often grill the top so you have nice chewy cheese on the top. 😍 Congrats!",
      "created_utc": 1582814663.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fiwgpg5",
      "author": "None",
      "body": "Thank you! I’m not too keen on the taste of pumpkin if I’m honest, but then again I’ve never actually given it a proper go. So who knows! I’ll have to look into it :)",
      "created_utc": 1582785262.0,
      "score": 5,
      "context": [
        {
          "id": "fivrgey",
          "author": "NikkiAnonymous",
          "body": "Congratulations! Well done for giving it a red hot go!  \n\n\nHave you considered pumpkin pasta? I made it recently and it is a similar texture to mac and cheese, but the sauce is blended pumpkin, and cream. This would be an excellent way to get some nutrients in! No pressure at all - just a suggestion. But if you're keen let me know and I will send you a recipe.",
          "created_utc": 1582766393.0
        }
      ]
    },
    {
      "id": "fiwgl2k",
      "author": "None",
      "body": "Thank you! I’ve read on so many posts here that Mac and Cheese is a lot of people’s staple. I’m interested in trying the oven baked, breadcrumb method eventually. I have a feeling I’ll like it specifically because of the crunch! Lol",
      "created_utc": 1582785132.0,
      "score": 5,
      "context": [
        {
          "id": "fiw3ryn",
          "author": "None",
          "body": "Congrats! Mac and cheese is like 85% of my diet lol. Breadcrumbs on it are really good too. Gives it a nice crunch!",
          "created_utc": 1582774473.0
        }
      ]
    },
    {
      "id": "fiwgn3m",
      "author": "None",
      "body": "Thank you! I have a feeling that this leap into Mac and cheese is gonna open up different pastas for me as well. I guess it’s about getting used to the texture which is a pretty big reason why I have such a hard time eating new foods.",
      "created_utc": 1582785191.0,
      "score": 3,
      "context": [
        {
          "id": "fivrhr4",
          "author": "Cephalophore",
          "body": "Congrats! I used to not be able to handle any kind of pasta but when I started eating mac and cheese it opened up a whole new world for me. Now it's probably my favorite food!",
          "created_utc": 1582766418.0
        }
      ]
    },
    {
      "id": "fiwgfx3",
      "author": "None",
      "body": "Thank you!",
      "created_utc": 1582784980.0,
      "score": 1,
      "context": [
        {
          "id": "fivze5s",
          "author": "None",
          "body": "Good job! Happy for you",
          "created_utc": 1582771517.0
        }
      ]
    },
    {
      "id": "fiwgilz",
      "author": "None",
      "body": "Thanks! And I agree. It’s so crazy to me to read about someone who hates crunchy foods, since I can only really eat crunchier foods without problems. I guess that shows how personalized ARFID can be.",
      "created_utc": 1582785060.0,
      "score": 2,
      "context": [
        {
          "id": "fiw7k3c",
          "author": "_deedubbleyew",
          "body": "Congrats!\n\nAlso it’s interesting to see how different everyone’s aversions can be",
          "created_utc": 1582777170.0
        }
      ]
    },
    {
      "id": "fiytz2x",
      "author": "None",
      "body": "Yessssss you’re gonna love that. Oven baked 100% is the best way to eat Mac n cheese!",
      "created_utc": 1582846899.0,
      "score": 2,
      "context": [
        {
          "id": "fiw3ryn",
          "author": "None",
          "body": "Congrats! Mac and cheese is like 85% of my diet lol. Breadcrumbs on it are really good too. Gives it a nice crunch!",
          "created_utc": 1582774473.0
        },
        {
          "id": "fiwgl2k",
          "author": "None",
          "body": "Thank you! I’ve read on so many posts here that Mac and Cheese is a lot of people’s staple. I’m interested in trying the oven baked, breadcrumb method eventually. I have a feeling I’ll like it specifically because of the crunch! Lol",
          "created_utc": 1582785132.0
        }
      ]
    }
  ]
}