{
  "id": "fme895",
  "subreddit": "ARFID",
  "author": "None",
  "created_utc": 1584793732.0,
  "title": "Anyone else just kinda forget about eating sometimes?",
  "selftext": "I’ll go like a whole day then at like 8 be like “oh wait I didn’t eat anything today.”  It’s not like a purposeful avoiding, but just like it’s never on the top of my list of important things I need to do, so I may be at home but not think of it, or running around and it doesn’t cross my mind.  Does this happen to anyone else?",
  "url": "https://www.reddit.com/r/ARFID/comments/fme895/anyone_else_just_kinda_forget_about_eating/",
  "score": 111,
  "num_comments": 18,
  "comments": [
    {
      "id": "fl4bx9m",
      "author": "whateverusername999",
      "body": "All the time. I don’t want to eat, I don’t like to eat. It’s even worse not that I’m quarantined and don’t see anyone else around me eating. Like, “Oh. Right. Act like a human and eat. You can eat with other people  “ (as long as they are people who don’t make me feel bad about my food choices) \n\nTherapists have said “set an alarm to remind you!” However I end up just ignoring the alarm if I don’t feel like eating (which is most of the time). But maybe alarms will work for other people?",
      "created_utc": 1584810290.0,
      "score": 25,
      "context": []
    },
    {
      "id": "fl3sn79",
      "author": "None",
      "body": "YES!!!! oh my gosh yes!! i was just talking about this with my dietitian recently. it’s such a struggle for me. what’s often suggested is setting alarms on your phone to serve as that reminder that “you need to eat!” it’s such a small thing but can be really helpful. if i am not aware and on top of it, like you, i just unintentionally go hours without eating simply bc i’m not interested/i forget.",
      "created_utc": 1584797046.0,
      "score": 10,
      "context": []
    },
    {
      "id": "fl5zz88",
      "author": "nicohusko",
      "body": "I usually dont notice until I start shaking. Even then I dont really feel hungry, but I force myself to eat so my body doesnt give out",
      "created_utc": 1584850268.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fl42qqk",
      "author": "axw3555",
      "body": "Basically every day. Hell, on Thursday I realised I hadn't eaten a full meal since Sunday lunchtime. I'd eaten a few small things, but no real meal.",
      "created_utc": 1584804559.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fl4xh35",
      "author": "abbymazing1201",
      "body": "My attitude towards eating is pretty so-so, if there's nothing already made an I don't want to bother making something I just won't eat. It's been getting worse with the social distancing, there have been days when I didn't eat anything.",
      "created_utc": 1584823752.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fl58r5f",
      "author": "DubsIn4",
      "body": "Yesterday I forgot to eat lunch and dinner. Had one bowl of cereal and a few snacks for the whole day.",
      "created_utc": 1584831076.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fl5bchi",
      "author": "kfilks",
      "body": "Yes and it's terrible with this quarantine. Last night I made myself dinner at 10:30 pm and I didn't even want it I just knew I had to eat something.",
      "created_utc": 1584832773.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fl64fkv",
      "author": "flower_milk",
      "body": "This used to happen to me all the time and I was very unhealthily underweight, I'm 5 ft and I was getting close to 80 lbs. Marijuana was made legal in my state and I never would have been able to put on weight without it. Plus the added bonus of it being a great treatment for my autism. Now that I have some weight on and actually get hungry, I don't forget to eat anymore.",
      "created_utc": 1584854112.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fl5tpch",
      "author": "robynxcakes",
      "body": "I used to have this problem before I started running now I am hungry a lot lol",
      "created_utc": 1584845449.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fl65opn",
      "author": "surelythisisnttaken-",
      "body": "Yuuup. I notice sometimes that my body feels hungry but it’s like there’s no connection between my stomach and my brain, it’s just like, I hear my stomach rumbling and think ‘huh, guess I’m hungry.’ \n\nI’m on quetiapine to sleep and I rely 100% on it to eat. It makes me hungry after I take it so I eat after I take it and that’s usually my only meal of the day. I went off quetiapine for a month and lost six kgs because I completely stopped eating. Quarantine is a nightmare because I’m terrified the only things I eat will become unavailable as they’re take out options 🙃",
      "created_utc": 1584855290.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fl67bl3",
      "author": "jlynny1811",
      "body": "Yep. All the time lately.",
      "created_utc": 1584856895.0,
      "score": 1,
      "context": []
    },
    {
      "id": "flrk03g",
      "author": "katcher_in_the_rye",
      "body": "I do this but then low blood sugar fucks me up so I have to make myself eat.",
      "created_utc": 1585421783.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fl4ffo1",
      "author": "None",
      "body": "I love eating but I'm a one meal guy. Sometimes my brain wants extra food at night but I have to tell him no because we're gonna get fat. Dinner is for special ocassions.",
      "created_utc": 1584812391.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fl47gah",
      "author": "None",
      "body": "Im normally pretty good with snacking, cuz it’s easy to pick at some candy or something throughout the day.  It’s the whole meal prep part that I hate, between touching the food, cooking it, handling it, etc or just not thinking of doing it that gets me",
      "created_utc": 1584807581.0,
      "score": 7,
      "context": [
        {
          "id": "fl42qqk",
          "author": "axw3555",
          "body": "Basically every day. Hell, on Thursday I realised I hadn't eaten a full meal since Sunday lunchtime. I'd eaten a few small things, but no real meal.",
          "created_utc": 1584804559.0
        }
      ]
    },
    {
      "id": "fl4xn8o",
      "author": "None",
      "body": "Yeah I would be like that as well, but I’m also in recovery from anorexia, so I’m basically forced to eat at least 3 times a day",
      "created_utc": 1584823866.0,
      "score": 1,
      "context": [
        {
          "id": "fl4xh35",
          "author": "abbymazing1201",
          "body": "My attitude towards eating is pretty so-so, if there's nothing already made an I don't want to bother making something I just won't eat. It's been getting worse with the social distancing, there have been days when I didn't eat anything.",
          "created_utc": 1584823752.0
        }
      ]
    },
    {
      "id": "fl4p2dl",
      "author": "axw3555",
      "body": "Most of my foods tend to be minimal prep - tinned, frozen, etc. Not the healthiest, but it gives me less chance to start picking on flaws in the food like the wrong smell or the wrong colour or even just worrying about exactly how long since I took it out of the fridge/freezer.\n\nI also do the picking at things bit. I call it grazing. Again, not the healthiest, but it stops my blood sugar crashing.",
      "created_utc": 1584818258.0,
      "score": 2,
      "context": [
        {
          "id": "fl42qqk",
          "author": "axw3555",
          "body": "Basically every day. Hell, on Thursday I realised I hadn't eaten a full meal since Sunday lunchtime. I'd eaten a few small things, but no real meal.",
          "created_utc": 1584804559.0
        },
        {
          "id": "fl47gah",
          "author": "None",
          "body": "Im normally pretty good with snacking, cuz it’s easy to pick at some candy or something throughout the day.  It’s the whole meal prep part that I hate, between touching the food, cooking it, handling it, etc or just not thinking of doing it that gets me",
          "created_utc": 1584807581.0
        }
      ]
    }
  ]
}