{
  "id": "fzkkaj",
  "subreddit": "ARFID",
  "author": "Katatronick",
  "created_utc": 1586644363.0,
  "title": "This disorder is usually described as having troubles with gaining weight, but does anyone else struggle with putting on too much weight?",
  "selftext": "My safe foods are all really bad for you, mostly calorie dense high carbs and high fat foods like sweets or pizza. As a result I've put on close to 30 lbs in two years and I really struggle finding food that's low calorie and non-triggering. Everything that people say to eat, like vegetables trigger me hard, so it's a struggle to not cave and just eat Mac n cheese again. Can anyone relate?",
  "url": "https://www.reddit.com/r/ARFID/comments/fzkkaj/this_disorder_is_usually_described_as_having/",
  "score": 110,
  "num_comments": 26,
  "comments": [
    {
      "id": "fn4xn5u",
      "author": "RaggedToothRat",
      "body": "Yup, this my problem. I'm obese because most of my safe foods are high-calorie. It wasn't too bad when I lived with my parents but once I starting shopping for myself I piled on the weight and I'm struggling to lose it.",
      "created_utc": 1586651224.0,
      "score": 43,
      "context": []
    },
    {
      "id": "fn4p29z",
      "author": "None",
      "body": "I think it’s described as related to thinness because it was first described as a different thing from anorexia.\n\nI’m pretty sure you can have problems at lots of different weights.",
      "created_utc": 1586645919.0,
      "score": 28,
      "context": []
    },
    {
      "id": "fn58icj",
      "author": "KingTalis",
      "body": "I fall in the same boat as you. Best you can do besides finding a way to acquire \"better\" safe foods is to eat smaller portions.  \n\n\nPeople ignore this option a lot for some reason. I lost 40 pounds in a couple of months just limiting my portion size.",
      "created_utc": 1586658496.0,
      "score": 13,
      "context": []
    },
    {
      "id": "fn5egq5",
      "author": "spidew",
      "body": "me me me. most of my safe foods are junk food or fast food. ive been overweight since puberty. Its honestly really isolating to see thinness and struggling to gain weight as signs and symptoms. makes me really second guess if I have arfid sometimes.",
      "created_utc": 1586662739.0,
      "score": 12,
      "context": []
    },
    {
      "id": "fn55rdg",
      "author": "axw3555",
      "body": "Since I started office work and driving, I've put on more weight in 3-4 years than the preceding decade (which included the last couple of teenage growth spurts). It's put me to borderline overweight. Honestly, there are times when I think \"with the amount of chocolate and dairy in my diet, how do I not have a BMI in the 30's?\".",
      "created_utc": 1586656587.0,
      "score": 7,
      "context": []
    },
    {
      "id": "fn5qfon",
      "author": "Jenny_Hanivers",
      "body": "If you’re a kid with ARFID you have no choice but to eat what’s given you or not eating. So kids tend to lose weight. Adults have access to any food they want and if they’re not healthy foods then weight game is hard to avoid. I think more research is needed on adults with ARFID.",
      "created_utc": 1586672417.0,
      "score": 7,
      "context": []
    },
    {
      "id": "fn5mgfz",
      "author": "pearyeet",
      "body": "Yup! Turns out cheese pizza, pasta, chicken nuggets, french fries, ice cream, etc. is not good for weight management! I’m getting much heavier but other than exercising I don’t feel like I have much control over it, which causes strain in my relationships.",
      "created_utc": 1586668940.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fn5eda7",
      "author": "None",
      "body": "Yes. I got to 230lbs. I’m 5’4. I’m now 155. It was horrible. It’s still a struggle.",
      "created_utc": 1586662670.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fn5gox6",
      "author": "McMetal770",
      "body": "Absolutely, exact same thing as you. Pretty much anything with way too much sugar in it is safe for me, and as a result I'm pretty overweight.\n\nWhen I was a kid, I was super skinny. But once I grew up and was able to control how much junk food I got, my weight ballooned pretty quickly.",
      "created_utc": 1586664393.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fn5g7x2",
      "author": "horrorwh0re",
      "body": "yes!!! i feel this SO hard. from birth up until a couple years ago i was always tiny; always underweight. then i went inpatient for treatment for my ARFID and ever since i got out i gain weight so so easily. i gained almost 90 pounds from being in treatment (partially bc i got put on an anti anxiety med that increased my appetite) and have struggled to lose that weight ever since. i’m almost back down to where i’d like to be, but frick its so hard because all my safe foods are ones that are the unhealthiest for me in terms of losing weight. i feel like i’ll never get back to a normal weight because all i eat is carbs that go straight to my tummy and thighs lmao",
      "created_utc": 1586664038.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fn56184",
      "author": "chm10",
      "body": "Ohh yeah. I was super thin and underweight until I got to college. Once I was there I gained about 30-50 pounds because all I could eat were my safe foods that were very high in calories and unhealthy.",
      "created_utc": 1586656774.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fn5kbc0",
      "author": "Dextazi",
      "body": "Yes I can relate. It took a while to merge meal replacement shakes into my diet in order to get the correct nutrients I needed along with taking vitamins. Now I rely heavily on water, protein shakes, and one dinner and coffee. My dinner still has pastas, meats, or starch. Sometimes when I am craving other foods I just stick to drinking water because I try not to cave into cakes and chips. I have a hard time shopping too. I want to pick all my safe foods, but on the other hand all my safe foods will cause me to feel ill and sluggish. That's why I gave up on my safe foods and now I have just a redundant meal schedule that doesn't turn my stomach upside down or make my throat feel closed off.",
      "created_utc": 1586667199.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fn5ba42",
      "author": "nopizzaonmypineapple",
      "body": "Personally I've never had trouble maintaining an healthy weight, expect when I was suffering from anorexia which is an other story. It depends on people I guess, and on how varied your diet is. If your safe foods consist exclusively of junk food for example I doubt you'd fit the typical ARFID description. It seems a bit outdated imo\n\nEdit : Why is my experience getting downvoted ? Wth",
      "created_utc": 1586660437.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fn59nsp",
      "author": "None",
      "body": "Yeah but I have PCOS. I eat maybe once a day and I'm just a huge fatty.",
      "created_utc": 1586659300.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fn5sk1m",
      "author": "tommy91110",
      "body": "Yep, all my life Ive been obese, started getting really bad out of highschool, sitting rn at almost 400 pounds. I wish I could just diet and be normal, I'm tired of the looks and abuse from my family.",
      "created_utc": 1586674421.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fn5xbci",
      "author": "Dvl_Brd",
      "body": "Yes! Me!\n\nMy safe foods, and my non-allergen foods combine into a fat girl sandwich.",
      "created_utc": 1586679213.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fn6d2od",
      "author": "magicalstella",
      "body": "Before i got sick for other reasons (food allergies) which spurred me going to arfid treatment i was 5'1\" and damn near 300lbs, and still gaining, with only about 10 safe foods. Yes, its very possible. If you seek treatment and they try to make it about your weight (\"fat ppl dont get this\"): congratulations you just found a practitioner who does not understand arfid. Keep looking.",
      "created_utc": 1586695873.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fn6icap",
      "author": "OMFGLDQ",
      "body": "I'm on here because I struggled earlier in my life with what appears to have been ARFID and my partner struggles currently. I had the loss of weight, he has the weight gain side of it. You are not alone for sure",
      "created_utc": 1586700055.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fn6qdqy",
      "author": "None",
      "body": "Yes. I found my problem with gaining weight wasn't actually in the calories of the food, but in my binging habits. When I was younger since I suffered from arfid there was quite often times when there wasn't any food available to me because I was too picky, and as a result I learned to binge as much as I could when my safe foods were availible. Now I have expanded my diet just enough to sort of call it healthy, but I still struggle with self control when it comes to binging safe foods. If you're at all the same way I found eating 3 meals a day at consistent times helps you snack less and not think about food as much all day.",
      "created_utc": 1586705235.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fn6xkyk",
      "author": "JCXIII-R",
      "body": "I weigh about twice as much as I should..... The keto diet really helps though, cause it's a lot of my safe foods combined lol",
      "created_utc": 1586709315.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fn70h67",
      "author": "badgurlvenus",
      "body": "yes :-( which makes me reluctant to bring it up with my doctors. how an i lose weight when i safe foods are dry, crunchy, usually potatoey and stale things lol..............eugh i wish i could woof down some veggies, but even my fave fruit and veg makes me gag when i try to eat them. :-(",
      "created_utc": 1586710903.0,
      "score": 1,
      "context": []
    },
    {
      "id": "frrt9y7",
      "author": "None",
      "body": "Serious question for anyone in here - what would happen to people with ARFID in the real world, let’s say 50 years ago when you didn’t have the option of so many foods? Maybe you lived in a farm and what you grew you ate and anything else would be considered a significant waste and had consequences?\n\nDo you think the disorder is something that has socially become acceptable? Perhaps even created by all the options and lack of consequence? Perhaps all psychological and self-induced? \n\nGenuinely curious",
      "created_utc": 1590418223.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fn52hjm",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1586654360.0,
      "score": -2,
      "context": []
    },
    {
      "id": "fn6xhs3",
      "author": "None",
      "body": "I had this sort of self-revelation a few weeks ago. Now it's just a matter of mustering up a bit of self control., and making a long lasting commitment.",
      "created_utc": 1586709265.0,
      "score": 1,
      "context": [
        {
          "id": "fn58icj",
          "author": "KingTalis",
          "body": "I fall in the same boat as you. Best you can do besides finding a way to acquire \"better\" safe foods is to eat smaller portions.  \n\n\nPeople ignore this option a lot for some reason. I lost 40 pounds in a couple of months just limiting my portion size.",
          "created_utc": 1586658496.0
        }
      ]
    },
    {
      "id": "frtf2hc",
      "author": "Katatronick",
      "body": "As a quick aside before I answer your questions, your question asking if it's created by options and lack of consequence is pretty rude and has a \"pull yourself up by your bootstraps, phone bad\" type of vibe to it. No one chooses to be picky, I wish so hard that I could just eat like a normal person. Just like no one chooses to have depression or anxiety, it's not because the world has gone too soft and these people are being coddled.\n\nTo answer your first question, my dad actually has ARFID, and worse than I do. He won't eat fruits at all, the only vegetables he'll eat is broccoli and asparagus, and those he only started eating in his 40s. He's 64 now, so 50 years ago he was 14 and eating fast food, steak, and potatoes and whatever his mom made for his dad who also ate steak and potatoes. Clearly he's still alive and honestly relatively healthy all things considered, he's not overweight and no major health issues (except for a surgery for diverticulitis caused by genetics and exacerbated by his fiber poor diet (he takes fiber supplements now)). IDK about the farm, I've never lived on a farm and don't know anyone who has so I can't comment on that.\n\nI know personally that the disorder is **not** socially acceptable, I get panic attacks when going to my MIL's place because she pressures me constantly to eat things I know will cause me to vomit. My friends think I'm weird, and people like you think I'm faking it. People will try to mess with my food and sneak things into it when I'm not looking to \"prove\" that I'm just making it up. My dad had to go to the hospital because my mom didn't believe he had a nut allergy and poisoned his food to prove he was just being unnecessarily picky.\n\nIf you are really truly curious about this eating disorder you should try researching it. Google about it and read research papers. However I feel like your questions are just bad faith attempts at shaming me and anyone who struggles with ARFID.",
      "created_utc": 1590449010.0,
      "score": 1,
      "context": [
        {
          "id": "frrt9y7",
          "author": "None",
          "body": "Serious question for anyone in here - what would happen to people with ARFID in the real world, let’s say 50 years ago when you didn’t have the option of so many foods? Maybe you lived in a farm and what you grew you ate and anything else would be considered a significant waste and had consequences?\n\nDo you think the disorder is something that has socially become acceptable? Perhaps even created by all the options and lack of consequence? Perhaps all psychological and self-induced? \n\nGenuinely curious",
          "created_utc": 1590418223.0
        }
      ]
    },
    {
      "id": "fn5efuu",
      "author": "None",
      "body": "I mean, shitty foods don’t really matter. I lost almost 80lbs still eating my safe shitty foods lol I just counted the calories",
      "created_utc": 1586662722.0,
      "score": 4,
      "context": [
        {
          "id": "fn52hjm",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1586654360.0
        }
      ]
    },
    {
      "id": "frtkbl2",
      "author": "None",
      "body": "Thank you",
      "created_utc": 1590452117.0,
      "score": 1,
      "context": [
        {
          "id": "frrt9y7",
          "author": "None",
          "body": "Serious question for anyone in here - what would happen to people with ARFID in the real world, let’s say 50 years ago when you didn’t have the option of so many foods? Maybe you lived in a farm and what you grew you ate and anything else would be considered a significant waste and had consequences?\n\nDo you think the disorder is something that has socially become acceptable? Perhaps even created by all the options and lack of consequence? Perhaps all psychological and self-induced? \n\nGenuinely curious",
          "created_utc": 1590418223.0
        },
        {
          "id": "frtf2hc",
          "author": "Katatronick",
          "body": "As a quick aside before I answer your questions, your question asking if it's created by options and lack of consequence is pretty rude and has a \"pull yourself up by your bootstraps, phone bad\" type of vibe to it. No one chooses to be picky, I wish so hard that I could just eat like a normal person. Just like no one chooses to have depression or anxiety, it's not because the world has gone too soft and these people are being coddled.\n\nTo answer your first question, my dad actually has ARFID, and worse than I do. He won't eat fruits at all, the only vegetables he'll eat is broccoli and asparagus, and those he only started eating in his 40s. He's 64 now, so 50 years ago he was 14 and eating fast food, steak, and potatoes and whatever his mom made for his dad who also ate steak and potatoes. Clearly he's still alive and honestly relatively healthy all things considered, he's not overweight and no major health issues (except for a surgery for diverticulitis caused by genetics and exacerbated by his fiber poor diet (he takes fiber supplements now)). IDK about the farm, I've never lived on a farm and don't know anyone who has so I can't comment on that.\n\nI know personally that the disorder is **not** socially acceptable, I get panic attacks when going to my MIL's place because she pressures me constantly to eat things I know will cause me to vomit. My friends think I'm weird, and people like you think I'm faking it. People will try to mess with my food and sneak things into it when I'm not looking to \"prove\" that I'm just making it up. My dad had to go to the hospital because my mom didn't believe he had a nut allergy and poisoned his food to prove he was just being unnecessarily picky.\n\nIf you are really truly curious about this eating disorder you should try researching it. Google about it and read research papers. However I feel like your questions are just bad faith attempts at shaming me and anyone who struggles with ARFID.",
          "created_utc": 1590449010.0
        }
      ]
    }
  ]
}