{
  "id": "fzzw5j",
  "subreddit": "ARFID",
  "author": "None",
  "created_utc": 1586709324.0,
  "title": "Am I the only one who kinda dislikes how the media only thinks of eating disorders as Anorexia or Bulimia or ones like that?",
  "selftext": "Now I am in no way diminishing how incredibly deadly or important these eating disorders are or saying that the media shouldn’t talk about them, because they should. Even now, eating disorders are still frowned upon and don’t have enough awareness, whichever one they are. But sometimes I feel like the media only portrays eating disorders as people with body image issues or weight problems. And a majority of eating disorders are this way! But there are other ones, such as this one, ARFID. We don’t have body image issues like Anorexia or Bulimia. (at least i don’t think, i’m not trying to assume everyone’s issues or struggles). Whenever i tell someone I have an eating disorder, they think I have Anorexia or am disgusted by my body so they try to say “you’re so pretty though! you aren’t over weight at all” or something like that, so I tell them about ARFID. I get that the media focuses on the more common and deadly eating disorders, but sometimes I just feel that ARFID or other ones should also have awareness. Maybe it’s just because it is newer than the others. Maybe i’m just being selfish. Who knows. Am I the only one who feels this way? An again im in no way saying that Anorexia or Bulimia SHOULDN’T get awareness because they SHOULD.",
  "url": "https://www.reddit.com/r/ARFID/comments/fzzw5j/am_i_the_only_one_who_kinda_dislikes_how_the/",
  "score": 127,
  "num_comments": 11,
  "comments": [
    {
      "id": "fn6zbag",
      "author": "ilikecheese121",
      "body": "I once told a guy I had an eating disorder and he told me I looked better fat. Like yeah, thanks, I too realized that. Not much I can do though.",
      "created_utc": 1586710272.0,
      "score": 36,
      "context": []
    },
    {
      "id": "fn6ys3c",
      "author": "None",
      "body": "I have felt this way for a long time! It’s so incredibly frustrating how eating disorder professionals all over social media preach “inclusivity” and yet they rarely acknowledge or advocate for ARFID - it’s so incredibly exclusive. Most advocacy and awareness for eating disorders centers on body image issue and/or diet culture, which definitely needs advocating for. I am not saying they don’t deserve that but again, it’s so exclusive. When I say eating disorder, people just assume I am restricting due to fear of weight gain or calories and that couldn’t be farther from the truth. ARFID is so under-represented and I think what’s especially frustrating is that the willingness of others to advocate and learn about it, isn’t there.  Also, the media that does surround ARFID (although minimal) focuses on children. \n\nAnorexia and bulimia aside, even orthorexia gets more attention and advocacy in the media and it isn’t even an actual diagnosable eating disorders (it’s not in the DSM). And again, I’m not saying it doesn’t deserve to be advocated for but the lack of representation of ARFID from professionals, the media, etc., is so disheartening and frustrating.\n\nAnd, ARFID might be “new” but only in the DSM - it’s actually been around for so long but most just end up being misdiagnosed with anorexia.",
      "created_utc": 1586709982.0,
      "score": 23,
      "context": []
    },
    {
      "id": "fn70oy3",
      "author": "patcave91",
      "body": "Honestly it doesn’t bother me. ARFID is such a small percentage of the total eating disorder population so it makes sense that it’s less represented in the media. When I was a kid, I was diagnosed ED-NOS because ARFID wasn’t even in the DSM at the time. Would it be great to see more representation and more information out there on this? Heck yeah. But it’s a relatively new diagnosis so... idk. Just doesn’t really get to me 🤷‍♀️",
      "created_utc": 1586711020.0,
      "score": 13,
      "context": []
    },
    {
      "id": "fn75u13",
      "author": "philosaphira",
      "body": "It definitely isn't good cause there are some misconceptions that make it more difficult for an ARFID person to be understood. \nIt's not about just \"picky eating\", it's not just about not \"wanting\" to eat it and that we \"could if we just tried\" - and many of us I guess want to gain weight and feel bad, avoid social situations that include eating, cause you don't know what will be available, what might seem weird etc.; you are ashamed cause people wouldn't understand. \n\nAll these things are so important and often you only know about it if you're concerned yourself, someone you know or you're interested in mental illnesses and this kind of stuff. It's not taken seriously enough. It took me 22 years to find out that I have ARFID. It was never a topic. AT LEAST people who might have it should find out about it.",
      "created_utc": 1586713867.0,
      "score": 10,
      "context": []
    },
    {
      "id": "fn7dbue",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1586718088.0,
      "score": 7,
      "context": []
    },
    {
      "id": "fn93qn9",
      "author": "horrorwh0re",
      "body": "i just wish more people were educated on it. every time i mention having an ED i have to explain that i have ARFID and proceed to explain what it is and all just because of the stigma attached to the more well-known EDs. usually if I don’t explain having ARFID and just say something more vague people assume i’m anorexic and feel the need to tiptoe around the topic of food with me or expect me to hardly touch any food given to me. it would also have been nice if, when growing up more adults in my life knew what ARFID was instead of just giving me shit for “only eating like 5 foods” or needing to “eat a burger and put some meat on those bones” :/",
      "created_utc": 1586758401.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fn9n9oe",
      "author": "JoChiCat",
      "body": "Yeah, it’s that lack of representation that makes me extra uncomfortable about bringing up my eating disorder, because then people have *expectations* about what I need. Then I have to go through the whole “you don’t have to reassure me about my weight/size/appearance/etc, I’d actually prefer it if you didn’t comment on anything related to my eating habits at all” rigmarole.",
      "created_utc": 1586779161.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fn8f5su",
      "author": "Jen__44",
      "body": "Eh, doctors barely know about it so I wouldn't really expect the media to be able to do proper articles on it. I think it's kinda up to people with arfid to offer their story to the media if they want more awareness because you cant really expect the media to run stories on things they don't know exist.   \nAlso, I don't personally think it's helpful at this point in time to frame it as a eating disorder when talking about it casually, I just say I have food issues and no one bothers me about it. Anyone who wants to know more I just tell them my specific problem, which is tasting things too strongly.",
      "created_utc": 1586740263.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lhibwb6",
      "author": "otterpixie",
      "body": "So based on current understandings, ARFID is technically a feeding disorder and not an eating disorder. An eating disorder typically does require that additional aspect of body image related issues. Unfortunately, the two get conflated because they are all grouped together in the DSM but yeah, the body image related stuff is a significant point of difference between eating and feeding disorders.\n\nI also have an eating disorder so if I'm going to talk to someone specifically about ARFID, I would tell them I have a feeding disorder specifically so they are less likely to assume I'm talking about EDs like AN, BN and BED.",
      "created_utc": 1723331264.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fn7cl49",
      "author": "ohhyouknow",
      "body": "It is theorized that there are about the same amount of adults who suffer from ARFID as there are adults who suffer from anorexia. The percentage of children who have it is way higher. The issue is that the majority of medical professionals have never heard of the disorder so a huge portion of people with ARFID go undiagnosed. It does not make sense to me that it is misrepresented in the media because it IS just as prevalent as other eating disorders, just mostly undiagnosed due to lack of information. I feel like if it was represented more in the media, more people who have it could get treatment for it. I respect your opinion and feelings about it though.",
      "created_utc": 1586717671.0,
      "score": 15,
      "context": [
        {
          "id": "fn70oy3",
          "author": "patcave91",
          "body": "Honestly it doesn’t bother me. ARFID is such a small percentage of the total eating disorder population so it makes sense that it’s less represented in the media. When I was a kid, I was diagnosed ED-NOS because ARFID wasn’t even in the DSM at the time. Would it be great to see more representation and more information out there on this? Heck yeah. But it’s a relatively new diagnosis so... idk. Just doesn’t really get to me 🤷‍♀️",
          "created_utc": 1586711020.0
        }
      ]
    },
    {
      "id": "fn82u7w",
      "author": "None",
      "body": "Dude, I'd see a different specialist if at all possible, that sounds.. so messed up. I can't really imagine any scenario where keeping a diagnosis from your patient is at all ethical, wtf? She should've told you the moment she diagnosed you",
      "created_utc": 1586732728.0,
      "score": 4,
      "context": [
        {
          "id": "fn7dbue",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1586718088.0
        }
      ]
    },
    {
      "id": "fnawj7b",
      "author": "heloamgeko",
      "body": "man I remember when i was around 5 or 6 maybe my school wouldnt let me go to my lesson until i ate a burger that i thought was absolutely vile, i constantly had teachers on my back about eating my dinners until secondary school",
      "created_utc": 1586805071.0,
      "score": 1,
      "context": [
        {
          "id": "fn93qn9",
          "author": "horrorwh0re",
          "body": "i just wish more people were educated on it. every time i mention having an ED i have to explain that i have ARFID and proceed to explain what it is and all just because of the stigma attached to the more well-known EDs. usually if I don’t explain having ARFID and just say something more vague people assume i’m anorexic and feel the need to tiptoe around the topic of food with me or expect me to hardly touch any food given to me. it would also have been nice if, when growing up more adults in my life knew what ARFID was instead of just giving me shit for “only eating like 5 foods” or needing to “eat a burger and put some meat on those bones” :/",
          "created_utc": 1586758401.0
        }
      ]
    }
  ]
}