{
  "id": "gel80b",
  "subreddit": "ARFID",
  "author": "poppy542",
  "created_utc": 1588775967.0,
  "title": "Is anyone else’s burger just meat and the bread?",
  "selftext": "I always get weird reactions (luckily I take them humorously) when I ask!\n\nI wouldn’t eat it if it had tomato, sauces, melted cheese, etc on top so asking for them to be taken out entirely is perfect!\n\nPlus I ain’t having to struggle fitting a ridiculously sized burger in my mouth haha :P",
  "url": "https://www.reddit.com/r/ARFID/comments/gel80b/is_anyone_elses_burger_just_meat_and_the_bread/",
  "score": 108,
  "num_comments": 57,
  "comments": [
    {
      "id": "fpog02j",
      "author": "basiamille",
      "body": "This is why I love fast food places with digital kiosks where you “build” your burger. It’s bliss.",
      "created_utc": 1588783862.0,
      "score": 49,
      "context": []
    },
    {
      "id": "fpo1mw5",
      "author": "PheebDweeb",
      "body": "Yes! all the time. Find it hilarious at restaurants that have 12 different burgers on the menu with different variations of cheese, bacon and sauces. Then I ask for it plain. \n\nI'm 35 :)",
      "created_utc": 1588776746.0,
      "score": 26,
      "context": []
    },
    {
      "id": "fpo4jnq",
      "author": "None",
      "body": "Not plain but I only do bacon or cheese and it must be well done. I get a lot of flack from my boss and my parents about it, but my wife, friends and coworkers all could care less. Restaurants usually don’t care but I am always amazed how frequently they mess it up. \n\nI’m also 35 too.",
      "created_utc": 1588778245.0,
      "score": 27,
      "context": []
    },
    {
      "id": "fpoh5li",
      "author": "MatthewBrown12godown",
      "body": "YES, and if they screw it up I have to get a new one, I can't just 'take it off'.",
      "created_utc": 1588784415.0,
      "score": 14,
      "context": []
    },
    {
      "id": "fpof78z",
      "author": "penguinNpie",
      "body": "Plain with ketchup.  No cheese! That's it for me. It's easier just to survive on chicken strips when I go out.  And im 34.",
      "created_utc": 1588783479.0,
      "score": 13,
      "context": []
    },
    {
      "id": "fpobv1g",
      "author": "madommouselfefe",
      "body": "My father in law, husband, and older son, only like plain burgers. Just meat,cheese ( only cheddar cheese), and bun, if they are being adventurous they will use a plain bagel instead of a bun, but that’s really rare. All 3 have eating issues, my husband has been diagnosed as well as my son. Every family BBQ is set up “taco bar”style so you can build your own and those who struggle with food can also eat.",
      "created_utc": 1588781856.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fpohqxx",
      "author": "altoid420",
      "body": "YES plain and dry gang unite",
      "created_utc": 1588784705.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fppa95d",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1588798651.0,
      "score": 6,
      "context": []
    },
    {
      "id": "fpo61oq",
      "author": "CaptainKaldwin",
      "body": "Yep! It’s annoying sometimes, they’ll put cheese on my burger even though i specified PLAIN as in Nothing On It. Lmao",
      "created_utc": 1588778999.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fpp9lkp",
      "author": "None",
      "body": "I don’t like the texture or taste of things... mixed? I don’t know. I just like all of it separate.\n\nThat’s why my orders would be:\nburger with just bun and meat; plain and dry.\nwhite bread with turkey; plain and dry.\nhot dog with bun and meat; plain and dry.\netc etc.\n\nPeople always get on me like “get some veggies on it!” like okay... I eat tons of veggies... just not on that burger.",
      "created_utc": 1588798324.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fpoyw7z",
      "author": "lloyde1",
      "body": "It is nice to hear from my brethren on this subject. \n\nI didn't realise this was a common thing. I thought it was just me.\n\nThere is always a comment or 2 at a bbq when I ask for it plain. \n\nIt seems to be a bit of an insult if it is: still not mooing, with some nasty wedges of onion and the like.\n\nI am asking for less, not, more!",
      "created_utc": 1588793038.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fpobp63",
      "author": "banaan_Appel",
      "body": "Yes!\nHaving another structure or taste or temperature with the burger is just too much. \n\nMaybe some cheese if I'm in the mood. I don't like sauce and lettuce in general. Tomatoes are way too juicy to put on a burger.\nHoney mustard dressing is the only one I can tolerate and it has to be on a crispy chicken burger.\n\nAlso has to be big meat. Not that small cardboard piece of meat at fast food chains.",
      "created_utc": 1588781777.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fpoiti8",
      "author": "techsupportlibrarian",
      "body": "I can't do burgers period. Not the meat patty. Not the burger buns. They are both nasty to me!\n\n&#x200B;\n\nI can eat an arby's roast beef tho... but not the buns. JUST the meat. LMAO",
      "created_utc": 1588785219.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fpoke28",
      "author": "KSTornadoGirl",
      "body": "Absolutely - a few additions over the years, like cheese, bacon, and BBQ sauce, depending on the place. Lettuce is okay, preferably not hot snd slimy though.\n\nI loathe the traditional toppings - ketchup, mustard, pickle, onion, mayonnaise, special sauce etc. 😝\n\nOne thing that irritates me is when regular eaters say \"You mean you want it DRY?!\" 😲 Because to me it's not \"dry\" unless it's overcooked. Just because it doesn't have a bunch of slop and slime on it doesn't mean it's \"dry.\"",
      "created_utc": 1588785973.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fpp6uc0",
      "author": "wandadetroit",
      "body": "Another one here, and I'm 38. \n\nI will actually cry if I get home with my takeout and it has cheese or toppings on it. Wendy's is the worst for this. I make my bf check before I leave the drive thru.",
      "created_utc": 1588796983.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fppip2q",
      "author": "None",
      "body": "i can’t even eat burgers, i have to do the meat and bun separate  and ground beef texture kills me too :(",
      "created_utc": 1588802996.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fpr15vc",
      "author": "_dexistrash",
      "body": "i really thought i was the only one lmao everyone’s always weirded out when i say it",
      "created_utc": 1588838741.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fpoathn",
      "author": "havensal",
      "body": "Yep.  With bacon and A1 sauce, or ketchup in a pinch. \n\nI like lettuce, but its nasty once the burger warms it up, same with onions.",
      "created_utc": 1588781343.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fpogvte",
      "author": "None",
      "body": "mine is just cheese and the meat not ever a roll, cheese is my main safe food",
      "created_utc": 1588784284.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fpohf41",
      "author": "green-egg-and-ham",
      "body": "I like cheese and ketchup now but for many many years I couldn’t even eat a burger patty with a bun!",
      "created_utc": 1588784545.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fpohnf1",
      "author": "badgurlvenus",
      "body": "yes, meat and cheese only, plain and dry! sometimes i'll do bacon but it's gotta be thin. also, if i'm feeling adventurous, then i'll add some pickles!! also, the patty has to be thin, but i will do a double or even a triple if they're thin. but with a giant patty wad, if i can see the texture in all it's glory, i'm out. :-( i know i like it and it tastes good, but the texture can ruin it for me, even by just looking at it.",
      "created_utc": 1588784658.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fpoi1rn",
      "author": "DrukQsr_",
      "body": "Same here but with cheese. Sometimes I'll order it with lettuce too because I can just take that out and not taste a difference. But any other toppings or sauce being taken out/scraped off I can taste after the fact.",
      "created_utc": 1588784852.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fpoipjk",
      "author": "sonicenvy",
      "body": "YES! i sometimes feel real awkward asking for a plain burger as an adult bcs people look at you weird, or worse, assume you mean cheeseburger (yuck!) also big preference for medium rare burgers texturally. like i can eat well done burgers they are just... unpleasant",
      "created_utc": 1588785165.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fpok3yp",
      "author": "TomDankEngine",
      "body": "I like ketchup and mustard too but I need my burger thin and over cooked. If there’s any moister or grease in the meat I’m out.",
      "created_utc": 1588785840.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fpokiv5",
      "author": "Melon_Cooler",
      "body": "Yep, although I'll add ketchup and bacon if possible. Nothing else though.",
      "created_utc": 1588786036.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fponi8h",
      "author": "Kylie78",
      "body": "Yep, I usually just have the burger meat and some “season all” to give it a little bit of flavor. \nMind you I’ve never had a fast food burger, I only eat homemade or fresh burgers like five guys.",
      "created_utc": 1588787469.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fpovzt7",
      "author": "axw3555",
      "body": "This is literally the one and only time time I say no to this question. Normally, I will literally have one thing on a plate. The only things allowed on a plate with another food are ketchup and fries/chips.\n\nBut for some reason, when I order a burger, I'll have onion (in fact, I usually have *double* onion), lettuce, burger sauce (or big mac sauce), ketchup, burger, bread. I won't do cheese, not a fan of cheeseburgers, and I don't like pickles. No idea why my brain makes an exception but it does.\n\nEven odder - the above *only* applies to beef burgers. When I go to the Harvester with my parents, they used to do a really nice southern fried chicken. Then they took it off the menu and made basically all their chicken rotisserie (and I will not do bone). But, on that menu, there is a burger called (for some reason) the Cowboy. It's literally the same two southern fried chicken pieces that you can't order anymore, but in a bun with bacon, cheese, etc. Well, I won't eat bacon, period, and won't eat cheeseburgers. So I end up going in and ordering the cowboy with \"no bread, no cheese, no sauce, no bacon, literally just the chicken and the chips\". Which always gets a weird look and several assurances that yes, I literally mean two pieces of chicken and the chips on a plate, and no, I definitely don't want the cheese or the barbeque sauce or the bun.\n\nThough the funniest one was a time I stopped into McDonalds for some post-interview fries and the woman in front of me ordered \"a large big mac meal with no meat\". Even I raised an eyebrow at that one.",
      "created_utc": 1588791609.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fpp4vbz",
      "author": "Avbitten",
      "body": "Me!",
      "created_utc": 1588796002.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fppd8gx",
      "author": "None",
      "body": "No, only as a kid, just like every kid. As an adult, I like bacon and onions and cheese and melted sauces...\n\n&#x200B;\n\nthe problem though is you know what.",
      "created_utc": 1588800167.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fppne2y",
      "author": "CompleteyClueless",
      "body": "I'll get lettuce and bacon on mine.",
      "created_utc": 1588805515.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fpq488t",
      "author": "raygilette",
      "body": "i'll have cheese and bacon on a burger but nothing else. years back i wouldn't even have cheese but i've gotten a bit more adventurous in my old age.",
      "created_utc": 1588814842.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fpqgkr6",
      "author": "wyndchilde",
      "body": "Yup. Either bread and meat or bread meat cheese. \n\nAs a kid, I didn't use to eat the bun.",
      "created_utc": 1588822320.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fpr1szi",
      "author": "brutallyhonestdogmom",
      "body": "I don’t like burgers at all. I’d eat a plain bun with butter but I don’t like hamburger meat and I especially don’t like foods where things are mixed together!",
      "created_utc": 1588839373.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fpr7wr0",
      "author": "blondegator",
      "body": "Meat, cheese, and bun for me 😊",
      "created_utc": 1588845634.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fprj22b",
      "author": "None",
      "body": "Haha, I don't eat burgers, because the only thing i like about it is the bread :) I feel you!",
      "created_utc": 1588855392.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fprnhf6",
      "author": "KevinMCombes",
      "body": "I do like the cheese, but yes, I've been a plain burger orderer for life.",
      "created_utc": 1588858259.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fptd4ib",
      "author": "SilentAndStoned",
      "body": "I cant eat a burger unless it has bacon cheese and ketchup. Some burger meat is just disgusting. It also has to be of a smaller size. Five guys being the biggest ill go no matter whats on it.",
      "created_utc": 1588889071.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fpyc32r",
      "author": "matchstrike",
      "body": "Mine are beef, cheese, the bun, and sometimes bacon. That’s it. I’ve had them with everything...and after a bite or two I couldn’t stand anymore.",
      "created_utc": 1589000984.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l364kqq",
      "author": "louciano23",
      "body": "I eat my burgers like this all time i get looks or whatever but it’s just my preference",
      "created_utc": 1715194223.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n19fc8e",
      "author": "cooperwise22",
      "body": "Yes, and every time I go to McDonald’s and ask for a plain burger, they always either put cheese on it, or a pickle in it for some reason. ",
      "created_utc": 1751608903.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fpouek9",
      "author": "genericredditname22",
      "body": "This has been a game changer.",
      "created_utc": 1588790833.0,
      "score": 16,
      "context": [
        {
          "id": "fpog02j",
          "author": "basiamille",
          "body": "This is why I love fast food places with digital kiosks where you “build” your burger. It’s bliss.",
          "created_utc": 1588783862.0
        }
      ]
    },
    {
      "id": "fppreko",
      "author": "Acecakewolf",
      "body": "I feel that way about Subway too! I can so easily get a sandwich with just ham and lettuce.",
      "created_utc": 1588807691.0,
      "score": 5,
      "context": [
        {
          "id": "fpog02j",
          "author": "basiamille",
          "body": "This is why I love fast food places with digital kiosks where you “build” your burger. It’s bliss.",
          "created_utc": 1588783862.0
        }
      ]
    },
    {
      "id": "fpps2t8",
      "author": "MarcoDamian",
      "body": "Can relate so much",
      "created_utc": 1588808055.0,
      "score": 2,
      "context": [
        {
          "id": "fpog02j",
          "author": "basiamille",
          "body": "This is why I love fast food places with digital kiosks where you “build” your burger. It’s bliss.",
          "created_utc": 1588783862.0
        }
      ]
    },
    {
      "id": "fpoefcm",
      "author": "Wandertramp",
      "body": "That’s exactly how I get mine too. And can confirm on it being surprising how often they still mess that up lol",
      "created_utc": 1588783107.0,
      "score": 8,
      "context": [
        {
          "id": "fpo4jnq",
          "author": "None",
          "body": "Not plain but I only do bacon or cheese and it must be well done. I get a lot of flack from my boss and my parents about it, but my wife, friends and coworkers all could care less. Restaurants usually don’t care but I am always amazed how frequently they mess it up. \n\nI’m also 35 too.",
          "created_utc": 1588778245.0
        }
      ]
    },
    {
      "id": "fpouaxa",
      "author": "genericredditname22",
      "body": "Same. How can you mess up a plain burger even after saying just meat and bun. 37",
      "created_utc": 1588790784.0,
      "score": 3,
      "context": [
        {
          "id": "fpo4jnq",
          "author": "None",
          "body": "Not plain but I only do bacon or cheese and it must be well done. I get a lot of flack from my boss and my parents about it, but my wife, friends and coworkers all could care less. Restaurants usually don’t care but I am always amazed how frequently they mess it up. \n\nI’m also 35 too.",
          "created_utc": 1588778245.0
        }
      ]
    },
    {
      "id": "fpq4gia",
      "author": "raygilette",
      "body": "i'm 36 and i'm the same - although just recently there's one restaurant that i will have a medium burger from and they are absolutely beautiful.",
      "created_utc": 1588814975.0,
      "score": 1,
      "context": [
        {
          "id": "fpo4jnq",
          "author": "None",
          "body": "Not plain but I only do bacon or cheese and it must be well done. I get a lot of flack from my boss and my parents about it, but my wife, friends and coworkers all could care less. Restaurants usually don’t care but I am always amazed how frequently they mess it up. \n\nI’m also 35 too.",
          "created_utc": 1588778245.0
        }
      ]
    },
    {
      "id": "fppde27",
      "author": "None",
      "body": "So, you're telling me there are BBQs who aren't taco bar style?",
      "created_utc": 1588800247.0,
      "score": 2,
      "context": [
        {
          "id": "fpobv1g",
          "author": "madommouselfefe",
          "body": "My father in law, husband, and older son, only like plain burgers. Just meat,cheese ( only cheddar cheese), and bun, if they are being adventurous they will use a plain bagel instead of a bun, but that’s really rare. All 3 have eating issues, my husband has been diagnosed as well as my son. Every family BBQ is set up “taco bar”style so you can build your own and those who struggle with food can also eat.",
          "created_utc": 1588781856.0
        }
      ]
    },
    {
      "id": "fppfcs4",
      "author": "axw3555",
      "body": "At that point, you're into the existential question of whether it's still a burger or not.",
      "created_utc": 1588801255.0,
      "score": 3,
      "context": [
        {
          "id": "fppa95d",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1588798651.0
        }
      ]
    },
    {
      "id": "fpph0ja",
      "author": "None",
      "body": "Usually plain means meat and cheese only :/ you say plain hamburger no sauce",
      "created_utc": 1588802110.0,
      "score": 1,
      "context": [
        {
          "id": "fpo61oq",
          "author": "CaptainKaldwin",
          "body": "Yep! It’s annoying sometimes, they’ll put cheese on my burger even though i specified PLAIN as in Nothing On It. Lmao",
          "created_utc": 1588778999.0
        }
      ]
    },
    {
      "id": "fptozo5",
      "author": "poppy542",
      "body": "Fancy a burger together?😂 They always look at me odd haha! Some just get on and I’ve had a few others that were generally interested in why which was kinda cool hahah!",
      "created_utc": 1588895391.0,
      "score": 2,
      "context": [
        {
          "id": "fpr15vc",
          "author": "_dexistrash",
          "body": "i really thought i was the only one lmao everyone’s always weirded out when i say it",
          "created_utc": 1588838741.0
        }
      ]
    },
    {
      "id": "fpq4nii",
      "author": "raygilette",
      "body": "i'm not a big salad fan in general but warm salad is just repulsive.",
      "created_utc": 1588815087.0,
      "score": 2,
      "context": [
        {
          "id": "fpoathn",
          "author": "havensal",
          "body": "Yep.  With bacon and A1 sauce, or ketchup in a pinch. \n\nI like lettuce, but its nasty once the burger warms it up, same with onions.",
          "created_utc": 1588781343.0
        }
      ]
    },
    {
      "id": "fpql2bc",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1588825323.0,
      "score": 1,
      "context": [
        {
          "id": "fpoi1rn",
          "author": "DrukQsr_",
          "body": "Same here but with cheese. Sometimes I'll order it with lettuce too because I can just take that out and not taste a difference. But any other toppings or sauce being taken out/scraped off I can taste after the fact.",
          "created_utc": 1588784852.0
        }
      ]
    },
    {
      "id": "fppryyl",
      "author": "basiamille",
      "body": "I used to hit Subway nearly on the daily before the lockdown. My only issue was when I saw the Sandwich Artist handling unsafe ingredients (while prepping somebody else's food or refilling the ingredient containers) while my sandwich was in the toaster. It got to the point where the workers who knew me knew not to touch anything else until I had my sandwich.",
      "created_utc": 1588807997.0,
      "score": 4,
      "context": [
        {
          "id": "fpog02j",
          "author": "basiamille",
          "body": "This is why I love fast food places with digital kiosks where you “build” your burger. It’s bliss.",
          "created_utc": 1588783862.0
        },
        {
          "id": "fppreko",
          "author": "Acecakewolf",
          "body": "I feel that way about Subway too! I can so easily get a sandwich with just ham and lettuce.",
          "created_utc": 1588807691.0
        }
      ]
    },
    {
      "id": "fpu1wp0",
      "author": "DrukQsr_",
      "body": "Pretty much, because sometimes when I'm ordering something \"plain\" and add cheese it causes too much confusion so if I can just say lettuce and cheese instead it's never been done wrong.",
      "created_utc": 1588902908.0,
      "score": 1,
      "context": [
        {
          "id": "fpoi1rn",
          "author": "DrukQsr_",
          "body": "Same here but with cheese. Sometimes I'll order it with lettuce too because I can just take that out and not taste a difference. But any other toppings or sauce being taken out/scraped off I can taste after the fact.",
          "created_utc": 1588784852.0
        },
        {
          "id": "fpql2bc",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1588825323.0
        }
      ]
    },
    {
      "id": "fpq1kmv",
      "author": "None",
      "body": "The handling doesnt bother me too much and Subway was often a go-to at the end of long study days for me pre-lockdown. What bothers me most is how judged I feel by the employee when he gets to the veggie section and I basically just go \"Nah its cool like that\" with only meat, cheese and sauce in it. Not to mention the fact that the healthiest option for me, chicken breast, is like 14$ for a foot-long, since they usually assume you're paying for all these condiments I'm not using.",
      "created_utc": 1588813338.0,
      "score": 6,
      "context": [
        {
          "id": "fpog02j",
          "author": "basiamille",
          "body": "This is why I love fast food places with digital kiosks where you “build” your burger. It’s bliss.",
          "created_utc": 1588783862.0
        },
        {
          "id": "fppreko",
          "author": "Acecakewolf",
          "body": "I feel that way about Subway too! I can so easily get a sandwich with just ham and lettuce.",
          "created_utc": 1588807691.0
        },
        {
          "id": "fppryyl",
          "author": "basiamille",
          "body": "I used to hit Subway nearly on the daily before the lockdown. My only issue was when I saw the Sandwich Artist handling unsafe ingredients (while prepping somebody else's food or refilling the ingredient containers) while my sandwich was in the toaster. It got to the point where the workers who knew me knew not to touch anything else until I had my sandwich.",
          "created_utc": 1588807997.0
        }
      ]
    },
    {
      "id": "fpq2z5b",
      "author": "basiamille",
      "body": "The number one reason I (like so many ARFID people) order chicken nuggets & tenders at fast food and drive-thru, is because we don't have to qualify our order with, \"but make sure to leave off the \\_\\_\\_\\_\". It's the closest we get to living like the people who get to order the Big Mac (or what have you) as-is.",
      "created_utc": 1588814132.0,
      "score": 8,
      "context": [
        {
          "id": "fpog02j",
          "author": "basiamille",
          "body": "This is why I love fast food places with digital kiosks where you “build” your burger. It’s bliss.",
          "created_utc": 1588783862.0
        },
        {
          "id": "fppreko",
          "author": "Acecakewolf",
          "body": "I feel that way about Subway too! I can so easily get a sandwich with just ham and lettuce.",
          "created_utc": 1588807691.0
        },
        {
          "id": "fppryyl",
          "author": "basiamille",
          "body": "I used to hit Subway nearly on the daily before the lockdown. My only issue was when I saw the Sandwich Artist handling unsafe ingredients (while prepping somebody else's food or refilling the ingredient containers) while my sandwich was in the toaster. It got to the point where the workers who knew me knew not to touch anything else until I had my sandwich.",
          "created_utc": 1588807997.0
        },
        {
          "id": "fpq1kmv",
          "author": "None",
          "body": "The handling doesnt bother me too much and Subway was often a go-to at the end of long study days for me pre-lockdown. What bothers me most is how judged I feel by the employee when he gets to the veggie section and I basically just go \"Nah its cool like that\" with only meat, cheese and sauce in it. Not to mention the fact that the healthiest option for me, chicken breast, is like 14$ for a foot-long, since they usually assume you're paying for all these condiments I'm not using.",
          "created_utc": 1588813338.0
        }
      ]
    },
    {
      "id": "fpqgpev",
      "author": "Acecakewolf",
      "body": "Yeah I feel like I get judged sometimes from not getting any cheese, just plain old lettuce and ham on some bread, but ya know I think it's delicious. It's good ham and lettuce and bread and I'm proud of myself for eating food (particularly protein which I feel I struggle with). Go us for finding food to eat, and even better it's healthy food to eat! I'm proud of you too and everyone else as well. Food is hard but we're doing it.",
      "created_utc": 1588822403.0,
      "score": 2,
      "context": [
        {
          "id": "fpog02j",
          "author": "basiamille",
          "body": "This is why I love fast food places with digital kiosks where you “build” your burger. It’s bliss.",
          "created_utc": 1588783862.0
        },
        {
          "id": "fppreko",
          "author": "Acecakewolf",
          "body": "I feel that way about Subway too! I can so easily get a sandwich with just ham and lettuce.",
          "created_utc": 1588807691.0
        },
        {
          "id": "fppryyl",
          "author": "basiamille",
          "body": "I used to hit Subway nearly on the daily before the lockdown. My only issue was when I saw the Sandwich Artist handling unsafe ingredients (while prepping somebody else's food or refilling the ingredient containers) while my sandwich was in the toaster. It got to the point where the workers who knew me knew not to touch anything else until I had my sandwich.",
          "created_utc": 1588807997.0
        },
        {
          "id": "fpq1kmv",
          "author": "None",
          "body": "The handling doesnt bother me too much and Subway was often a go-to at the end of long study days for me pre-lockdown. What bothers me most is how judged I feel by the employee when he gets to the veggie section and I basically just go \"Nah its cool like that\" with only meat, cheese and sauce in it. Not to mention the fact that the healthiest option for me, chicken breast, is like 14$ for a foot-long, since they usually assume you're paying for all these condiments I'm not using.",
          "created_utc": 1588813338.0
        }
      ]
    },
    {
      "id": "fps24lz",
      "author": "EddoWagt",
      "body": "I'd love a burger sometimes, but I hate to pay for an expensive burger when I leave half the stuff off",
      "created_utc": 1588866197.0,
      "score": 2,
      "context": [
        {
          "id": "fpog02j",
          "author": "basiamille",
          "body": "This is why I love fast food places with digital kiosks where you “build” your burger. It’s bliss.",
          "created_utc": 1588783862.0
        },
        {
          "id": "fppreko",
          "author": "Acecakewolf",
          "body": "I feel that way about Subway too! I can so easily get a sandwich with just ham and lettuce.",
          "created_utc": 1588807691.0
        },
        {
          "id": "fppryyl",
          "author": "basiamille",
          "body": "I used to hit Subway nearly on the daily before the lockdown. My only issue was when I saw the Sandwich Artist handling unsafe ingredients (while prepping somebody else's food or refilling the ingredient containers) while my sandwich was in the toaster. It got to the point where the workers who knew me knew not to touch anything else until I had my sandwich.",
          "created_utc": 1588807997.0
        },
        {
          "id": "fpq1kmv",
          "author": "None",
          "body": "The handling doesnt bother me too much and Subway was often a go-to at the end of long study days for me pre-lockdown. What bothers me most is how judged I feel by the employee when he gets to the veggie section and I basically just go \"Nah its cool like that\" with only meat, cheese and sauce in it. Not to mention the fact that the healthiest option for me, chicken breast, is like 14$ for a foot-long, since they usually assume you're paying for all these condiments I'm not using.",
          "created_utc": 1588813338.0
        },
        {
          "id": "fpq2z5b",
          "author": "basiamille",
          "body": "The number one reason I (like so many ARFID people) order chicken nuggets & tenders at fast food and drive-thru, is because we don't have to qualify our order with, \"but make sure to leave off the \\_\\_\\_\\_\". It's the closest we get to living like the people who get to order the Big Mac (or what have you) as-is.",
          "created_utc": 1588814132.0
        }
      ]
    },
    {
      "id": "fps7jec",
      "author": "basiamille",
      "body": "After a lifetime of plain burgers, I can taste the difference.",
      "created_utc": 1588868783.0,
      "score": 1,
      "context": [
        {
          "id": "fpog02j",
          "author": "basiamille",
          "body": "This is why I love fast food places with digital kiosks where you “build” your burger. It’s bliss.",
          "created_utc": 1588783862.0
        },
        {
          "id": "fppreko",
          "author": "Acecakewolf",
          "body": "I feel that way about Subway too! I can so easily get a sandwich with just ham and lettuce.",
          "created_utc": 1588807691.0
        },
        {
          "id": "fppryyl",
          "author": "basiamille",
          "body": "I used to hit Subway nearly on the daily before the lockdown. My only issue was when I saw the Sandwich Artist handling unsafe ingredients (while prepping somebody else's food or refilling the ingredient containers) while my sandwich was in the toaster. It got to the point where the workers who knew me knew not to touch anything else until I had my sandwich.",
          "created_utc": 1588807997.0
        },
        {
          "id": "fpq1kmv",
          "author": "None",
          "body": "The handling doesnt bother me too much and Subway was often a go-to at the end of long study days for me pre-lockdown. What bothers me most is how judged I feel by the employee when he gets to the veggie section and I basically just go \"Nah its cool like that\" with only meat, cheese and sauce in it. Not to mention the fact that the healthiest option for me, chicken breast, is like 14$ for a foot-long, since they usually assume you're paying for all these condiments I'm not using.",
          "created_utc": 1588813338.0
        },
        {
          "id": "fpq2z5b",
          "author": "basiamille",
          "body": "The number one reason I (like so many ARFID people) order chicken nuggets & tenders at fast food and drive-thru, is because we don't have to qualify our order with, \"but make sure to leave off the \\_\\_\\_\\_\". It's the closest we get to living like the people who get to order the Big Mac (or what have you) as-is.",
          "created_utc": 1588814132.0
        },
        {
          "id": "fps24lz",
          "author": "EddoWagt",
          "body": "I'd love a burger sometimes, but I hate to pay for an expensive burger when I leave half the stuff off",
          "created_utc": 1588866197.0
        }
      ]
    }
  ]
}