{
  "id": "ggvkde",
  "subreddit": "ARFID",
  "author": "kn0ckedloose",
  "created_utc": 1589088337.0,
  "title": "People suck.",
  "selftext": "I used the trigger warning flair in case anyone is triggered by people being ignorant about ARFID, sorry if this causes anyone distress. \n\nI was just told that ARFID is bullshit and I don’t have an eating disorder just because I “refuse to eat healthy food like a stubborn little child” \n\nOuch, way to make me feel invalidated. \n\nI’ve dealt with so many ignorant people that act like they know everything about my mental illnesses when they’ve never even experienced them themselves. I’m not overweight or underweight and I’ve been told so many times that my eating disorder isn’t real and to grow the fuck up because they can’t physically see how it affects me. I should be used to it by now and should have learned to not care what other people think but I’m such a sensitive person that it really hurts every time.",
  "url": "https://www.reddit.com/r/ARFID/comments/ggvkde/people_suck/",
  "score": 97,
  "num_comments": 14,
  "comments": [
    {
      "id": "fq52edc",
      "author": "None",
      "body": "I completely feel this. People are judgmental of literally the dumbest things, and no matter what they can’t be educated because they’re stuck in their old school way of thinking. \n\nIt always baffles me how people deduce *so* many things about a person if they find out they’re a picky eater—When really your eating habits 9/10 times doesn’t negatively effect them in the slightest. \n\nI’m sorry you had to deal with someone like that, and the sheer fact that they feel so strongly about what isn’t their business indicates nosiness and someone who doesn’t respect boundaries... Which is also a childish flaw.",
      "created_utc": 1589090398.0,
      "score": 26,
      "context": []
    },
    {
      "id": "fq59kop",
      "author": "None",
      "body": "I will never ever ever understand WHY people care so much about what we eat/don’t want to eat/cannot eat. Why does it bother them *so* much? It really boggles my mind. You cannot control this. Anyone that doesn’t even try to take the time to understand you isn’t worth your time. People are assholes.",
      "created_utc": 1589097139.0,
      "score": 24,
      "context": []
    },
    {
      "id": "fq52fu6",
      "author": "KingTalis",
      "body": "Who ever you're talking about is just an ignorant shit bag.",
      "created_utc": 1589090433.0,
      "score": 15,
      "context": []
    },
    {
      "id": "fq583om",
      "author": "noisyparsnip",
      "body": "I agree. People really fail to understand the burden. I wish I could order a burger without double-checking to make sure it's plain so I don't bite into something like a pickle or onion that makes me gag. Or the \"Don't you ever try anything else?\" when eating chicken strips at restaurants. We didn't ask to be this way. If you are healthy then there is no reason to change the way you eat. People will always have an opinion on what others should be doing.",
      "created_utc": 1589095675.0,
      "score": 12,
      "context": []
    },
    {
      "id": "fq52xab",
      "author": "zourark",
      "body": "people do suck. no one really gets it, i'm sorry you had to go through that. i get that all the time from my friends and family",
      "created_utc": 1589090852.0,
      "score": 6,
      "context": []
    },
    {
      "id": "fq5gou4",
      "author": "Naejakire",
      "body": "Fuck all those people!\n\nIf someone said that to me, I'd choose not to associate (if at all possible) with them.\n\nMy family, coworkers and bf are all really accepting and have no issue with it. We joke about it, but that's the extent of it.\n\nI'm sorry someone said that to you. Obviously they're uneducated and have no knowledge on the subject, because it's very real. An uninformed opinion is absolutely worthless.",
      "created_utc": 1589104719.0,
      "score": 6,
      "context": []
    },
    {
      "id": "fq60uq3",
      "author": "magicalstella",
      "body": "This may not be the best response but i have no patience for bullshit at 30 years old so i will get nasty right back. Insult their bald spot or golf-pencil dick (you dont have to have seen it to know by their attitude how tiny it is lmao) or smth. Seriously man, dont take it personal, even if theyre family, fuck em. You didnt choose this and you dont deserve that. Digital hug! 👐👐",
      "created_utc": 1589122116.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fq62t9q",
      "author": "Kelekona",
      "body": "Posts like this prove that people with ARFID don't do it on purpose.  To continue to do something in the face of bullying means that it can't be easily overcome.\n\nChildren who refuse to eat things are under a survival instinct.  My theory that people with ARFID still have that instinct \"turned on\" has had anecdotal evidence against it.",
      "created_utc": 1589123318.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fq64u61",
      "author": "axw3555",
      "body": "If they aren't working as psychologists: tell them to fuck off. If they're part of your family, doubly so. If they're part of your friend circle, reassess if they're still part of it.\n\nIf they *are* working as psychologists: tell them to fuck off, then make a complaint to their employer.",
      "created_utc": 1589124520.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fq6pi1l",
      "author": "phunkygeeza",
      "body": "Whoever that is, you need to tell them straight: back off or else\n\nIf you get to the else, research that person's every tweak and fear, then remorselessly bully them about it.\n\nThey'll get the point eventually.",
      "created_utc": 1589135990.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fq75ypz",
      "author": "nopizzaonmypineapple",
      "body": "Yeah that's what people tell me too.",
      "created_utc": 1589142224.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l7oevzq",
      "author": "Stick-Murky",
      "body": "Grow up and eat like a man",
      "created_utc": 1717855955.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mcopeyw",
      "author": "Nonfictional_Strange",
      "body": "Sounds like bullshit to me.",
      "created_utc": 1739510810.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n1vgfmw",
      "author": "Im_gonna_delete_this",
      "body": "I mean I am going to get all the down votes and I really don't care. \n\nBut I understand how people have their own challenges and neurodivergent issues that they go through and all the rest. \n\nBut this one in particular and it being viewed alongside people who have like severe levels of autistic struggles where they are self harming and can barely function throughout the day. \n\nHow taking the simple notion of you don't like certain foods or certain foods bother you or it's a text or thing or whatever but instead you now need to make it this whole thing so you can get all this attention I don't buy it I never will.\n\nAnd of course just like with all the other crap these days people are going to validate it because why it means money it means money to the therapist that indulge this shit and then the people that make the content for it it's money and engagement for them and it boosts them in the algorithm and blah blah fucking blah...\n\nLike honestly with 90% of the bullshit out there I would have more empathy for people if they didn't need to make it like their whole personality and if they could just like shut the fuck up about it. \n\nIt used to be people were all about veganism and now that that is seeing the kind of falling off it doesn't seem to get you as much attention points like it used to 10 years ago now people are trying whatever to feel special it's gross",
      "created_utc": 1751922696.0,
      "score": 1,
      "context": [
        {
          "id": "l7oevzq",
          "author": "Stick-Murky",
          "body": "Grow up and eat like a man",
          "created_utc": 1717855955.0
        }
      ]
    }
  ]
}