{
  "id": "gj41xs",
  "subreddit": "ARFID",
  "author": "et_hel",
  "created_utc": 1589392820.0,
  "title": "crying happy tears right now",
  "selftext": "found this sub at 3am last night, I was up late on YouTube and found a vid about lesser known eating disorders. halfway through the vid he started talking about ARFID, I was so shocked, it's always been a mystery for me as to why my diet is so limited and why I get so anxious trying new foods etc. I've always been ridiculed and called childish or a spoiled brat because of my eating habits so when I finally found people I could relate to I literally sobbed. I thought I was alone and no one else was like me, it's so refreshing to finally find a community. :')",
  "url": "https://www.reddit.com/r/ARFID/comments/gj41xs/crying_happy_tears_right_now/",
  "score": 92,
  "num_comments": 9,
  "comments": [
    {
      "id": "fqin4h2",
      "author": "RedloxXD",
      "body": "Good for you man! This is a friendly sub so dont be afraid to ask!",
      "created_utc": 1589398212.0,
      "score": 17,
      "context": []
    },
    {
      "id": "fqk09n5",
      "author": "onmyown253",
      "body": "This is basically how I found out. I had a project in my health class in high school back in 2017 and had to present on eating disorders. I did a lot of research and came across ARFID. I read  every article I could find with tears in my eyes because everything made sense. I went to my mom and showed it to her and she was in shock too. It was the most refreshing feeling knowing I wasn’t alone in all of this.",
      "created_utc": 1589417947.0,
      "score": 14,
      "context": []
    },
    {
      "id": "fqiwpao",
      "author": "celestialcryptid",
      "body": "welcome friend!!! <3",
      "created_utc": 1589401913.0,
      "score": 7,
      "context": []
    },
    {
      "id": "fqj7kf0",
      "author": "altoid420",
      "body": "What I’ve noticed with this sub is that everyone is so friendly and accepting, I’m sure you’ll fit right in :)",
      "created_utc": 1589406123.0,
      "score": 8,
      "context": []
    },
    {
      "id": "fqja0ab",
      "author": "I_own_18_penguins",
      "body": "Aw hello! If you ever want any advice/support I'm always around for a chat ❤",
      "created_utc": 1589407067.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fqkgpod",
      "author": "Naejakire",
      "body": "Yeah I was the same way until one night I google \"extreme picky eating\" and found ARFID. it was like everything finally made sense!",
      "created_utc": 1589426924.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fqsnqgb",
      "author": "None",
      "body": "Me too, I just discovered this sub. \n\nI always felt so childish for not being able to eat when my friends all went out to a cafe. It was to the point where they were even buying/making food FOR me because I wasn't eating enough, which made me feel even worse because half the time I'd just gag on it and they'd have to eat it for me. And when I do manage to eat, it's almost never \"healthy\" meals (one time I was sitting in the food court with my best friend, eating a jar of pickles and dipping bread in the pickle juice... But that was still a good time for me because I actually managed to eat something)",
      "created_utc": 1589612682.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fql32oj",
      "author": "LairaLuna",
      "body": "This is pretty much how I found out too. Welcome, we’re happy to have you and we’re all gonna get through it together 🖤",
      "created_utc": 1589444540.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fqut33j",
      "author": "Veeone-",
      "body": "It’s crazy how different safe foods can be for everyone. Reading your comment shocked me because I’m my forties now and I’ve tried most foods and built an entire healthy diet over the course of 20 plus years of combating this, but the single food I can’t imagine even tasing are pickles. I still gag at the thought of tasting pickles and could not imagine dipping bread in pickle juice and eating it... yet for you it’s a safe food. I think one of the main challenges with ARFID is how there are similar through lines of experience and trauma for all of us, yet the particular challenges can be so overwhelmingly different.",
      "created_utc": 1589664157.0,
      "score": 3,
      "context": [
        {
          "id": "fqsnqgb",
          "author": "None",
          "body": "Me too, I just discovered this sub. \n\nI always felt so childish for not being able to eat when my friends all went out to a cafe. It was to the point where they were even buying/making food FOR me because I wasn't eating enough, which made me feel even worse because half the time I'd just gag on it and they'd have to eat it for me. And when I do manage to eat, it's almost never \"healthy\" meals (one time I was sitting in the food court with my best friend, eating a jar of pickles and dipping bread in the pickle juice... But that was still a good time for me because I actually managed to eat something)",
          "created_utc": 1589612682.0
        }
      ]
    }
  ]
}