{
  "id": "gkcifi",
  "subreddit": "ARFID",
  "author": "ronnieroo666",
  "created_utc": 1589560656.0,
  "title": "my fiancé tried a trigger food today",
  "selftext": "when my fiancé’s mom made me mozzarella sticks and he came to bring them to me, he hesitated and looked at me as i ate one. he asked me what cheese tasted like and i shrugged and said, “i dunno. salty. different cheeses taste different.” and he watched me for a little while longer before asking me if i thought he should try a bite. i said that even though cheese is a trigger food for him, it’s fried and in a texture that i think he wouldn’t mind and might be able to get used to. i didn’t think he was going to actually, and that’s okay! i love answering his questions and reassuring him that it’s okay to not want to try things just as much as it’s okay to want to. but, next thing i knew, he was chewing! he took a bite of the corner and chewed slowly, but didn’t spit it out after one or two chews and didn’t even gag. he was actually able to confidently say that he didn’t hate it, which is a huge step! because though cheese is a trigger food for him, he’s able to eat it on pizza. so being able to see that he doesn’t hate cheese in another form may open his mind to trying cheese of other types and forms. i’ve found that the longer i’m with him the more he communicates with me about his relationship with food and almost ‘admits’ that he feels as if it’s almost a debilitating problem in his life, and in turn he’s been trying VERY hard to be open to trying things. i wanted to post here because i want him to see that people relate to him and are proud of him. he said it was one of the hardest things he’s ever done and he felt proud of himself and that made ME insanely happy.\n\ntl;dr fiancé tried cheese for the first time not on pizza and didn’t spit it out or hate it, i was very proud of him and wanted to share with all of you!",
  "url": "https://www.reddit.com/r/ARFID/comments/gkcifi/my_fiancé_tried_a_trigger_food_today/",
  "score": 100,
  "num_comments": 7,
  "comments": [
    {
      "id": "fqq8t20",
      "author": "celestialcryptid",
      "body": "aww, that's great! this made me so happy!  \ndid he dip it in tomato sauce? maybe he would like it more bc then it would be more similar to pizza",
      "created_utc": 1589561353.0,
      "score": 25,
      "context": []
    },
    {
      "id": "fqqt97a",
      "author": "MrsSevigor",
      "body": "This literally makes me want to cry. My husband is super supportive about my restricted eating and knows how frustrating it is for me. He will offer things for me to try occasionally, but knows to never push. Because he’s been the most understanding and least pressuring person in my life about it, I’ve probably gained around 8 different foods in the 6 years we’ve been together. The biggest strides happen when you decide you want to try something on your own, rather than having people just insist to you that it’s good.",
      "created_utc": 1589571546.0,
      "score": 17,
      "context": []
    },
    {
      "id": "fqrs356",
      "author": "LostArtof33",
      "body": "You're amazing, the world needs more supportive partners like you!",
      "created_utc": 1589590710.0,
      "score": 9,
      "context": []
    },
    {
      "id": "fqqda5u",
      "author": "ronnieroo666",
      "body": "i didn’t even think of that but i will definitely bring it up to him! thanks so much for the tip!!",
      "created_utc": 1589563532.0,
      "score": 12,
      "context": [
        {
          "id": "fqq8t20",
          "author": "celestialcryptid",
          "body": "aww, that's great! this made me so happy!  \ndid he dip it in tomato sauce? maybe he would like it more bc then it would be more similar to pizza",
          "created_utc": 1589561353.0
        }
      ]
    },
    {
      "id": "fqr3e2n",
      "author": "growaway2018",
      "body": "Yes!!! I also am a little easier to be persuaded with “you might like this” and they explain why, comparing it to foods I do like that are similar. I don’t know why people can’t figure out just saying “it’s good” means nothing, even to non-ARFID people. Taste is relative and personal. I love seaweed snacks and aloe vera drinks and yet my “normal” coworkers all make fun of me and say how gross that stuff is.",
      "created_utc": 1589576842.0,
      "score": 6,
      "context": [
        {
          "id": "fqqt97a",
          "author": "MrsSevigor",
          "body": "This literally makes me want to cry. My husband is super supportive about my restricted eating and knows how frustrating it is for me. He will offer things for me to try occasionally, but knows to never push. Because he’s been the most understanding and least pressuring person in my life about it, I’ve probably gained around 8 different foods in the 6 years we’ve been together. The biggest strides happen when you decide you want to try something on your own, rather than having people just insist to you that it’s good.",
          "created_utc": 1589571546.0
        }
      ]
    },
    {
      "id": "fqr1uy6",
      "author": "ronnieroo666",
      "body": "yes! this! i know he’ll crawl back into his shell if i insist that a food is really yummy.",
      "created_utc": 1589576037.0,
      "score": 3,
      "context": [
        {
          "id": "fqqt97a",
          "author": "MrsSevigor",
          "body": "This literally makes me want to cry. My husband is super supportive about my restricted eating and knows how frustrating it is for me. He will offer things for me to try occasionally, but knows to never push. Because he’s been the most understanding and least pressuring person in my life about it, I’ve probably gained around 8 different foods in the 6 years we’ve been together. The biggest strides happen when you decide you want to try something on your own, rather than having people just insist to you that it’s good.",
          "created_utc": 1589571546.0
        }
      ]
    },
    {
      "id": "fqrx5w6",
      "author": "ronnieroo666",
      "body": "thank you i needed to hear that right now",
      "created_utc": 1589593790.0,
      "score": 5,
      "context": [
        {
          "id": "fqrs356",
          "author": "LostArtof33",
          "body": "You're amazing, the world needs more supportive partners like you!",
          "created_utc": 1589590710.0
        }
      ]
    }
  ]
}