{
  "id": "gwspxe",
  "subreddit": "ARFID",
  "author": "None",
  "created_utc": 1591312625.0,
  "title": "Is anyone else ironically obsessed with cooking shows & how to make food?",
  "selftext": "I absolutely ADORE cooking/baking shows. I love watching videos and documentaries about foreign cuisine, or watching people make food. I love learning how to prepare meals. I don't cook much but when I do, I get super into it. I just find it funny considering I hate eating most foods and am almost always terrified of trying new food. I feel like my fascination with food actually stems from ARFID, like I'm exploring a forbidden world or something lol. Which is why I wonder if anyone feels this way as well?",
  "url": "https://www.reddit.com/r/ARFID/comments/gwspxe/is_anyone_else_ironically_obsessed_with_cooking/",
  "score": 97,
  "num_comments": 26,
  "comments": [
    {
      "id": "fsx1um9",
      "author": "None",
      "body": "so relatable!!",
      "created_utc": 1591314799.0,
      "score": 15,
      "context": []
    },
    {
      "id": "fsx767b",
      "author": "DinosaurEarrings",
      "body": "I love cooking and baking shows. I am one of the best and most adventurous cooks in my family. I make so many foods that my family and friends say, 'oh it's so delicious, you made it, you should taste how good it is!' and I'm just standing there like, 'no'.",
      "created_utc": 1591317765.0,
      "score": 17,
      "context": []
    },
    {
      "id": "fsx5o6m",
      "author": "bjaabja",
      "body": "Today i was sitting in the kitchen, putting off making dinner even tho i was really hungry, and watching videos of people cooking food i wouldnt even want to smell, so yea! I kind of hope its going to slowly make my thoughts about food more positive 🤔",
      "created_utc": 1591316916.0,
      "score": 11,
      "context": []
    },
    {
      "id": "fsx7fgg",
      "author": "invisibilitycap",
      "body": "Yes! I'm only eighteen so I grew up with Good Eats and now sometimes join my mom when she watches the Great British Bakeoff on Netflix. I've also seen at least one episode of Nailed It!",
      "created_utc": 1591317909.0,
      "score": 9,
      "context": []
    },
    {
      "id": "fsx8loe",
      "author": "Wav3_F0rm",
      "body": "This isn't just me?! I though this was so weird as well as the fact that I love cooking hahah",
      "created_utc": 1591318572.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fsx7tti",
      "author": "None",
      "body": "Yes! I love cooking and it makes me so happy when people eat everything and give compliments",
      "created_utc": 1591318135.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fsxaq6b",
      "author": "None",
      "body": "I'm definitely like this lol I wonder if it's because since we struggle so hard with food we fixate on it? Also it's probably a lot easier to watch other people prep and eat food we don't like on a screen because we don't actually have to smell it or eat it ourselves, so we can vicariously enjoy the meal I guess? Lol",
      "created_utc": 1591319784.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fsxdjc3",
      "author": "axw3555",
      "body": "***Just in case - minor trigger warning for blood in the context of food.***\n\nTBH, the only \"reality\" shows I'll watch are the \"demonstrate a genuine talent\" type. \n\nPut crap like big brother, the bachelor, etc on, I'll want to throw something through the screen.\n\nBut just this week I've watched portrait artist of the year, landscape artist of the year, forged in fire, bake off, and pottery throw down. Of those, the only one I have *any* experience of as an adult (never mind talent) is pottery. \n\nAnd food ones are the most common ones for me to watch - masterchef, celeb masterchef, bake off, bake off the professionals, great British menu, random \"so and so goes somewhere\" type shows. \n\nThe greatest irony is that when I was at school, in my last 2 years, we had a thing called \"free option\" - a class that wasn't part of our A-Levels. You could do stuff like reading to primary school kids, music, dragonboat racing, but I did a thing that was nominally an environment class, but which was really just a load of fun - most of our classes involved games of blackjack, cheat, texas holdem etc. \n\nBut every so often, we'd actually do something. The school had six beehives, so we made candles or wood polish from the wax, that kind of thing. The only one that ever caused controversy was the time we made black pudding (blood sausage). Out of twelve of us in the class, ten refused to do it. The two who would? The vegetarian girl, and me, the guy with the undiagnosed eating disorder. The other ten wouldn't come within ten feet of where me and the girl were mixing the blood, suet and oatmeal. \n\nThat's the weirdest thing about ARFID for me - if you were to say to me \"would you eat black pudding\", I'd roll around laughing on the floor for about an hour at the thought of how ridiculous that thought was. But if you need someone to help make it, it doesn't trigger the same response unless I think about trying to eat it.",
      "created_utc": 1591321395.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fsxk2hx",
      "author": "adhdoverplanner",
      "body": "SAME. I've gotten really into it recently. Before it was more like a strange fascination like you describe. Then when I started dating my girlfriend, she helped get more comfortable trying new things by lessening the guilt I associate with trying something new, not liking it and then being the odd one out / disappointing others / wasting food. She would just eat what I don't like and just be happy that I tried. We tried a few times those meal kits delivered by mail, and that's what really helped me get into cooking. We would try things together, I would eat whatever I could and she would eat the rest, and it also helped me getting a bit more confortable with smells and textures I'm adverse to. Still can't eat them, but it's a small step. I've gotten really into cooking as it also satisfies my inner Latina mom within me that needs to feed everyone. Now that write this though, I'll admit my mind has been less into trying to work on expanding my safe foods and more on just feeding my girlfriend. But in any case, cooking has been really helpful.",
      "created_utc": 1591325185.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fsxnfg7",
      "author": "ohhyouknow",
      "body": "omg yes. I like watching street food videos on youtube as well. It's crazy I actually bake and create lot of stuff I'd never eat for my family, I get a lil' inspired sometimes haha.",
      "created_utc": 1591327204.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fsyc9um",
      "author": "sazydoll",
      "body": "I am doing baby led weaning with my son and have done for the last 6 months. It's exposed me to so many foods I wouldn't even normally touch, never mind actually make meals from. I still won't eat any of it, but the baby and my husband seem to like what I cook and I actually enjoy doing it. Cleaning up the mess on the floor and counters afterwards is a real struggle for me though. And wiping down the baby after he's made a mess.",
      "created_utc": 1591345738.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ft0tt8i",
      "author": "WTFShouldIBeCalled",
      "body": "I read somewhere once that people with eating disorders tend to get really obsessed with things like cooking shows or cookbooks or whatever because so many cultures are so obsessed with food, but obviously we don’t eat much (or in our case, we don’t have much variety), but we still feel like we need something food related in our lives to obsess over, since that’s what everyone else is doing??\n\nIdk I’d that makes sense. It was worded so much better when I read it, but it’s been a while since I saw that article. I guess we just use cooking shows to replace the obsessiveness over actual food that everyone else seems to have.",
      "created_utc": 1591396868.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ft12c2l",
      "author": "EggGamingView",
      "body": "YES! I hate like 90% of \"normal\" food that most people eat, but I love watching MasterChef and think the food looks delicious... That being said I'd never eat any of it",
      "created_utc": 1591400765.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fteq3ns",
      "author": "queso4lyfe",
      "body": "I’m so glad everyone else is this way too! And the food always looks so so good, even though I know I would puke if I tried to eat it.",
      "created_utc": 1591650227.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fsxpyrw",
      "author": "robynxcakes",
      "body": "Yep definitely even though I would hardly eat half the things they make I enjoy them",
      "created_utc": 1591328757.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fsxvsx4",
      "author": "ThatAstrologyHoe",
      "body": "I only like competitive cooking/baking shows so idk if that more speaks to my love of competition/shit reality tv instead",
      "created_utc": 1591332538.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fsy0p5o",
      "author": "None",
      "body": "Not really into cooking shows, but I love cooking at my job. Don’t do it much in my free time because no one in my house will eat it. But we have a sandwich menu and I go through a lot of effort to make it look good. Chopping lettuce a little more than it is already on the line, toasting the bread to get it to the right golden brown, drizzling on toppings instead of spreading on the bun, melting just enough cheese. I go through all this just to make it look nice, I have no clue what they taste like. Always thought it as odd.",
      "created_utc": 1591336031.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fsypkhg",
      "author": "Brainlesskiddo",
      "body": "Same here, especially when I was younger I loved cooking and baking even though I knew that I will probably never be able to eat any of this. There even was a time when I cooked for my parents every Friday evening.",
      "created_utc": 1591357910.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fsz26k5",
      "author": "sad-crayola-rainbows",
      "body": "I don’t mind cooking shows most of the time, although sometimes the food grossed me out. \n\nOn the other hand, I freaking LOVE baking shows. I don’t really do any cooking, but I feel like I make up for it by being a pretty decent baker. Plus, nothing on a baking show has ever made me feel nauseous.",
      "created_utc": 1591365896.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fszi1gi",
      "author": "Kelekona",
      "body": "I'm just picky, but I can totally get how enjoying images of food that can't hurt you might be therapeutic.",
      "created_utc": 1591373801.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ft1d5y5",
      "author": "jade35mm",
      "body": "in the hospital it was all I watched. I never slept and probably watched food network and hgtv 18 hours a day... tasty videos are my crack still",
      "created_utc": 1591405492.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ft22rr9",
      "author": "sleepyquartz",
      "body": "yes absolutely!! especially youtube videos about making food!! my sister (who is very lovely and supportive) asked me why I was so interested in it regardless of my arfid, and I think it might be because I'm living vicariously through the videos and shows? it's really interesting regardless",
      "created_utc": 1591417162.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fsxdep8",
      "author": "None",
      "body": "The Bake Off is actually what made me think about this! I'm absolutely obsessed with that show and want to try baking SO many of the foods on there, yet I don't want to actually try eating the majority of it lol.",
      "created_utc": 1591321321.0,
      "score": 4,
      "context": [
        {
          "id": "fsx7fgg",
          "author": "invisibilitycap",
          "body": "Yes! I'm only eighteen so I grew up with Good Eats and now sometimes join my mom when she watches the Great British Bakeoff on Netflix. I've also seen at least one episode of Nailed It!",
          "created_utc": 1591317909.0
        }
      ]
    },
    {
      "id": "fsxcuv7",
      "author": "None",
      "body": "Same! It makes me happy when I can prepare something that both I & others enjoy",
      "created_utc": 1591321005.0,
      "score": 2,
      "context": [
        {
          "id": "fsx7tti",
          "author": "None",
          "body": "Yes! I love cooking and it makes me so happy when people eat everything and give compliments",
          "created_utc": 1591318135.0
        }
      ]
    },
    {
      "id": "fsxk7v4",
      "author": "None",
      "body": "That's awesome! My boyfriend is fortunately super supportive like that too & it's helped me to try eating/cooking more food",
      "created_utc": 1591325275.0,
      "score": 2,
      "context": [
        {
          "id": "fsxk2hx",
          "author": "adhdoverplanner",
          "body": "SAME. I've gotten really into it recently. Before it was more like a strange fascination like you describe. Then when I started dating my girlfriend, she helped get more comfortable trying new things by lessening the guilt I associate with trying something new, not liking it and then being the odd one out / disappointing others / wasting food. She would just eat what I don't like and just be happy that I tried. We tried a few times those meal kits delivered by mail, and that's what really helped me get into cooking. We would try things together, I would eat whatever I could and she would eat the rest, and it also helped me getting a bit more confortable with smells and textures I'm adverse to. Still can't eat them, but it's a small step. I've gotten really into cooking as it also satisfies my inner Latina mom within me that needs to feed everyone. Now that write this though, I'll admit my mind has been less into trying to work on expanding my safe foods and more on just feeding my girlfriend. But in any case, cooking has been really helpful.",
          "created_utc": 1591325185.0
        }
      ]
    },
    {
      "id": "ft0buej",
      "author": "invisibilitycap",
      "body": "Ha, agreed! Everything looks so good!!",
      "created_utc": 1591388033.0,
      "score": 1,
      "context": [
        {
          "id": "fsx7fgg",
          "author": "invisibilitycap",
          "body": "Yes! I'm only eighteen so I grew up with Good Eats and now sometimes join my mom when she watches the Great British Bakeoff on Netflix. I've also seen at least one episode of Nailed It!",
          "created_utc": 1591317909.0
        },
        {
          "id": "fsxdep8",
          "author": "None",
          "body": "The Bake Off is actually what made me think about this! I'm absolutely obsessed with that show and want to try baking SO many of the foods on there, yet I don't want to actually try eating the majority of it lol.",
          "created_utc": 1591321321.0
        }
      ]
    }
  ]
}