{
  "id": "hmo403",
  "subreddit": "ARFID",
  "author": "twentyfivebuckduck",
  "created_utc": 1594097863.0,
  "title": "My mother in law accommodated me without being asked and I cried",
  "selftext": "My mother in law makes “braided Swiss loaves” for the family that they all really like. I don’t like them, I can’t handle lunch meat, so I generally eat the bread around it or slyly don’t eat (you know how it is) \n\nShe’s always been super supportive of me, never demanding about my eating like my parents are. \n\nMy parents and I happened to get in a fight a couple of weeks ago and I’ve been NC, so I was excited to go visit the in laws for dinner. \n\nWe got there late and found out that not only had she made some with pizza filling, but she had vehemently guarded it from everyone else, and let me cut into it and have it all to myself. \n\nI never told her I don’t like braided Swiss loaves (it gets old explaining everything that I don’t like) she just noticed. And knew I would like pepperoni (only) pizza, so she made me one. I cried when I got to bed at the end of the day.",
  "url": "https://www.reddit.com/r/ARFID/comments/hmo403/my_mother_in_law_accommodated_me_without_being/",
  "score": 239,
  "num_comments": 10,
  "comments": [
    {
      "id": "fx6fu8s",
      "author": "The_Ajna",
      "body": "That’s so sweet of her I know how hard certain food can be and it’s so relieving having someone understand",
      "created_utc": 1594100335.0,
      "score": 45,
      "context": []
    },
    {
      "id": "fx6ivs6",
      "author": "cj7695",
      "body": "I have an aunt that does that. She always makes sure there is something I can eat even if it’s just an appetizer or snack. And she never pressures me or is annoyed by it.",
      "created_utc": 1594102897.0,
      "score": 25,
      "context": []
    },
    {
      "id": "fx6juta",
      "author": "bobainwonderland",
      "body": "This is beautiful. 💜 I’ve started to see someone new and his mom found out I’m weird with mushrooms and said “why didn’t you tell me! What can I make for you next time?” And my heart melted. I’ve met this woman less than 10 times and she cares enough to listen to me briefly tell her sister I’m sensitive with mushrooms",
      "created_utc": 1594103765.0,
      "score": 20,
      "context": []
    },
    {
      "id": "fx6v1hv",
      "author": "TemperanceL",
      "body": "Make sure you tell her you really appreciate the attention she paid to you, that's really sweet of her.",
      "created_utc": 1594114850.0,
      "score": 9,
      "context": []
    },
    {
      "id": "fx6i2m6",
      "author": "Squedder",
      "body": "That's so nice of her",
      "created_utc": 1594102195.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fx6zyhx",
      "author": "Chikeerafish",
      "body": "Supportive family is the BEST. My FMIL is so good, even though I'm sure she doesn't understand. She makes sure whatever they're having for dinner, there's always pasta for me. We all went to Disney last year with my FH's cousins and grandparents etc, and she made sure every restaurant we went to had food for me so I never had to feel uncomfortable. \n\nHis family likes to joke that I'm stuck with them now, but honestly, I couldn't imagine better in-laws to have.",
      "created_utc": 1594119806.0,
      "score": 7,
      "context": []
    },
    {
      "id": "fx9cwn3",
      "author": "None",
      "body": "I know how you feel! My step-mom is constantly trying to make foods I like, and goes out of her way to try and accommodate me. In comparison, my mom would force-feed me whatever she made even if I offered to cook for myself",
      "created_utc": 1594165342.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fy1ckem",
      "author": "None",
      "body": "That's a keeper right there. My fiance's mother is wonderful about my ARFID, even since we were just friends 8-9 years ago and I would go over to her house to hang out. \n\nHer mom always offered to make me some plain buttered noodles or whatever if I didn't like what they were having. That's continued almost a decade later as they've welcomed me into their family. \n\nDoesn't matter if it's a big family meal like Thanksgiving or an important event, they always make sure I have something to eat or let me know to eat beforehand so I won't be uncomfortable, and with the exception of her elderly grandma her whole family is so great at not asking me lots of questions or making me feel bad about it.",
      "created_utc": 1594735481.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fza66tt",
      "author": "not-a-planet",
      "body": "People hear me say that ARFID is an eating disorder and try to \"cure\" me by making me panic and cry then starve. Which is a bitch move on their part. This sounds so nice. I hope I find someone that does this. Congrats",
      "created_utc": 1595748794.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fx9qc04",
      "author": "None",
      "body": "i second this!",
      "created_utc": 1594173176.0,
      "score": 2,
      "context": [
        {
          "id": "fx6v1hv",
          "author": "TemperanceL",
          "body": "Make sure you tell her you really appreciate the attention she paid to you, that's really sweet of her.",
          "created_utc": 1594114850.0
        }
      ]
    }
  ]
}