{
  "id": "hxpq70",
  "subreddit": "ARFID",
  "author": "urlocaljanedoe",
  "created_utc": 1595695246.0,
  "title": "mom purposefully used expired milk in my food",
  "selftext": "i’m 20 but i still live at home. my mom knows about my ED, she knows how picky i am, she knows i won’t eat something if anything is remotely “bad” or if there are secret ingredients in there. \n\nabout a week ago she made one of my safe foods for me, fettuccini alfredo. i ate it and honestly it didn’t taste out of the normal. it tasted okay. \n\nshe told me today that she used expired milk to make it to “prove” to me that it’s all in my head and i can eat things just fine as long as i don’t know what’s in there. \n\ni literally threw up when i heard that. there goes another safe food. i don’t think i’ll ever be able to eat creamy sauces again out of fear. i fucking hate this shit",
  "url": "https://www.reddit.com/r/ARFID/comments/hxpq70/mom_purposefully_used_expired_milk_in_my_food/",
  "score": 144,
  "num_comments": 20,
  "comments": [
    {
      "id": "fz801tz",
      "author": "rhapsodypenguin",
      "body": "My 15yo son has ARFID, and my ex-husband (his dad) is constantly trying to sneak things into his safe foods, or lie about what he’s making. It is now to the point that my son won’t go see his dad anymore because he just can’t trust him. \n\nThat’s a horrible thing to do someone, even just someone that doesn’t like a certain food, let alone someone with an eating disorder affecting how they eat. \n\nI apologized to my son this week about the trauma I put him through when he was younger and I didn’t understand - and even then it was never about tricking him, I just pressured him more than I should have. I cannot imagine doing something like this and feeling victorious about it. \n\nI’m sorry.",
      "created_utc": 1595704003.0,
      "score": 49,
      "context": []
    },
    {
      "id": "fz7l8t7",
      "author": "None",
      "body": "That's a really horrible and frankly dangerous thing for your mom to do. If the milk had been really spoiled, then you could have been very sick. I'm sorry this happened to you.",
      "created_utc": 1595696126.0,
      "score": 89,
      "context": []
    },
    {
      "id": "fz7l45j",
      "author": "swoop-red",
      "body": "This has always been a fear of mine. It's such a betrayal of trust. Sorry that this happened to you",
      "created_utc": 1595696055.0,
      "score": 34,
      "context": []
    },
    {
      "id": "fz7qks8",
      "author": "coarsekitten",
      "body": "When I was around 15, I went through a vegetarian phase and these days my stepdad delights in telling me he used to sneak meat in my food, and he says it like he's so proud and like it's the funniest thing, but everytime I just want to punch him. It's a huge betrayal of trust. I feel you, OP. I'm sorry this happened to you.",
      "created_utc": 1595698982.0,
      "score": 30,
      "context": []
    },
    {
      "id": "fz8447k",
      "author": "None",
      "body": "Well, if it makes you feel better. Before modern baking powders and such, in baking you had to use expired milk. Rancid Milks have genuine cooking uses, its basically buttermilk.\n\nIts not as dangerous as everyone here says, while drinking rancid milk is a bad idea cooking it isn't as bad as one might expect, especially in high heat-cooked creamy dishes.\n\nI know this probably doesn't help you, your fear of old milk isn't invalidated by this, nor by what your mom did. This is to say that, what he did was completely pointless and proved nothing.",
      "created_utc": 1595705673.0,
      "score": 16,
      "context": []
    },
    {
      "id": "fz7qqmv",
      "author": "None",
      "body": "i’m so incredibly sorry. a friend of mine did this one time when they made me food and since then i won’t let anyone make me food.",
      "created_utc": 1595699068.0,
      "score": 8,
      "context": []
    },
    {
      "id": "fz7ws4f",
      "author": "Imjustasmolpotato",
      "body": "I’m so sorry this happened to you. I have somewhat good news, though. Because milk is ultra-pasteurized, even if the texture changes or it’s left out a little too long, there’s less of a chance you will be sick. Furthermore, expiration dates are pretty subjective and often just reflect when the company feels their product is at its best, and using it a couple of days past that date probably won’t hurt you either. Still, this is a clear betrayal of trust and with ARFID, things like this are really hard. I’m sorry you had to go through this. I’d recommend making all of your own meals, or having a serious conversation with your mom about the implications of her actions and how she made you feel. You can get through this! Sending you love ❤️",
      "created_utc": 1595702248.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fz8hlz2",
      "author": "celestialcryptid",
      "body": "i am so, so sorry. this is just horrible :(",
      "created_utc": 1595710291.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fz8uany",
      "author": "None",
      "body": "This is why I don't let my parents touch my food anymore. I'm so sorry that happened. ARFID aside, what your mom did is a manipulative and dangerous thing to do to someone.",
      "created_utc": 1595716305.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fz8dh58",
      "author": "DrBarkerMD",
      "body": "See, unless you explicitly ask to put something in the food you dont know about (I do! I've had spinach before because of that. I don't do that with everything, because meats really give me an ick reaction, but I do ask for some secret ingredient.) It's not her place to do that. \n\nHell, I think people without an ED wouldn't find that a good thing. It's wrong regardless. I can see this being done with someone that had an allergy or an intolerance etc. \n\nBad all around.",
      "created_utc": 1595709027.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fz7n6rk",
      "author": "axw3555",
      "body": "***NEVER*** let her near your food again. ***EVER***. Cook everything yourself, eat away from her, if you can, keep your ingredients in a locked cupboard in your room.\n\nThen tell her that if you ever catch her doing anything like that again, you're upending it on her bed. The next time and every time after that, it's over her head, regardless of how hot it might be. Then treat her like she's dead for a couple of weeks. If she speaks, ignore her, if practical, leave any room she enters and block your door so she can't get in.\n\nI usually try to be measured in my responses, but this one is *unforgivable*.",
      "created_utc": 1595697173.0,
      "score": 9,
      "context": []
    },
    {
      "id": "fz9izku",
      "author": "kdadd001",
      "body": "This is why I don’t eat when other people cook.",
      "created_utc": 1595730967.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fzac5fe",
      "author": "Henry08353",
      "body": "Pretty sure this is illegal since she knew the milk was expired and could harm you, I’d look at moving out real soon because that’s toxic asf",
      "created_utc": 1595754930.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fz7ueaf",
      "author": "socialdotexe",
      "body": "I don't think that's true, though. Expiry dates aren't what they are made out to be. And milk that's gone \"off\" is very obvious. Besides, if it's pasteurized, it'd probably be safe to consume, even if it's gone sour; it just won't taste very good. You can use it in some recipes, though.\n\nThat said, their mom playing tricks on them was not okay.\n\nMore on expiry dates and milk:  \n[https://youtu.be/l5Rb7T87LJA](https://youtu.be/l5Rb7T87LJA)",
      "created_utc": 1595700970.0,
      "score": 38,
      "context": [
        {
          "id": "fz7l8t7",
          "author": "None",
          "body": "That's a really horrible and frankly dangerous thing for your mom to do. If the milk had been really spoiled, then you could have been very sick. I'm sorry this happened to you.",
          "created_utc": 1595696126.0
        }
      ]
    },
    {
      "id": "fz8tax3",
      "author": "StopmeowingPaul",
      "body": "My parents did this when I was vegetarian as a teenager too, and they also think it's funny to recall. It sucks so much. And now as a vegan 24 year old they wonder why I have such bad trust issues with food 🙄",
      "created_utc": 1595715756.0,
      "score": 7,
      "context": [
        {
          "id": "fz7qks8",
          "author": "coarsekitten",
          "body": "When I was around 15, I went through a vegetarian phase and these days my stepdad delights in telling me he used to sneak meat in my food, and he says it like he's so proud and like it's the funniest thing, but everytime I just want to punch him. It's a huge betrayal of trust. I feel you, OP. I'm sorry this happened to you.",
          "created_utc": 1595698982.0
        }
      ]
    },
    {
      "id": "fz8h289",
      "author": "urlocaljanedoe",
      "body": "honestly, it’s not even that i’m necessarily scared of becoming sick from it. just the fact that it has become “old” is what gets me, even if i know logically the milk won’t make me sick even if i drink it after expiry. but usually i don’t touch anything once it hits like one week before expiry just to be safe, so knowing i ingested something at least a few days past “expiry” is what made me feel so sick. \n\nat this point i know my only option is to move out, ive been saving up money to be able to somehow live on my own. this is just one of many, many things my mom has done surrounding my ED and mental health in general. just to put it in perspective... at 15 years old i was put into inpatient treatment for my ED, stayed there for around 5 months. nearing the end, when i was still at a bmi considered under normal, my mom told me “i think this weight that the dietician set is too high for you. it makes your face look puffy.” and i ended up getting out because my mom would help me cheat my weigh ins. even went as far as to buy me those ankle weights that athletes use and helped me tape it around my body so that i wouldn’t go back to inpatient. \n\nidk. i really truly want to believe deep down my mom is trying to do what’s best for me, but in reality she’s hurting me. she knows about my picky food habits, and does things like this. i’ve told her my whole life that forcing me to eat gives me a lot of anxiety and actually makes me lose my appetite, and that i have to be ready to eat mentally and still to this day, she will constantly tell me “you NEED to eat” whether i just ate or not. like i can understand telling me these things when i was a minor and struggling more than i am now but now at 20 years old, it just pisses me off because she knows i hate it. it seriously fucking triggers me because when someone is commanding/forcing me to eat it, it frustrates me and immediately the way i’m looking at the food in front of me changes, and i just physically cannot eat with that kind of anxiety and having someone check up on my meals as a fucking adult. \n\ni’m so sorry this was more of a rant than a reply to your comment, i just had to let it out 😅",
      "created_utc": 1595710112.0,
      "score": 7,
      "context": [
        {
          "id": "fz7ws4f",
          "author": "Imjustasmolpotato",
          "body": "I’m so sorry this happened to you. I have somewhat good news, though. Because milk is ultra-pasteurized, even if the texture changes or it’s left out a little too long, there’s less of a chance you will be sick. Furthermore, expiration dates are pretty subjective and often just reflect when the company feels their product is at its best, and using it a couple of days past that date probably won’t hurt you either. Still, this is a clear betrayal of trust and with ARFID, things like this are really hard. I’m sorry you had to go through this. I’d recommend making all of your own meals, or having a serious conversation with your mom about the implications of her actions and how she made you feel. You can get through this! Sending you love ❤️",
          "created_utc": 1595702248.0
        }
      ]
    },
    {
      "id": "fz7uvhz",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1595701224.0,
      "score": -1,
      "context": [
        {
          "id": "fz7n6rk",
          "author": "axw3555",
          "body": "***NEVER*** let her near your food again. ***EVER***. Cook everything yourself, eat away from her, if you can, keep your ingredients in a locked cupboard in your room.\n\nThen tell her that if you ever catch her doing anything like that again, you're upending it on her bed. The next time and every time after that, it's over her head, regardless of how hot it might be. Then treat her like she's dead for a couple of weeks. If she speaks, ignore her, if practical, leave any room she enters and block your door so she can't get in.\n\nI usually try to be measured in my responses, but this one is *unforgivable*.",
          "created_utc": 1595697173.0
        }
      ]
    },
    {
      "id": "fz83zrd",
      "author": "soadfreak1214",
      "body": "I love the mature route but I feel that's a lost cause after the mom did this.  The mom knows why they feel betrayed.  You don't just put spoiled food into a meal.  No matter who it is that's eating it.  That's highly immature and doesn't deserve trust anymore. \n\nIf my mom spoiled my food on purpose I would not let her cook for me again.  I would tell her not to do it again and I lost all trust in her.  Then if she snuck into my food dish again and put something spoiled (after I had already talked to her), I would for sure ignore her for weeks (assuming I don't have the option to just move out).",
      "created_utc": 1595705607.0,
      "score": 3,
      "context": [
        {
          "id": "fz7n6rk",
          "author": "axw3555",
          "body": "***NEVER*** let her near your food again. ***EVER***. Cook everything yourself, eat away from her, if you can, keep your ingredients in a locked cupboard in your room.\n\nThen tell her that if you ever catch her doing anything like that again, you're upending it on her bed. The next time and every time after that, it's over her head, regardless of how hot it might be. Then treat her like she's dead for a couple of weeks. If she speaks, ignore her, if practical, leave any room she enters and block your door so she can't get in.\n\nI usually try to be measured in my responses, but this one is *unforgivable*.",
          "created_utc": 1595697173.0
        },
        {
          "id": "fz7uvhz",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1595701224.0
        }
      ]
    },
    {
      "id": "fz8cj35",
      "author": "axw3555",
      "body": "First Line of the OP.\n\n>my mom knows about my ED, she knows how picky i am, she knows i won’t eat something if anything is remotely “bad” or if there are secret ingredients in there\n\nThird line of the OP.\n\n>she told me today that she used expired milk to make it to “prove” to me that it’s all in my head\n\nTalkings been done. Mother doesn't care or respect the kid, and didn't want to behave like and adult, because putting expired milk in someones food isn't adult - it's so disrespectful that I can barely put it into words, so my honest feeling that I won't apologise for - FUCK HER! She's made her bed, now she lies in it.",
      "created_utc": 1595708661.0,
      "score": 3,
      "context": [
        {
          "id": "fz7n6rk",
          "author": "axw3555",
          "body": "***NEVER*** let her near your food again. ***EVER***. Cook everything yourself, eat away from her, if you can, keep your ingredients in a locked cupboard in your room.\n\nThen tell her that if you ever catch her doing anything like that again, you're upending it on her bed. The next time and every time after that, it's over her head, regardless of how hot it might be. Then treat her like she's dead for a couple of weeks. If she speaks, ignore her, if practical, leave any room she enters and block your door so she can't get in.\n\nI usually try to be measured in my responses, but this one is *unforgivable*.",
          "created_utc": 1595697173.0
        },
        {
          "id": "fz7uvhz",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1595701224.0
        }
      ]
    },
    {
      "id": "fz86xmi",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1595706621.0,
      "score": 1,
      "context": [
        {
          "id": "fz7n6rk",
          "author": "axw3555",
          "body": "***NEVER*** let her near your food again. ***EVER***. Cook everything yourself, eat away from her, if you can, keep your ingredients in a locked cupboard in your room.\n\nThen tell her that if you ever catch her doing anything like that again, you're upending it on her bed. The next time and every time after that, it's over her head, regardless of how hot it might be. Then treat her like she's dead for a couple of weeks. If she speaks, ignore her, if practical, leave any room she enters and block your door so she can't get in.\n\nI usually try to be measured in my responses, but this one is *unforgivable*.",
          "created_utc": 1595697173.0
        },
        {
          "id": "fz7uvhz",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1595701224.0
        },
        {
          "id": "fz83zrd",
          "author": "soadfreak1214",
          "body": "I love the mature route but I feel that's a lost cause after the mom did this.  The mom knows why they feel betrayed.  You don't just put spoiled food into a meal.  No matter who it is that's eating it.  That's highly immature and doesn't deserve trust anymore. \n\nIf my mom spoiled my food on purpose I would not let her cook for me again.  I would tell her not to do it again and I lost all trust in her.  Then if she snuck into my food dish again and put something spoiled (after I had already talked to her), I would for sure ignore her for weeks (assuming I don't have the option to just move out).",
          "created_utc": 1595705607.0
        }
      ]
    },
    {
      "id": "fz8b01a",
      "author": "soadfreak1214",
      "body": "I feel it depends more on this person's mom.  This seems borderline abusive to me.  Obviously if she has always been a great mother and this is a one time incident then maybe it was an odd out of character mistake on her part.  Maybe she deserves another chance.  However if this is a common occurrence (not spoiling food but just doing extreme things such as this) I can see ignoring her until I can move out as a good idea.  Just because someone is your family doesn't mean they deserve respect from you.  Raising a child is your responsibility as a mother.  If you do it in an abusive manner the child has every right to cut communication when they are old enough.  Although it may seem the child owes the mother because the mother still fed and housed and maybe even cared for them, they really don't.\n\nI personally love my mother.  I know how hard she worked to support me and I appreciate it and definitely treat her with respect because of it.  She's made mistakes and we got through them.  But she didn't do something that hurt me and then turn around and do it a second time on purpose.  Obviously OPs mom has not done it a second time yet and I again don't know this particular persons mother.  I definitely think it's over dramatic a bit but I still feel if the mom saw how upset their kid got the first time and did it a second time all bets are off at that point.\n\nSide note: the throwing up on her bed part is of course a real dramatic and petty part to this.  I don't think I would threaten my mom with this.  If we had a conversation and I trusted her again and she decided to spoil my food again and I felt I was gonna throw up...it's possible I may be petty enough to do it somewhere she wouldn't want me to.  Probably not really but it sounds like a good petty revenge that is fun to think of in your head.",
      "created_utc": 1595707993.0,
      "score": 2,
      "context": [
        {
          "id": "fz7n6rk",
          "author": "axw3555",
          "body": "***NEVER*** let her near your food again. ***EVER***. Cook everything yourself, eat away from her, if you can, keep your ingredients in a locked cupboard in your room.\n\nThen tell her that if you ever catch her doing anything like that again, you're upending it on her bed. The next time and every time after that, it's over her head, regardless of how hot it might be. Then treat her like she's dead for a couple of weeks. If she speaks, ignore her, if practical, leave any room she enters and block your door so she can't get in.\n\nI usually try to be measured in my responses, but this one is *unforgivable*.",
          "created_utc": 1595697173.0
        },
        {
          "id": "fz7uvhz",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1595701224.0
        },
        {
          "id": "fz83zrd",
          "author": "soadfreak1214",
          "body": "I love the mature route but I feel that's a lost cause after the mom did this.  The mom knows why they feel betrayed.  You don't just put spoiled food into a meal.  No matter who it is that's eating it.  That's highly immature and doesn't deserve trust anymore. \n\nIf my mom spoiled my food on purpose I would not let her cook for me again.  I would tell her not to do it again and I lost all trust in her.  Then if she snuck into my food dish again and put something spoiled (after I had already talked to her), I would for sure ignore her for weeks (assuming I don't have the option to just move out).",
          "created_utc": 1595705607.0
        },
        {
          "id": "fz86xmi",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1595706621.0
        }
      ]
    },
    {
      "id": "fz8dsry",
      "author": "axw3555",
      "body": ">But sometimes you just have to take the high road\n\nDo you know how many times I've been told to take the high road in my life? Do you know how many times it's actually solved anything? On a Venn diagram, it's two circles with zero intersection.\n\nAll taking the high road means is that you act like it never happened, and if you act like it never happened, then it comes across as \"it was OK, not a big issue\".\n\nYou take the high road on minor disagreements like getting into a row over decorating or going or spending too much on a hobby. Not on someone putting expired milk into the safe food of someone with ARFID, then smugly announcing it to them. OP literally said they've now lost an entire *category* of safe foods.\n\nIf you've got ARFID or live with someone who has, you know the impact that losing a safe food can have.\n\n>That seems a bit over the top and dramatic over an easily fixable situation. Just move on and take the steps to ensure your food is prepared the way you like it. No need to snub your Mom.\n\nWhat planet do you live on?\n\nEasily fixable? Unless you've got a time machine in your back yard, it's happened, it's not happening. The mother has violated trust, damaged her childs already limited diet and actually thinks they did the right thing.\n\nSnubbing her is the *absolute bare minimum* she deserves - it shows her that her actions have consequences. Honestly, I wouldn't blame OP if they moved out and went no contact permanently.\n\nAnd it's not a case of \"make sure the food is prepared the way you like it\". The mother *knows* how to prepare it. She just doesn't give a shit and decided to violate trust to prove that a mental illness is all in the head. No shit. That's why its called a MENTAL ILLNESS.",
      "created_utc": 1595709104.0,
      "score": 2,
      "context": [
        {
          "id": "fz7n6rk",
          "author": "axw3555",
          "body": "***NEVER*** let her near your food again. ***EVER***. Cook everything yourself, eat away from her, if you can, keep your ingredients in a locked cupboard in your room.\n\nThen tell her that if you ever catch her doing anything like that again, you're upending it on her bed. The next time and every time after that, it's over her head, regardless of how hot it might be. Then treat her like she's dead for a couple of weeks. If she speaks, ignore her, if practical, leave any room she enters and block your door so she can't get in.\n\nI usually try to be measured in my responses, but this one is *unforgivable*.",
          "created_utc": 1595697173.0
        },
        {
          "id": "fz7uvhz",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1595701224.0
        },
        {
          "id": "fz83zrd",
          "author": "soadfreak1214",
          "body": "I love the mature route but I feel that's a lost cause after the mom did this.  The mom knows why they feel betrayed.  You don't just put spoiled food into a meal.  No matter who it is that's eating it.  That's highly immature and doesn't deserve trust anymore. \n\nIf my mom spoiled my food on purpose I would not let her cook for me again.  I would tell her not to do it again and I lost all trust in her.  Then if she snuck into my food dish again and put something spoiled (after I had already talked to her), I would for sure ignore her for weeks (assuming I don't have the option to just move out).",
          "created_utc": 1595705607.0
        },
        {
          "id": "fz86xmi",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1595706621.0
        }
      ]
    }
  ]
}