{
  "id": "i70xnj",
  "subreddit": "ARFID",
  "author": "Humble_Charizard",
  "created_utc": 1597047592.0,
  "title": "Anybody feel uneducated about food?",
  "selftext": "For example, one time I worked at a pizza place, and a customer told me “Oh and can I get 1000 Island with that?” And I’m just sitting there like “.....um......1000 islands? Hawaii?” \n\nOr like my family will ask me to get some things from the store, and I’m just staring at the vegetables like what is this........wall of......leaf. \n\nEven if I did want to eat like a normal person, I don’t know where I would begin. What if a hot girl comes to my apartment and is like “I like a man that cooks ;)” and I’m just sitting here like “Yo we havin’ pizza rolls tho”\n\nI want to overcome this ARFID, but it’s a struggle not even really comprehending what people put in their bodies on a day to day basic. Like, do I just put this chicken breast in a pan and then just eat it plain like the savage that I am? Do I use some random seasoning that I found in my moms kitchen?",
  "url": "https://www.reddit.com/r/ARFID/comments/i70xnj/anybody_feel_uneducated_about_food/",
  "score": 113,
  "num_comments": 22,
  "comments": [
    {
      "id": "g0zdqqm",
      "author": "FurballFather",
      "body": "Good source of information is to watch Ramsey's kitchen nightmares, and Ramsey is the best at food, I actually know alot for someone that doesn't even eat half of it, even though I don't plan on the big changes in my diet I feel it could be an easy way of transiting into expanding your safe foods if you know more about food",
      "created_utc": 1597057079.0,
      "score": 16,
      "context": []
    },
    {
      "id": "g0zcb17",
      "author": "philosaphira",
      "body": "Yeah I feel the same. I'm so uninterested in foods I don't eat that I sometimes don't know if it's a vegetable or I don't even know the name - or how to eat or to cut it. I guess that's kind of normal for people like us, at least I consider it like that. It's like that my entire life.",
      "created_utc": 1597055650.0,
      "score": 7,
      "context": []
    },
    {
      "id": "g107vtp",
      "author": "zoniqua",
      "body": "Oh my goodness this soooo relatable lol. My saving grace was ironically getting a job at a restaurant and grocery store and I can now say i’ve learned soooo much about food that i didn’t know before. However, before learning I did have quite a few embarrassing moments with this. One time while taking an order a lady asked me for “chicken wings, all flats”. I was so perplexed, like all flats? What does that even mean? I told her we only had the wings and then she was like ”yeaaah?? I don’t want the drums, I just want the flats.” Well that confused me even more! I had no idea what she meant. It was only until I asked a coworker and everyone laughed at me that I finally knew what they were talking about lol",
      "created_utc": 1597076098.0,
      "score": 6,
      "context": []
    },
    {
      "id": "g10fgk4",
      "author": "l-abear",
      "body": "Yep. My husband asked me to get him a chicken salad. I went to the store and picked up a salad that had chicken in it. That wasn’t right. Apparently, there’s another type of chicken salad that doesn’t even have green stuff in it. Who knew?",
      "created_utc": 1597079792.0,
      "score": 5,
      "context": []
    },
    {
      "id": "g0zb3ox",
      "author": "QueenOfThePawns",
      "body": "I feel uneducated about food- my mother who loves food and all foods will sometimes eat things I've never even heard of XD",
      "created_utc": 1597054415.0,
      "score": 4,
      "context": []
    },
    {
      "id": "g0zdts2",
      "author": "kwaqiswhack",
      "body": "Fun fact! 1000 Island Dressing is from 1000 Island region on the St Lawrence, NY. Border of NY and Canada. \n\nThat aside, yes. I feel uneducated too. But the best thing to do is educate yourself! I actually just downloaded Pinterest last night and spent hours browsing thru recipes. Normally I find Pinterest annoying but tbh it was super helpful to have everything in one place and not have to do a bunch of googling and searching thru different websites. Last night I wanted a simple hummus recipe and it gave me like a million options - from reading instructions to pictures and videos. \n\nDon’t get overwhelmed. You don’t have to become a chef overnight! Next time someone mentions a food you’re not sure about, google it. Familiarize yourself with the picture, sometimes I even like to look on Wiki and see where it naturally grows and what foods it’s related to.",
      "created_utc": 1597057162.0,
      "score": 5,
      "context": []
    },
    {
      "id": "g0zkewj",
      "author": "axw3555",
      "body": "Honestly, this is one of the reasons I watch so many cooking shows like Masterchef. I may not eat it, but I know my reductions from my foams.",
      "created_utc": 1597062755.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g0zw32j",
      "author": "angel221001",
      "body": "I know plenty about sweet foods since I bake a lot but I have absolutely no idea about normal savoury \"dinner\" foods. I literally had to ask my friends what stew is the other day",
      "created_utc": 1597070031.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g0zw9k5",
      "author": "DDMcDoodle",
      "body": "I have a 7-yr old that is, not only picky, but needs variety. It drives me crazy. He will love something one day and hate it the next. I have really had to try making new things. Sometimes it is hard because he really does not normally like my cooking (who can blame him?i think I should have him smell some spices.",
      "created_utc": 1597070129.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g108r9n",
      "author": "AMerrickanGirl",
      "body": "Watch cooking shows. “Good Eats” (Cooking Channel) is both entertaining and scientific in its approach to food preparation. Michael Symon’s #symondinners demonstrates basic cooking techniques and how you can easily substitute your preferred food in a recipe. “Chopped” is a fun cooking competition where people have to take certain ingredients and invent new dishes.",
      "created_utc": 1597076529.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g10a5ig",
      "author": "LogicalHue",
      "body": "Yes. When I'm in the grocery store, and I feel like I'm barely buying anything, I still think \"but, like, what the heck are other people even buying?\".\n\nI also worked at a pizza place for a short time and it was horrifying not knowing what any of the foods *were* that weren't pizza. I thought a pizza place would be safe but they sell a lot of other stuff too.\n\nThe only comfort I can offer is that for cooking - people are pretty much always clueless if they don't have experience cooking it. We are actually not alone in that. My roommate is terrified about cooking meat because  he just feels so clueless on the subject, and he has no issues with food at all. Actually I should say: he used to be; because since he's been doing it and has some more experience I think he's more comfortable. We just do a lot of recipe/cooking googling. It can be a little overwhelming, you google one thing and you get so many recipes that are basically the same but a little different and I don't really understand what's going on with them. In those times, if you have that issue as well, and you can get someone to help you sift through things who does understand what they're looking at a little better, its very valuable.",
      "created_utc": 1597077206.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g108csr",
      "author": "404unotfound",
      "body": "I FELT THIS",
      "created_utc": 1597076333.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g10cran",
      "author": "kfilks",
      "body": "I loveeee cooking shows for this reason. I have learned so much I probably know more about food than my immediate family does, and most friends.\n\nAlso, it might not be the same for you – but I love cooking for other people. Even when it's things I don't eat I just rely on them to taste it and give me an honest opinion because they're people who are going to eat it at the end! I feel like this made me smarter about and chiller around food - cus there's no pressure to eat it, unless I'm cooking something I love and then it's a win-win.",
      "created_utc": 1597078483.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g10iua4",
      "author": "honeyorsalt",
      "body": "i keep mixing up the names for different fruits and then i have to do the \"what colour is it? is it smooth or fuzzy? what do you MEAN\"",
      "created_utc": 1597081409.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g117070",
      "author": "Geekla",
      "body": "So relatable! When Wheel of Fortune has the “Food and Drink” category, I‘m useless. My response to seeing the answer is usually, “Oh yeah, I forgot that was even a thing...”",
      "created_utc": 1597093042.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g11f9p1",
      "author": "FiguringItOut--",
      "body": "Yes. I mean, I know basics about nutrition, but my lack of interest in food/cooking makes me absolutely clueless about some stuff. Honestly, the internet is your friend here. Also might be helpful to look up dishes you know you like, and see what ingredients they use. Eg. if you know you like chicken parmesan (like my boyfriend, who never eats any other Italian food), look up the ingredients; then, not only can you learn to make that dish, but you know the ingredients are safe for your palate and can use them to make something else you like!",
      "created_utc": 1597097054.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g11y1m3",
      "author": "Squidwards_m0m",
      "body": "Alton Brown’s Good Eats, one of the most useful shows on television, the older episodes are still gold. I echo others sentiments that other cooking shows help too, although more palatable for the casual viewer they do gloss over a lot. I think it helps so much to be exposed regardless, even if you will never attempt the fancy things.",
      "created_utc": 1597107084.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g12nq05",
      "author": "Harlom",
      "body": "I am the same way, I actually used to work at a pizza place too. When I first started I would get toppings mixed up a lot and had to keep asking my coworkers things like, \"hey, is this canadian bacon?\" I was able to explain it away by blaming it on being vegetarian most of my life, due to not liking the texture of meet. Luckily I was good enough with the non-meet toppings they didn't question it.",
      "created_utc": 1597122904.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g16tywc",
      "author": "Neocactus",
      "body": "Yess! A few days ago, I was hanging out with some friends, and one of them mentioned something about a casserole.\n\nLike yeah, I had heard of the word casserole, but it was in that moment that I realized… I don't know wtf a casserole *even is.*\n\nI feel like I'm particularly slow about this because 99% of my safe foods are junk food :(",
      "created_utc": 1597213329.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g27ijqb",
      "author": "pxrknaty",
      "body": "I thought I was the only one???? My brother is a cook so he constantly uses food terms I haven’t heard before and I’m just so confused but everyone seems to get what he says except for me. When I go out with my friends they talk about a food they like and how they like it and I’m right there like yeah I like chicken with barbacue sauce. I honestly feel so bad sometimes, especially because my brother’s food looks really tasty but there’s ingredients I don’t know so I prefer not to go all out and just eat my safe food.",
      "created_utc": 1597928342.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g10cw7o",
      "author": "kfilks",
      "body": "One day I told my dad if he wanted to make duck that he needed to score it and render out the fat and he looked at me like I had seven heads lol",
      "created_utc": 1597078548.0,
      "score": 1,
      "context": [
        {
          "id": "g0zkewj",
          "author": "axw3555",
          "body": "Honestly, this is one of the reasons I watch so many cooking shows like Masterchef. I may not eat it, but I know my reductions from my foams.",
          "created_utc": 1597062755.0
        }
      ]
    },
    {
      "id": "g118wgi",
      "author": "axw3555",
      "body": "In my house, if I know it, everyone knows it - watching stuff like masterchef, bake off, etc is a household event.",
      "created_utc": 1597093946.0,
      "score": 2,
      "context": [
        {
          "id": "g0zkewj",
          "author": "axw3555",
          "body": "Honestly, this is one of the reasons I watch so many cooking shows like Masterchef. I may not eat it, but I know my reductions from my foams.",
          "created_utc": 1597062755.0
        },
        {
          "id": "g10cw7o",
          "author": "kfilks",
          "body": "One day I told my dad if he wanted to make duck that he needed to score it and render out the fat and he looked at me like I had seven heads lol",
          "created_utc": 1597078548.0
        }
      ]
    }
  ]
}