{
  "id": "i9aa69",
  "subreddit": "ARFID",
  "author": "None",
  "created_utc": 1597359357.0,
  "title": "I hate my sister for mocking ARFID all the time",
  "selftext": "We were ordering from a sandwich place & I (23f) asked to get a roast beef sandwich with extra cheese, take off the extra stuff. My dad said \"wow that sounds like a boring dry sandwich\" and my little sister (19) laughed at me and started reciting my order in a mocking voice. It pisses me off too because my sister acts like a humanitarian online yet makes fun of my mental illnesses CONSTANTLY, especially my arfid. She treats me like I'm a big stupid idiot who's beneath her because I'm picky. Yet if I try to tell her off, she storms off and says I bullied her for no reason.\n\nI don't get why some people are so rude over food preferences. All of my family are assholes about my eating but she's by far the worst with her laughing and throwing insults in my face. I've been treated worse over arfid than I have over any other illness I have. I don't get it. The only person who's ever tried to educate themselves and be kind to me about arfid is my boyfriend, everybody else just belittles me and says I need to just get over it. It drives me up the fucking wall.",
  "url": "https://www.reddit.com/r/ARFID/comments/i9aa69/i_hate_my_sister_for_mocking_arfid_all_the_time/",
  "score": 101,
  "num_comments": 17,
  "comments": [
    {
      "id": "g1du0ob",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1597361004.0,
      "score": 31,
      "context": []
    },
    {
      "id": "g1dsjdv",
      "author": "QueenTeeTee3614",
      "body": "I'm here for you and with you hun!! I'm 21 and experiencing the same thing to where I've now moved half way across the country just because it's easier mentally and physically for me. Family never understood or even tried, it seems like we have some good guys though atleast to help us out and take the time to listen and try to understand what we are experiencing. && Just saying your sandwich sounds freaking delicious ! What's good to us, shouldn't matter to others as long as we are getting something in our system. Have a good day 💛",
      "created_utc": 1597360249.0,
      "score": 10,
      "context": []
    },
    {
      "id": "g1dz4g7",
      "author": "A-U-R-A",
      "body": "She sounds super insecure and that's how she convinces herself she's \"better\" than you.",
      "created_utc": 1597363699.0,
      "score": 5,
      "context": []
    },
    {
      "id": "g1f1idp",
      "author": "ErisMorrigan",
      "body": "I really don't understand people obsession with what other people eat 😕 like why do they care so much? Especially if you're the one paying for the food - they shoud mind their own business but it shouldn't matter either way.",
      "created_utc": 1597387768.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g1edxj9",
      "author": "kfilks",
      "body": "Ummm roast beef with only cheese is fire- your sister is a clown, ignore her. There are so many nice, understanding people out there who don't give a flying f what you eat or need to comment on it!",
      "created_utc": 1597371888.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g1efego",
      "author": "gracethalia86",
      "body": "Have you tried very matter of fact responses, said without emotion? \"Why does it matter what I'm eating?\" \"I like what I ordered.\" \"Wow, what a rude thing to say.\" \"You're being hurtful.\"\n\nBullies want to get a rise out of you. Try not giving her one.",
      "created_utc": 1597372690.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g1fozic",
      "author": "dzdisc",
      "body": "How did you react when your sister started reciting your order? They think they can ridicule you into eating a wider variety of foods, so they are hoping you will react by trying more foods to get them to shut up. In the worst way possible, they are trying to help.\n\nOnce I got some members of my family to understand how hurtful it was, I think the ridicule fizzled out, and they started taking the problem more seriously.",
      "created_utc": 1597408764.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g1m381d",
      "author": "adri3nnaline",
      "body": "Felt this. My 15yo brother does this constantly, one time I got mad at him for eating the last ramen packet of the only flavor that I liked (which I buy myself and for myself to eat) and he started yelling at me telling me to grow up and eat and stop being spoiled. In the moment all I did was chuck a glass of water at him because I was mad lol but it's hurtful and it sucks when people make comments like that and I just wish they would realize I can't just \"start eating\" and that I'm not doing it for attention or because I'm \"spoiled\"",
      "created_utc": 1597509407.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g1e0dw9",
      "author": "None",
      "body": "I have tried but they don't really care. Fortunately even though my mom still accidentally makes some insensitive remarks, she at least tries to not make me feel bad. Unfortunately I have a family that doesn't take mental health seriously.",
      "created_utc": 1597364397.0,
      "score": 14,
      "context": [
        {
          "id": "g1du0ob",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1597361004.0
        }
      ]
    },
    {
      "id": "g1dulr3",
      "author": "None",
      "body": "Thanks! And yeah, I just don't get it. I understand concern from others if it's an eating habit that's causing my health to suffer, but otherwise it hurts my feelings. Mocking is so unnecessary.\n\nGlad you're in a better place now :) I hope to be there someday soon!",
      "created_utc": 1597361306.0,
      "score": 4,
      "context": [
        {
          "id": "g1dsjdv",
          "author": "QueenTeeTee3614",
          "body": "I'm here for you and with you hun!! I'm 21 and experiencing the same thing to where I've now moved half way across the country just because it's easier mentally and physically for me. Family never understood or even tried, it seems like we have some good guys though atleast to help us out and take the time to listen and try to understand what we are experiencing. && Just saying your sandwich sounds freaking delicious ! What's good to us, shouldn't matter to others as long as we are getting something in our system. Have a good day 💛",
          "created_utc": 1597360249.0
        }
      ]
    },
    {
      "id": "g1e0516",
      "author": "None",
      "body": "I just feel bad because I know she's insecure and mentally ill, and I've tried to help her. Or suggest that she should see a mental health professional. She just refuses it all and insists she's fine. It makes me sad",
      "created_utc": 1597364261.0,
      "score": 3,
      "context": [
        {
          "id": "g1dz4g7",
          "author": "A-U-R-A",
          "body": "She sounds super insecure and that's how she convinces herself she's \"better\" than you.",
          "created_utc": 1597363699.0
        }
      ]
    },
    {
      "id": "g1eg182",
      "author": "None",
      "body": "I usually either do that or ignore them. It doesn't really work because they just accuse me of being rude",
      "created_utc": 1597373037.0,
      "score": 1,
      "context": [
        {
          "id": "g1efego",
          "author": "gracethalia86",
          "body": "Have you tried very matter of fact responses, said without emotion? \"Why does it matter what I'm eating?\" \"I like what I ordered.\" \"Wow, what a rude thing to say.\" \"You're being hurtful.\"\n\nBullies want to get a rise out of you. Try not giving her one.",
          "created_utc": 1597372690.0
        }
      ]
    },
    {
      "id": "g1gsr4u",
      "author": "None",
      "body": "I just ignored them. Tbh I've never thought of it that way before. But it's hard to tell with my family because they're verbally abusive to begin with.",
      "created_utc": 1597428087.0,
      "score": 1,
      "context": [
        {
          "id": "g1fozic",
          "author": "dzdisc",
          "body": "How did you react when your sister started reciting your order? They think they can ridicule you into eating a wider variety of foods, so they are hoping you will react by trying more foods to get them to shut up. In the worst way possible, they are trying to help.\n\nOnce I got some members of my family to understand how hurtful it was, I think the ridicule fizzled out, and they started taking the problem more seriously.",
          "created_utc": 1597408764.0
        }
      ]
    },
    {
      "id": "g1n5sqt",
      "author": "None",
      "body": "Ugh I'm sorry about that. I constantly get treated like I'm a spoiled brat for my ARFID. It blows my mind sometimes how insensitive many people are.",
      "created_utc": 1597521195.0,
      "score": 1,
      "context": [
        {
          "id": "g1m381d",
          "author": "adri3nnaline",
          "body": "Felt this. My 15yo brother does this constantly, one time I got mad at him for eating the last ramen packet of the only flavor that I liked (which I buy myself and for myself to eat) and he started yelling at me telling me to grow up and eat and stop being spoiled. In the moment all I did was chuck a glass of water at him because I was mad lol but it's hurtful and it sucks when people make comments like that and I just wish they would realize I can't just \"start eating\" and that I'm not doing it for attention or because I'm \"spoiled\"",
          "created_utc": 1597509407.0
        }
      ]
    },
    {
      "id": "g1e1xyv",
      "author": "axw3555",
      "body": "Honestly, if the adult route doesn’t work, then i see two paths. The one I would probably take is the hot headed one - give them an ultimatum - the next time they try something like that, you will fucking humiliate them, no matter who is there. \n\nMy mum does it sometimes with me (no malice, she just says something without thinking). Last time I got so annoyed because she wouldn’t drop it with the waitress at the table that I brought up literally everything she’d ever mentioned not liking - fish, sweet corn, Oreo cookies on the desserts. Just kept reaming it off and asking if she wanted them added to her meal.\n\nThe cooler approach would be to point out that if she does that in public without thinking, it might end up giving her a reputation. Like that old story of the woman who went full Karen in a Starbucks on the way to an interview, held up the whole place.\n\nWhen she got to the interview, her interviewer had been in the line behind her, and her behaviour had given a bad impression of her to the interviewer. The interviewer just went “after what I saw this morning, I don’t think we’ll waste the time”.\n\nSo if your sister doesn’t learn to keep her trap shut and reel her behaviour in, she could end up doing real damage to her prospects in life.",
      "created_utc": 1597365243.0,
      "score": 12,
      "context": [
        {
          "id": "g1du0ob",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1597361004.0
        },
        {
          "id": "g1e0dw9",
          "author": "None",
          "body": "I have tried but they don't really care. Fortunately even though my mom still accidentally makes some insensitive remarks, she at least tries to not make me feel bad. Unfortunately I have a family that doesn't take mental health seriously.",
          "created_utc": 1597364397.0
        }
      ]
    },
    {
      "id": "g1dvtao",
      "author": "QueenTeeTee3614",
      "body": "You will get there soon! It's a constant battle but we eventually find little things here and there to help us out. \nDefinitely understand the concern from others if it's in a helpful way but I agree the mocking is unnecessary and won't help, I'm sorry you have to go through that. I hate to say this because it's your little sister but she must be hurting in a deep place to make fun of something that's causing you so much pain and suffering. Kill them with kindness, people can't stand that ☺️",
      "created_utc": 1597361939.0,
      "score": 3,
      "context": [
        {
          "id": "g1dsjdv",
          "author": "QueenTeeTee3614",
          "body": "I'm here for you and with you hun!! I'm 21 and experiencing the same thing to where I've now moved half way across the country just because it's easier mentally and physically for me. Family never understood or even tried, it seems like we have some good guys though atleast to help us out and take the time to listen and try to understand what we are experiencing. && Just saying your sandwich sounds freaking delicious ! What's good to us, shouldn't matter to others as long as we are getting something in our system. Have a good day 💛",
          "created_utc": 1597360249.0
        },
        {
          "id": "g1dulr3",
          "author": "None",
          "body": "Thanks! And yeah, I just don't get it. I understand concern from others if it's an eating habit that's causing my health to suffer, but otherwise it hurts my feelings. Mocking is so unnecessary.\n\nGlad you're in a better place now :) I hope to be there someday soon!",
          "created_utc": 1597361306.0
        }
      ]
    },
    {
      "id": "g1qexr5",
      "author": "CanadianWedditor",
      "body": "Do you see a mental health professional? I recommend it for ARFID too! And then they might take it more seriously if you are actively seeing a professional to “treat it”. Cognitive behavioural therapy helped me a lot although I’m by no means “cured” I can definitely eat more foods than when I started.",
      "created_utc": 1597584383.0,
      "score": 1,
      "context": [
        {
          "id": "g1dz4g7",
          "author": "A-U-R-A",
          "body": "She sounds super insecure and that's how she convinces herself she's \"better\" than you.",
          "created_utc": 1597363699.0
        },
        {
          "id": "g1e0516",
          "author": "None",
          "body": "I just feel bad because I know she's insecure and mentally ill, and I've tried to help her. Or suggest that she should see a mental health professional. She just refuses it all and insists she's fine. It makes me sad",
          "created_utc": 1597364261.0
        }
      ]
    },
    {
      "id": "g1hdrsd",
      "author": "dzdisc",
      "body": "I don’t mean to defend your family, I just believe there’s peace to be found if you can “forgive them, for they know not what they do”. Don’t let their ridicule take up too much space in your head. \n\nYou can try saying something like “guys, please, I know it seems like I’m just really picky but I’m not. I don’t want to be like this. My brain obsesses over the appearance, smell, and texture of food and decides on its own that everything is disgusting, I get overwhelmed, my appetite dries up, I can’t salivate. Can you imagine? Feeling starved but having no appetite for some reason? It’s torture. And then to have your own family poke fun at it. You really think I’m putting myself through this just to be difficult?“\n\nIt took me a while to realize that my family just didn’t know what to do. I have a feeling yours might love you more than you realize, it’s our illness that nurtures an antisocial mindset, and it makes us feel excluded. Don’t let it. Use your thoughts to think through it, relax, laugh at yourself, we must admit to ourselves that our predicament is, in a sense, hilarious. Focus on relaxing, not on the food, not on the fear. \n\nSorry if my advice is shit, I just figured I would share the thoughts I use to help with the frustration.",
      "created_utc": 1597437459.0,
      "score": 1,
      "context": [
        {
          "id": "g1fozic",
          "author": "dzdisc",
          "body": "How did you react when your sister started reciting your order? They think they can ridicule you into eating a wider variety of foods, so they are hoping you will react by trying more foods to get them to shut up. In the worst way possible, they are trying to help.\n\nOnce I got some members of my family to understand how hurtful it was, I think the ridicule fizzled out, and they started taking the problem more seriously.",
          "created_utc": 1597408764.0
        },
        {
          "id": "g1gsr4u",
          "author": "None",
          "body": "I just ignored them. Tbh I've never thought of it that way before. But it's hard to tell with my family because they're verbally abusive to begin with.",
          "created_utc": 1597428087.0
        }
      ]
    }
  ]
}