{
  "id": "ibbjuu",
  "subreddit": "ARFID",
  "author": "c21h30o2--",
  "created_utc": 1597659760.0,
  "title": "“I wish I had a body like yours”",
  "selftext": "I’ve been clinically underweight my entire life. I struggle to get through two meals a day. ARFID limits what I can eat, nausea limits how much and when. Due to this, I’m very thin. You can see my ribs if I’m lying down in a tight shirt. It’s not remotely healthy to be this thin, but people constantly tell me that they wish they looked like me. \n\n“I’d kill for your body”\n\nThis happens more often when I’m especially struggling. It’s so infuriating to struggle to drag yourself out of bed, force breakfast down your throat while feeling like you’re going to vomit the whole time, go about your day feeling nauseous and dizzy and tired all the time, only to have people tell you how great you look. \n\nTo everybody who wants a body like me,\nIt isn’t fun, it isn’t sustainable, it’s miserable. Stop telling me I look pretty when my body is shutting down. Sickness isn’t beautiful.",
  "url": "https://www.reddit.com/r/ARFID/comments/ibbjuu/i_wish_i_had_a_body_like_yours/",
  "score": 99,
  "num_comments": 26,
  "comments": [
    {
      "id": "g1uy675",
      "author": "Squedder",
      "body": "And when you tell people you want to gain weight and they say \"just eat an extra burger or something\"\nAnd you're like: Oh damn yeah why didn't I think of just eating more! Thank you so much for your valuable input! (Sarcasm of course)",
      "created_utc": 1597673684.0,
      "score": 33,
      "context": []
    },
    {
      "id": "g1v4mbx",
      "author": "whateverusername999",
      "body": "I hate that. Sometimes when I’m in a salty mood I say Be careful what you wish for, because you’d be killing yourself for this body. Does osteoporosis, GI issues, anxiety, depression, and heart damage sound like fun, lady? No. Fucking diet and exercise like a normal person if you want to lose weight; don’t fetishize my unhealthy eating disorder.",
      "created_utc": 1597675772.0,
      "score": 18,
      "context": []
    },
    {
      "id": "g1vdd3d",
      "author": "None",
      "body": "I've been stopped after a yoga class by someone asking me how  I got my abs.  I told them flat out I was recovering from illness.  Stopped that shit right then and there.  Also, I'm not here to show my body to anyone  I'm here to be IN my body by myself, thanks.",
      "created_utc": 1597678477.0,
      "score": 11,
      "context": []
    },
    {
      "id": "g1vss26",
      "author": "SPinc1",
      "body": "I have the opossite problem. I'm overweight, and because I can't eat a healthy diet because of ARFID, I really struggle to loose fat. I do exercise, but I don't have the money for a gym, so I do what I can without it. But it's really hard, because I get really hungry, and I can only eat certain stuff. I try to eat as best and as healthy food as I can, but it's very hard, and I love junk food so much, and then of course add life problems and depression into the mix and it's just so tough.",
      "created_utc": 1597684302.0,
      "score": 12,
      "context": []
    },
    {
      "id": "g1w8r6b",
      "author": "None",
      "body": "I'm not dangerously thin anymore, but I used to be. I had an old friend who often got mad at me for being thin & would say things like she'd kill for my body. And even when I'd actually eat something, she'd go \"okay, WE GET IT, you can eat and not get FAT. God.\" and I was like.... huh. I didn't even say anything!\n\nI'm also a big fan of old Hollywood and see lots of comments on photos of Audrey Hepburn saying they'd kill for her body. Like, I get it, she does have a beautiful face, but her tiny skinny body is the result of nearly starving to death during WW2 and dealing with permanent malnutrition problems. Trust me, you don't want a body like that.\n\nI can't get too mad though. People who make comments like that are those who often struggle with weight issues just like we do and/or have body dysmorphia. The grass is always greener on the other side.",
      "created_utc": 1597691326.0,
      "score": 7,
      "context": []
    },
    {
      "id": "g1wksnm",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1597695644.0,
      "score": 6,
      "context": []
    },
    {
      "id": "g1urqmc",
      "author": "christmasjones6",
      "body": "you're 100 procent right",
      "created_utc": 1597671053.0,
      "score": 4,
      "context": []
    },
    {
      "id": "g1v4gz3",
      "author": "softlace",
      "body": "I’ve never related to something so much-",
      "created_utc": 1597675720.0,
      "score": 4,
      "context": []
    },
    {
      "id": "g1w52pk",
      "author": "coarsekitten",
      "body": "Absolutely this. I lived with the guilt of this. Like, all your friends are doing their best to lose weight and there you are, struggling to gain it, and so you can't talk to anyone because they'd never understand.",
      "created_utc": 1597689783.0,
      "score": 5,
      "context": []
    },
    {
      "id": "g1xabmf",
      "author": "AbundantiaTheWitch",
      "body": "“Yes please take my three eating disorders and my anxiety and depression. Hope it’s worth it“",
      "created_utc": 1597706013.0,
      "score": 5,
      "context": []
    },
    {
      "id": "g1vy4am",
      "author": "FiguringItOut--",
      "body": "I'm so sorry :( I don't know if I have ARFID myself (def a picky eater), but my boyfriend most likely does, and I've had the experience of being overweight (due to meds) and underweight as well. It totally sucks when your struggles are shoved under the rug because it doesn't LOOK like you have them, or a side-effect of the disorder happens to align with beauty standards. So invalidating! Invisible disabilities are a bitch.",
      "created_utc": 1597686615.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g1wjsqq",
      "author": "im_a_duck__quack",
      "body": "The amount of times I've heard this comment or seen people comment it on my posts is insane",
      "created_utc": 1597695305.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g1xzvz4",
      "author": "2anonym00se1",
      "body": "Oh my goodness I feel this. Commenting (judgments or compliments or just comments) on someone else's weight is just not okay. I don't know why so many people don't get that.\n\nWhen I was veeeery unwell and had lost a ton of weight I went to a family event (I'm not close with my family) and they couldn't fucking shut up about how great I looked. I just wanted to scream \"YOUR COMPLIMENTS ARE FUELING MY DISORDERED EATING.\"",
      "created_utc": 1597720044.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g269ess",
      "author": "PenPaperShotgun",
      "body": "Because I only like certain fattening foods I tend to binge them, get full, not eat, I like fast 1 meal on 1 big unhealthy meal and its so hard to lose weight. It's so hard to tell adults you are \"Picky\".",
      "created_utc": 1597891286.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g1wlxcv",
      "author": "None",
      "body": "My friend with body dysmorphia actually said she wished she had what I have because I'm slightly skinnier than her and I wanted to scream. My life fucking sucks",
      "created_utc": 1597696034.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gdeccdg",
      "author": "Kitty-princess-17",
      "body": "This is so fucking relatable. I’ve had people say this to me as I am 5’2 and 95lbs , it’s fucking scary to hear people say that. You’d never wanna go what I go through everyday!! Like bro wanna trade?? Try for urself. I’ve been underweight forever until I got diagnosed and got sent to inpatient. It’s so uncomfortable and triggering to hear comments like that about something you are trying to change desperately but just can’t.",
      "created_utc": 1606184409.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g1v2qf9",
      "author": "c21h30o2--",
      "body": "This mentality is so wild. Of course we’ve thought of the most obvious solution. Like anything a stranger thinks of in 10 seconds could fix decades of issues. Reminds me of when people with anxiety disorders are told to “just relax.” If I could just relax, I wouldn’t have an anxiety disorder. If I could just eat, I wouldn’t have an eating disorder.",
      "created_utc": 1597675141.0,
      "score": 19,
      "context": [
        {
          "id": "g1uy675",
          "author": "Squedder",
          "body": "And when you tell people you want to gain weight and they say \"just eat an extra burger or something\"\nAnd you're like: Oh damn yeah why didn't I think of just eating more! Thank you so much for your valuable input! (Sarcasm of course)",
          "created_utc": 1597673684.0
        }
      ]
    },
    {
      "id": "g1vyhbm",
      "author": "FiguringItOut--",
      "body": "Ugh I feel this. I also have issues with IBS and sometimes I just can't even fucking stomach the thought of eating something that's good for me. Ramen noodles and bagels with butter are sometimes the only things I can consume. (Oddly enough, I also like peas when I feel sick..but like, JUST peas lol so much for a well-rounded diet)",
      "created_utc": 1597686786.0,
      "score": 2,
      "context": [
        {
          "id": "g1vss26",
          "author": "SPinc1",
          "body": "I have the opossite problem. I'm overweight, and because I can't eat a healthy diet because of ARFID, I really struggle to loose fat. I do exercise, but I don't have the money for a gym, so I do what I can without it. But it's really hard, because I get really hungry, and I can only eat certain stuff. I try to eat as best and as healthy food as I can, but it's very hard, and I love junk food so much, and then of course add life problems and depression into the mix and it's just so tough.",
          "created_utc": 1597684302.0
        }
      ]
    },
    {
      "id": "g1x1oai",
      "author": "c21h30o2--",
      "body": "I hate that my body type is glamorised and fetishised. It comes with a lot of suffering and discomfort, and honestly I don’t think anyone should strive to be as thin as I am. I wouldn’t wish it on anybody.",
      "created_utc": 1597701685.0,
      "score": 2,
      "context": [
        {
          "id": "g1w8r6b",
          "author": "None",
          "body": "I'm not dangerously thin anymore, but I used to be. I had an old friend who often got mad at me for being thin & would say things like she'd kill for my body. And even when I'd actually eat something, she'd go \"okay, WE GET IT, you can eat and not get FAT. God.\" and I was like.... huh. I didn't even say anything!\n\nI'm also a big fan of old Hollywood and see lots of comments on photos of Audrey Hepburn saying they'd kill for her body. Like, I get it, she does have a beautiful face, but her tiny skinny body is the result of nearly starving to death during WW2 and dealing with permanent malnutrition problems. Trust me, you don't want a body like that.\n\nI can't get too mad though. People who make comments like that are those who often struggle with weight issues just like we do and/or have body dysmorphia. The grass is always greener on the other side.",
          "created_utc": 1597691326.0
        }
      ]
    },
    {
      "id": "g1x1ysh",
      "author": "c21h30o2--",
      "body": "I’m sorry you had that experience. You absolutely do not deserve that. Eating disorders present in a lot of ways and people who don’t fit the stereotype for eating disorders are valid. The medical community is so cruel to people with eating disorders and weight issues right now because they’re both so misunderstood by the majority of doctors.",
      "created_utc": 1597701827.0,
      "score": 3,
      "context": [
        {
          "id": "g1wksnm",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1597695644.0
        }
      ]
    },
    {
      "id": "g1wwfin",
      "author": "c21h30o2--",
      "body": "Yeah, my friends go for runs and I have to be like, my doctor told me to do that because it’s medically dangerous for me to loose weight",
      "created_utc": 1597699334.0,
      "score": 3,
      "context": [
        {
          "id": "g1w52pk",
          "author": "coarsekitten",
          "body": "Absolutely this. I lived with the guilt of this. Like, all your friends are doing their best to lose weight and there you are, struggling to gain it, and so you can't talk to anyone because they'd never understand.",
          "created_utc": 1597689783.0
        }
      ]
    },
    {
      "id": "g1ylz7z",
      "author": "c21h30o2--",
      "body": "Even waiters and strangers comment on my body and it’s so uncomfortable. It’s considered mean to point out that someone is overweight, so why is it okay to point out someone is underweight? I know both groups have unique struggles, but it really sucks when I’m at a restaurant and the waiter says “That’s all? But you’re so tiny! Are you sure you don’t want a burger?” People also compliment me more when my ARFID is bad because I’m skinnier. Reminds me of a post I saw from a cocaine addict who had been getting more compliments as her condition got worse because she was loosing weight and people assume thin = healthy",
      "created_utc": 1597736951.0,
      "score": 2,
      "context": [
        {
          "id": "g1xzvz4",
          "author": "2anonym00se1",
          "body": "Oh my goodness I feel this. Commenting (judgments or compliments or just comments) on someone else's weight is just not okay. I don't know why so many people don't get that.\n\nWhen I was veeeery unwell and had lost a ton of weight I went to a family event (I'm not close with my family) and they couldn't fucking shut up about how great I looked. I just wanted to scream \"YOUR COMPLIMENTS ARE FUELING MY DISORDERED EATING.\"",
          "created_utc": 1597720044.0
        }
      ]
    },
    {
      "id": "g2qj5az",
      "author": "NazLokk",
      "body": "You can understand it coming from her more because body dysmorphia is also a mental disorder so she can't help it. From what I know of it, it seems devastating to deal with",
      "created_utc": 1598306011.0,
      "score": 1,
      "context": [
        {
          "id": "g1wlxcv",
          "author": "None",
          "body": "My friend with body dysmorphia actually said she wished she had what I have because I'm slightly skinnier than her and I wanted to scream. My life fucking sucks",
          "created_utc": 1597696034.0
        }
      ]
    },
    {
      "id": "g1v3w4f",
      "author": "Squedder",
      "body": "Hahahaha so true. I also have Tourettes and I've actually been told to just stop doing tics once. Kinda funny how the mind can be so simple when you think about it. It's never meant mean when people give such \"simple\" advice tho (I hope). They just can't understand I think :/",
      "created_utc": 1597675529.0,
      "score": 6,
      "context": [
        {
          "id": "g1uy675",
          "author": "Squedder",
          "body": "And when you tell people you want to gain weight and they say \"just eat an extra burger or something\"\nAnd you're like: Oh damn yeah why didn't I think of just eating more! Thank you so much for your valuable input! (Sarcasm of course)",
          "created_utc": 1597673684.0
        },
        {
          "id": "g1v2qf9",
          "author": "c21h30o2--",
          "body": "This mentality is so wild. Of course we’ve thought of the most obvious solution. Like anything a stranger thinks of in 10 seconds could fix decades of issues. Reminds me of when people with anxiety disorders are told to “just relax.” If I could just relax, I wouldn’t have an anxiety disorder. If I could just eat, I wouldn’t have an eating disorder.",
          "created_utc": 1597675141.0
        }
      ]
    },
    {
      "id": "g1w6rdt",
      "author": "ash_rock",
      "body": "This is more ibs related than arfid related, but I'm also really frustrated about weight because my stomach is bloated about half the time so I look heavier than I'd normally be. The lesson here is: don't comment about someone's appearance, especially involving weight, unless you know the whole story or enough of it to be kind in how you talk about it.",
      "created_utc": 1597690488.0,
      "score": 3,
      "context": [
        {
          "id": "g1vss26",
          "author": "SPinc1",
          "body": "I have the opossite problem. I'm overweight, and because I can't eat a healthy diet because of ARFID, I really struggle to loose fat. I do exercise, but I don't have the money for a gym, so I do what I can without it. But it's really hard, because I get really hungry, and I can only eat certain stuff. I try to eat as best and as healthy food as I can, but it's very hard, and I love junk food so much, and then of course add life problems and depression into the mix and it's just so tough.",
          "created_utc": 1597684302.0
        },
        {
          "id": "g1vyhbm",
          "author": "FiguringItOut--",
          "body": "Ugh I feel this. I also have issues with IBS and sometimes I just can't even fucking stomach the thought of eating something that's good for me. Ramen noodles and bagels with butter are sometimes the only things I can consume. (Oddly enough, I also like peas when I feel sick..but like, JUST peas lol so much for a well-rounded diet)",
          "created_utc": 1597686786.0
        }
      ]
    },
    {
      "id": "g1yw2oe",
      "author": "2anonym00se1",
      "body": "What the hell that is so incredibly inappropriate!! How RUDE. I’ve worked in restaurants for my entire adult life (ironic because I can’t eat the food at most of the places I’ve worked) and I make a point to never comment on someone’s order, what they want added or taken off, how much or how little they eat, etc. It’s rude af. Unfortunately I’ve had coworkers who make judgy comments about people who order steak well done and things like that, as if they’re personally offended by what someone else is eating. ?!?!?\n\nAnd I agree, the idea that skinny = healthy hurts absolutely everyone. Weight is actually not an accurate indicator of health in either direction. And beyond that, health is a personal thing that is nobody else’s business.\n\nSmfh. I’m so sorry people make these inappropriate comments to you. If it were me I would probably get sassy about it and tell the waiter “I have a chronic illness. Did you know it’s actually really rude to comment on a stranger’s weight?”",
      "created_utc": 1597747508.0,
      "score": 3,
      "context": [
        {
          "id": "g1xzvz4",
          "author": "2anonym00se1",
          "body": "Oh my goodness I feel this. Commenting (judgments or compliments or just comments) on someone else's weight is just not okay. I don't know why so many people don't get that.\n\nWhen I was veeeery unwell and had lost a ton of weight I went to a family event (I'm not close with my family) and they couldn't fucking shut up about how great I looked. I just wanted to scream \"YOUR COMPLIMENTS ARE FUELING MY DISORDERED EATING.\"",
          "created_utc": 1597720044.0
        },
        {
          "id": "g1ylz7z",
          "author": "c21h30o2--",
          "body": "Even waiters and strangers comment on my body and it’s so uncomfortable. It’s considered mean to point out that someone is overweight, so why is it okay to point out someone is underweight? I know both groups have unique struggles, but it really sucks when I’m at a restaurant and the waiter says “That’s all? But you’re so tiny! Are you sure you don’t want a burger?” People also compliment me more when my ARFID is bad because I’m skinnier. Reminds me of a post I saw from a cocaine addict who had been getting more compliments as her condition got worse because she was loosing weight and people assume thin = healthy",
          "created_utc": 1597736951.0
        }
      ]
    },
    {
      "id": "g1z615n",
      "author": "c21h30o2--",
      "body": "Luckily most food workers don’t seem to care, try just want to get their shift over with. Once and awhile you get people who make inappropriate comments though. I’ve had to stop going to some restaurants because the employees comment that I always get the same thing.",
      "created_utc": 1597755539.0,
      "score": 2,
      "context": [
        {
          "id": "g1xzvz4",
          "author": "2anonym00se1",
          "body": "Oh my goodness I feel this. Commenting (judgments or compliments or just comments) on someone else's weight is just not okay. I don't know why so many people don't get that.\n\nWhen I was veeeery unwell and had lost a ton of weight I went to a family event (I'm not close with my family) and they couldn't fucking shut up about how great I looked. I just wanted to scream \"YOUR COMPLIMENTS ARE FUELING MY DISORDERED EATING.\"",
          "created_utc": 1597720044.0
        },
        {
          "id": "g1ylz7z",
          "author": "c21h30o2--",
          "body": "Even waiters and strangers comment on my body and it’s so uncomfortable. It’s considered mean to point out that someone is overweight, so why is it okay to point out someone is underweight? I know both groups have unique struggles, but it really sucks when I’m at a restaurant and the waiter says “That’s all? But you’re so tiny! Are you sure you don’t want a burger?” People also compliment me more when my ARFID is bad because I’m skinnier. Reminds me of a post I saw from a cocaine addict who had been getting more compliments as her condition got worse because she was loosing weight and people assume thin = healthy",
          "created_utc": 1597736951.0
        },
        {
          "id": "g1yw2oe",
          "author": "2anonym00se1",
          "body": "What the hell that is so incredibly inappropriate!! How RUDE. I’ve worked in restaurants for my entire adult life (ironic because I can’t eat the food at most of the places I’ve worked) and I make a point to never comment on someone’s order, what they want added or taken off, how much or how little they eat, etc. It’s rude af. Unfortunately I’ve had coworkers who make judgy comments about people who order steak well done and things like that, as if they’re personally offended by what someone else is eating. ?!?!?\n\nAnd I agree, the idea that skinny = healthy hurts absolutely everyone. Weight is actually not an accurate indicator of health in either direction. And beyond that, health is a personal thing that is nobody else’s business.\n\nSmfh. I’m so sorry people make these inappropriate comments to you. If it were me I would probably get sassy about it and tell the waiter “I have a chronic illness. Did you know it’s actually really rude to comment on a stranger’s weight?”",
          "created_utc": 1597747508.0
        }
      ]
    }
  ]
}