{
  "id": "ieaqyk",
  "subreddit": "ARFID",
  "author": "sincle354",
  "created_utc": 1598064212.0,
  "title": "The therapists had heard of ARFID before! Strategies worked! Medications rule! I don't like spaghetti but I ate it!",
  "selftext": "It started when I was being treated for ADHD and possible Autism. The main objective was to reduce social anxiety and increase focus regarding ADHD. In the process of targeting ADHD, I take guanfacine as an ADHD medication that reduced my social anxiety, and quetiapine to further reduce anxiety and depression. I am also trialing other medications currently. The anxiety medications actually radically changed my outlook on self esteem and fears, and I would recommend other people with comorbid anxiety problems to get assistance however it seems fit.\n\nAs part of a complete treatment plan, I was also suggested therapy for techniques to manage ADHD and Autism. The specific therapy office was connected to a nearby university and was specializing in children's' disorders (I was 19). Now, in the process of describing the symptoms I had, I mentioned ARFID as a possible comorbidity. I was completely surprised when they didn't perk up and question what ARFID was. They even knew how to directly treat it! I guess I got lucky that my mental issues are well studied in pediatrics.\n\nIn the first session, I tasked to label foods that I liked and did not like. They were willing to try anything I didn't like, and were even willing to microwave it on the spot in their breakroom. Based on my mild avoidance of vegetables, we agreed for me to bring a serving platter with tomatoes, peas, celery, and ranch dip. I had a real hard time buying the platter before the therapy session, but I wasn't going to flake on therapy I was paying for.\n\nThe second session it was just me, the therapist (and med student), and the platter. We tackled it like this:\n\n* I opened the platter and looked at all of the finger foods. I put a cherry tomato on a paper plate and looked at if for a solid minute while tenderly poking it. \n\n* I picked up the tomato and held in it my hand. It was thumb sized, and smelled like nothing. The fear started to build up. The therapist told me to take my time, and offered another plate to spit out on if needed.\n\n* I bit. And I immediately spit it out and gagged; I was not prepared for the sour taste and fleshy texture. But the therapist told me \"Great Job!\" and told me how far I had to go and how brave I had to be to even try and bite into it. They assured me how much progress I was making. While they were saying this, I was shivering in disgust. I told them I didn't like the taste and I wished that I did. But they told me, and this is important: \"***You don't have to like the food, but you have to prove to yourself that you don't like it***\".\n\n* This went on and, eventually, it got easier to bite into another tomato. I spit out again, but only after I held it in for a while and attempted a chew or two. I think that the new anxiety medication was helping me not gag here. I bit again, and this time I spit out most of it, but swallowed a tiny bit. Mind you, cherry tomatoes are tiny, and I took even tinier bites. However, I got bold at some point, and chewed on the whole thing! I still didn't like the flavor and the mushiness, but I swallowed to just prove a point. It was at this moment that realized that **I. REALLY. DON'T. LIKE. CHERRY. TOMATOES.** The texture was just awful and the sourness of these bland pods of red was really all that I was thinking about. \n\n* This cycle repeated, and after every chew or swallow (I wasn't spitting anymore) I was encouraged to keep trying. I had to prove that I hated tomatoes to these people, and by golly I proved it. I macerated 15 or so cherry tomatoes before the session was over, and my paper plates were reminiscent of a bloodbath. I wasn't scared at the end, however. I was emotionally spent, sure, but the main emotion wasn't fear. I was *annoyed*. Each bite was just frustrating to chew through, and I knew that I had to eat like 5 more tomatoes to really prove to the therapist that I didn't like tomatoes. \n\nSomething similar happened in the next session (over Zoom). I had to munch through the god awful tasting peapods from the same platter, and even finished it off with tasteless celery. But I was not scared at the end. Rather, I started associating these tasting sessions with frustratingly bad tasting chewfests. It feels more like a challenge of grit than a scary situation now.\n\nJust today I agreed with my dad to try some spaghetti and meatballs. I only got through a few bites, but that was because the takeout spaghetti my dad got was absolutely bland, and the meatballs were even blander! The only thing that saved it was the cheese on top, but at that rate it was just pizza flavored. My dad agreed. We plan to try some spaghetti at a place that is actually good, and I'm looking forward to it!\n\nIn conclusion, I wanted to share this story to help everyone realize our true goal: normalizing trying foods and managing the emotions surrounding it. The hard parts for me include the social factor of eating food and the discouraging failure of trying a food you don't like. I think that the medication really helped me overcome the physical reactions to fear and preventing gagging. What is also helping me is lowering my expectations from the food itself; you may theoretically hate most of it, but you gotta prove that to yourself before you can say it! The success is the trying, not liking the food. I'm not out of the woods yet in terms of treatment (ADHD makes scheduling hard), but I hope that this post offers some alternative mindsets for trying food or inspires some of you to seek specific treatment.",
  "url": "https://www.reddit.com/r/ARFID/comments/ieaqyk/the_therapists_had_heard_of_arfid_before/",
  "score": 113,
  "num_comments": 8,
  "comments": [
    {
      "id": "g2gc1l5",
      "author": "somechick_92",
      "body": "Anyone else have trouble even reading the process of people trying this foods? It making feel quite unwell just reading other people experiencing these things instead of excited that maybe I can overcome it too.\n\nOP given I can’t even read this start to finish, you truly are the MVP in my book!",
      "created_utc": 1598097035.0,
      "score": 18,
      "context": []
    },
    {
      "id": "g2etjt4",
      "author": "ComfyPotato",
      "body": "Such incredible stuff!! Keep us updated :D",
      "created_utc": 1598071689.0,
      "score": 8,
      "context": []
    },
    {
      "id": "g2fbwv5",
      "author": "lcutty",
      "body": "Wow!!!! Cherry tomatoes are one of those foods that I just can’t fathom putting in my mouth. The thought alone makes me cringe. The fact that you ate 15 is kind of badass haha. Super encouraging that you could do this!",
      "created_utc": 1598079093.0,
      "score": 8,
      "context": []
    },
    {
      "id": "g2hojj0",
      "author": "flaiad",
      "body": "Thanks soooo much for posting this! I'm going to check out this treatment for my daughter!",
      "created_utc": 1598115194.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g2hyb4f",
      "author": "nueve",
      "body": "Congratulations and thank you for setting the example for us!",
      "created_utc": 1598119468.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g2gk3sy",
      "author": "lasombramaven",
      "body": "This is great stuff, both for me and my 6 year old with autism and who struggles even more than me. Thank you very much for a detailed, fantastic post",
      "created_utc": 1598100542.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g2godpx",
      "author": "user_name_goes_here",
      "body": "Even my NT husband cannot handle a cherry tomato exploding in his mouth.",
      "created_utc": 1598102199.0,
      "score": 1,
      "context": [
        {
          "id": "g2fbwv5",
          "author": "lcutty",
          "body": "Wow!!!! Cherry tomatoes are one of those foods that I just can’t fathom putting in my mouth. The thought alone makes me cringe. The fact that you ate 15 is kind of badass haha. Super encouraging that you could do this!",
          "created_utc": 1598079093.0
        }
      ]
    },
    {
      "id": "g2hybzs",
      "author": "haikusbot",
      "body": "*Congratulations*\n\n*And thank you for setting the*\n\n*Example for us!*\n\n\\- nueve\n\n---\n\nI detect haikus. Sometimes, successfully. | Learn more about me at /r/haikusbot\n\n^(Opt out of replies: \"haikusbot opt out\" | Delete my comment: \"haikusbot delete\")",
      "created_utc": 1598119482.0,
      "score": 4,
      "context": [
        {
          "id": "g2hyb4f",
          "author": "nueve",
          "body": "Congratulations and thank you for setting the example for us!",
          "created_utc": 1598119468.0
        }
      ]
    }
  ]
}