{
  "id": "if84ae",
  "subreddit": "ARFID",
  "author": "KimmyCat96",
  "created_utc": 1598206500.0,
  "title": "I (24f) finally told my parents it's an eating disorder and not just being fussy/picky",
  "selftext": "So tonight while eating a roast dinner (no veg or gravy for me) we started talking about roast potatoes and I talked about how my in laws make their own rather than buying frozen from a shop, my Mum went on to say that her and my Dad used to do the same until I \"started getting fussy\". I finally said I'm not fussy it's an eating disorder, cue both parents banging on about how when they were younger they just ate what they were given, an eating disorder is only a thing with the younger generation, essentially brushing it off as made up and assuming I really am just fussy. They don't seem to understand times have changed, research has been done, new eating disorders have been discovered. I imagine other eating disorders or even mental illnesses such as anxiety also weren't commonly known when they were younger (they're in their 50's). Honestly I'm beginning to resent them. They used to say when I was a kid \"it's all in your head, maybe you should see a doctor and have therapy\" and now I look back and think well okay why the hell did you not actually do that? Maybe if they had I could have been diagnosed and had treatment as a kid and be \"normal\" by now. Instead here I am still suffering with this damn disorder in my 20s. My diet is expanding slightly thanks to my wonderful and patient partner and I can't thank him enough, but I could have had a better relationship with food so much earlier if my parents had actually done something instead of just talking about it. I want to cook and try more foods but I know if I do it at home they'll make a big thing of it and I don't want that, my partners kitchen is small so doesn't really have room to do any proper cooking, so I'm stuck waiting until my partner and I find a place together with a bigger kitchen before I can really start cooking and trying new things. My thinking is if I cook it myself I know exactly what's gone into it. \n\nIdk I just needed to vent because this whole conversation tonight has given me a headache.",
  "url": "https://www.reddit.com/r/ARFID/comments/if84ae/i_24f_finally_told_my_parents_its_an_eating/",
  "score": 91,
  "num_comments": 26,
  "comments": [
    {
      "id": "g2m536s",
      "author": "axw3555",
      "body": "They're in their 50's, so the 1960's... the age of lead paint, corporal punishment in schools, the draft, and segregation. Good thing all those are still around.\n\nI get where you're coming from. I've got a few conditions, some diagnosed, some undiagnosed like ARFID. *Every* time I've told my mother, her response has been \"stop looking for things wrong with you\" or \"stop looking for labels and get on with life\". Some of them, like chronic pain are things I've dealt with for almost my whole life, but I'm just looking for something else wrong - when what I'm actually looking for is some solution of way to manage it.",
      "created_utc": 1598210400.0,
      "score": 28,
      "context": []
    },
    {
      "id": "g2mc8u6",
      "author": "deanosaur9",
      "body": "My mum was the same when I was younger. She did try and get me help tho, she took me to countless dietitians but at the time there wasn't a name for it and they couldn't tell us what was wrong, they basically said I'd just grow out of it. They also said they'd never seen anything like this before lol. I'm pretty sure ARFID wasn't a thing until the DSM V came out but gosh I wish I'd known it was an actual eating disorder back then and not just me being broken and weird. Finding out that ARFID exists was the most amazing thing bc there was an explanation for why I couldn't eat like everyone else.\n\nI'm sorry your parents reacted like that, I know it's difficult to understand but it's so in validating when people don't take us seriously. Sending hugs 💛",
      "created_utc": 1598213989.0,
      "score": 6,
      "context": []
    },
    {
      "id": "g2nd6i9",
      "author": "None",
      "body": "When I told my mom I found out it was an eating disorder, she said \"great.. how do you make it go away?\" in the most flat tone I've ever heard. I was really excited to finally at 18 years old know that I'm not the only person like this, and she didn't offer me any support. Just \"great, make it go away now\"",
      "created_utc": 1598233818.0,
      "score": 5,
      "context": []
    },
    {
      "id": "g2mre7c",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1598221719.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g2msshc",
      "author": "robynxcakes",
      "body": "It’s very unlikely that if you went to a therapist when you were younger they would have even known what Afraid is, I get the frustration but there is no point thinking how things could have been different, and you don’t need your parents to believe you in order for you to get the treatment or work on your safe foods",
      "created_utc": 1598222420.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g2melun",
      "author": "DDMcDoodle",
      "body": "I am 50. They just did not label things like they do now. How would you like to go until you are 50 without understanding why you eat like a child?\nI do understand what they are saying to a point because it seems fashionable to have a disorder now. Unfortunately, young people are diagnosing themselves with things and making it harder for people who struggle with real problems to get taken seriously. I have two cousins that have applied so many labels to themselves, it is hard to take them seriously.\nI am not sure if there is a therapist to go to. Nobody knew where to send me at age 48 after I stopped eating a lot of the time. Do you have one now? Most of the specialist are for anorexia, which this can turn into (it did for me for awhile)\nI don’t think you should be so hard on your parents. It is a strange disorder. They were right that you needed therapy, they just did not know where to send you. Even now, it is not a diagnosis, but it is real. Maybe instead of telling them you have a disorder, send them the ARFID information and include risks so they understand why this is serious.\nI am not saying it will do any good, but at least they may recognize you in the description.\nFeel glad you are making progress and don’t live in the past of what your parents could have done for you (that can make you very bitter and it won’t change anything. They did their best) ! I have started eating a few more things too. My parents missed many opportunities to help me in many areas, but they were limited by their belief system. You will probably also make mistakes with your kids. I have made mistakes with mine. People are imperfect.",
      "created_utc": 1598215190.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g2mfu1d",
      "author": "KimmyCat96",
      "body": "Yeah I get that. I'd love a quick fix for my ARFID and my anxiety (something else they failed to pick up on when I was a kid), but it doesn't happen overnight, I'm doing much better with my partners help luckily, he's so patient and understanding. I'm making progress, it's slow but it's a start. My parents know my diet is beginning to expand but I feel like to them (and my extended family) I'm always just gonna be the picky kid who never grew out of it, rather than a person with a real eating disorder. It sucks.",
      "created_utc": 1598215806.0,
      "score": 3,
      "context": [
        {
          "id": "g2m536s",
          "author": "axw3555",
          "body": "They're in their 50's, so the 1960's... the age of lead paint, corporal punishment in schools, the draft, and segregation. Good thing all those are still around.\n\nI get where you're coming from. I've got a few conditions, some diagnosed, some undiagnosed like ARFID. *Every* time I've told my mother, her response has been \"stop looking for things wrong with you\" or \"stop looking for labels and get on with life\". Some of them, like chronic pain are things I've dealt with for almost my whole life, but I'm just looking for something else wrong - when what I'm actually looking for is some solution of way to manage it.",
          "created_utc": 1598210400.0
        }
      ]
    },
    {
      "id": "g2mfcpq",
      "author": "DDMcDoodle",
      "body": "I also had chronic pain (fibromyalgia). In a way, it was related to this because the only thing I truly live to say are cookies and brownies and chocolate. \nJust recently, I tried cutting out things with added sugar and it really makes a difference. It is the ONLY reason I would cut down on sweets. Apparently it causes inflammation. I was heartbroken, but I just enjoy fruit and have it once in awhile.\nJust in case you did not know about sugar causing pain....",
      "created_utc": 1598215564.0,
      "score": 2,
      "context": [
        {
          "id": "g2m536s",
          "author": "axw3555",
          "body": "They're in their 50's, so the 1960's... the age of lead paint, corporal punishment in schools, the draft, and segregation. Good thing all those are still around.\n\nI get where you're coming from. I've got a few conditions, some diagnosed, some undiagnosed like ARFID. *Every* time I've told my mother, her response has been \"stop looking for things wrong with you\" or \"stop looking for labels and get on with life\". Some of them, like chronic pain are things I've dealt with for almost my whole life, but I'm just looking for something else wrong - when what I'm actually looking for is some solution of way to manage it.",
          "created_utc": 1598210400.0
        }
      ]
    },
    {
      "id": "g2oc7rv",
      "author": "Mageaz",
      "body": "I wouldn't think that dieticians knew about it, actually. I'm just theorising here, but ARFID seems to go hand in hand with adhd/anxiety/autism/etc a lot of the time, and if you look at it as a sensory issue instead of a food issue, it makes a lot more sense to me at least. I know from the woman that works with me (because of adhd, it's a specific type of help managing every day life/practical things that my country offers) that a lot of the other clients she sees have the same type of food issues.",
      "created_utc": 1598261302.0,
      "score": 3,
      "context": [
        {
          "id": "g2mc8u6",
          "author": "deanosaur9",
          "body": "My mum was the same when I was younger. She did try and get me help tho, she took me to countless dietitians but at the time there wasn't a name for it and they couldn't tell us what was wrong, they basically said I'd just grow out of it. They also said they'd never seen anything like this before lol. I'm pretty sure ARFID wasn't a thing until the DSM V came out but gosh I wish I'd known it was an actual eating disorder back then and not just me being broken and weird. Finding out that ARFID exists was the most amazing thing bc there was an explanation for why I couldn't eat like everyone else.\n\nI'm sorry your parents reacted like that, I know it's difficult to understand but it's so in validating when people don't take us seriously. Sending hugs 💛",
          "created_utc": 1598213989.0
        }
      ]
    },
    {
      "id": "g2mceow",
      "author": "deanosaur9",
      "body": "I'm 22 btw forgot to mention that",
      "created_utc": 1598214070.0,
      "score": 2,
      "context": [
        {
          "id": "g2mc8u6",
          "author": "deanosaur9",
          "body": "My mum was the same when I was younger. She did try and get me help tho, she took me to countless dietitians but at the time there wasn't a name for it and they couldn't tell us what was wrong, they basically said I'd just grow out of it. They also said they'd never seen anything like this before lol. I'm pretty sure ARFID wasn't a thing until the DSM V came out but gosh I wish I'd known it was an actual eating disorder back then and not just me being broken and weird. Finding out that ARFID exists was the most amazing thing bc there was an explanation for why I couldn't eat like everyone else.\n\nI'm sorry your parents reacted like that, I know it's difficult to understand but it's so in validating when people don't take us seriously. Sending hugs 💛",
          "created_utc": 1598213989.0
        }
      ]
    },
    {
      "id": "g2mgbnh",
      "author": "KimmyCat96",
      "body": "See mine didn't even do that. I see stories of kids who are picky and everyone is so quick to say \"I blame the parents\", and up until I found out about ARFID a few years ago I'd have agreed, but now I look back and see that my own parents didn't even try. Even if they took me to a doctor and then the doctor said I was just picky and I'd grow out of it, at least they'd have done something, but they did nothing. So in my case I kinda do blame my parents for just sitting back and doing nothing to even try and help me. Thank you ❤",
      "created_utc": 1598216049.0,
      "score": 2,
      "context": [
        {
          "id": "g2mc8u6",
          "author": "deanosaur9",
          "body": "My mum was the same when I was younger. She did try and get me help tho, she took me to countless dietitians but at the time there wasn't a name for it and they couldn't tell us what was wrong, they basically said I'd just grow out of it. They also said they'd never seen anything like this before lol. I'm pretty sure ARFID wasn't a thing until the DSM V came out but gosh I wish I'd known it was an actual eating disorder back then and not just me being broken and weird. Finding out that ARFID exists was the most amazing thing bc there was an explanation for why I couldn't eat like everyone else.\n\nI'm sorry your parents reacted like that, I know it's difficult to understand but it's so in validating when people don't take us seriously. Sending hugs 💛",
          "created_utc": 1598213989.0
        }
      ]
    },
    {
      "id": "g2po456",
      "author": "Harlom",
      "body": "My mom took me to the pediatrician when I was really young because she said I would only eat Cheerios. The doctors said that I would grow out of it. I'm 25 now, still have ARFID. But I don't just eat Cheerios so I guess they could say they were right. The DSM IV had something like ARFID called Feeding Disorder of Infancy or Early Childhood. I guess they realized it doesn't just go away when you are no longer a child and changed the name for DSM V.",
      "created_utc": 1598290960.0,
      "score": 2,
      "context": [
        {
          "id": "g2mc8u6",
          "author": "deanosaur9",
          "body": "My mum was the same when I was younger. She did try and get me help tho, she took me to countless dietitians but at the time there wasn't a name for it and they couldn't tell us what was wrong, they basically said I'd just grow out of it. They also said they'd never seen anything like this before lol. I'm pretty sure ARFID wasn't a thing until the DSM V came out but gosh I wish I'd known it was an actual eating disorder back then and not just me being broken and weird. Finding out that ARFID exists was the most amazing thing bc there was an explanation for why I couldn't eat like everyone else.\n\nI'm sorry your parents reacted like that, I know it's difficult to understand but it's so in validating when people don't take us seriously. Sending hugs 💛",
          "created_utc": 1598213989.0
        }
      ]
    },
    {
      "id": "g2o808r",
      "author": "KimmyCat96",
      "body": "That's awful! It sucks she reacted like that instead of being supportive. But at least she didn't just try and dismiss it as being made up like my parents did!",
      "created_utc": 1598256943.0,
      "score": 1,
      "context": [
        {
          "id": "g2nd6i9",
          "author": "None",
          "body": "When I told my mom I found out it was an eating disorder, she said \"great.. how do you make it go away?\" in the most flat tone I've ever heard. I was really excited to finally at 18 years old know that I'm not the only person like this, and she didn't offer me any support. Just \"great, make it go away now\"",
          "created_utc": 1598233818.0
        }
      ]
    },
    {
      "id": "g2o7odn",
      "author": "KimmyCat96",
      "body": "Oh I won't be talking about it with them again, it'll only be a repeat of last nights conversation and it'll just make me mad again! Yeah I know I probably wouldn't have been diagnosed, but they didn't even try to find out what was wrong even after saying I should see a doctor, just makes me mad that they didn't try. But yeah the sooner I can be out of here and have my own place with my partner so I can cook the better, I have plenty of recipes saved for when the time comes!",
      "created_utc": 1598256616.0,
      "score": 1,
      "context": [
        {
          "id": "g2mre7c",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1598221719.0
        }
      ]
    },
    {
      "id": "g2o7ukf",
      "author": "KimmyCat96",
      "body": "Yeah I know, just makes me mad that they didn't even try. Even if they'd taken me to a doctor and were told I was just picky and would grow out of it, at least I'd know they tried. But no of course I don't need them to believe me, I've known about ARFID for a few years now and I've been working on it myself without ever telling them it existed, only a couple of close friends and my partner knew about it up until now so their support has been great.",
      "created_utc": 1598256787.0,
      "score": 1,
      "context": [
        {
          "id": "g2msshc",
          "author": "robynxcakes",
          "body": "It’s very unlikely that if you went to a therapist when you were younger they would have even known what Afraid is, I get the frustration but there is no point thinking how things could have been different, and you don’t need your parents to believe you in order for you to get the treatment or work on your safe foods",
          "created_utc": 1598222420.0
        }
      ]
    },
    {
      "id": "g2mhj24",
      "author": "KimmyCat96",
      "body": "Oh yeah of course, and I get that from their point of view because these things weren't labelled when they were kids it was almost as if they didn't exist, but they did, there just weren't names attached to those things. But it frustrates me that they won't even consider the idea that I have a real eating disorder. Do they think I like being 24 and having the diet of a 5 year old? I hate it. No I don't have a therapist, there aren't any near me (I live in quite a small town and don't drive so even if I could find one in my nearest city getting there would be an issue). But to be honest at this point I don't feel I need one, I'm making progress, slowly, but slow is still good. As I said in my post my partner is a huge help, i tried my first chicken curry and rice with him the other night and loved it! I just feel like at the very least my parents could have taken me to a doctor, even if the outcome had been the doctor saying I was just picky and I'd grow out of it, because at least then I'd know they'd tried instead of just doing nothing. Honestly even if I send them information about ARFID I don't think they'll read it, my Dad especially. I won't make mistakes with my kids because I have no intention of having any haha, my partners brother has two little ones that we see most weekends, that's enough for us!",
      "created_utc": 1598216631.0,
      "score": 3,
      "context": [
        {
          "id": "g2melun",
          "author": "DDMcDoodle",
          "body": "I am 50. They just did not label things like they do now. How would you like to go until you are 50 without understanding why you eat like a child?\nI do understand what they are saying to a point because it seems fashionable to have a disorder now. Unfortunately, young people are diagnosing themselves with things and making it harder for people who struggle with real problems to get taken seriously. I have two cousins that have applied so many labels to themselves, it is hard to take them seriously.\nI am not sure if there is a therapist to go to. Nobody knew where to send me at age 48 after I stopped eating a lot of the time. Do you have one now? Most of the specialist are for anorexia, which this can turn into (it did for me for awhile)\nI don’t think you should be so hard on your parents. It is a strange disorder. They were right that you needed therapy, they just did not know where to send you. Even now, it is not a diagnosis, but it is real. Maybe instead of telling them you have a disorder, send them the ARFID information and include risks so they understand why this is serious.\nI am not saying it will do any good, but at least they may recognize you in the description.\nFeel glad you are making progress and don’t live in the past of what your parents could have done for you (that can make you very bitter and it won’t change anything. They did their best) ! I have started eating a few more things too. My parents missed many opportunities to help me in many areas, but they were limited by their belief system. You will probably also make mistakes with your kids. I have made mistakes with mine. People are imperfect.",
          "created_utc": 1598215190.0
        }
      ]
    },
    {
      "id": "g2mrpta",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1598221887.0,
      "score": 3,
      "context": [
        {
          "id": "g2melun",
          "author": "DDMcDoodle",
          "body": "I am 50. They just did not label things like they do now. How would you like to go until you are 50 without understanding why you eat like a child?\nI do understand what they are saying to a point because it seems fashionable to have a disorder now. Unfortunately, young people are diagnosing themselves with things and making it harder for people who struggle with real problems to get taken seriously. I have two cousins that have applied so many labels to themselves, it is hard to take them seriously.\nI am not sure if there is a therapist to go to. Nobody knew where to send me at age 48 after I stopped eating a lot of the time. Do you have one now? Most of the specialist are for anorexia, which this can turn into (it did for me for awhile)\nI don’t think you should be so hard on your parents. It is a strange disorder. They were right that you needed therapy, they just did not know where to send you. Even now, it is not a diagnosis, but it is real. Maybe instead of telling them you have a disorder, send them the ARFID information and include risks so they understand why this is serious.\nI am not saying it will do any good, but at least they may recognize you in the description.\nFeel glad you are making progress and don’t live in the past of what your parents could have done for you (that can make you very bitter and it won’t change anything. They did their best) ! I have started eating a few more things too. My parents missed many opportunities to help me in many areas, but they were limited by their belief system. You will probably also make mistakes with your kids. I have made mistakes with mine. People are imperfect.",
          "created_utc": 1598215190.0
        }
      ]
    },
    {
      "id": "g2mgnu7",
      "author": "Amekyras",
      "body": ">Unfortunately, young people are diagnosing themselves with things and making it harder for people who struggle with real problems to get taken seriously.\n\nPeople always say this and I've never actually seen any evidence of it, other than people saying 'oh i'm so OCD' when they want something neat, and that seems to be done by everyone.",
      "created_utc": 1598216209.0,
      "score": 6,
      "context": [
        {
          "id": "g2melun",
          "author": "DDMcDoodle",
          "body": "I am 50. They just did not label things like they do now. How would you like to go until you are 50 without understanding why you eat like a child?\nI do understand what they are saying to a point because it seems fashionable to have a disorder now. Unfortunately, young people are diagnosing themselves with things and making it harder for people who struggle with real problems to get taken seriously. I have two cousins that have applied so many labels to themselves, it is hard to take them seriously.\nI am not sure if there is a therapist to go to. Nobody knew where to send me at age 48 after I stopped eating a lot of the time. Do you have one now? Most of the specialist are for anorexia, which this can turn into (it did for me for awhile)\nI don’t think you should be so hard on your parents. It is a strange disorder. They were right that you needed therapy, they just did not know where to send you. Even now, it is not a diagnosis, but it is real. Maybe instead of telling them you have a disorder, send them the ARFID information and include risks so they understand why this is serious.\nI am not saying it will do any good, but at least they may recognize you in the description.\nFeel glad you are making progress and don’t live in the past of what your parents could have done for you (that can make you very bitter and it won’t change anything. They did their best) ! I have started eating a few more things too. My parents missed many opportunities to help me in many areas, but they were limited by their belief system. You will probably also make mistakes with your kids. I have made mistakes with mine. People are imperfect.",
          "created_utc": 1598215190.0
        }
      ]
    },
    {
      "id": "g2o7hg7",
      "author": "Backrow6",
      "body": "The generational thing is bull anyway. I'm in my late 30s and basically recovered from a relatively mild case of ARFID, my auntie is was born in the early 70s, has raised get own kids and still has a tiny list of safe foods.  \n\nMy own mother doesn't even realise how narrow her diet is, she's been doing the shopping and cooking for so long that she doesn't even realise what she's avoiding. It was really weird offering to cook for my parents as an adult, after expanding my own palette and suddenly see my mother objecting to everything I suggested.  \n\nSometimes the terminology changes over time but the condition of the same.",
      "created_utc": 1598256425.0,
      "score": 3,
      "context": [
        {
          "id": "g2m536s",
          "author": "axw3555",
          "body": "They're in their 50's, so the 1960's... the age of lead paint, corporal punishment in schools, the draft, and segregation. Good thing all those are still around.\n\nI get where you're coming from. I've got a few conditions, some diagnosed, some undiagnosed like ARFID. *Every* time I've told my mother, her response has been \"stop looking for things wrong with you\" or \"stop looking for labels and get on with life\". Some of them, like chronic pain are things I've dealt with for almost my whole life, but I'm just looking for something else wrong - when what I'm actually looking for is some solution of way to manage it.",
          "created_utc": 1598210400.0
        },
        {
          "id": "g2mfu1d",
          "author": "KimmyCat96",
          "body": "Yeah I get that. I'd love a quick fix for my ARFID and my anxiety (something else they failed to pick up on when I was a kid), but it doesn't happen overnight, I'm doing much better with my partners help luckily, he's so patient and understanding. I'm making progress, it's slow but it's a start. My parents know my diet is beginning to expand but I feel like to them (and my extended family) I'm always just gonna be the picky kid who never grew out of it, rather than a person with a real eating disorder. It sucks.",
          "created_utc": 1598215806.0
        }
      ]
    },
    {
      "id": "g2mk64f",
      "author": "axw3555",
      "body": "I tried the cutting out of sugar thing years ago. Turns out I gave a different root, mines born of my body being overstimulated with pain by migraines. After two decades and an average of 3 migraines every 5 days, my brain started interpreting non pain signals as pain, then eventually, no signal as pain.",
      "created_utc": 1598217987.0,
      "score": 3,
      "context": [
        {
          "id": "g2m536s",
          "author": "axw3555",
          "body": "They're in their 50's, so the 1960's... the age of lead paint, corporal punishment in schools, the draft, and segregation. Good thing all those are still around.\n\nI get where you're coming from. I've got a few conditions, some diagnosed, some undiagnosed like ARFID. *Every* time I've told my mother, her response has been \"stop looking for things wrong with you\" or \"stop looking for labels and get on with life\". Some of them, like chronic pain are things I've dealt with for almost my whole life, but I'm just looking for something else wrong - when what I'm actually looking for is some solution of way to manage it.",
          "created_utc": 1598210400.0
        },
        {
          "id": "g2mfcpq",
          "author": "DDMcDoodle",
          "body": "I also had chronic pain (fibromyalgia). In a way, it was related to this because the only thing I truly live to say are cookies and brownies and chocolate. \nJust recently, I tried cutting out things with added sugar and it really makes a difference. It is the ONLY reason I would cut down on sweets. Apparently it causes inflammation. I was heartbroken, but I just enjoy fruit and have it once in awhile.\nJust in case you did not know about sugar causing pain....",
          "created_utc": 1598215564.0
        }
      ]
    },
    {
      "id": "g2odpqh",
      "author": "KimmyCat96",
      "body": "Yeah my ARFID goes with anxiety too, and lately I've wondered about autism but haven't really done enough research on it yet but I keep seeing things about autism in adults that I relate to so it's something I want to look into.",
      "created_utc": 1598262866.0,
      "score": 1,
      "context": [
        {
          "id": "g2mc8u6",
          "author": "deanosaur9",
          "body": "My mum was the same when I was younger. She did try and get me help tho, she took me to countless dietitians but at the time there wasn't a name for it and they couldn't tell us what was wrong, they basically said I'd just grow out of it. They also said they'd never seen anything like this before lol. I'm pretty sure ARFID wasn't a thing until the DSM V came out but gosh I wish I'd known it was an actual eating disorder back then and not just me being broken and weird. Finding out that ARFID exists was the most amazing thing bc there was an explanation for why I couldn't eat like everyone else.\n\nI'm sorry your parents reacted like that, I know it's difficult to understand but it's so in validating when people don't take us seriously. Sending hugs 💛",
          "created_utc": 1598213989.0
        },
        {
          "id": "g2oc7rv",
          "author": "Mageaz",
          "body": "I wouldn't think that dieticians knew about it, actually. I'm just theorising here, but ARFID seems to go hand in hand with adhd/anxiety/autism/etc a lot of the time, and if you look at it as a sensory issue instead of a food issue, it makes a lot more sense to me at least. I know from the woman that works with me (because of adhd, it's a specific type of help managing every day life/practical things that my country offers) that a lot of the other clients she sees have the same type of food issues.",
          "created_utc": 1598261302.0
        }
      ]
    },
    {
      "id": "g2o7gu3",
      "author": "KimmyCat96",
      "body": "I have to agree with this. To me the fact that they said over and over that I should see a doctor and then didn't actually take me to one, was not doing their best. They didn't even try. If they actually had done their best I wouldn't have even made this post because I'd know they at least tried.",
      "created_utc": 1598256408.0,
      "score": 3,
      "context": [
        {
          "id": "g2melun",
          "author": "DDMcDoodle",
          "body": "I am 50. They just did not label things like they do now. How would you like to go until you are 50 without understanding why you eat like a child?\nI do understand what they are saying to a point because it seems fashionable to have a disorder now. Unfortunately, young people are diagnosing themselves with things and making it harder for people who struggle with real problems to get taken seriously. I have two cousins that have applied so many labels to themselves, it is hard to take them seriously.\nI am not sure if there is a therapist to go to. Nobody knew where to send me at age 48 after I stopped eating a lot of the time. Do you have one now? Most of the specialist are for anorexia, which this can turn into (it did for me for awhile)\nI don’t think you should be so hard on your parents. It is a strange disorder. They were right that you needed therapy, they just did not know where to send you. Even now, it is not a diagnosis, but it is real. Maybe instead of telling them you have a disorder, send them the ARFID information and include risks so they understand why this is serious.\nI am not saying it will do any good, but at least they may recognize you in the description.\nFeel glad you are making progress and don’t live in the past of what your parents could have done for you (that can make you very bitter and it won’t change anything. They did their best) ! I have started eating a few more things too. My parents missed many opportunities to help me in many areas, but they were limited by their belief system. You will probably also make mistakes with your kids. I have made mistakes with mine. People are imperfect.",
          "created_utc": 1598215190.0
        },
        {
          "id": "g2mrpta",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1598221887.0
        }
      ]
    },
    {
      "id": "g2mhsrh",
      "author": "KimmyCat96",
      "body": "I don't see it often but when I do see it it's people diagnosing themselves with every disorder/mental illness under the sun. There's a girl I went to high school with who's exactly like this, safe to say I don't speak to her anymore.",
      "created_utc": 1598216765.0,
      "score": 3,
      "context": [
        {
          "id": "g2melun",
          "author": "DDMcDoodle",
          "body": "I am 50. They just did not label things like they do now. How would you like to go until you are 50 without understanding why you eat like a child?\nI do understand what they are saying to a point because it seems fashionable to have a disorder now. Unfortunately, young people are diagnosing themselves with things and making it harder for people who struggle with real problems to get taken seriously. I have two cousins that have applied so many labels to themselves, it is hard to take them seriously.\nI am not sure if there is a therapist to go to. Nobody knew where to send me at age 48 after I stopped eating a lot of the time. Do you have one now? Most of the specialist are for anorexia, which this can turn into (it did for me for awhile)\nI don’t think you should be so hard on your parents. It is a strange disorder. They were right that you needed therapy, they just did not know where to send you. Even now, it is not a diagnosis, but it is real. Maybe instead of telling them you have a disorder, send them the ARFID information and include risks so they understand why this is serious.\nI am not saying it will do any good, but at least they may recognize you in the description.\nFeel glad you are making progress and don’t live in the past of what your parents could have done for you (that can make you very bitter and it won’t change anything. They did their best) ! I have started eating a few more things too. My parents missed many opportunities to help me in many areas, but they were limited by their belief system. You will probably also make mistakes with your kids. I have made mistakes with mine. People are imperfect.",
          "created_utc": 1598215190.0
        },
        {
          "id": "g2mgnu7",
          "author": "Amekyras",
          "body": ">Unfortunately, young people are diagnosing themselves with things and making it harder for people who struggle with real problems to get taken seriously.\n\nPeople always say this and I've never actually seen any evidence of it, other than people saying 'oh i'm so OCD' when they want something neat, and that seems to be done by everyone.",
          "created_utc": 1598216209.0
        }
      ]
    },
    {
      "id": "g2q7eep",
      "author": "NazLokk",
      "body": "Yeah, I've only really seen people self diagnose on the internet",
      "created_utc": 1598300167.0,
      "score": 2,
      "context": [
        {
          "id": "g2melun",
          "author": "DDMcDoodle",
          "body": "I am 50. They just did not label things like they do now. How would you like to go until you are 50 without understanding why you eat like a child?\nI do understand what they are saying to a point because it seems fashionable to have a disorder now. Unfortunately, young people are diagnosing themselves with things and making it harder for people who struggle with real problems to get taken seriously. I have two cousins that have applied so many labels to themselves, it is hard to take them seriously.\nI am not sure if there is a therapist to go to. Nobody knew where to send me at age 48 after I stopped eating a lot of the time. Do you have one now? Most of the specialist are for anorexia, which this can turn into (it did for me for awhile)\nI don’t think you should be so hard on your parents. It is a strange disorder. They were right that you needed therapy, they just did not know where to send you. Even now, it is not a diagnosis, but it is real. Maybe instead of telling them you have a disorder, send them the ARFID information and include risks so they understand why this is serious.\nI am not saying it will do any good, but at least they may recognize you in the description.\nFeel glad you are making progress and don’t live in the past of what your parents could have done for you (that can make you very bitter and it won’t change anything. They did their best) ! I have started eating a few more things too. My parents missed many opportunities to help me in many areas, but they were limited by their belief system. You will probably also make mistakes with your kids. I have made mistakes with mine. People are imperfect.",
          "created_utc": 1598215190.0
        },
        {
          "id": "g2mgnu7",
          "author": "Amekyras",
          "body": ">Unfortunately, young people are diagnosing themselves with things and making it harder for people who struggle with real problems to get taken seriously.\n\nPeople always say this and I've never actually seen any evidence of it, other than people saying 'oh i'm so OCD' when they want something neat, and that seems to be done by everyone.",
          "created_utc": 1598216209.0
        }
      ]
    },
    {
      "id": "g2o8dhq",
      "author": "KimmyCat96",
      "body": "Yeah exactly. My Dads reasoning was he's never known anyone picky like me (apart from my uncle on my Mum's side who was picky until around my age but not as bad as me), so it didn't exist until my generation. But just because he didn't know anyone growing up who was picky doesn't mean there weren't people that were, it's just not as common as other disorders like anorexia so of course not everyone is going to know someone who suffers with it but that doesn't mean it doesn't exist. New eating disorders don't just pop up out of nowhere, they always exist, they just don't always have names because they're uncommon and not widely known about.",
      "created_utc": 1598257312.0,
      "score": 1,
      "context": [
        {
          "id": "g2m536s",
          "author": "axw3555",
          "body": "They're in their 50's, so the 1960's... the age of lead paint, corporal punishment in schools, the draft, and segregation. Good thing all those are still around.\n\nI get where you're coming from. I've got a few conditions, some diagnosed, some undiagnosed like ARFID. *Every* time I've told my mother, her response has been \"stop looking for things wrong with you\" or \"stop looking for labels and get on with life\". Some of them, like chronic pain are things I've dealt with for almost my whole life, but I'm just looking for something else wrong - when what I'm actually looking for is some solution of way to manage it.",
          "created_utc": 1598210400.0
        },
        {
          "id": "g2mfu1d",
          "author": "KimmyCat96",
          "body": "Yeah I get that. I'd love a quick fix for my ARFID and my anxiety (something else they failed to pick up on when I was a kid), but it doesn't happen overnight, I'm doing much better with my partners help luckily, he's so patient and understanding. I'm making progress, it's slow but it's a start. My parents know my diet is beginning to expand but I feel like to them (and my extended family) I'm always just gonna be the picky kid who never grew out of it, rather than a person with a real eating disorder. It sucks.",
          "created_utc": 1598215806.0
        },
        {
          "id": "g2o7hg7",
          "author": "Backrow6",
          "body": "The generational thing is bull anyway. I'm in my late 30s and basically recovered from a relatively mild case of ARFID, my auntie is was born in the early 70s, has raised get own kids and still has a tiny list of safe foods.  \n\nMy own mother doesn't even realise how narrow her diet is, she's been doing the shopping and cooking for so long that she doesn't even realise what she's avoiding. It was really weird offering to cook for my parents as an adult, after expanding my own palette and suddenly see my mother objecting to everything I suggested.  \n\nSometimes the terminology changes over time but the condition of the same.",
          "created_utc": 1598256425.0
        }
      ]
    },
    {
      "id": "g2qoqrt",
      "author": "DDMcDoodle",
      "body": "To which doctor did you expect them to take you? Most likely, they did not think the doctor could help a picky eater. Most people would not think so.\nEven if they understood what was happening and had  a lot of knowledge, where would they send you?\nSome people have a certain way of thinking and they raise their kids according to that. That is what I meant whenI said they did their best. I did not say they did THE best - I said they did THEIR best. They raised you with their limited and sometimes faulty view of the world. In their view, you are don’t have an eating disorder, so they are not neglecting you. \nMy mom did not believe in getting help for anxiety disorder and depression, so I suffered from that until I was 21. She did not believe I had back pain (I still have fibromyalgia). She did not believe me at first when that I needed glasses because my sister had just gotten some glasses, so I went nearly a whole year borrowing my friend’s glasses (too weak for her).\nSo, I totally understand being disappointed in parents.",
      "created_utc": 1598308906.0,
      "score": -1,
      "context": [
        {
          "id": "g2melun",
          "author": "DDMcDoodle",
          "body": "I am 50. They just did not label things like they do now. How would you like to go until you are 50 without understanding why you eat like a child?\nI do understand what they are saying to a point because it seems fashionable to have a disorder now. Unfortunately, young people are diagnosing themselves with things and making it harder for people who struggle with real problems to get taken seriously. I have two cousins that have applied so many labels to themselves, it is hard to take them seriously.\nI am not sure if there is a therapist to go to. Nobody knew where to send me at age 48 after I stopped eating a lot of the time. Do you have one now? Most of the specialist are for anorexia, which this can turn into (it did for me for awhile)\nI don’t think you should be so hard on your parents. It is a strange disorder. They were right that you needed therapy, they just did not know where to send you. Even now, it is not a diagnosis, but it is real. Maybe instead of telling them you have a disorder, send them the ARFID information and include risks so they understand why this is serious.\nI am not saying it will do any good, but at least they may recognize you in the description.\nFeel glad you are making progress and don’t live in the past of what your parents could have done for you (that can make you very bitter and it won’t change anything. They did their best) ! I have started eating a few more things too. My parents missed many opportunities to help me in many areas, but they were limited by their belief system. You will probably also make mistakes with your kids. I have made mistakes with mine. People are imperfect.",
          "created_utc": 1598215190.0
        },
        {
          "id": "g2mrpta",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1598221887.0
        },
        {
          "id": "g2o7gu3",
          "author": "KimmyCat96",
          "body": "I have to agree with this. To me the fact that they said over and over that I should see a doctor and then didn't actually take me to one, was not doing their best. They didn't even try. If they actually had done their best I wouldn't have even made this post because I'd know they at least tried.",
          "created_utc": 1598256408.0
        }
      ]
    },
    {
      "id": "g2mk4dl",
      "author": "Amekyras",
      "body": "Yeah, there's definitely some people, but it's not everyone.",
      "created_utc": 1598217962.0,
      "score": 3,
      "context": [
        {
          "id": "g2melun",
          "author": "DDMcDoodle",
          "body": "I am 50. They just did not label things like they do now. How would you like to go until you are 50 without understanding why you eat like a child?\nI do understand what they are saying to a point because it seems fashionable to have a disorder now. Unfortunately, young people are diagnosing themselves with things and making it harder for people who struggle with real problems to get taken seriously. I have two cousins that have applied so many labels to themselves, it is hard to take them seriously.\nI am not sure if there is a therapist to go to. Nobody knew where to send me at age 48 after I stopped eating a lot of the time. Do you have one now? Most of the specialist are for anorexia, which this can turn into (it did for me for awhile)\nI don’t think you should be so hard on your parents. It is a strange disorder. They were right that you needed therapy, they just did not know where to send you. Even now, it is not a diagnosis, but it is real. Maybe instead of telling them you have a disorder, send them the ARFID information and include risks so they understand why this is serious.\nI am not saying it will do any good, but at least they may recognize you in the description.\nFeel glad you are making progress and don’t live in the past of what your parents could have done for you (that can make you very bitter and it won’t change anything. They did their best) ! I have started eating a few more things too. My parents missed many opportunities to help me in many areas, but they were limited by their belief system. You will probably also make mistakes with your kids. I have made mistakes with mine. People are imperfect.",
          "created_utc": 1598215190.0
        },
        {
          "id": "g2mgnu7",
          "author": "Amekyras",
          "body": ">Unfortunately, young people are diagnosing themselves with things and making it harder for people who struggle with real problems to get taken seriously.\n\nPeople always say this and I've never actually seen any evidence of it, other than people saying 'oh i'm so OCD' when they want something neat, and that seems to be done by everyone.",
          "created_utc": 1598216209.0
        },
        {
          "id": "g2mhsrh",
          "author": "KimmyCat96",
          "body": "I don't see it often but when I do see it it's people diagnosing themselves with every disorder/mental illness under the sun. There's a girl I went to high school with who's exactly like this, safe to say I don't speak to her anymore.",
          "created_utc": 1598216765.0
        }
      ]
    },
    {
      "id": "g2sbm5k",
      "author": "KimmyCat96",
      "body": "Given that over the course of my childhood they said multiple times that they thought I should see a doctor I'd expect them to have taken me to my GP (correct me if I'm wrong but I believe you're from the US and I'm unsure what your equivalent of a GP is if you have one), and although I know the outcome would likely have been \"she's picky and she'll grow out of it\", if the doctor had thought it was more than that they would have been able to refer me to a specialist or therapist if needed. But with all due respect you can't say MY parents did their best when you don't know them, the only person who knows them and whether they did their best or not is me.",
      "created_utc": 1598350979.0,
      "score": 1,
      "context": [
        {
          "id": "g2melun",
          "author": "DDMcDoodle",
          "body": "I am 50. They just did not label things like they do now. How would you like to go until you are 50 without understanding why you eat like a child?\nI do understand what they are saying to a point because it seems fashionable to have a disorder now. Unfortunately, young people are diagnosing themselves with things and making it harder for people who struggle with real problems to get taken seriously. I have two cousins that have applied so many labels to themselves, it is hard to take them seriously.\nI am not sure if there is a therapist to go to. Nobody knew where to send me at age 48 after I stopped eating a lot of the time. Do you have one now? Most of the specialist are for anorexia, which this can turn into (it did for me for awhile)\nI don’t think you should be so hard on your parents. It is a strange disorder. They were right that you needed therapy, they just did not know where to send you. Even now, it is not a diagnosis, but it is real. Maybe instead of telling them you have a disorder, send them the ARFID information and include risks so they understand why this is serious.\nI am not saying it will do any good, but at least they may recognize you in the description.\nFeel glad you are making progress and don’t live in the past of what your parents could have done for you (that can make you very bitter and it won’t change anything. They did their best) ! I have started eating a few more things too. My parents missed many opportunities to help me in many areas, but they were limited by their belief system. You will probably also make mistakes with your kids. I have made mistakes with mine. People are imperfect.",
          "created_utc": 1598215190.0
        },
        {
          "id": "g2mrpta",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1598221887.0
        },
        {
          "id": "g2o7gu3",
          "author": "KimmyCat96",
          "body": "I have to agree with this. To me the fact that they said over and over that I should see a doctor and then didn't actually take me to one, was not doing their best. They didn't even try. If they actually had done their best I wouldn't have even made this post because I'd know they at least tried.",
          "created_utc": 1598256408.0
        },
        {
          "id": "g2qoqrt",
          "author": "DDMcDoodle",
          "body": "To which doctor did you expect them to take you? Most likely, they did not think the doctor could help a picky eater. Most people would not think so.\nEven if they understood what was happening and had  a lot of knowledge, where would they send you?\nSome people have a certain way of thinking and they raise their kids according to that. That is what I meant whenI said they did their best. I did not say they did THE best - I said they did THEIR best. They raised you with their limited and sometimes faulty view of the world. In their view, you are don’t have an eating disorder, so they are not neglecting you. \nMy mom did not believe in getting help for anxiety disorder and depression, so I suffered from that until I was 21. She did not believe I had back pain (I still have fibromyalgia). She did not believe me at first when that I needed glasses because my sister had just gotten some glasses, so I went nearly a whole year borrowing my friend’s glasses (too weak for her).\nSo, I totally understand being disappointed in parents.",
          "created_utc": 1598308906.0
        }
      ]
    }
  ]
}