{
  "id": "ihsprd",
  "subreddit": "ARFID",
  "author": "gwsweets",
  "created_utc": 1598559604.0,
  "title": "not being able to swallow the last bite of a meal ?",
  "selftext": "content warning: food, gagging/vomiting \n\nokay so this might be gross but there’s something i have an issue with and i don’t know if it’s linked to ARFID or not, and it’s swallowing the last bite of a meal? it’s not always & it’s mostly when i’m at home but like if i’m eating and still putting things in my mouth i’m usually okay (apart from the random gagging lmao) but when i take my last bite and decide i’m done i take so so long to chew and often end up having to spit it out because i can’t swallow it. but it also happens at random times whilst i’m eating (and then i’ll drink water to get the rest out of my mouth and sometimes it makes me wanna puke) i didn’t explain very well but does anyone else have this problem?? if not then here’s a random tmi fact about a stranger on reddit",
  "url": "https://www.reddit.com/r/ARFID/comments/ihsprd/not_being_able_to_swallow_the_last_bite_of_a_meal/",
  "score": 116,
  "num_comments": 56,
  "comments": [
    {
      "id": "g32cdhc",
      "author": "HellenKellerBookClub",
      "body": "Yes the same thing happens to me all the time! It’s fine and then all of a sudden I have to spit it out. Sometimes in the middle but then I can still continue to eat. It’s super weird!",
      "created_utc": 1598562053.0,
      "score": 25,
      "context": []
    },
    {
      "id": "g32fk2k",
      "author": "None",
      "body": "oh my gosh this is a struggle of mine with every meal!! sometimes it can happen at the beginning or the middle and i decide that specific bite i can’t swallow. but it for sure always happens at the end of a meal and i’ll have one last bite and idk what it is but i try to finish it and i can’t and just end up being unable to swallow and spit it out.",
      "created_utc": 1598563610.0,
      "score": 12,
      "context": []
    },
    {
      "id": "g337xsm",
      "author": "howaboutrice",
      "body": "What the-- is this a common thing?? I never eat the last bite of anything, something just grosses me out about it. Even if I'm still hungry and keep eating something else.",
      "created_utc": 1598578524.0,
      "score": 8,
      "context": []
    },
    {
      "id": "g32qzd5",
      "author": "None",
      "body": "Yessss I have this too, even down to the taking a long time to chew it cuz it feels like its impossible to swallow and also a lot of the times I end up spitting it out too cuz I can't(my psych calls them safety behaviors)... it feels so automatic & like my body just won't except anymore food... its so hard & I hate it cuz it makes It so hard to get my intake up.",
      "created_utc": 1598569341.0,
      "score": 6,
      "context": []
    },
    {
      "id": "g33b3cy",
      "author": "hannibe",
      "body": "This happens to me sometimes! Usually if the food is a borderline safe food. My mouth just says \"no\".",
      "created_utc": 1598580263.0,
      "score": 6,
      "context": []
    },
    {
      "id": "g33qmyt",
      "author": "peri_5xg",
      "body": "Yes! This happens to me sometimes too. Not always at the end of a meal, but it will be like I am eating and all of a sudden, I can’t swallow it and have to will myself to not panic and proceed. It’s a lot better than it used to be",
      "created_utc": 1598589606.0,
      "score": 5,
      "context": []
    },
    {
      "id": "g33ib5d",
      "author": "snug666",
      "body": "weird question, can you burp? this is a pretty common problem over in r/noburp",
      "created_utc": 1598584364.0,
      "score": 4,
      "context": []
    },
    {
      "id": "g340cbn",
      "author": "c21h30o2--",
      "body": "The same thing happens to me. It happened last night actually, with one of my safe foods, white rice. I’ll be eating, sometimes I’ll even be hungry and enjoying the food a bit, but slowly it just becomes Too Much. The three final bites of my meals are usually the hardest, and I have to really push myself on the last bite.",
      "created_utc": 1598597279.0,
      "score": 5,
      "context": []
    },
    {
      "id": "g3b82im",
      "author": "Rosegoldloux",
      "body": "No wayyyyyy I thought this was just me, randomly it’s not always the last bite either sometimes it happens randomly",
      "created_utc": 1598753421.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g539ejc",
      "author": "geebbles123",
      "body": "A bit late to this thread but this has affected me my whole life..and the spitting out process really makes me feel like I’m gonna vom at any second. Usually only happens with meat",
      "created_utc": 1599996170.0,
      "score": 4,
      "context": []
    },
    {
      "id": "g34b8vj",
      "author": "JCXIII-R",
      "body": "OMG I HAVE FOUND MY PEOPLE",
      "created_utc": 1598608407.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g34eqm6",
      "author": "kwaqiswhack",
      "body": "Yesss me as well",
      "created_utc": 1598611930.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g351ard",
      "author": "Squedder",
      "body": "So relatable",
      "created_utc": 1598626312.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g3is8fz",
      "author": "GoldfinchChips",
      "body": "Mine’s more like a weird sense that I can’t keep eating, even if I’m still really hungry. It feels sort of like being full, but only the discomfort part.",
      "created_utc": 1598911139.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ga5h6to",
      "author": "Thanks-Caffeine",
      "body": "Same here! I can't believe this is common with so many people. It doesn't happen all the time but it is noticeably often. I think it goes hand-in-hand with \"I am not full but I can't eat any longer\".",
      "created_utc": 1603704466.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g32t6ly",
      "author": "axw3555",
      "body": "Now quite the same, but a similar quirk. \n\nWhenever I have a packet of biscuits, I have a weird thing about the last biscuit. I can never say why, but I almost never eat it. Its a similar kind of revulsion that I'd get for milk that's gone bad, doesn't matter if I opened the packet an hour ago or a week ago, same result.",
      "created_utc": 1598570528.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g33ggc8",
      "author": "MrVonic",
      "body": "This is something I do a lot, so since I'm usually eating a pb sandwich, I just won't eat the last bite of the sandwich if I don't think I can finish it",
      "created_utc": 1598583293.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g33le1z",
      "author": "swans0",
      "body": "This happens to me multiple times a day! It makes eating full meals really hard especially if it makes me vomit. I don’t really have any advice about it unfortunately but I hope you know you’re not alone in this!",
      "created_utc": 1598586171.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g352nfz",
      "author": "None",
      "body": "this used to happen to me a while ago when I was going through a time when my anxiety was very very high. Do you have anxiety?? I assumed it was because your throat kinda like closes when you have anxiety or something like that idk how to explain it lol but yeah it went away eventually",
      "created_utc": 1598626991.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gfxqxpr",
      "author": "makinggrace",
      "body": "Meditation (weirdly) has helped me with this. If I have meditated in the morning, and I get in that OMIGODCANNOTSWALLOWTHIS mode, I can sort of think back to that calm state. It’s like flipping a switch and then I swallow like a normal reflex or after I take a sip of something. (I started out kind of going between the Headspace App and Calm. Was pretty sure it did nothing but committed to daily practice for 6 months. About two months in it started to actually help.)",
      "created_utc": 1608051638.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gg8fycq",
      "author": "Connor504",
      "body": "I know this post is old but omg I’m so glad I found it. This happens to me and I have no idea why. It only happens when I’m at home, never when I’m eating anywhere else. I absolutely love to eat and usually leave behind a clean plate but sometimes I just can’t eat the last bite or last few bites. I usually put it in my mouth, chew it up, and then compulsively spit it out and throw it away.",
      "created_utc": 1608280912.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ggffm72",
      "author": "SnooCupcakes4720",
      "body": "Always happens to me with my last bite",
      "created_utc": 1608427901.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kvly50c",
      "author": "EastofEdensgrave",
      "body": " Wait so this is a thing??!? I thought I was going crazy because this JUST started happening a few months ago.",
      "created_utc": 1710870347.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lmwfrfu",
      "author": "PuzzleHeadedRuins",
      "body": "I have a theory as to why this happens. For many years, a human's \"last bite\" would be the bones of a carcass. It's programmed into us to leave a bit of mass when we finish our meals. Your monkey brain is equating your last bite to eating the \"inconsumables\" like bones and such. Try to affirm your brain that your plate only has edible mass on it.",
      "created_utc": 1726217836.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m129clm",
      "author": "OkReplacement495",
      "body": "Is this mental? Is there an answer? Kudos for speaking up",
      "created_utc": 1733680621.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mthiykv",
      "author": "Awake00",
      "body": "I have this too.",
      "created_utc": 1747840570.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mub1xi0",
      "author": "crazyrainbowoctopus",
      "body": "OMG the same thing happens to me!! ever since i remember even as a kid i would often have to spit out my last bite (even if it was not the end of the meal) because i physically couldnt swallow it. and also my head would like shake i dont know how to explain that part but like as if i ate something gross",
      "created_utc": 1748245055.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hme5u64",
      "author": "None",
      "body": "Holy shit, it's nice to know that I'm not the only one. Mine randomly started happening a week prior. Should I go see a doctor or nah?",
      "created_utc": 1638101904.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hnrbov6",
      "author": "Vinez_Initez",
      "body": "OP have you ever found an answer?",
      "created_utc": 1638993350.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hsshuyb",
      "author": "Brikka11",
      "body": "Honestly I thought I was the only one.  Does this behavior have a name?  Is it a part of ARFID?\n\nI’m in recovery from other eating disorders.  This came up over the past few years and I don’t feel like it is psychological, I physically can’t swallow without gagging.  I have to spit up my food, and have no control over when it happens.  It is always pretty much at the end of the meal, it isn’t the last bite but close to it",
      "created_utc": 1642269182.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i9qx8ry",
      "author": "Sufficient-Toe9928",
      "body": "I do that too. It could be something called dysphagia. It's when your body moves liquids and solids to your stomach so when you try to swallow it can hurt or just be impossible to do. Which is why it's normally at the end of a meal",
      "created_utc": 1653350853.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ic1gngs",
      "author": "Tenten5028",
      "body": "It happens to me too. Idk what it is either.",
      "created_utc": 1654998432.0,
      "score": 1,
      "context": []
    },
    {
      "id": "idzqaju",
      "author": "yarnmagpie",
      "body": "I’m a year late to this party but I can’t believe I’m not the only one! It’s such a random quirk!!",
      "created_utc": 1656374189.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jd1wxl4",
      "author": "aeroastrogirl",
      "body": "This happens to me randomly when I eat/drink. Something mentally about it just weirds me out",
      "created_utc": 1679379920.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jhqtpdq",
      "author": "_Celestial_owl",
      "body": "Old thread, but it happens to me with foods I'm a bit neutral about. Like it's not good, but the food's not gross either. With the last few bites a switch flips and I instincitvely stuff all the food in my cheeks.\nIt generally helps me to take a large gulp of a nice drink to wash it away but oh my god I feel so dumb when this happens.",
      "created_utc": 1682481538.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k90zv3d",
      "author": "Rude_Following_52",
      "body": "Last Bite Syndrome, also known as postprandial dysphagia\n\nI have it too",
      "created_utc": 1699849645.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kbh9pxy",
      "author": "Whole-Supermarket157",
      "body": "Has anybody figured out what this is yet? I’ve been dealing with this for the last year. I went from 320 pounds, size 22 jeans down to 205 and size 13 and still dropping! 😔 I’ve been to the er and they’ve told me everything from ED and food aversion to acid reflux, or I’m eating too much, or it’s the food I’m eating but it doesn’t matter what I eat or how much. I get a few bites in and mid bite I can no longer swallow! If there’s any small piece left it makes me want to vomit trying to get it out! I can’t get answers anywhere!",
      "created_utc": 1701390068.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kgd13rv",
      "author": "NameRare2669",
      "body": "WOW, I am several years behind on this thread, but I have been stressing about this & thought I was the only one! It is so weird! It won’t even go towards my throat!🙄😏",
      "created_utc": 1704414937.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kskv34g",
      "author": "drummondsux02",
      "body": "yeah same here! it happens with food i love and dislike. i actually just fought the urge to spit my last bite out and i felt disgusted for a moment, but now i’m fine😂",
      "created_utc": 1709147976.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g32lwia",
      "author": "gwsweets",
      "body": "yes exactly!! at random times too, it’s so odd. at least we know we’re not alone ♡",
      "created_utc": 1598566695.0,
      "score": 7,
      "context": [
        {
          "id": "g32cdhc",
          "author": "HellenKellerBookClub",
          "body": "Yes the same thing happens to me all the time! It’s fine and then all of a sudden I have to spit it out. Sometimes in the middle but then I can still continue to eat. It’s super weird!",
          "created_utc": 1598562053.0
        }
      ]
    },
    {
      "id": "g32m5ng",
      "author": "gwsweets",
      "body": "yes omg! i forgot to mention it also happens on random bites where i’ll just have to get up cause i for some reason can’t swallow, & the last one is just nope. i had no idea other people had this too",
      "created_utc": 1598566823.0,
      "score": 6,
      "context": [
        {
          "id": "g32fk2k",
          "author": "None",
          "body": "oh my gosh this is a struggle of mine with every meal!! sometimes it can happen at the beginning or the middle and i decide that specific bite i can’t swallow. but it for sure always happens at the end of a meal and i’ll have one last bite and idk what it is but i try to finish it and i can’t and just end up being unable to swallow and spit it out.",
          "created_utc": 1598563610.0
        }
      ]
    },
    {
      "id": "g352odr",
      "author": "gwsweets",
      "body": "safety behaviours, that makes so much sense! & same, it’s so frustrating.",
      "created_utc": 1598627004.0,
      "score": 3,
      "context": [
        {
          "id": "g32qzd5",
          "author": "None",
          "body": "Yessss I have this too, even down to the taking a long time to chew it cuz it feels like its impossible to swallow and also a lot of the times I end up spitting it out too cuz I can't(my psych calls them safety behaviors)... it feels so automatic & like my body just won't except anymore food... its so hard & I hate it cuz it makes It so hard to get my intake up.",
          "created_utc": 1598569341.0
        }
      ]
    },
    {
      "id": "g3539k1",
      "author": "gwsweets",
      "body": "i relate to the having to will myself to not panic. i’m glad it’s gotten better for you!",
      "created_utc": 1598627295.0,
      "score": 3,
      "context": [
        {
          "id": "g33qmyt",
          "author": "peri_5xg",
          "body": "Yes! This happens to me sometimes too. Not always at the end of a meal, but it will be like I am eating and all of a sudden, I can’t swallow it and have to will myself to not panic and proceed. It’s a lot better than it used to be",
          "created_utc": 1598589606.0
        }
      ]
    },
    {
      "id": "g34o2wp",
      "author": "CSMom74",
      "body": "Wow.  There really is a sub for everything.",
      "created_utc": 1598619211.0,
      "score": 3,
      "context": [
        {
          "id": "g33ib5d",
          "author": "snug666",
          "body": "weird question, can you burp? this is a pretty common problem over in r/noburp",
          "created_utc": 1598584364.0
        }
      ]
    },
    {
      "id": "i8cswbg",
      "author": "Mitt102486",
      "body": "I can burp so that’s not it for me",
      "created_utc": 1652382710.0,
      "score": 2,
      "context": [
        {
          "id": "g33ib5d",
          "author": "snug666",
          "body": "weird question, can you burp? this is a pretty common problem over in r/noburp",
          "created_utc": 1598584364.0
        }
      ]
    },
    {
      "id": "g353avz",
      "author": "gwsweets",
      "body": "yes exactly how i feel :(",
      "created_utc": 1598627313.0,
      "score": 2,
      "context": [
        {
          "id": "g340cbn",
          "author": "c21h30o2--",
          "body": "The same thing happens to me. It happened last night actually, with one of my safe foods, white rice. I’ll be eating, sometimes I’ll even be hungry and enjoying the food a bit, but slowly it just becomes Too Much. The three final bites of my meals are usually the hardest, and I have to really push myself on the last bite.",
          "created_utc": 1598597279.0
        }
      ]
    },
    {
      "id": "j5f4roj",
      "author": "Zealousideal-Ball551",
      "body": "Yep, meat is the worst for me too",
      "created_utc": 1674402680.0,
      "score": 2,
      "context": [
        {
          "id": "g539ejc",
          "author": "geebbles123",
          "body": "A bit late to this thread but this has affected me my whole life..and the spitting out process really makes me feel like I’m gonna vom at any second. Usually only happens with meat",
          "created_utc": 1599996170.0
        }
      ]
    },
    {
      "id": "lrgf8qe",
      "author": "GoodLifeNick",
      "body": "I struggle with this now",
      "created_utc": 1728673484.0,
      "score": 1,
      "context": [
        {
          "id": "gg8fycq",
          "author": "Connor504",
          "body": "I know this post is old but omg I’m so glad I found it. This happens to me and I have no idea why. It only happens when I’m at home, never when I’m eating anywhere else. I absolutely love to eat and usually leave behind a clean plate but sometimes I just can’t eat the last bite or last few bites. I usually put it in my mouth, chew it up, and then compulsively spit it out and throw it away.",
          "created_utc": 1608280912.0
        }
      ]
    },
    {
      "id": "lk0yvlg",
      "author": "No_Taste_5265",
      "body": "I've been doing this for years and years, I just figured why go to the DR. they never have answers. As I have other medical stuff and they can never give straight answers for everything and all the DR. don't agree with each other, when I finally get an answer it takes over 5 years to figure out.",
      "created_utc": 1724686325.0,
      "score": 1,
      "context": [
        {
          "id": "kskv34g",
          "author": "drummondsux02",
          "body": "yeah same here! it happens with food i love and dislike. i actually just fought the urge to spit my last bite out and i felt disgusted for a moment, but now i’m fine😂",
          "created_utc": 1709147976.0
        }
      ]
    },
    {
      "id": "g32pxsn",
      "author": "None",
      "body": "same! i thought i was the only one. even halfway through chewing i’m suddenly like NOPE",
      "created_utc": 1598568798.0,
      "score": 5,
      "context": [
        {
          "id": "g32fk2k",
          "author": "None",
          "body": "oh my gosh this is a struggle of mine with every meal!! sometimes it can happen at the beginning or the middle and i decide that specific bite i can’t swallow. but it for sure always happens at the end of a meal and i’ll have one last bite and idk what it is but i try to finish it and i can’t and just end up being unable to swallow and spit it out.",
          "created_utc": 1598563610.0
        },
        {
          "id": "g32m5ng",
          "author": "gwsweets",
          "body": "yes omg! i forgot to mention it also happens on random bites where i’ll just have to get up cause i for some reason can’t swallow, & the last one is just nope. i had no idea other people had this too",
          "created_utc": 1598566823.0
        }
      ]
    },
    {
      "id": "i8css3y",
      "author": "Mitt102486",
      "body": "Im sorta looking into this for myself. Have you learned anything about it?",
      "created_utc": 1652382665.0,
      "score": 2,
      "context": [
        {
          "id": "g32fk2k",
          "author": "None",
          "body": "oh my gosh this is a struggle of mine with every meal!! sometimes it can happen at the beginning or the middle and i decide that specific bite i can’t swallow. but it for sure always happens at the end of a meal and i’ll have one last bite and idk what it is but i try to finish it and i can’t and just end up being unable to swallow and spit it out.",
          "created_utc": 1598563610.0
        },
        {
          "id": "g32m5ng",
          "author": "gwsweets",
          "body": "yes omg! i forgot to mention it also happens on random bites where i’ll just have to get up cause i for some reason can’t swallow, & the last one is just nope. i had no idea other people had this too",
          "created_utc": 1598566823.0
        }
      ]
    },
    {
      "id": "lrge9hq",
      "author": "GoodLifeNick",
      "body": "I struggle with this😂",
      "created_utc": 1728673159.0,
      "score": 2,
      "context": [
        {
          "id": "g32fk2k",
          "author": "None",
          "body": "oh my gosh this is a struggle of mine with every meal!! sometimes it can happen at the beginning or the middle and i decide that specific bite i can’t swallow. but it for sure always happens at the end of a meal and i’ll have one last bite and idk what it is but i try to finish it and i can’t and just end up being unable to swallow and spit it out.",
          "created_utc": 1598563610.0
        },
        {
          "id": "g32m5ng",
          "author": "gwsweets",
          "body": "yes omg! i forgot to mention it also happens on random bites where i’ll just have to get up cause i for some reason can’t swallow, & the last one is just nope. i had no idea other people had this too",
          "created_utc": 1598566823.0
        }
      ]
    },
    {
      "id": "lrgftwp",
      "author": "GoodLifeNick",
      "body": "What’s the ans8",
      "created_utc": 1728673682.0,
      "score": 1,
      "context": [
        {
          "id": "kskv34g",
          "author": "drummondsux02",
          "body": "yeah same here! it happens with food i love and dislike. i actually just fought the urge to spit my last bite out and i felt disgusted for a moment, but now i’m fine😂",
          "created_utc": 1709147976.0
        },
        {
          "id": "lk0yvlg",
          "author": "No_Taste_5265",
          "body": "I've been doing this for years and years, I just figured why go to the DR. they never have answers. As I have other medical stuff and they can never give straight answers for everything and all the DR. don't agree with each other, when I finally get an answer it takes over 5 years to figure out.",
          "created_utc": 1724686325.0
        }
      ]
    },
    {
      "id": "i9cw5ri",
      "author": "jesterJWD",
      "body": "I have this issue also, and would like to find out more.",
      "created_utc": 1653069754.0,
      "score": 2,
      "context": [
        {
          "id": "g32fk2k",
          "author": "None",
          "body": "oh my gosh this is a struggle of mine with every meal!! sometimes it can happen at the beginning or the middle and i decide that specific bite i can’t swallow. but it for sure always happens at the end of a meal and i’ll have one last bite and idk what it is but i try to finish it and i can’t and just end up being unable to swallow and spit it out.",
          "created_utc": 1598563610.0
        },
        {
          "id": "g32m5ng",
          "author": "gwsweets",
          "body": "yes omg! i forgot to mention it also happens on random bites where i’ll just have to get up cause i for some reason can’t swallow, & the last one is just nope. i had no idea other people had this too",
          "created_utc": 1598566823.0
        },
        {
          "id": "i8css3y",
          "author": "Mitt102486",
          "body": "Im sorta looking into this for myself. Have you learned anything about it?",
          "created_utc": 1652382665.0
        }
      ]
    },
    {
      "id": "lrgfvjo",
      "author": "GoodLifeNick",
      "body": "Answer*",
      "created_utc": 1728673698.0,
      "score": 1,
      "context": [
        {
          "id": "kskv34g",
          "author": "drummondsux02",
          "body": "yeah same here! it happens with food i love and dislike. i actually just fought the urge to spit my last bite out and i felt disgusted for a moment, but now i’m fine😂",
          "created_utc": 1709147976.0
        },
        {
          "id": "lk0yvlg",
          "author": "No_Taste_5265",
          "body": "I've been doing this for years and years, I just figured why go to the DR. they never have answers. As I have other medical stuff and they can never give straight answers for everything and all the DR. don't agree with each other, when I finally get an answer it takes over 5 years to figure out.",
          "created_utc": 1724686325.0
        },
        {
          "id": "lrgftwp",
          "author": "GoodLifeNick",
          "body": "What’s the ans8",
          "created_utc": 1728673682.0
        }
      ]
    }
  ]
}