{
  "id": "invki9",
  "subreddit": "ARFID",
  "author": "goloseitjenn",
  "created_utc": 1599431737.0,
  "title": "I tried not one, but FOUR(!), new foods today!",
  "selftext": "Welp, folks. Reddit is 2/2 as far as changing my life by seeing a random comment on a post. The first instance was when I came across the comment on a writing post that led to me being assessed and then formally diagnosed with ADHD. The second instance happened today when I came across a comment on this sub mentioning Felix Economakis.\n\nThough he is based in England and I am in the US, I decided to dig into his work and saw he had a therapy video series for £99 (roughly $137 in US dollars). After 24 years of struggling to eat anything more than my safe foods, I decided to give it a shot. I am a skeptic by nature, and do not try anything as far as new therapies/medication/doctors etc. without doing some thorough research first. Nothing but testimonials praising his approach, nearly all of them discussing all of the many foods they’ve tried because of Felix Economakis. Many of them even noted their progress was due to the videos specifically, not a Skype session or in-person therapy. \n\nI figured worst case scenario, I would be out some money. $137 is not a small sum of money to me but it would not be insurmountable. I have spent more on concert tickets I was unable to use or sell. I’d be out a couple hours of my time, and it’s Labor Day weekend, so I’ve got time. And best case scenario - this could change my life. It could finally allow me to get past this condition that’s plagued me for the vast majority of my life. So to me, it wasn’t even a question.\n\nFollowing the video series, I tried the following (without gagging, getting sick, crying or having a panic attack - would be lying if I said I wasn’t a bit nervous though!):\n\n1. Diced pears - I drained almost all the juice out of the fruit cup and ended up eating about half the cup. I have never even had a bite of a pear prior to today. I did not 100% love the texture but I liked the flavor. I have 3 more cups in my fridge (bought a 4 pack) and I WILL be eating the other cups.\n\n2. Sugar-snap peas (raw) - ate the 5 peas inside, they were pleasantly sweet but had a little bit of an aftertaste that I didn’t love, so I took another bite of pear to get rid of it.\n\n3. Baby carrots (raw) - didn’t dip them in anything but just ate two baby carrots raw and after a couple bites, I am a big fan. I didn’t not think I would like the texture because I tend to gravitate towards soft foods (I had a really bad accident when I was very young that ripped out my entire top row of teeth and split my mouth and tongue) and these had a nice crunch to them, but I actually liked the crunch. I would like to start bringing these into work.\n\n4. Strawberries - I have liked lots of strawberry-flavored things (and lots of things that have strawberries in them) but I was not the biggest fan of the one I ate because it was very tart. I am willing to give it another shot though.\n\nFor the record, I don’t think I’ve tried 4 things in the last decade or so, much less 4 foods in one day. This is HUGE and I am really excited and since I don’t really talk to anybody besides my therapist and parents about my ARFID, I don’t have many people to share the triumphs with, so I thought I’d share here.\n\nI’m going to make it my goal to try one new thing a day. I’ve already decided tomorrow is avocado! Any suggestions for what some of your favorite things that you’ve tried would be very welcome also! I have a LOT to catch up on.\n\nThanks for letting me share! :)",
  "url": "https://www.reddit.com/r/ARFID/comments/invki9/i_tried_not_one_but_four_new_foods_today/",
  "score": 108,
  "num_comments": 13,
  "comments": [
    {
      "id": "g4a20oc",
      "author": "zoniqua",
      "body": "i’ve heard amazing things about Felix’s videos. So glad you were able to try some new foods!! Congrats :)",
      "created_utc": 1599434110.0,
      "score": 4,
      "context": []
    },
    {
      "id": "g4a3qxo",
      "author": "emarston23",
      "body": "Congrats!! I don’t think I’ve tried 4 new foods in 5 years either tbh x",
      "created_utc": 1599435225.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g4a9ity",
      "author": "None",
      "body": "So proud of you!! <3",
      "created_utc": 1599438877.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g4ac2pe",
      "author": "antant26",
      "body": "Way to go rock star!!! :))))",
      "created_utc": 1599440444.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g4ae82s",
      "author": "Crazy_Cat_Lady360",
      "body": "That’s awesome work 👍🏼",
      "created_utc": 1599441750.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g4aqc1p",
      "author": "Nickamin",
      "body": "As a carrot fan myself, 2 other vegetables that worked for me were cucumbers and celery because I like the crunchy part and the taste is generally on the lighter side where its barely noticeable.",
      "created_utc": 1599449378.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g4b2fnu",
      "author": "None",
      "body": "Wow. That’s awesome!!",
      "created_utc": 1599458643.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g4c7qir",
      "author": "mr-savage87",
      "body": "Fantastic effort, well done! Would you be able to provide a link as to where you accessed the videos?",
      "created_utc": 1599491627.0,
      "score": 1,
      "context": []
    },
    {
      "id": "j9etn3n",
      "author": "ophintor",
      "body": "Well done for your efforts, it's great to read success stories like this one!\n\nSince this was 2 years ago, I'm curious, how's things going ever since?",
      "created_utc": 1676981516.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g4aawna",
      "author": "goloseitjenn",
      "body": "It was honestly so worth it! I am glad to have those to go back to, I know it’s going to be easy but it will be worth it! Thanks for the kind words!",
      "created_utc": 1599439727.0,
      "score": 3,
      "context": [
        {
          "id": "g4a20oc",
          "author": "zoniqua",
          "body": "i’ve heard amazing things about Felix’s videos. So glad you were able to try some new foods!! Congrats :)",
          "created_utc": 1599434110.0
        }
      ]
    },
    {
      "id": "g4ab7kr",
      "author": "goloseitjenn",
      "body": "Thank you so much! I have tried a few new things into my diet over the years (notably, peanut butter and baby spinach, though only peanut butter was incorporated regularly to my diet), but I honestly don’t think I’ve tried anything since... maybe my last year of college 6 years ago. Thanks for the kind words!",
      "created_utc": 1599439914.0,
      "score": 3,
      "context": [
        {
          "id": "g4a3qxo",
          "author": "emarston23",
          "body": "Congrats!! I don’t think I’ve tried 4 new foods in 5 years either tbh x",
          "created_utc": 1599435225.0
        }
      ]
    },
    {
      "id": "g4ab8ql",
      "author": "goloseitjenn",
      "body": "Thank you so much, kind stranger, and happy cake day! ❤️",
      "created_utc": 1599439934.0,
      "score": 2,
      "context": [
        {
          "id": "g4a9ity",
          "author": "None",
          "body": "So proud of you!! <3",
          "created_utc": 1599438877.0
        }
      ]
    },
    {
      "id": "g4ardp4",
      "author": "goloseitjenn",
      "body": "I’ll add celery to my list (and I already like cucumber)! Thanks for the suggestions!",
      "created_utc": 1599450114.0,
      "score": 1,
      "context": [
        {
          "id": "g4aqc1p",
          "author": "Nickamin",
          "body": "As a carrot fan myself, 2 other vegetables that worked for me were cucumbers and celery because I like the crunchy part and the taste is generally on the lighter side where its barely noticeable.",
          "created_utc": 1599449378.0
        }
      ]
    }
  ]
}