{
  "id": "j4qdzh",
  "subreddit": "ARFID",
  "author": "None",
  "created_utc": 1601773486.0,
  "title": "TW: Was anyone else punished for not eating as a child?",
  "selftext": "Not gonna sugarcoat it. If I didn't eat my food as a child, I was beaten for wasting food. I would cry at every meal time because I didn't like food, and I knew the consequences of not eating. Sometimes I got away with crying myself to sleep. But mostly I would have to sit at the table for hours, and when they saw that I wasn't going to eat, I was beaten and sent to bed. \n\nI weighed about 30 lbs until I was 7 or 8 years old.",
  "url": "https://www.reddit.com/r/ARFID/comments/j4qdzh/tw_was_anyone_else_punished_for_not_eating_as_a/",
  "score": 101,
  "num_comments": 38,
  "comments": [
    {
      "id": "g7ldtbj",
      "author": "softlace",
      "body": "Yep, i was weighing 40 pounds at 9 years old. I was beat and forced to stay at the table if I didn’t finish that ended up in me sleeping there (which now that I think of it is probably is why i enjoy sleeping on hard surfaces). I was strapped to chairs until I finished, and shamed if I didn’t finish. I was also sent to bed without dinner most nights, because they had the mentality “if you don’t eat what I put on the table you’re not going to eat.”",
      "created_utc": 1601775248.0,
      "score": 31,
      "context": []
    },
    {
      "id": "g7lufah",
      "author": "amdaly10",
      "body": "We had a family rule that you had to stay at the table until your plate was clean.  So I spent many nights sitting at the dinner table until bed time.",
      "created_utc": 1601780852.0,
      "score": 26,
      "context": []
    },
    {
      "id": "g7li91r",
      "author": "ManicMaenads",
      "body": "Sort of, I had an eating disorder that caused me to gag up most foods. At first they tried forcing me, not letting me leave the table, hurting me when I threw up, etc.. and then they stopped feeding me altogether. No school lunches, one year a teacher reported them and they /had/ to pack food but I just got a slice of bread. Weird shit.\n\nNow I have a food phobia, which exacerbates the eating disorder. And when I /do/ eat, I feel guilty about it like I don't deserve it. I was hoping I'd grow out of it.\n\nSorry to hear they did that to you, I hope you're able to enjoy food as an adult.",
      "created_utc": 1601776797.0,
      "score": 16,
      "context": []
    },
    {
      "id": "g7m51qu",
      "author": "MrVonic",
      "body": "I wasn't punished for not eating (thankfully my parents understood eating something is better than nothing) but they took me to a child psychologist when I was around 11 who traumatized me about my ED and kept me from getting therapy for years for unrelated things that I desperately needed. \n\nI've since gotten the therapy I needed and have a better time dealing with trauma he left me with, but it has definitely kept me from dating for years at a time cuz I still hear him tell me \"you'll never get a girlfriend if you eat like this\". Proved him wrong a few times now though so he can suck on that lol",
      "created_utc": 1601784921.0,
      "score": 11,
      "context": []
    },
    {
      "id": "g7lrvl1",
      "author": "xeoda",
      "body": "my parents flat out refused to let me, at the age of about 7 or 8 years old eat anything until i ate fruit.\ni went three days without eating because even the thought of eating fruit would bring me close to vomiting. they deny doing anything wrong, though because they didn't directly deny me food\", they refuse to believe they were in the wrong.\nthey've done this a multiple other times afterwards as well, unfortunately.",
      "created_utc": 1601779969.0,
      "score": 8,
      "context": []
    },
    {
      "id": "g7mhn3t",
      "author": "DifferentIsPossble",
      "body": "I tried to be a \"good kid.\" I learned to control my gag reflex so well. I ate bad foods every day. Every meal was dread. I begged them to make me anything else for lunch. Anything. Anything. 'There's less butter this time. You won't notice it.' 'The ham is the best kind, just eat it.'\n\nThey always remembered me as a bad kid and they will always remember me as a bad kid bc of all the trouble I had. Maybe if I was a real bad kid and puked they'd learn I was serious about it being inedible instead of mocking me for choking stuff down like it was garbage to avoid my gag reflex.",
      "created_utc": 1601789431.0,
      "score": 5,
      "context": []
    },
    {
      "id": "g7mkner",
      "author": "5minutecall",
      "body": "I would get screamed at and smacked when I wouldn’t eat my vegetables.  I wasn’t allowed to leave the table until I finished them.  A few times I threw up while trying to eat them and I got grounded.  Eventually my parents said if I didn’t eat what they ate I hat to cook it myself.  I was like 9 and had no idea how to cook so this led to me eating A LOT of pasta (pasta, pasta sauce and cheese). Like 6 nights a week.  It became my ultimate safe food and I put on a lot of weight.  My dad belittled me and laughed at me and told me no one would ever love me because I’m so fat and such a picky eater.  \n\nI’m 29 now and only got diagnosed with ARFID a couple of months ago.",
      "created_utc": 1601790602.0,
      "score": 5,
      "context": []
    },
    {
      "id": "g7mn20s",
      "author": "standard_candles",
      "body": "I wasn't punished by my parents but I was by everyone else in my life. My parents always forced me to take 3 bites of anything on my plate but after that they wouldn't force me anymore. Now I do this stupid stuff where I make food, eat 3 bites of it, actually despise it and can't eat anymore, but I pretend like it is good and fine, move it around on my plate, hide it in a napkin and then throw it away. I do it with food THAT I MAKE FOR MYSELF. My husband after the 10 years we've been together finally noticed what I was doing and really pushed for us to figure out meals we can have that I actually want to eat. He's not particular, he'll have whatever, as long as it works for me. It's so nice having someone around supporting me about food because I am severely underweight.",
      "created_utc": 1601791512.0,
      "score": 5,
      "context": []
    },
    {
      "id": "g7lp1ak",
      "author": "LongtimelurkerWaley",
      "body": "My punishments(that I remember):\nSavings taken from my piggy bank\nNo vbs(Bible school)\nHave to sit at the table until I finish\nForce feeding\nSpanking\n\nThe guilt trips:\nDo it for your dog\nIf you don’t eat you won’t ever have a boyfriend\nYou won’t be able to have kids\nPeople will think you’re weird\nWe are worried about you\n\nI had massive anxiety about mealtimes. I got really good at riding our hunger pains til breakfast the next day. I’m honestly still so upset by what my parents did.",
      "created_utc": 1601778998.0,
      "score": 4,
      "context": []
    },
    {
      "id": "g7mg3zp",
      "author": "cloudfangLP",
      "body": "I was actually forced to eat something by my step-mom when I was young, something I didn't like but she wouldn't stop until I eat it. No wonder I still have this eating disorder in my late 20's. Shit like that really affects someone. I remember it super vividly too and that's also probably why my safe foods are what they are because I know for a fact I like them and literally make me feel safe.",
      "created_utc": 1601788856.0,
      "score": 4,
      "context": []
    },
    {
      "id": "g7nhr55",
      "author": "None",
      "body": "My most memorable negative food experience was having a bowl of tinned spaghetti on my head and being made to sit still at the table while everyone else finished their dinners before being allowed a bath.\n\nAnd I was never physically abused but I was definitely made to eat foods that I didn’t like. I remember chewing meat until it was that dry I couldn’t do anything but spit it in the bin. Repeatedly every Sunday. What was at some point probably beef, turned into a whitish ball of cardboard or just a mass that I couldn’t possibly swallow.",
      "created_utc": 1601803370.0,
      "score": 5,
      "context": []
    },
    {
      "id": "g7occx4",
      "author": "nueve",
      "body": "I was force fed on several occasions by different people after refusing to eat, or trying and then gagging/puking. It is the primary reason I think I still have ARFID into my early 40's now.",
      "created_utc": 1601817059.0,
      "score": 4,
      "context": []
    },
    {
      "id": "g7otojd",
      "author": "KCCubana",
      "body": "As the mom of a seven year old with ARFID, my heart breaks for all of you and the trauma your parents inflicted on you around food & eating. \n\nThank you for sharing your stories. I'm sorry you were treated the way you were. I hope you all find health and happiness and enough safe foods to keep your belly full!",
      "created_utc": 1601826262.0,
      "score": 4,
      "context": []
    },
    {
      "id": "g7m6d35",
      "author": "FunnelCakeGoblin",
      "body": "Never that drastic, but I do remember my mom loosing her cool one day and smashing scrambled eggs in my face.",
      "created_utc": 1601785408.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g7n648x",
      "author": "AshOfTheLilacs",
      "body": "I was never really 'punished' but I'd get screamed at until I finished whatever was on my plate, even if it was cold and hard and inedible at that point.",
      "created_utc": 1601798730.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g7oos9h",
      "author": "No-Drummer9244",
      "body": "Yes I got spanking and given no dinner if I was not going to eat the new food my parents wanted me to. My parents said they thought forcing me would fix me.",
      "created_utc": 1601823517.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g7p98dw",
      "author": "bobainwonderland",
      "body": "Yup. And it makes things so difficult now as I try to eat healthier and better for myself. I can’t find anything new right now that doesn’t give me anxiety hives.",
      "created_utc": 1601833927.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g7qfyb7",
      "author": "jettsona",
      "body": "I’m so sorry you were abused. I was never hit, but I was guilted at the table for years until my mother realised that ‘just eat what you can’ is more effective than ‘there’s starving children in africa’",
      "created_utc": 1601853637.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g7q3l1f",
      "author": "SinuconStar",
      "body": "Same. I would sit at the table till 11pm because a lot of the food I couldn't stomach...would be grounded or got a hiding.\nBrothers constantly bullied me.\n\nWhen I started living on my own, I learned new ways to cook the same veggies in a much more appealing way and I enjoy my meals. Being able to experiment helped me to get over my fear of certain foods.\n\nWhen I would visit my parents, I offer to cook them veggies like brussel sprouts but I roast them in the air fryer my way and even they love it.\n\nBut I still hate all fruit though....",
      "created_utc": 1601846682.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g7qbj8g",
      "author": "wyndchilde",
      "body": "I was made to eat textures I couldn't handle to the point of vomiting a couple of times throughout my childhood. My mom sad that it was my fault for working myself up so much. \n\n\n\nShe would trap us at the table and the verbally degrade us for being there. She once almost banned me from a performance, and made me choke down the food to go. I remember it tasted salty from all the tears. \n\n\n\nI've been throwing textures up since I was six. Luckily, our mom has bad food habits herself, so eventually I'd find a way to exist on soft foods. \n\n\n\nI would still rather meet physical harm than put certain textures in my mouth. Like, is the choice eat this or get punched in the face? Well, don't break any bones I guess. But I'll take the punch.",
      "created_utc": 1601851100.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g7uevxd",
      "author": "cynicsjoy",
      "body": "I wasn’t beaten, nor did I have an ED, but I had a limited list of foods I liked. My parents would constantly try to get me to try more foods but I just couldn’t. It led to a lot of yelling on their part and crying on mine. I used to get called a little shit when I refused to eat it and cried when they tried to force me, sometimes I’d get grounded for it.",
      "created_utc": 1601941540.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g833sfe",
      "author": "AmbivalentAlexi3",
      "body": "Wow i can relate to you all. Ive never openly talked to anyone about this without being mocked. We are in this together guys. I can finally not be ashamed and cry about this. Look at us! We are struggling but we are surviving. We suffered and barely scrape by but we somehow keep pulling it off. Some of the stuff i read yanked my heart badly. I wasnt abused but i was made to sit at the table and id sit there all night until morning. Dad still doesnt quite understand Afrid he thinks im just stubborn and picky. Hes not wrong but he is not right either. He was amazed at my willpower not to eat foods. Fortunately i got a endoscopy done and barium swallow test which i failed. The failure proved i had swallowing issues and gag reflex. I couldnt swallow at all when i was a baby and needed speech therapy to learn how to do it. I suspect as i grew so did my throat and because of it i had to relearn how to adjust to the swallowing each growth but thats only a theory.",
      "created_utc": 1602138174.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gefs7x4",
      "author": "LuminescentSapphire",
      "body": "Definitely. I was hit and forced to sit at the table for hours. Sometimes once I had finally agreed to eat my dad would say I was ungrateful and threw out the food. Then my mum screamed at him because she wanted me to eat tgen she had to make food again and it was just generally an awful experience.",
      "created_utc": 1606957076.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g81p7zs",
      "author": "shibassss",
      "body": "I wasn't beaten for wasting food but I literally remember sitting at the kitchen table for like 20 minutes when I was like 7 because my mum told me I wasn't allowed to come upstairs until I ate all my food. yeah I didn't eat it I just left in the end",
      "created_utc": 1602107626.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g7lg38p",
      "author": "None",
      "body": "My parents said the same thing. :/ I'm sorry you went through that.",
      "created_utc": 1601776050.0,
      "score": 11,
      "context": [
        {
          "id": "g7ldtbj",
          "author": "softlace",
          "body": "Yep, i was weighing 40 pounds at 9 years old. I was beat and forced to stay at the table if I didn’t finish that ended up in me sleeping there (which now that I think of it is probably is why i enjoy sleeping on hard surfaces). I was strapped to chairs until I finished, and shamed if I didn’t finish. I was also sent to bed without dinner most nights, because they had the mentality “if you don’t eat what I put on the table you’re not going to eat.”",
          "created_utc": 1601775248.0
        }
      ]
    },
    {
      "id": "g7qcf3z",
      "author": "bfaithr",
      "body": "My parents still have the same mentality. Unfortunately I still live with them at 22. During quarantine, I’ve had to sneak the majority of my meals.",
      "created_utc": 1601851592.0,
      "score": 1,
      "context": [
        {
          "id": "g7ldtbj",
          "author": "softlace",
          "body": "Yep, i was weighing 40 pounds at 9 years old. I was beat and forced to stay at the table if I didn’t finish that ended up in me sleeping there (which now that I think of it is probably is why i enjoy sleeping on hard surfaces). I was strapped to chairs until I finished, and shamed if I didn’t finish. I was also sent to bed without dinner most nights, because they had the mentality “if you don’t eat what I put on the table you’re not going to eat.”",
          "created_utc": 1601775248.0
        }
      ]
    },
    {
      "id": "g7nemn3",
      "author": "FluffyMuffins42",
      "body": "I’m so sorry. \n\nMy punishment for not finishing my plate was staying there until bedtime. And my step mom would feel bad for me and let me go early. (I know, it’s crazy that the step mom stands up for you over the dad). \n\nNow that I think of it, I’ve spent hundreds of hours sitting at the table staring at my food because I couldn’t handle certain textures and my parents thought I was being horrible on purpose. Sorry if I GAG while eating certain foods.",
      "created_utc": 1601802061.0,
      "score": 13,
      "context": [
        {
          "id": "g7lufah",
          "author": "amdaly10",
          "body": "We had a family rule that you had to stay at the table until your plate was clean.  So I spent many nights sitting at the dinner table until bed time.",
          "created_utc": 1601780852.0
        }
      ]
    },
    {
      "id": "g7lzw0b",
      "author": "None",
      "body": "We had that rule too. Even without physical abuse, this is still very traumatizing. I'm sorry.",
      "created_utc": 1601782998.0,
      "score": 8,
      "context": [
        {
          "id": "g7lufah",
          "author": "amdaly10",
          "body": "We had a family rule that you had to stay at the table until your plate was clean.  So I spent many nights sitting at the dinner table until bed time.",
          "created_utc": 1601780852.0
        }
      ]
    },
    {
      "id": "g7nb11o",
      "author": "None",
      "body": "Same then a beating :(",
      "created_utc": 1601800627.0,
      "score": 1,
      "context": [
        {
          "id": "g7lufah",
          "author": "amdaly10",
          "body": "We had a family rule that you had to stay at the table until your plate was clean.  So I spent many nights sitting at the dinner table until bed time.",
          "created_utc": 1601780852.0
        }
      ]
    },
    {
      "id": "g7lp9v9",
      "author": "LongtimelurkerWaley",
      "body": "I can relate to feeling guilty about eating. I’m sorry :(",
      "created_utc": 1601779078.0,
      "score": 3,
      "context": [
        {
          "id": "g7li91r",
          "author": "ManicMaenads",
          "body": "Sort of, I had an eating disorder that caused me to gag up most foods. At first they tried forcing me, not letting me leave the table, hurting me when I threw up, etc.. and then they stopped feeding me altogether. No school lunches, one year a teacher reported them and they /had/ to pack food but I just got a slice of bread. Weird shit.\n\nNow I have a food phobia, which exacerbates the eating disorder. And when I /do/ eat, I feel guilty about it like I don't deserve it. I was hoping I'd grow out of it.\n\nSorry to hear they did that to you, I hope you're able to enjoy food as an adult.",
          "created_utc": 1601776797.0
        }
      ]
    },
    {
      "id": "g7m5rd6",
      "author": "None",
      "body": "Ugh, it's always the pits when you have a bad experience with a medical professional. They're supposed to help you, not make things worse. I'm glad you proved him wrong and you were able to push through his bad example and get the help you needed.",
      "created_utc": 1601785192.0,
      "score": 3,
      "context": [
        {
          "id": "g7m51qu",
          "author": "MrVonic",
          "body": "I wasn't punished for not eating (thankfully my parents understood eating something is better than nothing) but they took me to a child psychologist when I was around 11 who traumatized me about my ED and kept me from getting therapy for years for unrelated things that I desperately needed. \n\nI've since gotten the therapy I needed and have a better time dealing with trauma he left me with, but it has definitely kept me from dating for years at a time cuz I still hear him tell me \"you'll never get a girlfriend if you eat like this\". Proved him wrong a few times now though so he can suck on that lol",
          "created_utc": 1601784921.0
        }
      ]
    },
    {
      "id": "g7lsob2",
      "author": "None",
      "body": "Abusive people often blame others for their faults, or deny by trying to rationalize their behavior. \n\nI'm sorry your parents suck. I know what it's like. And I take it fruits are not safe foods for you?",
      "created_utc": 1601780247.0,
      "score": 7,
      "context": [
        {
          "id": "g7lrvl1",
          "author": "xeoda",
          "body": "my parents flat out refused to let me, at the age of about 7 or 8 years old eat anything until i ate fruit.\ni went three days without eating because even the thought of eating fruit would bring me close to vomiting. they deny doing anything wrong, though because they didn't directly deny me food\", they refuse to believe they were in the wrong.\nthey've done this a multiple other times afterwards as well, unfortunately.",
          "created_utc": 1601779969.0
        }
      ]
    },
    {
      "id": "g7lrhf1",
      "author": "None",
      "body": "Yeah I'm still upset about what mine did too. They were really abusive; that was just one thing among many. \n\nI'm sorry that happened to you. I hope you're away from them and you're able to focus on taking care of yourself. 💚",
      "created_utc": 1601779836.0,
      "score": 5,
      "context": [
        {
          "id": "g7lp1ak",
          "author": "LongtimelurkerWaley",
          "body": "My punishments(that I remember):\nSavings taken from my piggy bank\nNo vbs(Bible school)\nHave to sit at the table until I finish\nForce feeding\nSpanking\n\nThe guilt trips:\nDo it for your dog\nIf you don’t eat you won’t ever have a boyfriend\nYou won’t be able to have kids\nPeople will think you’re weird\nWe are worried about you\n\nI had massive anxiety about mealtimes. I got really good at riding our hunger pains til breakfast the next day. I’m honestly still so upset by what my parents did.",
          "created_utc": 1601778998.0
        }
      ]
    },
    {
      "id": "g7qboqb",
      "author": "wyndchilde",
      "body": "All fruit can rot in hell, far as I'm concerned.",
      "created_utc": 1601851186.0,
      "score": 1,
      "context": [
        {
          "id": "g7q3l1f",
          "author": "SinuconStar",
          "body": "Same. I would sit at the table till 11pm because a lot of the food I couldn't stomach...would be grounded or got a hiding.\nBrothers constantly bullied me.\n\nWhen I started living on my own, I learned new ways to cook the same veggies in a much more appealing way and I enjoy my meals. Being able to experiment helped me to get over my fear of certain foods.\n\nWhen I would visit my parents, I offer to cook them veggies like brussel sprouts but I roast them in the air fryer my way and even they love it.\n\nBut I still hate all fruit though....",
          "created_utc": 1601846682.0
        }
      ]
    },
    {
      "id": "g7m6ptq",
      "author": "MrVonic",
      "body": "Thank you, and I hope you've been able to push through with your troubles as well, and if not, then I wish you all the best with your recovery 🙂",
      "created_utc": 1601785532.0,
      "score": 1,
      "context": [
        {
          "id": "g7m51qu",
          "author": "MrVonic",
          "body": "I wasn't punished for not eating (thankfully my parents understood eating something is better than nothing) but they took me to a child psychologist when I was around 11 who traumatized me about my ED and kept me from getting therapy for years for unrelated things that I desperately needed. \n\nI've since gotten the therapy I needed and have a better time dealing with trauma he left me with, but it has definitely kept me from dating for years at a time cuz I still hear him tell me \"you'll never get a girlfriend if you eat like this\". Proved him wrong a few times now though so he can suck on that lol",
          "created_utc": 1601784921.0
        },
        {
          "id": "g7m5rd6",
          "author": "None",
          "body": "Ugh, it's always the pits when you have a bad experience with a medical professional. They're supposed to help you, not make things worse. I'm glad you proved him wrong and you were able to push through his bad example and get the help you needed.",
          "created_utc": 1601785192.0
        }
      ]
    },
    {
      "id": "g7lt2pq",
      "author": "xeoda",
      "body": "they aren't *horrible* imo. it's mostly just always been with food -- fruits are very much not a safe food though.",
      "created_utc": 1601780389.0,
      "score": 3,
      "context": [
        {
          "id": "g7lrvl1",
          "author": "xeoda",
          "body": "my parents flat out refused to let me, at the age of about 7 or 8 years old eat anything until i ate fruit.\ni went three days without eating because even the thought of eating fruit would bring me close to vomiting. they deny doing anything wrong, though because they didn't directly deny me food\", they refuse to believe they were in the wrong.\nthey've done this a multiple other times afterwards as well, unfortunately.",
          "created_utc": 1601779969.0
        },
        {
          "id": "g7lsob2",
          "author": "None",
          "body": "Abusive people often blame others for their faults, or deny by trying to rationalize their behavior. \n\nI'm sorry your parents suck. I know what it's like. And I take it fruits are not safe foods for you?",
          "created_utc": 1601780247.0
        }
      ]
    },
    {
      "id": "g8durw2",
      "author": "LongtimelurkerWaley",
      "body": "Thank you. I’m safe. I still struggle but at least I’m not anxious every meal now.",
      "created_utc": 1602369428.0,
      "score": 1,
      "context": [
        {
          "id": "g7lp1ak",
          "author": "LongtimelurkerWaley",
          "body": "My punishments(that I remember):\nSavings taken from my piggy bank\nNo vbs(Bible school)\nHave to sit at the table until I finish\nForce feeding\nSpanking\n\nThe guilt trips:\nDo it for your dog\nIf you don’t eat you won’t ever have a boyfriend\nYou won’t be able to have kids\nPeople will think you’re weird\nWe are worried about you\n\nI had massive anxiety about mealtimes. I got really good at riding our hunger pains til breakfast the next day. I’m honestly still so upset by what my parents did.",
          "created_utc": 1601778998.0
        },
        {
          "id": "g7lrhf1",
          "author": "None",
          "body": "Yeah I'm still upset about what mine did too. They were really abusive; that was just one thing among many. \n\nI'm sorry that happened to you. I hope you're away from them and you're able to focus on taking care of yourself. 💚",
          "created_utc": 1601779836.0
        }
      ]
    }
  ]
}