{
  "id": "j8d32c",
  "subreddit": "ARFID",
  "author": "dollysfilter",
  "created_utc": 1602299207.0,
  "title": "I cried when i found out ARFID was a Thing",
  "selftext": "a couple weeks ago, i was googling stuff about how to get over picky eating as an adult/healthy foods for adult picky eaters because i'm currently at the lowest weight that i've ever been in my 5 years of adult life (and thus really feeling the effects of not eating healthy). And i came across an article about arfid. Reading it just felt like such a revelation - i hadn't felt such a feeling of \"oh my god, that's ME\" since i was in high school and found out what social anxiety was. And then i read more about it, read some threads on here about it, and i actually cried when i read other people's experiences growing up - because they were exactly like mine. \n\nMost people probably wouldn't think that comments about being a \"picky eater\" would affect a person so much, but as you guys probably know, hearing comments and jokes about it on at LEAST a weekly basis for 20+ years really weighs on you. And yeah, i thought i had gotten used to it, it was something i was sometimes just numb to, but there were still moments where i'd start a new job or meet new people in school and it would start all over again and i'd get annoyed. New people to gradually discover that you're a \"picky eater\" and make the surprised comments about food you can't eat, new people to make the harmless jokes they probably thought were original but that you've heard 1000 times. New people to go \"no you should try this, you don't even notice the onions in it!!\" and pressuring you to \"try something new!\" Years and years of that frustration and helplessness really came out when i read about others' experiences. ESPECIALLY the experiences growing up when your family tries to make you eat the family dinner and you feel like crying (or actually do cry) because of the texture you know will be in there. It was all some much to process but it was so VALIDATING. \n\nSo there i was, at 2am when i had to be up for work in 3 1/2 hours, crying my eyes out because there was actually an explanation for this Thing that i've dealt with my whole life. \n\nI always procrastinate things, especially with making doctor appointments, but let me TELL you how fast i contacted someone. And now a couple weeks later i'm set to start PHP on Monday and i'm feeling so optimistic. I just want to be better. And my friends have all been so supportive, my mom as well (who was also shocked and very much \"oh my god that explains so much\"). I'm just excited to finally be on the road to eating healthy and not experiencing the annoying symptoms of malnourishment.\n\nUpdate:\n\nSince i rediscovered this post 2 years later, thought i'd update for any future readers:  \n\nThrough the whole 4 month process in the ED program (PHP) and working with lots of providers, I got diagnosed with autism lmao (i never once considered that and had to unlearn my preconceived assumptions about it, but WOW does it fit). My team had apparently been suspecting for a while just based on spending every day with me (sensory issues, the general how-I-come-across-socially, my thought process when it came to therapeutic exercises/discussions, and executive dysfunction issues that I didn't know had explanations for in regard to things i've struggled with my whole life) and referred me to someone to get diagnosed... at which that doctor said i masked heavily, but that underneath it I was a \"textbook female case\" 🙃\n\nThe program helped develop eating schedules, but it got to a point i couldn't handle it anymore. I was teaching sensory overload daily and cried many times during the meals... I hadn't actually sobbed because of a danger-zone meal while covering my ears to \"make everything stop\" since i was a child 🫠 \nThe program was so so important in figuring things out about myself, and how to better recognize the issues that have been plaguing me my whole life while finding ways to support myself with that knowledge in mind, and it's still a journey i'm on 2 years later, but ED programs just aren't designed with neurodivergent people in mind. I found a nutritionist at the beginning of this year when i was getting down in weight again that specializes in autism & adhd, and it's been a life changer. She said she's seen a lot of neurodivergent people coming out of those programs traumatized, especially autistic ones dealing with ARFID/severe sensory issues.",
  "url": "https://www.reddit.com/r/ARFID/comments/j8d32c/i_cried_when_i_found_out_arfid_was_a_thing/",
  "score": 93,
  "num_comments": 9,
  "comments": [
    {
      "id": "g8abfjr",
      "author": "SarcasticRN",
      "body": "Welcome. You’re not alone.",
      "created_utc": 1602303173.0,
      "score": 9,
      "context": []
    },
    {
      "id": "g8ahdtj",
      "author": "alcibaties",
      "body": "I. Cried. To.",
      "created_utc": 1602308089.0,
      "score": 6,
      "context": []
    },
    {
      "id": "g8ajnbm",
      "author": "None",
      "body": "Me too.",
      "created_utc": 1602310260.0,
      "score": 6,
      "context": []
    },
    {
      "id": "g8c77q9",
      "author": "metrouver",
      "body": "Sending you a bunch of hugs, because I can relate to that feeling of being seen so much, and of having hope. I want to tell you to hold on to that hope because making progress with ARFID is not linear and it's not easy. There will probably be days where you feel really frustrated and don't remember the excitement and hope you have right now. But if you save this post and can hold on to the reasons you want change, it helps so much to be able to push through the intense discomfort of working on a new texture or flavour.",
      "created_utc": 1602348618.0,
      "score": 4,
      "context": []
    },
    {
      "id": "g8azrmh",
      "author": "alcibaties",
      "body": "I found out sane about SAD at 14. Love to chat if wanna",
      "created_utc": 1602326927.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g8duo80",
      "author": "lelaluv",
      "body": "my boyfriend sent me the link to this subreddit a few days ago and i almost cried too, i always thought i was just weird or something i’ve been made fun of by everyone my whole life for how i eat and i finally don’t feel alone in it. i’m glad you’re feeling more optimistic 🤍",
      "created_utc": 1602369396.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g9mqso0",
      "author": "Lethalogicax",
      "body": "I just discovered this was a thing today and Ive had not one, not two, but FOUR breakdowns! I balled my eyes out when I read everyone elses stories and found out I wasnt alone. Now I know theres a word for this and I know help exists! We wish you the best of luck, stay safe!",
      "created_utc": 1603358352.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gefrawg",
      "author": "LuminescentSapphire",
      "body": "I felt like crying when I found out about it a couple days ago. My whole life I was told that I was a shitty kid and caused so many problems, now I have actually found an explanation.",
      "created_utc": 1606956567.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g8e02zt",
      "author": "AnimeSauceBot",
      "body": "i cried, and when i told my friend she cried, and when i told my parents they cried. i totally get it.",
      "created_utc": 1602371106.0,
      "score": 1,
      "context": []
    }
  ]
}