{
  "id": "j8qyvs",
  "subreddit": "ARFID",
  "author": "MrsMaggs",
  "created_utc": 1602359287.0,
  "title": "I'm so happy not to be alone in this!",
  "selftext": "I just wanted to say thank you to each and every one of you for being so honest and open.\n\nI just got back from a pretty expensive meal that I didn't enjoy one bit.  They first brought my starter and added balsamic onions which I didn't ask for, to which someone at my table said \"oh, can't you just eat it, or scrape it off?\".   They don't realise how much I would want to heave and probably cry if I ate it.\n\nThen the mains came (Spaghetti Carbonara) no cream/cheese just very oily pasta with some bacon thrown on.  I just couldn't eat it.\n\nI'm so sick of feeling like a complete child when I can't just eat anything like \"normal\" adults.\n\nI always wonder why everyone else is allowed a phobia or fear (heights, spiders, the dark, theme park rides) but we ARFID sufferers are not...we are just seen as childish!?\nDrives me insane.\n\nAnyway, thank you for letting me rant a little.  This is a disorder that will probably kill me when I'm not much older (I'm 38 now) but I do continue to try new foods but when things like black pepper are so strong, what hope do I have with things like curry!\n\nThank you again for being an awesome community...you make me feel a little less crazy.  Much love to you all xxx",
  "url": "https://www.reddit.com/r/ARFID/comments/j8qyvs/im_so_happy_not_to_be_alone_in_this/",
  "score": 84,
  "num_comments": 2,
  "comments": [
    {
      "id": "g8dcx47",
      "author": "AmbivalentAlexi3",
      "body": "Same to you. Sometimes all you really need is to be understood.",
      "created_utc": 1602363718.0,
      "score": 7,
      "context": []
    },
    {
      "id": "i6ilhpj",
      "author": "MrsMaggs",
      "body": "Yes, so many people ridicule us, it's very hurtful xx",
      "created_utc": 1651141252.0,
      "score": 1,
      "context": [
        {
          "id": "g8dcx47",
          "author": "AmbivalentAlexi3",
          "body": "Same to you. Sometimes all you really need is to be understood.",
          "created_utc": 1602363718.0
        }
      ]
    }
  ]
}