{
  "id": "jhbwq7",
  "subreddit": "ARFID",
  "author": "OdinClark",
  "created_utc": 1603557136.0,
  "title": "The lack of knowledge and understanding behind ARFID is the most frustrating thing to me",
  "selftext": "I've always been a picky eater my whole life, despite really wanting to participate in something as simple as eating in a restaurant with my family. It's always been a deeply personal thing for me and I've always been ridiculed by people for it. When I found out that ARFID was a thing, it honestly changed my life because for the first time in my life, I wasn't alone. I've always been lucky enough to have a wider palette than some other people on here but it still affects me in my day to day life and even something where I've had to make up excuses to not go out with friends to eat. I've even been  laughed at by a lady behind a deli for wanting a plain chicken wrap. Even a few minutes ago, my best friends made fun of me for not eating much food despite telling them about ARFID. They just don't understand that I was in tears recently just for not being able to eat a plain burger with lettuce on it. As much as I'd love to eat like a normal person, I just at least wish people understood how serious of a thing this is to me and all other people affected by this and that people can be more widely educated without me feeling persecuted for having an eating disorder. Sorry for the rant but this is the only place I feel I can let out how I feel without being made to feel like I'm crazy.",
  "url": "https://www.reddit.com/r/ARFID/comments/jhbwq7/the_lack_of_knowledge_and_understanding_behind/",
  "score": 120,
  "num_comments": 9,
  "comments": [
    {
      "id": "g9xf6gh",
      "author": "MuskokaJonas",
      "body": "I feel the same way. when I first found out about ARFID I told my mom and she said I was just \"looking for labels\" and that I just needed to not be so sensitive. I've since been to a nutritionist and am working on getting enough nutrients despite my narrow palette. but even now after I explain to my friends that I have ARFID, they still make fun of me for things like not liking any sauces on my meat and cheese tacos. It's super frustrating having to feel like I'm too weird for my friends. It has honestly made me want to stop eating around them.",
      "created_utc": 1603558724.0,
      "score": 23,
      "context": []
    },
    {
      "id": "g9ydees",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1603574960.0,
      "score": 10,
      "context": []
    },
    {
      "id": "g9zdm3q",
      "author": "Crazy_Cat_Lady360",
      "body": "My son (11) came with us to a sushi train for his brothers 18th birthday. I didn’t expect him to come. I didn’t expect him to eat anything. But to my surprise he ate 4 pieces of sushi (just rice, crumbed chicken breast, cucumber and cream cheese). I was so proud of him. He came home and filled up on sandwiches but I’m so glad he tried something. He hasn’t been to a restaurant in over 3 years.",
      "created_utc": 1603587992.0,
      "score": 7,
      "context": []
    },
    {
      "id": "ga0dk3z",
      "author": "itsanofrommedog1",
      "body": "I agree it can be so frustrating. Luckily most of my friends and my husband are very understanding and supportive, and my parents have mostly accepted it at this point. But my siblings still tease me about it and it’s like don’t you think I want to be normal?? Why would I choose to be this picky and odd and have people making fun of me all the time?",
      "created_utc": 1603601884.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ga0p2vp",
      "author": "neptune_pirate",
      "body": "so validating reading all these comments",
      "created_utc": 1603607477.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ga0zl2b",
      "author": "EliotTheGreat20",
      "body": "I feel the same way, the other night I lashed out on my dad because I told him I couldn't eat a certain type of pizza because of the spinach and that it was too slippery, and he went ahead with his common words of \"just eat it, its just your anxiety, you'll never get over it if you don't just chew and swallow-\" he was about to continue but then I  yelled at him saying that I have an testing disorder and its not just anxiety, I can just \"chew and swallow things with ease\" it frustrates me so much, I wish people similar to my dad would just understand!! I can't just swallow stuff, I physically can't, when will people understand??",
      "created_utc": 1603612539.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g9xl4ri",
      "author": "axw3555",
      "body": "The labels thing rings really true for me. Any time I have *anything*, even something as simple as tendonitis, I'm \"looking for labels\".\n\nTBH, I've reached the point where I don't take it anymore. My mum, I just tell her that if she's not going to support me, she's going to shut the hell up until she will. And with people who take the piss despite knowing better, I just start picking at every little quirk of theirs until it annoys them. When they start moaning, I just go \"oh, so it's OK for you to make fun of my ED, but if I take the piss out of you for a BBQ base or not having ice in a soft drink, I've gone too far?\".\n\nAnd in a few cases, it just turns to me going \"oh, shut the fuck up\" when they start. (If they get that far, they're people I suffer being around, not friends, not even acquaintances).\n\nI really wasn't kidding when I said my tolerance for that kind of bullshit was zero these days.",
      "created_utc": 1603561761.0,
      "score": 19,
      "context": [
        {
          "id": "g9xf6gh",
          "author": "MuskokaJonas",
          "body": "I feel the same way. when I first found out about ARFID I told my mom and she said I was just \"looking for labels\" and that I just needed to not be so sensitive. I've since been to a nutritionist and am working on getting enough nutrients despite my narrow palette. but even now after I explain to my friends that I have ARFID, they still make fun of me for things like not liking any sauces on my meat and cheese tacos. It's super frustrating having to feel like I'm too weird for my friends. It has honestly made me want to stop eating around them.",
          "created_utc": 1603558724.0
        }
      ]
    },
    {
      "id": "g9zdh22",
      "author": "syntheticjoy_",
      "body": "I truly hate people sometimes. They're laughing at an eating disorder.",
      "created_utc": 1603587939.0,
      "score": 4,
      "context": [
        {
          "id": "g9xf6gh",
          "author": "MuskokaJonas",
          "body": "I feel the same way. when I first found out about ARFID I told my mom and she said I was just \"looking for labels\" and that I just needed to not be so sensitive. I've since been to a nutritionist and am working on getting enough nutrients despite my narrow palette. but even now after I explain to my friends that I have ARFID, they still make fun of me for things like not liking any sauces on my meat and cheese tacos. It's super frustrating having to feel like I'm too weird for my friends. It has honestly made me want to stop eating around them.",
          "created_utc": 1603558724.0
        }
      ]
    },
    {
      "id": "g9zdsb8",
      "author": "syntheticjoy_",
      "body": "It always confuses me when people make fun of a diet that's so cheap and low-maintenance. Like, I don't need 100 toppings on my pizzas and burgers, Karen.",
      "created_utc": 1603588056.0,
      "score": 6,
      "context": [
        {
          "id": "g9ydees",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1603574960.0
        }
      ]
    },
    {
      "id": "g9z893b",
      "author": "rosies4posie",
      "body": "I was going to say something similar. I started being extremely blunt and short with people who made comments. People should be made to feel as uncomfortable as they make us feel. We have a medical condition and that’s not something that should be getting casually commented on. Teaching people how to treat you is so difficult but so helpful in daily life.",
      "created_utc": 1603585962.0,
      "score": 6,
      "context": [
        {
          "id": "g9xf6gh",
          "author": "MuskokaJonas",
          "body": "I feel the same way. when I first found out about ARFID I told my mom and she said I was just \"looking for labels\" and that I just needed to not be so sensitive. I've since been to a nutritionist and am working on getting enough nutrients despite my narrow palette. but even now after I explain to my friends that I have ARFID, they still make fun of me for things like not liking any sauces on my meat and cheese tacos. It's super frustrating having to feel like I'm too weird for my friends. It has honestly made me want to stop eating around them.",
          "created_utc": 1603558724.0
        },
        {
          "id": "g9xl4ri",
          "author": "axw3555",
          "body": "The labels thing rings really true for me. Any time I have *anything*, even something as simple as tendonitis, I'm \"looking for labels\".\n\nTBH, I've reached the point where I don't take it anymore. My mum, I just tell her that if she's not going to support me, she's going to shut the hell up until she will. And with people who take the piss despite knowing better, I just start picking at every little quirk of theirs until it annoys them. When they start moaning, I just go \"oh, so it's OK for you to make fun of my ED, but if I take the piss out of you for a BBQ base or not having ice in a soft drink, I've gone too far?\".\n\nAnd in a few cases, it just turns to me going \"oh, shut the fuck up\" when they start. (If they get that far, they're people I suffer being around, not friends, not even acquaintances).\n\nI really wasn't kidding when I said my tolerance for that kind of bullshit was zero these days.",
          "created_utc": 1603561761.0
        }
      ]
    }
  ]
}