{
  "id": "jlu1v2",
  "subreddit": "ARFID",
  "author": "None",
  "created_utc": 1604193600.0,
  "title": "This Disorder is a Curse",
  "selftext": "Some may say that all it is is food issues, but that small issue opens up pandora's box. By not being able to eat most food you open up a world of health and social problems. Your health can be at risk because the foods you eat may not be good for you or even if they are you still may not be getting the nutrients you need. Me for example I literally never eat regular Vegetables and I know that if I don't start trying to make a change, my health will backfire on me. Even worse is the social aspect of this curse, even the people you love may never really understand what it feels like to have this disorder, they likely see it as you trying to be a pain.\n\nThrough no fault of our own (or anyone else for that matter) we have to suffer through this horrid condition.",
  "url": "https://www.reddit.com/r/ARFID/comments/jlu1v2/this_disorder_is_a_curse/",
  "score": 95,
  "num_comments": 7,
  "comments": [
    {
      "id": "garfpjm",
      "author": "gotfondue",
      "body": "I'm 32, I've learned that there are going to be some nights that I just decide I'm having pancakes for dinner. You know what, I'm ok with that.",
      "created_utc": 1604202918.0,
      "score": 24,
      "context": []
    },
    {
      "id": "gar4jg8",
      "author": "Biwierdo",
      "body": "Yeah, sometimes I feel as though I make my friends lives harder, because they go out of their way to eat foods that they know the smell doesn’t freak me out",
      "created_utc": 1604194976.0,
      "score": 12,
      "context": []
    },
    {
      "id": "gasw9sm",
      "author": "kwaqiswhack",
      "body": "I don’t often tell people about it because you always get that one, super dense comment about “HA I WISH I HAD THAT, MAYBE I COULD FINALLY LOSE SOME WEIGHT!!” As if being skinny is somehow more important than having a functional and healthy body that will carry you thru life. And then when you try to tell them that being severely underweight leads to extreme malnutrition and an endless cycle of sickness due to a poor immune system, they get all terse.",
      "created_utc": 1604246714.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gasq6gw",
      "author": "markiitka",
      "body": "Agreed.\nI have no love life, im not dating because Im just overthinking and scared that guys will think im super weird. \nSome may say its just food but food is actually such important part of socializing. \nAlso the health. Sometimes i dont eat all day because of work and I try to catch up in the evening and it some shitty food and I can already see the dufference in my hair for example.\n\nIt really is a curse.",
      "created_utc": 1604243264.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gat7acp",
      "author": "Lauramae0892",
      "body": "God I feel this. And Idk about you all but it’s also developed into a really severe ocd for things that aren’t even food. I’m scared of medicine, most lotions, skin care products, shampoos, laundry detergent, etc etc. anything I could have an allergic reaction to, no matter how irrational and unreasonable the fear is.",
      "created_utc": 1604252636.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gb3bs7j",
      "author": "Lethalogicax",
      "body": "This. So much this. People just dont seem to understand that its a curse. Its not that Im a picky eater because I want to be a bitch, quite the opposite in fact. I would love to enjoy all these delicious looking dishes but that doesnt stop the fact that they will cause me horrible nausea to even think about puting them in my mouth.",
      "created_utc": 1604472154.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gasx7kq",
      "author": "c-shell4u",
      "body": "If they are your friends they are probably happy to accommodate to your needs, and they can have other food when you are not around. If you had food allergies would you think about it the same way?",
      "created_utc": 1604247233.0,
      "score": 1,
      "context": [
        {
          "id": "gar4jg8",
          "author": "Biwierdo",
          "body": "Yeah, sometimes I feel as though I make my friends lives harder, because they go out of their way to eat foods that they know the smell doesn’t freak me out",
          "created_utc": 1604194976.0
        }
      ]
    }
  ]
}