{
  "id": "jp9s2x",
  "subreddit": "ARFID",
  "author": "c21h30o2--",
  "created_utc": 1604685141.0,
  "title": "Because we don’t hear it enough, I’m proud of you guys",
  "selftext": "Having an eating disorder that so few people understand is difficult and lots of us get shamed for it. So from somebody who gets how tough this is, I am so proud of you, yes you in particular, for living with this. \n\nIf you tried a different brand than usual, even if you hated it, I’m proud of you. \n\nIf you are a fry with a piece of skin on it, I’m proud of you. \n\nIf you mixed two foods together for the first time, I’m proud of you. \n\nIf you are food somebody else prepared, I’m proud of you. \n\nIf you ate at all today, I’m proud of you.",
  "url": "https://www.reddit.com/r/ARFID/comments/jp9s2x/because_we_dont_hear_it_enough_im_proud_of_you/",
  "score": 151,
  "num_comments": 5,
  "comments": [
    {
      "id": "gbdp2ob",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1604692710.0,
      "score": 12,
      "context": []
    },
    {
      "id": "gbds967",
      "author": "whaty0ueat",
      "body": "U got me crying in the club (my bed)",
      "created_utc": 1604694239.0,
      "score": 9,
      "context": []
    },
    {
      "id": "gbdycc5",
      "author": "magicalstella",
      "body": "Life stress got me dropping safe foods like crazy after 3 years in recovery so i really needed this today. Thanks brother.",
      "created_utc": 1604697064.0,
      "score": 7,
      "context": []
    },
    {
      "id": "gbdual8",
      "author": "Betwig",
      "body": "You are lovely, thank you ❤️ I am proud of you too x",
      "created_utc": 1604695216.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gberxpy",
      "author": "invisible-bug",
      "body": "Thank you!\n\n\nI've been trying to branch out on different brands. It's not been terribly successful, but I find that I usually have to go for a round 2 after a couple of years to gauge whether my first impression was wrong. 😩",
      "created_utc": 1604712800.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gbehphk",
      "author": "None",
      "body": "> If you are a fry with a piece of skin on it, I’m proud of you. \n\nWith as many fries as I eat, I might resemble this one.\n\nGetting on topic, my main issue is with texture and I hate touching raw meat. Frozen raw meat is ok since it's solid, but not unfrozen or uncooked. I usually buy pre-formed beef patties and put them right in the freezer but today for the second time in a couple of weeks I bought a regular package of ground beef at the store and broke it up into smaller patties by hand to put in the freezer. I certainly didn't enjoy it, but I survived.",
      "created_utc": 1604707022.0,
      "score": 5,
      "context": [
        {
          "id": "gbdp2ob",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1604692710.0
        }
      ]
    }
  ]
}