{
  "id": "jrgdkj",
  "subreddit": "ARFID",
  "author": "None",
  "created_utc": 1604991705.0,
  "title": "There's a lot of acceptance online for mental health disorders these days.. but ARFID is a notable exception",
  "selftext": "I've had dozens of situations where my eating disorder becomes relevant in small comment discussions on front page subreddits. I like to share my ARFID experience because I only found out what ARFID was from someone else sharing their story. Before that all I had was a selective eating disorder diagnosis that didn't get me any substantial help.\n\n>\n\nBut every time I've explained myself, I get attacked. I've never once seen people sympathize and talk about the struggles of eating disorders, it's always \"yeah but it's not that you CAN'T eat things...\" \"It sounds like you're playing games with people\" \"it's all in your head\"\n\n>\n\nIf I could go to restaurants with friends I'd give anything to do that. But I physically can't make myself swallow a lot of uncomfortable foods because I have an eating disorder. \n\n>\n\nIt's so upsetting that some people can't even tolerate that someone else is eating something different than them...",
  "url": "https://www.reddit.com/r/ARFID/comments/jrgdkj/theres_a_lot_of_acceptance_online_for_mental/",
  "score": 196,
  "num_comments": 42,
  "comments": [
    {
      "id": "gbtgc6j",
      "author": "AshOfTheLilacs",
      "body": "It literally is that we can't eat things lol. It's hilarious how they pretend differently.",
      "created_utc": 1605007219.0,
      "score": 58,
      "context": []
    },
    {
      "id": "gbt8vlo",
      "author": "mrskel1",
      "body": "It’s definitely something that is really misunderstood and I hope that changes. I’m currently trying to get my 5 year old daughter help for ARFID and it has been a tough road. Getting he doctors to take it seriously has been a frustrating experience. I am trying to learn as much as I can though so I can be there to support her however possible.",
      "created_utc": 1604998878.0,
      "score": 22,
      "context": []
    },
    {
      "id": "gbvfrdm",
      "author": "im_a_duck__quack",
      "body": "And the only times that people talk about arfid on social media is to make fun of us and go on a rant about how much they hate \"picky eaters\". I hate it here.",
      "created_utc": 1605045584.0,
      "score": 13,
      "context": []
    },
    {
      "id": "gbuswkc",
      "author": "AchooCashew",
      "body": "I've had good luck explaining it to people in terms of inedible objects. Instead of saying \"unsafe foods are like your super most unpreferred food you can imagine,\" I say \"it's like I'm looking at a plate of crayons (or chalk, modeling clay, raked leaves, something not outlandishly gross-sounding), it's just not edible and I can't get my brain to accept it as food.\"",
      "created_utc": 1605034586.0,
      "score": 11,
      "context": []
    },
    {
      "id": "gbvkbac",
      "author": "bobainwonderland",
      "body": "My biggest thing - when someone tells me \"its all in your head\" - Effing Duh. I know this. Its a mental health disorder. MENTAL = BRAIN. You wouldn't tell someone with Depression that its all in their head and not credible, so why tell someone with ARFID. It makes me sad that they can't see the difference or the insensitivity of that comment.",
      "created_utc": 1605047935.0,
      "score": 9,
      "context": []
    },
    {
      "id": "gbvmmxs",
      "author": "riderofrohanne",
      "body": "I see a lot of newspaper articles with click bait headlines that make this kind of attitude a lot worse - recently ‘Girl, 20, has eaten over 50,000 CHICKEN NUGGETS in 15 years’. She had ARFID but the comments section became a place to ridicule her parents for ‘allowing’ her to do this and the normal ‘if she was hungry she’d eat anything’. Ugh.",
      "created_utc": 1605049140.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gbuis19",
      "author": "smokingfromacan",
      "body": "People are unusually in denial over things you don’t understand. Hopefully soon people will realize its valid and a real struggle.",
      "created_utc": 1605029921.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gbw7uw8",
      "author": "sayhellotojenn",
      "body": "I agree with you. Even in casual mentioning it in passing in discussion on my anxiety/depression or in regards to my weight loss, I get a lot of shit for it. A lot of odd attacks in questioning the legitimacy of my ARFID, asking about being diagnosed versus self-diagnosis (which tbh is fair) but even in confirming I’ve had an evaluation and have spoken with multiple health practitioners (primary care doctors, therapists, etc.), people get relentless in then asking about what tests I’ve had done, results, nutritional deficiencies...? Like, bro, I appreciate your dedication to people not self-diagnosing mental health issues on the internet, but frankly it’s none of your business and I don’t have to bare the results of my bloodwork to make an internet stranger.\n\nIn the same vein, it has always BAFFLED me how personally some take it that you don’t eat certain things. I have people react to my not eating pizza like I just punched them in the face. The guy I’m seeing made wings from scratch when I was staying over on Friday and I felt terrible because he was so excited to cook for me but... I don’t do wings and I especially don’t do sauce. He kept needling me about it as I just told him I had a big lunch and wasn’t hungry (although this was at like 9 or 10 at night) until finally it became obvious I wasn’t going to eat it. \n\nLike just accept that I have issues and I’m working on them, but I’m not going to eat “normally”. Don’t interrogate me on what I do and don’t eat. Don’t judge me for not liking something you think everyone eats.\n\nI feel enough shame. I don’t need anyone else piling it on.",
      "created_utc": 1605060725.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gbugq6z",
      "author": "TemperanceL",
      "body": "Definitely not trying to defend people being assholes here, just trying to see/explain why it's so easily misunderstood/undermined.\n\nI think the thing with ARFID is that's it's a problem that people really don't comprehend as being a problem. I'll take something else for exemple, that even myself can have a hard time really understanding to some degree: anxieity. Like eating, we all get anxious from time to time, it's a natural thing. However for some folks, it can be overwhelming, to the point where it actually become troublesome for their usual lives. That's when some might wonder what's wrong with these people, why can't they just get over stressfull moments like everyone else. And I think that's where the rift is created. It's the same with food. They got over trying new food. A great roomate I had who helped me try new stuff couldn't really get why texture was such a big thing for me, because to her it's barely something she cares for at this point. This rift exists because mental health isn't something you can diagnose the same way you do physical health, with easy to understand measurements, and thus it's easier to dismiss/misunderstand. \n\nNow, anxiety have been talked about a lot, and thus people are starting to accept it's existence. ARFID is very new however. Just like most of us here, I grew up without even knowing a diagnosis like this existed. We likely had never encountered other people like us, and were thus quickly assumed to just be really picky, like some people can be.\n\nNonetheless, I do think it's still important to mention it when relevant. I discovered the term existed because someone mentionned it somewhere in a subreddit, and that was definitely a pretty big \"oh wow this isn't just a problem I experience alone!\" moment, and it's great to know you're not the only one with that problem. So I know it's important we share it.\n\nThough yeah, I know it's always hard. In real life doctors,  nutritionnists  ,and psychologists usually don't know what you're talking about (especially if english isn't your primary language, with the diagnosis being so recent from the DSM). But with time, hopefully people will learn about it's existence, and while you can't expect everyone to adapt to you (same with any mental health), I hope we get to a point where people can accept it more.",
      "created_utc": 1605028971.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gbtjnyr",
      "author": "axw3555",
      "body": "Remember one thing - Reddit isn't the real world. Hell, most of the time, when you're browsing Reddit, it isn't even representative of itself, because the dynamic of each subreddit can be so different to any other sub.\n\nGenerally, the more specialist the subreddit, the less chance there is of running into an asshole (probably because in a sub with 30k members, 10% actively posting, consistent asshole behaviour is more likely to stand out than it is in a 1.5m member sub with 10% posting).\n\nSo if you goto ARFID, FairyTail (an anime), StormlightArchive, etc, you'll get a lot more tolerance than you will in AskReddit or News (and that goes tenfold for StormlightArchive and the other Brandon Sanderson subs - the closest I've seen to asshole behaviour there in literal years of browsing StormlightArchive, Cosmere, Mistborn, are things like disagreements over the interpretation of in-universe abilities, and those never go beyond disagreement).\n\nThen there's the simple anonymity factor. I'd place good money that virtually none of these jackasses would be willing to say any of it to your face. But behind the anonymity of a free username they can dump whenever they want, they'll say anything they feel like.\n\nIn real life, I've only met two or three people who weren't understanding about it, and they were tangental enough to my life that I didn't even notice an effect from cutting them out.",
      "created_utc": 1605010422.0,
      "score": 9,
      "context": []
    },
    {
      "id": "gbwu23j",
      "author": "2anonym00se1",
      "body": "I agree with everything you're saying except that there is definitely not widespread acceptance on Reddit for other mental illnesses. People are coming around to the idea of depression and anxiety being legitimate things but the stigma surrounding diagnoses like bipolar, schizophrenia, borderline, etc. is really horrible.",
      "created_utc": 1605075086.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gbwv0mg",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1605075908.0,
      "score": 2,
      "context": []
    },
    {
      "id": "geeac22",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1606932964.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gbtpb5e",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1605014747.0,
      "score": 20,
      "context": [
        {
          "id": "gbtgc6j",
          "author": "AshOfTheLilacs",
          "body": "It literally is that we can't eat things lol. It's hilarious how they pretend differently.",
          "created_utc": 1605007219.0
        }
      ]
    },
    {
      "id": "gbt9tda",
      "author": "None",
      "body": "I've found doctors to be incredibly misunderstanding. The one food specialist I went to left me traumatized because she just forced me to try scary foods and I'd repeatedly throw up on her carpet.\n\n>\n\nIt doesn't help that a lot of food doctors don't work with minors and the ones who do think they'll just grow out of it.",
      "created_utc": 1604999935.0,
      "score": 15,
      "context": [
        {
          "id": "gbt8vlo",
          "author": "mrskel1",
          "body": "It’s definitely something that is really misunderstood and I hope that changes. I’m currently trying to get my 5 year old daughter help for ARFID and it has been a tough road. Getting he doctors to take it seriously has been a frustrating experience. I am trying to learn as much as I can though so I can be there to support her however possible.",
          "created_utc": 1604998878.0
        }
      ]
    },
    {
      "id": "gbuqghg",
      "author": "MrVonic",
      "body": "My mom struggled like hell with doctors with me when I was younger cuz of my ARFID. Not a single doctor would believe her or anything, they all said I'd grow out of it. Well I'm 26 now and barely eat much more than I did when I was 5. One thing my mom would've done differently with me she said was try to get the doctors to see me eat something that isn't safe so they could see how much of a struggle it is for people like us to eat. \n\nOne little bit of advice I'd give is to never ever take food away or do anything to make eating worse. And no comments from family members either, those are the worst",
      "created_utc": 1605033468.0,
      "score": 11,
      "context": [
        {
          "id": "gbt8vlo",
          "author": "mrskel1",
          "body": "It’s definitely something that is really misunderstood and I hope that changes. I’m currently trying to get my 5 year old daughter help for ARFID and it has been a tough road. Getting he doctors to take it seriously has been a frustrating experience. I am trying to learn as much as I can though so I can be there to support her however possible.",
          "created_utc": 1604998878.0
        }
      ]
    },
    {
      "id": "gbvk766",
      "author": "None",
      "body": "It's so weird that it upsets people when you can't eat a food. Nobody gets mad at people who can't kill spiders.",
      "created_utc": 1605047876.0,
      "score": 6,
      "context": [
        {
          "id": "gbvfrdm",
          "author": "im_a_duck__quack",
          "body": "And the only times that people talk about arfid on social media is to make fun of us and go on a rant about how much they hate \"picky eaters\". I hate it here.",
          "created_utc": 1605045584.0
        }
      ]
    },
    {
      "id": "gedr33i",
      "author": "3hourbaths",
      "body": "They also don't get mad at typical eaters for not eating scorpion, fish eyes, offal, brains, locust, grasshopper, worms, grass and so on. *Everyone* is a picky eater, just most people line up with their social cohort a little better. \n\nAnd when people go on about hating picky eaters, well sure, hate the illness, you can't hate it as much as I hate it! But don't hate the person. Makes as much sense as saying \"oh I hate anorexics and all their not eating, it's so annoying\"",
      "created_utc": 1606925260.0,
      "score": 3,
      "context": [
        {
          "id": "gbvfrdm",
          "author": "im_a_duck__quack",
          "body": "And the only times that people talk about arfid on social media is to make fun of us and go on a rant about how much they hate \"picky eaters\". I hate it here.",
          "created_utc": 1605045584.0
        }
      ]
    },
    {
      "id": "gbwfev0",
      "author": "JoChiCat",
      "body": "Exactly. Like... I could theoretically eat chalk, or crayons, or paper, or a strip of leather, or dirt from my garden, but why would I?",
      "created_utc": 1605065033.0,
      "score": 5,
      "context": [
        {
          "id": "gbuswkc",
          "author": "AchooCashew",
          "body": "I've had good luck explaining it to people in terms of inedible objects. Instead of saying \"unsafe foods are like your super most unpreferred food you can imagine,\" I say \"it's like I'm looking at a plate of crayons (or chalk, modeling clay, raked leaves, something not outlandishly gross-sounding), it's just not edible and I can't get my brain to accept it as food.\"",
          "created_utc": 1605034586.0
        }
      ]
    },
    {
      "id": "gedrhi7",
      "author": "3hourbaths",
      "body": "I can eat a number of inedible things way more easily than food! I've drunk pair, eaten paper and eaten chalk in my life, but don't give me carrots and expect me not to vom on you.",
      "created_utc": 1606925428.0,
      "score": 1,
      "context": [
        {
          "id": "gbuswkc",
          "author": "AchooCashew",
          "body": "I've had good luck explaining it to people in terms of inedible objects. Instead of saying \"unsafe foods are like your super most unpreferred food you can imagine,\" I say \"it's like I'm looking at a plate of crayons (or chalk, modeling clay, raked leaves, something not outlandishly gross-sounding), it's just not edible and I can't get my brain to accept it as food.\"",
          "created_utc": 1605034586.0
        }
      ]
    },
    {
      "id": "gbwn6f9",
      "author": "None",
      "body": "You wouldn't tell someone with asthma \"it's all in your lungs, just control yourself\"",
      "created_utc": 1605069865.0,
      "score": 4,
      "context": [
        {
          "id": "gbvkbac",
          "author": "bobainwonderland",
          "body": "My biggest thing - when someone tells me \"its all in your head\" - Effing Duh. I know this. Its a mental health disorder. MENTAL = BRAIN. You wouldn't tell someone with Depression that its all in their head and not credible, so why tell someone with ARFID. It makes me sad that they can't see the difference or the insensitivity of that comment.",
          "created_utc": 1605047935.0
        }
      ]
    },
    {
      "id": "gbwn0kn",
      "author": "None",
      "body": "Yeah, my dad used to tell me hOrRoR stories about 40 year old men who go to the grocery store and buy chicken nuggets and how you DON'T wanna be that guy. Made it sound worse than being an addict or something.\n\n>\n\nHe's a lot different now. I think he's done some soul searching the last few years. He tells me he thinks he may have dealt with what I have when he was younger.\n\n>\n\nIt's crazy how just experiencing things and empathizing with people can chalnge someone's views",
      "created_utc": 1605069753.0,
      "score": 3,
      "context": [
        {
          "id": "gbvmmxs",
          "author": "riderofrohanne",
          "body": "I see a lot of newspaper articles with click bait headlines that make this kind of attitude a lot worse - recently ‘Girl, 20, has eaten over 50,000 CHICKEN NUGGETS in 15 years’. She had ARFID but the comments section became a place to ridicule her parents for ‘allowing’ her to do this and the normal ‘if she was hungry she’d eat anything’. Ugh.",
          "created_utc": 1605049140.0
        }
      ]
    },
    {
      "id": "gbwmtbk",
      "author": "None",
      "body": "Hey, I've actually found ARFID to be a perk when it comes to dating. While it can be frustrating when you have to cut off someone you like because they can't tolerate their disorder, don't think of it as \"dammit, my disorder ruined my chance!\" Think of it as, \"phew, my disorder just saved me months of my time\" because if they can't tolerate you *eating* something different without shaming you, that's only gonna be the tip of the iceberg.",
      "created_utc": 1605069618.0,
      "score": 5,
      "context": [
        {
          "id": "gbw7uw8",
          "author": "sayhellotojenn",
          "body": "I agree with you. Even in casual mentioning it in passing in discussion on my anxiety/depression or in regards to my weight loss, I get a lot of shit for it. A lot of odd attacks in questioning the legitimacy of my ARFID, asking about being diagnosed versus self-diagnosis (which tbh is fair) but even in confirming I’ve had an evaluation and have spoken with multiple health practitioners (primary care doctors, therapists, etc.), people get relentless in then asking about what tests I’ve had done, results, nutritional deficiencies...? Like, bro, I appreciate your dedication to people not self-diagnosing mental health issues on the internet, but frankly it’s none of your business and I don’t have to bare the results of my bloodwork to make an internet stranger.\n\nIn the same vein, it has always BAFFLED me how personally some take it that you don’t eat certain things. I have people react to my not eating pizza like I just punched them in the face. The guy I’m seeing made wings from scratch when I was staying over on Friday and I felt terrible because he was so excited to cook for me but... I don’t do wings and I especially don’t do sauce. He kept needling me about it as I just told him I had a big lunch and wasn’t hungry (although this was at like 9 or 10 at night) until finally it became obvious I wasn’t going to eat it. \n\nLike just accept that I have issues and I’m working on them, but I’m not going to eat “normally”. Don’t interrogate me on what I do and don’t eat. Don’t judge me for not liking something you think everyone eats.\n\nI feel enough shame. I don’t need anyone else piling it on.",
          "created_utc": 1605060725.0
        }
      ]
    },
    {
      "id": "gbuuyks",
      "author": "None",
      "body": "I do agree with you here. People have been conditioned that picky eating is not something wrong with you, it's a choice. \n\n>\n\nI think it's because of the way we treat picky eating in kids. It's not \"let's help him/her feel safe and comfortable trying this new thing,\" it's \"let's make sure he/she eats everything on her plate so she doesn't become picky later on\"\n\n>\n\nIt gives people this paradoxical idea that trying new foods is the key to breaking out of pickiness. For genuine picky eaters, sure. But for someone with ARFID, that's like telling a person having an asthma attack to just take a deep breath.",
      "created_utc": 1605035538.0,
      "score": 3,
      "context": [
        {
          "id": "gbugq6z",
          "author": "TemperanceL",
          "body": "Definitely not trying to defend people being assholes here, just trying to see/explain why it's so easily misunderstood/undermined.\n\nI think the thing with ARFID is that's it's a problem that people really don't comprehend as being a problem. I'll take something else for exemple, that even myself can have a hard time really understanding to some degree: anxieity. Like eating, we all get anxious from time to time, it's a natural thing. However for some folks, it can be overwhelming, to the point where it actually become troublesome for their usual lives. That's when some might wonder what's wrong with these people, why can't they just get over stressfull moments like everyone else. And I think that's where the rift is created. It's the same with food. They got over trying new food. A great roomate I had who helped me try new stuff couldn't really get why texture was such a big thing for me, because to her it's barely something she cares for at this point. This rift exists because mental health isn't something you can diagnose the same way you do physical health, with easy to understand measurements, and thus it's easier to dismiss/misunderstand. \n\nNow, anxiety have been talked about a lot, and thus people are starting to accept it's existence. ARFID is very new however. Just like most of us here, I grew up without even knowing a diagnosis like this existed. We likely had never encountered other people like us, and were thus quickly assumed to just be really picky, like some people can be.\n\nNonetheless, I do think it's still important to mention it when relevant. I discovered the term existed because someone mentionned it somewhere in a subreddit, and that was definitely a pretty big \"oh wow this isn't just a problem I experience alone!\" moment, and it's great to know you're not the only one with that problem. So I know it's important we share it.\n\nThough yeah, I know it's always hard. In real life doctors,  nutritionnists  ,and psychologists usually don't know what you're talking about (especially if english isn't your primary language, with the diagnosis being so recent from the DSM). But with time, hopefully people will learn about it's existence, and while you can't expect everyone to adapt to you (same with any mental health), I hope we get to a point where people can accept it more.",
          "created_utc": 1605028971.0
        }
      ]
    },
    {
      "id": "gbtof0r",
      "author": "bfaithr",
      "body": "From my experience, Reddit is way more understanding than irl. All the hate I’ve seen about ARFID on here, I’ve experienced worse irl. None of it surprises me. All my family members and most of my friends have been hostile about it. The only friends of mine who haven’t been extremely rude about it had an eating disorder themselves or the topic just never came up.\n\nI’m glad you’ve never dealt with many assholes irl, but they’re definitely out there saying it to our faces.",
      "created_utc": 1605014127.0,
      "score": 13,
      "context": [
        {
          "id": "gbtjnyr",
          "author": "axw3555",
          "body": "Remember one thing - Reddit isn't the real world. Hell, most of the time, when you're browsing Reddit, it isn't even representative of itself, because the dynamic of each subreddit can be so different to any other sub.\n\nGenerally, the more specialist the subreddit, the less chance there is of running into an asshole (probably because in a sub with 30k members, 10% actively posting, consistent asshole behaviour is more likely to stand out than it is in a 1.5m member sub with 10% posting).\n\nSo if you goto ARFID, FairyTail (an anime), StormlightArchive, etc, you'll get a lot more tolerance than you will in AskReddit or News (and that goes tenfold for StormlightArchive and the other Brandon Sanderson subs - the closest I've seen to asshole behaviour there in literal years of browsing StormlightArchive, Cosmere, Mistborn, are things like disagreements over the interpretation of in-universe abilities, and those never go beyond disagreement).\n\nThen there's the simple anonymity factor. I'd place good money that virtually none of these jackasses would be willing to say any of it to your face. But behind the anonymity of a free username they can dump whenever they want, they'll say anything they feel like.\n\nIn real life, I've only met two or three people who weren't understanding about it, and they were tangental enough to my life that I didn't even notice an effect from cutting them out.",
          "created_utc": 1605010422.0
        }
      ]
    },
    {
      "id": "gbvooeg",
      "author": "DifferentIsPossble",
      "body": "Reddit isn't IRL. There's people who take my ED seriously on Reddit.",
      "created_utc": 1605050222.0,
      "score": 3,
      "context": [
        {
          "id": "gbtjnyr",
          "author": "axw3555",
          "body": "Remember one thing - Reddit isn't the real world. Hell, most of the time, when you're browsing Reddit, it isn't even representative of itself, because the dynamic of each subreddit can be so different to any other sub.\n\nGenerally, the more specialist the subreddit, the less chance there is of running into an asshole (probably because in a sub with 30k members, 10% actively posting, consistent asshole behaviour is more likely to stand out than it is in a 1.5m member sub with 10% posting).\n\nSo if you goto ARFID, FairyTail (an anime), StormlightArchive, etc, you'll get a lot more tolerance than you will in AskReddit or News (and that goes tenfold for StormlightArchive and the other Brandon Sanderson subs - the closest I've seen to asshole behaviour there in literal years of browsing StormlightArchive, Cosmere, Mistborn, are things like disagreements over the interpretation of in-universe abilities, and those never go beyond disagreement).\n\nThen there's the simple anonymity factor. I'd place good money that virtually none of these jackasses would be willing to say any of it to your face. But behind the anonymity of a free username they can dump whenever they want, they'll say anything they feel like.\n\nIn real life, I've only met two or three people who weren't understanding about it, and they were tangental enough to my life that I didn't even notice an effect from cutting them out.",
          "created_utc": 1605010422.0
        }
      ]
    },
    {
      "id": "gbx3p84",
      "author": "None",
      "body": "I haven't seen much hostility for schizophrenia, but you're right about bipolar and borderline. I think people often are skeptical of people who claim to have schizophrenia because the way it's described in movies sounds unreal.",
      "created_utc": 1605084262.0,
      "score": 2,
      "context": [
        {
          "id": "gbwu23j",
          "author": "2anonym00se1",
          "body": "I agree with everything you're saying except that there is definitely not widespread acceptance on Reddit for other mental illnesses. People are coming around to the idea of depression and anxiety being legitimate things but the stigma surrounding diagnoses like bipolar, schizophrenia, borderline, etc. is really horrible.",
          "created_utc": 1605075086.0
        }
      ]
    },
    {
      "id": "gbx3mrm",
      "author": "None",
      "body": "Oh I don't think they're wrong at all, I just don't think it helps at all. It's like telling someone with cancer \"it's all in your lymph nodes!\" or someone having an asthma attack that \"it's all in your lungs!\"\n\n>\n\nDUH\n\n>\n\nNow how does that help? What people mean when they say \"it's all in your head\" is \"your problem isn't real\" and that's just blatantly untrue.",
      "created_utc": 1605084187.0,
      "score": 2,
      "context": [
        {
          "id": "gbwv0mg",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1605075908.0
        }
      ]
    },
    {
      "id": "gefrwxv",
      "author": "None",
      "body": "Oof \n\n>\n\nARFID has shown me a lot of why I want to leave my country to be honest. It's sad that we still live in a world where people don't want to be around each other just because they're different.\n\n>\n\nI live in a country where people will tell you to leave if your political views are different. Your eating disorder is a burden that people here don't want, and we vote against healthcare like it's opium. It's taught me that I am 100% unwanted here.\n\n>\n\nWhy would anyone live in a place where anybody is unwanted? That's a hateful place..\n\n>\n\nBut it's sad how much of the world is so quick to reject people.. you can't find places that are truly accepting unless they're really small.",
      "created_utc": 1606956909.0,
      "score": 2,
      "context": [
        {
          "id": "geeac22",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1606932964.0
        }
      ]
    },
    {
      "id": "gbu1rqk",
      "author": "montymm",
      "body": "I always explain it as, imagine the food you hate the most. That’s most foods to us. But people don’t seem to grasp that simple concept. It’s not difficult to understand",
      "created_utc": 1605021865.0,
      "score": 19,
      "context": [
        {
          "id": "gbtgc6j",
          "author": "AshOfTheLilacs",
          "body": "It literally is that we can't eat things lol. It's hilarious how they pretend differently.",
          "created_utc": 1605007219.0
        },
        {
          "id": "gbtpb5e",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1605014747.0
        }
      ]
    },
    {
      "id": "gbtiule",
      "author": "axw3555",
      "body": "I *really* hope you complained to the head of the clinic or licencing board or whatever about that \"specialist\".",
      "created_utc": 1605009684.0,
      "score": 14,
      "context": [
        {
          "id": "gbt8vlo",
          "author": "mrskel1",
          "body": "It’s definitely something that is really misunderstood and I hope that changes. I’m currently trying to get my 5 year old daughter help for ARFID and it has been a tough road. Getting he doctors to take it seriously has been a frustrating experience. I am trying to learn as much as I can though so I can be there to support her however possible.",
          "created_utc": 1604998878.0
        },
        {
          "id": "gbt9tda",
          "author": "None",
          "body": "I've found doctors to be incredibly misunderstanding. The one food specialist I went to left me traumatized because she just forced me to try scary foods and I'd repeatedly throw up on her carpet.\n\n>\n\nIt doesn't help that a lot of food doctors don't work with minors and the ones who do think they'll just grow out of it.",
          "created_utc": 1604999935.0
        }
      ]
    },
    {
      "id": "gbuquq1",
      "author": "mrskel1",
      "body": "Definitely agree. If you check out my post history you can see how we have been trying to deal with things. Any advice is appreciated",
      "created_utc": 1605033647.0,
      "score": 3,
      "context": [
        {
          "id": "gbt8vlo",
          "author": "mrskel1",
          "body": "It’s definitely something that is really misunderstood and I hope that changes. I’m currently trying to get my 5 year old daughter help for ARFID and it has been a tough road. Getting he doctors to take it seriously has been a frustrating experience. I am trying to learn as much as I can though so I can be there to support her however possible.",
          "created_utc": 1604998878.0
        },
        {
          "id": "gbuqghg",
          "author": "MrVonic",
          "body": "My mom struggled like hell with doctors with me when I was younger cuz of my ARFID. Not a single doctor would believe her or anything, they all said I'd grow out of it. Well I'm 26 now and barely eat much more than I did when I was 5. One thing my mom would've done differently with me she said was try to get the doctors to see me eat something that isn't safe so they could see how much of a struggle it is for people like us to eat. \n\nOne little bit of advice I'd give is to never ever take food away or do anything to make eating worse. And no comments from family members either, those are the worst",
          "created_utc": 1605033468.0
        }
      ]
    },
    {
      "id": "gbvkevt",
      "author": "im_a_duck__quack",
      "body": "I haven't seen anyone get mad at vegans either, they always make sure the person is accommodated and that's their own personal choice, I never chose to eat like this.",
      "created_utc": 1605047988.0,
      "score": 5,
      "context": [
        {
          "id": "gbvfrdm",
          "author": "im_a_duck__quack",
          "body": "And the only times that people talk about arfid on social media is to make fun of us and go on a rant about how much they hate \"picky eaters\". I hate it here.",
          "created_utc": 1605045584.0
        },
        {
          "id": "gbvk766",
          "author": "None",
          "body": "It's so weird that it upsets people when you can't eat a food. Nobody gets mad at people who can't kill spiders.",
          "created_utc": 1605047876.0
        }
      ]
    },
    {
      "id": "gbwhmwf",
      "author": "AchooCashew",
      "body": "Right?? We’d just spend the rest of our primary school years being “the kid that eats chalk.” 😂",
      "created_utc": 1605066337.0,
      "score": 2,
      "context": [
        {
          "id": "gbuswkc",
          "author": "AchooCashew",
          "body": "I've had good luck explaining it to people in terms of inedible objects. Instead of saying \"unsafe foods are like your super most unpreferred food you can imagine,\" I say \"it's like I'm looking at a plate of crayons (or chalk, modeling clay, raked leaves, something not outlandishly gross-sounding), it's just not edible and I can't get my brain to accept it as food.\"",
          "created_utc": 1605034586.0
        },
        {
          "id": "gbwfev0",
          "author": "JoChiCat",
          "body": "Exactly. Like... I could theoretically eat chalk, or crayons, or paper, or a strip of leather, or dirt from my garden, but why would I?",
          "created_utc": 1605065033.0
        }
      ]
    },
    {
      "id": "gbx04sq",
      "author": "bobainwonderland",
      "body": "Exactly. It sucks how few mental health professionals and Ed professionals don’t treat and normalize this. It’s not as uncommon as I thought. After 30 years I’ve finally found a large group of people who all completely relate. It’s hot a switch we can turn on and off easily.",
      "created_utc": 1605080625.0,
      "score": 3,
      "context": [
        {
          "id": "gbvkbac",
          "author": "bobainwonderland",
          "body": "My biggest thing - when someone tells me \"its all in your head\" - Effing Duh. I know this. Its a mental health disorder. MENTAL = BRAIN. You wouldn't tell someone with Depression that its all in their head and not credible, so why tell someone with ARFID. It makes me sad that they can't see the difference or the insensitivity of that comment.",
          "created_utc": 1605047935.0
        },
        {
          "id": "gbwn6f9",
          "author": "None",
          "body": "You wouldn't tell someone with asthma \"it's all in your lungs, just control yourself\"",
          "created_utc": 1605069865.0
        }
      ]
    },
    {
      "id": "gbwncp3",
      "author": "sayhellotojenn",
      "body": "This is a very good point! In all fairness, he eventually just set aside a wing and said “I want to make sure this is here for you should you want it” and never mentioned it when it was still there when I left the next day, nor did he say anything when I ate ice cream a couple hours later or when I introduced him to my favorite muffin place that morning and ate a muffin for breakfast. He’s a foodie so I’m nervous, but he also seems pretty kind and patient thus far, so I’m optimistic. Nervously optimistic.",
      "created_utc": 1605069986.0,
      "score": 3,
      "context": [
        {
          "id": "gbw7uw8",
          "author": "sayhellotojenn",
          "body": "I agree with you. Even in casual mentioning it in passing in discussion on my anxiety/depression or in regards to my weight loss, I get a lot of shit for it. A lot of odd attacks in questioning the legitimacy of my ARFID, asking about being diagnosed versus self-diagnosis (which tbh is fair) but even in confirming I’ve had an evaluation and have spoken with multiple health practitioners (primary care doctors, therapists, etc.), people get relentless in then asking about what tests I’ve had done, results, nutritional deficiencies...? Like, bro, I appreciate your dedication to people not self-diagnosing mental health issues on the internet, but frankly it’s none of your business and I don’t have to bare the results of my bloodwork to make an internet stranger.\n\nIn the same vein, it has always BAFFLED me how personally some take it that you don’t eat certain things. I have people react to my not eating pizza like I just punched them in the face. The guy I’m seeing made wings from scratch when I was staying over on Friday and I felt terrible because he was so excited to cook for me but... I don’t do wings and I especially don’t do sauce. He kept needling me about it as I just told him I had a big lunch and wasn’t hungry (although this was at like 9 or 10 at night) until finally it became obvious I wasn’t going to eat it. \n\nLike just accept that I have issues and I’m working on them, but I’m not going to eat “normally”. Don’t interrogate me on what I do and don’t eat. Don’t judge me for not liking something you think everyone eats.\n\nI feel enough shame. I don’t need anyone else piling it on.",
          "created_utc": 1605060725.0
        },
        {
          "id": "gbwmtbk",
          "author": "None",
          "body": "Hey, I've actually found ARFID to be a perk when it comes to dating. While it can be frustrating when you have to cut off someone you like because they can't tolerate their disorder, don't think of it as \"dammit, my disorder ruined my chance!\" Think of it as, \"phew, my disorder just saved me months of my time\" because if they can't tolerate you *eating* something different without shaming you, that's only gonna be the tip of the iceberg.",
          "created_utc": 1605069618.0
        }
      ]
    },
    {
      "id": "gbu48ro",
      "author": "jkjwysa",
      "body": "This has been my experience as well. It's painful the reactions I've gotten. Both of my exgirlfriends used to eat full meals without me, because \"you're just too picky, you don't like anything.\" I'd starve rather than argue, or I'd bring granola bars in my overnight bag. It wasn't until I turned 18 that I started meeting people that were tolerant. \n \n \nNow, my partner goes out of his way to find foods I like and make them. He'll make me try things, but in a way that doesn't come off pushy or judgemental. Just \"hey, put this in your face. one bite to see if you like it, that's it, and if you don't then you never have to eat it again!\" \n \n \nEven still I'll have days where I'm just not mentally prepared enough for new foods, and he gets that. It's really important to have someone that understands and has no judgement. Sometimes he'll look at me like I'm crazy, but that's usually when I do stuff like dip fries in my frosty or pretzels in my nutella. Just typical food banter. It's insanely refreshing.",
      "created_utc": 1605023088.0,
      "score": 6,
      "context": [
        {
          "id": "gbtjnyr",
          "author": "axw3555",
          "body": "Remember one thing - Reddit isn't the real world. Hell, most of the time, when you're browsing Reddit, it isn't even representative of itself, because the dynamic of each subreddit can be so different to any other sub.\n\nGenerally, the more specialist the subreddit, the less chance there is of running into an asshole (probably because in a sub with 30k members, 10% actively posting, consistent asshole behaviour is more likely to stand out than it is in a 1.5m member sub with 10% posting).\n\nSo if you goto ARFID, FairyTail (an anime), StormlightArchive, etc, you'll get a lot more tolerance than you will in AskReddit or News (and that goes tenfold for StormlightArchive and the other Brandon Sanderson subs - the closest I've seen to asshole behaviour there in literal years of browsing StormlightArchive, Cosmere, Mistborn, are things like disagreements over the interpretation of in-universe abilities, and those never go beyond disagreement).\n\nThen there's the simple anonymity factor. I'd place good money that virtually none of these jackasses would be willing to say any of it to your face. But behind the anonymity of a free username they can dump whenever they want, they'll say anything they feel like.\n\nIn real life, I've only met two or three people who weren't understanding about it, and they were tangental enough to my life that I didn't even notice an effect from cutting them out.",
          "created_utc": 1605010422.0
        },
        {
          "id": "gbtof0r",
          "author": "bfaithr",
          "body": "From my experience, Reddit is way more understanding than irl. All the hate I’ve seen about ARFID on here, I’ve experienced worse irl. None of it surprises me. All my family members and most of my friends have been hostile about it. The only friends of mine who haven’t been extremely rude about it had an eating disorder themselves or the topic just never came up.\n\nI’m glad you’ve never dealt with many assholes irl, but they’re definitely out there saying it to our faces.",
          "created_utc": 1605014127.0
        }
      ]
    },
    {
      "id": "gbvw3x8",
      "author": "axw3555",
      "body": "I mean, this kind of proves my point about different parts of Reddit reacting differently.\n\nI’ve literally had a hundred times the dismissive to hostile comments on Reddit compared to real life.\n\nYour experience is the opposite.\n\nSo basically, it’s the take away that there’s always assholes, there’s always good people. It’s just which ones you find.",
      "created_utc": 1605054196.0,
      "score": 1,
      "context": [
        {
          "id": "gbtjnyr",
          "author": "axw3555",
          "body": "Remember one thing - Reddit isn't the real world. Hell, most of the time, when you're browsing Reddit, it isn't even representative of itself, because the dynamic of each subreddit can be so different to any other sub.\n\nGenerally, the more specialist the subreddit, the less chance there is of running into an asshole (probably because in a sub with 30k members, 10% actively posting, consistent asshole behaviour is more likely to stand out than it is in a 1.5m member sub with 10% posting).\n\nSo if you goto ARFID, FairyTail (an anime), StormlightArchive, etc, you'll get a lot more tolerance than you will in AskReddit or News (and that goes tenfold for StormlightArchive and the other Brandon Sanderson subs - the closest I've seen to asshole behaviour there in literal years of browsing StormlightArchive, Cosmere, Mistborn, are things like disagreements over the interpretation of in-universe abilities, and those never go beyond disagreement).\n\nThen there's the simple anonymity factor. I'd place good money that virtually none of these jackasses would be willing to say any of it to your face. But behind the anonymity of a free username they can dump whenever they want, they'll say anything they feel like.\n\nIn real life, I've only met two or three people who weren't understanding about it, and they were tangental enough to my life that I didn't even notice an effect from cutting them out.",
          "created_utc": 1605010422.0
        },
        {
          "id": "gbtof0r",
          "author": "bfaithr",
          "body": "From my experience, Reddit is way more understanding than irl. All the hate I’ve seen about ARFID on here, I’ve experienced worse irl. None of it surprises me. All my family members and most of my friends have been hostile about it. The only friends of mine who haven’t been extremely rude about it had an eating disorder themselves or the topic just never came up.\n\nI’m glad you’ve never dealt with many assholes irl, but they’re definitely out there saying it to our faces.",
          "created_utc": 1605014127.0
        }
      ]
    },
    {
      "id": "geds4gk",
      "author": "3hourbaths",
      "body": "My comeback now is \"do you know how to get it OUT of my head, because I don't, and that's what the therapy is for\". Seems to work!",
      "created_utc": 1606925704.0,
      "score": 2,
      "context": [
        {
          "id": "gbwv0mg",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1605075908.0
        },
        {
          "id": "gbx3mrm",
          "author": "None",
          "body": "Oh I don't think they're wrong at all, I just don't think it helps at all. It's like telling someone with cancer \"it's all in your lymph nodes!\" or someone having an asthma attack that \"it's all in your lungs!\"\n\n>\n\nDUH\n\n>\n\nNow how does that help? What people mean when they say \"it's all in your head\" is \"your problem isn't real\" and that's just blatantly untrue.",
          "created_utc": 1605084187.0
        }
      ]
    },
    {
      "id": "gbulqfo",
      "author": "ClearlyBlasphemi",
      "body": "It's because they still could eat their chicken liver or brussel sprouts or whatever, they just have to plug their noses. They figure we can too.\n\nI describe it as: imagine you're at a dinner party and you're served rat poison on a plate. Your first instinct is to get away from it, it's strictly not food, but everyone else is scarfing it down. They even start looking at you weird. Now you have social pressure telling you it's fine, but you'll never be able to convince your own body it's safe. Anyone would start to get anxious and panic a little.\n\nDramatic, sure, but it's exhausting when it's downplayed so much.",
      "created_utc": 1605031280.0,
      "score": 26,
      "context": [
        {
          "id": "gbtgc6j",
          "author": "AshOfTheLilacs",
          "body": "It literally is that we can't eat things lol. It's hilarious how they pretend differently.",
          "created_utc": 1605007219.0
        },
        {
          "id": "gbtpb5e",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1605014747.0
        },
        {
          "id": "gbu1rqk",
          "author": "montymm",
          "body": "I always explain it as, imagine the food you hate the most. That’s most foods to us. But people don’t seem to grasp that simple concept. It’s not difficult to understand",
          "created_utc": 1605021865.0
        }
      ]
    },
    {
      "id": "gbwoo3n",
      "author": "None",
      "body": "Oh that's awesome!! I think for some people it's just a bit odd but they can't help mentioning it at first. My girlfriend's parents have both been like that, but they're getting better over time.\n\n>\n\nSuper happy to hear about the ice cream thing!! I never know if it's safe to go for ice cream with everyone else when I wasn't able to eat dinner with them, but to be honest I think that's just a scar we carry from childhood.",
      "created_utc": 1605070903.0,
      "score": 3,
      "context": [
        {
          "id": "gbw7uw8",
          "author": "sayhellotojenn",
          "body": "I agree with you. Even in casual mentioning it in passing in discussion on my anxiety/depression or in regards to my weight loss, I get a lot of shit for it. A lot of odd attacks in questioning the legitimacy of my ARFID, asking about being diagnosed versus self-diagnosis (which tbh is fair) but even in confirming I’ve had an evaluation and have spoken with multiple health practitioners (primary care doctors, therapists, etc.), people get relentless in then asking about what tests I’ve had done, results, nutritional deficiencies...? Like, bro, I appreciate your dedication to people not self-diagnosing mental health issues on the internet, but frankly it’s none of your business and I don’t have to bare the results of my bloodwork to make an internet stranger.\n\nIn the same vein, it has always BAFFLED me how personally some take it that you don’t eat certain things. I have people react to my not eating pizza like I just punched them in the face. The guy I’m seeing made wings from scratch when I was staying over on Friday and I felt terrible because he was so excited to cook for me but... I don’t do wings and I especially don’t do sauce. He kept needling me about it as I just told him I had a big lunch and wasn’t hungry (although this was at like 9 or 10 at night) until finally it became obvious I wasn’t going to eat it. \n\nLike just accept that I have issues and I’m working on them, but I’m not going to eat “normally”. Don’t interrogate me on what I do and don’t eat. Don’t judge me for not liking something you think everyone eats.\n\nI feel enough shame. I don’t need anyone else piling it on.",
          "created_utc": 1605060725.0
        },
        {
          "id": "gbwmtbk",
          "author": "None",
          "body": "Hey, I've actually found ARFID to be a perk when it comes to dating. While it can be frustrating when you have to cut off someone you like because they can't tolerate their disorder, don't think of it as \"dammit, my disorder ruined my chance!\" Think of it as, \"phew, my disorder just saved me months of my time\" because if they can't tolerate you *eating* something different without shaming you, that's only gonna be the tip of the iceberg.",
          "created_utc": 1605069618.0
        },
        {
          "id": "gbwncp3",
          "author": "sayhellotojenn",
          "body": "This is a very good point! In all fairness, he eventually just set aside a wing and said “I want to make sure this is here for you should you want it” and never mentioned it when it was still there when I left the next day, nor did he say anything when I ate ice cream a couple hours later or when I introduced him to my favorite muffin place that morning and ate a muffin for breakfast. He’s a foodie so I’m nervous, but he also seems pretty kind and patient thus far, so I’m optimistic. Nervously optimistic.",
          "created_utc": 1605069986.0
        }
      ]
    },
    {
      "id": "gefuscy",
      "author": "None",
      "body": "In my experience, most of the people who tell me it's all in my head aren't trying to help me. Their answer would be \"that's not my problem, you're attention seeking.\" So I tend to just ignore them, walk away if I must.",
      "created_utc": 1606958470.0,
      "score": 1,
      "context": [
        {
          "id": "gbwv0mg",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1605075908.0
        },
        {
          "id": "gbx3mrm",
          "author": "None",
          "body": "Oh I don't think they're wrong at all, I just don't think it helps at all. It's like telling someone with cancer \"it's all in your lymph nodes!\" or someone having an asthma attack that \"it's all in your lungs!\"\n\n>\n\nDUH\n\n>\n\nNow how does that help? What people mean when they say \"it's all in your head\" is \"your problem isn't real\" and that's just blatantly untrue.",
          "created_utc": 1605084187.0
        },
        {
          "id": "geds4gk",
          "author": "3hourbaths",
          "body": "My comeback now is \"do you know how to get it OUT of my head, because I don't, and that's what the therapy is for\". Seems to work!",
          "created_utc": 1606925704.0
        }
      ]
    },
    {
      "id": "gbwpbwp",
      "author": "sayhellotojenn",
      "body": "Yeah the whole “you can’t have dessert, you didn’t eat your dinner” wound runs deep. Honestly we were both very stoned at that point, otherwise I wouldn’t have even thought to talk dessert after not eating the wings but he had mentioned it earlier in the night and I fixated lol.",
      "created_utc": 1605071377.0,
      "score": 3,
      "context": [
        {
          "id": "gbw7uw8",
          "author": "sayhellotojenn",
          "body": "I agree with you. Even in casual mentioning it in passing in discussion on my anxiety/depression or in regards to my weight loss, I get a lot of shit for it. A lot of odd attacks in questioning the legitimacy of my ARFID, asking about being diagnosed versus self-diagnosis (which tbh is fair) but even in confirming I’ve had an evaluation and have spoken with multiple health practitioners (primary care doctors, therapists, etc.), people get relentless in then asking about what tests I’ve had done, results, nutritional deficiencies...? Like, bro, I appreciate your dedication to people not self-diagnosing mental health issues on the internet, but frankly it’s none of your business and I don’t have to bare the results of my bloodwork to make an internet stranger.\n\nIn the same vein, it has always BAFFLED me how personally some take it that you don’t eat certain things. I have people react to my not eating pizza like I just punched them in the face. The guy I’m seeing made wings from scratch when I was staying over on Friday and I felt terrible because he was so excited to cook for me but... I don’t do wings and I especially don’t do sauce. He kept needling me about it as I just told him I had a big lunch and wasn’t hungry (although this was at like 9 or 10 at night) until finally it became obvious I wasn’t going to eat it. \n\nLike just accept that I have issues and I’m working on them, but I’m not going to eat “normally”. Don’t interrogate me on what I do and don’t eat. Don’t judge me for not liking something you think everyone eats.\n\nI feel enough shame. I don’t need anyone else piling it on.",
          "created_utc": 1605060725.0
        },
        {
          "id": "gbwmtbk",
          "author": "None",
          "body": "Hey, I've actually found ARFID to be a perk when it comes to dating. While it can be frustrating when you have to cut off someone you like because they can't tolerate their disorder, don't think of it as \"dammit, my disorder ruined my chance!\" Think of it as, \"phew, my disorder just saved me months of my time\" because if they can't tolerate you *eating* something different without shaming you, that's only gonna be the tip of the iceberg.",
          "created_utc": 1605069618.0
        },
        {
          "id": "gbwncp3",
          "author": "sayhellotojenn",
          "body": "This is a very good point! In all fairness, he eventually just set aside a wing and said “I want to make sure this is here for you should you want it” and never mentioned it when it was still there when I left the next day, nor did he say anything when I ate ice cream a couple hours later or when I introduced him to my favorite muffin place that morning and ate a muffin for breakfast. He’s a foodie so I’m nervous, but he also seems pretty kind and patient thus far, so I’m optimistic. Nervously optimistic.",
          "created_utc": 1605069986.0
        },
        {
          "id": "gbwoo3n",
          "author": "None",
          "body": "Oh that's awesome!! I think for some people it's just a bit odd but they can't help mentioning it at first. My girlfriend's parents have both been like that, but they're getting better over time.\n\n>\n\nSuper happy to hear about the ice cream thing!! I never know if it's safe to go for ice cream with everyone else when I wasn't able to eat dinner with them, but to be honest I think that's just a scar we carry from childhood.",
          "created_utc": 1605070903.0
        }
      ]
    },
    {
      "id": "gbx3rv5",
      "author": "None",
      "body": "To be completely fair wings aren't that healthy either xD\n\n>\n\nI look at all foods for what positives they give. I'm generally healthy, I don't really have to watch for things like sugars too closely, as long as I get some of the good nutrients. For me, ice cream can be justified as calcium for the day sometimes.",
      "created_utc": 1605084342.0,
      "score": 2,
      "context": [
        {
          "id": "gbw7uw8",
          "author": "sayhellotojenn",
          "body": "I agree with you. Even in casual mentioning it in passing in discussion on my anxiety/depression or in regards to my weight loss, I get a lot of shit for it. A lot of odd attacks in questioning the legitimacy of my ARFID, asking about being diagnosed versus self-diagnosis (which tbh is fair) but even in confirming I’ve had an evaluation and have spoken with multiple health practitioners (primary care doctors, therapists, etc.), people get relentless in then asking about what tests I’ve had done, results, nutritional deficiencies...? Like, bro, I appreciate your dedication to people not self-diagnosing mental health issues on the internet, but frankly it’s none of your business and I don’t have to bare the results of my bloodwork to make an internet stranger.\n\nIn the same vein, it has always BAFFLED me how personally some take it that you don’t eat certain things. I have people react to my not eating pizza like I just punched them in the face. The guy I’m seeing made wings from scratch when I was staying over on Friday and I felt terrible because he was so excited to cook for me but... I don’t do wings and I especially don’t do sauce. He kept needling me about it as I just told him I had a big lunch and wasn’t hungry (although this was at like 9 or 10 at night) until finally it became obvious I wasn’t going to eat it. \n\nLike just accept that I have issues and I’m working on them, but I’m not going to eat “normally”. Don’t interrogate me on what I do and don’t eat. Don’t judge me for not liking something you think everyone eats.\n\nI feel enough shame. I don’t need anyone else piling it on.",
          "created_utc": 1605060725.0
        },
        {
          "id": "gbwmtbk",
          "author": "None",
          "body": "Hey, I've actually found ARFID to be a perk when it comes to dating. While it can be frustrating when you have to cut off someone you like because they can't tolerate their disorder, don't think of it as \"dammit, my disorder ruined my chance!\" Think of it as, \"phew, my disorder just saved me months of my time\" because if they can't tolerate you *eating* something different without shaming you, that's only gonna be the tip of the iceberg.",
          "created_utc": 1605069618.0
        },
        {
          "id": "gbwncp3",
          "author": "sayhellotojenn",
          "body": "This is a very good point! In all fairness, he eventually just set aside a wing and said “I want to make sure this is here for you should you want it” and never mentioned it when it was still there when I left the next day, nor did he say anything when I ate ice cream a couple hours later or when I introduced him to my favorite muffin place that morning and ate a muffin for breakfast. He’s a foodie so I’m nervous, but he also seems pretty kind and patient thus far, so I’m optimistic. Nervously optimistic.",
          "created_utc": 1605069986.0
        },
        {
          "id": "gbwoo3n",
          "author": "None",
          "body": "Oh that's awesome!! I think for some people it's just a bit odd but they can't help mentioning it at first. My girlfriend's parents have both been like that, but they're getting better over time.\n\n>\n\nSuper happy to hear about the ice cream thing!! I never know if it's safe to go for ice cream with everyone else when I wasn't able to eat dinner with them, but to be honest I think that's just a scar we carry from childhood.",
          "created_utc": 1605070903.0
        },
        {
          "id": "gbwpbwp",
          "author": "sayhellotojenn",
          "body": "Yeah the whole “you can’t have dessert, you didn’t eat your dinner” wound runs deep. Honestly we were both very stoned at that point, otherwise I wouldn’t have even thought to talk dessert after not eating the wings but he had mentioned it earlier in the night and I fixated lol.",
          "created_utc": 1605071377.0
        }
      ]
    }
  ]
}