{
  "id": "k6ym9z",
  "subreddit": "ARFID",
  "author": "beepis5",
  "created_utc": 1607132916.0,
  "title": "Never eaten a vegetable; just ate a Brussels sprout and didn’t hate it!",
  "selftext": "I’ve had a very limited set of safe foods for pretty much all of my life (white rice, pasta, potatoes, cheese, beef, chicken, pork... that’s about it). I’ve made some progress here and there. In my early 20s I ate fish for the first time and now I eat it regularly. This year I tried sushi which I did not enjoy and decided cold, raw fish was not for me (but I found a tempura-fried roll I like!). \n\nOne thing I’ve always struggled with is vegetables. Literally never (consciously) eaten a vegetable in my life, except potatoes if those count. I get hung up on the idea that they’ll taste bitter and have weird textures. For the past couple years though, I’ve seen Brussels sprouts served several times where they look/smell really good and some part of me was curious to try them, but I could never work up the courage to try them since it was always in a social setting. \n\nToday at the grocery store, I decided I’d actually try them. I bought a bag, figured  if I didn’t like them then my boyfriend would eat them. I got home and took 1 (one) single sprout, cut it in half, drizzled the halves with olive oil, sprinkled them with salt, pepper, cayenne, and chili flakes and roasted them. Felt pretty goofy roasting a single sprout but I didn’t want to waste. I took them out a few minutes early because I wanted to try them while I was alone and the bf would be home any minute. But I ate them and... I didn’t hate them! Texture was definitely weird but I think I could see myself eating more if I continue masking them with other things. Definitely think this is a success. I told my mom and she was proud of me :)",
  "url": "https://www.reddit.com/r/ARFID/comments/k6ym9z/never_eaten_a_vegetable_just_ate_a_brussels/",
  "score": 88,
  "num_comments": 13,
  "comments": [
    {
      "id": "genrzwc",
      "author": "standard_candles",
      "body": "Roasting them is awesome, they are great with parmesan cheese!",
      "created_utc": 1607134005.0,
      "score": 8,
      "context": []
    },
    {
      "id": "genz6a7",
      "author": "kwaqiswhack",
      "body": "LOL I’m dying at roasting exactly one sprout !! I love it. Congratulations for trying something!! Brussels are so good! The smaller, the tastier (in my and my bfs opinion). We like them with bacon and Parmesan cheese! I’ve also had them with - hear me out - pomegranate seeds. They go very well together but I’m aware of my audience haha so I don’t expect you to try it rn but maybe someday. \n\nThat being said, I ate a bad sprout like 6 months ago and haven’t touched them since. I know I’ll come back around because this is one of my creep cycles with food, but.. yeah. Maybe this post will inspire me to get back into them. \n\nROASTING OR CHAR GRILLING IS THE ONLY WAY TO PREPARE BRUSSELS HANDS DOWN",
      "created_utc": 1607138480.0,
      "score": 6,
      "context": []
    },
    {
      "id": "geovypt",
      "author": "JCXIII-R",
      "body": "Damn bro, starting with brussel sprouts is hardcore lol! A tip for learning to eat veg: try boiling shit with a bouillon cube instead of straight water, instant better taste right out of the gate.",
      "created_utc": 1607167613.0,
      "score": 7,
      "context": []
    },
    {
      "id": "geo4l6o",
      "author": "antant26",
      "body": "Way to go! I still don't like brussel sprouts so you're ahead of my game!",
      "created_utc": 1607142003.0,
      "score": 3,
      "context": []
    },
    {
      "id": "geo4uk0",
      "author": "FiguringItOut--",
      "body": "That’s great! Lol Brussel sprouts are one of only a few veggies I hate. I’m glad that wasn’t your experience :)",
      "created_utc": 1607142178.0,
      "score": 2,
      "context": []
    },
    {
      "id": "geoudy8",
      "author": "None",
      "body": "Way to go! \nI'm similar with vegetables, I've only ever tried carrots and broccoli because the thought of putting them in my mouth fills me with dread. \nCarrots and broccoli are both on my \"safe but don't like\" list so I still basically never eat them. \nI just turned 30 and I want 2021 to be the year of trying new things! Not just food and this fills me with hope.",
      "created_utc": 1607165856.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gepo8mk",
      "author": "None",
      "body": "Love this. Sprouts have a weird reputation, there’s that old trope that nobody likes sprouts. But maybe when cooked properly/in a way that I’d like they might not be so bad. Something to ponder on anyway. Congrats on your new vegetable!",
      "created_utc": 1607187696.0,
      "score": 2,
      "context": []
    },
    {
      "id": "geppb2t",
      "author": "feyre_0001",
      "body": "This makes me so incredibly happy. \n\nI’ve done similar things where I’ve bought food to make and try alone to see if I can handle it, and knowing others do it to makes me feel seen and understood. I’m so happy this was a success for you. Congratulations!! 🥰",
      "created_utc": 1607188279.0,
      "score": 2,
      "context": []
    },
    {
      "id": "geq746n",
      "author": "ErisMorrigan",
      "body": "I think it's interesting that most us of struggle with vegetables, the only way I can eat most of them is to put them into a smoothie and drink it lol. But anyway congrats! 🎉",
      "created_utc": 1607197192.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gep0wyt",
      "author": "AMerrickanGirl",
      "body": "I steam vegetables instead of boiling them.",
      "created_utc": 1607172696.0,
      "score": 3,
      "context": [
        {
          "id": "geovypt",
          "author": "JCXIII-R",
          "body": "Damn bro, starting with brussel sprouts is hardcore lol! A tip for learning to eat veg: try boiling shit with a bouillon cube instead of straight water, instant better taste right out of the gate.",
          "created_utc": 1607167613.0
        }
      ]
    },
    {
      "id": "geplpp4",
      "author": "61114311536123511",
      "body": "Just. Don't boil veg. Steamed, baked or fried. Always.",
      "created_utc": 1607186356.0,
      "score": 3,
      "context": [
        {
          "id": "geovypt",
          "author": "JCXIII-R",
          "body": "Damn bro, starting with brussel sprouts is hardcore lol! A tip for learning to eat veg: try boiling shit with a bouillon cube instead of straight water, instant better taste right out of the gate.",
          "created_utc": 1607167613.0
        }
      ]
    },
    {
      "id": "geq8gf2",
      "author": "k_y_r_a",
      "body": "Boiling veg takes all the nutrition out of them - steam then but add the veg stock to the water you use to steam.",
      "created_utc": 1607197899.0,
      "score": 3,
      "context": [
        {
          "id": "geovypt",
          "author": "JCXIII-R",
          "body": "Damn bro, starting with brussel sprouts is hardcore lol! A tip for learning to eat veg: try boiling shit with a bouillon cube instead of straight water, instant better taste right out of the gate.",
          "created_utc": 1607167613.0
        }
      ]
    },
    {
      "id": "gep0vv5",
      "author": "AMerrickanGirl",
      "body": "Try cauliflower. Roasted it’s very mild and almost potato like.",
      "created_utc": 1607172668.0,
      "score": 3,
      "context": [
        {
          "id": "geoudy8",
          "author": "None",
          "body": "Way to go! \nI'm similar with vegetables, I've only ever tried carrots and broccoli because the thought of putting them in my mouth fills me with dread. \nCarrots and broccoli are both on my \"safe but don't like\" list so I still basically never eat them. \nI just turned 30 and I want 2021 to be the year of trying new things! Not just food and this fills me with hope.",
          "created_utc": 1607165856.0
        }
      ]
    }
  ]
}