{
  "id": "kgfwyc",
  "subreddit": "ARFID",
  "author": "asleepunderthebridge",
  "created_utc": 1608410703.0,
  "title": "Is Anyone Else Weirdly Brand Loyal?",
  "selftext": "It's not with everything. Store brand cookies and crackers are fine, off brand almond milk too. But cream cheese? Has to be Philly or no go. Kraft Mac n Cheese is the same. Its box mac n cheese!! Store brand shouldnt be any different but it sets off my anxiety.",
  "url": "https://www.reddit.com/r/ARFID/comments/kgfwyc/is_anyone_else_weirdly_brand_loyal/",
  "score": 83,
  "num_comments": 17,
  "comments": [
    {
      "id": "ggett3f",
      "author": "tw1nkfantasy",
      "body": "some brands just taste...different??? i’ve been trying to remind myself that most store brand stuff has the exact same formula/ingredients as the actual brand itself and it’s worked for some things like milk but i’m very brand loyal to MOST if not ALL of my safe foods",
      "created_utc": 1608417998.0,
      "score": 35,
      "context": []
    },
    {
      "id": "ggewf2g",
      "author": "justcommenting562",
      "body": "I am totally brand loyal, but also weirdly store loyal. Like I'd eat regular oreos from one store but not another, then only eat chocolate ones from a different store.",
      "created_utc": 1608419020.0,
      "score": 15,
      "context": []
    },
    {
      "id": "ggeetj5",
      "author": "Garbagedoge",
      "body": "Yes and I hate it, but I just can't bring myself to eat the wrong brand...",
      "created_utc": 1608412097.0,
      "score": 11,
      "context": []
    },
    {
      "id": "gged9gt",
      "author": "WellDoneEngineer",
      "body": "i do that too, its frustrating, because odds are, theyre the same product! lol",
      "created_utc": 1608411437.0,
      "score": 10,
      "context": []
    },
    {
      "id": "ggfn38k",
      "author": "axw3555",
      "body": "Insanely so. I will only eat a certain brand of pasta, biscuits, soup, bread. Pretty much the only thing I’m not is milk.",
      "created_utc": 1608432212.0,
      "score": 6,
      "context": []
    },
    {
      "id": "ggfcc3k",
      "author": "mxktulu",
      "body": "My six year old son has ARFID, he is not just brand loyal, he is packaging loyal. I have an irrational hatred of “limited edition packaging” and especially “festive packaging”.",
      "created_utc": 1608426016.0,
      "score": 9,
      "context": []
    },
    {
      "id": "ggej33u",
      "author": "Yoe19",
      "body": "I'm happy to try other brands if I have to as I feel a bit better prepared. But I'll always default to my safe ones",
      "created_utc": 1608413768.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gihhkvo",
      "author": "3hourbaths",
      "body": "The issue here (currently live in the UK) is that we don't have many brands in for any more, is all store brands. Back when this were made by the big brands you could go to any store and pick up some McCain chips, but now it's store brands you gotta go to M&S to get M&S brand chicken and bacon pasta, Morrison's to get Morrison's brand Spaghetti meatballs, Lidl to get ...you get the idea!! Not very pandemic friendly either, never mind time consuming. I wish I'd never looked in Abu other store, but because I've travelled a lot I know what's available everywhere so I crave a Tesco pizza (only one I eat) and I can't have one. \n\nPS: 3 scariest words in ARFID world: new improved recipe.",
      "created_utc": 1610064558.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ggfdajv",
      "author": "cj7695",
      "body": "I feel like even if it’s exactly the same inside my brain or one bad experience will set off my anxiety and say no no this one isn’t the same!",
      "created_utc": 1608426560.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ggfw2ij",
      "author": "emmatsoc",
      "body": "i tell myself that if i don’t eat the normal brand i eat, i’ll have an allergic reaction to the knock off. like bruh what? it sucks it prevents me from eating so many different things! or i’ll have a local fast food place, and i don’t want to eat at any other location of theirs or else i think i’ll get sick from it. ugh",
      "created_utc": 1608437730.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ggg45ku",
      "author": "letfalltheflowers",
      "body": "I have had ARFID since infancy and I am brand loyal, and loyal to certain selection of foods. I learned to eat apples last year but because I was introduced to honey crisp, my anxiety will not let me try any other type of apple, and I also can’t eat them regularly because they haven’t been eaten enough to be added into my rotation. But any other type of apple, even if it’s similar I can’t and won’t buy or try it.",
      "created_utc": 1608443161.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ggieoda",
      "author": "maonue",
      "body": "Yep sometimes it’s hard lol.\n\nI have one brand of milk per city :p",
      "created_utc": 1608494051.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ggevynh",
      "author": "Freaky4him",
      "body": "Name brand or I'm not eating it lol",
      "created_utc": 1608418844.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ggfwz70",
      "author": "gothbullied",
      "body": "yes. alphagetti brand from the can? Please.\n\nalphabet noodles cooked into marinara sauce? Get it away from me. idk why it is that way",
      "created_utc": 1608438283.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ggg6p82",
      "author": "None",
      "body": "I definitely will only eat kraft mac, specifically the deluxe sauce kind",
      "created_utc": 1608445213.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ggghd65",
      "author": "surelythisisnttaken-",
      "body": "YUP. I can eat pizza, but only a specific type from a specific place. Same with sushi, burgers, noodles, peanut butter... the list goes onnnn. I haven’t eaten peanut butter in years because the brand I liked changed :(",
      "created_utc": 1608455667.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ggg83mn",
      "author": "DDMcDoodle",
      "body": "McIntosh apples are the only ones I really like. They are a bit more sour and have a different texture.",
      "created_utc": 1608446432.0,
      "score": 1,
      "context": [
        {
          "id": "ggg45ku",
          "author": "letfalltheflowers",
          "body": "I have had ARFID since infancy and I am brand loyal, and loyal to certain selection of foods. I learned to eat apples last year but because I was introduced to honey crisp, my anxiety will not let me try any other type of apple, and I also can’t eat them regularly because they haven’t been eaten enough to be added into my rotation. But any other type of apple, even if it’s similar I can’t and won’t buy or try it.",
          "created_utc": 1608443161.0
        }
      ]
    }
  ]
}