{
  "id": "klra2v",
  "subreddit": "ARFID",
  "author": "elleskas",
  "created_utc": 1609164814.0,
  "title": "kind of a different victory",
  "selftext": "hi. this post isn't about a victory as in i ate a new food, but about something arfid-related that made me really happy. \n\nto give a bit of context:\ni, 17f, grew up in a small village somewhere in central europe, i've lived here my whole life. most people in my surroundings are pretty conservative and i never had a lot of friends. \n\nsince i'm not happy with the current political state here, i decided to join a youth party, where, for the first time, i met people who had the same views as i did, and i instantly got along with. \ni always avoided attending events where we food would be served, for obvious arfid-reasons, but a couple of weeks ago, because of some misconceptions, i didn't. \nso i'm there, working and stuff, when someone goes, okay, i'll cook for everyone later. my first impulse was, well, fml. i anxiously asked that person if they could cook for one person less, because i wouldn't be eating. they asked if i had allergies, and normally i would've said yes, but for some reason i went \"i have an eating disorder that makes it very triggering for me to eat certain things.\"\nand they ACCEPTED IT. no arguing, no weird stares, they asked me if i was okay with not eating anything or if i wanted to go to the grocery store to buy something i could eat. after that, they dropped the subject and didn't ask any more questions. this made me incredibly happy so i thought i'd share. (:\n\ntldr: i told someone the actual reason i wasn't eating and they accepted it without asking any weird questions.",
  "url": "https://www.reddit.com/r/ARFID/comments/klra2v/kind_of_a_different_victory/",
  "score": 87,
  "num_comments": 4,
  "comments": [
    {
      "id": "ghb6scn",
      "author": "she-they",
      "body": "this is so awesome to hear..:') i'm so happy for you right now, hope even better things happen in your life!💞",
      "created_utc": 1609180207.0,
      "score": 9,
      "context": []
    },
    {
      "id": "ghbjzwe",
      "author": "CatOverlordsWelcome",
      "body": "I'm so so so happy you had this experience <3",
      "created_utc": 1609186834.0,
      "score": 6,
      "context": []
    },
    {
      "id": "ghcd870",
      "author": "ItsEsJay",
      "body": "That's so nice! :) Happy to hear that! \n I've recently experienced something similar. Also 17nb from central Europe. I visited a person I met at a party. They live a few hundred kilometers away from my city so it was kind of an commitment to go there without knowing how the situation regarding food was... I went there anyways. When I arrived I was hungry af and they offered to cook something for us. I asked them whether they could cook something \"simple\" like pasta or rice, because \"I'm quite a picky eater and have a lot of allergies\" (that's actually true, I have a lot of allergies that make it even harder to find something edible...) and they were totally fine with it. Later they took me to a supermarket so I could buy some safe foods. After we got to know each other a bit more I actually opened up about having arfid and the person was just super accepting and overall curious. They had an eating disorder as well and we could talk about it openly and without any judgement. It's just so amazing to just be accepted and not judged. The thing is, we (people with arfid) actually aren't that complicated. As long as we have safe foods around and nobody forces us to eat something, I think most of us are really chill and you don't have to put much effort into preparing our meals either ;)",
      "created_utc": 1609202451.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ghcj8de",
      "author": "umidk9",
      "body": "love this!",
      "created_utc": 1609205726.0,
      "score": 3,
      "context": [
        {
          "id": "ghcd870",
          "author": "ItsEsJay",
          "body": "That's so nice! :) Happy to hear that! \n I've recently experienced something similar. Also 17nb from central Europe. I visited a person I met at a party. They live a few hundred kilometers away from my city so it was kind of an commitment to go there without knowing how the situation regarding food was... I went there anyways. When I arrived I was hungry af and they offered to cook something for us. I asked them whether they could cook something \"simple\" like pasta or rice, because \"I'm quite a picky eater and have a lot of allergies\" (that's actually true, I have a lot of allergies that make it even harder to find something edible...) and they were totally fine with it. Later they took me to a supermarket so I could buy some safe foods. After we got to know each other a bit more I actually opened up about having arfid and the person was just super accepting and overall curious. They had an eating disorder as well and we could talk about it openly and without any judgement. It's just so amazing to just be accepted and not judged. The thing is, we (people with arfid) actually aren't that complicated. As long as we have safe foods around and nobody forces us to eat something, I think most of us are really chill and you don't have to put much effort into preparing our meals either ;)",
          "created_utc": 1609202451.0
        }
      ]
    }
  ]
}