{
  "id": "kq2ump",
  "subreddit": "ARFID",
  "author": "aesthetic-brownie",
  "created_utc": 1609740910.0,
  "title": "Does anyone else just really wish they could eat healthy food but can’t because of their ARFID?",
  "selftext": "Feel like this is relevant now particularly being that’s it’s a new year and everyone’s setting New Years resolutions. So I have ARFID and I feel lucky in that my range of safe foods seem to be wider than many people in this group, but the foods I do eat are mostly unhealthy. I don’t eat any vegetables except for about 2 which are only in certain circumstances. I really just wish I could eat more healthier meals particularly for dinner as I know that i would feel so much healthier and better for it but because of my ARFID that really restricts my options. It’s so hard working out what to have for dinner because I want to be healthy but my dinner options aren’t very healthy and it’s just so frustrating! It’s almost like I feel bad for eating something kinda unhealthy for dinner even though I don’t really have any safe dinner meals and I won’t go hungry. Does anyone else feel my pain?",
  "url": "https://www.reddit.com/r/ARFID/comments/kq2ump/does_anyone_else_just_really_wish_they_could_eat/",
  "score": 187,
  "num_comments": 42,
  "comments": [
    {
      "id": "gi1nfsp",
      "author": "lelaluv",
      "body": "yes!! i basicslly have the food pallet of a child lol, chicken nuggets, plain burgers, plain spaghetti, etc. i don’t like any fruits unless it’s in smoothie form and i hate all vegetables. it’s really hard to try to eat healthy as there’s simply nothing in my safe foods that are necessarily healthy. i luckily don’t have to worry about gaining weight lol, but it definitely worries me because i know i’m not getting enough nutrients.",
      "created_utc": 1609743022.0,
      "score": 36,
      "context": []
    },
    {
      "id": "gi1w8zq",
      "author": "letfalltheflowers",
      "body": "Definitely feel your pain! I’m in my late 20s and have had lifelong ARFID and cry about the exact thing you’ve posted here all the time. The desire for me to be healthier is so strong, but I just cannot overcome some of my hang ups that I have with food. I think most (or all) of us with this condition would choose to have it gone completely if that was a choice. It’s debilitating.",
      "created_utc": 1609751184.0,
      "score": 25,
      "context": []
    },
    {
      "id": "gi1wgd5",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1609751394.0,
      "score": 23,
      "context": []
    },
    {
      "id": "gi1pjfp",
      "author": "aesthetic-brownie",
      "body": "Thanks so much for your comment. I have thought about mixing in things to my safe foods before. Texture is a big thing for me unfortunately and I can very easily tell when things aren’t how I like them which makes it difficult. Haven’t thought about puréeing before though so that might be something to try. I am keen on taking some supplements though so that might be a good idea. I have been making some smoothies so guess I can try and incorporate some other things into them too.",
      "created_utc": 1609744789.0,
      "score": 13,
      "context": []
    },
    {
      "id": "gi1qk3c",
      "author": "None",
      "body": "Unfortunately yeah :( it can override my thoughts. I'm happy I have a good sized safe foods list, but I wish it had more veggies. Then I get into a loop about being anxious of not eating enough \"healthier\" stuff and that spirals back to being anxious of trying \"healthier\" stuff. For example, quesadillas is one of my safe foods and I started adding spinach or very small chopped pieces of broccoli. And I'm comfortable with this but I wouldn't with a plate of just plain broccoli. So for now I'm starting with that.\n\nEdit: added an example",
      "created_utc": 1609745698.0,
      "score": 11,
      "context": []
    },
    {
      "id": "gi1rv5k",
      "author": "Speciez",
      "body": "Yup it’s really difficult cause almost all of my safe foods are carbs. But the last few months I’ve been making smoothies 5 days a week and it’s helped. My skins cleared up and I feel better. It’s not much, nowhere near the 7 fruit and veg your meant to have but every little helps.",
      "created_utc": 1609746888.0,
      "score": 9,
      "context": []
    },
    {
      "id": "gi2bn87",
      "author": "Brainlesskiddo",
      "body": "Same, also I always feel really guilty when I pass those vegan/vegetarian/anti animal cruelty booths in town. I'd love to change my diet to something that is more environment friendly but I know that almost every safe food I have isn't",
      "created_utc": 1609765754.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gi28273",
      "author": "gothbullied",
      "body": "Yes. I use a deep fryer almost daily and it's embarrassing and it gives me a lot of anxiety around putting weight on",
      "created_utc": 1609762827.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gi2mm1i",
      "author": "Dethanatos",
      "body": "I've been really concerned about getting proper nutrition lately, and wondering if a lot of my lethargy could be due to things lacking in my diet. It's hard to try and work out what I am missing for a diet/supplement so that I have what I need. After about 20 minutes of researching food stuff I just feel depressed. I wish there was just a program that I could plug in the things I eat and it would spit out the things my diet is missing.",
      "created_utc": 1609772729.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gi1nsgu",
      "author": "umidk9",
      "body": "would it be possible for u to switch some stuff out for vegan/vego options? A lot of that stuff has gotten to the point where people cant tell the difference. Or possibly talk to your doctor about nutritional supplements ot something?",
      "created_utc": 1609743310.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gi2atru",
      "author": "previous404",
      "body": "i feel the exact same way, it's awful, my diet consists of no fruit, meat, or veg, i really wish i could be healthy but it's definitely a struggle",
      "created_utc": 1609765116.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gi2yfy4",
      "author": "neptune_pirate",
      "body": "I totally feel this. I try to remember though that \"healthy\" is different for everyone, and the anxiety of it all is really what is the most harmful. Lean into the healthy foods you do like/can eat (for me it's sweet potato and broccoli with quinoa or something similar) when you can and lean on your safe foods when you have to. take vitamins. and you're definitely not alone!",
      "created_utc": 1609778684.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gi368oh",
      "author": "syntheticjoy_",
      "body": "This has been my struggle for so many years. I often get upset because people are so judgy about others who don't eat healthily like them but they never consider that some people just CAN'T. I hate nearly all vegetables. Luckily I've found a few foods that are good for me and I'm trying to eat them more frequently. This morning I've eaten plain cheerios, bananas, and grapes, and I often have a Soylent or two during the day (400 calorie meal replacement with 20% of your daily nutrients in each bottle). I also take Flintstones gummy vitamins lol. Then there is that weird group of people who say that fruits and my Soylent is also unhealthy and pretty much everything else except for disgusting things like kale and squash. They can F right off.",
      "created_utc": 1609782331.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gi29x6x",
      "author": "Rando_I_guess",
      "body": "If you want to eat something healthy just eat! It’s not that hard! /s",
      "created_utc": 1609764397.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gi2udrp",
      "author": "None",
      "body": "Yes, yes, yes. I worry about my nutrition deficits and definitely try to compensate by taking lots of vitamins. My foods are mostly all carbs abd it’s caused more weight gain than I’m comfortable with. You cannot over exercise a bad diet. I get frustrated at my mom who is overweight but if she just ate salads abd healthy foods she’d be fine. In her case it’s not bc she can’t do it, she just won’t. I know it sounds hypocritical but I’m like just eat healthy! Which of course I know is dumb Bc if she tried to say that to me, I’d break down and cry. I feel like our issues are completely different but it’s just that I do badly want to just eat salads and healthy foods and I can’t.",
      "created_utc": 1609776718.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gi2xses",
      "author": "Garbagedoge",
      "body": "Most of my safe foods are junk but I'm trying really hard to find healthier options I could at least tolerate... Found a few new tolerable foods last year and hoping to find even more this year... Maybe some day I can eat without feeling like trash.",
      "created_utc": 1609778371.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gi2xttv",
      "author": "Snoocone12345",
      "body": "Yes. I actually kinda collect healthy recipe books. It's so depressing though, looking through them and realising you couldn't even eat one thing in them.",
      "created_utc": 1609778390.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gi4qom3",
      "author": "Cyberkaiju",
      "body": "As a rather extreme pacifist I would like to go vegan, as a stance against violence to animals, but due to ARFID I don’t have that option",
      "created_utc": 1609809607.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gi4qw2v",
      "author": "-ACP-",
      "body": "Every. Single. Day.\nI feel so off like this, I see everyone eating normally while I feel trapped in this endless cycle. I've been wanting to get help for such a long time but always had bad experiences trying on my own. I may seek therapy or something professional soon.. i'm 20 now and I also constantly worry about my health now and in my future.\nLet's stay positive though, let's believe we won't be trapped forever. We still have time to try our best to expand our diets. Safe foods are comfortable, but sometimes it's uncomfortable too. We just have to gather up the courage to try and work on it! ♥️",
      "created_utc": 1609809716.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gi1opnx",
      "author": "420BirdOrgy",
      "body": "I’m not sure what triggers your ARFID or what you’re comfortable with doing (e.g touching, smelling or being around certain foods) so this idea definitely depends on those factors. Is there any way you could sort of hide healthier foods within your safe foods? Almost like some parents do when their child isn’t comfortable with some vegetables but they still want them to get more nutrients (If you don’t feel comfortable doing it yourself and are able to have someone cook it for you too this may help?). For example mashed potatoes with another vegetable (pumpkin/cauliflower/other) puréed through it or mac and cheese with a mostly flavourless vegetable puréed and mixed through the cheese. If you think this idea could potentially be helpful I’d be happy to help you think of ways to incorporate fruit/veg/grains into specific safe meals! Otherwise potentially supplement drinks or multivitamins? Though I totally understand if none of this is helpful, eating disorders are super complex and it might take a bit of trial and error. I hope you find something that works for you!",
      "created_utc": 1609744081.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gi2bata",
      "author": "hoaglandmr",
      "body": "I definitely feel this but I actually made my New Years resolution that I have to eat either a salad or a smoothie everyday. Obviously I won’t be able to reach it constantly but if I’m able to do it 5/7 days a week that’ll be a big improvement. I’ve just started being able to eat salads in like the last year and I recommend just putting some of your safe foods in them. It was a bit of stretch for me to start eating lettuce but I always liked apples and cucumbers as a kid so it was pretty easy to add those in and I just use balsamic vinaigrette (Trader Joe’s one is so good and totally masks the flavor off lettuce). I’ve been thinking of adding in red onions and shredded carrots, which are also foods that I’m comfortable with on their own but two years ago I definitely couldn’t see myself eating a salad whereas now I actually enjoy them a lot more than trying to eat cooked vegetables at least. I also gave myself the grace of being able to fall back on a smoothie if I’m just really not feeling it some days which is still healthy and not as bad as just getting no servings of healthy food which is what I’ve been doing most of my life. All this to say, when I’m feeling overwhelmed, I try to strip it backs to baby steps that I feel comfortable with and then it makes it easier to all come together in the end. Hope this helps in some way!\n\nETA: also it helps if you use fresher produce because it’s a lot more crisp and the longer the food sits in your fridge, the more mushy and unappealing it gets so I always try to use really fresh ingredients if that makes sense",
      "created_utc": 1609765490.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gi2um4l",
      "author": "None",
      "body": "I personally can eat and also love fruits and veggies  and other healthy foods but my pallet is so stupid specific that eating my safe foods is ridiculously expensive and just a lot of effort",
      "created_utc": 1609776832.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gi326ec",
      "author": "None",
      "body": "I feel this. I want to eat healthier but “healthy” foods aren’t really in any of my safe foods. So I’m trying to fix it by eating more fruits I like and the one (1) veggie I do like. I’m also drinking more yogurt and will maybe attempt some smoothies!",
      "created_utc": 1609780444.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gi3uutc",
      "author": "na0202",
      "body": "yep. fucking sucks",
      "created_utc": 1609793791.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gi5nrle",
      "author": "emorytacker",
      "body": "i don’t remember the last time i didn’t feel tired every day. the fatigue literally never ends. somehow i still managed to do gymnastics for 20 hours a week with my diet for years lol. but i know if i were to eat better i wouldn’t be so tired. i wish i could change it but i just can’t.",
      "created_utc": 1609828928.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gigrqe1",
      "author": "Imagineer_cam",
      "body": "Yes! So much!\n\nThe really annoying thing is I think some foods look really nice and I wish I could eat it but then the taste, texture and/or smell doesn't agree with my ARFID.\n\nLike I just want a salad dude, is that so much to ask. Some proper nutrition and less sugar and fat, arrrr!",
      "created_utc": 1610052349.0,
      "score": 1,
      "context": []
    },
    {
      "id": "giuvo91",
      "author": "None",
      "body": "My wife went vegan which means I'm nearly vegan, the transition was a bit awkward but I grew to really appreciate mushrooms.",
      "created_utc": 1610354163.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gi1p9cs",
      "author": "aesthetic-brownie",
      "body": "Yes ARFID makes it hard especially when you think about long term health and getting enough nutrients. But glad I’m not the only one that feels this way.",
      "created_utc": 1609744550.0,
      "score": 10,
      "context": [
        {
          "id": "gi1nfsp",
          "author": "lelaluv",
          "body": "yes!! i basicslly have the food pallet of a child lol, chicken nuggets, plain burgers, plain spaghetti, etc. i don’t like any fruits unless it’s in smoothie form and i hate all vegetables. it’s really hard to try to eat healthy as there’s simply nothing in my safe foods that are necessarily healthy. i luckily don’t have to worry about gaining weight lol, but it definitely worries me because i know i’m not getting enough nutrients.",
          "created_utc": 1609743022.0
        }
      ]
    },
    {
      "id": "gi22emv",
      "author": "aesthetic-brownie",
      "body": "That is definitely it!",
      "created_utc": 1609757492.0,
      "score": 9,
      "context": [
        {
          "id": "gi1wgd5",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1609751394.0
        }
      ]
    },
    {
      "id": "gi3qjf1",
      "author": "snydnet2527",
      "body": "Puréeing has opened up so much for me! I would definitely recommend to anyone on this thread if that falls within your options!",
      "created_utc": 1609791798.0,
      "score": 3,
      "context": [
        {
          "id": "gi1pjfp",
          "author": "aesthetic-brownie",
          "body": "Thanks so much for your comment. I have thought about mixing in things to my safe foods before. Texture is a big thing for me unfortunately and I can very easily tell when things aren’t how I like them which makes it difficult. Haven’t thought about puréeing before though so that might be something to try. I am keen on taking some supplements though so that might be a good idea. I have been making some smoothies so guess I can try and incorporate some other things into them too.",
          "created_utc": 1609744789.0
        }
      ]
    },
    {
      "id": "gihgo1h",
      "author": "3hourbaths",
      "body": "Oh the anxiety loop! I go to the store and if it's too expensive I can't have it, if it's too unhealthy I can't have it, if it's all carbs I can't have it, if it's high fat I can't have it, if it's not safe food I can't have it. Then I come home with a single pack of corn chips and a bar of chocolate to last a week and I need to do the whole thing again.",
      "created_utc": 1610064095.0,
      "score": 1,
      "context": [
        {
          "id": "gi1qk3c",
          "author": "None",
          "body": "Unfortunately yeah :( it can override my thoughts. I'm happy I have a good sized safe foods list, but I wish it had more veggies. Then I get into a loop about being anxious of not eating enough \"healthier\" stuff and that spirals back to being anxious of trying \"healthier\" stuff. For example, quesadillas is one of my safe foods and I started adding spinach or very small chopped pieces of broccoli. And I'm comfortable with this but I wouldn't with a plate of just plain broccoli. So for now I'm starting with that.\n\nEdit: added an example",
          "created_utc": 1609745698.0
        }
      ]
    },
    {
      "id": "gi22dzk",
      "author": "aesthetic-brownie",
      "body": "Glad your getting into smoothies! I’m the exact same in the most of my safe foods are carbs too which isn’t ideal but eating carbs is better than starving",
      "created_utc": 1609757474.0,
      "score": 3,
      "context": [
        {
          "id": "gi1rv5k",
          "author": "Speciez",
          "body": "Yup it’s really difficult cause almost all of my safe foods are carbs. But the last few months I’ve been making smoothies 5 days a week and it’s helped. My skins cleared up and I feel better. It’s not much, nowhere near the 7 fruit and veg your meant to have but every little helps.",
          "created_utc": 1609746888.0
        }
      ]
    },
    {
      "id": "gi2bz0c",
      "author": "christmasjones6",
      "body": "do you have to eat 7 fruit and vegs a day?!?!?! how",
      "created_utc": 1609766002.0,
      "score": 3,
      "context": [
        {
          "id": "gi1rv5k",
          "author": "Speciez",
          "body": "Yup it’s really difficult cause almost all of my safe foods are carbs. But the last few months I’ve been making smoothies 5 days a week and it’s helped. My skins cleared up and I feel better. It’s not much, nowhere near the 7 fruit and veg your meant to have but every little helps.",
          "created_utc": 1609746888.0
        }
      ]
    },
    {
      "id": "gi43b0a",
      "author": "makinggrace",
      "body": "Have u tried an air fryer? We got one recently and I have been surprised at how crispy things turn out. (Ok they aren’t THAT much healthier except for the oil. But I might suck up and try “frying” some vegetables in a batter or something.)",
      "created_utc": 1609797782.0,
      "score": 1,
      "context": [
        {
          "id": "gi28273",
          "author": "gothbullied",
          "body": "Yes. I use a deep fryer almost daily and it's embarrassing and it gives me a lot of anxiety around putting weight on",
          "created_utc": 1609762827.0
        }
      ]
    },
    {
      "id": "lqo6v7x",
      "author": "bellapatella",
      "body": "SO REAL I THINK ABOUT THIS ALL THE TIME. It really sucks. I've felt like I had lower energy levels then all of my peers since childhood, but it was never a concern to anyone else. Being in college now, it feels insanely difficult to focus on something for more than 5 minutes. Though I have ADHD so that contributes, I feel like I'd be able to solve so many of my ADHD-related issues if I was getting the right nutrition & calories every day, but it feels IMPOSSIBLE.  \nIt really helps to know that you're not the only one.",
      "created_utc": 1728246241.0,
      "score": 2,
      "context": [
        {
          "id": "gi2mm1i",
          "author": "Dethanatos",
          "body": "I've been really concerned about getting proper nutrition lately, and wondering if a lot of my lethargy could be due to things lacking in my diet. It's hard to try and work out what I am missing for a diet/supplement so that I have what I need. After about 20 minutes of researching food stuff I just feel depressed. I wish there was just a program that I could plug in the things I eat and it would spit out the things my diet is missing.",
          "created_utc": 1609772729.0
        }
      ]
    },
    {
      "id": "gi1p6hk",
      "author": "aesthetic-brownie",
      "body": "Thanks that would be definitely something to look into to. I have been thinking about taking suppliments too so maybe that’s a good idea.",
      "created_utc": 1609744481.0,
      "score": 5,
      "context": [
        {
          "id": "gi1nsgu",
          "author": "umidk9",
          "body": "would it be possible for u to switch some stuff out for vegan/vego options? A lot of that stuff has gotten to the point where people cant tell the difference. Or possibly talk to your doctor about nutritional supplements ot something?",
          "created_utc": 1609743310.0
        }
      ]
    },
    {
      "id": "gi43sg0",
      "author": "makinggrace",
      "body": "I just stopped trying to put lettuce in salads. I like them better now lol. And I make them all “chopped salads,” so everything in it is roughly the same bite size. That helped, too. But I do better with smaller-sized things generally.",
      "created_utc": 1609798012.0,
      "score": 2,
      "context": [
        {
          "id": "gi2bata",
          "author": "hoaglandmr",
          "body": "I definitely feel this but I actually made my New Years resolution that I have to eat either a salad or a smoothie everyday. Obviously I won’t be able to reach it constantly but if I’m able to do it 5/7 days a week that’ll be a big improvement. I’ve just started being able to eat salads in like the last year and I recommend just putting some of your safe foods in them. It was a bit of stretch for me to start eating lettuce but I always liked apples and cucumbers as a kid so it was pretty easy to add those in and I just use balsamic vinaigrette (Trader Joe’s one is so good and totally masks the flavor off lettuce). I’ve been thinking of adding in red onions and shredded carrots, which are also foods that I’m comfortable with on their own but two years ago I definitely couldn’t see myself eating a salad whereas now I actually enjoy them a lot more than trying to eat cooked vegetables at least. I also gave myself the grace of being able to fall back on a smoothie if I’m just really not feeling it some days which is still healthy and not as bad as just getting no servings of healthy food which is what I’ve been doing most of my life. All this to say, when I’m feeling overwhelmed, I try to strip it backs to baby steps that I feel comfortable with and then it makes it easier to all come together in the end. Hope this helps in some way!\n\nETA: also it helps if you use fresher produce because it’s a lot more crisp and the longer the food sits in your fridge, the more mushy and unappealing it gets so I always try to use really fresh ingredients if that makes sense",
          "created_utc": 1609765490.0
        }
      ]
    },
    {
      "id": "gihge68",
      "author": "3hourbaths",
      "body": "I don't think I could do 7 fruit and veg in a year!",
      "created_utc": 1610063959.0,
      "score": 3,
      "context": [
        {
          "id": "gi1rv5k",
          "author": "Speciez",
          "body": "Yup it’s really difficult cause almost all of my safe foods are carbs. But the last few months I’ve been making smoothies 5 days a week and it’s helped. My skins cleared up and I feel better. It’s not much, nowhere near the 7 fruit and veg your meant to have but every little helps.",
          "created_utc": 1609746888.0
        },
        {
          "id": "gi2bz0c",
          "author": "christmasjones6",
          "body": "do you have to eat 7 fruit and vegs a day?!?!?! how",
          "created_utc": 1609766002.0
        }
      ]
    },
    {
      "id": "gi4msgv",
      "author": "None",
      "body": "I started doing cauliflower tots, and they're pretty good from the air fryer.",
      "created_utc": 1609807618.0,
      "score": 2,
      "context": [
        {
          "id": "gi28273",
          "author": "gothbullied",
          "body": "Yes. I use a deep fryer almost daily and it's embarrassing and it gives me a lot of anxiety around putting weight on",
          "created_utc": 1609762827.0
        },
        {
          "id": "gi43b0a",
          "author": "makinggrace",
          "body": "Have u tried an air fryer? We got one recently and I have been surprised at how crispy things turn out. (Ok they aren’t THAT much healthier except for the oil. But I might suck up and try “frying” some vegetables in a batter or something.)",
          "created_utc": 1609797782.0
        }
      ]
    },
    {
      "id": "gi2yyig",
      "author": "crazyartfreak",
      "body": "One brand that really worked for me was Morningstar vegan \"chick'n\" patties. The buffalo flavor ones you can hardly tell from chicken because of the spice level.",
      "created_utc": 1609778930.0,
      "score": 3,
      "context": [
        {
          "id": "gi1nsgu",
          "author": "umidk9",
          "body": "would it be possible for u to switch some stuff out for vegan/vego options? A lot of that stuff has gotten to the point where people cant tell the difference. Or possibly talk to your doctor about nutritional supplements ot something?",
          "created_utc": 1609743310.0
        },
        {
          "id": "gi1p6hk",
          "author": "aesthetic-brownie",
          "body": "Thanks that would be definitely something to look into to. I have been thinking about taking suppliments too so maybe that’s a good idea.",
          "created_utc": 1609744481.0
        }
      ]
    },
    {
      "id": "gi66ofp",
      "author": "hoaglandmr",
      "body": "Wow I never knew what a chopped salad was but I just looked it up and that’s the perfect way to describe how I like my salads. Smaller bite sizes are a lot less overwhelming for me, and I don’t love the lettuce or whatever greens I put in it, how ever with each bite I try to make sure there’s some apple or cucumber with the lettuce to mask the taste and texture as much as possible. It’s the only way I’ve been able to get them down and making it my New Years resolution has also pushed me a lot towards kind of actually enjoying them? The key for me is breaking difficult foods down into smaller things and realizing I like some of the smaller elements, so the overall combination isn’t as intimidating.",
      "created_utc": 1609847299.0,
      "score": 2,
      "context": [
        {
          "id": "gi2bata",
          "author": "hoaglandmr",
          "body": "I definitely feel this but I actually made my New Years resolution that I have to eat either a salad or a smoothie everyday. Obviously I won’t be able to reach it constantly but if I’m able to do it 5/7 days a week that’ll be a big improvement. I’ve just started being able to eat salads in like the last year and I recommend just putting some of your safe foods in them. It was a bit of stretch for me to start eating lettuce but I always liked apples and cucumbers as a kid so it was pretty easy to add those in and I just use balsamic vinaigrette (Trader Joe’s one is so good and totally masks the flavor off lettuce). I’ve been thinking of adding in red onions and shredded carrots, which are also foods that I’m comfortable with on their own but two years ago I definitely couldn’t see myself eating a salad whereas now I actually enjoy them a lot more than trying to eat cooked vegetables at least. I also gave myself the grace of being able to fall back on a smoothie if I’m just really not feeling it some days which is still healthy and not as bad as just getting no servings of healthy food which is what I’ve been doing most of my life. All this to say, when I’m feeling overwhelmed, I try to strip it backs to baby steps that I feel comfortable with and then it makes it easier to all come together in the end. Hope this helps in some way!\n\nETA: also it helps if you use fresher produce because it’s a lot more crisp and the longer the food sits in your fridge, the more mushy and unappealing it gets so I always try to use really fresh ingredients if that makes sense",
          "created_utc": 1609765490.0
        },
        {
          "id": "gi43sg0",
          "author": "makinggrace",
          "body": "I just stopped trying to put lettuce in salads. I like them better now lol. And I make them all “chopped salads,” so everything in it is roughly the same bite size. That helped, too. But I do better with smaller-sized things generally.",
          "created_utc": 1609798012.0
        }
      ]
    },
    {
      "id": "gik8h04",
      "author": "christmasjones6",
      "body": "feelsbadman",
      "created_utc": 1610127575.0,
      "score": 1,
      "context": [
        {
          "id": "gi1rv5k",
          "author": "Speciez",
          "body": "Yup it’s really difficult cause almost all of my safe foods are carbs. But the last few months I’ve been making smoothies 5 days a week and it’s helped. My skins cleared up and I feel better. It’s not much, nowhere near the 7 fruit and veg your meant to have but every little helps.",
          "created_utc": 1609746888.0
        },
        {
          "id": "gi2bz0c",
          "author": "christmasjones6",
          "body": "do you have to eat 7 fruit and vegs a day?!?!?! how",
          "created_utc": 1609766002.0
        },
        {
          "id": "gihge68",
          "author": "3hourbaths",
          "body": "I don't think I could do 7 fruit and veg in a year!",
          "created_utc": 1610063959.0
        }
      ]
    }
  ]
}