{
  "id": "l6kal8",
  "subreddit": "ARFID",
  "author": "None",
  "created_utc": 1611797118.0,
  "title": "UPDATE ON TELLING THE GUY ABOUT MY ARFID",
  "selftext": "Hey everyone!!! With your guy’s help I got the courage to tell him! We were working out and he had offered me food, that’s when I told him. I sat him down and explained very thoroughly what ARFID was and how I’m struggling with it. Y’now what he says? “Oh that’s okay, so what other set do you want to do?” I was like “whATt??! Y-you’re not bothered by it?” He simply gave me a hug and a kiss and called me silly for over reacting. Crazy! Anyways thank you to everyone that helped me and supported me!! ❤️🥰\n\n\nY’all if I don’t marry this man, I swear to god-",
  "url": "https://www.reddit.com/r/ARFID/comments/l6kal8/update_on_telling_the_guy_about_my_arfid/",
  "score": 93,
  "num_comments": 7,
  "comments": [
    {
      "id": "gl1w319",
      "author": "None",
      "body": "I'm so happy for you!! it's lovely that you have someone who is so understanding w/ something that most ppl judge us for 😊💖",
      "created_utc": 1611810568.0,
      "score": 12,
      "context": []
    },
    {
      "id": "gl259ug",
      "author": "roflberrypwncakes_",
      "body": "Yay!! Proud of you, stranger. Glad you decided to do an update",
      "created_utc": 1611816409.0,
      "score": 9,
      "context": []
    },
    {
      "id": "gl4jf9z",
      "author": "sayhellotojenn",
      "body": "YES YES YES! I AM SO EXCITED FOR YOU!\n\nI just recently had my first experience like this. ARFID has been a big factor in why I’ve never had a serious relationship. I started dating a guy at the beginning of November and I was initially very hesitant to eat around him or discuss food (y’all know how it goes), especially because he’s kind of a foodie, but when we finally discussed it head-on and he was so kind about it! Basically just told me “I’d love to work on this with you, but if all you ever eat around me is chicken tenders and fries, that’s okay too.” So glad to see your similar experience!",
      "created_utc": 1611857842.0,
      "score": 10,
      "context": []
    },
    {
      "id": "gl2hwfj",
      "author": "None",
      "body": "That's so awesome!",
      "created_utc": 1611826509.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gl4dkui",
      "author": "basiamille",
      "body": "It’s amazing when your SO understands the challenges. My GF (hi, honey, you lurker!) just moved in with me, and she just last night was fine with me getting my own food while she heated up leftovers (a huge problem for me). We both know it’s going to be a slog where food is concerned; but she loves me enough to put in the effort, so I’d be a fool not to do the same.\n\nI wish you and your fella as much luck and success as I feel I’ve had, with more to come for all of us.",
      "created_utc": 1611855423.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gl3dzpg",
      "author": "BriannaFRC",
      "body": "Congrats! :)",
      "created_utc": 1611844670.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gl9qhme",
      "author": "Imagineer_cam",
      "body": "I'm so happy for you! \nIt's not always easy to tell people, and it's not always easy to get them to understand. \nI'm glad he was so supportive and chill about it.",
      "created_utc": 1611945133.0,
      "score": 3,
      "context": []
    }
  ]
}