{
  "id": "lh0aj7",
  "subreddit": "ARFID",
  "author": "None",
  "created_utc": 1612982060.0,
  "title": "So, who else is pretty sure they're gonna die earlier than the average life expectancy?",
  "selftext": "Most of us have shit diets. Overeating, undereating. I think most of us have negative repercussions from our eating. It occurred to me that even if I exercise, sleep well, etc. I'm still going to be less healthy than other people when I'm old. I'm in the category of ARFID sufferers that undereat. Some days I feel like I might starve to death. \n\nI stopped drinking sugary drinks because I was afraid I get diabetes... I lost 4 lb in 3 days and I was already underweight. So, I have the choice between diabetes and starving to death. Nice.",
  "url": "https://www.reddit.com/r/ARFID/comments/lh0aj7/so_who_else_is_pretty_sure_theyre_gonna_die/",
  "score": 118,
  "num_comments": 35,
  "comments": [
    {
      "id": "gmusl9a",
      "author": "None",
      "body": "I pretty much have only ate fast food since I was 5 years old. I’m fucked.",
      "created_utc": 1612987421.0,
      "score": 36,
      "context": []
    },
    {
      "id": "gmuqqiv",
      "author": "thesteamboats",
      "body": "It’s extremely hard in college right now being restricted to shitty dining halls and a microwave during a pandemic. I do try and force myself to eat nuts, milk, and fruits even if I don’t really want to. Compared to when being home, my calorie intake is wayyyy smaller. I’ve heard some on this subreddit say they keep food near them to snack throughout the day. I’m not sure if this can help, but hope it does.",
      "created_utc": 1612986627.0,
      "score": 28,
      "context": []
    },
    {
      "id": "gmvbyh7",
      "author": "None",
      "body": "Oh man, I could have written this. I feel certain that I will have diabetes or other illnesses bc I’ll be too overweight bc I eat like shit. Even me eating ‘healthy’ is not the actual version of eating healthy. I’ve tried to prepare for the inevitable. I can’t just never eat fruits and vegetables my entire life and not have consequences. I do have this weird scenario though that I will be older and senile and for whatever reason can’t talk and be in a hospital or nursing home and they will try to force feed me vegetables or fruits and I’ll be gagging and puking and they’ll not understand why.",
      "created_utc": 1612995743.0,
      "score": 24,
      "context": []
    },
    {
      "id": "gmuwwfi",
      "author": "earthlingsonfire1997",
      "body": "I think my ARFID is what causes me to be a hypochondriac lol",
      "created_utc": 1612989253.0,
      "score": 21,
      "context": []
    },
    {
      "id": "gmuu6f5",
      "author": "Moonflakeshadow",
      "body": "Felt this. Every time I have cold symptoms I'm like oh no. Its the consequences of my diet coming for me. This may be the end. It may sound dramatic but I did end up in a hospital and  nearly died because of all this once. Sigh",
      "created_utc": 1612988100.0,
      "score": 17,
      "context": []
    },
    {
      "id": "gmvc3pm",
      "author": "None",
      "body": "I’m okay with it shaving years off. Much like food, I have a complicated relationship with life.",
      "created_utc": 1612995807.0,
      "score": 14,
      "context": []
    },
    {
      "id": "gmv71va",
      "author": "she-huulk",
      "body": "The health fear is the #1 thing that made me start taking this seriously and forcing myself to expand my diet. I was eating so terrible/under eating in my first year of university that I stopped getting my period and a lightbulb went off like ....this isn't good. \n\nIf you're afraid enough to die, then you can (should) be brave enough to try and work on your diet.",
      "created_utc": 1612993585.0,
      "score": 18,
      "context": []
    },
    {
      "id": "gmwb1cz",
      "author": "callmedelete",
      "body": "I’ve had ARFID since I was five. I’ve suffered from malnourishment more times than I can count. I used to feel this way until about 26 when I started to actually take it seriously. \n\nI’m 30 now and I’ve come along way. I refuse to accept an early death because of this. I’m not going to let it win.",
      "created_utc": 1613013013.0,
      "score": 9,
      "context": []
    },
    {
      "id": "gmxpgja",
      "author": "LuxandGold",
      "body": "Ok, so this rings a bell with me - especially the part about diabetes. So I will tell you the same thing that my doctor said to me. \n\nI am also underweight. I'm not at my worst, but I still register as underweight. I stopped eating sugar, because I was (and still am) so afraid of diabetes. \n\nMy doctor said the amount of sugar that someone in my condition would have to consume; daily, to even become prediabetic is absurd. As in, I would have to make it my job to get it. When you're not eating much, you can feel sick pretty quickly when you start to up your caloric intake. So even forcing yourself to eat sugary things when you're already feeling sick from eating more than you usually do will mean a real feat of strength. Especially because what sugar you are eating, your body is using because we give it so little else to use.  \n\nBodies are incredibly resilient. It's truly amazing what kind of shit you can put them through only for them to bounce back and be like 'the fuck was that'. \n\nFor what it's worth, I completely relate. I truly do.",
      "created_utc": 1613050692.0,
      "score": 9,
      "context": []
    },
    {
      "id": "gmwe2n9",
      "author": "AlphaFoxZankee",
      "body": "I'm not on the undereating side of ARFID, but that's definitely a fear I struggle with. I've been eating like shit my entire life, and while so far it didn't really affect my health, I'm aware that the diabetes that runs in the family awaits me in a decade or two. \n\nI try a little bit to eat healthy, but it kinda ends up like \"You CAN eat carrots, but only THESE carrots, from a specific dish, from a specific brand, and you can't watch it being prepared or prepare it yourself, and also you have to select the carrots you CAN eat because some carrots are weird or brown and you CAN'T eat those, and also you have to be extra careful, cause the dish is carrot WITH PEAS, and you can eat peas, but not these, and peas skin is gross, so you gotta wipe your carrots to make sure there's no peas skin on it, and on top of that there's not a lot of carrots in each can, cause the peas are the main course, so it's barely a meal, and also you gotta psych yourself to not think too hard about what you're eating because you WILL throw up, and you can't eat it too often because you're gonna start thinking too hard about it\" so, yeah, I don't end up with a lot of healthy things in my diet.",
      "created_utc": 1613014624.0,
      "score": 8,
      "context": []
    },
    {
      "id": "gmuva5h",
      "author": "FrootDoll",
      "body": "I think about this all the time. I have a hormone condition that requires I eat a specific diet, problem is almost everything in that diet except meat is food that I can't stand. I'm slowly trying to expand my safe foods, but odds are I'll end up with diabetes before I can make enough healthy changes.",
      "created_utc": 1612988568.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gmvks4f",
      "author": "potatochip400",
      "body": "I wonder sometimes, doctors used to say that they didn’t understand how I could even walk, given how low my nutrient levels are, particularly iron.  I think if I go back to taking vitamin pills it’ll be fine, since it only took about 2 months for the levels to get up to normal.  That was a few years ago, I should probably take some and it will be fine.",
      "created_utc": 1612999871.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gmvcemd",
      "author": "Ok-Glass826",
      "body": "prolly die at 40 lol. whatever. giv me the skinni and the sugar yes.",
      "created_utc": 1612995941.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gnby1dr",
      "author": "MrPureinstinct",
      "body": "Between what I believe is ARFID and a generalized anxiety disorder I 100% relate to this.   \nEither I'm stressed out because my diet is poor and I assume that is going to cause problems or I will feel one thing off and my anxiety runs with it.",
      "created_utc": 1613266392.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gmyid7t",
      "author": "AchooCashew",
      "body": "Maybe. It's possible. Depending on my general mood I waver between 'probably going to die' and 'doing less than ideal but hanging in there.'\n\nFrom the cognition you referenced about sugary drinks, it sounds like you could benefit from talking to a therapist, perhaps someone who specializes in CBT.",
      "created_utc": 1613063667.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gncxcl0",
      "author": "Gullible_Educator122",
      "body": "Lmaooo MEEEE!! I’ve accepted it at this point and maybe that’s not a bad thing yknow? Our world isn’t going so well and I’d rather not experience WWIII. I’m trying to prolong my body with protein smoothies but it’s not going so hot. If you like sugary drinks, try to find a fresh fruit juice you like, at least that will have some vitamins in it. And if you aren’t start taking vitamins ASAP like omega 3, vitamin D and B and C etc. Idk how I’m still alive tbh.",
      "created_utc": 1613280721.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gmvc8fp",
      "author": "Ok-Glass826",
      "body": "me lol",
      "created_utc": 1612995865.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gohskp7",
      "author": "None",
      "body": "Well, just found this sub.  I'm 48 and one of the ones that has piled on the weight with arfid.  (seems like it's opposites and nothing in between?)  I had high blood pressure for a while but that was related to hrt treatment. GP takes one look at me and says, better do a glucose test, and every time it's normal.  As are kidneys, liver, and everything else that the NHS tests when they do a full blood test.  Do I think I'm going to pop my clogs any second? No.  Do I think I'm going to go earlier than if I was a perfect weight with perfect eating habits? Yes., probably.  But, and the big but for me is, I'm old enough to have seen a fair few people around me over the years go for many, many different reasons, and way before their time.  Sure, I worry I might not live to see grandkids or even my own kids get married. But for at least around another 10 years I can't see that my diet is going to be the reason. Eventually it will play a part in my overall quality of life.  But death comes early and without warning for some and I believe worrying about that is pointless. I understand that you might not agree but I hope you can see where I'm coming from!",
      "created_utc": 1614107270.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gmw4s6l",
      "author": "vde2027",
      "body": "omg the nursing home thing, new fear unlocked 😳",
      "created_utc": 1613009862.0,
      "score": 13,
      "context": [
        {
          "id": "gmvbyh7",
          "author": "None",
          "body": "Oh man, I could have written this. I feel certain that I will have diabetes or other illnesses bc I’ll be too overweight bc I eat like shit. Even me eating ‘healthy’ is not the actual version of eating healthy. I’ve tried to prepare for the inevitable. I can’t just never eat fruits and vegetables my entire life and not have consequences. I do have this weird scenario though that I will be older and senile and for whatever reason can’t talk and be in a hospital or nursing home and they will try to force feed me vegetables or fruits and I’ll be gagging and puking and they’ll not understand why.",
          "created_utc": 1612995743.0
        }
      ]
    },
    {
      "id": "goyf613",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1614408497.0,
      "score": 1,
      "context": [
        {
          "id": "gmvbyh7",
          "author": "None",
          "body": "Oh man, I could have written this. I feel certain that I will have diabetes or other illnesses bc I’ll be too overweight bc I eat like shit. Even me eating ‘healthy’ is not the actual version of eating healthy. I’ve tried to prepare for the inevitable. I can’t just never eat fruits and vegetables my entire life and not have consequences. I do have this weird scenario though that I will be older and senile and for whatever reason can’t talk and be in a hospital or nursing home and they will try to force feed me vegetables or fruits and I’ll be gagging and puking and they’ll not understand why.",
          "created_utc": 1612995743.0
        }
      ]
    },
    {
      "id": "gmwdwn2",
      "author": "420luv",
      "body": "Yesss me too! I always feel like I may be dying, on the cusp of full blown heart disease, feeling light headed because the diabetes has set in. I have elevated blood pressure quite regularly and I'm not sure if it's because I have constant anxiety and a high stress job, or if it's because my arteries are clogged from my safe foods. I feel like I will have a heart attack when I'm 40-45 and likely die by 65. and that makes me nervous all the time and also very sad.",
      "created_utc": 1613014533.0,
      "score": 10,
      "context": [
        {
          "id": "gmuwwfi",
          "author": "earthlingsonfire1997",
          "body": "I think my ARFID is what causes me to be a hypochondriac lol",
          "created_utc": 1612989253.0
        }
      ]
    },
    {
      "id": "gmwhu4e",
      "author": "nos4atugoddess",
      "body": "Oof I feel this. Is “passive suicide” a thing? Cause I feel like it might be a thing. Like “eh this is fine but I’m not really sure I want to renew my subscription”",
      "created_utc": 1613016685.0,
      "score": 12,
      "context": [
        {
          "id": "gmvc3pm",
          "author": "None",
          "body": "I’m okay with it shaving years off. Much like food, I have a complicated relationship with life.",
          "created_utc": 1612995807.0
        }
      ]
    },
    {
      "id": "gmwbett",
      "author": "callmedelete",
      "body": "I agree with this so much. At some point you have to take ownership of your life and not just let fears carry you into an early grave. \n\nIt’s “oh well” when your young, when you get older it’s “oh shit” because it actually starts to hit you.",
      "created_utc": 1613013206.0,
      "score": 6,
      "context": [
        {
          "id": "gmv71va",
          "author": "she-huulk",
          "body": "The health fear is the #1 thing that made me start taking this seriously and forcing myself to expand my diet. I was eating so terrible/under eating in my first year of university that I stopped getting my period and a lightbulb went off like ....this isn't good. \n\nIf you're afraid enough to die, then you can (should) be brave enough to try and work on your diet.",
          "created_utc": 1612993585.0
        }
      ]
    },
    {
      "id": "gmy1z3i",
      "author": "None",
      "body": "So, basically if we're underweight, we don't have to worry about diabetes so much?",
      "created_utc": 1613056735.0,
      "score": 1,
      "context": [
        {
          "id": "gmxpgja",
          "author": "LuxandGold",
          "body": "Ok, so this rings a bell with me - especially the part about diabetes. So I will tell you the same thing that my doctor said to me. \n\nI am also underweight. I'm not at my worst, but I still register as underweight. I stopped eating sugar, because I was (and still am) so afraid of diabetes. \n\nMy doctor said the amount of sugar that someone in my condition would have to consume; daily, to even become prediabetic is absurd. As in, I would have to make it my job to get it. When you're not eating much, you can feel sick pretty quickly when you start to up your caloric intake. So even forcing yourself to eat sugary things when you're already feeling sick from eating more than you usually do will mean a real feat of strength. Especially because what sugar you are eating, your body is using because we give it so little else to use.  \n\nBodies are incredibly resilient. It's truly amazing what kind of shit you can put them through only for them to bounce back and be like 'the fuck was that'. \n\nFor what it's worth, I completely relate. I truly do.",
          "created_utc": 1613050692.0
        }
      ]
    },
    {
      "id": "gmvmaku",
      "author": "ljgxo",
      "body": "PCOS? Because if so, me too!",
      "created_utc": 1613000627.0,
      "score": 3,
      "context": [
        {
          "id": "gmuva5h",
          "author": "FrootDoll",
          "body": "I think about this all the time. I have a hormone condition that requires I eat a specific diet, problem is almost everything in that diet except meat is food that I can't stand. I'm slowly trying to expand my safe foods, but odds are I'll end up with diabetes before I can make enough healthy changes.",
          "created_utc": 1612988568.0
        }
      ]
    },
    {
      "id": "gmwbmrz",
      "author": "callmedelete",
      "body": "Holllllllllld up. PCOS requires a specific diet? I had no idea and I’ve been diagnosed for 5+ years.",
      "created_utc": 1613013322.0,
      "score": 1,
      "context": [
        {
          "id": "gmuva5h",
          "author": "FrootDoll",
          "body": "I think about this all the time. I have a hormone condition that requires I eat a specific diet, problem is almost everything in that diet except meat is food that I can't stand. I'm slowly trying to expand my safe foods, but odds are I'll end up with diabetes before I can make enough healthy changes.",
          "created_utc": 1612988568.0
        }
      ]
    },
    {
      "id": "gncy1hx",
      "author": "Gullible_Educator122",
      "body": "Vitamins will absolutely help with what you’re missing in your diet. Give it a month or two and you will start to feel a bit better because it takes time for your body to absorb them. When I don’t take mine I feel gross and tired and fatigued.",
      "created_utc": 1613280988.0,
      "score": 3,
      "context": [
        {
          "id": "gmvks4f",
          "author": "potatochip400",
          "body": "I wonder sometimes, doctors used to say that they didn’t understand how I could even walk, given how low my nutrient levels are, particularly iron.  I think if I go back to taking vitamin pills it’ll be fine, since it only took about 2 months for the levels to get up to normal.  That was a few years ago, I should probably take some and it will be fine.",
          "created_utc": 1612999871.0
        }
      ]
    },
    {
      "id": "gn11q50",
      "author": "Universal568",
      "body": "Same, I'm 17 and already worrying about a super early death from my horrible diet, now I'm scared that if I do grow old someones gonna try and force me to eat things I absolutely hate(aka 90% of foods)",
      "created_utc": 1613107441.0,
      "score": 9,
      "context": [
        {
          "id": "gmvbyh7",
          "author": "None",
          "body": "Oh man, I could have written this. I feel certain that I will have diabetes or other illnesses bc I’ll be too overweight bc I eat like shit. Even me eating ‘healthy’ is not the actual version of eating healthy. I’ve tried to prepare for the inevitable. I can’t just never eat fruits and vegetables my entire life and not have consequences. I do have this weird scenario though that I will be older and senile and for whatever reason can’t talk and be in a hospital or nursing home and they will try to force feed me vegetables or fruits and I’ll be gagging and puking and they’ll not understand why.",
          "created_utc": 1612995743.0
        },
        {
          "id": "gmw4s6l",
          "author": "vde2027",
          "body": "omg the nursing home thing, new fear unlocked 😳",
          "created_utc": 1613009862.0
        }
      ]
    },
    {
      "id": "gp0lyez",
      "author": "None",
      "body": "37",
      "created_utc": 1614438475.0,
      "score": 1,
      "context": [
        {
          "id": "gmvbyh7",
          "author": "None",
          "body": "Oh man, I could have written this. I feel certain that I will have diabetes or other illnesses bc I’ll be too overweight bc I eat like shit. Even me eating ‘healthy’ is not the actual version of eating healthy. I’ve tried to prepare for the inevitable. I can’t just never eat fruits and vegetables my entire life and not have consequences. I do have this weird scenario though that I will be older and senile and for whatever reason can’t talk and be in a hospital or nursing home and they will try to force feed me vegetables or fruits and I’ll be gagging and puking and they’ll not understand why.",
          "created_utc": 1612995743.0
        },
        {
          "id": "goyf613",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1614408497.0
        }
      ]
    },
    {
      "id": "gncxq6k",
      "author": "Gullible_Educator122",
      "body": "Yeah I feel that. It’s almost like a low grade depression that’s just there lingering in the background, but it hasn’t messed up your life yet.",
      "created_utc": 1613280872.0,
      "score": 2,
      "context": [
        {
          "id": "gmvc3pm",
          "author": "None",
          "body": "I’m okay with it shaving years off. Much like food, I have a complicated relationship with life.",
          "created_utc": 1612995807.0
        },
        {
          "id": "gmwhu4e",
          "author": "nos4atugoddess",
          "body": "Oof I feel this. Is “passive suicide” a thing? Cause I feel like it might be a thing. Like “eh this is fine but I’m not really sure I want to renew my subscription”",
          "created_utc": 1613016685.0
        }
      ]
    },
    {
      "id": "gn12je8",
      "author": "Universal568",
      "body": "Also agree, I've finally started to slowly force myself to eat vegetables cause a bunch of medical stuff just slapped me in the face all at once. I don't really mind dying at first, but then I got really scared for other reasons, like if I left  my family, they would be absolutely devastated.  I would never want to put them through that kind of grief, I love them too much to hurt them like that.",
      "created_utc": 1613107969.0,
      "score": 4,
      "context": [
        {
          "id": "gmv71va",
          "author": "she-huulk",
          "body": "The health fear is the #1 thing that made me start taking this seriously and forcing myself to expand my diet. I was eating so terrible/under eating in my first year of university that I stopped getting my period and a lightbulb went off like ....this isn't good. \n\nIf you're afraid enough to die, then you can (should) be brave enough to try and work on your diet.",
          "created_utc": 1612993585.0
        },
        {
          "id": "gmwbett",
          "author": "callmedelete",
          "body": "I agree with this so much. At some point you have to take ownership of your life and not just let fears carry you into an early grave. \n\nIt’s “oh well” when your young, when you get older it’s “oh shit” because it actually starts to hit you.",
          "created_utc": 1613013206.0
        }
      ]
    },
    {
      "id": "gmy4kye",
      "author": "LuxandGold",
      "body": "Pretty much. I mean, I'm not a medical professional, so I could be wrong, but she did make it clear to me that I'd really have to be shovelling down the sugar by the truckload. \n\nEveryone is different, so what applies to you may not apply to me, but the amount of sugar you have to consume to even become pre-diabetic is a lot. More than our ED addled brains think is 'a lot'. \n\nI mean, she didn't recommend doing this, but she said even if I had a full sugar can of coke for breakfast, lunch, dinner, and two snacks, I'd still not be consuming enough right now. (That's if we can even consume it, I'd feel sick after two from the sweetness.) \n\nWhen we don't give our bodies proper fuel to function - which being underweight, we don't, we force our bodies to burn everything - muscle, organs, *everything*. What happens is that when we do eat, our bodies jump on top of it immediately and put it to use. Sugar is just energy. It isn't proper nourishment, but it's energy. \n\nWe are effectively constantly running on empty. Once we hit a normal weight - a healthy weight for our body types, then we need to be more concerned about sugar intake.",
      "created_utc": 1613057882.0,
      "score": 2,
      "context": [
        {
          "id": "gmxpgja",
          "author": "LuxandGold",
          "body": "Ok, so this rings a bell with me - especially the part about diabetes. So I will tell you the same thing that my doctor said to me. \n\nI am also underweight. I'm not at my worst, but I still register as underweight. I stopped eating sugar, because I was (and still am) so afraid of diabetes. \n\nMy doctor said the amount of sugar that someone in my condition would have to consume; daily, to even become prediabetic is absurd. As in, I would have to make it my job to get it. When you're not eating much, you can feel sick pretty quickly when you start to up your caloric intake. So even forcing yourself to eat sugary things when you're already feeling sick from eating more than you usually do will mean a real feat of strength. Especially because what sugar you are eating, your body is using because we give it so little else to use.  \n\nBodies are incredibly resilient. It's truly amazing what kind of shit you can put them through only for them to bounce back and be like 'the fuck was that'. \n\nFor what it's worth, I completely relate. I truly do.",
          "created_utc": 1613050692.0
        },
        {
          "id": "gmy1z3i",
          "author": "None",
          "body": "So, basically if we're underweight, we don't have to worry about diabetes so much?",
          "created_utc": 1613056735.0
        }
      ]
    },
    {
      "id": "gmvnn49",
      "author": "FrootDoll",
      "body": "Yes!",
      "created_utc": 1613001301.0,
      "score": 2,
      "context": [
        {
          "id": "gmuva5h",
          "author": "FrootDoll",
          "body": "I think about this all the time. I have a hormone condition that requires I eat a specific diet, problem is almost everything in that diet except meat is food that I can't stand. I'm slowly trying to expand my safe foods, but odds are I'll end up with diabetes before I can make enough healthy changes.",
          "created_utc": 1612988568.0
        },
        {
          "id": "gmvmaku",
          "author": "ljgxo",
          "body": "PCOS? Because if so, me too!",
          "created_utc": 1613000627.0
        }
      ]
    },
    {
      "id": "gmwcaku",
      "author": "FrootDoll",
      "body": "Not everyone with PCOS has to be on a special diet, but one of the possible symptoms is insulin resistance, so I don't process sugars and carbs correctly.",
      "created_utc": 1613013668.0,
      "score": 3,
      "context": [
        {
          "id": "gmuva5h",
          "author": "FrootDoll",
          "body": "I think about this all the time. I have a hormone condition that requires I eat a specific diet, problem is almost everything in that diet except meat is food that I can't stand. I'm slowly trying to expand my safe foods, but odds are I'll end up with diabetes before I can make enough healthy changes.",
          "created_utc": 1612988568.0
        },
        {
          "id": "gmwbmrz",
          "author": "callmedelete",
          "body": "Holllllllllld up. PCOS requires a specific diet? I had no idea and I’ve been diagnosed for 5+ years.",
          "created_utc": 1613013322.0
        }
      ]
    },
    {
      "id": "gp0m4f3",
      "author": "None",
      "body": "I’m sorry I gave you another anxiety",
      "created_utc": 1614438535.0,
      "score": 2,
      "context": [
        {
          "id": "gmvbyh7",
          "author": "None",
          "body": "Oh man, I could have written this. I feel certain that I will have diabetes or other illnesses bc I’ll be too overweight bc I eat like shit. Even me eating ‘healthy’ is not the actual version of eating healthy. I’ve tried to prepare for the inevitable. I can’t just never eat fruits and vegetables my entire life and not have consequences. I do have this weird scenario though that I will be older and senile and for whatever reason can’t talk and be in a hospital or nursing home and they will try to force feed me vegetables or fruits and I’ll be gagging and puking and they’ll not understand why.",
          "created_utc": 1612995743.0
        },
        {
          "id": "gmw4s6l",
          "author": "vde2027",
          "body": "omg the nursing home thing, new fear unlocked 😳",
          "created_utc": 1613009862.0
        },
        {
          "id": "gn11q50",
          "author": "Universal568",
          "body": "Same, I'm 17 and already worrying about a super early death from my horrible diet, now I'm scared that if I do grow old someones gonna try and force me to eat things I absolutely hate(aka 90% of foods)",
          "created_utc": 1613107441.0
        }
      ]
    },
    {
      "id": "gmxuaa9",
      "author": "ljgxo",
      "body": "It’s so hard isn’t it. My diet consists of carbs and... well that’s it really as I’m also a vegetarian (more arfid based than belief based) and it’s so so hard.",
      "created_utc": 1613053210.0,
      "score": 3,
      "context": [
        {
          "id": "gmuva5h",
          "author": "FrootDoll",
          "body": "I think about this all the time. I have a hormone condition that requires I eat a specific diet, problem is almost everything in that diet except meat is food that I can't stand. I'm slowly trying to expand my safe foods, but odds are I'll end up with diabetes before I can make enough healthy changes.",
          "created_utc": 1612988568.0
        },
        {
          "id": "gmvmaku",
          "author": "ljgxo",
          "body": "PCOS? Because if so, me too!",
          "created_utc": 1613000627.0
        },
        {
          "id": "gmvnn49",
          "author": "FrootDoll",
          "body": "Yes!",
          "created_utc": 1613001301.0
        }
      ]
    }
  ]
}