{
  "id": "m19j8g",
  "subreddit": "ARFID",
  "author": "DistractedScholar34",
  "created_utc": 1615305782.0,
  "title": "I relate to this on a spiritual level",
  "selftext": "",
  "url": "https://i.redd.it/zvkjk4d5j0m61.jpg",
  "score": 215,
  "num_comments": 14,
  "comments": [
    {
      "id": "gqczhib",
      "author": "LuxandGold",
      "body": "I am so lucky I can eat all of those fruits! \n\nWith strawberries, grip the stem hard, and then twist slightly, you can pull the entire centre part out as well. Then eat it. Only savages eat strawberries with the stem still in.",
      "created_utc": 1615316476.0,
      "score": 15,
      "context": []
    },
    {
      "id": "gqd2817",
      "author": "FurretsOotersMinks",
      "body": "Apples have to be peeled, I can't stand chewing the weird ass skin for way too long, but I can do it if I have to. \n\nStrawberries and bananas are cool af as long as they're not mushy from bruising or overripe.\n\nI can't drink orange juice straight, but I'll suck the juice out of an orange and won't eat the pulp. I don't know why either. \n\nBlueberries are too dicey, they're weird and mushy all the time.",
      "created_utc": 1615317716.0,
      "score": 13,
      "context": []
    },
    {
      "id": "gqdwd8l",
      "author": "None",
      "body": "Okay but strawberries are way too seedy",
      "created_utc": 1615331433.0,
      "score": 8,
      "context": []
    },
    {
      "id": "gqcl3gx",
      "author": "axw3555",
      "body": "I'll eat an apple no problem. Strawberries I just cut off the top with the stem. The rest... blegh.",
      "created_utc": 1615309947.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gqdlz63",
      "author": "Neocactus",
      "body": "I'm putting a spoiler over this to avoid possibly ruining a safe food for someone, but\n\n>!Have you guys seen the videos of bugs that come out of strawberries when they're put in salt water? I was going to try eating them, but then I saw those videos, anddd now I'm not sure if I wanna do that anytime soon...!<",
      "created_utc": 1615326494.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gqekmtk",
      "author": "TheConsciousness",
      "body": "Chopped strawberries dipped in sugar\nGotta peel those apples too. ain't got time to eat that nasty skin!",
      "created_utc": 1615344284.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gqe40pl",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1615335407.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gqfvr5s",
      "author": "xkimberlyrenee",
      "body": "Food is just too much damn work sometimes.",
      "created_utc": 1615381181.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gqeqffk",
      "author": "LadyOfTheMay",
      "body": "Understandable. Although I've always been able to eat strawberries and bananas. These are also the easiest ones to overcome because you just pick off the stem or eat nanas before they get this brown. \n\nI don't eat oranges often for this reason and if I do it will be one or 2 segments of my bf's orange and I have to pick off all the pith and just suck the juice out. I drink a glass of OJ every day though so I don't feel like I'm missing out. \n\nI can eat an apple but not if I have to bite into it, because it gets stuck in my teeth when I do and I hate the sensation. I can eat one that is cut up though... My boyfriend often does this for me. \n\nAnd finally blueberries... I used to think they were gross as a kid for this reason. I can eat them now but there are usually a few bad ones that I just don't eat.\n\nI guess we all have our reasons though. No 2 people with ARFID will have the same food rules but there is a lot of similarities between us.",
      "created_utc": 1615347552.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gqexh8p",
      "author": "brigidodo",
      "body": "You can eat strawberry stems. Oranges are sticky, though and make my skin rashy",
      "created_utc": 1615351953.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gqf7m16",
      "author": "na0202",
      "body": "i love eating clementines but i cannot STAND the smell of orange on my hand after i peel them. i literally cant touch anything after",
      "created_utc": 1615359812.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gqeq6kp",
      "author": "macandcheese234",
      "body": "This is my same exact thought process with these fruits 😂",
      "created_utc": 1615347406.0,
      "score": 4,
      "context": [
        {
          "id": "gqd2817",
          "author": "FurretsOotersMinks",
          "body": "Apples have to be peeled, I can't stand chewing the weird ass skin for way too long, but I can do it if I have to. \n\nStrawberries and bananas are cool af as long as they're not mushy from bruising or overripe.\n\nI can't drink orange juice straight, but I'll suck the juice out of an orange and won't eat the pulp. I don't know why either. \n\nBlueberries are too dicey, they're weird and mushy all the time.",
          "created_utc": 1615317716.0
        }
      ]
    },
    {
      "id": "gqhatms",
      "author": "earthlingsonfire1997",
      "body": "For me I can only drink smoothies that are fast food smoothies. Homemade ones taste waaaay too earthy and natural tasting for me (not sure if that is the issue for you). For me I started with a Panera strawberry smoothie because it tastes like strawberry yogurt to me. After that I branched out to tropical smoothie because it is super blended and tastes like candy",
      "created_utc": 1615403043.0,
      "score": 2,
      "context": [
        {
          "id": "gqe40pl",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1615335407.0
        }
      ]
    },
    {
      "id": "gr37zzh",
      "author": "amh8011",
      "body": "Idk if you like oatmeal or anything but I’ve found slow cooking oatmeal and putting like half an apple sliced up while its cooking makes the apple melt or something. I put a bunch of cinnamon and like a tablespoon or two of maple syrup in and I can’t even taste the apple.\n\nIdk if it makes a difference but I use steel cut oats and put 2 parts liquid (milk, water, nut milk, etc. but I like milk) and 1 part oats. I toast the oats in butter on the stove, stirring them for about a minute, then pour in the liquid and turn the stove down as low as it will go (I have a gas stove so I just turn it until there is barely any flame). Then I add the cinnamon, maple syrup, apples and whatever else I wanna put in and cover it with a lid. It usually takes like 45min-1hr for it to be ready. Its not the easiest meal in terms of effort but I like it. I have a major sweet tooth and I think it tastes like a dessert.\n\nThat was kinda long, sorry. But if you like apple pie you might like that. Another idea is applesauce and lots of cinnamon. Apples are one of the few fruits I’ll eat but usually they require cinnamon for me to actually like them.",
      "created_utc": 1615867698.0,
      "score": 2,
      "context": [
        {
          "id": "gqe40pl",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1615335407.0
        }
      ]
    }
  ]
}