{
  "id": "mccb06",
  "subreddit": "ARFID",
  "author": "feyre_0001",
  "created_utc": 1616609051.0,
  "title": "I’m 25 and can finally eat apples!!!",
  "selftext": "Fruits and veggies have been two of the biggest triggers of my ARFID- something about their texture really messes with me. Really only soft textures like bananas and potatoes or things I could cut up real small and swallow, like carrots or green beans, could be tolerated. However, the other day my aunt peeled&sliced an apple and I was able to eat the whole thing! No gagging, puking, or nausea! I can’t wait to start branching out and trying other fruits raw. 💕",
  "url": "https://www.reddit.com/r/ARFID/comments/mccb06/im_25_and_can_finally_eat_apples/",
  "score": 94,
  "num_comments": 7,
  "comments": [
    {
      "id": "gs2yojc",
      "author": "chernobeel_",
      "body": "good job, i'm happy that you could do it. keep it up :D",
      "created_utc": 1616612605.0,
      "score": 7,
      "context": []
    },
    {
      "id": "gs2yuvm",
      "author": "BananasDramas",
      "body": "Yay that’s amazing! So pleased you were able to eat the whole thing, onwards and upwards 💕",
      "created_utc": 1616612677.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gs3b9qe",
      "author": "FiguringItOut--",
      "body": "This is awesome! Great job! I grew up *hating* fruit and anything fruit-flavored. I've found that my palate has changed as an adult, and I like things I absolutely hated as a kid (like apples and bananas!) Keep trying when you feel up to it; you never know what you could end up liking :)",
      "created_utc": 1616617833.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gs55py5",
      "author": "BDC_Arvak",
      "body": "Congrats. I never think fruit will be possible for me but this gives me hope",
      "created_utc": 1616653573.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gs76u4d",
      "author": "WoodWideWeb",
      "body": "YAY!!!! I only tried apples for the first time when I was 20ish and I'm 24 now. I loved applesauce/juice but the apple texture was too much for so long. Definitely try to cut things up! I've also found eating multiple fruits at once, one being familiar, (so like a bite of apple with a blueberry or a bite of strawberry) helps a lot since you already know what some of the texture/taste will be.\n\nI am so proud of you 🌟🌟🌟",
      "created_utc": 1616696000.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gs7gfyg",
      "author": "None",
      "body": "I'm in the same boat. I'm not diagnosed so i'm not gonna say I'm the same. But the textures of fruit and vegetables really make me gag. I really don't understand it, some tastes are terrible, i really can only eat soft mushy carrots in soup, but peas or anything like that nope. When i see the color green i turn away. Bananas are just disgusting.",
      "created_utc": 1616699930.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gs76xtt",
      "author": "WoodWideWeb",
      "body": "One day at a time! I believe in you and I'm rooting for you ❤️",
      "created_utc": 1616696043.0,
      "score": 2,
      "context": [
        {
          "id": "gs55py5",
          "author": "BDC_Arvak",
          "body": "Congrats. I never think fruit will be possible for me but this gives me hope",
          "created_utc": 1616653573.0
        }
      ]
    }
  ]
}