{
  "id": "mpjcai",
  "subreddit": "ARFID",
  "author": "Raccoon_on_acid_",
  "created_utc": 1618250123.0,
  "title": "The Story of my Life",
  "selftext": "",
  "url": "https://i.redd.it/qiwyo9ju6ss61.png",
  "score": 425,
  "num_comments": 5,
  "comments": [
    {
      "id": "guaw33o",
      "author": "GingerMariel",
      "body": "So tired of hearing that I was a picky or fussy eater when I was a kid. What people don’t understand is that I DON’T WANT TO BE THIS WAY! I’m not being “fussy” when I don’t eat something, I don’t eat it because I CAN’T eat it! I was constantly being yelled at or punished because I wouldn’t eat foods that I hated. I now have 3 eating disorders including ARFID! One frequent punishment was going to bed immediately after supper and not read or play with toys while my friends and brothers played right outside of my window while I cried in bed. Thanks for reading my rant because I’m crying while I type this and it’s probably cathartic. Oh, I’m 63 years old.",
      "created_utc": 1618263488.0,
      "score": 47,
      "context": []
    },
    {
      "id": "gubrm6j",
      "author": "nighttcity",
      "body": "My doctors ignored me for 10 plus years whenever I mentioned my symptoms and how they were getting worse and then as soon as I signed myself up for therapy they called us saying “well you can’t do that without approval!1!!1!!” As soon as I try to get help on my own they stepped in as if they weren’t just telling me “it’ll go away on its own!” for my whole life lololol",
      "created_utc": 1618279764.0,
      "score": 13,
      "context": []
    },
    {
      "id": "gud5aue",
      "author": "None",
      "body": "More like, \"Is this a phase?\"\n25 years later and it definitely wasn't \"just a phase\".",
      "created_utc": 1618318090.0,
      "score": 8,
      "context": []
    },
    {
      "id": "gud5o93",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1618318303.0,
      "score": -1,
      "context": []
    },
    {
      "id": "gudr45q",
      "author": "okokokokok11111",
      "body": "*hugs* I'm so sorry that's caused you so much pain. I know what you mean about \"won't\" vs \"can't.\" Red and green peppers smell amazing, but I just can't handle the crunch. I know I used to like fresh tomatoes, I have distinct memories of the delicious flavors of toast and tomato sandwiches, but after a bad one I still can't tolerate them. So much food smells delicious at Asian restaurants, but I'm afraid to try so much of it because it might be too spicy or full of crunchy vegetables.\n\nI'm in an odd position where my ARFID has improved over time, and I'm able to eat a lot more foods than I could when younger. I have a friend (also has ARFID) who I met since my ARFID improved, and I don't think he believes me that until relatively recently, my diet was almost identical to his - beige foods, not much else. At least most people don't see me as \"picky\" anymore? I still feel pretty restricted on what I'm able to eat, though.",
      "created_utc": 1618328557.0,
      "score": 6,
      "context": [
        {
          "id": "guaw33o",
          "author": "GingerMariel",
          "body": "So tired of hearing that I was a picky or fussy eater when I was a kid. What people don’t understand is that I DON’T WANT TO BE THIS WAY! I’m not being “fussy” when I don’t eat something, I don’t eat it because I CAN’T eat it! I was constantly being yelled at or punished because I wouldn’t eat foods that I hated. I now have 3 eating disorders including ARFID! One frequent punishment was going to bed immediately after supper and not read or play with toys while my friends and brothers played right outside of my window while I cried in bed. Thanks for reading my rant because I’m crying while I type this and it’s probably cathartic. Oh, I’m 63 years old.",
          "created_utc": 1618263488.0
        }
      ]
    },
    {
      "id": "gudsgi5",
      "author": "okokokokok11111",
      "body": "The four \"picky eaters\" I've met (myself included) definitely had/have ARFID. You might have very different experiences from mine, given I'm autistic and not the most social person, but I feel like that's a bit of a sweeping statement.",
      "created_utc": 1618329148.0,
      "score": 3,
      "context": [
        {
          "id": "gud5o93",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1618318303.0
        }
      ]
    }
  ]
}