{
  "id": "mw23yi",
  "subreddit": "ARFID",
  "author": "c21h30o2--",
  "created_utc": 1619088686.0,
  "title": "Let me live",
  "selftext": "Often people act like I’m missing out on so much because I don’t eat meat, really flavourful things, or foods with weird textures, which eliminates most “meals.” But to be honest, I like the foods that I eat. They taste good to me and I enjoy them. I have no desire to force myself to eat something that I know I won’t like. I would rather politely decline food than gag at a dinner party. I would much rather snack on my safe foods throughout the day than eat a giant meal and feel sick afterwards.\n\nThere’s such an emphasis on “getting over” eating disorders. Everyone wants me to change so that I can experience more foods, but the truth is, I don’t want to. My issues are sensory so I’m confident in knowing what I can and can’t eat. If something has a texture that I know will bother me, there’s no way I’m going to put myself through that for the “experience.” I’m perfectly happy to try a new combination of safe foods, or a new food that is similar to my safe foods, or even something totally different, so long as I make the choice myself and I’m not pressured into it. \n\nA lot of people view this as me “giving up on recovery,” but I don’t see it that way at all. I have enough foods that I like and I take vitamins to stay healthy. I’m not the embodiment of health, but what 21 year old is? I just want to live my life, eating food that I like, when I like, without people making comments about my food or my body. \n\nObviously this doesn’t apply to anyone and I don’t want to discourage others from expanding their diet or trying new things. The point is that what you eat is your own choice!",
  "url": "https://www.reddit.com/r/ARFID/comments/mw23yi/let_me_live/",
  "score": 94,
  "num_comments": 7,
  "comments": [
    {
      "id": "gvfrr9g",
      "author": "grimmistired",
      "body": "Yeah you don't just get over a sensory disorder.  They're lifelong.  Wish people knew that",
      "created_utc": 1619095414.0,
      "score": 29,
      "context": []
    },
    {
      "id": "gvgeqwo",
      "author": "RoyalSeraph",
      "body": "There's a misconception that ARFID is mostly psychological and I believed it myslef too for most of my life. This is why people still think that it can be \"cured\" the same way you'd help people out of other more famous EDs I won't name, and this is exactly why I never dare mentioning it as an ED next to people. I know for sure that if I say it's an ED they will think I'm anorexic and have a few hollywood blockbusters running through their minds.",
      "created_utc": 1619106112.0,
      "score": 15,
      "context": []
    },
    {
      "id": "gvh0vxc",
      "author": "RainSmile",
      "body": "I remind people what I could be reverting to and how much progress I have actually made. \nOnce you validate yourself out loud to people you might find you start to feel more empowered. \n\nWhen people treat me similar to how you have described it is minimizing my real efforts. You don’t have to move so fast that others see it as progress. Progress is slow and ARFID can’t be “cured” only managed. \n\nI actually cut people out of my life for good who expected immediate change from me in multiple areas of my life. \n\nIt’s a lengthy process and no one should dictate it. If you are currently healthier than you were, this is a step forward. You can take breaks but acknowledge that you have not regressed. \nIf you have regressed, you will know where to focus because you know yourself best. \n\nI do worry about people posting here for validation as a soft-core place to self-check because this sub is heavily focused on continuous improvement, but I like to give people the benefit of the doubt at the same time because it is tough receiving this kind of constant nagging and criticism from people who don’t get it.",
      "created_utc": 1619115291.0,
      "score": 7,
      "context": []
    },
    {
      "id": "gvg20yy",
      "author": "Actually_Andrea",
      "body": "How do they treat EDs caused by sensory issues? I saw more than a couple research papers about how standard ED treatment can be ineffective or even damaging to autistic patients, who do not have body image issues but are most likely experiencing a variety of sensory difficulties.",
      "created_utc": 1619100633.0,
      "score": 8,
      "context": []
    },
    {
      "id": "gvg9p5y",
      "author": "c21h30o2--",
      "body": "I don’t think that modern medicine has an effective treatment for sensory eating disorders, which is probably because they’re under researched in comparison to body image eating disorders. I think standard ED treatment is too focused on body image to benefit people with sensory issues.",
      "created_utc": 1619103987.0,
      "score": 13,
      "context": [
        {
          "id": "gvg20yy",
          "author": "Actually_Andrea",
          "body": "How do they treat EDs caused by sensory issues? I saw more than a couple research papers about how standard ED treatment can be ineffective or even damaging to autistic patients, who do not have body image issues but are most likely experiencing a variety of sensory difficulties.",
          "created_utc": 1619100633.0
        }
      ]
    },
    {
      "id": "gvhwze1",
      "author": "okokokokok11111",
      "body": "They do, but it's primarily targeted at children. I was actually quite pleasantly surprised at how slow the treatment process is, and how much it's adapted to the child being treated. It doesn't expect the child to make leaps and bounds in what they can tolerate - the goal is to target one food at a time, starting with the most minute exposure (pea sized amount on their plate, they don't even need to touch it), with veeery gradual increases in exposure (touch it with fork, touch with finger, lift it, touch to lips, taste it, put it in mouth/chew once/spit, chew thoroughly and spit, then finally eat a pea sized amount). I think there's also steps where you just play with food, with zero pressure to eat it. I'd link to a page on it, but I can't remember the exact name of the therapy - and of course, with broad searches, it comes up with references to \"picky eating.\" 🙄",
      "created_utc": 1619129115.0,
      "score": 5,
      "context": [
        {
          "id": "gvg20yy",
          "author": "Actually_Andrea",
          "body": "How do they treat EDs caused by sensory issues? I saw more than a couple research papers about how standard ED treatment can be ineffective or even damaging to autistic patients, who do not have body image issues but are most likely experiencing a variety of sensory difficulties.",
          "created_utc": 1619100633.0
        },
        {
          "id": "gvg9p5y",
          "author": "c21h30o2--",
          "body": "I don’t think that modern medicine has an effective treatment for sensory eating disorders, which is probably because they’re under researched in comparison to body image eating disorders. I think standard ED treatment is too focused on body image to benefit people with sensory issues.",
          "created_utc": 1619103987.0
        }
      ]
    },
    {
      "id": "gvjav13",
      "author": "sassybleu",
      "body": "Sounds like exposure therapy",
      "created_utc": 1619155960.0,
      "score": 1,
      "context": [
        {
          "id": "gvg20yy",
          "author": "Actually_Andrea",
          "body": "How do they treat EDs caused by sensory issues? I saw more than a couple research papers about how standard ED treatment can be ineffective or even damaging to autistic patients, who do not have body image issues but are most likely experiencing a variety of sensory difficulties.",
          "created_utc": 1619100633.0
        },
        {
          "id": "gvg9p5y",
          "author": "c21h30o2--",
          "body": "I don’t think that modern medicine has an effective treatment for sensory eating disorders, which is probably because they’re under researched in comparison to body image eating disorders. I think standard ED treatment is too focused on body image to benefit people with sensory issues.",
          "created_utc": 1619103987.0
        },
        {
          "id": "gvhwze1",
          "author": "okokokokok11111",
          "body": "They do, but it's primarily targeted at children. I was actually quite pleasantly surprised at how slow the treatment process is, and how much it's adapted to the child being treated. It doesn't expect the child to make leaps and bounds in what they can tolerate - the goal is to target one food at a time, starting with the most minute exposure (pea sized amount on their plate, they don't even need to touch it), with veeery gradual increases in exposure (touch it with fork, touch with finger, lift it, touch to lips, taste it, put it in mouth/chew once/spit, chew thoroughly and spit, then finally eat a pea sized amount). I think there's also steps where you just play with food, with zero pressure to eat it. I'd link to a page on it, but I can't remember the exact name of the therapy - and of course, with broad searches, it comes up with references to \"picky eating.\" 🙄",
          "created_utc": 1619129115.0
        }
      ]
    }
  ]
}