{
  "id": "mxbmg5",
  "subreddit": "ARFID",
  "author": "bobainwonderland",
  "created_utc": 1619234337.0,
  "title": "I ate something today that I would usually 100% never eat.",
  "selftext": "I’m not 100% sure if this is a TW but before tonight it would have been one of mine. Little victory for me. Just don’t wanna bother anyone. \n\nI ate a chicken wing. On the bone. I’ve never been totally against meat- I’d eat ground beef, or chicken if breaded and off the bone. Something about bones. Brings me into a weird place. \n\nTonight I had my first outside work function with my new boss and his family. They ordered appetizers and one was wings. I told myself, “one bite at least- don’t be rude. These people barely know you”. I get anxiety eating in front of people and had hoped for a more dinner setting rather than family style share apps. Oof. \nSo I took a bite. And didn’t feel too bad. Was able to have bites of soft warm good pretzel in between. And found myself reaching for a second. I def didn’t get close to bone but it was a first and I’m a little proud of myself (let’s face it. A lot.). \n\nDidn’t know who to tell. Thanks for listening. Xx.",
  "url": "https://www.reddit.com/r/ARFID/comments/mxbmg5/i_ate_something_today_that_i_would_usually_100/",
  "score": 87,
  "num_comments": 11,
  "comments": [
    {
      "id": "gvnb6lm",
      "author": "iloveyoumiri",
      "body": "This was my second step in dealing with ARFID! The first was eating boneless wings with sauce on them. I’ve been over it for 3 years and counting now, and this was a huge step. Proud of you <3",
      "created_utc": 1619237241.0,
      "score": 17,
      "context": []
    },
    {
      "id": "gvnd2gb",
      "author": "Notacoolbro",
      "body": "Good job!!",
      "created_utc": 1619238484.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gvnryl4",
      "author": "sugaredsnickerdoodle",
      "body": "I used to eat JUST the skin off of chicken wings, and for a long time I would just nibble at the meat around it without getting close to the center, but now I can clear the whole wing! The only thing I try to avoid eating is the veins cause they creep me out lol. It's all baby steps! Good work!",
      "created_utc": 1619250944.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gvnyguu",
      "author": "AbundantiaTheWitch",
      "body": "Amazing! I hate bones so much out recently I’ve been able to each chicken breast with the bone and it’s so good. I really proud of you",
      "created_utc": 1619257499.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gvn8w9h",
      "author": "None",
      "body": "Oh you have been missing out!! Anything cooked with bone tastes so much better! The collagen gives it nice stickiness and more minerals and vitamins. Keep doing baby steps!",
      "created_utc": 1619235773.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gvqm7pu",
      "author": "None",
      "body": "I used to have a big issue with this too. I still never go at it with my teeth, I separate the meat with my fingers, but I'm at a point were I can debone an entire (not literaly) chicken to make stock as long as it's already cooked.",
      "created_utc": 1619291307.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gvun7oc",
      "author": "The_Metal_fish",
      "body": "Good job, stranger here who stumbled across this sub and am now reading to see if it'll happen me understand my bf's eating issues \n\nBe proud of yourself a step is a step no mater how small.",
      "created_utc": 1619379826.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h1sjqmt",
      "author": "Hot-Beginning2696",
      "body": "This is amazing wow !!! You go I never could eat those wings",
      "created_utc": 1623715881.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gvq27bk",
      "author": "BafometsMenstrualJiz",
      "body": "YOOOOO HELL YEAH",
      "created_utc": 1619281578.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gvnvsoz",
      "author": "bobainwonderland",
      "body": "Thank you! This helps!! Really. I felt so lost with food before this group. Thank you everyone. Wrote this on a whim, out of minor “omg did I do a thing without realizing I did a thing” moment.",
      "created_utc": 1619254768.0,
      "score": 4,
      "context": [
        {
          "id": "gvnryl4",
          "author": "sugaredsnickerdoodle",
          "body": "I used to eat JUST the skin off of chicken wings, and for a long time I would just nibble at the meat around it without getting close to the center, but now I can clear the whole wing! The only thing I try to avoid eating is the veins cause they creep me out lol. It's all baby steps! Good work!",
          "created_utc": 1619250944.0
        }
      ]
    },
    {
      "id": "gvo1xjg",
      "author": "AMerrickanGirl",
      "body": "I don’t have ARFID and I wouldn’t eat the veins either.  The dog gets that stuff.",
      "created_utc": 1619259524.0,
      "score": 2,
      "context": [
        {
          "id": "gvnryl4",
          "author": "sugaredsnickerdoodle",
          "body": "I used to eat JUST the skin off of chicken wings, and for a long time I would just nibble at the meat around it without getting close to the center, but now I can clear the whole wing! The only thing I try to avoid eating is the veins cause they creep me out lol. It's all baby steps! Good work!",
          "created_utc": 1619250944.0
        }
      ]
    }
  ]
}