{
  "id": "ne3lvc",
  "subreddit": "ARFID",
  "author": "None",
  "created_utc": 1621215948.0,
  "title": "My boyfriend purposefully ordered me a burger with all the vegetables and thought I could just take them off....",
  "selftext": "I was mudding drywall for 7 straight hours today, so I was exhausted and looking forward to dinner. Waited forever, then the food got here. \n\nI opened the container and saw a burger with ALL THE STUFF. Onion, lettuce, tomato, etc. I gasped in horror. My boyfriend started taking all the stuff off. I said I couldn't eat it, he didn't listen. Kept \"cleaning\" it. He said to just try it. I said I absolutely could not. It was ruined. It was very distressing to have that pressure. Finally, he let it go. \n\nThen I realized that he wasn't surprised at all when it had the vegetables. I asked if he ordered it plain. \n\nHe said \"I thought I could just take all the stuff off.\" He wanted the vegetables for his own burger. \n\nI could have cried. I don't get to eat dinner tonight because of a choice my boyfriend made. Not anyone's mistake. We've been together for four years, so I was surprised he thought that was okay. \n\nI'm not angry at him. Just disappointed. It was an airhead thing he did. He's otherwise very thoughtful. Just WTF. I hate this whole situation. I hate this disorder. I hate how difficult it is for people to understand.",
  "url": "https://www.reddit.com/r/ARFID/comments/ne3lvc/my_boyfriend_purposefully_ordered_me_a_burger/",
  "score": 194,
  "num_comments": 35,
  "comments": [
    {
      "id": "gyeex5f",
      "author": "killrtaco",
      "body": "My girlfriend literally didn't understand why I was mad when I got a tomato in my burger yesterday when I asked for no tomato. Like it still leaves some taste and residue! It's gross! It's better than eating it with everything on anyway, but it's not the same as if they didn't put it on at all",
      "created_utc": 1621220022.0,
      "score": 51,
      "context": []
    },
    {
      "id": "gye81t7",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1621216600.0,
      "score": 60,
      "context": []
    },
    {
      "id": "gye9txs",
      "author": "Dethanatos",
      "body": "My wife and I have been together for almost 8 years, and stuff like this still happens from time to time. It really is hard for people to understand. She genuinely does try to understand, so I am never mad at her when things don't go right...that being said it still feels bad.",
      "created_utc": 1621217484.0,
      "score": 26,
      "context": []
    },
    {
      "id": "gyeg9n6",
      "author": "feyre_0001",
      "body": "I think of situations like this the same way I think of cross-contamination. In all of the kitchen’s I’ve worked in, avoiding cross-contamination was one of the most important duties we had. Your burger had all the veggies on it, meaning the residue and juices of those veggies are now on the burger. To people like us, it’s contaminated. We can’t eat it, just like we wouldn’t be able to eat a sandwich with bread that had been on a surface right after raw chicken. \n\nOnce you think of it like that, it’s rude to disrespect someone’s food preferences.",
      "created_utc": 1621220708.0,
      "score": 48,
      "context": []
    },
    {
      "id": "gye7ow2",
      "author": "None",
      "body": ":(( i’m in the same boat as you. Hopefully he’ll take this to heart and use it as a future reference when thinkin about food. I hope you were able to eat something else for dinner, though!",
      "created_utc": 1621216416.0,
      "score": 22,
      "context": []
    },
    {
      "id": "gyentey",
      "author": "MDPlayer1",
      "body": "This is a really really shitty part of ARFID, and I've experienced it with a lot of loved ones. I'm sorry. It sucks.",
      "created_utc": 1621224333.0,
      "score": 12,
      "context": []
    },
    {
      "id": "gye8647",
      "author": "shadyprincess",
      "body": "honestly i get exactly how you feel, its the worst feeling when u notice little things about people u love that show that they dont /really/ get arfid, no matter how hard they (or you) try :/ hang in there",
      "created_utc": 1621216662.0,
      "score": 11,
      "context": []
    },
    {
      "id": "gygbytn",
      "author": "Kelekona",
      "body": "Not wanting to eat a burger that had onion and tomato touching it is such a normal thing though.  There's something wrong if he got to that age without having some empathy about a common thing.",
      "created_utc": 1621264393.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gyelhit",
      "author": "BPMediocre",
      "body": "Yeah I don't know why people think it's ok to just do that - cause \"they'll eat it\". Order extra then, why do you have to have someone else's? I'll never understand why people insist on having certain things on their food either. Ok we both like pepperoni pizza, is it really necessary to get onions and peppers on your half? It's always baffled me.",
      "created_utc": 1621223177.0,
      "score": 11,
      "context": []
    },
    {
      "id": "gyf3u65",
      "author": "BananasDramas",
      "body": "It’s so hard for others to understand how we feel with things like this, my husband is really supportive (this has only been really going on for a year for me) but sometimes I can tell he’s frustrated and just wants me to try things and can push me too much. \n\nDoesn’t sound like your boyfriend did it on purposely wrong to make you not eat, just sounds,like he didn’t know how much it would affect you, and he probably feels really bad about it and he probably knows what he ‘should’ have ordered. \n\nMy ARFID and fear of allergic reactions with food is my issue and I always try not to make it a focus when we eat especially in front of other people too. I would never insult my husband and call him an air head for something that is a hard concept and problem for us to deal with, it’s difficult for me to figure it out and I’m going through it let alone for him.",
      "created_utc": 1621235757.0,
      "score": 7,
      "context": []
    },
    {
      "id": "gyf95nb",
      "author": "Beachysunny",
      "body": "I feel you. Happened to me, too, alone time. But it was a mishap. My bf was super understanding and helped me get something new. Nevertheless my mood was really bad... I'm so sorry, that happened to you.",
      "created_utc": 1621240329.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gygtxvl",
      "author": "calamitylamb",
      "body": "That’s an incredibly disrespectful and inconsiderate thing to do, *especially* considering y’all have been dating for four years. I can’t literally comprehend how he wouldn’t understand exactly why his actions would be harmful, how can someone be that oblivious? It’s not about the food, it’s about the fact that after four years together he can’t be bothered to remember or care about your very important preferences and needs? Yikes.",
      "created_utc": 1621271829.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gye9zi7",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1621217562.0,
      "score": 7,
      "context": []
    },
    {
      "id": "gyo461o",
      "author": "Ok-Passenger2653",
      "body": "I feel this. I was at a graduation party and my friend gave me her extra chicken tender that she didn't eat. I took one bite and violently dry heaved. apparently she had some kind of pasta salad or something on her plate and they had touched. I didn't even know that before eating it but I could still taste it and I almost threw up 🥲",
      "created_utc": 1621408203.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gyemks3",
      "author": "outrageousastroid",
      "body": "He.. wanted the veggies for his burger, so he ordered them on yours??? That don't add up. If he wanted them for his he would've ordered them for his instead of yours",
      "created_utc": 1621223692.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gyhc3qc",
      "author": "rucafromtheeastside",
      "body": "I'm a lurker in this sub because I believe my oldest child has ARFID. I myself do not have ARFID and I'm able to enjoy a wide variety of tastes and textures. I say that, because even as someone not afflicted with this disorder, I would be upset if someone knowingly ordered a burger with a bunch of stuff on it that I don't like. It does not take having ARFID to understand the concept of topping residue (I just made that term up but it's the best description I can think of for what it is). Someone once put ketchup on a whole sandwich they were going to share with me and even though they attempted to scrape it off my side when they realized I'm not a ketchup fan I still opted not eat. I could only imagine how much worse it would have been if I had ARFID.\n\nOP, I'm sorry that your BF had a moment of insensitivity. Hopefully he immediately offered to door dash you a different meal!",
      "created_utc": 1621279366.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gyewvkt",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1621230407.0,
      "score": -5,
      "context": []
    },
    {
      "id": "gye7m01",
      "author": "Fiery-Jinkx",
      "body": "dump him",
      "created_utc": 1621216376.0,
      "score": -8,
      "context": []
    },
    {
      "id": "gygexut",
      "author": "exstistentialCrisis",
      "body": "Especially with things like mushroom or olives, the taste is still there ruining everything",
      "created_utc": 1621265647.0,
      "score": 8,
      "context": [
        {
          "id": "gyeex5f",
          "author": "killrtaco",
          "body": "My girlfriend literally didn't understand why I was mad when I got a tomato in my burger yesterday when I asked for no tomato. Like it still leaves some taste and residue! It's gross! It's better than eating it with everything on anyway, but it's not the same as if they didn't put it on at all",
          "created_utc": 1621220022.0
        }
      ]
    },
    {
      "id": "gyezzn7",
      "author": "None",
      "body": "He thought it was going to be an easy transfer, no need for fancy \"plain\" orders because he had this super cool life hack where he was going to just *take the stuff off*.",
      "created_utc": 1621232780.0,
      "score": 41,
      "context": [
        {
          "id": "gye81t7",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1621216600.0
        }
      ]
    },
    {
      "id": "gyezr8b",
      "author": "None",
      "body": "Exactly! That's a good way to explain it. It's difficult for normal eaters to imagine how lettuce can ruin something.",
      "created_utc": 1621232597.0,
      "score": 19,
      "context": [
        {
          "id": "gyeg9n6",
          "author": "feyre_0001",
          "body": "I think of situations like this the same way I think of cross-contamination. In all of the kitchen’s I’ve worked in, avoiding cross-contamination was one of the most important duties we had. Your burger had all the veggies on it, meaning the residue and juices of those veggies are now on the burger. To people like us, it’s contaminated. We can’t eat it, just like we wouldn’t be able to eat a sandwich with bread that had been on a surface right after raw chicken. \n\nOnce you think of it like that, it’s rude to disrespect someone’s food preferences.",
          "created_utc": 1621220708.0
        }
      ]
    },
    {
      "id": "gyhd9ja",
      "author": "None",
      "body": "He definitely didn't do it on purpose. Well, he did. But not to make me suffer. He's not an airhead. It was an *airhead thing* to do. Sorry if I didn't make that clear. I love and respect my boyfriend. \n\nIt's definitely not the easiest concept to understand, but this situation just missed the mark sooooooo much. Like, I don't even want vegetables on the same plate as my food. He's seen this many times. That's why it was like...really??",
      "created_utc": 1621279863.0,
      "score": 3,
      "context": [
        {
          "id": "gyf3u65",
          "author": "BananasDramas",
          "body": "It’s so hard for others to understand how we feel with things like this, my husband is really supportive (this has only been really going on for a year for me) but sometimes I can tell he’s frustrated and just wants me to try things and can push me too much. \n\nDoesn’t sound like your boyfriend did it on purposely wrong to make you not eat, just sounds,like he didn’t know how much it would affect you, and he probably feels really bad about it and he probably knows what he ‘should’ have ordered. \n\nMy ARFID and fear of allergic reactions with food is my issue and I always try not to make it a focus when we eat especially in front of other people too. I would never insult my husband and call him an air head for something that is a hard concept and problem for us to deal with, it’s difficult for me to figure it out and I’m going through it let alone for him.",
          "created_utc": 1621235757.0
        }
      ]
    },
    {
      "id": "gyeftw0",
      "author": "TAA21MF",
      "body": "Lettuce and onion you can take off but tomatoes are juicy and that soaks into the bun and meat and ruins everything. Sauces at least usually stay mostly on the surface.",
      "created_utc": 1621220482.0,
      "score": 8,
      "context": [
        {
          "id": "gye9zi7",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1621217562.0
        }
      ]
    },
    {
      "id": "gyepbtc",
      "author": "mm1989",
      "body": "He wanted double.",
      "created_utc": 1621225268.0,
      "score": 10,
      "context": [
        {
          "id": "gyemks3",
          "author": "outrageousastroid",
          "body": "He.. wanted the veggies for his burger, so he ordered them on yours??? That don't add up. If he wanted them for his he would've ordered them for his instead of yours",
          "created_utc": 1621223692.0
        }
      ]
    },
    {
      "id": "gyezalj",
      "author": "AshOfTheLilacs",
      "body": "No, *he's* the one who ordered it and the obvious implication is that OP had asked for a plain burger. He fucked it up, it's his fault.",
      "created_utc": 1621232241.0,
      "score": 16,
      "context": [
        {
          "id": "gyewvkt",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1621230407.0
        }
      ]
    },
    {
      "id": "gyfsyvl",
      "author": "None",
      "body": "OP clearly stated “it was an airhead thing he did.” The behavior was insulted, not the person.\n\nYou’re reading in way too deep and projecting tbh.",
      "created_utc": 1621255433.0,
      "score": 6,
      "context": [
        {
          "id": "gyewvkt",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1621230407.0
        }
      ]
    },
    {
      "id": "gyh9g6c",
      "author": "nananananabatwoman",
      "body": "for me it depends on who it comes from.\n\nmy boss doing a surprise coffee run and gifting me a strawberry milkshake cause she always sees me with a pink creamy drink and never coffee? \"oh, it's actually cranberries, but thanks so much, you're a doll \\~\\~\" and I went around the office, drink in hand, pretending to take a sip, slowly disposing it (absoluty cannot eat / drink strawberry flavored stuff)\n\nA person with whom I share daily meals for *years* ordering something I absolutely cannot eat *on purpose*??  They're ruining my meal because they want to eat what I can't? If they've known me long enough there is absolutely not excuse for this, because there already saw me look at a meal or a menu as it had kicked my dog a looooooot of times. It's an absolute lack of caring for me, I'm usually a very accomodating person, just not with my meals, I literally can't.",
      "created_utc": 1621278234.0,
      "score": 6,
      "context": [
        {
          "id": "gyewvkt",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1621230407.0
        }
      ]
    },
    {
      "id": "gyhbi16",
      "author": "None",
      "body": "I understand your point of view. I feel the same way in most situations. I don't see how it's relevant to this situation, however. It doesn't seem ridiculous to expect my partner of years to order the food I want, that I've ordered many times in the past. What else was I supposed to do in this situation? My partner made a decision, with all the information he had accumulated over 4 years, that then meant I didn't get to eat. He's seen me go hungry many times because of similar situations. How is that not a silly (and irritating) thing to do? Honestly wondering.",
      "created_utc": 1621279108.0,
      "score": 4,
      "context": [
        {
          "id": "gyewvkt",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1621230407.0
        }
      ]
    },
    {
      "id": "gyf404a",
      "author": "BananasDramas",
      "body": "I agree with you completely",
      "created_utc": 1621235890.0,
      "score": -6,
      "context": [
        {
          "id": "gyewvkt",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1621230407.0
        }
      ]
    },
    {
      "id": "gyfni1u",
      "author": "Prof_Cecily",
      "body": ">I've always considered my eating issues my problem.  Ive never felt it anyone elses responsibility to get it right.\n\nMy view as well.\n\n&#x200B;\n\n>I'd rather people didn't make me food.\n\nThat's my preference as well.\n\nIn any case, when I was at Uni, I earned my living by working as a waitress, so I know very, very well the special treatment given by the kitchen staff to the food ordered by a 'troublesome' client. \n\nThis taught me to never, ever argue with or complain about the staff of a restaurant. \n\nEver. \n\nSave it for your Tripadviser review. ;-)",
      "created_utc": 1621252066.0,
      "score": -3,
      "context": [
        {
          "id": "gyewvkt",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1621230407.0
        }
      ]
    },
    {
      "id": "gyfj3q8",
      "author": "Poppamunz",
      "body": "Why is this getting downvoted? OP deserves better than someone who'd blatantly disregard their needs like that.",
      "created_utc": 1621248907.0,
      "score": 6,
      "context": [
        {
          "id": "gye7m01",
          "author": "Fiery-Jinkx",
          "body": "dump him",
          "created_utc": 1621216376.0
        }
      ]
    },
    {
      "id": "gygfn4m",
      "author": "AirVengeance",
      "body": "Mushrooms, olives, and greenpeppers always leave a taste behind. Green peppers being the worst. \"Just pick it off\" yah at a molecular level.",
      "created_utc": 1621265938.0,
      "score": 8,
      "context": [
        {
          "id": "gyeex5f",
          "author": "killrtaco",
          "body": "My girlfriend literally didn't understand why I was mad when I got a tomato in my burger yesterday when I asked for no tomato. Like it still leaves some taste and residue! It's gross! It's better than eating it with everything on anyway, but it's not the same as if they didn't put it on at all",
          "created_utc": 1621220022.0
        },
        {
          "id": "gygexut",
          "author": "exstistentialCrisis",
          "body": "Especially with things like mushroom or olives, the taste is still there ruining everything",
          "created_utc": 1621265647.0
        }
      ]
    },
    {
      "id": "gyh7euj",
      "author": "R-nd-",
      "body": "For me it was always pineapple, my mum would get pizza with pineapple on the whole thing and tell me to pick it off, or do it herself. She was always surprised when I could taste the pineapples...as if it's a gentle taste that doesn't affect everything it touches",
      "created_utc": 1621277386.0,
      "score": 6,
      "context": [
        {
          "id": "gyeex5f",
          "author": "killrtaco",
          "body": "My girlfriend literally didn't understand why I was mad when I got a tomato in my burger yesterday when I asked for no tomato. Like it still leaves some taste and residue! It's gross! It's better than eating it with everything on anyway, but it's not the same as if they didn't put it on at all",
          "created_utc": 1621220022.0
        },
        {
          "id": "gygexut",
          "author": "exstistentialCrisis",
          "body": "Especially with things like mushroom or olives, the taste is still there ruining everything",
          "created_utc": 1621265647.0
        }
      ]
    },
    {
      "id": "gyfgbda",
      "author": "axw3555",
      "body": "Fancy... plain?",
      "created_utc": 1621246699.0,
      "score": 13,
      "context": [
        {
          "id": "gye81t7",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1621216600.0
        },
        {
          "id": "gyezzn7",
          "author": "None",
          "body": "He thought it was going to be an easy transfer, no need for fancy \"plain\" orders because he had this super cool life hack where he was going to just *take the stuff off*.",
          "created_utc": 1621232780.0
        }
      ]
    },
    {
      "id": "gyhjsxb",
      "author": "BananasDramas",
      "body": "Oh ok I see what you mean then, hopefully he’s now realised 😊😊",
      "created_utc": 1621282627.0,
      "score": 2,
      "context": [
        {
          "id": "gyf3u65",
          "author": "BananasDramas",
          "body": "It’s so hard for others to understand how we feel with things like this, my husband is really supportive (this has only been really going on for a year for me) but sometimes I can tell he’s frustrated and just wants me to try things and can push me too much. \n\nDoesn’t sound like your boyfriend did it on purposely wrong to make you not eat, just sounds,like he didn’t know how much it would affect you, and he probably feels really bad about it and he probably knows what he ‘should’ have ordered. \n\nMy ARFID and fear of allergic reactions with food is my issue and I always try not to make it a focus when we eat especially in front of other people too. I would never insult my husband and call him an air head for something that is a hard concept and problem for us to deal with, it’s difficult for me to figure it out and I’m going through it let alone for him.",
          "created_utc": 1621235757.0
        },
        {
          "id": "gyhd9ja",
          "author": "None",
          "body": "He definitely didn't do it on purpose. Well, he did. But not to make me suffer. He's not an airhead. It was an *airhead thing* to do. Sorry if I didn't make that clear. I love and respect my boyfriend. \n\nIt's definitely not the easiest concept to understand, but this situation just missed the mark sooooooo much. Like, I don't even want vegetables on the same plate as my food. He's seen this many times. That's why it was like...really??",
          "created_utc": 1621279863.0
        }
      ]
    },
    {
      "id": "gyeh7or",
      "author": "matchstrike",
      "body": "Sauces would ruin the whole thing for most of us, I would say. Scent, feel, taste all still there. Doesn’t matter how much scraping off one does.",
      "created_utc": 1621221165.0,
      "score": 16,
      "context": [
        {
          "id": "gye9zi7",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1621217562.0
        },
        {
          "id": "gyeftw0",
          "author": "TAA21MF",
          "body": "Lettuce and onion you can take off but tomatoes are juicy and that soaks into the bun and meat and ruins everything. Sauces at least usually stay mostly on the surface.",
          "created_utc": 1621220482.0
        }
      ]
    },
    {
      "id": "gyg7j3z",
      "author": "TwilekDancer",
      "body": "The onion flavor doesn’t bother me, just the texture, but can we talk about *pickles*? 🤮🤮",
      "created_utc": 1621262501.0,
      "score": 2,
      "context": [
        {
          "id": "gye9zi7",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1621217562.0
        },
        {
          "id": "gyeftw0",
          "author": "TAA21MF",
          "body": "Lettuce and onion you can take off but tomatoes are juicy and that soaks into the bun and meat and ruins everything. Sauces at least usually stay mostly on the surface.",
          "created_utc": 1621220482.0
        }
      ]
    },
    {
      "id": "gyfjtiu",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1621249450.0,
      "score": 3,
      "context": [
        {
          "id": "gye9zi7",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1621217562.0
        },
        {
          "id": "gyeftw0",
          "author": "TAA21MF",
          "body": "Lettuce and onion you can take off but tomatoes are juicy and that soaks into the bun and meat and ruins everything. Sauces at least usually stay mostly on the surface.",
          "created_utc": 1621220482.0
        },
        {
          "id": "gyeh7or",
          "author": "matchstrike",
          "body": "Sauces would ruin the whole thing for most of us, I would say. Scent, feel, taste all still there. Doesn’t matter how much scraping off one does.",
          "created_utc": 1621221165.0
        }
      ]
    },
    {
      "id": "gyfspaw",
      "author": "RpSilk",
      "body": "Same here that onion taste permeates everything it touches. It's my number one most hated flavor.",
      "created_utc": 1621255281.0,
      "score": 3,
      "context": [
        {
          "id": "gye9zi7",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1621217562.0
        },
        {
          "id": "gyeftw0",
          "author": "TAA21MF",
          "body": "Lettuce and onion you can take off but tomatoes are juicy and that soaks into the bun and meat and ruins everything. Sauces at least usually stay mostly on the surface.",
          "created_utc": 1621220482.0
        },
        {
          "id": "gyeh7or",
          "author": "matchstrike",
          "body": "Sauces would ruin the whole thing for most of us, I would say. Scent, feel, taste all still there. Doesn’t matter how much scraping off one does.",
          "created_utc": 1621221165.0
        },
        {
          "id": "gyfjtiu",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1621249450.0
        }
      ]
    }
  ]
}