{
  "id": "niird8",
  "subreddit": "ARFID",
  "author": "feyre_0001",
  "created_utc": 1621690490.0,
  "title": "DAE Feel like it’s easier to eat food you’ve prepared yourself?",
  "selftext": "Now that I’ve moved out of my mom’s and in with my friends, I cook all the time. My one friend hates cooking and the other works constantly, so having me around to cook and clean has been pretty great. I’ve been so bold in trying new foods and recipes, and it’s always went well. I’m starting to believe that preparing the food MYSELF is what makes it okay- I know how it’s cooked and I know what’s in it, so I feel like I have control and power over it. I wondered if anyone else did too.",
  "url": "https://www.reddit.com/r/ARFID/comments/niird8/dae_feel_like_its_easier_to_eat_food_youve/",
  "score": 93,
  "num_comments": 15,
  "comments": [
    {
      "id": "gz1yxi3",
      "author": "ZzkqBaQWgd",
      "body": "I've noticed that cooking helps me. I know how it's prepared and exactly what's in it so I feel more comfortable eating it.",
      "created_utc": 1621690926.0,
      "score": 25,
      "context": []
    },
    {
      "id": "gz2iby9",
      "author": "maleguy20s",
      "body": "The opposite for me. I kinda don't trust myself with meat",
      "created_utc": 1621701189.0,
      "score": 10,
      "context": []
    },
    {
      "id": "gz27337",
      "author": "None",
      "body": "I do, because I know exactly what’s in whatever it is that I made. Also, it’s made to how I want it to be rather than someone else’s preference.         \nI’ve had people joke/threaten to sneak something in just so they can have a gotcha moment. I advise them that doing so would be a poor choice. At the bare minimum I will never trust nor eat anything they make ever again. I have enough food issues as it is without someone adding to it.",
      "created_utc": 1621695337.0,
      "score": 7,
      "context": []
    },
    {
      "id": "gz2lni3",
      "author": "Prof_Cecily",
      "body": "It's the same for me.",
      "created_utc": 1621702853.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gz4blls",
      "author": "amdaly10",
      "body": "Opposite for me.  I am terrible at cooking.  Everything I make is garbage.",
      "created_utc": 1621735590.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gz2tj88",
      "author": "EunuchProgrammer",
      "body": "Yes, because I know what the hell I'm doing. I may not eat many things but the few I do eat I have learned how to prepare very very well.",
      "created_utc": 1621706649.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gz2z6c7",
      "author": "None",
      "body": "always!!!!\n also being a cook for a job has helped because im comfortable with whatever food that restaurant served, and if i want to try it i already know how its made etc.",
      "created_utc": 1621709443.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gz31s84",
      "author": "Mynotredditaccount",
      "body": "100% yes. This is why I meal prep as well. I know exactly how the food was prepared and what's in it and that gives me peace of mind.",
      "created_utc": 1621710808.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gz3cciy",
      "author": "EWaltz",
      "body": "entertain smell hobbies plough quack unpack many quickest tie vegetable\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
      "created_utc": 1621716202.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gz3xxsp",
      "author": "becksaw",
      "body": "Yep me. Even safe foods made by other people don’t taste just right to me and that gives me anxiety like no other.",
      "created_utc": 1621727526.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gz4kj0b",
      "author": "Thepenguinking2",
      "body": "Kinda the opposite for me. I worry about failing to make it right, so if it's not tasty to even me, why even bother?",
      "created_utc": 1621741387.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gz5fs1y",
      "author": "BananasDramas",
      "body": "Yes definitely can help me sometimes as I know exactly what’s in it and helps me control my anxiety and fear a bit more.",
      "created_utc": 1621769010.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gz6ghgn",
      "author": "Dethanatos",
      "body": "It is for me, I don't have to ask \"what's in it?\"",
      "created_utc": 1621789335.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gz25x3j",
      "author": "Rand0mtask",
      "body": "Exactly this. If I made something, I can trust it. Also if I see it being prepared/know the ingredients, I'm not worried about biting into something unexpected. \n\nAnxiety is so bizarre.",
      "created_utc": 1621694724.0,
      "score": 9,
      "context": [
        {
          "id": "gz1yxi3",
          "author": "ZzkqBaQWgd",
          "body": "I've noticed that cooking helps me. I know how it's prepared and exactly what's in it so I feel more comfortable eating it.",
          "created_utc": 1621690926.0
        }
      ]
    },
    {
      "id": "gz2rerd",
      "author": "sonicenvy",
      "body": "THIS! the anxiety of not knowing what is in something is totally eased when I make my own food. MY friends have become very cognizant of that and now whenever they cook for me, they tell me exactly what's in the thing they're making and ask me if each thing is OK. It also helps, I think, to make sure that I am only eating around people who are not going to judge me if I try something and it doesn't work for me and who are willing to accommodate my anxieties about food and eating. Honestly the worst thing for me is eating around strangers and eating around relatives that are very judging and like making jokes at my expense over it.",
      "created_utc": 1621705629.0,
      "score": 3,
      "context": [
        {
          "id": "gz1yxi3",
          "author": "ZzkqBaQWgd",
          "body": "I've noticed that cooking helps me. I know how it's prepared and exactly what's in it so I feel more comfortable eating it.",
          "created_utc": 1621690926.0
        }
      ]
    }
  ]
}