{
  "id": "nv71dx",
  "subreddit": "ARFID",
  "author": "lonelythrowaway525",
  "created_utc": 1623167171.0,
  "title": "This felt relatable",
  "selftext": "",
  "url": "https://i.redd.it/27t6ozhk92471.jpg",
  "score": 472,
  "num_comments": 11,
  "comments": [
    {
      "id": "h135hv5",
      "author": "iliketowetmyplants",
      "body": "Thiiiiis is my issue. Processed /junk foods feel (at least visually) a lot \"safer\" to me than a fruit or vegetable since those can differ in appearance so drastically. Nothing triggers my internal yuck alarm quicker than uneven, inconsistent foods.\n\n I just explain to people that I refuse to eat anything that's ugly. Like for example, my fiancée picks out any \"ugly\" french fries of the container for me before handing it to me, etc. \n\nMakes sense to me!",
      "created_utc": 1623193477.0,
      "score": 28,
      "context": []
    },
    {
      "id": "h127hw3",
      "author": "zDEFEKT",
      "body": "If you are what you eat, then I am a Dorito.",
      "created_utc": 1623178288.0,
      "score": 10,
      "context": []
    },
    {
      "id": "h13opqh",
      "author": "anchower420",
      "body": "I like/will eat watermelon, but it's such a crapshoot if it's the right texture/flavor every time. It takes me at least 5 minutes to inspect & choose the \"best\" watermelon at the store. \n\nIf I'm honest, sometimes, I don't even cut it open right away because the fear it's going to be \"bad\" is overwhelming. It's like schroedinger's watermelon: as long as I don't cut it, it could still be \"good\"   Of course, then the anxiety makes me wait too long and by then it's gone bad and I end up throwing it in the compost.\n\nARFID problems....am I right??",
      "created_utc": 1623203252.0,
      "score": 11,
      "context": []
    },
    {
      "id": "h11w0zn",
      "author": "tyedyehippy",
      "body": "Yes. My Dad used to make comments about my eating habits. One of them included how one of my food groups are Doritos.",
      "created_utc": 1623173447.0,
      "score": 4,
      "context": []
    },
    {
      "id": "h12a6v0",
      "author": "Mynotredditaccount",
      "body": "I hadn't even considered this lol it would makes sense for some of us, I'm sure D:",
      "created_utc": 1623179402.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h13yk21",
      "author": "L0tuslol",
      "body": "I have the opposite issue I can’t eat meats but can eat fruits/vegetables",
      "created_utc": 1623208322.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ir94ivc",
      "author": "Dreamergal9",
      "body": "I don’t have ARFID, but I feel this. I can be sensitive to textures sometimes, I think it’s connected to the sensory issues that seem to come with my ADHD. I love lots of fruits, but I can be very picky about the quality, and can’t stand it if they’ve gone mushy. I’m personally a big fan of oranges, but I rarely eat them these days because when a orange isn’t good it’s really just *not good*. Also have problems with watermelon—when the watermelon is a great ripeness I love the taste, but it seems that with most watermelon (with some exceptions), no matter what you do, there’s going to be some sort of mush in there. And even when they don’t have the black seeds, I still don’t like the smaller brown seeds. Accidentally bought some seeded grapes that weren’t even that great, they were soft—didn’t want to eat them, so now they’re in my freezer until I figure out what to do with them.",
      "created_utc": 1665039702.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h1alo3z",
      "author": "None",
      "body": "Fruit is stressful and uncomfortable to eat most of the time and I didn’t realize why.",
      "created_utc": 1623341054.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iv8ubbg",
      "author": "snow-covered-tuna",
      "body": "THIS\n\nI would probably eat fruit daily if it wasn’t a hit or miss\n\nAlso\n\nFrozen chicken tenders: same flavor and texture 365 days a year, it’s never let me down\n\nThe only fruit I like and can eat (pomegranate): only in season 1/3 of the year, bitter and disgusting for like two months of that, and of the 2 months theyre in their prime only 3/5 are good and they’re $5 a pop, meanwhile two meals worth of chicken tenders are $5 and dont have such a fail rate.\n\nAny time I tried to incorporate fruit, even fruit I REALLY like, I can make it a habit for maybe 4 days max then I’ll get a bad one and I’ll be scarred from it for like 5 months minimum, and by then it’s probably out of season anyways…\n\nThe only fruits I li",
      "created_utc": 1667708653.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h13o4vf",
      "author": "anchower420",
      "body": "sounds like you got a winner right there :)",
      "created_utc": 1623202960.0,
      "score": 8,
      "context": [
        {
          "id": "h135hv5",
          "author": "iliketowetmyplants",
          "body": "Thiiiiis is my issue. Processed /junk foods feel (at least visually) a lot \"safer\" to me than a fruit or vegetable since those can differ in appearance so drastically. Nothing triggers my internal yuck alarm quicker than uneven, inconsistent foods.\n\n I just explain to people that I refuse to eat anything that's ugly. Like for example, my fiancée picks out any \"ugly\" french fries of the container for me before handing it to me, etc. \n\nMakes sense to me!",
          "created_utc": 1623193477.0
        }
      ]
    },
    {
      "id": "h16s0fp",
      "author": "iliketowetmyplants",
      "body": "Honestly, he is quite literally the only person who understands my complex food issues, because he is also a picky eater (nothing close to as bad as I am, but still) so he gets it. It's been the biggest relief to have even just one person not make me feel like shit about my relationship with food.",
      "created_utc": 1623265317.0,
      "score": 4,
      "context": [
        {
          "id": "h135hv5",
          "author": "iliketowetmyplants",
          "body": "Thiiiiis is my issue. Processed /junk foods feel (at least visually) a lot \"safer\" to me than a fruit or vegetable since those can differ in appearance so drastically. Nothing triggers my internal yuck alarm quicker than uneven, inconsistent foods.\n\n I just explain to people that I refuse to eat anything that's ugly. Like for example, my fiancée picks out any \"ugly\" french fries of the container for me before handing it to me, etc. \n\nMakes sense to me!",
          "created_utc": 1623193477.0
        },
        {
          "id": "h13o4vf",
          "author": "anchower420",
          "body": "sounds like you got a winner right there :)",
          "created_utc": 1623202960.0
        }
      ]
    }
  ]
}