{
  "id": "nvmt0e",
  "subreddit": "ARFID",
  "author": "None",
  "created_utc": 1623211560.0,
  "title": "Is anyone else overweight because your safe foods are unhealthy?",
  "selftext": "I’ve struggled with this disorder my whole life but I didn’t start getting fat until junior high/high school. I was only chubby at that time but then when I hit 22 years I gained massive amounts of weight all over my body and now I’m almost borderline obese according to BMI. The only foods I can tolerate are very unhealthy such as fried chicken, steak or any kind of red meat, seafood, pasta, bread and the occasional fruit like apples. I can’t stomach any kind of vegetable and I can barely tolerate most fruit. I also don’t like water so I mainly just drink sugar free soda, grape juice or chocolate milk. I’ve tried changing for years but it didn’t work so I’m basically stuck in this body. Does anyone else struggle with being overweight with ARFID or it just me?",
  "url": "https://www.reddit.com/r/ARFID/comments/nvmt0e/is_anyone_else_overweight_because_your_safe_foods/",
  "score": 140,
  "num_comments": 51,
  "comments": [
    {
      "id": "h154oal",
      "author": "axw3555",
      "body": "It’s more common than a lot of people think. \n\nI mean, my diet is bread, pizza, burger, pasta, cereal, pancakes, burgers, fried chicken, chips (as in fries, but I like the proper thick cut ones). And untold amounts of chocolate.\n\nWhen I was young, I walked everywhere, burned massive calories, so even with an awful diet, I was borderline underweight.\n\nNow I drive and work in an office. I’ve shifted from underweight to overweight in the course of the last couple of years. To the point I just got a compact treadmill to try losing weight (walking locally is… sketchy. Lots of dumb kids, bad quality surface, lots of steep hills, etc).",
      "created_utc": 1623239561.0,
      "score": 42,
      "context": []
    },
    {
      "id": "h14n9pd",
      "author": "Neocactus",
      "body": "I have a very similar experience to you (only difference being that I don’t eat any kind of meat). I was bodyshamed for being skinny all throughout my early childhood by my family, but then became “fat” some time in middle school, which is where my weight has stayed to this day :/\n\n(And of course my family all shame me for being fat now)",
      "created_utc": 1623225497.0,
      "score": 22,
      "context": []
    },
    {
      "id": "h16mfzu",
      "author": "zetsubonna",
      "body": "I’m extremely sedentary at work (I average 1400 steps a day when I’m in the office). My safe foods are all junk. I’ve been trying to do better this year but the best I’ve done has been cutting out diet soda and adding variations on tomatoes and green peppers to my diet.\n\nI’m on the r/ARFID Discord channel and I’ve mentioned my issues a few times. I have a bunch of fun mental illnesses and PCOS, so my insulin resistance and hypothyroidism just make everything worse and even on days I only eat one meal a day I’m usually in bed with depression and not moving at all.\n\nIt’s entirely possible and you are not alone.",
      "created_utc": 1623263079.0,
      "score": 16,
      "context": []
    },
    {
      "id": "h15o80q",
      "author": "Electrical-Ad678",
      "body": "Yes! I’m 5’9 and 115kgs with arfid, pcos and a genetic thyroid issue. Talk about triple homicide lol \nI’m having gastric sleeve in March and have been in therapy for arfid for 2 years",
      "created_utc": 1623249253.0,
      "score": 9,
      "context": []
    },
    {
      "id": "h15gdd5",
      "author": "None",
      "body": "Yes. Very overweight /obese.",
      "created_utc": 1623245826.0,
      "score": 5,
      "context": []
    },
    {
      "id": "h166960",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1623256552.0,
      "score": 5,
      "context": []
    },
    {
      "id": "h16iczm",
      "author": "RoyalSeraph",
      "body": "I actually had the complete opposite experience. I was underweight until high school years and had to endure a trillion classroom lectures about how **my exact lifestyle and diet** cause obesity. Year after year. Month after month. News article after news article. I was a young boy wishing to gain weight and hearing repeatedly how my lifestyle causes the exact opposite of what actually happens.\n\nIf that's not enough, only when my safe list got larger and I started working out I reached weight I'm satisfied with. The irony.",
      "created_utc": 1623261392.0,
      "score": 5,
      "context": []
    },
    {
      "id": "h16sxdw",
      "author": "seotyeknom",
      "body": "Absolutely.\n\nMy safe foods are meats, cheeses, and starches. I've never been able to tolerate vegetables and like the taste of fruit even though most of their textures make me gag. \n\nI was thin growing up because I had a lot of activities (roller skating, running around to friends houses to play, some sports with them). As I have gotten older, I've found myself packing on weight due to work and being more sedentary. This alongside being diagnosed with PCOS, Hypothyroidism, and type 2 diabetes after having my daughter has made getting weight off harder, both mentally and physically.\n\nI was able to lose 45lbs before I conceived with a keto diet.. albeit with vitamin supplements alongside it. Since having her, I've gained 20lbs back and am going back on keto soon. I have to kick my soda habit most of all which has been difficult.",
      "created_utc": 1623265685.0,
      "score": 4,
      "context": []
    },
    {
      "id": "h160bwq",
      "author": "None",
      "body": "I am overweight. I want to lose 30lbs. I got an a treadmill and we also have a recumbent bike. So I have been trying to use those. Counting calories helps a lot, if you're able to do it without being obsessive. Also, being part of a community or having someone to chat with about your health/weight helps too.",
      "created_utc": 1623254202.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h17g9kc",
      "author": "StormTheParade",
      "body": "YES!! I also struggle with emotional eating, so it's like a double whammy. But it was the same story for me, I started gaining weight my senior year of high school and now I fluctuate. I'll have a year or so of being \"overweight\" (just barely) and then a year where I'm at a healthy weight. It's super weird and I struggle a lot with the insecurity that comes with it.\n\nI'm so used to people saying they're *underweight* because of it, so I always felt like an outsider even in the ARFID community. I don't eat any seafood, no meats besides fried chicken or bacon, no fruits or veggies unless they're blended/juiced... I used to hate water so I would compromise by drinking flavoured water using stuff like crystal light or Mio or Propel. Now I can only drink water if it's basically ice cold.\n\nI also replaced my soda addiction for fruit juice in the hopes of getting a little more nutrients in me. I also started going for walks a while back just to get a bit of movement - it's not \"working out\" or vigorous exercise but at least I get a little cardio in, so to speak. I also try to prevent myself from snacking too much, which can help a little.",
      "created_utc": 1623275208.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h17jxt2",
      "author": "wyndchilde",
      "body": "Absolutely. Fast food is reliable, available, relatively affordable, and I can receive it nearly as fast as I order it. It's always the same, I know it's something I like, and it's never got weird bits in it. Same goes for pasta and potatoes.",
      "created_utc": 1623276823.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h17ksaa",
      "author": "DogsCanAlwaysTell",
      "body": "I was where you were, a few points into the obese BMI. I’m 23 bmi now. The only thing that has really helped is weight training and going 0 calories on all drinks. I only do it for about 20 minutes every other day and the difference in the last few months has been insane. Also, liking seafood can really work in your favour. Do you like sushi at all? Tinned sardines? Smoked fish fillets? Mackerel is my fave, I eat fish every day. Let me know if you want any help getting started with weights.",
      "created_utc": 1623277208.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h17sze1",
      "author": "czzzzzzzzzzzz",
      "body": "I am struggling with my weight right now, I can’t eat much healthy food. I had always been repulsed by food, even my safe foods were never fun or enjoyable to eat, I never understood why people were so obsessed by food. I would go all day without eating because eating was just a chore. Last October I started taking antidepressants for my anxiety. Almost immediately I became obsessed with food, the experience of eating (though I have been able to add one or two healthy foods, for the most part I still eat the same foods, just way more of them now). Suddenly I’m snacking all the time, thinking about food constantly. And yeah, I’ve gained 25 pounds since then and I can’t seem to stop gaining weight. I’m getting pretty freaked out and trying to lose weight by doing calories in/calories out. Even thinking about stopping the meds but idk what that would do to my anxiety and food anxiety especially. So you’re not alone",
      "created_utc": 1623281100.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h16kudn",
      "author": "killrtaco",
      "body": "Everything I eat is unhealthy. I am severely depressed with my diet. I am still under weight because I mainly eat 1 meal a day if that and then just snack thru out the day.\n\nWhich in itself isn't healthy",
      "created_utc": 1623262426.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h177vxw",
      "author": "tiasshy",
      "body": "Not alone.",
      "created_utc": 1623271706.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h18ovx4",
      "author": "FeministAsian",
      "body": "I definitely have gained weight especially with the pandemic. I started working in an office and living on the second floor of an apartment compared to walking around college campus and living on a third floor walk up with high ceilings on each floor (historic building). My lifestyle changed but my eating did not. Actually it may have gotten worse because I would get a muffin and a big smoothie (mint cream, not fruit) on many mornings. I hit the heaviest I’ve ever been back last summer and then through December. In January of this year I started using an app to count my calories and I’ve lost 46 pounds! No exercise or weird diet foods just portion control.\n\nMy comfort food is pasta with butter and cheese. I love fried chicken (no bones tho so basically chicken tenders) and French fries. I hate salad and sandwiches and veggies. My diet is mostly junk food. I know I will not get to my ultimate goal weight without exercise (ugh but it’s so hot in the summer). It’s a big struggle to diet with ARFID so I applaud you!\n\nInstead of chocolate milk maybe look into Ensure (located near pharmacy). They have a protein option that’s less than 200 calories and tastes good! It’s expensive but it helps me get my vitamins in. Instead of soda and juice have you tried vitamin water? Or Gatorade even? Both have zero calorie options and can be very sweet. \n\nBest of luck with everything!!!",
      "created_utc": 1623297209.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h169ti4",
      "author": "None",
      "body": "i eat an incredible amount of candy, pasta, pizza, and deep fried fast food, but my metabolism is still decent at 20yrs. have you tried water flavorings? ive been obsessed with topo chico recently which is carbonated mineral water",
      "created_utc": 1623257951.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h16dqhf",
      "author": "usernametaken615",
      "body": "Yes.",
      "created_utc": 1623259520.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h17n802",
      "author": "Bunks_",
      "body": "Yes",
      "created_utc": 1623278329.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h185kql",
      "author": "Charle_65",
      "body": "I've always wondered what would happen to unhealthy food avoiders if they were transplanted a healthy person's gut bacteria...\n\n You're definitely not the only one it's easy to overeat processed food , even more so when you're malnourished/deficient nutritionally and crave anything that has vitamins and minerals",
      "created_utc": 1623287307.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h188to9",
      "author": "anonymous-musician",
      "body": "Yep, I am trying to lose weight right now, and figuring out a diet I could actually eat was a nightmare.",
      "created_utc": 1623288910.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h18be7i",
      "author": "broken_krystal_ball",
      "body": "I feel you. I'm not like huge but I have some extra pounds and they are noticeable. I don't consider my weight to really be a bad thing as I've learned to love myself. I'm more worried about my future health. I do want to say this, we can get better but it starts with your thoughts.",
      "created_utc": 1623290187.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h1y2d02",
      "author": "mandelaXeffective",
      "body": "Not overweight but I do have high cholesterol",
      "created_utc": 1623830633.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h16wrj0",
      "author": "None",
      "body": "Well I’m glad I’m not alone then, I thought I was the only one who was dealing with this",
      "created_utc": 1623267243.0,
      "score": 3,
      "context": [
        {
          "id": "h154oal",
          "author": "axw3555",
          "body": "It’s more common than a lot of people think. \n\nI mean, my diet is bread, pizza, burger, pasta, cereal, pancakes, burgers, fried chicken, chips (as in fries, but I like the proper thick cut ones). And untold amounts of chocolate.\n\nWhen I was young, I walked everywhere, burned massive calories, so even with an awful diet, I was borderline underweight.\n\nNow I drive and work in an office. I’ve shifted from underweight to overweight in the course of the last couple of years. To the point I just got a compact treadmill to try losing weight (walking locally is… sketchy. Lots of dumb kids, bad quality surface, lots of steep hills, etc).",
          "created_utc": 1623239561.0
        }
      ]
    },
    {
      "id": "h16mioy",
      "author": "zetsubonna",
      "body": "Same hat!",
      "created_utc": 1623263110.0,
      "score": 1,
      "context": [
        {
          "id": "h154oal",
          "author": "axw3555",
          "body": "It’s more common than a lot of people think. \n\nI mean, my diet is bread, pizza, burger, pasta, cereal, pancakes, burgers, fried chicken, chips (as in fries, but I like the proper thick cut ones). And untold amounts of chocolate.\n\nWhen I was young, I walked everywhere, burned massive calories, so even with an awful diet, I was borderline underweight.\n\nNow I drive and work in an office. I’ve shifted from underweight to overweight in the course of the last couple of years. To the point I just got a compact treadmill to try losing weight (walking locally is… sketchy. Lots of dumb kids, bad quality surface, lots of steep hills, etc).",
          "created_utc": 1623239561.0
        }
      ]
    },
    {
      "id": "h16smvn",
      "author": "bobainwonderland",
      "body": "Same here.",
      "created_utc": 1623265568.0,
      "score": 1,
      "context": [
        {
          "id": "h154oal",
          "author": "axw3555",
          "body": "It’s more common than a lot of people think. \n\nI mean, my diet is bread, pizza, burger, pasta, cereal, pancakes, burgers, fried chicken, chips (as in fries, but I like the proper thick cut ones). And untold amounts of chocolate.\n\nWhen I was young, I walked everywhere, burned massive calories, so even with an awful diet, I was borderline underweight.\n\nNow I drive and work in an office. I’ve shifted from underweight to overweight in the course of the last couple of years. To the point I just got a compact treadmill to try losing weight (walking locally is… sketchy. Lots of dumb kids, bad quality surface, lots of steep hills, etc).",
          "created_utc": 1623239561.0
        }
      ]
    },
    {
      "id": "h14niyw",
      "author": "None",
      "body": "I’m sorry to hear that. It sucks that your family is mean to you, my family don’t really care what my weight is as long as I don’t have health problems from it (except my dad who constantly tells me no guy will ever want me if I remain fat)",
      "created_utc": 1623225723.0,
      "score": 5,
      "context": [
        {
          "id": "h14n9pd",
          "author": "Neocactus",
          "body": "I have a very similar experience to you (only difference being that I don’t eat any kind of meat). I was bodyshamed for being skinny all throughout my early childhood by my family, but then became “fat” some time in middle school, which is where my weight has stayed to this day :/\n\n(And of course my family all shame me for being fat now)",
          "created_utc": 1623225497.0
        }
      ]
    },
    {
      "id": "h1ddmmo",
      "author": "None",
      "body": "I’m sorry that you struggle with so many different things. I’m autistic and have depression and anxiety so that doesn’t exactly help work things in my favor either. \n\nHope you are able to get help. Glad to know I’m not alone with this",
      "created_utc": 1623389281.0,
      "score": 2,
      "context": [
        {
          "id": "h16mfzu",
          "author": "zetsubonna",
          "body": "I’m extremely sedentary at work (I average 1400 steps a day when I’m in the office). My safe foods are all junk. I’ve been trying to do better this year but the best I’ve done has been cutting out diet soda and adding variations on tomatoes and green peppers to my diet.\n\nI’m on the r/ARFID Discord channel and I’ve mentioned my issues a few times. I have a bunch of fun mental illnesses and PCOS, so my insulin resistance and hypothyroidism just make everything worse and even on days I only eat one meal a day I’m usually in bed with depression and not moving at all.\n\nIt’s entirely possible and you are not alone.",
          "created_utc": 1623263079.0
        }
      ]
    },
    {
      "id": "h16mn4n",
      "author": "killrtaco",
      "body": "It's sad but 1400 steps sounds more than I do since working from home",
      "created_utc": 1623263160.0,
      "score": 1,
      "context": [
        {
          "id": "h16mfzu",
          "author": "zetsubonna",
          "body": "I’m extremely sedentary at work (I average 1400 steps a day when I’m in the office). My safe foods are all junk. I’ve been trying to do better this year but the best I’ve done has been cutting out diet soda and adding variations on tomatoes and green peppers to my diet.\n\nI’m on the r/ARFID Discord channel and I’ve mentioned my issues a few times. I have a bunch of fun mental illnesses and PCOS, so my insulin resistance and hypothyroidism just make everything worse and even on days I only eat one meal a day I’m usually in bed with depression and not moving at all.\n\nIt’s entirely possible and you are not alone.",
          "created_utc": 1623263079.0
        }
      ]
    },
    {
      "id": "l84kels",
      "author": "Mindless_Boat6997",
      "body": "How did your surgery go? Im about to do the same. Im 124kg and 161cm. Ham and cheese toasties and chips have done my life no favours.",
      "created_utc": 1718118940.0,
      "score": 2,
      "context": [
        {
          "id": "h15o80q",
          "author": "Electrical-Ad678",
          "body": "Yes! I’m 5’9 and 115kgs with arfid, pcos and a genetic thyroid issue. Talk about triple homicide lol \nI’m having gastric sleeve in March and have been in therapy for arfid for 2 years",
          "created_utc": 1623249253.0
        }
      ]
    },
    {
      "id": "h1ddne4",
      "author": "None",
      "body": "I’m sorry to hear that",
      "created_utc": 1623389296.0,
      "score": 1,
      "context": [
        {
          "id": "h15o80q",
          "author": "Electrical-Ad678",
          "body": "Yes! I’m 5’9 and 115kgs with arfid, pcos and a genetic thyroid issue. Talk about triple homicide lol \nI’m having gastric sleeve in March and have been in therapy for arfid for 2 years",
          "created_utc": 1623249253.0
        }
      ]
    },
    {
      "id": "h1dduxy",
      "author": "None",
      "body": "Well good to know I’m not alone then.",
      "created_utc": 1623389448.0,
      "score": 1,
      "context": [
        {
          "id": "h15gdd5",
          "author": "None",
          "body": "Yes. Very overweight /obese.",
          "created_utc": 1623245826.0
        }
      ]
    },
    {
      "id": "h1de15f",
      "author": "None",
      "body": "Yeah I wish there was a diet that would allow me to still eat my safe foods while also losing weight but I’ve found nothing that would work. I’ve honestly given up at this point and accepted I’m always going to have a huge body that no one likes.",
      "created_utc": 1623389574.0,
      "score": 1,
      "context": [
        {
          "id": "h166960",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1623256552.0
        }
      ]
    },
    {
      "id": "h1ddu6d",
      "author": "None",
      "body": "Well I think that might have to do with your gender. I’ve noticed that women have a harder time with weight generally more so than guys but that’s just what I’ve observed. It doesn’t mean I’m right, it’s just an observation.\n\nBut I’m sorry for your experience, I’m sure trying to gain a healthy weight is just as hard as losing weight is.",
      "created_utc": 1623389433.0,
      "score": 2,
      "context": [
        {
          "id": "h16iczm",
          "author": "RoyalSeraph",
          "body": "I actually had the complete opposite experience. I was underweight until high school years and had to endure a trillion classroom lectures about how **my exact lifestyle and diet** cause obesity. Year after year. Month after month. News article after news article. I was a young boy wishing to gain weight and hearing repeatedly how my lifestyle causes the exact opposite of what actually happens.\n\nIf that's not enough, only when my safe list got larger and I started working out I reached weight I'm satisfied with. The irony.",
          "created_utc": 1623261392.0
        }
      ]
    },
    {
      "id": "h1de93q",
      "author": "None",
      "body": "I’m terrible with numbers so I don’t think counting calories would really help me. I do want to exercise more but I have a low pain tolerance so the aches and pains I get from it are excruciating for me to deal with.",
      "created_utc": 1623389729.0,
      "score": 1,
      "context": [
        {
          "id": "h160bwq",
          "author": "None",
          "body": "I am overweight. I want to lose 30lbs. I got an a treadmill and we also have a recumbent bike. So I have been trying to use those. Counting calories helps a lot, if you're able to do it without being obsessive. Also, being part of a community or having someone to chat with about your health/weight helps too.",
          "created_utc": 1623254202.0
        }
      ]
    },
    {
      "id": "h1deytv",
      "author": "None",
      "body": "I haven’t been at a healthy weight since I was 10 or 11 years old. I’ve always been overweight but it used to be just a little bit but now it’s a lot. I’ve tried to change for years but it never worked",
      "created_utc": 1623390256.0,
      "score": 2,
      "context": [
        {
          "id": "h17g9kc",
          "author": "StormTheParade",
          "body": "YES!! I also struggle with emotional eating, so it's like a double whammy. But it was the same story for me, I started gaining weight my senior year of high school and now I fluctuate. I'll have a year or so of being \"overweight\" (just barely) and then a year where I'm at a healthy weight. It's super weird and I struggle a lot with the insecurity that comes with it.\n\nI'm so used to people saying they're *underweight* because of it, so I always felt like an outsider even in the ARFID community. I don't eat any seafood, no meats besides fried chicken or bacon, no fruits or veggies unless they're blended/juiced... I used to hate water so I would compromise by drinking flavoured water using stuff like crystal light or Mio or Propel. Now I can only drink water if it's basically ice cold.\n\nI also replaced my soda addiction for fruit juice in the hopes of getting a little more nutrients in me. I also started going for walks a while back just to get a bit of movement - it's not \"working out\" or vigorous exercise but at least I get a little cardio in, so to speak. I also try to prevent myself from snacking too much, which can help a little.",
          "created_utc": 1623275208.0
        }
      ]
    },
    {
      "id": "h1rwz02",
      "author": "crystalfairie",
      "body": "Just be careful with juices. Only because of the sugar. I tried the same, all I could drink was coke or apple juice. Less than a year in I'm diabetic and cannot control it. You don't want emotional eating, afrid and diabetes all at once. It fucks you up, hard",
      "created_utc": 1623705135.0,
      "score": 1,
      "context": [
        {
          "id": "h17g9kc",
          "author": "StormTheParade",
          "body": "YES!! I also struggle with emotional eating, so it's like a double whammy. But it was the same story for me, I started gaining weight my senior year of high school and now I fluctuate. I'll have a year or so of being \"overweight\" (just barely) and then a year where I'm at a healthy weight. It's super weird and I struggle a lot with the insecurity that comes with it.\n\nI'm so used to people saying they're *underweight* because of it, so I always felt like an outsider even in the ARFID community. I don't eat any seafood, no meats besides fried chicken or bacon, no fruits or veggies unless they're blended/juiced... I used to hate water so I would compromise by drinking flavoured water using stuff like crystal light or Mio or Propel. Now I can only drink water if it's basically ice cold.\n\nI also replaced my soda addiction for fruit juice in the hopes of getting a little more nutrients in me. I also started going for walks a while back just to get a bit of movement - it's not \"working out\" or vigorous exercise but at least I get a little cardio in, so to speak. I also try to prevent myself from snacking too much, which can help a little.",
          "created_utc": 1623275208.0
        }
      ]
    },
    {
      "id": "h1df194",
      "author": "None",
      "body": "Same here, I eat a lot of chicken nuggets or tenders whenever I go out because I like it and it’s cheap",
      "created_utc": 1623390305.0,
      "score": 2,
      "context": [
        {
          "id": "h17jxt2",
          "author": "wyndchilde",
          "body": "Absolutely. Fast food is reliable, available, relatively affordable, and I can receive it nearly as fast as I order it. It's always the same, I know it's something I like, and it's never got weird bits in it. Same goes for pasta and potatoes.",
          "created_utc": 1623276823.0
        }
      ]
    },
    {
      "id": "l6tvb3k",
      "author": "lemurificspeckle",
      "body": "I know I’m 2 years late, but do you have any advice on what to do when weight training hasn’t been doing anything? I’m getting 20g protein with each meal and I’ve been working out for 1h x2/week for the past month, but I’ve only gained weight. I eat some sweets but not an unreasonable amount, and while my portions could probably be a bit smaller overall I do listen to my body while eating. It’s really confusing and frustrating and discouraging not being able to see any change.",
      "created_utc": 1717367347.0,
      "score": 1,
      "context": [
        {
          "id": "h17ksaa",
          "author": "DogsCanAlwaysTell",
          "body": "I was where you were, a few points into the obese BMI. I’m 23 bmi now. The only thing that has really helped is weight training and going 0 calories on all drinks. I only do it for about 20 minutes every other day and the difference in the last few months has been insane. Also, liking seafood can really work in your favour. Do you like sushi at all? Tinned sardines? Smoked fish fillets? Mackerel is my fave, I eat fish every day. Let me know if you want any help getting started with weights.",
          "created_utc": 1623277208.0
        }
      ]
    },
    {
      "id": "h1delkv",
      "author": "None",
      "body": "I hear you on not liking food. My safe foods have to be prepared perfectly just the way I like them otherwise I’m unable to eat it. Which frustrates everyone around me but I can’t help it. I take anti anxiety meds too but I haven’t had a difference in appetite but it’s different for everyone I think. \n\nMy suggestion would be to go to a therapist who specializes in food anxiety, they might be able to help you with it.",
      "created_utc": 1623389986.0,
      "score": 2,
      "context": [
        {
          "id": "h17sze1",
          "author": "czzzzzzzzzzzz",
          "body": "I am struggling with my weight right now, I can’t eat much healthy food. I had always been repulsed by food, even my safe foods were never fun or enjoyable to eat, I never understood why people were so obsessed by food. I would go all day without eating because eating was just a chore. Last October I started taking antidepressants for my anxiety. Almost immediately I became obsessed with food, the experience of eating (though I have been able to add one or two healthy foods, for the most part I still eat the same foods, just way more of them now). Suddenly I’m snacking all the time, thinking about food constantly. And yeah, I’ve gained 25 pounds since then and I can’t seem to stop gaining weight. I’m getting pretty freaked out and trying to lose weight by doing calories in/calories out. Even thinking about stopping the meds but idk what that would do to my anxiety and food anxiety especially. So you’re not alone",
          "created_utc": 1623281100.0
        }
      ]
    },
    {
      "id": "h1dec13",
      "author": "None",
      "body": "I’m sorry to hear that",
      "created_utc": 1623389789.0,
      "score": 1,
      "context": [
        {
          "id": "h16kudn",
          "author": "killrtaco",
          "body": "Everything I eat is unhealthy. I am severely depressed with my diet. I am still under weight because I mainly eat 1 meal a day if that and then just snack thru out the day.\n\nWhich in itself isn't healthy",
          "created_utc": 1623262426.0
        }
      ]
    },
    {
      "id": "h1dfaxd",
      "author": "None",
      "body": "Thanks for the suggestions! I’ll try looking into that",
      "created_utc": 1623390502.0,
      "score": 1,
      "context": [
        {
          "id": "h18ovx4",
          "author": "FeministAsian",
          "body": "I definitely have gained weight especially with the pandemic. I started working in an office and living on the second floor of an apartment compared to walking around college campus and living on a third floor walk up with high ceilings on each floor (historic building). My lifestyle changed but my eating did not. Actually it may have gotten worse because I would get a muffin and a big smoothie (mint cream, not fruit) on many mornings. I hit the heaviest I’ve ever been back last summer and then through December. In January of this year I started using an app to count my calories and I’ve lost 46 pounds! No exercise or weird diet foods just portion control.\n\nMy comfort food is pasta with butter and cheese. I love fried chicken (no bones tho so basically chicken tenders) and French fries. I hate salad and sandwiches and veggies. My diet is mostly junk food. I know I will not get to my ultimate goal weight without exercise (ugh but it’s so hot in the summer). It’s a big struggle to diet with ARFID so I applaud you!\n\nInstead of chocolate milk maybe look into Ensure (located near pharmacy). They have a protein option that’s less than 200 calories and tastes good! It’s expensive but it helps me get my vitamins in. Instead of soda and juice have you tried vitamin water? Or Gatorade even? Both have zero calorie options and can be very sweet. \n\nBest of luck with everything!!!",
          "created_utc": 1623297209.0
        }
      ]
    },
    {
      "id": "h1deq8a",
      "author": "None",
      "body": "You’re lucky then, my metabolism shut down two years ago and anything I eat shows on my body now. No I haven’t because I have a fear of trying new foods/drinks but if I get past that then I could try that",
      "created_utc": 1623390082.0,
      "score": 1,
      "context": [
        {
          "id": "h169ti4",
          "author": "None",
          "body": "i eat an incredible amount of candy, pasta, pizza, and deep fried fast food, but my metabolism is still decent at 20yrs. have you tried water flavorings? ive been obsessed with topo chico recently which is carbonated mineral water",
          "created_utc": 1623257951.0
        }
      ]
    },
    {
      "id": "h1dffn9",
      "author": "None",
      "body": "I honestly wish there was way that I could eat normally so I could look better and be healthy but I’ve had no luck so far. And yeah, I don’t necessarily overeat but I do feel hungry the majority of the time.",
      "created_utc": 1623390599.0,
      "score": 1,
      "context": [
        {
          "id": "h185kql",
          "author": "Charle_65",
          "body": "I've always wondered what would happen to unhealthy food avoiders if they were transplanted a healthy person's gut bacteria...\n\n You're definitely not the only one it's easy to overeat processed food , even more so when you're malnourished/deficient nutritionally and crave anything that has vitamins and minerals",
          "created_utc": 1623287307.0
        }
      ]
    },
    {
      "id": "h1df362",
      "author": "None",
      "body": "What diet have you done to help you lose weight?",
      "created_utc": 1623390343.0,
      "score": 1,
      "context": [
        {
          "id": "h188to9",
          "author": "anonymous-musician",
          "body": "Yep, I am trying to lose weight right now, and figuring out a diet I could actually eat was a nightmare.",
          "created_utc": 1623288910.0
        }
      ]
    },
    {
      "id": "h1df8of",
      "author": "None",
      "body": "I’m more worried about my weight because I care what other people think of me. I feel that no guy or girl would ever want to date/marry me if I look like this. I’ve been trying to get better for years but nothing worked since I cannot change my diet, every time I tried I would get sick from it and have anxiety.",
      "created_utc": 1623390458.0,
      "score": 1,
      "context": [
        {
          "id": "h18be7i",
          "author": "broken_krystal_ball",
          "body": "I feel you. I'm not like huge but I have some extra pounds and they are noticeable. I don't consider my weight to really be a bad thing as I've learned to love myself. I'm more worried about my future health. I do want to say this, we can get better but it starts with your thoughts.",
          "created_utc": 1623290187.0
        }
      ]
    },
    {
      "id": "h180bl0",
      "author": "axw3555",
      "body": "Nope, far from alone. The problem is that society is conditioned to treat EDs like they’re all about weight loss. If you’re severely underweight, you’re a medical case and normal people sympathise. But overweight is that you’re lazy or greedy, there’s no way it can be an illness.",
      "created_utc": 1623284741.0,
      "score": 8,
      "context": [
        {
          "id": "h154oal",
          "author": "axw3555",
          "body": "It’s more common than a lot of people think. \n\nI mean, my diet is bread, pizza, burger, pasta, cereal, pancakes, burgers, fried chicken, chips (as in fries, but I like the proper thick cut ones). And untold amounts of chocolate.\n\nWhen I was young, I walked everywhere, burned massive calories, so even with an awful diet, I was borderline underweight.\n\nNow I drive and work in an office. I’ve shifted from underweight to overweight in the course of the last couple of years. To the point I just got a compact treadmill to try losing weight (walking locally is… sketchy. Lots of dumb kids, bad quality surface, lots of steep hills, etc).",
          "created_utc": 1623239561.0
        },
        {
          "id": "h16wrj0",
          "author": "None",
          "body": "Well I’m glad I’m not alone then, I thought I was the only one who was dealing with this",
          "created_utc": 1623267243.0
        }
      ]
    },
    {
      "id": "h1efcs0",
      "author": "None",
      "body": "If you can, try a low impact exercise like swimming.",
      "created_utc": 1623417975.0,
      "score": 3,
      "context": [
        {
          "id": "h160bwq",
          "author": "None",
          "body": "I am overweight. I want to lose 30lbs. I got an a treadmill and we also have a recumbent bike. So I have been trying to use those. Counting calories helps a lot, if you're able to do it without being obsessive. Also, being part of a community or having someone to chat with about your health/weight helps too.",
          "created_utc": 1623254202.0
        },
        {
          "id": "h1de93q",
          "author": "None",
          "body": "I’m terrible with numbers so I don’t think counting calories would really help me. I do want to exercise more but I have a low pain tolerance so the aches and pains I get from it are excruciating for me to deal with.",
          "created_utc": 1623389729.0
        }
      ]
    },
    {
      "id": "h1rw13x",
      "author": "crystalfairie",
      "body": "Try swimming. I've got fibromyalgia so I get the pain with exercise but you have to do something., I swim. Dr requirement. The local YMCA has cheap memberships and work with you if poor. I pay 10 bucks a month. Without it this past year I gained even more weight and had multiple hospital stays with a diabetes storm. Don't do what I did. Being at deaths door 3 x over not being able to eat truly sucks horse shit.",
      "created_utc": 1623704692.0,
      "score": 2,
      "context": [
        {
          "id": "h160bwq",
          "author": "None",
          "body": "I am overweight. I want to lose 30lbs. I got an a treadmill and we also have a recumbent bike. So I have been trying to use those. Counting calories helps a lot, if you're able to do it without being obsessive. Also, being part of a community or having someone to chat with about your health/weight helps too.",
          "created_utc": 1623254202.0
        },
        {
          "id": "h1de93q",
          "author": "None",
          "body": "I’m terrible with numbers so I don’t think counting calories would really help me. I do want to exercise more but I have a low pain tolerance so the aches and pains I get from it are excruciating for me to deal with.",
          "created_utc": 1623389729.0
        }
      ]
    },
    {
      "id": "h1rx8cf",
      "author": "StormTheParade",
      "body": "I try to avoid juices with extra sugars! I read the nutrition facts before I buy anything.\n\nI would not be surprised to be diagnosed with diabetes, my only problem is that I cannot afford it lmao",
      "created_utc": 1623705258.0,
      "score": 1,
      "context": [
        {
          "id": "h17g9kc",
          "author": "StormTheParade",
          "body": "YES!! I also struggle with emotional eating, so it's like a double whammy. But it was the same story for me, I started gaining weight my senior year of high school and now I fluctuate. I'll have a year or so of being \"overweight\" (just barely) and then a year where I'm at a healthy weight. It's super weird and I struggle a lot with the insecurity that comes with it.\n\nI'm so used to people saying they're *underweight* because of it, so I always felt like an outsider even in the ARFID community. I don't eat any seafood, no meats besides fried chicken or bacon, no fruits or veggies unless they're blended/juiced... I used to hate water so I would compromise by drinking flavoured water using stuff like crystal light or Mio or Propel. Now I can only drink water if it's basically ice cold.\n\nI also replaced my soda addiction for fruit juice in the hopes of getting a little more nutrients in me. I also started going for walks a while back just to get a bit of movement - it's not \"working out\" or vigorous exercise but at least I get a little cardio in, so to speak. I also try to prevent myself from snacking too much, which can help a little.",
          "created_utc": 1623275208.0
        },
        {
          "id": "h1rwz02",
          "author": "crystalfairie",
          "body": "Just be careful with juices. Only because of the sugar. I tried the same, all I could drink was coke or apple juice. Less than a year in I'm diabetic and cannot control it. You don't want emotional eating, afrid and diabetes all at once. It fucks you up, hard",
          "created_utc": 1623705135.0
        }
      ]
    },
    {
      "id": "l6vudwq",
      "author": "DogsCanAlwaysTell",
      "body": "It’ll depend when you started training - is this a recent addition to your routine?",
      "created_utc": 1717403819.0,
      "score": 1,
      "context": [
        {
          "id": "h17ksaa",
          "author": "DogsCanAlwaysTell",
          "body": "I was where you were, a few points into the obese BMI. I’m 23 bmi now. The only thing that has really helped is weight training and going 0 calories on all drinks. I only do it for about 20 minutes every other day and the difference in the last few months has been insane. Also, liking seafood can really work in your favour. Do you like sushi at all? Tinned sardines? Smoked fish fillets? Mackerel is my fave, I eat fish every day. Let me know if you want any help getting started with weights.",
          "created_utc": 1623277208.0
        },
        {
          "id": "l6tvb3k",
          "author": "lemurificspeckle",
          "body": "I know I’m 2 years late, but do you have any advice on what to do when weight training hasn’t been doing anything? I’m getting 20g protein with each meal and I’ve been working out for 1h x2/week for the past month, but I’ve only gained weight. I eat some sweets but not an unreasonable amount, and while my portions could probably be a bit smaller overall I do listen to my body while eating. It’s really confusing and frustrating and discouraging not being able to see any change.",
          "created_utc": 1717367347.0
        }
      ]
    },
    {
      "id": "h1f28co",
      "author": "anonymous-musician",
      "body": "Intermittent fasting has worked for me. I usually have egg burrito for breakfast, some fruit as a snack mid day, then then chicken for dinner in various forms. I've had more stuck diets, like there was was a time I totally stopped eating cheese, which is my go to comfort food, and also probably the reason I'm overweight, but I just couldn't bring myself to do that this time.",
      "created_utc": 1623428289.0,
      "score": 1,
      "context": [
        {
          "id": "h188to9",
          "author": "anonymous-musician",
          "body": "Yep, I am trying to lose weight right now, and figuring out a diet I could actually eat was a nightmare.",
          "created_utc": 1623288910.0
        },
        {
          "id": "h1df362",
          "author": "None",
          "body": "What diet have you done to help you lose weight?",
          "created_utc": 1623390343.0
        }
      ]
    }
  ]
}