{
  "id": "o1krfn",
  "subreddit": "ARFID",
  "author": "SylphOfLight",
  "created_utc": 1623892556.0,
  "title": "I Finally Lost My Patience On Mainstream Reddit",
  "selftext": "",
  "url": "https://i.redd.it/qfeds8xq8q571.png",
  "score": 461,
  "num_comments": 37,
  "comments": [
    {
      "id": "h21l9dg",
      "author": "cd00",
      "body": "I always get a little sad when I see people on social media just completely shitting on picky eaters. If only they knew we hate being picky and would give anything to change that aspect of ourselves",
      "created_utc": 1623897262.0,
      "score": 136,
      "context": []
    },
    {
      "id": "h21kofj",
      "author": "Kelekona",
      "body": "Did you get any \"REEEEEEE Chicken NUGGIES\" comments yet?  I wonder if any assholes are going to pull out \"sneuflaik\"\n\nYeah, most people are ablest, and I'm not talking about the well-intentioned but misinformed kind.",
      "created_utc": 1623896979.0,
      "score": 48,
      "context": []
    },
    {
      "id": "h21vfcp",
      "author": "TrentKama",
      "body": "These threads hurt to read, but I hope you didn't delete your post. Through all the ignorance, it joys me to see some people [bringing attention](https://www.reddit.com/r/MaliciousCompliance/comments/o15wrj/the_ex_doesnt_like_the_lunches_i_pack_no_problem/h21jg1m/) to ARFID and swaying an opinion. Small steps.",
      "created_utc": 1623902926.0,
      "score": 26,
      "context": []
    },
    {
      "id": "h21pgzj",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1623899475.0,
      "score": 23,
      "context": []
    },
    {
      "id": "h221n4o",
      "author": "mrskel1",
      "body": "It frustrates me so much that it’s so hard for people to take it seriously, especially doctors!!! My daughter has  been hospitalized for issues related to her ARFID and even though the hospital recommended food therapists our insurance refuses to cover them because pediatricians will say “she’s just a picky eater”. They weren’t there when her face was sunken from weight loss or when I cried happy tears when she finally ate her first solid food (cinnamon buns) after leaving the hospital.",
      "created_utc": 1623906932.0,
      "score": 14,
      "context": []
    },
    {
      "id": "h22x0ym",
      "author": "WoodWideWeb",
      "body": "I'm sorry the comment is gone :( I went to support and ended up being disgusted at the rest of the comments. Breaks my heart to see so many people shitting on people with food/texture/any sensitivities with one person going so far as to equate sensitive to fat/lazy/spoiled??? What is wrong with these people? I implore everyone to look up the actual synonyms for sensitive it helped me feel better.\n\nSo many people wanting to be future parents advocating for super forceful parenting styles, (Eat this or starve! Eat the school lunch food or make your own damn lunch!) The OP of the thread even said if his kids said they didn't want to see their mother anymore (parents are seperated) that he wouldn't allow them to not see her. WHAT? I hope the kids that end up in these scenarios can handle this stuff okay or better yet the possible future parents grow up and listen to their kids. I can't believe how selfish and cruel some people can be. And to CHILDREN.",
      "created_utc": 1623932018.0,
      "score": 11,
      "context": []
    },
    {
      "id": "h21r7oo",
      "author": "yakuzie",
      "body": "👏👏👏 amen",
      "created_utc": 1623900451.0,
      "score": 5,
      "context": []
    },
    {
      "id": "h22kr0k",
      "author": "None",
      "body": "Such a good post.\n\nThank you.",
      "created_utc": 1623922701.0,
      "score": 4,
      "context": []
    },
    {
      "id": "h24oebo",
      "author": "throwaway-m1",
      "body": "Once I made a post in a healthy eating sub asking for advice on new foods to incorporate with ARFID and people where SO mean. I got like 50 comments and only like two of them where nice.",
      "created_utc": 1623960275.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h257vdb",
      "author": "TemperanceL",
      "body": "Yeah there's definitely a lot of ignorance still around ARFID. I mean, even from nutritionnists and such, I'm pretty sure there's got to be like 5 at max who know about it in my country in the EU. And I think, as with a lot of mental health stuff, representation in media always plays a big part in people's knowledge and impression of different things,and I'm pretty sure just like you all, I have never even seen any character ever with ARFID.\n\nI'm lucky I've mostly had folks not be too judgemental/harsh about it, just accepting it/ not caring and moving on, but there can still be the small joke here and there, not even meant to insult, but that can be a bit hurtful after you've heard a lot about \"what, you've never eaten pizza/hamburger/ x type of food? you're missing out you know...\"\n(special mention here to family members and friends who've been really understanding to me, especially when I've managed to explain more about what's my problem thanks to knowing about ARFID. I know I'm very lucky to have that and hey, if your family and friends aren't as supportive, know that this community is, and we understand the struggle)\n\nAt the end of the day, it's just like a lot of mental health issue, since you know, it is one itself. Just like you won't cure someone suffering from depression by telling them to enjoy life more, you won't solve someone's arfid by shoving food in their mouth.\n\nJust like with other mental health issue, it's something that takes a lot of time to try and improve upon. Something that bothers you a lot (not ranking anything here, it's just that it's something that bother you in every day life, in situations where other folks might not even think about it, like jesus the amount of thinking I waste because hanging out with folks who don't know your food problems is so annoying since you always wonder where you'll eat, wether there'd be something there for you to eat...), and just like with other mental health issues, while it doesn't shows on our faces, it doesn't mean that it's not there.\n\nGood luck to you all, I've only started to try out some food sometime that isn't too far in texture from what I normally eat at 22. I'm 24 now, my diet has barely changed, I've only tried small things here and there. Still, I'm super proud that now I've started to try things a bit from time to time. And there's no shame in how long it might take you to try. There's no shame in not swallowing things when you try them, or gagging just by trying to bite something, smelling it... Mental health isn't sometyhing you can magically have full control over. But I believe in you. Even if it takes you years to try some stuff, even if you just try that one thing that one time, it's still progress, trying out even one new thing is still a huge improvement and we're proud of you. And I'm glad there are folks talking about it when we get the opportunity. That's how folks will slowly learn of it. Even if it takes time, it's worth spreading the word, especially since it helps folks suffering from it know this diagnosis even exist. I know it's been a huige relief to know this exist and to finally learn some more stuff about this whole big part of me. And I'm sure it'll be just as useful to many others suffering from this.",
      "created_utc": 1623969049.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h23zuht",
      "author": "OverlordQuasar",
      "body": "Thank you for fighting the good fight. It’s exhausting and slow progress, but it’s the only way to get rid of the stigma.",
      "created_utc": 1623949934.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h249c02",
      "author": "None",
      "body": "Thanks for being the hero we need.",
      "created_utc": 1623953897.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h21ik6g",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1623895915.0,
      "score": -46,
      "context": []
    },
    {
      "id": "h2yj9rw",
      "author": "L0tuslol",
      "body": "Some of the reply’s and comments are so horrible someone commented something about Ed’s and someone replied and said that there’s no such thing as Ed’s just kids who were spoiled as a child",
      "created_utc": 1624593768.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h21lptv",
      "author": "AshOfTheLilacs",
      "body": "no you see the person who can't eat much without gagging is just doing it for attention obviously",
      "created_utc": 1623897490.0,
      "score": 73,
      "context": [
        {
          "id": "h21l9dg",
          "author": "cd00",
          "body": "I always get a little sad when I see people on social media just completely shitting on picky eaters. If only they knew we hate being picky and would give anything to change that aspect of ourselves",
          "created_utc": 1623897262.0
        }
      ]
    },
    {
      "id": "h221ud8",
      "author": "jdf2",
      "body": "Anybody seen the tweet about “drinking soda is a turn off”: https://twitter.com/shaydozer/status/1400292964165996551?s=21\n\nSome of the replies to that tweet my god.\n\n> Drinking soda pop past the age of 20 literally is “acting like a child.” What was his main course? Chicken fingers? A hotdog with ketchup?\n\n> people are willfully misinterpreting the point at issue as a matter of health or diet, but clearly the issue is that it is unattractive to knock back four cokes like a god damned 9 year old at chuck e cheez\n\nThere are so so many more. I just wow I know Twitter is toxic but this is by far the most toxic non political tweet replies I’ve seen.\n\nLike yeah soda isn’t good for you, and 4 cups is a bit much. But we don’t even know how large the cups were. I normally order water nowadays but I know for a fact when I’m nervous while out to eat I drink like crazy. I’ll go through 5 glasses of water in no time. So if that was soda in front of me I’d be doing the same thing.\n\nAnd then the whole ghosting the guy over it like how immature can you be. You notice one thing on the first date “oh wow he drank 4 cups of coke” and decide to ghost him. Couldn’t ya know be an adult and ask “Ha ha sure did drink a lot of coke is that common for you?” You’re on a date you can ask questions like that.\n\nNow not wanting to be with someone because their life style/health is something you couldn’t support is totally ok and understandable, but you can’t immediately judge those factors from a first date unless it’s super duper obviously a common issue. \n\nAtleast let the guy know why you didn’t want to have a 2nd date instead of ghosting over his drinks. That’s just honestly the most annoying part of it all to me, ghosting is one of the most childish things someone can do when dating.\n\nAnd the comparisons to it being the person acting like a child? Uh the other majority of America adults included drink a lot of soda. (Not to mention this country’s unhealthy obsession of alcohol) It’s definitely not a trait I attribute to being childish.",
      "created_utc": 1623907074.0,
      "score": 20,
      "context": [
        {
          "id": "h21l9dg",
          "author": "cd00",
          "body": "I always get a little sad when I see people on social media just completely shitting on picky eaters. If only they knew we hate being picky and would give anything to change that aspect of ourselves",
          "created_utc": 1623897262.0
        }
      ]
    },
    {
      "id": "h24zbl1",
      "author": "SylphOfLight",
      "body": "It's always how it goes, when someone has a struggle and that inconveniences someone else, they never stop to realize the person who is struggling is just as, if not literally more than, inconvenienced by their own struggle.",
      "created_utc": 1623964996.0,
      "score": 7,
      "context": [
        {
          "id": "h21l9dg",
          "author": "cd00",
          "body": "I always get a little sad when I see people on social media just completely shitting on picky eaters. If only they knew we hate being picky and would give anything to change that aspect of ourselves",
          "created_utc": 1623897262.0
        }
      ]
    },
    {
      "id": "h4avg0r",
      "author": "shrek_cena",
      "body": "Get an adenoidectomy",
      "created_utc": 1625618852.0,
      "score": 1,
      "context": [
        {
          "id": "h21l9dg",
          "author": "cd00",
          "body": "I always get a little sad when I see people on social media just completely shitting on picky eaters. If only they knew we hate being picky and would give anything to change that aspect of ourselves",
          "created_utc": 1623897262.0
        }
      ]
    },
    {
      "id": "h24zyze",
      "author": "SylphOfLight",
      "body": "Surprisingly, no, I think my comment got buried once the thread took off, even though I commented while it was still young by Reddit's standards (less thank 1k)  \n\n\nSadly, they are indeed. Ignorance leading to arrogance. Clearly the people who've never had this experience know everything about it, right?",
      "created_utc": 1623965288.0,
      "score": 11,
      "context": [
        {
          "id": "h21kofj",
          "author": "Kelekona",
          "body": "Did you get any \"REEEEEEE Chicken NUGGIES\" comments yet?  I wonder if any assholes are going to pull out \"sneuflaik\"\n\nYeah, most people are ablest, and I'm not talking about the well-intentioned but misinformed kind.",
          "created_utc": 1623896979.0
        }
      ]
    },
    {
      "id": "h250px0",
      "author": "SylphOfLight",
      "body": "Thank you for saying so, because I actually did almost delete it after I posted but then I decided to stick to my guns. My comment is still up, unless a Mod deemed it unacceptable.  \n\n\nI'm glad that our voices are starting to slowly have a platform to be heard.",
      "created_utc": 1623965633.0,
      "score": 2,
      "context": [
        {
          "id": "h21vfcp",
          "author": "TrentKama",
          "body": "These threads hurt to read, but I hope you didn't delete your post. Through all the ignorance, it joys me to see some people [bringing attention](https://www.reddit.com/r/MaliciousCompliance/comments/o15wrj/the_ex_doesnt_like_the_lunches_i_pack_no_problem/h21jg1m/) to ARFID and swaying an opinion. Small steps.",
          "created_utc": 1623902926.0
        }
      ]
    },
    {
      "id": "h22xtse",
      "author": "RomanMaroney",
      "body": "Don't be scared about it. Just own it. It's you and you're pretty cool. Don't be afraid to laugh or rip on yourself. So you're a little weird about something. So what? I'm weird just like you. Everyone is weird. Try not to be weird about being weird.",
      "created_utc": 1623932517.0,
      "score": 10,
      "context": [
        {
          "id": "h21pgzj",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1623899475.0
        }
      ]
    },
    {
      "id": "h24qjh1",
      "author": "ash_rock",
      "body": "If your eating habits are super severe and you are concerned that you might not get enough to eat, try to get in contact with the dining hall staff or the person who accommodates allergies. If they are a decent human being, they will be willing to make certain meals to prevent you from starving.",
      "created_utc": 1623961185.0,
      "score": 3,
      "context": [
        {
          "id": "h21pgzj",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1623899475.0
        }
      ]
    },
    {
      "id": "h250jcb",
      "author": "SylphOfLight",
      "body": "You're gonna do great! It's scary go out there and be yourself, but I'm a fan of the philosophy that if someone is going to mock or belittle the way I eat, then that's my warning that they're not a good person and I don't need to have them in my life. Some people are going to judge, but there's people out there who will judge you for your favorite color or for your favorite movie. Take pride in who you are and know your worth isn't linked to your dietary habits or people's opinion of them. You'll find people who understand and you'll find people who are ignorant but willing to learn and accommodate. Good luck at university!",
      "created_utc": 1623965549.0,
      "score": 2,
      "context": [
        {
          "id": "h21pgzj",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1623899475.0
        }
      ]
    },
    {
      "id": "h253x4e",
      "author": "SylphOfLight",
      "body": "The amount of medical professionals who disregard or are straight up ignorant about it is astounding. I can remember when it was finally formally classified as a disorder and crying because I finally had a name for what I was going through and learning I wasn't alone.\n\nI'm so sorry you and your daughter have gone through those experiences and I hope things are going better now. The resources are scarce but they're there, and medical professionals should be building up more not tearing down birdges. If you can, it might not hurt to try and contest the insurance. Did they request a prior authorization? Admittedly I haven't done this myself, but I have heard around that when denied a PA to call up the insurance and request the credentials of the person who made the judgement, as it's often just a minimum wage worker with no training a textbook of highlighted words on what to say \"no\" to. Supposedly, they often turn around and grant it.",
      "created_utc": 1623967127.0,
      "score": 3,
      "context": [
        {
          "id": "h221n4o",
          "author": "mrskel1",
          "body": "It frustrates me so much that it’s so hard for people to take it seriously, especially doctors!!! My daughter has  been hospitalized for issues related to her ARFID and even though the hospital recommended food therapists our insurance refuses to cover them because pediatricians will say “she’s just a picky eater”. They weren’t there when her face was sunken from weight loss or when I cried happy tears when she finally ate her first solid food (cinnamon buns) after leaving the hospital.",
          "created_utc": 1623906932.0
        }
      ]
    },
    {
      "id": "h252uon",
      "author": "SylphOfLight",
      "body": "[The comment is still up,](https://www.reddit.com/r/MaliciousCompliance/comments/o15wrj/the_ex_doesnt_like_the_lunches_i_pack_no_problem/h219f9k?utm_source=share&utm_medium=web2x&context=3) unless a mod took it down and I'm the only one with access to it. (I usually lurk on Reddit so I'm not too sure how that works.) I didn't link it initially because I didn't want to subject anyone to the plethora of ableist comments. It's truly disgusting the amount of people who don't bother to think beyond themselves and realize that no one willingly places themselves in a situation to be ridiculed or *starve*.\n\nThere's a lot of parents out there that shouldn't be, unfortunately, and I only hope that the kids who grow up in those homes are able to have access to healthy resources and are able to create a positive support group of friends.",
      "created_utc": 1623966628.0,
      "score": 3,
      "context": [
        {
          "id": "h22x0ym",
          "author": "WoodWideWeb",
          "body": "I'm sorry the comment is gone :( I went to support and ended up being disgusted at the rest of the comments. Breaks my heart to see so many people shitting on people with food/texture/any sensitivities with one person going so far as to equate sensitive to fat/lazy/spoiled??? What is wrong with these people? I implore everyone to look up the actual synonyms for sensitive it helped me feel better.\n\nSo many people wanting to be future parents advocating for super forceful parenting styles, (Eat this or starve! Eat the school lunch food or make your own damn lunch!) The OP of the thread even said if his kids said they didn't want to see their mother anymore (parents are seperated) that he wouldn't allow them to not see her. WHAT? I hope the kids that end up in these scenarios can handle this stuff okay or better yet the possible future parents grow up and listen to their kids. I can't believe how selfish and cruel some people can be. And to CHILDREN.",
          "created_utc": 1623932018.0
        }
      ]
    },
    {
      "id": "h250ss3",
      "author": "SylphOfLight",
      "body": "Thank *you*!",
      "created_utc": 1623965670.0,
      "score": 1,
      "context": [
        {
          "id": "h22kr0k",
          "author": "None",
          "body": "Such a good post.\n\nThank you.",
          "created_utc": 1623922701.0
        }
      ]
    },
    {
      "id": "h2513my",
      "author": "SylphOfLight",
      "body": "It honestly always amazes me how judgemental people can be about something that doesn't affect them, being different is just too wild a concept for some people. I'm sorry you had to go through that.",
      "created_utc": 1623965809.0,
      "score": 4,
      "context": [
        {
          "id": "h24oebo",
          "author": "throwaway-m1",
          "body": "Once I made a post in a healthy eating sub asking for advice on new foods to incorporate with ARFID and people where SO mean. I got like 50 comments and only like two of them where nice.",
          "created_utc": 1623960275.0
        }
      ]
    },
    {
      "id": "h251mot",
      "author": "SylphOfLight",
      "body": "Thank you, and thank you for fighting too. It's hard work but I think we're slowly breaking ground. If anything, we're laying the foundation for those like us in the future, and that's worth fighting for alone.",
      "created_utc": 1623966055.0,
      "score": 1,
      "context": [
        {
          "id": "h23zuht",
          "author": "OverlordQuasar",
          "body": "Thank you for fighting the good fight. It’s exhausting and slow progress, but it’s the only way to get rid of the stigma.",
          "created_utc": 1623949934.0
        }
      ]
    },
    {
      "id": "h2515k8",
      "author": "SylphOfLight",
      "body": "Oh my goodness that's very kind of you, thank you!",
      "created_utc": 1623965834.0,
      "score": 1,
      "context": [
        {
          "id": "h249c02",
          "author": "None",
          "body": "Thanks for being the hero we need.",
          "created_utc": 1623953897.0
        }
      ]
    },
    {
      "id": "h21ll4i",
      "author": "AshOfTheLilacs",
      "body": "do fuck off my good chap",
      "created_utc": 1623897422.0,
      "score": 25,
      "context": [
        {
          "id": "h21ik6g",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1623895915.0
        }
      ]
    },
    {
      "id": "h221a3s",
      "author": "sayhellotojenn",
      "body": "Imagine seeing someone proud they stood up for themselves and looking to share their accomplishment and for no discernible reason deciding to shit on them instead when it affects you not at all.",
      "created_utc": 1623906682.0,
      "score": 10,
      "context": [
        {
          "id": "h21ik6g",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1623895915.0
        }
      ]
    },
    {
      "id": "h22151d",
      "author": "capitannn",
      "body": "Go away",
      "created_utc": 1623906585.0,
      "score": 2,
      "context": [
        {
          "id": "h21ik6g",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1623895915.0
        }
      ]
    },
    {
      "id": "h2237qh",
      "author": "witchofheavyjapaesth",
      "body": "Imagine being like you lmao gross",
      "created_utc": 1623908059.0,
      "score": 4,
      "context": [
        {
          "id": "h21ik6g",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1623895915.0
        }
      ]
    },
    {
      "id": "h24zo84",
      "author": "SylphOfLight",
      "body": "Gotta love the length assholes think people will go just to inconvenience *them,* as if being made fun of constantly for being different is fun or something",
      "created_utc": 1623965152.0,
      "score": 16,
      "context": [
        {
          "id": "h21l9dg",
          "author": "cd00",
          "body": "I always get a little sad when I see people on social media just completely shitting on picky eaters. If only they knew we hate being picky and would give anything to change that aspect of ourselves",
          "created_utc": 1623897262.0
        },
        {
          "id": "h21lptv",
          "author": "AshOfTheLilacs",
          "body": "no you see the person who can't eat much without gagging is just doing it for attention obviously",
          "created_utc": 1623897490.0
        }
      ]
    },
    {
      "id": "h247k3l",
      "author": "Kelekona",
      "body": "I was going to say... rum cokes.  Drinking cola as an adult is acceptable... or is it only acceptable when there is rum in it?",
      "created_utc": 1623953144.0,
      "score": 15,
      "context": [
        {
          "id": "h21l9dg",
          "author": "cd00",
          "body": "I always get a little sad when I see people on social media just completely shitting on picky eaters. If only they knew we hate being picky and would give anything to change that aspect of ourselves",
          "created_utc": 1623897262.0
        },
        {
          "id": "h221ud8",
          "author": "jdf2",
          "body": "Anybody seen the tweet about “drinking soda is a turn off”: https://twitter.com/shaydozer/status/1400292964165996551?s=21\n\nSome of the replies to that tweet my god.\n\n> Drinking soda pop past the age of 20 literally is “acting like a child.” What was his main course? Chicken fingers? A hotdog with ketchup?\n\n> people are willfully misinterpreting the point at issue as a matter of health or diet, but clearly the issue is that it is unattractive to knock back four cokes like a god damned 9 year old at chuck e cheez\n\nThere are so so many more. I just wow I know Twitter is toxic but this is by far the most toxic non political tweet replies I’ve seen.\n\nLike yeah soda isn’t good for you, and 4 cups is a bit much. But we don’t even know how large the cups were. I normally order water nowadays but I know for a fact when I’m nervous while out to eat I drink like crazy. I’ll go through 5 glasses of water in no time. So if that was soda in front of me I’d be doing the same thing.\n\nAnd then the whole ghosting the guy over it like how immature can you be. You notice one thing on the first date “oh wow he drank 4 cups of coke” and decide to ghost him. Couldn’t ya know be an adult and ask “Ha ha sure did drink a lot of coke is that common for you?” You’re on a date you can ask questions like that.\n\nNow not wanting to be with someone because their life style/health is something you couldn’t support is totally ok and understandable, but you can’t immediately judge those factors from a first date unless it’s super duper obviously a common issue. \n\nAtleast let the guy know why you didn’t want to have a 2nd date instead of ghosting over his drinks. That’s just honestly the most annoying part of it all to me, ghosting is one of the most childish things someone can do when dating.\n\nAnd the comparisons to it being the person acting like a child? Uh the other majority of America adults included drink a lot of soda. (Not to mention this country’s unhealthy obsession of alcohol) It’s definitely not a trait I attribute to being childish.",
          "created_utc": 1623907074.0
        }
      ]
    },
    {
      "id": "h2i4iaz",
      "author": "Kalldaro",
      "body": " Coke is seriously the only thing that settles my stomach in the morning. I've tried nearly everything the internet suggests but coke is the only sure fire thing that works. I'll take an unhealthy beverage over feeling nauseous all morning.",
      "created_utc": 1624248407.0,
      "score": 5,
      "context": [
        {
          "id": "h21l9dg",
          "author": "cd00",
          "body": "I always get a little sad when I see people on social media just completely shitting on picky eaters. If only they knew we hate being picky and would give anything to change that aspect of ourselves",
          "created_utc": 1623897262.0
        },
        {
          "id": "h221ud8",
          "author": "jdf2",
          "body": "Anybody seen the tweet about “drinking soda is a turn off”: https://twitter.com/shaydozer/status/1400292964165996551?s=21\n\nSome of the replies to that tweet my god.\n\n> Drinking soda pop past the age of 20 literally is “acting like a child.” What was his main course? Chicken fingers? A hotdog with ketchup?\n\n> people are willfully misinterpreting the point at issue as a matter of health or diet, but clearly the issue is that it is unattractive to knock back four cokes like a god damned 9 year old at chuck e cheez\n\nThere are so so many more. I just wow I know Twitter is toxic but this is by far the most toxic non political tweet replies I’ve seen.\n\nLike yeah soda isn’t good for you, and 4 cups is a bit much. But we don’t even know how large the cups were. I normally order water nowadays but I know for a fact when I’m nervous while out to eat I drink like crazy. I’ll go through 5 glasses of water in no time. So if that was soda in front of me I’d be doing the same thing.\n\nAnd then the whole ghosting the guy over it like how immature can you be. You notice one thing on the first date “oh wow he drank 4 cups of coke” and decide to ghost him. Couldn’t ya know be an adult and ask “Ha ha sure did drink a lot of coke is that common for you?” You’re on a date you can ask questions like that.\n\nNow not wanting to be with someone because their life style/health is something you couldn’t support is totally ok and understandable, but you can’t immediately judge those factors from a first date unless it’s super duper obviously a common issue. \n\nAtleast let the guy know why you didn’t want to have a 2nd date instead of ghosting over his drinks. That’s just honestly the most annoying part of it all to me, ghosting is one of the most childish things someone can do when dating.\n\nAnd the comparisons to it being the person acting like a child? Uh the other majority of America adults included drink a lot of soda. (Not to mention this country’s unhealthy obsession of alcohol) It’s definitely not a trait I attribute to being childish.",
          "created_utc": 1623907074.0
        }
      ]
    },
    {
      "id": "h252vxw",
      "author": "Kelekona",
      "body": "I don't have ARFID and I probably don't even fall into the picky category because of how narrow my \"no\" category is.  (I will very rarely eat raw fruit that is not in the culinary vegetable category because of unpredictability, and it's apparently common enough to be normal.  Also I have a cilantro-response to all melon including watermelon and cucumber but can tolerate it with vinegar.)\n\nBut I think I can grasp enough about ARFID to be here and offer suggestions.  I won't eat bugs that haven't been ground into paste and I'm squeamish about pet food even though I know that USA requires it to meet standards for human consumption.  Apparently ARFID people could feel that way about food that I want to eat.\n\nGrowing up in special ed, and probably more importantly riding the bus with the full spectrum of non-typical, those were lessons in empathy that I wish that more people could learn.  (It was a full size bus, but six wheelchair tie-downs and the lift meant that the amount of students that would fit in a short bus needed the full chassis.)",
      "created_utc": 1623966644.0,
      "score": 4,
      "context": [
        {
          "id": "h21kofj",
          "author": "Kelekona",
          "body": "Did you get any \"REEEEEEE Chicken NUGGIES\" comments yet?  I wonder if any assholes are going to pull out \"sneuflaik\"\n\nYeah, most people are ablest, and I'm not talking about the well-intentioned but misinformed kind.",
          "created_utc": 1623896979.0
        },
        {
          "id": "h24zyze",
          "author": "SylphOfLight",
          "body": "Surprisingly, no, I think my comment got buried once the thread took off, even though I commented while it was still young by Reddit's standards (less thank 1k)  \n\n\nSadly, they are indeed. Ignorance leading to arrogance. Clearly the people who've never had this experience know everything about it, right?",
          "created_utc": 1623965288.0
        }
      ]
    },
    {
      "id": "h25vfx2",
      "author": "WoodWideWeb",
      "body": "I saw it in your comment history on your profile but every time I tap to go to it it just says 'Wow such empty.' Must be a glitch on my end! I was primarily a lurker until recently but I still mostly lurk. Only certain communities feel safe to me to comment and even then they aren't always safe. It only takes one asshole!\n\nI agree completely I hope the world keeps getting better with supports available for children and people who have any sort of difficulties with eating! I hope there's also more education for people who don't struggle like we do so they can learn and maybe care more? I'm trying to break stigmas within my own friend group and if I ever hear someone speaking about their child/family member/friend/partner like some of those comments I will absolutely speak up and try to encourage them to see from the other's perspective. We deserve so much better!! Recovery is hard enough!",
      "created_utc": 1623981490.0,
      "score": 4,
      "context": [
        {
          "id": "h22x0ym",
          "author": "WoodWideWeb",
          "body": "I'm sorry the comment is gone :( I went to support and ended up being disgusted at the rest of the comments. Breaks my heart to see so many people shitting on people with food/texture/any sensitivities with one person going so far as to equate sensitive to fat/lazy/spoiled??? What is wrong with these people? I implore everyone to look up the actual synonyms for sensitive it helped me feel better.\n\nSo many people wanting to be future parents advocating for super forceful parenting styles, (Eat this or starve! Eat the school lunch food or make your own damn lunch!) The OP of the thread even said if his kids said they didn't want to see their mother anymore (parents are seperated) that he wouldn't allow them to not see her. WHAT? I hope the kids that end up in these scenarios can handle this stuff okay or better yet the possible future parents grow up and listen to their kids. I can't believe how selfish and cruel some people can be. And to CHILDREN.",
          "created_utc": 1623932018.0
        },
        {
          "id": "h252uon",
          "author": "SylphOfLight",
          "body": "[The comment is still up,](https://www.reddit.com/r/MaliciousCompliance/comments/o15wrj/the_ex_doesnt_like_the_lunches_i_pack_no_problem/h219f9k?utm_source=share&utm_medium=web2x&context=3) unless a mod took it down and I'm the only one with access to it. (I usually lurk on Reddit so I'm not too sure how that works.) I didn't link it initially because I didn't want to subject anyone to the plethora of ableist comments. It's truly disgusting the amount of people who don't bother to think beyond themselves and realize that no one willingly places themselves in a situation to be ridiculed or *starve*.\n\nThere's a lot of parents out there that shouldn't be, unfortunately, and I only hope that the kids who grow up in those homes are able to have access to healthy resources and are able to create a positive support group of friends.",
          "created_utc": 1623966628.0
        }
      ]
    },
    {
      "id": "h228bov",
      "author": "Dethanatos",
      "body": "I do say, I believe you're right ol' bean.",
      "created_utc": 1623912023.0,
      "score": 3,
      "context": [
        {
          "id": "h21ik6g",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1623895915.0
        },
        {
          "id": "h21ll4i",
          "author": "AshOfTheLilacs",
          "body": "do fuck off my good chap",
          "created_utc": 1623897422.0
        }
      ]
    }
  ]
}