{
  "id": "o7g9vk",
  "subreddit": "ARFID",
  "author": "L0tuslol",
  "created_utc": 1624594873.0,
  "title": "Starved at camp",
  "selftext": "I got starved at camp because of my parents. My parents just put that I was picky on the paperwork for camp so I was starved because the counselor took it upon themselves to cure me of being “picky”. Which I brought a ton of snacks and food because I knew I wouldn’t like the food there and the counselors wouldn’t let me eat MY fucking that I own because I have to eat their food so as a result all I eat there was a few crackers because the nurses gave me it because of my headache. I couldn’t even enjoy camp cause I didn’t have enough energy cause all I eat the whole time was crackers and only a few and I had a severe headache.",
  "url": "https://www.reddit.com/r/ARFID/comments/o7g9vk/starved_at_camp/",
  "score": 130,
  "num_comments": 15,
  "comments": [
    {
      "id": "h2z0odv",
      "author": "None",
      "body": "Feel free to report that camp to the proper authorities. That sucks, even that feels inadequate. I don’t have much that feels like it could handle that. I’m sorry that happened to you. I know it maybe hard to do, but call the police if you ever find yourself in that situation again. You could’ve had very real health issues occur from this form of mistreatment. It takes a lot to have the courage to tell people that what they’re doing isn’t right. Sometimes you’re going to need to be your biggest advocate. Sorry this happened to you…",
      "created_utc": 1624606667.0,
      "score": 76,
      "context": []
    },
    {
      "id": "h2ylfyr",
      "author": "L0tuslol",
      "body": "Sorry if I made any spelling or grammar mistakes I was crying while making this post",
      "created_utc": 1624595116.0,
      "score": 51,
      "context": []
    },
    {
      "id": "h2z9vc1",
      "author": "asilentrose",
      "body": "I had something along those lines happen as well. They didn't starve me, most days they let me get like toast or something. But one night they forced me to eat like meat and potatoes and all I remember is vomiting all over the dining area. Scarred me pretty bad, camp was an awful experience.",
      "created_utc": 1624615425.0,
      "score": 21,
      "context": []
    },
    {
      "id": "h2yxc4w",
      "author": "umidk9",
      "body": "this is fucking horrible:(( im so sorry no one stood up for you like you deserved. Literal child abuse",
      "created_utc": 1624603750.0,
      "score": 13,
      "context": []
    },
    {
      "id": "h2zulc3",
      "author": "Gofnutz",
      "body": "Yeah, that was basically what I went through as a kid 30 years ago. Breakfast was fine because it was stuff I like but lunch and dinner I starved and the counselors would try to get me to eat whatever they had. I managed to get stuff from the small store they had that sold candy and snacks and live off of that. My parents still sent me the next year too, I hated it.",
      "created_utc": 1624629320.0,
      "score": 14,
      "context": []
    },
    {
      "id": "h2z2hcb",
      "author": "grimmistired",
      "body": "When was this?",
      "created_utc": 1624608324.0,
      "score": 6,
      "context": []
    },
    {
      "id": "h30k4bz",
      "author": "becksaw",
      "body": "I’m sorry this happened to you. Wish I could give you a big hug and tell you it’s gonna be all right because it is. Hang in there, friend.",
      "created_utc": 1624640938.0,
      "score": 4,
      "context": []
    },
    {
      "id": "h30n8hy",
      "author": "456got",
      "body": "Man I feel you. Camp was the worst for me in terms of eating. I pretty much survived off of toast. They would make a big meal for everyone at the camp and the only thing they would offer me would be toast or something else I wouldn't eat due to ARFID. note this was also after they were notified of me being a picky eater.  \n\n\nHonestly in your case I would contact authorities of some sort as that is straight up abusive AF and could have led to a serious health issue. These type of stories just makes me wish there was more awareness around it",
      "created_utc": 1624642341.0,
      "score": 4,
      "context": []
    },
    {
      "id": "h30tfpc",
      "author": "OneSmallCheeseBall",
      "body": "I remember literally eating grass at summer camp maybe 35 years ago, because I couldn't eat the meals they served. Nobody even knew ARFID was a thing.",
      "created_utc": 1624645190.0,
      "score": 4,
      "context": []
    },
    {
      "id": "h314jtn",
      "author": "PeachOnAWarmBeach",
      "body": "I'm so sorry that happened to you.  It was extremely cruel.",
      "created_utc": 1624650331.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h2z81wq",
      "author": "c21h30o2--",
      "body": "This. Especially if you have a diagnosis, you could make them realise that what they did was wrong and prevent it from happening to someone else.",
      "created_utc": 1624613713.0,
      "score": 26,
      "context": [
        {
          "id": "h2z0odv",
          "author": "None",
          "body": "Feel free to report that camp to the proper authorities. That sucks, even that feels inadequate. I don’t have much that feels like it could handle that. I’m sorry that happened to you. I know it maybe hard to do, but call the police if you ever find yourself in that situation again. You could’ve had very real health issues occur from this form of mistreatment. It takes a lot to have the courage to tell people that what they’re doing isn’t right. Sometimes you’re going to need to be your biggest advocate. Sorry this happened to you…",
          "created_utc": 1624606667.0
        }
      ]
    },
    {
      "id": "h2ymz10",
      "author": "giftedann",
      "body": "This is absolutely awful. They aren’t not your healthcare providers so they should not take it upon themselves to fix you. This is honestly why diagnosis’s are so important for many. I’m so sorry you had to go through that. 😭",
      "created_utc": 1624596101.0,
      "score": 35,
      "context": [
        {
          "id": "h2ylfyr",
          "author": "L0tuslol",
          "body": "Sorry if I made any spelling or grammar mistakes I was crying while making this post",
          "created_utc": 1624595116.0
        }
      ]
    },
    {
      "id": "h315ixo",
      "author": "alcibaties",
      "body": "How long was the camp? How far from home? How old are you?   \nSigned, a fellow sufferer.",
      "created_utc": 1624650782.0,
      "score": 5,
      "context": [
        {
          "id": "h2ylfyr",
          "author": "L0tuslol",
          "body": "Sorry if I made any spelling or grammar mistakes I was crying while making this post",
          "created_utc": 1624595116.0
        }
      ]
    },
    {
      "id": "h31yn5q",
      "author": "big_doggos",
      "body": "Please report this counselor to the camp. What they did was extremely inappropriate and needs to be brought to someone's attention.",
      "created_utc": 1624665604.0,
      "score": 1,
      "context": [
        {
          "id": "h2ylfyr",
          "author": "L0tuslol",
          "body": "Sorry if I made any spelling or grammar mistakes I was crying while making this post",
          "created_utc": 1624595116.0
        }
      ]
    },
    {
      "id": "h320h70",
      "author": "None",
      "body": "Same, I had so many experiences like this. It didn’t help that my home environment was the same. I always had to sneak snacks and I have a messed up relationship with food to this day. To top it off I was shamed for being underweight a lot too… Like it didn’t click for anybody?",
      "created_utc": 1624666645.0,
      "score": 1,
      "context": [
        {
          "id": "h2zulc3",
          "author": "Gofnutz",
          "body": "Yeah, that was basically what I went through as a kid 30 years ago. Breakfast was fine because it was stuff I like but lunch and dinner I starved and the counselors would try to get me to eat whatever they had. I managed to get stuff from the small store they had that sold candy and snacks and live off of that. My parents still sent me the next year too, I hated it.",
          "created_utc": 1624629320.0
        }
      ]
    }
  ]
}