{
  "id": "o81qwr",
  "subreddit": "ARFID",
  "author": "bangtanimosity",
  "created_utc": 1624673616.0,
  "title": "Crying in a restaurant bathroom because of embarrassment over ARFID",
  "selftext": "I’m at a restaurant for a family member’s birthday, and it’s one of the only restaurants i’ve been to that doesn’t have a SINGLE meal on the restaurant that I can eat. Not even any safe dishes for me like chicken tender and fries.\n\nI was sitting next to my mother, so I asked her for help to see if she could find something on the menu that I can eat that I missed over, because the waitress was about to come and I was in panic mode.\n\nMy mom took me needing help finding something on the menu as her ordering for me, so she told the waitress “My daughter is extremely picky, could you just make her some basic pasta or something?”\n\nI was so embarrassed that I panic ordered tater tots (for dinner, it was supposed to be a side but it was the only thing I felt comfortable eating) and then excused myself to the restroom to cry in embarrassment.\n\nI hate having to make restaurant staff advocate to my eating disorder, i’ll just order nothing or something as simple as possible in a situation like this. And something that I hate more than anything is being called out as being “picky”, it makes it sound like i’m a snob and I would be more comfortable with her just straight-up saying I have an eating disorder. I’ve told her not to do it since I was a kid, and she still insists on telling everyone within earshot at restaurants that i’m a “picky eater”\n\nI’m 19, so i’m a grown-ass woman and i’m in a restaurant bathroom crying over food. And I get that she was trying to help me, but it made me feel like absolute dirt. I feel so pathetic because of ARFID sometimes.\n\nHas anyone else had a similar experience to this? I honestly just wanted to vent to some like-minded people because you guys might actually understand my pain",
  "url": "https://www.reddit.com/r/ARFID/comments/o81qwr/crying_in_a_restaurant_bathroom_because_of/",
  "score": 163,
  "num_comments": 19,
  "comments": [
    {
      "id": "h32kieg",
      "author": "games820",
      "body": "Dang. I'm sorry. I feel this way whenever we go to Olive Garden. Only thing I like there is mozzarella sticks and fries. Both sides. \n\nLegit next time. Just order it. Don't even worry. If someone says something tell them you're not that hungry. \n\nAt almost 33 and still picking as all hell there isn't much I can do. So I just don't even worry. They don't care, they're just making food. \n\nI'm really sorry your night sucked. I hope you get something yummy to eat soon. Without judgement from stupid people.",
      "created_utc": 1624678325.0,
      "score": 44,
      "context": []
    },
    {
      "id": "h32n2rh",
      "author": "literallyzee",
      "body": "As a 34 year old woman, I still cry over food. I’m so sorry you are going through this, you’re not alone. ❤️",
      "created_utc": 1624679994.0,
      "score": 25,
      "context": []
    },
    {
      "id": "h32y0bt",
      "author": "MaegorTargaryen",
      "body": "My mom used to inform the whole table \"Some people are vegetarian. My two sons are picky-tarians!\" It always got a few laughs and giggles. She would feel better having it in the open, and no one would feel the need to ask why her children were only eating a side of fries.\n\nI have been in your shoes many times. It does not feel good to have your eating disorder spotlighted. Not feeling respected, or given a chance to be understood. Just straight up labeled and taken care of.\n\nI'm 29 now. I have no problem being upfront with people about my struggles with food. When I am in control of the conversation it always goes well. I have the power to explain my difficulties. When I started openly explaining exactly **why** I grew up with ARFID, I started to understand my mom's point of view. And why she always told everyone right away. If my brother and I were simply waved off as picky eaters. It becomes easy to deflect all blame, and reject all responsibility. It's painful for parents to admit they contributed to their child's eating disorder. It's stressful not knowing how to help us and to see us struggle. When you are labeled a picky eater. It becomes solely **your problem.**\n\nOwn it. Own your struggles. We all have them. Be unapologetically open and honest about it. More people will be understanding than you think, and it will feel 100 times better than letting your mother control the narrative. You are not a picky eater. You are your own person with your own struggles. They have theirs and this one is yours. Own it!",
      "created_utc": 1624688131.0,
      "score": 27,
      "context": []
    },
    {
      "id": "h32icd7",
      "author": "g4lj7",
      "body": "Yes! You are not alone. I honestly don’t have any words of encouragement or tips. But you’re not the only one who goes through this.\n\n\nIt’s miserable having to deal with it. And hearing others condense it down to “picky” is gut wrenching. It’s not a choice we’re making to eat our safe foods, we just literally don’t feel SAFE eating other foods. Everyone wants to feel safe, but they don’t see it like that.\n\nI hope your night gets better.\nAnd I hope you can have some safe foods when you get home!",
      "created_utc": 1624676951.0,
      "score": 14,
      "context": []
    },
    {
      "id": "h32ouw0",
      "author": "GameMusic",
      "body": "Reject embarrassment, ask detailed questions about menu obscurities.\n\nOccasionally I get simplistic things like the cheese sandwich\n\nWhen they call ARFID picky use polite calm correction quietly",
      "created_utc": 1624681193.0,
      "score": 9,
      "context": []
    },
    {
      "id": "h32oauu",
      "author": "DolphinKiwiPotato",
      "body": "When they say that it’s it’s picky eating I want to stab them, I don’t know how to help, just know you’re not alone",
      "created_utc": 1624680818.0,
      "score": 8,
      "context": []
    },
    {
      "id": "h33sqad",
      "author": "Shutterbug390",
      "body": "I’m not as restricted as some, but I definitely still struggle with this as an adult. My mom will help me find things on the menu, but doesn’t say anything to servers. My husband is more vocal and will make specific requests for me because he knows I won’t do it myself (I get super uncomfortable, but don’t mind someone else politely asking about things). He’ll also stand up for me if I eat nothing after discovering something wasn’t as safe as I hoped. \n\nSomething you can try (practicing ahead of time helps) is “is this item available without ____?” A lot of times, I can find a basic meat item where it can be served without sauce or a burger that I can order plain. Also, don’t be afraid to order from the kid’s menu. They often have mac and cheese or a simple fruit cup, even if those things aren’t available on the main menu. If you have to request the kid’s menu, just say “I have a very restricted diet. May I see the kid’s menu, to see if it has a safe option for me?” I haven’t seen servers refuse that.",
      "created_utc": 1624714787.0,
      "score": 5,
      "context": []
    },
    {
      "id": "h333z21",
      "author": "Telaneo",
      "body": "If cookies are a safe food for you, go buy some for yourself. You deserve them.",
      "created_utc": 1624693470.0,
      "score": 4,
      "context": []
    },
    {
      "id": "h33v40i",
      "author": "charzilla13",
      "body": "I understand how you feel. My ARFID magnified over this last year and going back to restaurants has been hard since my safe foods became more limited. I used to not eat or eat the safe foods when available, but recently I learned it’s okay to ask the server about other options or substitutions. My last meal out I got a lot of anxiety over asking if I could have an entree with another entree’s side and they were super nice about it, no questions asked. I know not all places are as kind, but it’s surprising sometimes. It is possible to call ahead to ask what options are available too if you don’t want others to hear. I am 30 and it’s taken me until age 30 to have the courage to ask! You’ve got this! 💜",
      "created_utc": 1624716173.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h341gzh",
      "author": "vde2027",
      "body": "I totally get why you don’t like to be called picky, I think sometimes it’s just the easiest way to communicate to a stranger that you have specific things you can/can’t eat. When I go to restaurants I almost always start my order with “Just letting you know, I’m really picky…” or “I know this order might sound weird but…” with a smile to kind of get the waiter ready and on my side. Normally this works and I order something with substitutions/stuff left off a lot. I always check the menu before I go to a restaurant if possible and see if there’s something I can at least amend (most often for me this means ordering a dish “with no vegetables, please!”)\n\nThis has only happened a few times, but on a couple occasions waiters have mocked for ordering no vegetables, which I really didn’t appreciate. But normally they’re very nice and I have even had a waitress tell me she is “the same way” about food once which made me feel really safe about ordering food the way I order it.\n\nI totally get not wanting to call it pickiness or seem stuck-up about food. I have cried in a bathroom stall because the restaurant had NOTHING I could eat before too. It’s awful. I’m so sorry. Just do whatever you need to do to get food you can eat, whether it’s at the restaurant or after.",
      "created_utc": 1624719638.0,
      "score": 4,
      "context": []
    },
    {
      "id": "h344ax4",
      "author": "Dethanatos",
      "body": "I cried recently over food, my wife told me she was worried I might be malnourished, at first I was angry until I realized she was right. Going to restaurants are hard sometimes. Something my therapist and I are working on is coming up with something that I am comfortable saying to people about my disorder. Something like \"Just so you guys are aware, I am working through some sensory issues so food is  hard for me right now, I don't want to talk about it. I would rather us just enjoy each other's company.\" Something like that. The idea is to practice saying this with people I am comfortable around so that someday maybe I can say it to others, and to say it assertively. I'm sorry you had a hard night.",
      "created_utc": 1624721109.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h331tvh",
      "author": "BananasDramas",
      "body": "I’ve only been suffering with ARFID for 18 months, I’m 32, I used to love going for dinner but now I cry quite a lot over food, I’ve only been for dinner twice and it was the most anxiety inducing thing ever. I hope you managed to eat and could enjoy some of the evening xx",
      "created_utc": 1624691474.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h34xgtv",
      "author": "jbpink6",
      "body": "this, but every time i go out to eat. i feel you and you are not alone!!!!",
      "created_utc": 1624735881.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h32s81n",
      "author": "Dietcokeandnicotine",
      "body": "32 year old here and I do the same. This is why I hate going out to eat with my extended family",
      "created_utc": 1624683561.0,
      "score": 14,
      "context": [
        {
          "id": "h32n2rh",
          "author": "literallyzee",
          "body": "As a 34 year old woman, I still cry over food. I’m so sorry you are going through this, you’re not alone. ❤️",
          "created_utc": 1624679994.0
        }
      ]
    },
    {
      "id": "h32vpct",
      "author": "Celeste_Minerva",
      "body": "I cried the other day..\n\nI'm a few years older than you.\n\nWe're not alone!",
      "created_utc": 1624686224.0,
      "score": 5,
      "context": [
        {
          "id": "h32n2rh",
          "author": "literallyzee",
          "body": "As a 34 year old woman, I still cry over food. I’m so sorry you are going through this, you’re not alone. ❤️",
          "created_utc": 1624679994.0
        }
      ]
    },
    {
      "id": "h34771t",
      "author": "StillEmotional",
      "body": "35 here and I still struggle",
      "created_utc": 1624722593.0,
      "score": 1,
      "context": [
        {
          "id": "h32n2rh",
          "author": "literallyzee",
          "body": "As a 34 year old woman, I still cry over food. I’m so sorry you are going through this, you’re not alone. ❤️",
          "created_utc": 1624679994.0
        }
      ]
    },
    {
      "id": "h334i6g",
      "author": "Prof_Cecily",
      "body": ">When they call ARFID picky use polite calm correction quietly\n\nThis!",
      "created_utc": 1624693982.0,
      "score": 4,
      "context": [
        {
          "id": "h32ouw0",
          "author": "GameMusic",
          "body": "Reject embarrassment, ask detailed questions about menu obscurities.\n\nOccasionally I get simplistic things like the cheese sandwich\n\nWhen they call ARFID picky use polite calm correction quietly",
          "created_utc": 1624681193.0
        }
      ]
    },
    {
      "id": "h32thwx",
      "author": "literallyzee",
      "body": "Same. I was just talking to my husband about how people go out to eat, *for fun* and I just do not understand that",
      "created_utc": 1624684510.0,
      "score": 9,
      "context": [
        {
          "id": "h32n2rh",
          "author": "literallyzee",
          "body": "As a 34 year old woman, I still cry over food. I’m so sorry you are going through this, you’re not alone. ❤️",
          "created_utc": 1624679994.0
        },
        {
          "id": "h32s81n",
          "author": "Dietcokeandnicotine",
          "body": "32 year old here and I do the same. This is why I hate going out to eat with my extended family",
          "created_utc": 1624683561.0
        }
      ]
    },
    {
      "id": "h32v59l",
      "author": "Dietcokeandnicotine",
      "body": "Eating is a chore at best. I have a co-worker who is really food obsessed and always insists on showing me photos of her meals from anytime she eats out. You may as well be showing me pictures of your turds, because that’s about how interested I am.",
      "created_utc": 1624685785.0,
      "score": 14,
      "context": [
        {
          "id": "h32n2rh",
          "author": "literallyzee",
          "body": "As a 34 year old woman, I still cry over food. I’m so sorry you are going through this, you’re not alone. ❤️",
          "created_utc": 1624679994.0
        },
        {
          "id": "h32s81n",
          "author": "Dietcokeandnicotine",
          "body": "32 year old here and I do the same. This is why I hate going out to eat with my extended family",
          "created_utc": 1624683561.0
        },
        {
          "id": "h32thwx",
          "author": "literallyzee",
          "body": "Same. I was just talking to my husband about how people go out to eat, *for fun* and I just do not understand that",
          "created_utc": 1624684510.0
        }
      ]
    }
  ]
}