{
  "id": "oa79w9",
  "subreddit": "ARFID",
  "author": "Butt3rcup-",
  "created_utc": 1624969714.0,
  "title": "I went to a clinic for ARFID. This is what helped me",
  "selftext": "Disclaimer: I’m only basing this on personal experience. I’m not a professional. Just sharing what helped me in the hope it might help others as well. \n\n- tips and TL;DR below -\n\nSo about one or two years ago I discovered I have ARFID through Reddit actually. I struggle mostly with fruits, vegetables, and some composite meals, as I am very sensitive to flavor and texture. I was very lucky to have a psychiatrist who helped me get a treatment. The past 4 weeks I went to a clinic 5 days a week from 9am to 4pm. Especially in the last week in clinic I noticed the tension in me lessened and I was able to take a bit a lot faster than before. I’m not fully recovered yet and it’s still difficult for me to try new foods. But I’m proud of the huge steps I made. I hope I’ll continue to challenge myself and once in the future maintain a healthy diet!\n\nI know a lot of you are not in the position to get diagnosed or receive treatment. So for anyone out there trying to recover by themselves, here are some things I learned that helped me…\n\n1. Remember your motivation.\nThis one is very important. When it gets difficult, remind yourself why you are doing this. Writing down your goals is even better. My goal is to eventually maintain a healthy diet. I want to be able to eat those (really good looking) healthy meals you see on Pinterest :)\n2. Start with (very) small steps.\nLiterally baby steps. I started off with grapes. But I didn’t eat a whole portion the first time. I had to eat 1/4 grape. It may sound ridiculous to a lot of people but for me that was a huge step. And if that is still too much of a challenge for you, start off with smelling the food. Then let it touch your lips or your tongue. Maybe then chew it a couple of times and spit it out. Don’t expect to be able to eat a normal bite the first time, let alone the full meal. \n3. Acknowledge your thoughts. \nAlso useful if you write it down in a scheme. (I made a template, ask me if you want it) For example: in this situation you have to eat food you have a lot of difficulty with. What are you thinking? Your thoughts influence your behavior and feelings greatly. So by replacing these negative thoughts with helpful thoughts can make a lot of difference. We can think “oh no this looks disgusting, I can’t eat this”. By thinking this, we feel very anxious and stressed. Eventually our behavior might lead to avoiding the food. Now try to change this thought into a more helpful one. Like… “It might not be that bad, maybe it’s even tasty.” - “It looks similar to [food you like], maybe it tastes similar as well.” To call a few examples. This will lead into feeling more relaxed, maybe even curious about the taste. Eventually our behavior might be actually trying the food. \n4. Take control of the situation. \nI think this one is known by a lot already but it’s still important to mention. It can really help to take control by choosing yourself the food you want to learn to eat. Prepare it yourself, (especially if it’s a composite meal) by this you get to know the ingredients and this might take a bit of the tension away. Then decide yourself how much you will eat, don’t feel pressured by anyone telling you should eat a full portion of something you have never eaten before. If you think 5 bites are big enough of a challenge for you, do that. \n5. Find a safe environment. \nReach out to people you feel safe with. There are always people willing to help you. If you feel pressured by your environment, look for a place where you can be alone when you try out new foods and take your time! Maybe even look for people nearby who struggle with the same and eat together! Maybe through video call. Communication is key! There are so many of us out there. Supporting each other can make it a lot easier. Also for me it was so much fun to be able to rant about food and have others around me who feel the same. \n6. Set up a reward system. \nIt might work best for children. If you’re a parent trying to help your child, rewards are always effective. In clinic we got a point after succeeding a session. If we went a step further, we got 2 points. Eventually after saving up a certain amount of points, you could exchange it for a reward. Younger kids often got immediate small rewards after succeeding. Think of a sticker, getting 5 more minutes playtime outside, ice cream, a small toy, etc. For some reason rewards motivate us highly. \n7. Try out relaxation exercises. \nNotice the way you are sitting in your chair while attempting to eat something you’re struggling with. You might feel very tense. Try to find a comfortable position. Take a deep breath. Sometimes it helps to first tighten your muscles, and then slowly let go. Try it out with your shoulders for example. Do a little breathing exercise. Maybe even meditate. \n8. Sometimes it’s better to not scan the food before putting it in your mouth.\nIf you’re like me, someone who scans the food from all sides before taking a bite, you might want to consider not doing that. I know it’s hard! But by scanning the food, you notice all the little imperfections it has, which sets the bar even higher to actually eat it. If you keep thinking about that one spot that looked odd, eating it might make you feel more sick than if you didn’t notice that spot. Sometimes it’s better to not overthink it and just do it. \n9. Use a timer.\nI didn’t use this but I know it worked for some people. Set a timer and try to eat a certain amount within that time. Or count down yourself and then take the bite at 1. You could also ask others to count for you\n10. Write down your accomplishments. \nBe proud of yourself! You struggle with this ED your entire life. It’s not as easy as it seems to others to take a bite of something you’ve never eaten before. So it’s an enormous accomplishment when you made that step. Even the tiniest steps are worth celebrating. Write them down! \n\nEdit: Tips 11 and 12. Forgot to mention them earlier but they are still crucial\n\n11. Continue to challenge yourself.\nI know it’s difficult, but by continuing to challenge yourself, it will definitely become easier each time you try something new. Because you get used to tasting new foods and the bar will lower by time. Also, if you have tried a certain product and you absolutely hated it, try it again another time. Sometimes you just need to get used to the flavor and texture. Maybe the second time you try it, it isn’t as gross as the first time. Build up slowly over time. Compare it to exercising! After the first couple of days your muscles are so sore, but the more you do it, the stronger you feel. After a certain amount of time if you persevere, you’ll actually start to very much enjoy it and even feel the need to exercise without having to force yourself. \n\n12. Some foods taste better combined. \nDon’t be too hard on yourself! Some foods just taste better with a pinch of salt. Look for recipes with this particular product you want to learn to eat. Individually they might taste awful. But combined with something else, they actually add that extra flavor you didn’t know you needed. The same goes the other way around. If combined feels like too much of a challenge for you, separate it. Try it all individually, get to know the texture and flavor bit by bit. \n\nI hope this helps for some of you! If there’s anything unclear, please leave a comment. I’m happy to help! Also, I’m not a native English speaker, correct me wherever I’m wrong. Thank you for reading this far! I appreciate it :)\n\nTL;DR - the tips: \n1. Remember your motivation\n2. Start with very small steps\n3. Acknowledge your thoughts\n4. Take control of the situation\n5. Find a safe environment\n6. Set up a reward system\n7. Try out relaxation exercises \n8. Don’t scan the food\n9. Use a timer\n10. Write down your accomplishments\n11. Continue to challenge yourself\n12. Some foods taste better combined",
  "url": "https://www.reddit.com/r/ARFID/comments/oa79w9/i_went_to_a_clinic_for_arfid_this_is_what_helped/",
  "score": 152,
  "num_comments": 19,
  "comments": [
    {
      "id": "h3flnx1",
      "author": "nueve",
      "body": "Thank you for sharing!",
      "created_utc": 1624970422.0,
      "score": 9,
      "context": []
    },
    {
      "id": "h3fwjh9",
      "author": "zDEFEKT",
      "body": "Thanks for taking the time to put this together and share with everyone",
      "created_utc": 1624976211.0,
      "score": 7,
      "context": []
    },
    {
      "id": "h3frml0",
      "author": "marlon_tmh",
      "body": "I'd give you my free award if I still had it. Thanks for sharing! Seems very useful. Good luck to everyone!",
      "created_utc": 1624973761.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h3ft6gi",
      "author": "keto_and_me",
      "body": "I’m saving this to try and work with my 13 year old stepdaughter. The pediatrician said to find 1 fruit and 1 vegetable she is willing to eat on a regular basis and I think this will help!",
      "created_utc": 1624974558.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h3ga1wt",
      "author": "r1ddl3d",
      "body": "This is so informative and helpful! Thank you for sharing. \nI never would have known that you aren’t a native English speaker; success on many levels!",
      "created_utc": 1624982286.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h3gakba",
      "author": "Expensive-Ad7677",
      "body": "Thank you so much for sharing all this, it’s really helpful. It sounds like it takes elements from CBT alongside exposure therapy, which I’ve found very helpful with other areas of my life. \n\nI can’t afford treatment right now, but I’m definitely going to try steps 3, 7 and 8 at home, they make a lot of sense (as well as the other steps, these three just jumped out to me!)",
      "created_utc": 1624982505.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h3gcnqx",
      "author": "umidk9",
      "body": "omg this is probably the best post on this sub thank u so much!! I'm gonna write this out<3",
      "created_utc": 1624983426.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h3gpu0s",
      "author": "Mynotredditaccount",
      "body": "This is amazing and seems very helpful. Thank you for sharing OP!",
      "created_utc": 1624988978.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h3gv1go",
      "author": "None",
      "body": "Love this! Thank you very much (:",
      "created_utc": 1624991205.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h3hmvt5",
      "author": "cd00",
      "body": "Thanks for the write-up! Will definitely be trying to keep these in mind",
      "created_utc": 1625003424.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h3hrfuh",
      "author": "salamandah99",
      "body": "I'm saving this.  My son is 12 and I think he has this.  I have tried his whole life not to make a big deal out of his eating but I worry about it constantly.  I am a picky eater.  I eat a lot more things than I did when I was a kid and I remember how much I hated being teased and/or forced.  so, with my son, I am actually, probably way too easy on him.  but  I know it has to come from him.  If I force him, I think it just makes things worse.  He will agree to try something but when it comes to actually doing it, I can see the struggle.  On the bright side, he is starting to try some new things quicker but it helps if I am not the one asking him to try it.",
      "created_utc": 1625005544.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h3fpdj4",
      "author": "Butt3rcup-",
      "body": "No problem! Hope it helped :)",
      "created_utc": 1624972564.0,
      "score": 3,
      "context": [
        {
          "id": "h3flnx1",
          "author": "nueve",
          "body": "Thank you for sharing!",
          "created_utc": 1624970422.0
        }
      ]
    },
    {
      "id": "h3ga5ee",
      "author": "r1ddl3d",
      "body": "I gave mine in your honor!",
      "created_utc": 1624982327.0,
      "score": 3,
      "context": [
        {
          "id": "h3frml0",
          "author": "marlon_tmh",
          "body": "I'd give you my free award if I still had it. Thanks for sharing! Seems very useful. Good luck to everyone!",
          "created_utc": 1624973761.0
        }
      ]
    },
    {
      "id": "h3fx272",
      "author": "Butt3rcup-",
      "body": "Good luck! I noticed with a lot vegetables it’s easier when they are mixed in a meal. For example: For me tomatoes were horrible individually. But recently I made pasta pesto with quite a few tomatoes in it and they weren’t as unpleasant as I thought they would be",
      "created_utc": 1624976458.0,
      "score": 3,
      "context": [
        {
          "id": "h3ft6gi",
          "author": "keto_and_me",
          "body": "I’m saving this to try and work with my 13 year old stepdaughter. The pediatrician said to find 1 fruit and 1 vegetable she is willing to eat on a regular basis and I think this will help!",
          "created_utc": 1624974558.0
        }
      ]
    },
    {
      "id": "h3gi2om",
      "author": "Butt3rcup-",
      "body": "Good luck! 3 is basically the first one I learned. We can’t directly influence our feelings and behavior, but we can influence our thoughts. By acknowledging the negative thoughts in our mind, we can rationalize them. Seriously, some of them don’t make sense at all haha. By changing our thoughts into helpful ones, we can influence our behavior. Feeling is the more difficult one to change immediately. But over time it will get better for sure",
      "created_utc": 1624985718.0,
      "score": 3,
      "context": [
        {
          "id": "h3gakba",
          "author": "Expensive-Ad7677",
          "body": "Thank you so much for sharing all this, it’s really helpful. It sounds like it takes elements from CBT alongside exposure therapy, which I’ve found very helpful with other areas of my life. \n\nI can’t afford treatment right now, but I’m definitely going to try steps 3, 7 and 8 at home, they make a lot of sense (as well as the other steps, these three just jumped out to me!)",
          "created_utc": 1624982505.0
        }
      ]
    },
    {
      "id": "h3swzjz",
      "author": "Butt3rcup-",
      "body": "Good luck with your son! It’s a difficult process for sure. It’s different for everyone. I immediately started eating normal sized bites, but I once sat next to a boy (also around 12yrs old) who couldn’t get himself to eat a crumble of a pizza. I hope my tips help a little for you and your son! Remember to have patience and never get angry with him for not eating something. We get confronted with eating 3 times a day. So 3 times a day there’s put a lot of pressure on us. 3 times a day we could feel intense anxiety. 3 times a day we feel very embarrassed because we can’t eat like everyone else. Even though you might never be able to understand why eating a crumble is so difficult for some of us, try to support your son wherever you can. Maybe try to turn this into something positive. I always try to manipulate my mind into thinking that eating for example blueberries is a reward for me, something that I enjoy eating. And for some reason it works haha. A bit similar to tip 3. Just really try out a lot of different approaches and see what works best for him",
      "created_utc": 1625232935.0,
      "score": 1,
      "context": [
        {
          "id": "h3hrfuh",
          "author": "salamandah99",
          "body": "I'm saving this.  My son is 12 and I think he has this.  I have tried his whole life not to make a big deal out of his eating but I worry about it constantly.  I am a picky eater.  I eat a lot more things than I did when I was a kid and I remember how much I hated being teased and/or forced.  so, with my son, I am actually, probably way too easy on him.  but  I know it has to come from him.  If I force him, I think it just makes things worse.  He will agree to try something but when it comes to actually doing it, I can see the struggle.  On the bright side, he is starting to try some new things quicker but it helps if I am not the one asking him to try it.",
          "created_utc": 1625005544.0
        }
      ]
    },
    {
      "id": "h3gg5qu",
      "author": "marlon_tmh",
      "body": "Thanks!",
      "created_utc": 1624984925.0,
      "score": 3,
      "context": [
        {
          "id": "h3frml0",
          "author": "marlon_tmh",
          "body": "I'd give you my free award if I still had it. Thanks for sharing! Seems very useful. Good luck to everyone!",
          "created_utc": 1624973761.0
        },
        {
          "id": "h3ga5ee",
          "author": "r1ddl3d",
          "body": "I gave mine in your honor!",
          "created_utc": 1624982327.0
        }
      ]
    },
    {
      "id": "h3gtq0p",
      "author": "keto_and_me",
      "body": "She only eats Cocoa Puffs, strawberry gogurt, and American cheese so mixing veggies in is going to be quite a ways down the road 🤞🏻",
      "created_utc": 1624990637.0,
      "score": 3,
      "context": [
        {
          "id": "h3ft6gi",
          "author": "keto_and_me",
          "body": "I’m saving this to try and work with my 13 year old stepdaughter. The pediatrician said to find 1 fruit and 1 vegetable she is willing to eat on a regular basis and I think this will help!",
          "created_utc": 1624974558.0
        },
        {
          "id": "h3fx272",
          "author": "Butt3rcup-",
          "body": "Good luck! I noticed with a lot vegetables it’s easier when they are mixed in a meal. For example: For me tomatoes were horrible individually. But recently I made pasta pesto with quite a few tomatoes in it and they weren’t as unpleasant as I thought they would be",
          "created_utc": 1624976458.0
        }
      ]
    },
    {
      "id": "h3ha9uk",
      "author": "Expensive-Ad7677",
      "body": "Yeah I appreciate changing the feeling associated with the thoughts will take months, if not years. And even then that might just be for one type of food or food group. Just need to take it one step at a time and celebrate each stage of our progress.",
      "created_utc": 1624997879.0,
      "score": 3,
      "context": [
        {
          "id": "h3gakba",
          "author": "Expensive-Ad7677",
          "body": "Thank you so much for sharing all this, it’s really helpful. It sounds like it takes elements from CBT alongside exposure therapy, which I’ve found very helpful with other areas of my life. \n\nI can’t afford treatment right now, but I’m definitely going to try steps 3, 7 and 8 at home, they make a lot of sense (as well as the other steps, these three just jumped out to me!)",
          "created_utc": 1624982505.0
        },
        {
          "id": "h3gi2om",
          "author": "Butt3rcup-",
          "body": "Good luck! 3 is basically the first one I learned. We can’t directly influence our feelings and behavior, but we can influence our thoughts. By acknowledging the negative thoughts in our mind, we can rationalize them. Seriously, some of them don’t make sense at all haha. By changing our thoughts into helpful ones, we can influence our behavior. Feeling is the more difficult one to change immediately. But over time it will get better for sure",
          "created_utc": 1624985718.0
        }
      ]
    }
  ]
}