{
  "id": "ovxiiw",
  "subreddit": "ARFID",
  "author": "nueve",
  "created_utc": 1627842662.0,
  "title": "About the only way I can get them down (crosspost from /r/funny)",
  "selftext": "",
  "url": "https://i.redd.it/f30lvis61re71.jpg",
  "score": 135,
  "num_comments": 4,
  "comments": [
    {
      "id": "h7cdgsw",
      "author": "Mynotredditaccount",
      "body": "Lmfao 😂 even *that* doesn't work for me, I just straight up dont eat fruits 💀",
      "created_utc": 1627844415.0,
      "score": 7,
      "context": []
    },
    {
      "id": "h7djh9u",
      "author": "axw3555",
      "body": "I’m lucky in that the fruit I actually like the taste of (apples, grapes, melon) are the ones I can stand the texture of. Couldn’t eat an orange because of the texture, couldn’t eat a pear because of the taste, but those three are good.\n\nIn fact, I used to love grapes so much that I became the only person I know who got told to cut down my grape intake and up my salt and caffeine intake by a consultant cardiologist, because as a teen I had pretty low blood pressure and grapes decrease blood pressure slightly. But when you’re eating a bunch of grapes a day or more, slight becomes significant. I’d nearly pass out just standing up out of a chair. So cut down that and add more stuff that bumps blood pressure.",
      "created_utc": 1627865411.0,
      "score": 5,
      "context": []
    },
    {
      "id": "h7cqhni",
      "author": "ArtsyTeacher95",
      "body": "The only way I can eat vegetables or stone fruits.",
      "created_utc": 1627850624.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h7ch5zx",
      "author": "BreadRecent",
      "body": "Haha same, my family just tells people that I am a vegetarian when I don’t like certain foods with meat, but then they offer me fruit and then I need to explain that I dislike fruit 💀. Fruit is disgusting and I would eat anything else before it",
      "created_utc": 1627846183.0,
      "score": 6,
      "context": [
        {
          "id": "h7cdgsw",
          "author": "Mynotredditaccount",
          "body": "Lmfao 😂 even *that* doesn't work for me, I just straight up dont eat fruits 💀",
          "created_utc": 1627844415.0
        }
      ]
    }
  ]
}