{
  "id": "p0k3gb",
  "subreddit": "ARFID",
  "author": "overlordbabyj",
  "created_utc": 1628447530.0,
  "title": "It's been a long, hard road, but I'm here.",
  "selftext": "\"It's nobody's fault but yours.\" \n\nThat's what my dad loved telling me. \n\nPBJs & French fries. Anything else would get about halfway down my throat, then come right back up. Cue their yelling and my crying. Cue another night of feeling ashamed of my existence. \n\nI tried so hard. I wanted so badly to be normal, or at least to stop feeling like a freakshow. I wanted my parents to stop punishing me for something I couldn't control. \n\nI never saw a professional. To my knowledge, they never even contacted one. Just thought they could make me \"man up\" and get over it. \n\nNevertheless, it improved as I got older. I can eat enough to keep myself healthy, and I don't vomit anymore. Every now and then, my mouth makes weird movements when I try new food, but that's pretty much it physically. \n\nAs all of you know, the real struggle is mental. \n\nI have *abysmal* anxiety about food. I've spent so much of my life in irrational shame and guilt that I buried myself in it - it was my biggest secret. Throughout my life, there were incredibly few people outside of immediate family who knew about it. I didn't eat in front of people unless it was comfortable food. \n\nIt was my biggest secret.\n\n**Was.**\n\nA few weeks ago, while getting to know each other, a new friend asked if I was a picky eater. And I thought to myself, *what the hell, I guess I'll tell the truth this time.* \"It's complicated,\" I said. And I proceeded to tell her everything. \n\nAnd she was accepting. And caring. And understanding. Without a shred of judgment. \n\nSo I started telling more people. I told people I've known for years who never had a clue. And the responses have all been the same. \n\n\n\nI told my therapist (I'm in therapy for other issues), and she doesn't specialize in EDs so she couldn't say anything official, but she mentioned this thing called ARFID. So I looked it up. And I'm certain that's what it was. It all makes sense now. \n\nLast night, I called my mom (dad is dead). I confronted her. I demanded an answer for why they treated me the way they did. And she didn't have one, but she did admit it was very wrong, and that if she could go back, she'd do everything differently. Hearing that healed my soul, just a little bit. \n\nAnd now I'm not ashamed to talk about it. \n\n**\"It's nobody's fault.\"** ~~but yours.\"~~ **Period.**",
  "url": "https://www.reddit.com/r/ARFID/comments/p0k3gb/its_been_a_long_hard_road_but_im_here/",
  "score": 91,
  "num_comments": 7,
  "comments": [
    {
      "id": "h87zj22",
      "author": "BreadRecent",
      "body": "You literally just made me cry, thank you for telling your story. I’ve always been ashamed to tell people because I have gotten mostly negative reactions, but this gives me confidence. It’s not my fault!",
      "created_utc": 1628462823.0,
      "score": 16,
      "context": []
    },
    {
      "id": "h884geu",
      "author": "Johnny-of-Suburbia",
      "body": "I am so glad that you discovered ARFID and that it helped you come to a much better place mentally. I was abused by a daycare sitter thanks to mine when I was little, it can really do a lot to hurt someone for life.  \n\n\nI am also super happy that you have such caring and supportive people in your life now, and that you could have the courage to confront your mom about this. It's good that she was able to acknowledge she was wrong as well.  \n\n\nI wish you all the best moving forwards OP, thanks for sharing!",
      "created_utc": 1628465284.0,
      "score": 5,
      "context": []
    },
    {
      "id": "h88zpi4",
      "author": "darrow1598",
      "body": "When someone know about your \"secret\", how do you guys do to hang out?\n\n Like, I never told a friend about it, but my biggest concern is: if I do tell them, how can I go out to eat something with my group. For example, I love pizza, but just 3 or 4 flavours and with no onions, olive, etc. And here in the country I live there are a bazillion different flavours, then in a group I get kinda ashamed to \"ruin\" the meeting (even though I don't know their reaction to that).",
      "created_utc": 1628482110.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h88d1i4",
      "author": "Leticia_the_bookworm",
      "body": "Been there, done that, and you are a goddamn warrior! I think pretty much everyone here in the community knows how hard this is. To constantly be afraid of other people's opinions and feel the need to hide. \n\nOpening up is extremely hard. Massive, gigantic kudos to you, OP! You took a very important step :)",
      "created_utc": 1628469667.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h882dsz",
      "author": "overlordbabyj",
      "body": "Glad to have been a part. If you ever need an ear, I'm here.",
      "created_utc": 1628464240.0,
      "score": 8,
      "context": [
        {
          "id": "h87zj22",
          "author": "BreadRecent",
          "body": "You literally just made me cry, thank you for telling your story. I’ve always been ashamed to tell people because I have gotten mostly negative reactions, but this gives me confidence. It’s not my fault!",
          "created_utc": 1628462823.0
        }
      ]
    },
    {
      "id": "h8862a7",
      "author": "overlordbabyj",
      "body": "And thank you for this burst of positivity. Proves that you're better than what you went through.",
      "created_utc": 1628466086.0,
      "score": 5,
      "context": [
        {
          "id": "h884geu",
          "author": "Johnny-of-Suburbia",
          "body": "I am so glad that you discovered ARFID and that it helped you come to a much better place mentally. I was abused by a daycare sitter thanks to mine when I was little, it can really do a lot to hurt someone for life.  \n\n\nI am also super happy that you have such caring and supportive people in your life now, and that you could have the courage to confront your mom about this. It's good that she was able to acknowledge she was wrong as well.  \n\n\nI wish you all the best moving forwards OP, thanks for sharing!",
          "created_utc": 1628465284.0
        }
      ]
    },
    {
      "id": "h88ixmq",
      "author": "overlordbabyj",
      "body": "Thank you. It's a boulder off my chest. Now, this cannot hurt me anymore.",
      "created_utc": 1628472726.0,
      "score": 1,
      "context": [
        {
          "id": "h88d1i4",
          "author": "Leticia_the_bookworm",
          "body": "Been there, done that, and you are a goddamn warrior! I think pretty much everyone here in the community knows how hard this is. To constantly be afraid of other people's opinions and feel the need to hide. \n\nOpening up is extremely hard. Massive, gigantic kudos to you, OP! You took a very important step :)",
          "created_utc": 1628469667.0
        }
      ]
    }
  ]
}