{
  "id": "pee81t",
  "subreddit": "ARFID",
  "author": "pickleconfessions",
  "created_utc": 1630313715.0,
  "title": "The entire process of eating is exhausting..",
  "selftext": "Looking for food, buying food, preparing food, cooking food, eating the food, washing up afterwards. The whole process of food is a chore, it’s boring, it’s inconvenient. I don’t enjoy food, even my safe meals bore the hell out of me. \n\nHow is this a way of living? Is it going to go on forever? Who knows lmao",
  "url": "https://www.reddit.com/r/ARFID/comments/pee81t/the_entire_process_of_eating_is_exhausting/",
  "score": 117,
  "num_comments": 7,
  "comments": [
    {
      "id": "hawtmpp",
      "author": "None",
      "body": "Hey I found myself in the same boat a few years back when I was living alone. Personally, I tried to take the work out of eating and supplement my diet with things like calcium, vitamins, iron pills. I'm considering Hello Fresh, or something like it, now that my safe food list is a bit larger.",
      "created_utc": 1630317810.0,
      "score": 7,
      "context": []
    },
    {
      "id": "hay68t8",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1630342660.0,
      "score": 6,
      "context": []
    },
    {
      "id": "hazt79j",
      "author": "WhenSoulMeetsBody_",
      "body": "I legit hate the chore of cooking. All day long I run through the options of things I can cook and it slims down because I forgot to prep anything because who is thinking about dinner at 7am when you need to take the meat out to thaw. I hate cooking. I hate eating what I cook. I am horrified to even taste my cooking most day. I wish I knew how to overcome this….",
      "created_utc": 1630367875.0,
      "score": 5,
      "context": []
    },
    {
      "id": "hax8r35",
      "author": "killrtaco",
      "body": "It's so hard. My girlfriend gets mad that she's the only one that cooks but it's just so difficult for me to go thru the whole process. I'm trying more for her sake but it's not easy. I try to explain that when Im hungry my reaction is to wait for food because if I have to get it I don't see it as worth it. I just get no payoff for all the anxiety cooking causes and deciding what to eat causes. Running out of food and having to decide what to replace it with is awful too. And it's daily multiple times per day it's just so exhausting. I wish we could photosynthesize like plants.",
      "created_utc": 1630327906.0,
      "score": 9,
      "context": []
    },
    {
      "id": "hazvp19",
      "author": "cassadeir",
      "body": "I thought I was just crazy, I dislike eating too! It’s a chore most of the time.",
      "created_utc": 1630369064.0,
      "score": 3,
      "context": []
    },
    {
      "id": "haxvm8w",
      "author": "Opposite-Birthday69",
      "body": "I don’t know why but I really really do enjoy cooking. I don’t have access to a kitchen where I live because I have that dorm life, but I’ll take one bite of the most beautiful food I’ve prepared...then I’ll pawn it off on the people I made hungry because I can’t stand the flavor, texture, or whatever. I usually try to get the people I give the food to clean up for me because cleaning is boring and the food smells bad when it’s being cleaned. I get asked why I’d make something not to eat it and like I don’t know, I’d like to try different things but it’s icky",
      "created_utc": 1630338282.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hb0c200",
      "author": "RedQueenWhiteQueen",
      "body": "I'm developing a fear of coronavirus worse than when the pandemic began.  I'm vaccinated and healthy and unlikely to become seriously ill - but what if I get just sick enough to lose my sense of taste and smell?  Just sick enough for food to taste gross?  Because I already have difficulty eating enough under the conditions OP describes.  If the whole experience somehow becomes even less rewarding than it already is, I will starve to death.",
      "created_utc": 1630376735.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hayo1p2",
      "author": "pickleconfessions",
      "body": "Wish I could just take a pill with all the calories and nutrition I need hahaha",
      "created_utc": 1630350039.0,
      "score": 9,
      "context": [
        {
          "id": "hay68t8",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1630342660.0
        }
      ]
    }
  ]
}