{
  "id": "psw13t",
  "subreddit": "ARFID",
  "author": "None",
  "created_utc": 1632270839.0,
  "title": "Does anyone else wish they were a super-foodie that got excited about new dishes and wanted to try absolutely everything?",
  "selftext": "Life would be so much more fun and so much easier. I envy those people. The kind that, when asked what they don't like, say that they can't think of anything.\n\nIt's impossible to imagine what it's like. I guess it's just like they can't understand what it's like to have arfid. It's isolating, embarrassing, humiliating. I worry for my health. I feel hunger constantly when my safe foods aren't safe anymore. There is nothing about arfid that's fun. You disappoint the people around you when you can't try that special food they slaved over. People get to be mean to you because for some reason they think not being able to eat is an attention thing. Like, ummm, give it a shot and see how people treat you. It's awesome. /s\n\nI hope we have multiple lives and that maybe in another life I can eat normally....",
  "url": "https://www.reddit.com/r/ARFID/comments/psw13t/does_anyone_else_wish_they_were_a_superfoodie/",
  "score": 106,
  "num_comments": 10,
  "comments": [
    {
      "id": "hduft7u",
      "author": "WellDoneEngineer",
      "body": "I've told so many people that i would LOVE to be a foodie. I'd love to be able to confidently  walk into any restaurant, see something new and think \"Oh yes! that sounds awesome! I'll try that!\"\n\nWhen i watch cooking shows or Gordon Ramsey videos, I'm just lost watching all these different ingredients, and all i can think is \"hate that, hate that, don't like that, ew that texture looks gross\"",
      "created_utc": 1632319388.0,
      "score": 8,
      "context": []
    },
    {
      "id": "hdsp6m7",
      "author": "Scootersbabygirl",
      "body": "Yes! I have this envy constantly so frustrating. I feel you.",
      "created_utc": 1632276964.0,
      "score": 6,
      "context": []
    },
    {
      "id": "hdupztx",
      "author": "Taxouck",
      "body": "It's either that or wishing I never needed to eat ever.",
      "created_utc": 1632323720.0,
      "score": 7,
      "context": []
    },
    {
      "id": "hdsdy52",
      "author": "crystalfairie",
      "body": "It all looks so good!",
      "created_utc": 1632271594.0,
      "score": 5,
      "context": []
    },
    {
      "id": "hdsm8ay",
      "author": "Excellent_Leather202",
      "body": "Literally looked at door pass and grub hub at the to go menus and was so sick. Brought back so many memories of things I used to eat :(",
      "created_utc": 1632275532.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hdsqnq8",
      "author": "None",
      "body": "Yes, my main motivation to get better is freedom and weight loss. For years ive wanted to lose weight, I'm not fat by any standard, I've just always at at the top of a healthy bmi, but because i dont have muscle I think I am probably low level obese. And at my heaviest i was only carrying around 10 kilos extra, wich isnt too obscene. But now im hitting the gym 5 times a week minimum and i have been for 2 months now, and i have failed to lose weight, i see all these 1 to 2 month transformations and people lose crazy weight, but i have found it impossible. But ive found out the hard way that you really cant out exercise a trash diet. The only time i did lose weight was over an 8 week holiday when i rode my bike for almost 4 hours a day, and obviously all the weight returned because that's not sustainable.\n\nOn top of that, i would love to try new foods, eat with friends instead of having to go and get food when im with them that i can eat. Maybe i can tour some local winerys and not have to avoid the nibbles, and im going into business, where networking is key, and i can only imagine how much more difficult not being able to eat at events is going to become.\n\nI feel your pain.",
      "created_utc": 1632277690.0,
      "score": 2,
      "context": []
    },
    {
      "id": "he8rif7",
      "author": "yourlocalsadmess",
      "body": "This: I hope we have multiple lives and that maybe in another life I can eat normally....  \nHonestly.\\\\=",
      "created_utc": 1632590600.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hewxvbe",
      "author": "overlyambitiousnerd",
      "body": "I only wish it because like... I want to trust food. Otherwise, I don't understand the obsession with cooking shows and videos. (I follow one guy because he does his videos in Persian, which is my attempted second language.)",
      "created_utc": 1633046194.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hdvq0n0",
      "author": "SpiceAndNicee",
      "body": "Yesss! I love traveling and would love to be that person that goes to new places and tries the native food and different restaurants. One day  🤞",
      "created_utc": 1632338316.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hdvjnxc",
      "author": "gia1724",
      "body": "This exactly. I tell everyone I take no pleasure in eating and wish I could just take a pill or something instead. I love cooking shows but the entire time I'm thinking \"I will never eat that so what's the point.\"",
      "created_utc": 1632335747.0,
      "score": 4,
      "context": [
        {
          "id": "hdupztx",
          "author": "Taxouck",
          "body": "It's either that or wishing I never needed to eat ever.",
          "created_utc": 1632323720.0
        }
      ]
    }
  ]
}