{
  "id": "pu7umn",
  "subreddit": "ARFID",
  "author": "cssc201",
  "created_utc": 1632441211.0,
  "title": "College cafeterias fucking suck for ARFID",
  "selftext": "I'm a freshman in college, and I've been on campus about a week. I'm so fucking done with the  college cafeteria. Most of the food is terrible quality. Crunchy beans, burnt pizza, watered down juice, etc. And it's so stressful planning meals there. The food offerings change every meal, so sometimes there will be stuff I can eat and sometimes all I can have is breadsticks again, which they thankfully always have, but it's not a full meal and I'm already getting sick of them because I've had to have them with almost every meal so far to get enough food. It's a total gamble. And when they do have something I like and can eat, it won't be there the next time I go in. I am so frustrated to be paying almost $6,000 for bad food and breadsticks so often. It doesn't help that freshman are required to buy the meal plan with the most meals a week in the dining hall and the least amount to spend at the very few other places on campus (there's only coffee, bagels and convenience shops, but better than the cafeteria at least!). I'm stressed out knowing it's going to be like this the whole year. I have no access to any kitchen facilities other than a microwave/fridge, so making anything for myself beyond microwave meals is out of the question. It's also a small fridge and tiny freezer. I've started making friends and it sucks to either have to miss going with them to dinner or end up with nothing but breadsticks again even when I'm actually hungry. I don't want to explain everything but I think they might be judging me for always picking \"unhealthy\" food, even when it's my only actual option. I don't want to be eating nothing but pizza and breadsticks! I would love to eat healthy things and have variety! There's just nothing else here I can eat! I wish they'd even just have one or two more of my staples every time, like chicken soup or plain pasta. This is mostly just a vent post but please let me know any advice you have about anything I can do to make things better.",
  "url": "https://www.reddit.com/r/ARFID/comments/pu7umn/college_cafeterias_fucking_suck_for_arfid/",
  "score": 87,
  "num_comments": 14,
  "comments": [
    {
      "id": "he11r1y",
      "author": "sourdoughobsessed",
      "body": "My college had a printed menu for each cafeteria for the whole semester. Is there more than one cafeteria you can eat at? My roommate and I would go through and find the caf serving Mac and cheese and be sure to hit that one up.",
      "created_utc": 1632441449.0,
      "score": 20,
      "context": []
    },
    {
      "id": "he17v83",
      "author": "SSLEKK",
      "body": "I hear you on this. When I lived in the dorms I had only one safe food option in the dining hall: pasta. Luckily they had a pasta bar every day, but they would rotate the type of noodle that they offered. So on the days where they had more “textured” noodles like tortellini or rotini, I would go hungry. \n\nDo you go to a big school? Typically the dining hall staff is very accommodating to different diets. At my school you could talk to them about your preferences/special diets and they would do their best to accommodate you. They would even prepare takeout containers for students by request. That helped me a lot because a lot of my anxiety around food stemmed from eating around so many people. It was nice to take a meal back home and be able to modify it so I was comfortable eating it. Perhaps if you reach out to them they’ll be able to offer you your safe foods every day. Or even send you with some that you can take home and reheat in your microwave. Hope this helps :)",
      "created_utc": 1632444370.0,
      "score": 17,
      "context": []
    },
    {
      "id": "he1dp9g",
      "author": "moobectomy",
      "body": "If a college can't accomodate dietary needs/the meal plan causes 'undue hardship', etc, they almost certainly have a policy for exempting you from the requirement to buy it. Idk how that will work now that the semester has started, but it may be worth getting a dr's note and trying. Or look into the options for transferring (selling) your plan to value to other students. Right now you're paying the same cost as everyone else to get just a little of the cheapest options, it really is a rip off.\n\nMy school didn't have anyway to transferr untill I was almost done, so I spent the whole plan every year on large non fat iced chai lattes,  or got cash from someone who I bought from in person, pain in my ass...\n\nI went into the cafeteria once, even the plain rice wasn't right because it was dry and crusty from sitting out so long ):<",
      "created_utc": 1632447141.0,
      "score": 12,
      "context": []
    },
    {
      "id": "he25kv8",
      "author": "saintceciliax",
      "body": "Should be able to get disability accommodations through the school that would allow you to change the meal plan, require them to have safe foods for you, and/or give you access to more kitchen space",
      "created_utc": 1632462627.0,
      "score": 8,
      "context": []
    },
    {
      "id": "he1kzko",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1632450643.0,
      "score": 8,
      "context": []
    },
    {
      "id": "he2l1zd",
      "author": "Sixyn",
      "body": "I was able to get an exemption from the meal plan with a letter from my primary care doc. I was spending $200 on a $4000 meal plan my freshman and sophomore years.\n\nSeriously, just get the exemption and do some grocery shopping, then pay out of pocket for the meals you can actually eat. It will put you at ease.",
      "created_utc": 1632475797.0,
      "score": 5,
      "context": []
    },
    {
      "id": "he2ejv2",
      "author": "BreadRecent",
      "body": "Omg same luckily they make grilled cheese but the line for the grill is always so long so most of the time I get pizza for the 1029382th time. Those are my two options for meals. I think it’s kinda unfair of them to make a whole vegan/vegetarian bar, but not have an arfid bar or at least like a bar with just basic stuff for when you don’t like anything else. I wish this was a well known disorder and not called picky eating as if we control it. I almost want to bring it up to some people that control what food is out there, because I’m paying a lot of money for food I don’t like",
      "created_utc": 1632469804.0,
      "score": 3,
      "context": []
    },
    {
      "id": "he2p17t",
      "author": "Sugar_Rox",
      "body": "Omg that sounds so frustrating.   \nI'm going back to 2005 for my own university experience but I used my ARFID (didn't know it was called that then) in order to secure the rare 'non-catered' university halls accommodation. There was no way I would have eaten the choices (like you're finding) and the costs are extortionate if you don't ($6k for you it seems!) perfect if you're a human dustbin, but not for those like us. It was a mystery to me how people survived over there if they weren't a fan but I think a lot of it was surviving on ''just add hot water'' noodles and anything they could get in a microwave. Some also had mini-fridges (of their own purchase) in their room so that they could expand the facilities for themselves beyond the kitchenette provided. \n\nI think its such a scummy thing to do of a) forcing the freshmen to all have the meal plan and b) making them go for the largest plan when surely they're all just consuming booze and sleeping in (/s). It was the downside of the halls-selection of my place. my self-catered accommodation was isolated from the much-larger student-village that had the catering halls. I missed out on all-sorts of events and experiences this way, but they wouldn't do an opt out for the meal plan (I could have lived off of a microwave & toaster back then easy)  \n\n\nSo no advice, but I feel your frustration and things its ridiculous that they operate in this way. It's not just the money-hungry thing, but also if the quality of food is sucking, surely they waste loads!",
      "created_utc": 1632479126.0,
      "score": 3,
      "context": []
    },
    {
      "id": "he2p6b3",
      "author": "Taxouck",
      "body": "School food sucks so fucking much. Legit when I was a kid, the one reason that kept me from going to a better school than the shitty local one, was that I needed to come home for lunch every day because I couldn't tolerate school food. In middle school, in the rare times my mom couldn't come pick me up for lunch, I fully knew my meal was going to be one yoghurt, two if I was lucky. In high school, we'd switched to preparing sandwiches in the morning when going back home was unavailable. And at uni, I just hit up the closest sandwich shop. Better that than trying to learn whatever the fuck asshole king of the week we're being taught about while passed out from hunger.",
      "created_utc": 1632479235.0,
      "score": 2,
      "context": []
    },
    {
      "id": "he4d95d",
      "author": "Kelekona",
      "body": "It sucks that you had to pay for the meal plan... most colleges have a free shrink for students, so maybe you could go to the shrink and ask about special accommodations for your eating disorder.",
      "created_utc": 1632507724.0,
      "score": 1,
      "context": []
    },
    {
      "id": "he14ivo",
      "author": "cssc201",
      "body": "There is one cafeteria with multiple sub cafeterias. They have the menus online, but all that really does is tell me whether or not to even bother going",
      "created_utc": 1632442780.0,
      "score": 12,
      "context": [
        {
          "id": "he11r1y",
          "author": "sourdoughobsessed",
          "body": "My college had a printed menu for each cafeteria for the whole semester. Is there more than one cafeteria you can eat at? My roommate and I would go through and find the caf serving Mac and cheese and be sure to hit that one up.",
          "created_utc": 1632441449.0
        }
      ]
    },
    {
      "id": "he2ert8",
      "author": "BreadRecent",
      "body": "Rn I’m doing the same thing with the grilled cheese and fries💀 It’s good tho I don’t complain but it’s starting to get a little repetitive.",
      "created_utc": 1632469998.0,
      "score": 2,
      "context": [
        {
          "id": "he1kzko",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1632450643.0
        }
      ]
    },
    {
      "id": "he3imfx",
      "author": "cssc201",
      "body": "For now my problem is that I don't have access to a kitchen. I've emailed disability to see if it's possible to move dorms though",
      "created_utc": 1632494923.0,
      "score": 3,
      "context": [
        {
          "id": "he2l1zd",
          "author": "Sixyn",
          "body": "I was able to get an exemption from the meal plan with a letter from my primary care doc. I was spending $200 on a $4000 meal plan my freshman and sophomore years.\n\nSeriously, just get the exemption and do some grocery shopping, then pay out of pocket for the meals you can actually eat. It will put you at ease.",
          "created_utc": 1632475797.0
        }
      ]
    },
    {
      "id": "he4fz8c",
      "author": "cssc201",
      "body": "Yeah it's super frustrating that they don't let you choose any meal plan. Like I don't need 17 meals a week! I knew that when I signed up! I want more flexibility and not to be paying for meals I'm not going to use. No coincidence that it's the most expensive either... I don't really want an opt out either, I want to go sit with my friends in the dining hall for dinner even if I have to bring my own food or get it from somewhere else, and be able to eat when they do have food I can eat, but the 10 meal plan is more than enough.",
      "created_utc": 1632508885.0,
      "score": 1,
      "context": [
        {
          "id": "he2p17t",
          "author": "Sugar_Rox",
          "body": "Omg that sounds so frustrating.   \nI'm going back to 2005 for my own university experience but I used my ARFID (didn't know it was called that then) in order to secure the rare 'non-catered' university halls accommodation. There was no way I would have eaten the choices (like you're finding) and the costs are extortionate if you don't ($6k for you it seems!) perfect if you're a human dustbin, but not for those like us. It was a mystery to me how people survived over there if they weren't a fan but I think a lot of it was surviving on ''just add hot water'' noodles and anything they could get in a microwave. Some also had mini-fridges (of their own purchase) in their room so that they could expand the facilities for themselves beyond the kitchenette provided. \n\nI think its such a scummy thing to do of a) forcing the freshmen to all have the meal plan and b) making them go for the largest plan when surely they're all just consuming booze and sleeping in (/s). It was the downside of the halls-selection of my place. my self-catered accommodation was isolated from the much-larger student-village that had the catering halls. I missed out on all-sorts of events and experiences this way, but they wouldn't do an opt out for the meal plan (I could have lived off of a microwave & toaster back then easy)  \n\n\nSo no advice, but I feel your frustration and things its ridiculous that they operate in this way. It's not just the money-hungry thing, but also if the quality of food is sucking, surely they waste loads!",
          "created_utc": 1632479126.0
        }
      ]
    },
    {
      "id": "he1awej",
      "author": "sourdoughobsessed",
      "body": "Go through and find the meals you like and where they’re being served. Make a calendar or something so you don’t miss them . \n\nDo they really not have a pasta bar that’s always there at one of the dining halls?!? The “nice” one at my college always had plain pasta, red sauce nearby, and another pasta dish like penne alla vodka that changed throughout the week. Maybe the sauce was on the side? I forget. \n\nThat sucks. The food at my school was pretty good. They served a lot of turkey and mashed potatoes though so I was sick of it by the time tgiving rolled around.",
      "created_utc": 1632445805.0,
      "score": 9,
      "context": [
        {
          "id": "he11r1y",
          "author": "sourdoughobsessed",
          "body": "My college had a printed menu for each cafeteria for the whole semester. Is there more than one cafeteria you can eat at? My roommate and I would go through and find the caf serving Mac and cheese and be sure to hit that one up.",
          "created_utc": 1632441449.0
        },
        {
          "id": "he14ivo",
          "author": "cssc201",
          "body": "There is one cafeteria with multiple sub cafeterias. They have the menus online, but all that really does is tell me whether or not to even bother going",
          "created_utc": 1632442780.0
        }
      ]
    }
  ]
}