{
  "id": "pzk5t7",
  "subreddit": "ARFID",
  "author": "None",
  "created_utc": 1633132509.0,
  "title": "Sad evening because of cucumbers and a lack of understanding.",
  "selftext": "My boyfriend was cutting up cucumber slices while I was talking to him. He casually tried to put a slice in my mouth. I dodged him and was like \"wtf\". He asked why I won't eat it. I said I don't eat that. He said if I tried it, he wouldn't ask again. I left the room and I'm still sad about it. \n\nIt's such a complex situation. Like, I understand that it's stupid that I can't eat a cucumber slice. I understand that trying it once makes a lot of sense. I just can't do it because it looks like poison to me. It doesn't look like food. I wish I could just try things. I really do. The times when I've forced myself to try things resulted in my number of safe foods plummeting. \n\nI'm also frustrated because I've been with my boyfriend for 4 years and he apparently still doesn't understand. He sometimes says \"I used to be a picky eater too.\" What the hell do I do with that sentiment? Am I supposed to be inspired that he started eating more food when he was like 17? I'm 28 years old.... \n\nI don't make a big deal out of my condition. I will go hungry without complaint, no problem, just to make people comfortable. All I want is for them to just let me be. I don't pressure anyone to eat dirt or crickets. That's how it feels when it's done to me.  \n\nARFID is hell. Mostly because of other people....\n\nEdit: Yeah my bf is a bit of a \"bruh moment\" sometimes, but he's really great in general. Even this event stemmed from him wanting to \"help\" me. I think ARFID is just hard to understand.",
  "url": "https://www.reddit.com/r/ARFID/comments/pzk5t7/sad_evening_because_of_cucumbers_and_a_lack_of/",
  "score": 91,
  "num_comments": 11,
  "comments": [
    {
      "id": "hf2ac8a",
      "author": "StillEmotional",
      "body": "biggest pet peeve \"you might like it if you try it.\" -- \"NO I WONT GODDAMN IT LEAVE ME ALONE.\"",
      "created_utc": 1633151059.0,
      "score": 41,
      "context": []
    },
    {
      "id": "hf2laq4",
      "author": "saintceciliax",
      "body": "Please have a serious talk with him about ARFID. Make him understand. You deserve a partner who’s understanding and compassionate and would not make these comments or try to feed you anything like that, and I’m sure he cares about you and this is reparable. If it goes on it’ll probably cause you to resent him but hopefully he would be receptive to some education. Stress how it makes you feel and affects you deeply so that he can learn it isn’t casual or funny and that he frankly can’t relate so needs to respect your boundaries.",
      "created_utc": 1633159130.0,
      "score": 25,
      "context": []
    },
    {
      "id": "hf3hygp",
      "author": "jennybean2442",
      "body": "Explaining to someone that you don't need to taste it to know you don't like it is like explaining quantum chromo dynamics. They look at you like you have 3 heads. It blows their mind that other factors help you determine if you will like something (texture and smell for example)",
      "created_utc": 1633182060.0,
      "score": 10,
      "context": []
    },
    {
      "id": "hf3pmg2",
      "author": "feyre_0001",
      "body": "I had a friend do this to me in high school. She shoved a whole big slice of cucumber in my mouth, in front of a crowd, so I felt obligated not to throw up or spit it out. It was awful. I was gagging the moment it hit my tongue, and chewing? Christ. I’m sure the faces I made as I was basically dry heaving were not fun. \n\nThankfully, after watching me struggle like that, the friend never did it again.",
      "created_utc": 1633185772.0,
      "score": 6,
      "context": []
    },
    {
      "id": "hf2ky41",
      "author": "Taxouck",
      "body": "He tried to *force* it into your mouth???? THE FUCK???? This man has drank the ableism koolaid",
      "created_utc": 1633158864.0,
      "score": 10,
      "context": []
    },
    {
      "id": "hf3xspq",
      "author": "WoodWideWeb",
      "body": "It's not stupid that you won't eat a cucumber slice! I hate cucumbers! Your bf may *perceive* you not eating it as stupid, but that doesn't make it so. Be kind to yourself 💞\n\nIf it's been 4 years and there isn't an understanding in these kinds of situations it might be time for you to set some boundaries and express how you've been made to feel at a time when you can be chill about it and not caught up in the emotions of it all.\n\nI was called a picky eater growing up and now I know that I am not that. *WE* are not that. We have eating disorders. Screw any other eating label besides that one in my opinion.\n\nI've had success trying new foods with the support of my dietitian and I think the key reasons why it's working is:\n-I get to choose the food I try\n-I get to choose when and if I'm not feeling it no one is forcing me to try it. Even trying to try something new is a win even if the food doesn't enter your mouth.\n-I have a cheerleader (dietitian) there to support me either way and she helps me celebrate the wins\n-I get to choose the pace and if it's too much I can slow down or put everything on pause until I'm feeling more capable\n\nI'm glad you posted here and I hope you feel understood and supported by us ❤️ You did nothing wrong, sending love to you 💞",
      "created_utc": 1633189469.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hf2lv5k",
      "author": "BreadRecent",
      "body": "This is so patronizing. You need to let him know how you feel about it and if he has a problem, kick him to the curb.",
      "created_utc": 1633159572.0,
      "score": 10,
      "context": []
    },
    {
      "id": "hf4wqjq",
      "author": "Sao_X",
      "body": "I'm so sorry that happened, and honestly this is about more than a cucumber and you should make it clear to him. \n\nIt's about trust and respect, and he doesn't have to understand everything you will or won't do to respect it. Respecting your boundaries - because of  medical issues or personal issues or  even just because- is the most basic of expectation from a partner. your 'No' should be enough, even if it seems silly to him.   \n\n\nHe can show you the cucumber and say something like \"are you feeling like you could try something today?\" if he wants to help you overcome... but trying to push something into your mouth is so far out of line you shouldn't be sad - you should be fucking angry.",
      "created_utc": 1633204526.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hf47hax",
      "author": "aliblue225",
      "body": "L'enfer, c'est les autres. He doesn't understand what ARFID is, and 4 years into your relationship,  that's  concerning.",
      "created_utc": 1633193623.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hf4g02i",
      "author": "Draft_Master",
      "body": "I hate cucumbers with a passion! People don’t get that what they perceive as food, does not look that way to us. I try to explain this to friends sometimes but they just think I’m weird and keep listing stuff for me like “soooo how about tomatoes”, “is tomato sauce ok?”, “how about ketchup?” And it just goes on…",
      "created_utc": 1633197237.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hf4huhi",
      "author": "EyeBirb",
      "body": "This. Op at the very least you should show him this post",
      "created_utc": 1633198039.0,
      "score": 3,
      "context": [
        {
          "id": "hf2laq4",
          "author": "saintceciliax",
          "body": "Please have a serious talk with him about ARFID. Make him understand. You deserve a partner who’s understanding and compassionate and would not make these comments or try to feed you anything like that, and I’m sure he cares about you and this is reparable. If it goes on it’ll probably cause you to resent him but hopefully he would be receptive to some education. Stress how it makes you feel and affects you deeply so that he can learn it isn’t casual or funny and that he frankly can’t relate so needs to respect your boundaries.",
          "created_utc": 1633159130.0
        }
      ]
    }
  ]
}