{
  "id": "q31x4j",
  "subreddit": "ARFID",
  "author": "Chihuahua_enthusiast",
  "created_utc": 1633583423.0,
  "title": "Crying and laughing at the same time",
  "selftext": "",
  "url": "https://i.redd.it/13971huc1yr71.jpg",
  "score": 85,
  "num_comments": 5,
  "comments": [
    {
      "id": "hfqnigv",
      "author": "giraffemoo",
      "body": "I hated doing this. My mom dragged me to a nutritionist who scared me into thinking that I was going to die before I reached 20 because of malnutrition, she shamed me for every thing I wrote (and didn't write) in my food diary. \"Why are you having this at this time? Why would you eat this when you already ate that thing once that day? You know you can't have a healthy life eating only french fries. That's not a meal.\"\n\nAs an adult, I talked to my primary physician and talked to them about my issues. They did bloodwork on me and a bunch of tests, and I was fine. The doctor told me something I'll never forget, she said \"eating junk is healthier for your body than eating NOTHING.\" And that stuck with me. I was starving myself because all I wanted was doritos or french fries or chocolate or pizza. The nutritionist in my head was telling me that it was bad to eat those things, so I just wouldn't eat anything. I don't listen to the nutritionist inside my head anymore and I have a much healthier and happier life for it.",
      "created_utc": 1633621256.0,
      "score": 8,
      "context": []
    },
    {
      "id": "hfpf4qf",
      "author": "okokokokok11111",
      "body": "Haha, I doubly feel this as someone who's also diabetic. \"Why YES, I do eat low carb! Please ignore the last 6 weeks of me eating nothing but high glycemic index foods due to stress.\"",
      "created_utc": 1633594175.0,
      "score": 7,
      "context": []
    },
    {
      "id": "hfqq2ld",
      "author": "Prestigious_Ad432",
      "body": "what? I totallyy didn't eat a ton of plain chips as a reward for school because of the comfy, familiar flavor",
      "created_utc": 1633622304.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hfrstyg",
      "author": "kireiwei",
      "body": "im trying so hard to be consistent with my food diary but the ADHD combined with \"oh god this is the 5th day in a row i had pizza bagels for lunch and didnt even finish them\" makes it such a pain lmao",
      "created_utc": 1633638230.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hfq31z9",
      "author": "AvarageMaintenanceMe",
      "body": "I so feel you! 😅 It's really hard to balance...",
      "created_utc": 1633612019.0,
      "score": 2,
      "context": [
        {
          "id": "hfpf4qf",
          "author": "okokokokok11111",
          "body": "Haha, I doubly feel this as someone who's also diabetic. \"Why YES, I do eat low carb! Please ignore the last 6 weeks of me eating nothing but high glycemic index foods due to stress.\"",
          "created_utc": 1633594175.0
        }
      ]
    }
  ]
}