{
  "id": "qc5vcy",
  "subreddit": "ARFID",
  "author": "Hot-Journalist1139",
  "created_utc": 1634750198.0,
  "title": "Some differences between picky eating and ARFID",
  "selftext": "",
  "url": "https://i.redd.it/tx573sl42nu71.jpg",
  "score": 534,
  "num_comments": 83,
  "comments": [
    {
      "id": "hhe5jmn",
      "author": "None",
      "body": "Also trying to eat a food you've enjoyed, then vomiting at the smell and never being able to eat it again for no reason at all.",
      "created_utc": 1634754573.0,
      "score": 78,
      "context": []
    },
    {
      "id": "hhe0map",
      "author": "NotApplicableMC",
      "body": "Also another difference: picky eating doesn’t affect your social life like ARFID does. ARFID sufferers sometimes have to cancel social events because they know there won’t be any safe food, or fear being judged for their eating habits.\n\nARFID can also lead to other complications like nutrient deficiencies and being underweight (sometimes overweight), whereas mild picky eaters can still eat enough to maintain a healthy balanced diet.",
      "created_utc": 1634752585.0,
      "score": 86,
      "context": []
    },
    {
      "id": "hhe2d11",
      "author": "zetsv",
      "body": "This is very interesting, especially for me! I dont consider myself to have ARFID necessarily, but my pretty intense ADHD manifests in some pretty extreme food aversion and with almost every single one of these i fall somewhere in the middle or not really into either category. Thanks for sharing it!",
      "created_utc": 1634753289.0,
      "score": 38,
      "context": []
    },
    {
      "id": "hhdvada",
      "author": "Mbluna",
      "body": "This has settled things for me I’m just plain and simply picky as can be. I’m solidly in the picky column nothing on the right. Thanks for this post OP I’ve been trying to find some just like this for a long time.",
      "created_utc": 1634750473.0,
      "score": 51,
      "context": []
    },
    {
      "id": "hhe912p",
      "author": "DimDreamer",
      "body": "Wow. I'm 100% the stuff in the right column. I guess it's time to start doing something about it.",
      "created_utc": 1634755967.0,
      "score": 22,
      "context": []
    },
    {
      "id": "hhfbcq9",
      "author": "sadcorvid",
      "body": "wait gagging to foods you don’t like isn’t normal???",
      "created_utc": 1634771841.0,
      "score": 15,
      "context": []
    },
    {
      "id": "hhg8ezu",
      "author": "wernerherzogsurethra",
      "body": "Speaking from experience, beating ARFID looks like a mix of both columns that doesn't interfere (as much) with your life. \n\n1. I could definitely still point you to 20+ food items that I wouldn't eat (where did the number 20 come from in this list anyway? Surely that's not in the DSM). But the number of food items I can and do enthusiastically eat has skyrocketed. The aversions don't go away; they are simply fewer, rarer, and frankly they don't bother me anymore. I can confidently say in any setting that I'm not a fan of sausage (for example) and just have something else. Therapy doesn't just help with the actual expanding of dietary palates, but also and more importantly with the confidence to own your choices and preferences without shame in the real world.\n\n2. I'm happy to try new food if it's in a category I've become comfortable with. So I can be excited about trying a new chicken dish, but dread trying any pork dish. It really is amazing how once you've gotten \"exposed\" to different kinds of a food group, the whole category becomes pretty safe. \n\n3. I definitely still gag sometimes when I try a tricky food. That's reaction doesn't go anywhere. It really is just a matter of accepting your gags with grace, handling it delicately, and not beating yourself up over it. Gagging is good because it means I'm still continuing to broaden my palate even now. It's just that some of those experiments don't pay off. \n\n4. You don't owe anybody an explanation for your food aversions. State your preferences and own them. The fourth point about explaining aversions isn't meaningful regardless. \n\n5. On the fifth point, I land squarely in the middle of both descriptions. Now that I've recovered from ARFID, I relish in eating a wide variety of different foods. That said, my wife and many others have noted with good humor that I do have a tendency to eat the same meals for days in a row. Like there was a month I made the exact same cauliflower dish a dozen times. Coming from ARFID, I think that counts as variety! But my poor non-ARFID wife was totally sick of cauliflower by the end of it. I kind of also got sick of cauliflower too -- it just took me much much longer.\n\n6. I still have extreme aversions. They are just rarer and fewer. They also don't bother me or make me feel ashamed anymore. \n\nI hope that gives some of you a sense of what to expect in ARFID recovery. The goal is not to land squarely in the left column, but to find a mix that works for you and lets you go about your life with minjmal food-related disruptions and just be at peace with yourself and how things are for you.",
      "created_utc": 1634787468.0,
      "score": 15,
      "context": []
    },
    {
      "id": "hhgikgy",
      "author": "FatElk",
      "body": "Is pizza and mac and cheese considered a \"wide range of varying foods\"?",
      "created_utc": 1634793773.0,
      "score": 12,
      "context": []
    },
    {
      "id": "hhey0zi",
      "author": "Taxouck",
      "body": "idk sounds like a recipe for gatekeeping I'd rather not try and quantify who \"really has arfid\"",
      "created_utc": 1634765930.0,
      "score": 37,
      "context": []
    },
    {
      "id": "hhe5yar",
      "author": "None",
      "body": "this confuses me because my psychiatrist and therapist both think ARFID is the correct diagnosis for me but I don't match up with a lot of what is on the right. I don't think it's good to make generalizations like this, my ARFID is the result of dealing with an undiagnosed health issue that caused nausea for many years. I guess I do kind of cut out certain foods (like pasta and bread) that make the health issue worse but I still eat many different foods. when I grocery shop for myself I tend to buy the same things as snacks everytime and I have a favorite meal at every restaurant around me but for the most part I do eat a variety of foods. I struggle with avoiding food altogether (and food related tasks like shopping or fridge cleaning), so I think this still means what I am dealing with is ARFID",
      "created_utc": 1634754733.0,
      "score": 22,
      "context": []
    },
    {
      "id": "hhfnag2",
      "author": "EunuchProgrammer",
      "body": "Solid on the right for 60yrs. It gets better.",
      "created_utc": 1634777336.0,
      "score": 5,
      "context": []
    },
    {
      "id": "hhi6ls5",
      "author": "eighteencarps",
      "body": "Hot take, I don't care about being called picky. Even if you do consider them different, though, I also don't think it's any more shameful to be a \"picky eater\" than have ARFID. The whole knee-jerk \"we're not picky!\"--what does it matter if we are? No one should feel pressured to eating food they don't want to eat.  \n\n\nEDIT: I'm reading comments and seeing people are mostly using this as a tool to see if their eating is disordered vs non-disordered, which I do think is useful. Sorry for my *own* knee-jerk reaction lol",
      "created_utc": 1634832204.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hhgkf1e",
      "author": "numnummommom",
      "body": "Can we get this pinned to the top?",
      "created_utc": 1634795125.0,
      "score": 5,
      "context": []
    },
    {
      "id": "hheh4v8",
      "author": "jupiterLILY",
      "body": "What is this based on and who wrote it? \n\nThis reads more like someone seeking validation than a diagnostic criteria.",
      "created_utc": 1634759161.0,
      "score": 9,
      "context": []
    },
    {
      "id": "hhezmom",
      "author": "madamelex",
      "body": "See, when they had that big post on “unpopular opinion” about “picky eaters suck” and a lot of people were acting like that was “discrimination against people with ARFID”… I did not agree. As you can see above there is a difference between picky eating and arfid. To me it’s like the difference between saying “people who act obsessive are jerks” vs “people with OCD are jerks”.  \n\nThank you for making it clear that ARFID is a disorder people suffer from and not a behaviour people choose.",
      "created_utc": 1634766610.0,
      "score": 5,
      "context": []
    },
    {
      "id": "hhh2r81",
      "author": "nueve",
      "body": "This is spot on. Mods should sticky it!",
      "created_utc": 1634811213.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hhii8vf",
      "author": "slushyheart",
      "body": "Perfectly half and half, gotta love being indecisive\nWish I could just know without having to have an awkward talk with my parents and pay for an expensive therapist",
      "created_utc": 1634836799.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hsznb55",
      "author": "bwells85",
      "body": "can't believe I found this diagnosis, for my seven year old autistic son who is non verbal.  still working on finding a psychologist to diagnose him, but I will not stop until I find him the right person to help.",
      "created_utc": 1642388423.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iofhn7t",
      "author": "None",
      "body": "I'm a mix of both",
      "created_utc": 1663180368.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k6a99oc",
      "author": "One_Calligrapher_711",
      "body": "I can eat a lot of different foods and different textures.\n\nCall me picky, but I'd rather go hungry than eat leftovers. Sandwiches overwhelm me. Bit sized or bust.\n\nI'm a fan of fruit and dessert but never together.",
      "created_utc": 1698172554.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hhf9z7v",
      "author": "50colt30",
      "body": "Yup this happened to me with rice and pork chops",
      "created_utc": 1634771201.0,
      "score": 11,
      "context": [
        {
          "id": "hhe5jmn",
          "author": "None",
          "body": "Also trying to eat a food you've enjoyed, then vomiting at the smell and never being able to eat it again for no reason at all.",
          "created_utc": 1634754573.0
        }
      ]
    },
    {
      "id": "hhfs40p",
      "author": "ZennyDaye",
      "body": "I've recently lost macaroni and cheese for some reason. I was so sick last night but mostly just sad.",
      "created_utc": 1634779558.0,
      "score": 9,
      "context": [
        {
          "id": "hhe5jmn",
          "author": "None",
          "body": "Also trying to eat a food you've enjoyed, then vomiting at the smell and never being able to eat it again for no reason at all.",
          "created_utc": 1634754573.0
        }
      ]
    },
    {
      "id": "hhfxw78",
      "author": "transmascdraco",
      "body": "For a long time this was me with Cool Ranch Doritos. \n\nI can vividly recall the situation that made me avoid them in the first place too.",
      "created_utc": 1634782241.0,
      "score": 2,
      "context": [
        {
          "id": "hhe5jmn",
          "author": "None",
          "body": "Also trying to eat a food you've enjoyed, then vomiting at the smell and never being able to eat it again for no reason at all.",
          "created_utc": 1634754573.0
        }
      ]
    },
    {
      "id": "hi7lgje",
      "author": "Usual-Ad-6888",
      "body": "I used to love bagels with cream cheese, ate it for weeks on end. Now the texture makes me so uncomfortable that i gagged trying to make one the last time i tried.",
      "created_utc": 1635310003.0,
      "score": 1,
      "context": [
        {
          "id": "hhe5jmn",
          "author": "None",
          "body": "Also trying to eat a food you've enjoyed, then vomiting at the smell and never being able to eat it again for no reason at all.",
          "created_utc": 1634754573.0
        }
      ]
    },
    {
      "id": "mtj4e7f",
      "author": "TheLovelyOne422",
      "body": "This happened a while back ate something say local place didn’t realize I was starting with stomach bug so immediately thru it up couldn’t touch it for years after",
      "created_utc": 1747857006.0,
      "score": 1,
      "context": [
        {
          "id": "hhe5jmn",
          "author": "None",
          "body": "Also trying to eat a food you've enjoyed, then vomiting at the smell and never being able to eat it again for no reason at all.",
          "created_utc": 1634754573.0
        }
      ]
    },
    {
      "id": "jwcoo6y",
      "author": "Souhwhyarewehere-lol",
      "body": "STOP THIS IS EXACTLY WHAT HAPPENED WITH MY FAV BRAND OF FROZEN PIZZA!\n\ni feel like I disappointed my entire family on that one…",
      "created_utc": 1692139424.0,
      "score": 1,
      "context": [
        {
          "id": "hhe5jmn",
          "author": "None",
          "body": "Also trying to eat a food you've enjoyed, then vomiting at the smell and never being able to eat it again for no reason at all.",
          "created_utc": 1634754573.0
        }
      ]
    },
    {
      "id": "hhfz5nf",
      "author": "ThomYoder",
      "body": "Absolutely this. I have turned down invites to several weddings because I am always concerned about people reacting to me either getting a plate of food with very little on it (or not eating at all) or getting a plate and only eating a couple of things.\n\nWeddings, pot lucks, and dinners at fancy restaurants are invites I decline most of the time.",
      "created_utc": 1634782833.0,
      "score": 19,
      "context": [
        {
          "id": "hhe0map",
          "author": "NotApplicableMC",
          "body": "Also another difference: picky eating doesn’t affect your social life like ARFID does. ARFID sufferers sometimes have to cancel social events because they know there won’t be any safe food, or fear being judged for their eating habits.\n\nARFID can also lead to other complications like nutrient deficiencies and being underweight (sometimes overweight), whereas mild picky eaters can still eat enough to maintain a healthy balanced diet.",
          "created_utc": 1634752585.0
        }
      ]
    },
    {
      "id": "hhi02a3",
      "author": "Rigga-Goo-Goo",
      "body": "Is the distress level definitively part of it? I'm new to learning about it and this is what I'm curious about because I mark all the boxes except the distress and deficiencies. I will literally bring my own food to social gatherings, zero fucks given (yes, even weddings - it helps that I can carry a purse, I always keep something in it, usually buttered buns in those situations). Most of my foods are carbs so I don't have a problem keeping on weight. I don't usually gag or worry about choking but it'll take me an hour to force myself to a piece of toast because, meh. I'm not overweight but when I get close it's extremely difficult to \"diet\" because I can't imagine reducing my already extremely limited list of foods.\n\nBut the distress/deficiency level is always what I come back to... do I not have it because it hasn't impacted my life in that way, even though I meet the other metrics?",
      "created_utc": 1634829492.0,
      "score": 3,
      "context": [
        {
          "id": "hhe0map",
          "author": "NotApplicableMC",
          "body": "Also another difference: picky eating doesn’t affect your social life like ARFID does. ARFID sufferers sometimes have to cancel social events because they know there won’t be any safe food, or fear being judged for their eating habits.\n\nARFID can also lead to other complications like nutrient deficiencies and being underweight (sometimes overweight), whereas mild picky eaters can still eat enough to maintain a healthy balanced diet.",
          "created_utc": 1634752585.0
        }
      ]
    },
    {
      "id": "hhi2lg7",
      "author": "Rigga-Goo-Goo",
      "body": "I'm also ADHD and feel similarly. I'm definitely leaning more on the ARFID side, though, I think? Now that I'm getting older, I will try \"new\" foods if there's a base of something I like, if I'm really hungry (ex. I only eat hamburgers but if cheeseburgers are my only option, and I'm desperate, I can scrape the cheese off and try really really hard to pretend it's a hamburger). That would have been entirely unimaginable when I was younger. But fully new foods? I'd still go hungry.",
      "created_utc": 1634830552.0,
      "score": 10,
      "context": [
        {
          "id": "hhe2d11",
          "author": "zetsv",
          "body": "This is very interesting, especially for me! I dont consider myself to have ARFID necessarily, but my pretty intense ADHD manifests in some pretty extreme food aversion and with almost every single one of these i fall somewhere in the middle or not really into either category. Thanks for sharing it!",
          "created_utc": 1634753289.0
        }
      ]
    },
    {
      "id": "hhig2h3",
      "author": "justasapling",
      "body": "Interesting. Me too.\n\nI lean pretty hard towards the 'picky eating' side of this chart except for a couple of food groups (seafood, certain beans, certain textures), which very much make me gag/feel sick if I try to get them down.\n\nI've been able to expand my comfort zone *a ton* as I've grown up, but no matter how many times I've forced myself to try seafood it never gets any easier. I would *love* to be able to eat sushi, and I can get a few bites down, but I always feel so gross after.😔\n\nGreen beans can get fucked, though.",
      "created_utc": 1634835936.0,
      "score": 4,
      "context": [
        {
          "id": "hhe2d11",
          "author": "zetsv",
          "body": "This is very interesting, especially for me! I dont consider myself to have ARFID necessarily, but my pretty intense ADHD manifests in some pretty extreme food aversion and with almost every single one of these i fall somewhere in the middle or not really into either category. Thanks for sharing it!",
          "created_utc": 1634753289.0
        }
      ]
    },
    {
      "id": "hheyyb2",
      "author": "None",
      "body": "This list is overly restrictive. Please talk to medical professionals to get a diagnosis, not the internet.",
      "created_utc": 1634766318.0,
      "score": 38,
      "context": [
        {
          "id": "hhdvada",
          "author": "Mbluna",
          "body": "This has settled things for me I’m just plain and simply picky as can be. I’m solidly in the picky column nothing on the right. Thanks for this post OP I’ve been trying to find some just like this for a long time.",
          "created_utc": 1634750473.0
        }
      ]
    },
    {
      "id": "hhegevm",
      "author": "StonedSpaceCadet",
      "body": "Right, like I low key feel called out because of how accurate it is. I'm not really sure where to start though",
      "created_utc": 1634758877.0,
      "score": 7,
      "context": [
        {
          "id": "hhe912p",
          "author": "DimDreamer",
          "body": "Wow. I'm 100% the stuff in the right column. I guess it's time to start doing something about it.",
          "created_utc": 1634755967.0
        }
      ]
    },
    {
      "id": "hhfdvqt",
      "author": "Hot-Journalist1139",
      "body": "Gagging is a normal reaction when eating or smelling something gross, but those with ARFID may gag due to the anxiety surrounding certain foods or when they try new foods and it may not necessarily mean it smells or tastes bad",
      "created_utc": 1634773026.0,
      "score": 17,
      "context": [
        {
          "id": "hhfbcq9",
          "author": "sadcorvid",
          "body": "wait gagging to foods you don’t like isn’t normal???",
          "created_utc": 1634771841.0
        }
      ]
    },
    {
      "id": "hhgrrcd",
      "author": "ZennyDaye",
      "body": "I count pizza as my greatest success. You have one or two different kinds of cheese, meat, thick red sauce... I can only really do Hawaiian or pepperoni, but every time I do, I give myself a pat on the back like, \"Look at this nonsense that you're gonna eat like a professional. Ten points.\"",
      "created_utc": 1634801122.0,
      "score": 10,
      "context": [
        {
          "id": "hhgikgy",
          "author": "FatElk",
          "body": "Is pizza and mac and cheese considered a \"wide range of varying foods\"?",
          "created_utc": 1634793773.0
        }
      ]
    },
    {
      "id": "hhez3mf",
      "author": "None",
      "body": "exactly. my psychiatrist says it's ARFID that's enough for me. but for someone who hasn't already gotten that diagnosis seeing something like this could prevent them from seeking help.",
      "created_utc": 1634766382.0,
      "score": 18,
      "context": [
        {
          "id": "hhey0zi",
          "author": "Taxouck",
          "body": "idk sounds like a recipe for gatekeeping I'd rather not try and quantify who \"really has arfid\"",
          "created_utc": 1634765930.0
        }
      ]
    },
    {
      "id": "hhezbmd",
      "author": "Hot-Journalist1139",
      "body": "No one can tell anyone who “really has ARFID” besides a professional",
      "created_utc": 1634766480.0,
      "score": 3,
      "context": [
        {
          "id": "hhey0zi",
          "author": "Taxouck",
          "body": "idk sounds like a recipe for gatekeeping I'd rather not try and quantify who \"really has arfid\"",
          "created_utc": 1634765930.0
        }
      ]
    },
    {
      "id": "hheyipl",
      "author": "None",
      "body": "This is honestly an overly restrictive list. \n\nTo be diagnosed with ARFID, you need most of the things on the right. Without a source, I wouldn't consider this definitive.",
      "created_utc": 1634766135.0,
      "score": 19,
      "context": [
        {
          "id": "hhe5yar",
          "author": "None",
          "body": "this confuses me because my psychiatrist and therapist both think ARFID is the correct diagnosis for me but I don't match up with a lot of what is on the right. I don't think it's good to make generalizations like this, my ARFID is the result of dealing with an undiagnosed health issue that caused nausea for many years. I guess I do kind of cut out certain foods (like pasta and bread) that make the health issue worse but I still eat many different foods. when I grocery shop for myself I tend to buy the same things as snacks everytime and I have a favorite meal at every restaurant around me but for the most part I do eat a variety of foods. I struggle with avoiding food altogether (and food related tasks like shopping or fridge cleaning), so I think this still means what I am dealing with is ARFID",
          "created_utc": 1634754733.0
        }
      ]
    },
    {
      "id": "k6a9yfd",
      "author": "One_Calligrapher_711",
      "body": "My aversion to thick bread made me think I had celiacs.",
      "created_utc": 1698172803.0,
      "score": 2,
      "context": [
        {
          "id": "hhe5yar",
          "author": "None",
          "body": "this confuses me because my psychiatrist and therapist both think ARFID is the correct diagnosis for me but I don't match up with a lot of what is on the right. I don't think it's good to make generalizations like this, my ARFID is the result of dealing with an undiagnosed health issue that caused nausea for many years. I guess I do kind of cut out certain foods (like pasta and bread) that make the health issue worse but I still eat many different foods. when I grocery shop for myself I tend to buy the same things as snacks everytime and I have a favorite meal at every restaurant around me but for the most part I do eat a variety of foods. I struggle with avoiding food altogether (and food related tasks like shopping or fridge cleaning), so I think this still means what I am dealing with is ARFID",
          "created_utc": 1634754733.0
        }
      ]
    },
    {
      "id": "hhfrdou",
      "author": "ZennyDaye",
      "body": "Just casually, I'd like to point out that Arfid shouldn't be diagnosed if the eating disturbance is due to other medical conditions. \n\nIt's actually part of the diagnostic criteria that unless your symptoms have gone severely over what would be expected from your medical condition, then an Arfid diagnosis shouldn't be made. Much as how it shouldn't be diagnosed if the food intake restriction is primarily due to any other reason like poverty, food availability, food allergies, anorexia, bullimia, autism,  culture/tradition...\n\nIt's only been in the DSM as of the last version and your psychiatrist might not be thoroughly familiar with the condition. Many aren't in my experience. ARFID awareness isn't very high even among medical professionals and for many people, it's synonymous to \"picky eating.\"",
      "created_utc": 1634779221.0,
      "score": 3,
      "context": [
        {
          "id": "hhe5yar",
          "author": "None",
          "body": "this confuses me because my psychiatrist and therapist both think ARFID is the correct diagnosis for me but I don't match up with a lot of what is on the right. I don't think it's good to make generalizations like this, my ARFID is the result of dealing with an undiagnosed health issue that caused nausea for many years. I guess I do kind of cut out certain foods (like pasta and bread) that make the health issue worse but I still eat many different foods. when I grocery shop for myself I tend to buy the same things as snacks everytime and I have a favorite meal at every restaurant around me but for the most part I do eat a variety of foods. I struggle with avoiding food altogether (and food related tasks like shopping or fridge cleaning), so I think this still means what I am dealing with is ARFID",
          "created_utc": 1634754733.0
        }
      ]
    },
    {
      "id": "hhiav8j",
      "author": "Hot-Journalist1139",
      "body": "I think being called “picky” disregards the actual mental disorder those with ARFID struggle with. It also makes the disorder seem less serious than it is. Being a picky eater usually isn’t an issue for the person, while ARFID can effect the person’s life and can cause serious health problems. There’s nothing wrong with being a picky eater and I agree that no one should ever feel pressured to eat something they don’t want to, but I think it’s important to realize there is a difference and spread awareness on ARFID.",
      "created_utc": 1634833906.0,
      "score": 2,
      "context": [
        {
          "id": "hhi6ls5",
          "author": "eighteencarps",
          "body": "Hot take, I don't care about being called picky. Even if you do consider them different, though, I also don't think it's any more shameful to be a \"picky eater\" than have ARFID. The whole knee-jerk \"we're not picky!\"--what does it matter if we are? No one should feel pressured to eating food they don't want to eat.  \n\n\nEDIT: I'm reading comments and seeing people are mostly using this as a tool to see if their eating is disordered vs non-disordered, which I do think is useful. Sorry for my *own* knee-jerk reaction lol",
          "created_utc": 1634832204.0
        }
      ]
    },
    {
      "id": "hhil8gk",
      "author": "None",
      "body": "honestly I had the same reaction as you. I'm not sure that making a big deal about the distinction between picky eating and arfid is helpful. The way I see it all mental health disorders exist on a spectrum, and telling someone who is \"just picky\" that they don't have ARFID may prevent them from examining their eating habits more closely, the same way telling someone who is \"just sad\" that they are not depressed could be harmful. I think people often let mental health issues go unaddressed for quite a while because of this \"not sick enough\" mentality, and this sub is guilty of perpetuating that. this post and others kind of made me realize that and I have now left the sub.",
      "created_utc": 1634838002.0,
      "score": 2,
      "context": [
        {
          "id": "hhi6ls5",
          "author": "eighteencarps",
          "body": "Hot take, I don't care about being called picky. Even if you do consider them different, though, I also don't think it's any more shameful to be a \"picky eater\" than have ARFID. The whole knee-jerk \"we're not picky!\"--what does it matter if we are? No one should feel pressured to eating food they don't want to eat.  \n\n\nEDIT: I'm reading comments and seeing people are mostly using this as a tool to see if their eating is disordered vs non-disordered, which I do think is useful. Sorry for my *own* knee-jerk reaction lol",
          "created_utc": 1634832204.0
        }
      ]
    },
    {
      "id": "hhexc5b",
      "author": "applejacklover97",
      "body": "[Link to DSM entry for ARFID](https://www.ncbi.nlm.nih.gov/books/NBK519712/table/ch3.t18/)\n\nIt’s not word for word, but many of the things OP’s graphic states are in there, esp refusing food despite health consequences.",
      "created_utc": 1634765633.0,
      "score": 4,
      "context": [
        {
          "id": "hheh4v8",
          "author": "jupiterLILY",
          "body": "What is this based on and who wrote it? \n\nThis reads more like someone seeking validation than a diagnostic criteria.",
          "created_utc": 1634759161.0
        }
      ]
    },
    {
      "id": "hhf129l",
      "author": "Hot-Journalist1139",
      "body": "Nowhere does this state it’s diagnostic criteria; it’s just a graphic I found showing some differences between picky eating and ARFID because there is a difference. Obviously, there is so much more to ARFID and everyone is different. Those who think they might have ARFID should talk to a professional to get diagnosed.",
      "created_utc": 1634767228.0,
      "score": 2,
      "context": [
        {
          "id": "hheh4v8",
          "author": "jupiterLILY",
          "body": "What is this based on and who wrote it? \n\nThis reads more like someone seeking validation than a diagnostic criteria.",
          "created_utc": 1634759161.0
        }
      ]
    },
    {
      "id": "hhfufop",
      "author": "ZennyDaye",
      "body": "I have a friend who has a total of maybe 10 things she doesn't eat, and she's continuously telling me that she \"knows what I'm dealing with\" even as she invites me to restaurants...\n\nI won't say they suck, but they do absolutely nothing to help people take psychiatric disorders seriously when there's one group actually suffering and another large vocal group spreading the message that arfid is not liking mushrooms on pizza, etc.",
      "created_utc": 1634780627.0,
      "score": 10,
      "context": [
        {
          "id": "hhezmom",
          "author": "madamelex",
          "body": "See, when they had that big post on “unpopular opinion” about “picky eaters suck” and a lot of people were acting like that was “discrimination against people with ARFID”… I did not agree. As you can see above there is a difference between picky eating and arfid. To me it’s like the difference between saying “people who act obsessive are jerks” vs “people with OCD are jerks”.  \n\nThank you for making it clear that ARFID is a disorder people suffer from and not a behaviour people choose.",
          "created_utc": 1634766610.0
        }
      ]
    },
    {
      "id": "hhfgf74",
      "author": "None",
      "body": "Happened to me with pork as well",
      "created_utc": 1634774209.0,
      "score": 3,
      "context": [
        {
          "id": "hhe5jmn",
          "author": "None",
          "body": "Also trying to eat a food you've enjoyed, then vomiting at the smell and never being able to eat it again for no reason at all.",
          "created_utc": 1634754573.0
        },
        {
          "id": "hhf9z7v",
          "author": "50colt30",
          "body": "Yup this happened to me with rice and pork chops",
          "created_utc": 1634771201.0
        }
      ]
    },
    {
      "id": "jwcouh8",
      "author": "Souhwhyarewehere-lol",
      "body": "When I was a kid, for about a year straight I only ate fruit and cream cheese and bagels. breakfast lunch and dinner. Now I can’t stand either one of them",
      "created_utc": 1692139494.0,
      "score": 2,
      "context": [
        {
          "id": "hhe5jmn",
          "author": "None",
          "body": "Also trying to eat a food you've enjoyed, then vomiting at the smell and never being able to eat it again for no reason at all.",
          "created_utc": 1634754573.0
        },
        {
          "id": "hi7lgje",
          "author": "Usual-Ad-6888",
          "body": "I used to love bagels with cream cheese, ate it for weeks on end. Now the texture makes me so uncomfortable that i gagged trying to make one the last time i tried.",
          "created_utc": 1635310003.0
        }
      ]
    },
    {
      "id": "hhgtgv0",
      "author": "None",
      "body": "I haven't been to a wedding since I was a kid. I almost went to my ex's wedding (we're good friends, nothing weird there) and then the pandemic happened and they ended up splitting up. \n\nI told her I'd be able to come to the ceremony but not the reception because I had family arrangements for that time. She of all people knows my eating problems one of the best so I know she'd cater for me but I didn't want to go through the whole conversation about it.",
      "created_utc": 1634802653.0,
      "score": 4,
      "context": [
        {
          "id": "hhe0map",
          "author": "NotApplicableMC",
          "body": "Also another difference: picky eating doesn’t affect your social life like ARFID does. ARFID sufferers sometimes have to cancel social events because they know there won’t be any safe food, or fear being judged for their eating habits.\n\nARFID can also lead to other complications like nutrient deficiencies and being underweight (sometimes overweight), whereas mild picky eaters can still eat enough to maintain a healthy balanced diet.",
          "created_utc": 1634752585.0
        },
        {
          "id": "hhfz5nf",
          "author": "ThomYoder",
          "body": "Absolutely this. I have turned down invites to several weddings because I am always concerned about people reacting to me either getting a plate of food with very little on it (or not eating at all) or getting a plate and only eating a couple of things.\n\nWeddings, pot lucks, and dinners at fancy restaurants are invites I decline most of the time.",
          "created_utc": 1634782833.0
        }
      ]
    },
    {
      "id": "hhi31ua",
      "author": "NotApplicableMC",
      "body": "The thing about ARFID is that it’s a **disorder** which means it should negatively affect your life in some way.\n\nYou mention struggling to lose weight because of ARFID-like symptoms. My SO is exactly the same so I feel for you. This would be an example of how ARFID would negatively affect your life. \n\nBringing your own food to a wedding may not affect you negatively but it’s still considered “not normal” (in our society at least). Has anyone ever made fun of you for your weird eating habits?\n\nYou can’t verify some nutrient deficiencies until you have a blood test, so your disordered eating might be affecting you in ways you don’t know. \n\nUltimately my advice is this: **don’t diagnose yourself based on a post you saw on Reddit. If you suspect you have ARFID you should see a doctor for a blood test and talk to a psychiatrist about it**. Myself and no one here is qualified to give you medical advice.",
      "created_utc": 1634830740.0,
      "score": 3,
      "context": [
        {
          "id": "hhe0map",
          "author": "NotApplicableMC",
          "body": "Also another difference: picky eating doesn’t affect your social life like ARFID does. ARFID sufferers sometimes have to cancel social events because they know there won’t be any safe food, or fear being judged for their eating habits.\n\nARFID can also lead to other complications like nutrient deficiencies and being underweight (sometimes overweight), whereas mild picky eaters can still eat enough to maintain a healthy balanced diet.",
          "created_utc": 1634752585.0
        },
        {
          "id": "hhi02a3",
          "author": "Rigga-Goo-Goo",
          "body": "Is the distress level definitively part of it? I'm new to learning about it and this is what I'm curious about because I mark all the boxes except the distress and deficiencies. I will literally bring my own food to social gatherings, zero fucks given (yes, even weddings - it helps that I can carry a purse, I always keep something in it, usually buttered buns in those situations). Most of my foods are carbs so I don't have a problem keeping on weight. I don't usually gag or worry about choking but it'll take me an hour to force myself to a piece of toast because, meh. I'm not overweight but when I get close it's extremely difficult to \"diet\" because I can't imagine reducing my already extremely limited list of foods.\n\nBut the distress/deficiency level is always what I come back to... do I not have it because it hasn't impacted my life in that way, even though I meet the other metrics?",
          "created_utc": 1634829492.0
        }
      ]
    },
    {
      "id": "hhn59aa",
      "author": "zetsv",
      "body": "Your method of trying new foods sounds very similar to mine. If im presented with a new food its not necessarily the “new” that throws me off but other things like not knowing EXACTLY what is in it. For example if it is something that was made by a friend who can tell me everything that went into it and those are all at least relatively safe food for me I’ll probably definitely try at least a bite. However if its a restaurant situation or someone i dont know made it and i dont feel comfortable interrogating them about what EXACTLY is in it i will absolutely pass",
      "created_utc": 1634922669.0,
      "score": 4,
      "context": [
        {
          "id": "hhe2d11",
          "author": "zetsv",
          "body": "This is very interesting, especially for me! I dont consider myself to have ARFID necessarily, but my pretty intense ADHD manifests in some pretty extreme food aversion and with almost every single one of these i fall somewhere in the middle or not really into either category. Thanks for sharing it!",
          "created_utc": 1634753289.0
        },
        {
          "id": "hhi2lg7",
          "author": "Rigga-Goo-Goo",
          "body": "I'm also ADHD and feel similarly. I'm definitely leaning more on the ARFID side, though, I think? Now that I'm getting older, I will try \"new\" foods if there's a base of something I like, if I'm really hungry (ex. I only eat hamburgers but if cheeseburgers are my only option, and I'm desperate, I can scrape the cheese off and try really really hard to pretend it's a hamburger). That would have been entirely unimaginable when I was younger. But fully new foods? I'd still go hungry.",
          "created_utc": 1634830552.0
        }
      ]
    },
    {
      "id": "hhn6zy6",
      "author": "zetsv",
      "body": "This sounds shockingly similar to me. Like i have foods that i legitimately cannot eat under any circumstances. I guess my dislikes are not only kinda numerous but extremely intense. The last time i ate egg (was an accident too lol) was about 10 years ago on vacation and the second I realized what it was (it was like a quiche and i thought it was a more typical savory pie) i dramatically threw up and continued to gag for 10 minutes afterwards. And before that the last time i had eaten eggs (not in a baked good, those seem to be fine) i was an actual toddler. My aversion is so strong and intense people sometimes assume i have a life threatening allergy oops. My partner is not even allowed to cook eggs (hard boiled are okay tho) if i am home because the smell alone is enough to make me uncontrollably gag. Egg is definitely my biggest one, along side black licorice/anise/fennel but luckily that is much less common and i dont run into it very often. \n\nI also have a hard time with sea food, except like the absolute best cuts of fish meat and sometimes shrimp but its so dependent on how it is cooked/prepared\n\nI also struggle so so so much with meat. I can only eat white meat (chicken, turkey, exc) or SOME beef like ground beef if fine but if i eat meat it mostly has to be processed because i swear to god if any part of it is even of 0.01% different texture than the rest i will not be able to eat any of the rest of the meal, even the non meat parts. It sets off the food aversion part of my brain like absolutely nothing else. Even thinking about it gives me the heebie jeebies right now lol. \n\nIm so glad you have had success with expanding your comfort zone! That takes a ton of work so congratulations 😁 im slowly getting there too, im absolutely better than i used to be. And in the meantime its better for the planet to eat less meat anyway so i also embrace eating less as much as i can haha\n\nEdit to add: sorry this comment turned into an essay!!",
      "created_utc": 1634923378.0,
      "score": 4,
      "context": [
        {
          "id": "hhe2d11",
          "author": "zetsv",
          "body": "This is very interesting, especially for me! I dont consider myself to have ARFID necessarily, but my pretty intense ADHD manifests in some pretty extreme food aversion and with almost every single one of these i fall somewhere in the middle or not really into either category. Thanks for sharing it!",
          "created_utc": 1634753289.0
        },
        {
          "id": "hhig2h3",
          "author": "justasapling",
          "body": "Interesting. Me too.\n\nI lean pretty hard towards the 'picky eating' side of this chart except for a couple of food groups (seafood, certain beans, certain textures), which very much make me gag/feel sick if I try to get them down.\n\nI've been able to expand my comfort zone *a ton* as I've grown up, but no matter how many times I've forced myself to try seafood it never gets any easier. I would *love* to be able to eat sushi, and I can get a few bites down, but I always feel so gross after.😔\n\nGreen beans can get fucked, though.",
          "created_utc": 1634835936.0
        }
      ]
    },
    {
      "id": "hhgtkfl",
      "author": "None",
      "body": "> Please talk to medical professionals to get a diagnosis\n\nlol my GP told me I'd have to find somebody myself to do that as the NHS doesn't cover it. Turns out it's a couple of grand and 8 weeks of fucking appointments to confirm it.",
      "created_utc": 1634802745.0,
      "score": 7,
      "context": [
        {
          "id": "hhdvada",
          "author": "Mbluna",
          "body": "This has settled things for me I’m just plain and simply picky as can be. I’m solidly in the picky column nothing on the right. Thanks for this post OP I’ve been trying to find some just like this for a long time.",
          "created_utc": 1634750473.0
        },
        {
          "id": "hheyyb2",
          "author": "None",
          "body": "This list is overly restrictive. Please talk to medical professionals to get a diagnosis, not the internet.",
          "created_utc": 1634766318.0
        }
      ]
    },
    {
      "id": "hhf2o7l",
      "author": "Mbluna",
      "body": "Of course I’d never diagnosis myself although I am a health care provider. I’m pretty sure I’m just picky bc I eat everything except meat bc of the texture and taste as well baked goods overall are just not my thing but I eat pretty much everything else. Any and all spices the hotter the better and I get bored with the same food quickly.",
      "created_utc": 1634767939.0,
      "score": 6,
      "context": [
        {
          "id": "hhdvada",
          "author": "Mbluna",
          "body": "This has settled things for me I’m just plain and simply picky as can be. I’m solidly in the picky column nothing on the right. Thanks for this post OP I’ve been trying to find some just like this for a long time.",
          "created_utc": 1634750473.0
        },
        {
          "id": "hheyyb2",
          "author": "None",
          "body": "This list is overly restrictive. Please talk to medical professionals to get a diagnosis, not the internet.",
          "created_utc": 1634766318.0
        }
      ]
    },
    {
      "id": "hhelbkx",
      "author": "Mbluna",
      "body": "Don’t feel called out, think of this as a learning tool/information. Be kind to yourself you deserve it!!",
      "created_utc": 1634760793.0,
      "score": 6,
      "context": [
        {
          "id": "hhe912p",
          "author": "DimDreamer",
          "body": "Wow. I'm 100% the stuff in the right column. I guess it's time to start doing something about it.",
          "created_utc": 1634755967.0
        },
        {
          "id": "hhegevm",
          "author": "StonedSpaceCadet",
          "body": "Right, like I low key feel called out because of how accurate it is. I'm not really sure where to start though",
          "created_utc": 1634758877.0
        }
      ]
    },
    {
      "id": "hhf10sa",
      "author": "Taxouck",
      "body": "(And even then many professionals can be very, very wrong.)",
      "created_utc": 1634767210.0,
      "score": 19,
      "context": [
        {
          "id": "hhey0zi",
          "author": "Taxouck",
          "body": "idk sounds like a recipe for gatekeeping I'd rather not try and quantify who \"really has arfid\"",
          "created_utc": 1634765930.0
        },
        {
          "id": "hhezbmd",
          "author": "Hot-Journalist1139",
          "body": "No one can tell anyone who “really has ARFID” besides a professional",
          "created_utc": 1634766480.0
        }
      ]
    },
    {
      "id": "hhfvnty",
      "author": "None",
      "body": "I think my psychiatrist thought that the diagnosis fit given that once I started treatment for the health issue and regained my appetite I still was (am) struggling to eat. it's definitely an eating disorder, and it definitely doesn't fit with anorexia. also ARFID is common with OCD so maybe my reaction to the chronic nausea has to do with me having OCD too. \n\nsorry I don't fit into your understanding of what ARFID is. my psychiatrist is familiar with ARFID I was referred to her specifically because of that.",
      "created_utc": 1634781206.0,
      "score": 3,
      "context": [
        {
          "id": "hhe5yar",
          "author": "None",
          "body": "this confuses me because my psychiatrist and therapist both think ARFID is the correct diagnosis for me but I don't match up with a lot of what is on the right. I don't think it's good to make generalizations like this, my ARFID is the result of dealing with an undiagnosed health issue that caused nausea for many years. I guess I do kind of cut out certain foods (like pasta and bread) that make the health issue worse but I still eat many different foods. when I grocery shop for myself I tend to buy the same things as snacks everytime and I have a favorite meal at every restaurant around me but for the most part I do eat a variety of foods. I struggle with avoiding food altogether (and food related tasks like shopping or fridge cleaning), so I think this still means what I am dealing with is ARFID",
          "created_utc": 1634754733.0
        },
        {
          "id": "hhfrdou",
          "author": "ZennyDaye",
          "body": "Just casually, I'd like to point out that Arfid shouldn't be diagnosed if the eating disturbance is due to other medical conditions. \n\nIt's actually part of the diagnostic criteria that unless your symptoms have gone severely over what would be expected from your medical condition, then an Arfid diagnosis shouldn't be made. Much as how it shouldn't be diagnosed if the food intake restriction is primarily due to any other reason like poverty, food availability, food allergies, anorexia, bullimia, autism,  culture/tradition...\n\nIt's only been in the DSM as of the last version and your psychiatrist might not be thoroughly familiar with the condition. Many aren't in my experience. ARFID awareness isn't very high even among medical professionals and for many people, it's synonymous to \"picky eating.\"",
          "created_utc": 1634779221.0
        }
      ]
    },
    {
      "id": "k6aaa5w",
      "author": "One_Calligrapher_711",
      "body": "ARFID is heterogeneous and it can be short term (due to GI issues among other things) or long term. Just looked it up.\n\nPrior to the DSM 5 it was called something else.",
      "created_utc": 1698172918.0,
      "score": 1,
      "context": [
        {
          "id": "hhe5yar",
          "author": "None",
          "body": "this confuses me because my psychiatrist and therapist both think ARFID is the correct diagnosis for me but I don't match up with a lot of what is on the right. I don't think it's good to make generalizations like this, my ARFID is the result of dealing with an undiagnosed health issue that caused nausea for many years. I guess I do kind of cut out certain foods (like pasta and bread) that make the health issue worse but I still eat many different foods. when I grocery shop for myself I tend to buy the same things as snacks everytime and I have a favorite meal at every restaurant around me but for the most part I do eat a variety of foods. I struggle with avoiding food altogether (and food related tasks like shopping or fridge cleaning), so I think this still means what I am dealing with is ARFID",
          "created_utc": 1634754733.0
        },
        {
          "id": "hhfrdou",
          "author": "ZennyDaye",
          "body": "Just casually, I'd like to point out that Arfid shouldn't be diagnosed if the eating disturbance is due to other medical conditions. \n\nIt's actually part of the diagnostic criteria that unless your symptoms have gone severely over what would be expected from your medical condition, then an Arfid diagnosis shouldn't be made. Much as how it shouldn't be diagnosed if the food intake restriction is primarily due to any other reason like poverty, food availability, food allergies, anorexia, bullimia, autism,  culture/tradition...\n\nIt's only been in the DSM as of the last version and your psychiatrist might not be thoroughly familiar with the condition. Many aren't in my experience. ARFID awareness isn't very high even among medical professionals and for many people, it's synonymous to \"picky eating.\"",
          "created_utc": 1634779221.0
        }
      ]
    },
    {
      "id": "hhj864g",
      "author": "Hot-Journalist1139",
      "body": "You contradict yourself by saying that telling a person they are “just picky” can prevent someone from getting help, but then saying “I’m not sure making a big deal about the distinction is helpful.” You understand exactly why it is helpful. By differentiating the two, parents won’t disregard their children as just being picky and will instead look further to see if their child may have ARFID, and those who have been told all their lives they are just picky may realize their avoidance of food is not “just picky eating.” People with ARFID are not picky eaters, they have a mental disorder, so we should stop using the terms synonymously.",
      "created_utc": 1634847292.0,
      "score": 1,
      "context": [
        {
          "id": "hhi6ls5",
          "author": "eighteencarps",
          "body": "Hot take, I don't care about being called picky. Even if you do consider them different, though, I also don't think it's any more shameful to be a \"picky eater\" than have ARFID. The whole knee-jerk \"we're not picky!\"--what does it matter if we are? No one should feel pressured to eating food they don't want to eat.  \n\n\nEDIT: I'm reading comments and seeing people are mostly using this as a tool to see if their eating is disordered vs non-disordered, which I do think is useful. Sorry for my *own* knee-jerk reaction lol",
          "created_utc": 1634832204.0
        },
        {
          "id": "hhil8gk",
          "author": "None",
          "body": "honestly I had the same reaction as you. I'm not sure that making a big deal about the distinction between picky eating and arfid is helpful. The way I see it all mental health disorders exist on a spectrum, and telling someone who is \"just picky\" that they don't have ARFID may prevent them from examining their eating habits more closely, the same way telling someone who is \"just sad\" that they are not depressed could be harmful. I think people often let mental health issues go unaddressed for quite a while because of this \"not sick enough\" mentality, and this sub is guilty of perpetuating that. this post and others kind of made me realize that and I have now left the sub.",
          "created_utc": 1634838002.0
        }
      ]
    },
    {
      "id": "hheytrj",
      "author": "None",
      "body": "One thing missing from this graphic, you do NOT need to identify with *all* of the things on the right to have ARFID. \n\nIt's not at all word for word, especially the gagging piece. I've never gagged, but I certainly have ARFID.",
      "created_utc": 1634766263.0,
      "score": 13,
      "context": [
        {
          "id": "hheh4v8",
          "author": "jupiterLILY",
          "body": "What is this based on and who wrote it? \n\nThis reads more like someone seeking validation than a diagnostic criteria.",
          "created_utc": 1634759161.0
        },
        {
          "id": "hhexc5b",
          "author": "applejacklover97",
          "body": "[Link to DSM entry for ARFID](https://www.ncbi.nlm.nih.gov/books/NBK519712/table/ch3.t18/)\n\nIt’s not word for word, but many of the things OP’s graphic states are in there, esp refusing food despite health consequences.",
          "created_utc": 1634765633.0
        }
      ]
    },
    {
      "id": "hhf6025",
      "author": "None",
      "body": "the title along with the \"do I have arfid\" flair send a different message so it could be worth taking the time to be clear next time",
      "created_utc": 1634769418.0,
      "score": 4,
      "context": [
        {
          "id": "hheh4v8",
          "author": "jupiterLILY",
          "body": "What is this based on and who wrote it? \n\nThis reads more like someone seeking validation than a diagnostic criteria.",
          "created_utc": 1634759161.0
        },
        {
          "id": "hhf129l",
          "author": "Hot-Journalist1139",
          "body": "Nowhere does this state it’s diagnostic criteria; it’s just a graphic I found showing some differences between picky eating and ARFID because there is a difference. Obviously, there is so much more to ARFID and everyone is different. Those who think they might have ARFID should talk to a professional to get diagnosed.",
          "created_utc": 1634767228.0
        }
      ]
    },
    {
      "id": "hhget2c",
      "author": "madamelex",
      "body": "Totally agree. It’s like… everyone is narcissistic once in a while- it doesn’t make them a narcissist. Everyone experiences sadness or depression symptoms at some point but it’s much different than clinical depression. Picky eating does not equal ARFID. ARFID does not equal picky eating.",
      "created_utc": 1634791240.0,
      "score": 3,
      "context": [
        {
          "id": "hhezmom",
          "author": "madamelex",
          "body": "See, when they had that big post on “unpopular opinion” about “picky eaters suck” and a lot of people were acting like that was “discrimination against people with ARFID”… I did not agree. As you can see above there is a difference between picky eating and arfid. To me it’s like the difference between saying “people who act obsessive are jerks” vs “people with OCD are jerks”.  \n\nThank you for making it clear that ARFID is a disorder people suffer from and not a behaviour people choose.",
          "created_utc": 1634766610.0
        },
        {
          "id": "hhfufop",
          "author": "ZennyDaye",
          "body": "I have a friend who has a total of maybe 10 things she doesn't eat, and she's continuously telling me that she \"knows what I'm dealing with\" even as she invites me to restaurants...\n\nI won't say they suck, but they do absolutely nothing to help people take psychiatric disorders seriously when there's one group actually suffering and another large vocal group spreading the message that arfid is not liking mushrooms on pizza, etc.",
          "created_utc": 1634780627.0
        }
      ]
    },
    {
      "id": "hhgtbal",
      "author": "None",
      "body": "Same here. Pork is weird for me, some days it's fine some days it's not. Bacon is nearly always loved, and pork chops are nearly always making me gag. A pork roast is nearly always loved but sausages are entirely miss and hit.",
      "created_utc": 1634802516.0,
      "score": 3,
      "context": [
        {
          "id": "hhe5jmn",
          "author": "None",
          "body": "Also trying to eat a food you've enjoyed, then vomiting at the smell and never being able to eat it again for no reason at all.",
          "created_utc": 1634754573.0
        },
        {
          "id": "hhf9z7v",
          "author": "50colt30",
          "body": "Yup this happened to me with rice and pork chops",
          "created_utc": 1634771201.0
        },
        {
          "id": "hhfgf74",
          "author": "None",
          "body": "Happened to me with pork as well",
          "created_utc": 1634774209.0
        }
      ]
    },
    {
      "id": "jwcp0y5",
      "author": "Usual-Ad-6888",
      "body": "Losing safe foods is so so scary, especially when they're all you eat for a while.",
      "created_utc": 1692139566.0,
      "score": 2,
      "context": [
        {
          "id": "hhe5jmn",
          "author": "None",
          "body": "Also trying to eat a food you've enjoyed, then vomiting at the smell and never being able to eat it again for no reason at all.",
          "created_utc": 1634754573.0
        },
        {
          "id": "hi7lgje",
          "author": "Usual-Ad-6888",
          "body": "I used to love bagels with cream cheese, ate it for weeks on end. Now the texture makes me so uncomfortable that i gagged trying to make one the last time i tried.",
          "created_utc": 1635310003.0
        },
        {
          "id": "jwcouh8",
          "author": "Souhwhyarewehere-lol",
          "body": "When I was a kid, for about a year straight I only ate fruit and cream cheese and bagels. breakfast lunch and dinner. Now I can’t stand either one of them",
          "created_utc": 1692139494.0
        }
      ]
    },
    {
      "id": "hhhno22",
      "author": "ThomYoder",
      "body": "Oh definitely! It is so much easier for me to turn down an invite than to try and explain my whole deal to people. Then when people do know and start going out of their way to pick a restaurant or meal that works for me, I get embarrassed and things get awkward.\n\nI always tell people that I don’t want anybody to let me dictate their meal choices.",
      "created_utc": 1634824039.0,
      "score": 2,
      "context": [
        {
          "id": "hhe0map",
          "author": "NotApplicableMC",
          "body": "Also another difference: picky eating doesn’t affect your social life like ARFID does. ARFID sufferers sometimes have to cancel social events because they know there won’t be any safe food, or fear being judged for their eating habits.\n\nARFID can also lead to other complications like nutrient deficiencies and being underweight (sometimes overweight), whereas mild picky eaters can still eat enough to maintain a healthy balanced diet.",
          "created_utc": 1634752585.0
        },
        {
          "id": "hhfz5nf",
          "author": "ThomYoder",
          "body": "Absolutely this. I have turned down invites to several weddings because I am always concerned about people reacting to me either getting a plate of food with very little on it (or not eating at all) or getting a plate and only eating a couple of things.\n\nWeddings, pot lucks, and dinners at fancy restaurants are invites I decline most of the time.",
          "created_utc": 1634782833.0
        },
        {
          "id": "hhgtgv0",
          "author": "None",
          "body": "I haven't been to a wedding since I was a kid. I almost went to my ex's wedding (we're good friends, nothing weird there) and then the pandemic happened and they ended up splitting up. \n\nI told her I'd be able to come to the ceremony but not the reception because I had family arrangements for that time. She of all people knows my eating problems one of the best so I know she'd cater for me but I didn't want to go through the whole conversation about it.",
          "created_utc": 1634802653.0
        }
      ]
    },
    {
      "id": "hhkjydk",
      "author": "Rigga-Goo-Goo",
      "body": "Oh, it absolutely has had a negative impact in my life, I've just never been distressed by it. Growing up with red hair and freckles also negatively impacted my life, but I'd place both of those in the same category. Actually, red hair was worse because of the genetic resistance to novocaine - I am far more distressed at the thought of going to the dentist due to being tortured for 15+ years, than I am by social situations around food. 😂\n\nI definitely have had people make fun of me for it in the past when I was younger, but I usually laughed with them because whatever they said was usually funny or true. I don't recall ever having my feelings hurt by it or feeling insecure about it. I was a pretty confident/arrogant kid so it just didn't bother me (and still doesn't). \n\nBringing food to different social situations hasn't ever been a production where I stand out like, \"The weirdo is here! Everyone watching this? Here I go!\" I mean, I'll eat in the car quick before an event or later on have a snack to hold me over. No one notices. They'll ask why I'm not eating if there's a meal - \"Oh, I'm not hungry. I ate before I came.\" But we all move on with our lives and no one cares.\n\nHidden nutrient deficiencies would be my only motivation at this point to get diagnosed, but I've had lots of blood work throughout the years and there haven't been any abnormalities so far. I will keep that in mind to discuss with my doctor, though.\n\nI guess my question comes down to whether it's worth getting a diagnosis if I don't feel like I'm motivated enough to treat it?\n\nEdit:\nI just wanted to add that I recognize that I'm lucky in that I have enough of a variety of food to at least somewhat sustain myself (pending potential nutritional deficiencies notwithstanding). I understand how debilitating this can be and I'm very grateful that it's never become a medical or mental health issue.",
      "created_utc": 1634868896.0,
      "score": 3,
      "context": [
        {
          "id": "hhe0map",
          "author": "NotApplicableMC",
          "body": "Also another difference: picky eating doesn’t affect your social life like ARFID does. ARFID sufferers sometimes have to cancel social events because they know there won’t be any safe food, or fear being judged for their eating habits.\n\nARFID can also lead to other complications like nutrient deficiencies and being underweight (sometimes overweight), whereas mild picky eaters can still eat enough to maintain a healthy balanced diet.",
          "created_utc": 1634752585.0
        },
        {
          "id": "hhi02a3",
          "author": "Rigga-Goo-Goo",
          "body": "Is the distress level definitively part of it? I'm new to learning about it and this is what I'm curious about because I mark all the boxes except the distress and deficiencies. I will literally bring my own food to social gatherings, zero fucks given (yes, even weddings - it helps that I can carry a purse, I always keep something in it, usually buttered buns in those situations). Most of my foods are carbs so I don't have a problem keeping on weight. I don't usually gag or worry about choking but it'll take me an hour to force myself to a piece of toast because, meh. I'm not overweight but when I get close it's extremely difficult to \"diet\" because I can't imagine reducing my already extremely limited list of foods.\n\nBut the distress/deficiency level is always what I come back to... do I not have it because it hasn't impacted my life in that way, even though I meet the other metrics?",
          "created_utc": 1634829492.0
        },
        {
          "id": "hhi31ua",
          "author": "NotApplicableMC",
          "body": "The thing about ARFID is that it’s a **disorder** which means it should negatively affect your life in some way.\n\nYou mention struggling to lose weight because of ARFID-like symptoms. My SO is exactly the same so I feel for you. This would be an example of how ARFID would negatively affect your life. \n\nBringing your own food to a wedding may not affect you negatively but it’s still considered “not normal” (in our society at least). Has anyone ever made fun of you for your weird eating habits?\n\nYou can’t verify some nutrient deficiencies until you have a blood test, so your disordered eating might be affecting you in ways you don’t know. \n\nUltimately my advice is this: **don’t diagnose yourself based on a post you saw on Reddit. If you suspect you have ARFID you should see a doctor for a blood test and talk to a psychiatrist about it**. Myself and no one here is qualified to give you medical advice.",
          "created_utc": 1634830740.0
        }
      ]
    },
    {
      "id": "hho0dk7",
      "author": "justasapling",
      "body": "Honestly it sounds like I have it easier than you.❤️\n\n>Im so glad you have had success with expanding your comfort zone!\n\nAfter a childhood spent ordering everything plain, it still brings me such joy to be able to order a sandwich or a burger with everything on it.\n\nAs a kid my biggest challenge was probably chunky tomato sauces. I once threw up while eating pizza because I got a big slimy, meaty chunk of tomato. I still don't like tomato-flesh, but I can handle it in a sandwich or a chunky sauce.\n\nI'm grateful eggs don't bother me (though dry scrambled eggs tend to make me feel a little queasy).\n\nAnd the seafood thing bums me out. Lots of people in my life are seafood fanatics, and I've always lived in top tier seafood cities. I used to eat fish no problem as a kid, but around age 12 some switch flipped in my brain and now anything that lived in water doesn't feel like food to me. Even duck is kind of seafoody to me. I can eat two or three raw oysters happily, or like one piece of sashimi, but anything past that and I feel grosser and grosser. Cooked fish is a no way. Shrimp is an ABSOLUTELY not.",
      "created_utc": 1634935464.0,
      "score": 1,
      "context": [
        {
          "id": "hhe2d11",
          "author": "zetsv",
          "body": "This is very interesting, especially for me! I dont consider myself to have ARFID necessarily, but my pretty intense ADHD manifests in some pretty extreme food aversion and with almost every single one of these i fall somewhere in the middle or not really into either category. Thanks for sharing it!",
          "created_utc": 1634753289.0
        },
        {
          "id": "hhig2h3",
          "author": "justasapling",
          "body": "Interesting. Me too.\n\nI lean pretty hard towards the 'picky eating' side of this chart except for a couple of food groups (seafood, certain beans, certain textures), which very much make me gag/feel sick if I try to get them down.\n\nI've been able to expand my comfort zone *a ton* as I've grown up, but no matter how many times I've forced myself to try seafood it never gets any easier. I would *love* to be able to eat sushi, and I can get a few bites down, but I always feel so gross after.😔\n\nGreen beans can get fucked, though.",
          "created_utc": 1634835936.0
        },
        {
          "id": "hhn6zy6",
          "author": "zetsv",
          "body": "This sounds shockingly similar to me. Like i have foods that i legitimately cannot eat under any circumstances. I guess my dislikes are not only kinda numerous but extremely intense. The last time i ate egg (was an accident too lol) was about 10 years ago on vacation and the second I realized what it was (it was like a quiche and i thought it was a more typical savory pie) i dramatically threw up and continued to gag for 10 minutes afterwards. And before that the last time i had eaten eggs (not in a baked good, those seem to be fine) i was an actual toddler. My aversion is so strong and intense people sometimes assume i have a life threatening allergy oops. My partner is not even allowed to cook eggs (hard boiled are okay tho) if i am home because the smell alone is enough to make me uncontrollably gag. Egg is definitely my biggest one, along side black licorice/anise/fennel but luckily that is much less common and i dont run into it very often. \n\nI also have a hard time with sea food, except like the absolute best cuts of fish meat and sometimes shrimp but its so dependent on how it is cooked/prepared\n\nI also struggle so so so much with meat. I can only eat white meat (chicken, turkey, exc) or SOME beef like ground beef if fine but if i eat meat it mostly has to be processed because i swear to god if any part of it is even of 0.01% different texture than the rest i will not be able to eat any of the rest of the meal, even the non meat parts. It sets off the food aversion part of my brain like absolutely nothing else. Even thinking about it gives me the heebie jeebies right now lol. \n\nIm so glad you have had success with expanding your comfort zone! That takes a ton of work so congratulations 😁 im slowly getting there too, im absolutely better than i used to be. And in the meantime its better for the planet to eat less meat anyway so i also embrace eating less as much as i can haha\n\nEdit to add: sorry this comment turned into an essay!!",
          "created_utc": 1634923378.0
        }
      ]
    },
    {
      "id": "hhgg3nb",
      "author": "Cressio",
      "body": "Yeah considering it wasn't even published as a real thing until a few years ago, my faith in any medical professional to even know what it is is very low. Hopefully that changes",
      "created_utc": 1634792083.0,
      "score": 5,
      "context": [
        {
          "id": "hhey0zi",
          "author": "Taxouck",
          "body": "idk sounds like a recipe for gatekeeping I'd rather not try and quantify who \"really has arfid\"",
          "created_utc": 1634765930.0
        },
        {
          "id": "hhezbmd",
          "author": "Hot-Journalist1139",
          "body": "No one can tell anyone who “really has ARFID” besides a professional",
          "created_utc": 1634766480.0
        },
        {
          "id": "hhf10sa",
          "author": "Taxouck",
          "body": "(And even then many professionals can be very, very wrong.)",
          "created_utc": 1634767210.0
        }
      ]
    },
    {
      "id": "hhgq73a",
      "author": "ZennyDaye",
      "body": "*My* understandng? Lol, you were the one who posted you had a condition causing your nausea:\n\n&#x200B;\n\n>...my ARFID is the result of dealing with an undiagnosed health issue that caused nausea for many years. I guess I do kind of cut out certain foods (like pasta and bread) that make the health issue worse but I still eat many different foods.\n\nThat was what you said. How did I misunderstand that? Eating **many different foods** doesn't sound contradictory to **avoidant**/**restrictive food intake** to you?  Am I misunderstanding what you mean by *many* or *different* or *food*? \n\n>for the most part I do eat a variety of foods.\n\nThat was what you said. That is counterintuitive to the most basic meaning of 'restricted food intake.' This isn't one of those ambiguous disorders, it's pretty much what it says on the tin. \n\nPart of being diagnosed with ARFID is a diet that's *so* restrictive, a person persistently fails to meet their nutritional/energy needs. We're talking failure to thrive, anemia, weight loss, feeding tubes... Actual suffering. How are you persistently malnourished eating many different foods? A variety of foods as you said. \n\n \n\n>it's definitely an eating disorder, and it definitely doesn't fit with anorexia.\n\nIt's not an either/or thing. ARFID is not a catch-all for people who don't fit with anorexia, bulimia, pica, etc. You can have an eating disorder without having a specific one. If you don't meet a specific criteria, it's just supposed to be an \"unspecified feeding disorder.\" \n\n&#x200B;\n\n>also ARFID is common with OCD so maybe my reaction to the chronic nausea has to do with me having OCD too.\n\nOCD's a common comorbidity but it's still two separate conditions. My fridge is disgusting af right now, but that's not ARFID, that's a low disgust threshold. \n\nHaving a low disgust threshold is common with OCD but being generally disgusted with food isn't ARFID. People with autism have restricted food selection, but it isn't ARFID in and of itself.\n\n&#x200B;\n\n>sorry I don't fit into your understanding of what ARFID is. my psychiatrist is familiar with ARFID I was referred to her specifically because of that.\n\nThis isn't a \"my truth, your truth, my understanding, your understanding\" thing. Do you understand that psychiatric diseases have certain criteria? Much like biological diseases?\n\nObviously, I don't know your business and I'm not telling you not to trust your psychiatrist. You've been worked up and maybe you are persistently malnourished despite eating many different foods. \n\nThey have your details, maybe the undiagnosed health condition causing your chronic nausea for many years was insignificant so it made sense to your psychiatrist to disregard it. Who knows? \n\nI only replied because you seemed genuinely confused by the OP's graphic. My understanding of ARFID is pretty spot on. \n\nYou can be defensive, you can stay confused, but why join an ARFID group and then be like, \"You shouldn't make generalisations about Avoidant/Restrictive Food Intake Disorder causing avoidant/restrictive food intake because I eat a variety of foods and my restricted diet is due to a condition I had that caused chronic nausea and maybe OCD. Forget the international diagnostic standard, trust my understanding instead even though I'm a bit confused as to why you all think ARFID involves having a restricted diet.\"",
      "created_utc": 1634799759.0,
      "score": 1,
      "context": [
        {
          "id": "hhe5yar",
          "author": "None",
          "body": "this confuses me because my psychiatrist and therapist both think ARFID is the correct diagnosis for me but I don't match up with a lot of what is on the right. I don't think it's good to make generalizations like this, my ARFID is the result of dealing with an undiagnosed health issue that caused nausea for many years. I guess I do kind of cut out certain foods (like pasta and bread) that make the health issue worse but I still eat many different foods. when I grocery shop for myself I tend to buy the same things as snacks everytime and I have a favorite meal at every restaurant around me but for the most part I do eat a variety of foods. I struggle with avoiding food altogether (and food related tasks like shopping or fridge cleaning), so I think this still means what I am dealing with is ARFID",
          "created_utc": 1634754733.0
        },
        {
          "id": "hhfrdou",
          "author": "ZennyDaye",
          "body": "Just casually, I'd like to point out that Arfid shouldn't be diagnosed if the eating disturbance is due to other medical conditions. \n\nIt's actually part of the diagnostic criteria that unless your symptoms have gone severely over what would be expected from your medical condition, then an Arfid diagnosis shouldn't be made. Much as how it shouldn't be diagnosed if the food intake restriction is primarily due to any other reason like poverty, food availability, food allergies, anorexia, bullimia, autism,  culture/tradition...\n\nIt's only been in the DSM as of the last version and your psychiatrist might not be thoroughly familiar with the condition. Many aren't in my experience. ARFID awareness isn't very high even among medical professionals and for many people, it's synonymous to \"picky eating.\"",
          "created_utc": 1634779221.0
        },
        {
          "id": "hhfvnty",
          "author": "None",
          "body": "I think my psychiatrist thought that the diagnosis fit given that once I started treatment for the health issue and regained my appetite I still was (am) struggling to eat. it's definitely an eating disorder, and it definitely doesn't fit with anorexia. also ARFID is common with OCD so maybe my reaction to the chronic nausea has to do with me having OCD too. \n\nsorry I don't fit into your understanding of what ARFID is. my psychiatrist is familiar with ARFID I was referred to her specifically because of that.",
          "created_utc": 1634781206.0
        }
      ]
    },
    {
      "id": "k6urag1",
      "author": "ZennyDaye",
      "body": "I know it was called something else. I was in med school when the fifth dsm came out. One of my psych profs ran me through a working draft of it some time in 2011 or 2012 because we'd had a retreat/lunch/seminar type thing and he'd noticed my peculiar eating habits. \n\nI can't fully paint a picture for you of what it's like being very ND studying medicine or to have your private life be turned into a teachable moment in a classroom setting, but it's unforgettable and I don't have to look it up.\n\nWhat is this even in response to? These days I'm actively trying to not even think very much about med. Why are we talking about the dsm? Isn't it publicly available? They revised it recently iirc. You can get a copy and check it out. The only specific thing I remember them changing is that the onset didn't have to be before 5 or 6.\n\nWith most conditions in the DSM, you have to rule out that it's attributable to other bio, psycho or social situations. For example, you don't diagnose people who are grieving the death of a loved one with depression, you don't diagnose someone with anxiety if they have an ongoing cocaine addiction problem. If there does happen to be another condition in play, then it needs to be in excess of what you'd typically expect from the condition.\n\nHow it works is that a GI issue is a GI issue. Someone with stomach cancer for example would meet much of the criteria for Arfid. People on chemo in general. The kind of chemo that causes nausea. Many patients have a severely restricted intake, but you don't diagnose every chemo patient with Arfid as a comorbidity because it's not in excess of what you'd expect from someone on chemotherapy even though they have the weight loss, nutritional deficits, etc. \n\nAnd in this situation, it is always very difficult for a psychiatrist to measure what is in excess of a typical medical condition. They don't usually tell people, \"hey, I know you have a ulcer and eating is painful so you're restricting yourself to a bland diet, but I feel like your diet is excessively restrictive so I'm going to diagnose you with an eating disorder and you're going to have psychotherapy twice a week to work on that.\" \n\nOf course, some will because money, and it's a judgement call, and this leads to all the articles you see about psychiatric over-diagnosis and over-medication but it's very difficult to have a reliable measure of what is or is not \"excessive.\" Which is why I've personally come to believe that psych is at the ass end of science. I won't go full \"It's a pseudoscience\" but it's definitely the least scientific of the medical fields. \n\nSomeone with a diagnosable GI condition rarely goes to a psychiatrist first up, but if they do, the psychiatrist is supposed to refer them out to a gastrointerologist or other relevant party and only after ruling out medical/surgical causes are they supposed to attribute disordered eating to a psychiatric condition.\n\nThink of it as a hierarchical structure, surgical>=medical>>>>psychiatric.\n\nFor a better comparison, think of someone who has blackouts. You're supposed to rule out seizure disorders, tumours, etc before you make a diagnosis of a panic disorder. This does not mean you can't have a panic disorder and epilepsy at the same time, but the blackouts would have to be in excess of the seizure disorder. You can measure a seizure, you can know a patient's triggers, so in this case you can get an idea of what is in excess of this thing you can measure, but a person's pain or discomfort from a GI condition cannot be objectively put to a scale. You can't tell someone with stomach cancer that they should eat more regardless. But if you remove the stipulation of excess, then it becomes a meaningless catch-all term that will be removed by DSM VI because everyone with a bad flu and a sore throat has Arfid. Or they'll add a scale and variants like severe Arfid, mild Arfid, developmental vs transient Arfid...\n\nThere are situations where it might be applicable. People with diabetes perhaps who go full carnivore/caveman out of fear, but this person isn't going to psychiatrist for their diabetes, and the endocrinologist isn't likely to refer their diabetic patient to a psychiatrist so the psychiatrist can convince them to eat more carbs and sugary snacks...\n\nWhat context are you even talking about??? Who are these patients getting medical and psychiatric diagnoses for the same condition? Honestly, I've only actually seen this with doctor-shoppers who essentially *want* to be diagnosed with an eating disorder and go seek out a psychiatrist on their own while leaving out mention of the GI condition.",
      "created_utc": 1698518004.0,
      "score": 1,
      "context": [
        {
          "id": "hhe5yar",
          "author": "None",
          "body": "this confuses me because my psychiatrist and therapist both think ARFID is the correct diagnosis for me but I don't match up with a lot of what is on the right. I don't think it's good to make generalizations like this, my ARFID is the result of dealing with an undiagnosed health issue that caused nausea for many years. I guess I do kind of cut out certain foods (like pasta and bread) that make the health issue worse but I still eat many different foods. when I grocery shop for myself I tend to buy the same things as snacks everytime and I have a favorite meal at every restaurant around me but for the most part I do eat a variety of foods. I struggle with avoiding food altogether (and food related tasks like shopping or fridge cleaning), so I think this still means what I am dealing with is ARFID",
          "created_utc": 1634754733.0
        },
        {
          "id": "hhfrdou",
          "author": "ZennyDaye",
          "body": "Just casually, I'd like to point out that Arfid shouldn't be diagnosed if the eating disturbance is due to other medical conditions. \n\nIt's actually part of the diagnostic criteria that unless your symptoms have gone severely over what would be expected from your medical condition, then an Arfid diagnosis shouldn't be made. Much as how it shouldn't be diagnosed if the food intake restriction is primarily due to any other reason like poverty, food availability, food allergies, anorexia, bullimia, autism,  culture/tradition...\n\nIt's only been in the DSM as of the last version and your psychiatrist might not be thoroughly familiar with the condition. Many aren't in my experience. ARFID awareness isn't very high even among medical professionals and for many people, it's synonymous to \"picky eating.\"",
          "created_utc": 1634779221.0
        },
        {
          "id": "k6aaa5w",
          "author": "One_Calligrapher_711",
          "body": "ARFID is heterogeneous and it can be short term (due to GI issues among other things) or long term. Just looked it up.\n\nPrior to the DSM 5 it was called something else.",
          "created_utc": 1698172918.0
        }
      ]
    },
    {
      "id": "hhji4nf",
      "author": "None",
      "body": "I don't see a contradiction. I think anyone who is \"just a picky eater\" could benefit from discussions about ARFID. mental health is always on a scale from subclinical symptoms to severe symptoms, wouldn't it be better if we started treating people for ARFID before they get to the point where they are \"sick enough\" for it to be considered ARFID?\n\nbut i'm not about to argue with you, or say anything more in this thread, have a nice day.\n\nedit: to be clear, my point is that people who have been putting up with a mental health issue for a long time seem likely to down play the severity of their situation and a post like this could cause them not to take their own health seriously.",
      "created_utc": 1634851369.0,
      "score": 1,
      "context": [
        {
          "id": "hhi6ls5",
          "author": "eighteencarps",
          "body": "Hot take, I don't care about being called picky. Even if you do consider them different, though, I also don't think it's any more shameful to be a \"picky eater\" than have ARFID. The whole knee-jerk \"we're not picky!\"--what does it matter if we are? No one should feel pressured to eating food they don't want to eat.  \n\n\nEDIT: I'm reading comments and seeing people are mostly using this as a tool to see if their eating is disordered vs non-disordered, which I do think is useful. Sorry for my *own* knee-jerk reaction lol",
          "created_utc": 1634832204.0
        },
        {
          "id": "hhil8gk",
          "author": "None",
          "body": "honestly I had the same reaction as you. I'm not sure that making a big deal about the distinction between picky eating and arfid is helpful. The way I see it all mental health disorders exist on a spectrum, and telling someone who is \"just picky\" that they don't have ARFID may prevent them from examining their eating habits more closely, the same way telling someone who is \"just sad\" that they are not depressed could be harmful. I think people often let mental health issues go unaddressed for quite a while because of this \"not sick enough\" mentality, and this sub is guilty of perpetuating that. this post and others kind of made me realize that and I have now left the sub.",
          "created_utc": 1634838002.0
        },
        {
          "id": "hhj864g",
          "author": "Hot-Journalist1139",
          "body": "You contradict yourself by saying that telling a person they are “just picky” can prevent someone from getting help, but then saying “I’m not sure making a big deal about the distinction is helpful.” You understand exactly why it is helpful. By differentiating the two, parents won’t disregard their children as just being picky and will instead look further to see if their child may have ARFID, and those who have been told all their lives they are just picky may realize their avoidance of food is not “just picky eating.” People with ARFID are not picky eaters, they have a mental disorder, so we should stop using the terms synonymously.",
          "created_utc": 1634847292.0
        }
      ]
    },
    {
      "id": "hhez0yb",
      "author": "applejacklover97",
      "body": "yeah, you definitely don’t need to have all the criteria to be diagnosed! I just wanted to show that the criteria used by physicians and providers does line up with the graphic! it’s ultimately up to the patient and their provider more than any graphic or website.",
      "created_utc": 1634766349.0,
      "score": 5,
      "context": [
        {
          "id": "hheh4v8",
          "author": "jupiterLILY",
          "body": "What is this based on and who wrote it? \n\nThis reads more like someone seeking validation than a diagnostic criteria.",
          "created_utc": 1634759161.0
        },
        {
          "id": "hhexc5b",
          "author": "applejacklover97",
          "body": "[Link to DSM entry for ARFID](https://www.ncbi.nlm.nih.gov/books/NBK519712/table/ch3.t18/)\n\nIt’s not word for word, but many of the things OP’s graphic states are in there, esp refusing food despite health consequences.",
          "created_utc": 1634765633.0
        },
        {
          "id": "hheytrj",
          "author": "None",
          "body": "One thing missing from this graphic, you do NOT need to identify with *all* of the things on the right to have ARFID. \n\nIt's not at all word for word, especially the gagging piece. I've never gagged, but I certainly have ARFID.",
          "created_utc": 1634766263.0
        }
      ]
    },
    {
      "id": "hhf6z0r",
      "author": "Hot-Journalist1139",
      "body": "I could see how the flair could send a different message, so it has been removed.",
      "created_utc": 1634769845.0,
      "score": 8,
      "context": [
        {
          "id": "hheh4v8",
          "author": "jupiterLILY",
          "body": "What is this based on and who wrote it? \n\nThis reads more like someone seeking validation than a diagnostic criteria.",
          "created_utc": 1634759161.0
        },
        {
          "id": "hhf129l",
          "author": "Hot-Journalist1139",
          "body": "Nowhere does this state it’s diagnostic criteria; it’s just a graphic I found showing some differences between picky eating and ARFID because there is a difference. Obviously, there is so much more to ARFID and everyone is different. Those who think they might have ARFID should talk to a professional to get diagnosed.",
          "created_utc": 1634767228.0
        },
        {
          "id": "hhf6025",
          "author": "None",
          "body": "the title along with the \"do I have arfid\" flair send a different message so it could be worth taking the time to be clear next time",
          "created_utc": 1634769418.0
        }
      ]
    },
    {
      "id": "hhgutz8",
      "author": "ZennyDaye",
      "body": "I was in a car last weekend and my driver's reaction to being cut off by another driver was \"These OCD people.\"\n\nAnd I said, \"Huh?\" because I wasn't paying attention and thought he was talking about me.\n\nAnd he points to the car that cut him off and says, \"Driving crazy because they don't want to be late. OCD.\"\n\nJust like that.\n\nWe've come a little way from Hannibal Lector being able to diagnose schizophrenic people because they smell like goats, but not very far.",
      "created_utc": 1634803911.0,
      "score": 3,
      "context": [
        {
          "id": "hhezmom",
          "author": "madamelex",
          "body": "See, when they had that big post on “unpopular opinion” about “picky eaters suck” and a lot of people were acting like that was “discrimination against people with ARFID”… I did not agree. As you can see above there is a difference between picky eating and arfid. To me it’s like the difference between saying “people who act obsessive are jerks” vs “people with OCD are jerks”.  \n\nThank you for making it clear that ARFID is a disorder people suffer from and not a behaviour people choose.",
          "created_utc": 1634766610.0
        },
        {
          "id": "hhfufop",
          "author": "ZennyDaye",
          "body": "I have a friend who has a total of maybe 10 things she doesn't eat, and she's continuously telling me that she \"knows what I'm dealing with\" even as she invites me to restaurants...\n\nI won't say they suck, but they do absolutely nothing to help people take psychiatric disorders seriously when there's one group actually suffering and another large vocal group spreading the message that arfid is not liking mushrooms on pizza, etc.",
          "created_utc": 1634780627.0
        },
        {
          "id": "hhget2c",
          "author": "madamelex",
          "body": "Totally agree. It’s like… everyone is narcissistic once in a while- it doesn’t make them a narcissist. Everyone experiences sadness or depression symptoms at some point but it’s much different than clinical depression. Picky eating does not equal ARFID. ARFID does not equal picky eating.",
          "created_utc": 1634791240.0
        }
      ]
    },
    {
      "id": "jwcqw8v",
      "author": "Souhwhyarewehere-lol",
      "body": "THIS. When realized I had lost frozen pizza, I had a full blown panic attack. It started off as, oh, I like that thing, but I’m not in the mood. And then I’m not in the mood the next day. Or day the day after that. Weeks, months, YEARS go by, and nothing changes. I just can’t stand it anymore.",
      "created_utc": 1692140317.0,
      "score": 2,
      "context": [
        {
          "id": "hhe5jmn",
          "author": "None",
          "body": "Also trying to eat a food you've enjoyed, then vomiting at the smell and never being able to eat it again for no reason at all.",
          "created_utc": 1634754573.0
        },
        {
          "id": "hi7lgje",
          "author": "Usual-Ad-6888",
          "body": "I used to love bagels with cream cheese, ate it for weeks on end. Now the texture makes me so uncomfortable that i gagged trying to make one the last time i tried.",
          "created_utc": 1635310003.0
        },
        {
          "id": "jwcouh8",
          "author": "Souhwhyarewehere-lol",
          "body": "When I was a kid, for about a year straight I only ate fruit and cream cheese and bagels. breakfast lunch and dinner. Now I can’t stand either one of them",
          "created_utc": 1692139494.0
        },
        {
          "id": "jwcp0y5",
          "author": "Usual-Ad-6888",
          "body": "Losing safe foods is so so scary, especially when they're all you eat for a while.",
          "created_utc": 1692139566.0
        }
      ]
    },
    {
      "id": "hhguada",
      "author": "Hot-Journalist1139",
      "body": "Thank you for this and your knowledge about ARFID. I didn’t understand OP claiming this graphic is “too general” because ARFID is literally avoiding/restricting yourself of foods lol. As someone who has struggled with ARFID my entire life, I think this graphic shows ARFID quite well and how it differentiates from picky eating. \n\nThe diagnostic criteria states “the eating disturbance is not attributable to a concurrent medical condition or not better explained by another mental disorder.”  From what OP posted, it does sound like their restrictive food intake was due to another health condition causing nausea.",
      "created_utc": 1634803408.0,
      "score": 2,
      "context": [
        {
          "id": "hhe5yar",
          "author": "None",
          "body": "this confuses me because my psychiatrist and therapist both think ARFID is the correct diagnosis for me but I don't match up with a lot of what is on the right. I don't think it's good to make generalizations like this, my ARFID is the result of dealing with an undiagnosed health issue that caused nausea for many years. I guess I do kind of cut out certain foods (like pasta and bread) that make the health issue worse but I still eat many different foods. when I grocery shop for myself I tend to buy the same things as snacks everytime and I have a favorite meal at every restaurant around me but for the most part I do eat a variety of foods. I struggle with avoiding food altogether (and food related tasks like shopping or fridge cleaning), so I think this still means what I am dealing with is ARFID",
          "created_utc": 1634754733.0
        },
        {
          "id": "hhfrdou",
          "author": "ZennyDaye",
          "body": "Just casually, I'd like to point out that Arfid shouldn't be diagnosed if the eating disturbance is due to other medical conditions. \n\nIt's actually part of the diagnostic criteria that unless your symptoms have gone severely over what would be expected from your medical condition, then an Arfid diagnosis shouldn't be made. Much as how it shouldn't be diagnosed if the food intake restriction is primarily due to any other reason like poverty, food availability, food allergies, anorexia, bullimia, autism,  culture/tradition...\n\nIt's only been in the DSM as of the last version and your psychiatrist might not be thoroughly familiar with the condition. Many aren't in my experience. ARFID awareness isn't very high even among medical professionals and for many people, it's synonymous to \"picky eating.\"",
          "created_utc": 1634779221.0
        },
        {
          "id": "hhfvnty",
          "author": "None",
          "body": "I think my psychiatrist thought that the diagnosis fit given that once I started treatment for the health issue and regained my appetite I still was (am) struggling to eat. it's definitely an eating disorder, and it definitely doesn't fit with anorexia. also ARFID is common with OCD so maybe my reaction to the chronic nausea has to do with me having OCD too. \n\nsorry I don't fit into your understanding of what ARFID is. my psychiatrist is familiar with ARFID I was referred to her specifically because of that.",
          "created_utc": 1634781206.0
        },
        {
          "id": "hhgq73a",
          "author": "ZennyDaye",
          "body": "*My* understandng? Lol, you were the one who posted you had a condition causing your nausea:\n\n&#x200B;\n\n>...my ARFID is the result of dealing with an undiagnosed health issue that caused nausea for many years. I guess I do kind of cut out certain foods (like pasta and bread) that make the health issue worse but I still eat many different foods.\n\nThat was what you said. How did I misunderstand that? Eating **many different foods** doesn't sound contradictory to **avoidant**/**restrictive food intake** to you?  Am I misunderstanding what you mean by *many* or *different* or *food*? \n\n>for the most part I do eat a variety of foods.\n\nThat was what you said. That is counterintuitive to the most basic meaning of 'restricted food intake.' This isn't one of those ambiguous disorders, it's pretty much what it says on the tin. \n\nPart of being diagnosed with ARFID is a diet that's *so* restrictive, a person persistently fails to meet their nutritional/energy needs. We're talking failure to thrive, anemia, weight loss, feeding tubes... Actual suffering. How are you persistently malnourished eating many different foods? A variety of foods as you said. \n\n \n\n>it's definitely an eating disorder, and it definitely doesn't fit with anorexia.\n\nIt's not an either/or thing. ARFID is not a catch-all for people who don't fit with anorexia, bulimia, pica, etc. You can have an eating disorder without having a specific one. If you don't meet a specific criteria, it's just supposed to be an \"unspecified feeding disorder.\" \n\n&#x200B;\n\n>also ARFID is common with OCD so maybe my reaction to the chronic nausea has to do with me having OCD too.\n\nOCD's a common comorbidity but it's still two separate conditions. My fridge is disgusting af right now, but that's not ARFID, that's a low disgust threshold. \n\nHaving a low disgust threshold is common with OCD but being generally disgusted with food isn't ARFID. People with autism have restricted food selection, but it isn't ARFID in and of itself.\n\n&#x200B;\n\n>sorry I don't fit into your understanding of what ARFID is. my psychiatrist is familiar with ARFID I was referred to her specifically because of that.\n\nThis isn't a \"my truth, your truth, my understanding, your understanding\" thing. Do you understand that psychiatric diseases have certain criteria? Much like biological diseases?\n\nObviously, I don't know your business and I'm not telling you not to trust your psychiatrist. You've been worked up and maybe you are persistently malnourished despite eating many different foods. \n\nThey have your details, maybe the undiagnosed health condition causing your chronic nausea for many years was insignificant so it made sense to your psychiatrist to disregard it. Who knows? \n\nI only replied because you seemed genuinely confused by the OP's graphic. My understanding of ARFID is pretty spot on. \n\nYou can be defensive, you can stay confused, but why join an ARFID group and then be like, \"You shouldn't make generalisations about Avoidant/Restrictive Food Intake Disorder causing avoidant/restrictive food intake because I eat a variety of foods and my restricted diet is due to a condition I had that caused chronic nausea and maybe OCD. Forget the international diagnostic standard, trust my understanding instead even though I'm a bit confused as to why you all think ARFID involves having a restricted diet.\"",
          "created_utc": 1634799759.0
        }
      ]
    },
    {
      "id": "hhhv7ag",
      "author": "None",
      "body": ">Actual suffering. How are you persistently malnourished eating many different foods?\n\ndo you hear yourself? screw you lol, it's very rude to tell someone that their diagnosis doesn't fit and that if they *actually* had their diagnosis then they would know *actual suffering*. not that I need to prove to you that I am *actually* suffering, but I assure you, my eating disorder has impacted my physical health and my ability to keep up with my daily life. it has shaped my life choices and the relationships I am able to maintain.\n\nif I am avoiding food altogether that sounds like ARFID. this week I am struggling to eat more than once a day, just to give you an idea of where I am in my recovery. usually what I eat is a variety of foods, but making myself eat anything at all is my problem, my brain will do just about anything to avoid eating but it's less about what i'm eating and more about having to put food in my body at all.\n\n>maybe the undiagnosed health condition causing your chronic nausea for many years was insignificant\n\nThe undiagnosed health condition was POTS btw. the major symptoms I experienced were nausea due to tachycardia and an inability to feel hunger unless I was lying down (because of an improvement in circulation when I lie down). it was not insignificant to me as I was throwing up daily for 7 or so years and only experienced hunger when lying down to go to sleep. as a result, now that I am on a beta blocker that controls these symptoms, I still have a fear of eating, despite the foods that I do manage to eat being a wide variety.\n\nI am defensive that's my bad. I usually appreciate this subreddit because I am able to focus on the common experiences I have with others that have ARFID. but the tone of a lot of posts lately sounds a lot like gatekeeping, I think many people would see this post and interpret it as telling them they don't really have ARFID, and I think that could be very harmful. but you're right that my comment was kind of unnecessary I could have just quietly left the sub, which I will now.  👋",
      "created_utc": 1634827423.0,
      "score": 2,
      "context": [
        {
          "id": "hhe5yar",
          "author": "None",
          "body": "this confuses me because my psychiatrist and therapist both think ARFID is the correct diagnosis for me but I don't match up with a lot of what is on the right. I don't think it's good to make generalizations like this, my ARFID is the result of dealing with an undiagnosed health issue that caused nausea for many years. I guess I do kind of cut out certain foods (like pasta and bread) that make the health issue worse but I still eat many different foods. when I grocery shop for myself I tend to buy the same things as snacks everytime and I have a favorite meal at every restaurant around me but for the most part I do eat a variety of foods. I struggle with avoiding food altogether (and food related tasks like shopping or fridge cleaning), so I think this still means what I am dealing with is ARFID",
          "created_utc": 1634754733.0
        },
        {
          "id": "hhfrdou",
          "author": "ZennyDaye",
          "body": "Just casually, I'd like to point out that Arfid shouldn't be diagnosed if the eating disturbance is due to other medical conditions. \n\nIt's actually part of the diagnostic criteria that unless your symptoms have gone severely over what would be expected from your medical condition, then an Arfid diagnosis shouldn't be made. Much as how it shouldn't be diagnosed if the food intake restriction is primarily due to any other reason like poverty, food availability, food allergies, anorexia, bullimia, autism,  culture/tradition...\n\nIt's only been in the DSM as of the last version and your psychiatrist might not be thoroughly familiar with the condition. Many aren't in my experience. ARFID awareness isn't very high even among medical professionals and for many people, it's synonymous to \"picky eating.\"",
          "created_utc": 1634779221.0
        },
        {
          "id": "hhfvnty",
          "author": "None",
          "body": "I think my psychiatrist thought that the diagnosis fit given that once I started treatment for the health issue and regained my appetite I still was (am) struggling to eat. it's definitely an eating disorder, and it definitely doesn't fit with anorexia. also ARFID is common with OCD so maybe my reaction to the chronic nausea has to do with me having OCD too. \n\nsorry I don't fit into your understanding of what ARFID is. my psychiatrist is familiar with ARFID I was referred to her specifically because of that.",
          "created_utc": 1634781206.0
        },
        {
          "id": "hhgq73a",
          "author": "ZennyDaye",
          "body": "*My* understandng? Lol, you were the one who posted you had a condition causing your nausea:\n\n&#x200B;\n\n>...my ARFID is the result of dealing with an undiagnosed health issue that caused nausea for many years. I guess I do kind of cut out certain foods (like pasta and bread) that make the health issue worse but I still eat many different foods.\n\nThat was what you said. How did I misunderstand that? Eating **many different foods** doesn't sound contradictory to **avoidant**/**restrictive food intake** to you?  Am I misunderstanding what you mean by *many* or *different* or *food*? \n\n>for the most part I do eat a variety of foods.\n\nThat was what you said. That is counterintuitive to the most basic meaning of 'restricted food intake.' This isn't one of those ambiguous disorders, it's pretty much what it says on the tin. \n\nPart of being diagnosed with ARFID is a diet that's *so* restrictive, a person persistently fails to meet their nutritional/energy needs. We're talking failure to thrive, anemia, weight loss, feeding tubes... Actual suffering. How are you persistently malnourished eating many different foods? A variety of foods as you said. \n\n \n\n>it's definitely an eating disorder, and it definitely doesn't fit with anorexia.\n\nIt's not an either/or thing. ARFID is not a catch-all for people who don't fit with anorexia, bulimia, pica, etc. You can have an eating disorder without having a specific one. If you don't meet a specific criteria, it's just supposed to be an \"unspecified feeding disorder.\" \n\n&#x200B;\n\n>also ARFID is common with OCD so maybe my reaction to the chronic nausea has to do with me having OCD too.\n\nOCD's a common comorbidity but it's still two separate conditions. My fridge is disgusting af right now, but that's not ARFID, that's a low disgust threshold. \n\nHaving a low disgust threshold is common with OCD but being generally disgusted with food isn't ARFID. People with autism have restricted food selection, but it isn't ARFID in and of itself.\n\n&#x200B;\n\n>sorry I don't fit into your understanding of what ARFID is. my psychiatrist is familiar with ARFID I was referred to her specifically because of that.\n\nThis isn't a \"my truth, your truth, my understanding, your understanding\" thing. Do you understand that psychiatric diseases have certain criteria? Much like biological diseases?\n\nObviously, I don't know your business and I'm not telling you not to trust your psychiatrist. You've been worked up and maybe you are persistently malnourished despite eating many different foods. \n\nThey have your details, maybe the undiagnosed health condition causing your chronic nausea for many years was insignificant so it made sense to your psychiatrist to disregard it. Who knows? \n\nI only replied because you seemed genuinely confused by the OP's graphic. My understanding of ARFID is pretty spot on. \n\nYou can be defensive, you can stay confused, but why join an ARFID group and then be like, \"You shouldn't make generalisations about Avoidant/Restrictive Food Intake Disorder causing avoidant/restrictive food intake because I eat a variety of foods and my restricted diet is due to a condition I had that caused chronic nausea and maybe OCD. Forget the international diagnostic standard, trust my understanding instead even though I'm a bit confused as to why you all think ARFID involves having a restricted diet.\"",
          "created_utc": 1634799759.0
        }
      ]
    },
    {
      "id": "hhhtmvj",
      "author": "None",
      "body": "I'm not sure I agree with your assertion that the DSM lines up with that chart. \n\nPoint 1,3,4,5 are not mentioned at all. \n\nAnd none of the distinctions, such as moderate vs. extreme in point 6 are mentioned. \n\nAs u/jupiterLILY said, this feels like gatekeeping. Either way, I'm glad the \"Do I have ARFID?\" tag was removed.",
      "created_utc": 1634826741.0,
      "score": 3,
      "context": [
        {
          "id": "hheh4v8",
          "author": "jupiterLILY",
          "body": "What is this based on and who wrote it? \n\nThis reads more like someone seeking validation than a diagnostic criteria.",
          "created_utc": 1634759161.0
        },
        {
          "id": "hhexc5b",
          "author": "applejacklover97",
          "body": "[Link to DSM entry for ARFID](https://www.ncbi.nlm.nih.gov/books/NBK519712/table/ch3.t18/)\n\nIt’s not word for word, but many of the things OP’s graphic states are in there, esp refusing food despite health consequences.",
          "created_utc": 1634765633.0
        },
        {
          "id": "hheytrj",
          "author": "None",
          "body": "One thing missing from this graphic, you do NOT need to identify with *all* of the things on the right to have ARFID. \n\nIt's not at all word for word, especially the gagging piece. I've never gagged, but I certainly have ARFID.",
          "created_utc": 1634766263.0
        },
        {
          "id": "hhez0yb",
          "author": "applejacklover97",
          "body": "yeah, you definitely don’t need to have all the criteria to be diagnosed! I just wanted to show that the criteria used by physicians and providers does line up with the graphic! it’s ultimately up to the patient and their provider more than any graphic or website.",
          "created_utc": 1634766349.0
        }
      ]
    },
    {
      "id": "jwtbvm3",
      "author": "Usual-Ad-6888",
      "body": "This thread inspired me to try bagels again and I DID IT!!!! YAY!!!",
      "created_utc": 1692415640.0,
      "score": 2,
      "context": [
        {
          "id": "hhe5jmn",
          "author": "None",
          "body": "Also trying to eat a food you've enjoyed, then vomiting at the smell and never being able to eat it again for no reason at all.",
          "created_utc": 1634754573.0
        },
        {
          "id": "hi7lgje",
          "author": "Usual-Ad-6888",
          "body": "I used to love bagels with cream cheese, ate it for weeks on end. Now the texture makes me so uncomfortable that i gagged trying to make one the last time i tried.",
          "created_utc": 1635310003.0
        },
        {
          "id": "jwcouh8",
          "author": "Souhwhyarewehere-lol",
          "body": "When I was a kid, for about a year straight I only ate fruit and cream cheese and bagels. breakfast lunch and dinner. Now I can’t stand either one of them",
          "created_utc": 1692139494.0
        },
        {
          "id": "jwcp0y5",
          "author": "Usual-Ad-6888",
          "body": "Losing safe foods is so so scary, especially when they're all you eat for a while.",
          "created_utc": 1692139566.0
        },
        {
          "id": "jwcqw8v",
          "author": "Souhwhyarewehere-lol",
          "body": "THIS. When realized I had lost frozen pizza, I had a full blown panic attack. It started off as, oh, I like that thing, but I’m not in the mood. And then I’m not in the mood the next day. Or day the day after that. Weeks, months, YEARS go by, and nothing changes. I just can’t stand it anymore.",
          "created_utc": 1692140317.0
        }
      ]
    },
    {
      "id": "hhz0kh8",
      "author": "ZennyDaye",
      "body": "All I'm saying is that it's part of the diagnostic process that you need to rule out other medical, surgical or psychiatric conditions causing the food avoidance or restriction before you say a person has ARFID.\n\nPOTS has a lot of gastrointestinal symptoms that would cause you to restrict your diet. It isn't cured by beta blockers, it's just managing your symptoms, so you still have an ongoing concurrent medical condition that explains your food issues.\n\nPeople with diverticulitis, Crohn's, stomach ulcerations, alcoholics with liver failure, gall bladder problems, people who've been on chemo... They all have restrictions to their diet or reasons to avoid food based on their experience with their conditions, and even after they are treated for the condition might continue with the food restriction because after a long enough time a person gets conditioned to associate food with the negative symptoms they experienced. \n\nI just don't get why they'd attribute your food issues to ARFID when there's a clear cut condition that covers it already. I don't see how they'd say you are overreacting to POTS. How do you look past a treated but still ongoing condition?  How can someone decide that your feelings about food is excessive after it went untreated for so long? Seven years of daily vomiting... POTS is pretty easy to diagnose. It's been around since when, the 1930s?\n\nI'm actually confused now. Did they misdiagnose you with panic attacks and anxiety due to the OCD diagnosis instead of carrying out any kind of investigations? It's the POTS diagnosis and beta blocker treatment recent?\n\nIt's entirely your business and your psychiatrist's if they think that your eating behaviour is excessively avoidant, even in the context of having POTS.  They probably have a reason to think so but it's just weird to me, but I don't know so it doesn't matter. I'm just saying. \n\nIt's like hearing someone say they just got off years of chemo or had nine months of the worst morning sickness but their doctor thinks they should have already bounced back to normal eating behaviours because the chronic nausea is in the past and they should be over it, so now they have ARFID. \n\n>I usually appreciate this subreddit because I am able to focus on the common experiences I have with others that have ARFID. but the tone of a lot of posts lately sounds a lot like gatekeeping\n\nThe point of the group I would think is for people to talk about common experiences, but if the tone sounds exclusionary, it's not because people have some agenda to make people feel like they don't belong, it's because there's an internationally recognised criteria that excludes a person from having ARFID. \n\nIt took 12 or 13 years for DSM 5 to come out. Before that, we were just lumped in with 'feeding disorders of infancy' and 'Eating disorders not otherwise specified.' But now that it *has* been specified, people who experience the common symptomology have a place to just share their experiences with others who've been through the same thing.\n\nI mean, if I post about the abuse I had to go through being force-fed repeatedly because paediatricians told my parents they needed to go tough on me or I'd die, can you relate to that? In early school, a nun made me eat under a cross because she thought my not wanting to eat was a clear sign of evil at work. Do you know how awkward catholic school gets when you throw up in the presence of a cross and you have sunken eyes and look like a zombie? \n\nI was in my fifth year in college before ARFID became a diagnosis. And maybe I do sound like an asshole, and I'm not trying to say that everyone's experience with ARFID is some dark tale of horror, but my experience, and the experience many people have with ARFID is a very different experience to having PoTS or a stomach ulcer or being on chemo or anything else.\n\nPeople here can't take a beta blocker to manage the cause of their nausea. We've never been able to point to any condition or lab results and say \"This is why I vomit.\"\n\nSay, if I was looking for data on safe foods for people with ARFID and trying to find the pattern. IDK, maybe someone is building an app for safe food recommendations, and some ARFID people tick off French fries, white bread, pasta, baked meats, whatever... and then people with POTS and peptic ulcers and post-cholecystectomies etc, add in their very different variety of foods, do you see how it becomes meaningless to the people with the standard version of ARFID?\n\nDo you see the point I'm making? I'm not saying you don't have disordered eating, I don't know you, but if I tell you that I can relate to your experience with POTS because I have 30+ years of nausea to the point where I no longer have a sleep-wake cycle because I've been on anti-emetics for decades, and I also have anxiety and OCD and low blood pressure and autonomic dysregulation across the board, that doesn't mean I have PoTS, does it. Because there's a criteria for having PoTs. \n\nIf I go in for a tilt test, etc and don't meet the criteria for PoTS, then I don't have PoTS. But we spend 13 years on a manual for psychiatric conditions and yet everything turns into a subjective \"well, my version of X is this.\"\n\nJust last week, we had dyspraxia awareness week, and the whole thing was flooded about how dyspraxia gives you extra empathy as if we become X-men or something. \"Fantastic dyspraxics.\" \n\nHell, maybe I'm just a frustrated asshole because psychiatry is at the ass end of medicine and anything goes because there's no empirical evidence of anything. But it's supposed to mean something. ARFID is not supposed to be an adjunct, is what I'm saying.\n\nIt's not you, it's just you reminding me of the pseudo-science of it all. Gatekeeping, lol. I'm not the ARFID police. I'm not the DSM police. We live in an age of anxiety songs on tiktok...  The gate has always been wide open for psychiatric conditions. My vet thinks my cat has PTSD. It's whatever at this point.",
      "created_utc": 1635160169.0,
      "score": 1,
      "context": [
        {
          "id": "hhe5yar",
          "author": "None",
          "body": "this confuses me because my psychiatrist and therapist both think ARFID is the correct diagnosis for me but I don't match up with a lot of what is on the right. I don't think it's good to make generalizations like this, my ARFID is the result of dealing with an undiagnosed health issue that caused nausea for many years. I guess I do kind of cut out certain foods (like pasta and bread) that make the health issue worse but I still eat many different foods. when I grocery shop for myself I tend to buy the same things as snacks everytime and I have a favorite meal at every restaurant around me but for the most part I do eat a variety of foods. I struggle with avoiding food altogether (and food related tasks like shopping or fridge cleaning), so I think this still means what I am dealing with is ARFID",
          "created_utc": 1634754733.0
        },
        {
          "id": "hhfrdou",
          "author": "ZennyDaye",
          "body": "Just casually, I'd like to point out that Arfid shouldn't be diagnosed if the eating disturbance is due to other medical conditions. \n\nIt's actually part of the diagnostic criteria that unless your symptoms have gone severely over what would be expected from your medical condition, then an Arfid diagnosis shouldn't be made. Much as how it shouldn't be diagnosed if the food intake restriction is primarily due to any other reason like poverty, food availability, food allergies, anorexia, bullimia, autism,  culture/tradition...\n\nIt's only been in the DSM as of the last version and your psychiatrist might not be thoroughly familiar with the condition. Many aren't in my experience. ARFID awareness isn't very high even among medical professionals and for many people, it's synonymous to \"picky eating.\"",
          "created_utc": 1634779221.0
        },
        {
          "id": "hhfvnty",
          "author": "None",
          "body": "I think my psychiatrist thought that the diagnosis fit given that once I started treatment for the health issue and regained my appetite I still was (am) struggling to eat. it's definitely an eating disorder, and it definitely doesn't fit with anorexia. also ARFID is common with OCD so maybe my reaction to the chronic nausea has to do with me having OCD too. \n\nsorry I don't fit into your understanding of what ARFID is. my psychiatrist is familiar with ARFID I was referred to her specifically because of that.",
          "created_utc": 1634781206.0
        },
        {
          "id": "hhgq73a",
          "author": "ZennyDaye",
          "body": "*My* understandng? Lol, you were the one who posted you had a condition causing your nausea:\n\n&#x200B;\n\n>...my ARFID is the result of dealing with an undiagnosed health issue that caused nausea for many years. I guess I do kind of cut out certain foods (like pasta and bread) that make the health issue worse but I still eat many different foods.\n\nThat was what you said. How did I misunderstand that? Eating **many different foods** doesn't sound contradictory to **avoidant**/**restrictive food intake** to you?  Am I misunderstanding what you mean by *many* or *different* or *food*? \n\n>for the most part I do eat a variety of foods.\n\nThat was what you said. That is counterintuitive to the most basic meaning of 'restricted food intake.' This isn't one of those ambiguous disorders, it's pretty much what it says on the tin. \n\nPart of being diagnosed with ARFID is a diet that's *so* restrictive, a person persistently fails to meet their nutritional/energy needs. We're talking failure to thrive, anemia, weight loss, feeding tubes... Actual suffering. How are you persistently malnourished eating many different foods? A variety of foods as you said. \n\n \n\n>it's definitely an eating disorder, and it definitely doesn't fit with anorexia.\n\nIt's not an either/or thing. ARFID is not a catch-all for people who don't fit with anorexia, bulimia, pica, etc. You can have an eating disorder without having a specific one. If you don't meet a specific criteria, it's just supposed to be an \"unspecified feeding disorder.\" \n\n&#x200B;\n\n>also ARFID is common with OCD so maybe my reaction to the chronic nausea has to do with me having OCD too.\n\nOCD's a common comorbidity but it's still two separate conditions. My fridge is disgusting af right now, but that's not ARFID, that's a low disgust threshold. \n\nHaving a low disgust threshold is common with OCD but being generally disgusted with food isn't ARFID. People with autism have restricted food selection, but it isn't ARFID in and of itself.\n\n&#x200B;\n\n>sorry I don't fit into your understanding of what ARFID is. my psychiatrist is familiar with ARFID I was referred to her specifically because of that.\n\nThis isn't a \"my truth, your truth, my understanding, your understanding\" thing. Do you understand that psychiatric diseases have certain criteria? Much like biological diseases?\n\nObviously, I don't know your business and I'm not telling you not to trust your psychiatrist. You've been worked up and maybe you are persistently malnourished despite eating many different foods. \n\nThey have your details, maybe the undiagnosed health condition causing your chronic nausea for many years was insignificant so it made sense to your psychiatrist to disregard it. Who knows? \n\nI only replied because you seemed genuinely confused by the OP's graphic. My understanding of ARFID is pretty spot on. \n\nYou can be defensive, you can stay confused, but why join an ARFID group and then be like, \"You shouldn't make generalisations about Avoidant/Restrictive Food Intake Disorder causing avoidant/restrictive food intake because I eat a variety of foods and my restricted diet is due to a condition I had that caused chronic nausea and maybe OCD. Forget the international diagnostic standard, trust my understanding instead even though I'm a bit confused as to why you all think ARFID involves having a restricted diet.\"",
          "created_utc": 1634799759.0
        },
        {
          "id": "hhhv7ag",
          "author": "None",
          "body": ">Actual suffering. How are you persistently malnourished eating many different foods?\n\ndo you hear yourself? screw you lol, it's very rude to tell someone that their diagnosis doesn't fit and that if they *actually* had their diagnosis then they would know *actual suffering*. not that I need to prove to you that I am *actually* suffering, but I assure you, my eating disorder has impacted my physical health and my ability to keep up with my daily life. it has shaped my life choices and the relationships I am able to maintain.\n\nif I am avoiding food altogether that sounds like ARFID. this week I am struggling to eat more than once a day, just to give you an idea of where I am in my recovery. usually what I eat is a variety of foods, but making myself eat anything at all is my problem, my brain will do just about anything to avoid eating but it's less about what i'm eating and more about having to put food in my body at all.\n\n>maybe the undiagnosed health condition causing your chronic nausea for many years was insignificant\n\nThe undiagnosed health condition was POTS btw. the major symptoms I experienced were nausea due to tachycardia and an inability to feel hunger unless I was lying down (because of an improvement in circulation when I lie down). it was not insignificant to me as I was throwing up daily for 7 or so years and only experienced hunger when lying down to go to sleep. as a result, now that I am on a beta blocker that controls these symptoms, I still have a fear of eating, despite the foods that I do manage to eat being a wide variety.\n\nI am defensive that's my bad. I usually appreciate this subreddit because I am able to focus on the common experiences I have with others that have ARFID. but the tone of a lot of posts lately sounds a lot like gatekeeping, I think many people would see this post and interpret it as telling them they don't really have ARFID, and I think that could be very harmful. but you're right that my comment was kind of unnecessary I could have just quietly left the sub, which I will now.  👋",
          "created_utc": 1634827423.0
        }
      ]
    },
    {
      "id": "hhhtvd3",
      "author": "applejacklover97",
      "body": "that’s really fine if you disagree. I’m not positing the graphic as a definitive all encompassing source or even that all or most of the info is there in the DSM entry. There’s a reason that one is a scientific document and one is a pop psychology graphic. It is an excellent conversation starter for how disordered eating affects your life for your doctor though. \n\nI wanted to provide a factual source, the DSM, to the commenter which is used for diagnostic criteria alongside the post for extra info *because* the graphic was incomplete and not entirely accurate. That’s all. I’ve turned off notification info for this further lol.",
      "created_utc": 1634826845.0,
      "score": 1,
      "context": [
        {
          "id": "hheh4v8",
          "author": "jupiterLILY",
          "body": "What is this based on and who wrote it? \n\nThis reads more like someone seeking validation than a diagnostic criteria.",
          "created_utc": 1634759161.0
        },
        {
          "id": "hhexc5b",
          "author": "applejacklover97",
          "body": "[Link to DSM entry for ARFID](https://www.ncbi.nlm.nih.gov/books/NBK519712/table/ch3.t18/)\n\nIt’s not word for word, but many of the things OP’s graphic states are in there, esp refusing food despite health consequences.",
          "created_utc": 1634765633.0
        },
        {
          "id": "hheytrj",
          "author": "None",
          "body": "One thing missing from this graphic, you do NOT need to identify with *all* of the things on the right to have ARFID. \n\nIt's not at all word for word, especially the gagging piece. I've never gagged, but I certainly have ARFID.",
          "created_utc": 1634766263.0
        },
        {
          "id": "hhez0yb",
          "author": "applejacklover97",
          "body": "yeah, you definitely don’t need to have all the criteria to be diagnosed! I just wanted to show that the criteria used by physicians and providers does line up with the graphic! it’s ultimately up to the patient and their provider more than any graphic or website.",
          "created_utc": 1634766349.0
        },
        {
          "id": "hhhtmvj",
          "author": "None",
          "body": "I'm not sure I agree with your assertion that the DSM lines up with that chart. \n\nPoint 1,3,4,5 are not mentioned at all. \n\nAnd none of the distinctions, such as moderate vs. extreme in point 6 are mentioned. \n\nAs u/jupiterLILY said, this feels like gatekeeping. Either way, I'm glad the \"Do I have ARFID?\" tag was removed.",
          "created_utc": 1634826741.0
        }
      ]
    },
    {
      "id": "jwv42ax",
      "author": "Souhwhyarewehere-lol",
      "body": "Good job! I’m proud of you ❤️",
      "created_utc": 1692456041.0,
      "score": 2,
      "context": [
        {
          "id": "hhe5jmn",
          "author": "None",
          "body": "Also trying to eat a food you've enjoyed, then vomiting at the smell and never being able to eat it again for no reason at all.",
          "created_utc": 1634754573.0
        },
        {
          "id": "hi7lgje",
          "author": "Usual-Ad-6888",
          "body": "I used to love bagels with cream cheese, ate it for weeks on end. Now the texture makes me so uncomfortable that i gagged trying to make one the last time i tried.",
          "created_utc": 1635310003.0
        },
        {
          "id": "jwcouh8",
          "author": "Souhwhyarewehere-lol",
          "body": "When I was a kid, for about a year straight I only ate fruit and cream cheese and bagels. breakfast lunch and dinner. Now I can’t stand either one of them",
          "created_utc": 1692139494.0
        },
        {
          "id": "jwcp0y5",
          "author": "Usual-Ad-6888",
          "body": "Losing safe foods is so so scary, especially when they're all you eat for a while.",
          "created_utc": 1692139566.0
        },
        {
          "id": "jwcqw8v",
          "author": "Souhwhyarewehere-lol",
          "body": "THIS. When realized I had lost frozen pizza, I had a full blown panic attack. It started off as, oh, I like that thing, but I’m not in the mood. And then I’m not in the mood the next day. Or day the day after that. Weeks, months, YEARS go by, and nothing changes. I just can’t stand it anymore.",
          "created_utc": 1692140317.0
        },
        {
          "id": "jwtbvm3",
          "author": "Usual-Ad-6888",
          "body": "This thread inspired me to try bagels again and I DID IT!!!! YAY!!!",
          "created_utc": 1692415640.0
        }
      ]
    },
    {
      "id": "hi064pz",
      "author": "None",
      "body": ">POTS is pretty easy to diagnose. It's been around since when, the 1930s?\n\nit was nice of you to write so much about this but imma stop reading here. you don't know as much about this as you thi k you do. I will say\n\n>after a long enough time a person gets conditioned to associate food with the negative symptoms they experienced. \n\nwhat you are describing is still a mental health issue centered around avoiding food, that is why I was diagnosed with ARFID. my ARFID diagnosis also came 2 years before my POTS diagnosis, again because getting diagnosed with POTS was difficult. My tilt table test was negative, but then during an EKG my heart rate stayed at 120 the whole time and they decided I needed a beta blocker. Once on the beta blocker my POTS symptoms improved dramatically and my cardiologist does think it is POTS despite the negative tilt test. I'll also say\n\n>maybe I'm just a frustrated asshole\n\nyeah, you are.",
      "created_utc": 1635180575.0,
      "score": 2,
      "context": [
        {
          "id": "hhe5yar",
          "author": "None",
          "body": "this confuses me because my psychiatrist and therapist both think ARFID is the correct diagnosis for me but I don't match up with a lot of what is on the right. I don't think it's good to make generalizations like this, my ARFID is the result of dealing with an undiagnosed health issue that caused nausea for many years. I guess I do kind of cut out certain foods (like pasta and bread) that make the health issue worse but I still eat many different foods. when I grocery shop for myself I tend to buy the same things as snacks everytime and I have a favorite meal at every restaurant around me but for the most part I do eat a variety of foods. I struggle with avoiding food altogether (and food related tasks like shopping or fridge cleaning), so I think this still means what I am dealing with is ARFID",
          "created_utc": 1634754733.0
        },
        {
          "id": "hhfrdou",
          "author": "ZennyDaye",
          "body": "Just casually, I'd like to point out that Arfid shouldn't be diagnosed if the eating disturbance is due to other medical conditions. \n\nIt's actually part of the diagnostic criteria that unless your symptoms have gone severely over what would be expected from your medical condition, then an Arfid diagnosis shouldn't be made. Much as how it shouldn't be diagnosed if the food intake restriction is primarily due to any other reason like poverty, food availability, food allergies, anorexia, bullimia, autism,  culture/tradition...\n\nIt's only been in the DSM as of the last version and your psychiatrist might not be thoroughly familiar with the condition. Many aren't in my experience. ARFID awareness isn't very high even among medical professionals and for many people, it's synonymous to \"picky eating.\"",
          "created_utc": 1634779221.0
        },
        {
          "id": "hhfvnty",
          "author": "None",
          "body": "I think my psychiatrist thought that the diagnosis fit given that once I started treatment for the health issue and regained my appetite I still was (am) struggling to eat. it's definitely an eating disorder, and it definitely doesn't fit with anorexia. also ARFID is common with OCD so maybe my reaction to the chronic nausea has to do with me having OCD too. \n\nsorry I don't fit into your understanding of what ARFID is. my psychiatrist is familiar with ARFID I was referred to her specifically because of that.",
          "created_utc": 1634781206.0
        },
        {
          "id": "hhgq73a",
          "author": "ZennyDaye",
          "body": "*My* understandng? Lol, you were the one who posted you had a condition causing your nausea:\n\n&#x200B;\n\n>...my ARFID is the result of dealing with an undiagnosed health issue that caused nausea for many years. I guess I do kind of cut out certain foods (like pasta and bread) that make the health issue worse but I still eat many different foods.\n\nThat was what you said. How did I misunderstand that? Eating **many different foods** doesn't sound contradictory to **avoidant**/**restrictive food intake** to you?  Am I misunderstanding what you mean by *many* or *different* or *food*? \n\n>for the most part I do eat a variety of foods.\n\nThat was what you said. That is counterintuitive to the most basic meaning of 'restricted food intake.' This isn't one of those ambiguous disorders, it's pretty much what it says on the tin. \n\nPart of being diagnosed with ARFID is a diet that's *so* restrictive, a person persistently fails to meet their nutritional/energy needs. We're talking failure to thrive, anemia, weight loss, feeding tubes... Actual suffering. How are you persistently malnourished eating many different foods? A variety of foods as you said. \n\n \n\n>it's definitely an eating disorder, and it definitely doesn't fit with anorexia.\n\nIt's not an either/or thing. ARFID is not a catch-all for people who don't fit with anorexia, bulimia, pica, etc. You can have an eating disorder without having a specific one. If you don't meet a specific criteria, it's just supposed to be an \"unspecified feeding disorder.\" \n\n&#x200B;\n\n>also ARFID is common with OCD so maybe my reaction to the chronic nausea has to do with me having OCD too.\n\nOCD's a common comorbidity but it's still two separate conditions. My fridge is disgusting af right now, but that's not ARFID, that's a low disgust threshold. \n\nHaving a low disgust threshold is common with OCD but being generally disgusted with food isn't ARFID. People with autism have restricted food selection, but it isn't ARFID in and of itself.\n\n&#x200B;\n\n>sorry I don't fit into your understanding of what ARFID is. my psychiatrist is familiar with ARFID I was referred to her specifically because of that.\n\nThis isn't a \"my truth, your truth, my understanding, your understanding\" thing. Do you understand that psychiatric diseases have certain criteria? Much like biological diseases?\n\nObviously, I don't know your business and I'm not telling you not to trust your psychiatrist. You've been worked up and maybe you are persistently malnourished despite eating many different foods. \n\nThey have your details, maybe the undiagnosed health condition causing your chronic nausea for many years was insignificant so it made sense to your psychiatrist to disregard it. Who knows? \n\nI only replied because you seemed genuinely confused by the OP's graphic. My understanding of ARFID is pretty spot on. \n\nYou can be defensive, you can stay confused, but why join an ARFID group and then be like, \"You shouldn't make generalisations about Avoidant/Restrictive Food Intake Disorder causing avoidant/restrictive food intake because I eat a variety of foods and my restricted diet is due to a condition I had that caused chronic nausea and maybe OCD. Forget the international diagnostic standard, trust my understanding instead even though I'm a bit confused as to why you all think ARFID involves having a restricted diet.\"",
          "created_utc": 1634799759.0
        },
        {
          "id": "hhhv7ag",
          "author": "None",
          "body": ">Actual suffering. How are you persistently malnourished eating many different foods?\n\ndo you hear yourself? screw you lol, it's very rude to tell someone that their diagnosis doesn't fit and that if they *actually* had their diagnosis then they would know *actual suffering*. not that I need to prove to you that I am *actually* suffering, but I assure you, my eating disorder has impacted my physical health and my ability to keep up with my daily life. it has shaped my life choices and the relationships I am able to maintain.\n\nif I am avoiding food altogether that sounds like ARFID. this week I am struggling to eat more than once a day, just to give you an idea of where I am in my recovery. usually what I eat is a variety of foods, but making myself eat anything at all is my problem, my brain will do just about anything to avoid eating but it's less about what i'm eating and more about having to put food in my body at all.\n\n>maybe the undiagnosed health condition causing your chronic nausea for many years was insignificant\n\nThe undiagnosed health condition was POTS btw. the major symptoms I experienced were nausea due to tachycardia and an inability to feel hunger unless I was lying down (because of an improvement in circulation when I lie down). it was not insignificant to me as I was throwing up daily for 7 or so years and only experienced hunger when lying down to go to sleep. as a result, now that I am on a beta blocker that controls these symptoms, I still have a fear of eating, despite the foods that I do manage to eat being a wide variety.\n\nI am defensive that's my bad. I usually appreciate this subreddit because I am able to focus on the common experiences I have with others that have ARFID. but the tone of a lot of posts lately sounds a lot like gatekeeping, I think many people would see this post and interpret it as telling them they don't really have ARFID, and I think that could be very harmful. but you're right that my comment was kind of unnecessary I could have just quietly left the sub, which I will now.  👋",
          "created_utc": 1634827423.0
        },
        {
          "id": "hhz0kh8",
          "author": "ZennyDaye",
          "body": "All I'm saying is that it's part of the diagnostic process that you need to rule out other medical, surgical or psychiatric conditions causing the food avoidance or restriction before you say a person has ARFID.\n\nPOTS has a lot of gastrointestinal symptoms that would cause you to restrict your diet. It isn't cured by beta blockers, it's just managing your symptoms, so you still have an ongoing concurrent medical condition that explains your food issues.\n\nPeople with diverticulitis, Crohn's, stomach ulcerations, alcoholics with liver failure, gall bladder problems, people who've been on chemo... They all have restrictions to their diet or reasons to avoid food based on their experience with their conditions, and even after they are treated for the condition might continue with the food restriction because after a long enough time a person gets conditioned to associate food with the negative symptoms they experienced. \n\nI just don't get why they'd attribute your food issues to ARFID when there's a clear cut condition that covers it already. I don't see how they'd say you are overreacting to POTS. How do you look past a treated but still ongoing condition?  How can someone decide that your feelings about food is excessive after it went untreated for so long? Seven years of daily vomiting... POTS is pretty easy to diagnose. It's been around since when, the 1930s?\n\nI'm actually confused now. Did they misdiagnose you with panic attacks and anxiety due to the OCD diagnosis instead of carrying out any kind of investigations? It's the POTS diagnosis and beta blocker treatment recent?\n\nIt's entirely your business and your psychiatrist's if they think that your eating behaviour is excessively avoidant, even in the context of having POTS.  They probably have a reason to think so but it's just weird to me, but I don't know so it doesn't matter. I'm just saying. \n\nIt's like hearing someone say they just got off years of chemo or had nine months of the worst morning sickness but their doctor thinks they should have already bounced back to normal eating behaviours because the chronic nausea is in the past and they should be over it, so now they have ARFID. \n\n>I usually appreciate this subreddit because I am able to focus on the common experiences I have with others that have ARFID. but the tone of a lot of posts lately sounds a lot like gatekeeping\n\nThe point of the group I would think is for people to talk about common experiences, but if the tone sounds exclusionary, it's not because people have some agenda to make people feel like they don't belong, it's because there's an internationally recognised criteria that excludes a person from having ARFID. \n\nIt took 12 or 13 years for DSM 5 to come out. Before that, we were just lumped in with 'feeding disorders of infancy' and 'Eating disorders not otherwise specified.' But now that it *has* been specified, people who experience the common symptomology have a place to just share their experiences with others who've been through the same thing.\n\nI mean, if I post about the abuse I had to go through being force-fed repeatedly because paediatricians told my parents they needed to go tough on me or I'd die, can you relate to that? In early school, a nun made me eat under a cross because she thought my not wanting to eat was a clear sign of evil at work. Do you know how awkward catholic school gets when you throw up in the presence of a cross and you have sunken eyes and look like a zombie? \n\nI was in my fifth year in college before ARFID became a diagnosis. And maybe I do sound like an asshole, and I'm not trying to say that everyone's experience with ARFID is some dark tale of horror, but my experience, and the experience many people have with ARFID is a very different experience to having PoTS or a stomach ulcer or being on chemo or anything else.\n\nPeople here can't take a beta blocker to manage the cause of their nausea. We've never been able to point to any condition or lab results and say \"This is why I vomit.\"\n\nSay, if I was looking for data on safe foods for people with ARFID and trying to find the pattern. IDK, maybe someone is building an app for safe food recommendations, and some ARFID people tick off French fries, white bread, pasta, baked meats, whatever... and then people with POTS and peptic ulcers and post-cholecystectomies etc, add in their very different variety of foods, do you see how it becomes meaningless to the people with the standard version of ARFID?\n\nDo you see the point I'm making? I'm not saying you don't have disordered eating, I don't know you, but if I tell you that I can relate to your experience with POTS because I have 30+ years of nausea to the point where I no longer have a sleep-wake cycle because I've been on anti-emetics for decades, and I also have anxiety and OCD and low blood pressure and autonomic dysregulation across the board, that doesn't mean I have PoTS, does it. Because there's a criteria for having PoTs. \n\nIf I go in for a tilt test, etc and don't meet the criteria for PoTS, then I don't have PoTS. But we spend 13 years on a manual for psychiatric conditions and yet everything turns into a subjective \"well, my version of X is this.\"\n\nJust last week, we had dyspraxia awareness week, and the whole thing was flooded about how dyspraxia gives you extra empathy as if we become X-men or something. \"Fantastic dyspraxics.\" \n\nHell, maybe I'm just a frustrated asshole because psychiatry is at the ass end of medicine and anything goes because there's no empirical evidence of anything. But it's supposed to mean something. ARFID is not supposed to be an adjunct, is what I'm saying.\n\nIt's not you, it's just you reminding me of the pseudo-science of it all. Gatekeeping, lol. I'm not the ARFID police. I'm not the DSM police. We live in an age of anxiety songs on tiktok...  The gate has always been wide open for psychiatric conditions. My vet thinks my cat has PTSD. It's whatever at this point.",
          "created_utc": 1635160169.0
        }
      ]
    },
    {
      "id": "hi3m5b7",
      "author": "ZennyDaye",
      "body": ">my ARFID diagnosis also came 2 years **before** my POTS diagnosis\n\nJesus Christ. \n\nI specifically asked you how they got to ARFID if you have a medical condition that causes your nausea and all you had to say was that you weren't diagnosed with POTS at the point in time when the ARFID diagnosis was made for whatever reason.\n\nI just found it bizarre that a psychiatrist would add ARFID on to PoTS as some sort of adjunctive diagnosis and all you had to say was that your psychiatrist didn't rule out other medical conditions first. Lots of them don't.  Why was that so hard to say? \n\nWhy all the quibbling and accusations about gatekeeping and attacking the OP and other people in the sub for being exclusionary when you damn well know that your psychiatrist didn't take POTS into consideration when he diagnosed you with ARFID because **you weren't diagnosed with POTS as yet**? \n\n&#x200B;\n\n>maybe I'm just a frustrated asshole\n\nI take that back. Frustrated, yes. Asshole, no. You deliberately made it seem as though your psychiatrist knew you had POTS at the point in time when he diagnosed you with ARFID. \n\nYou join a group and complain to people with ARFID that their posts about ARFID don't include your experience with PoTS, and I tell you that if POTS is causing your symptoms, then that excludes ARFID by the definition of ARFID, and you say that your psychiatrist thinks you have ARFID *in spite of* POTS, and then the story changes so now your ARFID was diagnosed *without* the knowledge of your POTS...  \n\nGatekeeping. Lol. It's literally in the group rules that any form of disordered eating is allowed, but it's also in the rules that it's supposed to be a safe place so maybe don't go on about fixing your nausea with beta blockers in a group for people who don't have that option because their symptoms aren't caused by a medical condition that they can be treated for? Maybe don't just throw out your uncanny ability to eat a bunch of foods in a group where people have a handful of foods they rotate. \n\nAnd then, worse, accusing people with ARFID of being gatekeepers because they're not including the Caused-By-POTS variant of the disease in their posts? \n\nOf course, you're not going to be able to relate, and you very well know why you can't relate but you're going to pretend to be confused and then get defensive and accuse people of not understanding a condition they've had all their lives because they have some kind of mean agenda to exclude you... \n\nThanks for finally telling me the truth though, (I'm just assuming there's no more to this). The bizarreness of your earlier story had me genuinely confused for so long, I was actually starting to wonder if your therapist was working with some kind of DSM 6 Pro Plus Ultra edition where they dropped the part about excluding medical conditions.\n\nAll you had to say was that they didn't know. That was it. Riddle solved.",
      "created_utc": 1635246283.0,
      "score": 1,
      "context": [
        {
          "id": "hhe5yar",
          "author": "None",
          "body": "this confuses me because my psychiatrist and therapist both think ARFID is the correct diagnosis for me but I don't match up with a lot of what is on the right. I don't think it's good to make generalizations like this, my ARFID is the result of dealing with an undiagnosed health issue that caused nausea for many years. I guess I do kind of cut out certain foods (like pasta and bread) that make the health issue worse but I still eat many different foods. when I grocery shop for myself I tend to buy the same things as snacks everytime and I have a favorite meal at every restaurant around me but for the most part I do eat a variety of foods. I struggle with avoiding food altogether (and food related tasks like shopping or fridge cleaning), so I think this still means what I am dealing with is ARFID",
          "created_utc": 1634754733.0
        },
        {
          "id": "hhfrdou",
          "author": "ZennyDaye",
          "body": "Just casually, I'd like to point out that Arfid shouldn't be diagnosed if the eating disturbance is due to other medical conditions. \n\nIt's actually part of the diagnostic criteria that unless your symptoms have gone severely over what would be expected from your medical condition, then an Arfid diagnosis shouldn't be made. Much as how it shouldn't be diagnosed if the food intake restriction is primarily due to any other reason like poverty, food availability, food allergies, anorexia, bullimia, autism,  culture/tradition...\n\nIt's only been in the DSM as of the last version and your psychiatrist might not be thoroughly familiar with the condition. Many aren't in my experience. ARFID awareness isn't very high even among medical professionals and for many people, it's synonymous to \"picky eating.\"",
          "created_utc": 1634779221.0
        },
        {
          "id": "hhfvnty",
          "author": "None",
          "body": "I think my psychiatrist thought that the diagnosis fit given that once I started treatment for the health issue and regained my appetite I still was (am) struggling to eat. it's definitely an eating disorder, and it definitely doesn't fit with anorexia. also ARFID is common with OCD so maybe my reaction to the chronic nausea has to do with me having OCD too. \n\nsorry I don't fit into your understanding of what ARFID is. my psychiatrist is familiar with ARFID I was referred to her specifically because of that.",
          "created_utc": 1634781206.0
        },
        {
          "id": "hhgq73a",
          "author": "ZennyDaye",
          "body": "*My* understandng? Lol, you were the one who posted you had a condition causing your nausea:\n\n&#x200B;\n\n>...my ARFID is the result of dealing with an undiagnosed health issue that caused nausea for many years. I guess I do kind of cut out certain foods (like pasta and bread) that make the health issue worse but I still eat many different foods.\n\nThat was what you said. How did I misunderstand that? Eating **many different foods** doesn't sound contradictory to **avoidant**/**restrictive food intake** to you?  Am I misunderstanding what you mean by *many* or *different* or *food*? \n\n>for the most part I do eat a variety of foods.\n\nThat was what you said. That is counterintuitive to the most basic meaning of 'restricted food intake.' This isn't one of those ambiguous disorders, it's pretty much what it says on the tin. \n\nPart of being diagnosed with ARFID is a diet that's *so* restrictive, a person persistently fails to meet their nutritional/energy needs. We're talking failure to thrive, anemia, weight loss, feeding tubes... Actual suffering. How are you persistently malnourished eating many different foods? A variety of foods as you said. \n\n \n\n>it's definitely an eating disorder, and it definitely doesn't fit with anorexia.\n\nIt's not an either/or thing. ARFID is not a catch-all for people who don't fit with anorexia, bulimia, pica, etc. You can have an eating disorder without having a specific one. If you don't meet a specific criteria, it's just supposed to be an \"unspecified feeding disorder.\" \n\n&#x200B;\n\n>also ARFID is common with OCD so maybe my reaction to the chronic nausea has to do with me having OCD too.\n\nOCD's a common comorbidity but it's still two separate conditions. My fridge is disgusting af right now, but that's not ARFID, that's a low disgust threshold. \n\nHaving a low disgust threshold is common with OCD but being generally disgusted with food isn't ARFID. People with autism have restricted food selection, but it isn't ARFID in and of itself.\n\n&#x200B;\n\n>sorry I don't fit into your understanding of what ARFID is. my psychiatrist is familiar with ARFID I was referred to her specifically because of that.\n\nThis isn't a \"my truth, your truth, my understanding, your understanding\" thing. Do you understand that psychiatric diseases have certain criteria? Much like biological diseases?\n\nObviously, I don't know your business and I'm not telling you not to trust your psychiatrist. You've been worked up and maybe you are persistently malnourished despite eating many different foods. \n\nThey have your details, maybe the undiagnosed health condition causing your chronic nausea for many years was insignificant so it made sense to your psychiatrist to disregard it. Who knows? \n\nI only replied because you seemed genuinely confused by the OP's graphic. My understanding of ARFID is pretty spot on. \n\nYou can be defensive, you can stay confused, but why join an ARFID group and then be like, \"You shouldn't make generalisations about Avoidant/Restrictive Food Intake Disorder causing avoidant/restrictive food intake because I eat a variety of foods and my restricted diet is due to a condition I had that caused chronic nausea and maybe OCD. Forget the international diagnostic standard, trust my understanding instead even though I'm a bit confused as to why you all think ARFID involves having a restricted diet.\"",
          "created_utc": 1634799759.0
        },
        {
          "id": "hhhv7ag",
          "author": "None",
          "body": ">Actual suffering. How are you persistently malnourished eating many different foods?\n\ndo you hear yourself? screw you lol, it's very rude to tell someone that their diagnosis doesn't fit and that if they *actually* had their diagnosis then they would know *actual suffering*. not that I need to prove to you that I am *actually* suffering, but I assure you, my eating disorder has impacted my physical health and my ability to keep up with my daily life. it has shaped my life choices and the relationships I am able to maintain.\n\nif I am avoiding food altogether that sounds like ARFID. this week I am struggling to eat more than once a day, just to give you an idea of where I am in my recovery. usually what I eat is a variety of foods, but making myself eat anything at all is my problem, my brain will do just about anything to avoid eating but it's less about what i'm eating and more about having to put food in my body at all.\n\n>maybe the undiagnosed health condition causing your chronic nausea for many years was insignificant\n\nThe undiagnosed health condition was POTS btw. the major symptoms I experienced were nausea due to tachycardia and an inability to feel hunger unless I was lying down (because of an improvement in circulation when I lie down). it was not insignificant to me as I was throwing up daily for 7 or so years and only experienced hunger when lying down to go to sleep. as a result, now that I am on a beta blocker that controls these symptoms, I still have a fear of eating, despite the foods that I do manage to eat being a wide variety.\n\nI am defensive that's my bad. I usually appreciate this subreddit because I am able to focus on the common experiences I have with others that have ARFID. but the tone of a lot of posts lately sounds a lot like gatekeeping, I think many people would see this post and interpret it as telling them they don't really have ARFID, and I think that could be very harmful. but you're right that my comment was kind of unnecessary I could have just quietly left the sub, which I will now.  👋",
          "created_utc": 1634827423.0
        },
        {
          "id": "hhz0kh8",
          "author": "ZennyDaye",
          "body": "All I'm saying is that it's part of the diagnostic process that you need to rule out other medical, surgical or psychiatric conditions causing the food avoidance or restriction before you say a person has ARFID.\n\nPOTS has a lot of gastrointestinal symptoms that would cause you to restrict your diet. It isn't cured by beta blockers, it's just managing your symptoms, so you still have an ongoing concurrent medical condition that explains your food issues.\n\nPeople with diverticulitis, Crohn's, stomach ulcerations, alcoholics with liver failure, gall bladder problems, people who've been on chemo... They all have restrictions to their diet or reasons to avoid food based on their experience with their conditions, and even after they are treated for the condition might continue with the food restriction because after a long enough time a person gets conditioned to associate food with the negative symptoms they experienced. \n\nI just don't get why they'd attribute your food issues to ARFID when there's a clear cut condition that covers it already. I don't see how they'd say you are overreacting to POTS. How do you look past a treated but still ongoing condition?  How can someone decide that your feelings about food is excessive after it went untreated for so long? Seven years of daily vomiting... POTS is pretty easy to diagnose. It's been around since when, the 1930s?\n\nI'm actually confused now. Did they misdiagnose you with panic attacks and anxiety due to the OCD diagnosis instead of carrying out any kind of investigations? It's the POTS diagnosis and beta blocker treatment recent?\n\nIt's entirely your business and your psychiatrist's if they think that your eating behaviour is excessively avoidant, even in the context of having POTS.  They probably have a reason to think so but it's just weird to me, but I don't know so it doesn't matter. I'm just saying. \n\nIt's like hearing someone say they just got off years of chemo or had nine months of the worst morning sickness but their doctor thinks they should have already bounced back to normal eating behaviours because the chronic nausea is in the past and they should be over it, so now they have ARFID. \n\n>I usually appreciate this subreddit because I am able to focus on the common experiences I have with others that have ARFID. but the tone of a lot of posts lately sounds a lot like gatekeeping\n\nThe point of the group I would think is for people to talk about common experiences, but if the tone sounds exclusionary, it's not because people have some agenda to make people feel like they don't belong, it's because there's an internationally recognised criteria that excludes a person from having ARFID. \n\nIt took 12 or 13 years for DSM 5 to come out. Before that, we were just lumped in with 'feeding disorders of infancy' and 'Eating disorders not otherwise specified.' But now that it *has* been specified, people who experience the common symptomology have a place to just share their experiences with others who've been through the same thing.\n\nI mean, if I post about the abuse I had to go through being force-fed repeatedly because paediatricians told my parents they needed to go tough on me or I'd die, can you relate to that? In early school, a nun made me eat under a cross because she thought my not wanting to eat was a clear sign of evil at work. Do you know how awkward catholic school gets when you throw up in the presence of a cross and you have sunken eyes and look like a zombie? \n\nI was in my fifth year in college before ARFID became a diagnosis. And maybe I do sound like an asshole, and I'm not trying to say that everyone's experience with ARFID is some dark tale of horror, but my experience, and the experience many people have with ARFID is a very different experience to having PoTS or a stomach ulcer or being on chemo or anything else.\n\nPeople here can't take a beta blocker to manage the cause of their nausea. We've never been able to point to any condition or lab results and say \"This is why I vomit.\"\n\nSay, if I was looking for data on safe foods for people with ARFID and trying to find the pattern. IDK, maybe someone is building an app for safe food recommendations, and some ARFID people tick off French fries, white bread, pasta, baked meats, whatever... and then people with POTS and peptic ulcers and post-cholecystectomies etc, add in their very different variety of foods, do you see how it becomes meaningless to the people with the standard version of ARFID?\n\nDo you see the point I'm making? I'm not saying you don't have disordered eating, I don't know you, but if I tell you that I can relate to your experience with POTS because I have 30+ years of nausea to the point where I no longer have a sleep-wake cycle because I've been on anti-emetics for decades, and I also have anxiety and OCD and low blood pressure and autonomic dysregulation across the board, that doesn't mean I have PoTS, does it. Because there's a criteria for having PoTs. \n\nIf I go in for a tilt test, etc and don't meet the criteria for PoTS, then I don't have PoTS. But we spend 13 years on a manual for psychiatric conditions and yet everything turns into a subjective \"well, my version of X is this.\"\n\nJust last week, we had dyspraxia awareness week, and the whole thing was flooded about how dyspraxia gives you extra empathy as if we become X-men or something. \"Fantastic dyspraxics.\" \n\nHell, maybe I'm just a frustrated asshole because psychiatry is at the ass end of medicine and anything goes because there's no empirical evidence of anything. But it's supposed to mean something. ARFID is not supposed to be an adjunct, is what I'm saying.\n\nIt's not you, it's just you reminding me of the pseudo-science of it all. Gatekeeping, lol. I'm not the ARFID police. I'm not the DSM police. We live in an age of anxiety songs on tiktok...  The gate has always been wide open for psychiatric conditions. My vet thinks my cat has PTSD. It's whatever at this point.",
          "created_utc": 1635160169.0
        },
        {
          "id": "hi064pz",
          "author": "None",
          "body": ">POTS is pretty easy to diagnose. It's been around since when, the 1930s?\n\nit was nice of you to write so much about this but imma stop reading here. you don't know as much about this as you thi k you do. I will say\n\n>after a long enough time a person gets conditioned to associate food with the negative symptoms they experienced. \n\nwhat you are describing is still a mental health issue centered around avoiding food, that is why I was diagnosed with ARFID. my ARFID diagnosis also came 2 years before my POTS diagnosis, again because getting diagnosed with POTS was difficult. My tilt table test was negative, but then during an EKG my heart rate stayed at 120 the whole time and they decided I needed a beta blocker. Once on the beta blocker my POTS symptoms improved dramatically and my cardiologist does think it is POTS despite the negative tilt test. I'll also say\n\n>maybe I'm just a frustrated asshole\n\nyeah, you are.",
          "created_utc": 1635180575.0
        }
      ]
    },
    {
      "id": "hi44a8q",
      "author": "None",
      "body": "1. I have continued to see a psychiatrist since being diagnosed with POTS, my psychiatrist still thinks ARFID fits and ARFID treatment is the most helpful for me\n\n2. you never asked when I was diagnosed with what you just started telling me that my psychiatrist was wrong, I wasn't deliberately withholding information from you, and you were definitely being an asshole\n\n3. I think you'll find I'm not the only one with an ARFID diagnosis that struggles with eating enough but does not struggle with always eating the same foods. that is not a requirement for having ARFID and I thought that posting this image with the flair do I have ARFID was very misleading. I wasn't attacking anyone or complaining that my POTS experience was not included in the sub, I was pointing out that the way this was presented could be very unhelpful for people still wondering if they have ARFID. you were the one to come at me pretending you know more than medical professionals and making assumptions about my experience. and now for some reason you're yelling at me because those assumptions turned out wrong? leave me alone lol, I already left the sub",
      "created_utc": 1635256267.0,
      "score": 2,
      "context": [
        {
          "id": "hhe5yar",
          "author": "None",
          "body": "this confuses me because my psychiatrist and therapist both think ARFID is the correct diagnosis for me but I don't match up with a lot of what is on the right. I don't think it's good to make generalizations like this, my ARFID is the result of dealing with an undiagnosed health issue that caused nausea for many years. I guess I do kind of cut out certain foods (like pasta and bread) that make the health issue worse but I still eat many different foods. when I grocery shop for myself I tend to buy the same things as snacks everytime and I have a favorite meal at every restaurant around me but for the most part I do eat a variety of foods. I struggle with avoiding food altogether (and food related tasks like shopping or fridge cleaning), so I think this still means what I am dealing with is ARFID",
          "created_utc": 1634754733.0
        },
        {
          "id": "hhfrdou",
          "author": "ZennyDaye",
          "body": "Just casually, I'd like to point out that Arfid shouldn't be diagnosed if the eating disturbance is due to other medical conditions. \n\nIt's actually part of the diagnostic criteria that unless your symptoms have gone severely over what would be expected from your medical condition, then an Arfid diagnosis shouldn't be made. Much as how it shouldn't be diagnosed if the food intake restriction is primarily due to any other reason like poverty, food availability, food allergies, anorexia, bullimia, autism,  culture/tradition...\n\nIt's only been in the DSM as of the last version and your psychiatrist might not be thoroughly familiar with the condition. Many aren't in my experience. ARFID awareness isn't very high even among medical professionals and for many people, it's synonymous to \"picky eating.\"",
          "created_utc": 1634779221.0
        },
        {
          "id": "hhfvnty",
          "author": "None",
          "body": "I think my psychiatrist thought that the diagnosis fit given that once I started treatment for the health issue and regained my appetite I still was (am) struggling to eat. it's definitely an eating disorder, and it definitely doesn't fit with anorexia. also ARFID is common with OCD so maybe my reaction to the chronic nausea has to do with me having OCD too. \n\nsorry I don't fit into your understanding of what ARFID is. my psychiatrist is familiar with ARFID I was referred to her specifically because of that.",
          "created_utc": 1634781206.0
        },
        {
          "id": "hhgq73a",
          "author": "ZennyDaye",
          "body": "*My* understandng? Lol, you were the one who posted you had a condition causing your nausea:\n\n&#x200B;\n\n>...my ARFID is the result of dealing with an undiagnosed health issue that caused nausea for many years. I guess I do kind of cut out certain foods (like pasta and bread) that make the health issue worse but I still eat many different foods.\n\nThat was what you said. How did I misunderstand that? Eating **many different foods** doesn't sound contradictory to **avoidant**/**restrictive food intake** to you?  Am I misunderstanding what you mean by *many* or *different* or *food*? \n\n>for the most part I do eat a variety of foods.\n\nThat was what you said. That is counterintuitive to the most basic meaning of 'restricted food intake.' This isn't one of those ambiguous disorders, it's pretty much what it says on the tin. \n\nPart of being diagnosed with ARFID is a diet that's *so* restrictive, a person persistently fails to meet their nutritional/energy needs. We're talking failure to thrive, anemia, weight loss, feeding tubes... Actual suffering. How are you persistently malnourished eating many different foods? A variety of foods as you said. \n\n \n\n>it's definitely an eating disorder, and it definitely doesn't fit with anorexia.\n\nIt's not an either/or thing. ARFID is not a catch-all for people who don't fit with anorexia, bulimia, pica, etc. You can have an eating disorder without having a specific one. If you don't meet a specific criteria, it's just supposed to be an \"unspecified feeding disorder.\" \n\n&#x200B;\n\n>also ARFID is common with OCD so maybe my reaction to the chronic nausea has to do with me having OCD too.\n\nOCD's a common comorbidity but it's still two separate conditions. My fridge is disgusting af right now, but that's not ARFID, that's a low disgust threshold. \n\nHaving a low disgust threshold is common with OCD but being generally disgusted with food isn't ARFID. People with autism have restricted food selection, but it isn't ARFID in and of itself.\n\n&#x200B;\n\n>sorry I don't fit into your understanding of what ARFID is. my psychiatrist is familiar with ARFID I was referred to her specifically because of that.\n\nThis isn't a \"my truth, your truth, my understanding, your understanding\" thing. Do you understand that psychiatric diseases have certain criteria? Much like biological diseases?\n\nObviously, I don't know your business and I'm not telling you not to trust your psychiatrist. You've been worked up and maybe you are persistently malnourished despite eating many different foods. \n\nThey have your details, maybe the undiagnosed health condition causing your chronic nausea for many years was insignificant so it made sense to your psychiatrist to disregard it. Who knows? \n\nI only replied because you seemed genuinely confused by the OP's graphic. My understanding of ARFID is pretty spot on. \n\nYou can be defensive, you can stay confused, but why join an ARFID group and then be like, \"You shouldn't make generalisations about Avoidant/Restrictive Food Intake Disorder causing avoidant/restrictive food intake because I eat a variety of foods and my restricted diet is due to a condition I had that caused chronic nausea and maybe OCD. Forget the international diagnostic standard, trust my understanding instead even though I'm a bit confused as to why you all think ARFID involves having a restricted diet.\"",
          "created_utc": 1634799759.0
        },
        {
          "id": "hhhv7ag",
          "author": "None",
          "body": ">Actual suffering. How are you persistently malnourished eating many different foods?\n\ndo you hear yourself? screw you lol, it's very rude to tell someone that their diagnosis doesn't fit and that if they *actually* had their diagnosis then they would know *actual suffering*. not that I need to prove to you that I am *actually* suffering, but I assure you, my eating disorder has impacted my physical health and my ability to keep up with my daily life. it has shaped my life choices and the relationships I am able to maintain.\n\nif I am avoiding food altogether that sounds like ARFID. this week I am struggling to eat more than once a day, just to give you an idea of where I am in my recovery. usually what I eat is a variety of foods, but making myself eat anything at all is my problem, my brain will do just about anything to avoid eating but it's less about what i'm eating and more about having to put food in my body at all.\n\n>maybe the undiagnosed health condition causing your chronic nausea for many years was insignificant\n\nThe undiagnosed health condition was POTS btw. the major symptoms I experienced were nausea due to tachycardia and an inability to feel hunger unless I was lying down (because of an improvement in circulation when I lie down). it was not insignificant to me as I was throwing up daily for 7 or so years and only experienced hunger when lying down to go to sleep. as a result, now that I am on a beta blocker that controls these symptoms, I still have a fear of eating, despite the foods that I do manage to eat being a wide variety.\n\nI am defensive that's my bad. I usually appreciate this subreddit because I am able to focus on the common experiences I have with others that have ARFID. but the tone of a lot of posts lately sounds a lot like gatekeeping, I think many people would see this post and interpret it as telling them they don't really have ARFID, and I think that could be very harmful. but you're right that my comment was kind of unnecessary I could have just quietly left the sub, which I will now.  👋",
          "created_utc": 1634827423.0
        },
        {
          "id": "hhz0kh8",
          "author": "ZennyDaye",
          "body": "All I'm saying is that it's part of the diagnostic process that you need to rule out other medical, surgical or psychiatric conditions causing the food avoidance or restriction before you say a person has ARFID.\n\nPOTS has a lot of gastrointestinal symptoms that would cause you to restrict your diet. It isn't cured by beta blockers, it's just managing your symptoms, so you still have an ongoing concurrent medical condition that explains your food issues.\n\nPeople with diverticulitis, Crohn's, stomach ulcerations, alcoholics with liver failure, gall bladder problems, people who've been on chemo... They all have restrictions to their diet or reasons to avoid food based on their experience with their conditions, and even after they are treated for the condition might continue with the food restriction because after a long enough time a person gets conditioned to associate food with the negative symptoms they experienced. \n\nI just don't get why they'd attribute your food issues to ARFID when there's a clear cut condition that covers it already. I don't see how they'd say you are overreacting to POTS. How do you look past a treated but still ongoing condition?  How can someone decide that your feelings about food is excessive after it went untreated for so long? Seven years of daily vomiting... POTS is pretty easy to diagnose. It's been around since when, the 1930s?\n\nI'm actually confused now. Did they misdiagnose you with panic attacks and anxiety due to the OCD diagnosis instead of carrying out any kind of investigations? It's the POTS diagnosis and beta blocker treatment recent?\n\nIt's entirely your business and your psychiatrist's if they think that your eating behaviour is excessively avoidant, even in the context of having POTS.  They probably have a reason to think so but it's just weird to me, but I don't know so it doesn't matter. I'm just saying. \n\nIt's like hearing someone say they just got off years of chemo or had nine months of the worst morning sickness but their doctor thinks they should have already bounced back to normal eating behaviours because the chronic nausea is in the past and they should be over it, so now they have ARFID. \n\n>I usually appreciate this subreddit because I am able to focus on the common experiences I have with others that have ARFID. but the tone of a lot of posts lately sounds a lot like gatekeeping\n\nThe point of the group I would think is for people to talk about common experiences, but if the tone sounds exclusionary, it's not because people have some agenda to make people feel like they don't belong, it's because there's an internationally recognised criteria that excludes a person from having ARFID. \n\nIt took 12 or 13 years for DSM 5 to come out. Before that, we were just lumped in with 'feeding disorders of infancy' and 'Eating disorders not otherwise specified.' But now that it *has* been specified, people who experience the common symptomology have a place to just share their experiences with others who've been through the same thing.\n\nI mean, if I post about the abuse I had to go through being force-fed repeatedly because paediatricians told my parents they needed to go tough on me or I'd die, can you relate to that? In early school, a nun made me eat under a cross because she thought my not wanting to eat was a clear sign of evil at work. Do you know how awkward catholic school gets when you throw up in the presence of a cross and you have sunken eyes and look like a zombie? \n\nI was in my fifth year in college before ARFID became a diagnosis. And maybe I do sound like an asshole, and I'm not trying to say that everyone's experience with ARFID is some dark tale of horror, but my experience, and the experience many people have with ARFID is a very different experience to having PoTS or a stomach ulcer or being on chemo or anything else.\n\nPeople here can't take a beta blocker to manage the cause of their nausea. We've never been able to point to any condition or lab results and say \"This is why I vomit.\"\n\nSay, if I was looking for data on safe foods for people with ARFID and trying to find the pattern. IDK, maybe someone is building an app for safe food recommendations, and some ARFID people tick off French fries, white bread, pasta, baked meats, whatever... and then people with POTS and peptic ulcers and post-cholecystectomies etc, add in their very different variety of foods, do you see how it becomes meaningless to the people with the standard version of ARFID?\n\nDo you see the point I'm making? I'm not saying you don't have disordered eating, I don't know you, but if I tell you that I can relate to your experience with POTS because I have 30+ years of nausea to the point where I no longer have a sleep-wake cycle because I've been on anti-emetics for decades, and I also have anxiety and OCD and low blood pressure and autonomic dysregulation across the board, that doesn't mean I have PoTS, does it. Because there's a criteria for having PoTs. \n\nIf I go in for a tilt test, etc and don't meet the criteria for PoTS, then I don't have PoTS. But we spend 13 years on a manual for psychiatric conditions and yet everything turns into a subjective \"well, my version of X is this.\"\n\nJust last week, we had dyspraxia awareness week, and the whole thing was flooded about how dyspraxia gives you extra empathy as if we become X-men or something. \"Fantastic dyspraxics.\" \n\nHell, maybe I'm just a frustrated asshole because psychiatry is at the ass end of medicine and anything goes because there's no empirical evidence of anything. But it's supposed to mean something. ARFID is not supposed to be an adjunct, is what I'm saying.\n\nIt's not you, it's just you reminding me of the pseudo-science of it all. Gatekeeping, lol. I'm not the ARFID police. I'm not the DSM police. We live in an age of anxiety songs on tiktok...  The gate has always been wide open for psychiatric conditions. My vet thinks my cat has PTSD. It's whatever at this point.",
          "created_utc": 1635160169.0
        },
        {
          "id": "hi064pz",
          "author": "None",
          "body": ">POTS is pretty easy to diagnose. It's been around since when, the 1930s?\n\nit was nice of you to write so much about this but imma stop reading here. you don't know as much about this as you thi k you do. I will say\n\n>after a long enough time a person gets conditioned to associate food with the negative symptoms they experienced. \n\nwhat you are describing is still a mental health issue centered around avoiding food, that is why I was diagnosed with ARFID. my ARFID diagnosis also came 2 years before my POTS diagnosis, again because getting diagnosed with POTS was difficult. My tilt table test was negative, but then during an EKG my heart rate stayed at 120 the whole time and they decided I needed a beta blocker. Once on the beta blocker my POTS symptoms improved dramatically and my cardiologist does think it is POTS despite the negative tilt test. I'll also say\n\n>maybe I'm just a frustrated asshole\n\nyeah, you are.",
          "created_utc": 1635180575.0
        },
        {
          "id": "hi3m5b7",
          "author": "ZennyDaye",
          "body": ">my ARFID diagnosis also came 2 years **before** my POTS diagnosis\n\nJesus Christ. \n\nI specifically asked you how they got to ARFID if you have a medical condition that causes your nausea and all you had to say was that you weren't diagnosed with POTS at the point in time when the ARFID diagnosis was made for whatever reason.\n\nI just found it bizarre that a psychiatrist would add ARFID on to PoTS as some sort of adjunctive diagnosis and all you had to say was that your psychiatrist didn't rule out other medical conditions first. Lots of them don't.  Why was that so hard to say? \n\nWhy all the quibbling and accusations about gatekeeping and attacking the OP and other people in the sub for being exclusionary when you damn well know that your psychiatrist didn't take POTS into consideration when he diagnosed you with ARFID because **you weren't diagnosed with POTS as yet**? \n\n&#x200B;\n\n>maybe I'm just a frustrated asshole\n\nI take that back. Frustrated, yes. Asshole, no. You deliberately made it seem as though your psychiatrist knew you had POTS at the point in time when he diagnosed you with ARFID. \n\nYou join a group and complain to people with ARFID that their posts about ARFID don't include your experience with PoTS, and I tell you that if POTS is causing your symptoms, then that excludes ARFID by the definition of ARFID, and you say that your psychiatrist thinks you have ARFID *in spite of* POTS, and then the story changes so now your ARFID was diagnosed *without* the knowledge of your POTS...  \n\nGatekeeping. Lol. It's literally in the group rules that any form of disordered eating is allowed, but it's also in the rules that it's supposed to be a safe place so maybe don't go on about fixing your nausea with beta blockers in a group for people who don't have that option because their symptoms aren't caused by a medical condition that they can be treated for? Maybe don't just throw out your uncanny ability to eat a bunch of foods in a group where people have a handful of foods they rotate. \n\nAnd then, worse, accusing people with ARFID of being gatekeepers because they're not including the Caused-By-POTS variant of the disease in their posts? \n\nOf course, you're not going to be able to relate, and you very well know why you can't relate but you're going to pretend to be confused and then get defensive and accuse people of not understanding a condition they've had all their lives because they have some kind of mean agenda to exclude you... \n\nThanks for finally telling me the truth though, (I'm just assuming there's no more to this). The bizarreness of your earlier story had me genuinely confused for so long, I was actually starting to wonder if your therapist was working with some kind of DSM 6 Pro Plus Ultra edition where they dropped the part about excluding medical conditions.\n\nAll you had to say was that they didn't know. That was it. Riddle solved.",
          "created_utc": 1635246283.0
        }
      ]
    }
  ]
}