{
  "id": "qghuvw",
  "subreddit": "ARFID",
  "author": "Prestigious_Ad432",
  "created_utc": 1635287062.0,
  "title": "dear parents, and loved ones, it's not as easy as \"snapping out of it\"",
  "selftext": "You think that I want this? You think that I love the feeling of literally gagging with 60% of my food? No I don't, that I have found a name for it and a community doesn't mean I want it, it means I know I'm not the only one.\nYou don't need to \"get\" it, and I know it sounds weird how I describe foods as \"they taste too white\" and \"it's rotten piano flavor\" but that's how I interpret it.\nYou don't need to feel what I feel, just please support me and stop policing what I eat, it doesn't help, I incorporate fear foods into safe foods to ease myself into them, and it's still hard, I repeat meals a lot because they're safe, they're perfect, they have everything I need, I avoid certain things because they literally make me want to puke (that I've learned to mask it over the years doesn't magically take the feeling away)\nIt doesn't make me special, it's not a prize or a good thing, it's a horrible condition, that isn't just \"picky eating\", it's hard, and I'm fucking trying, but you make it harder for me when saying things like \"haven't you eaten a lot of spinach lately?\" yes I have and it's because I finally conquered it, because I can enjoy it because I've found a way, or \"you look tortured when you eat\" trust me, I feel so too, \"why don't you ever eat with us?\" because my eating habits to get food to get me through the day are complicated, because I feel embarrassed to eat, because it's hard.\nI am slowly but surely getting out of it, in a way that's not gonna be by masking my disgust and fear, but actually getting over it.\nSo please, from the bottom of my heart, support me, it means the world to me",
  "url": "https://www.reddit.com/r/ARFID/comments/qghuvw/dear_parents_and_loved_ones_its_not_as_easy_as/",
  "score": 97,
  "num_comments": 9,
  "comments": [
    {
      "id": "hi7ikqf",
      "author": "RenalW1ndhelm",
      "body": "I wish I could show this to my family, without them trying to argue with me.",
      "created_utc": 1635308320.0,
      "score": 13,
      "context": []
    },
    {
      "id": "hi9uwd9",
      "author": "hell_kat",
      "body": "I am sorry you feel so alone. As a mom of a teen with ARFID, I know how hard it is for you. I am really proud of you for working so hard and being able to work those fear foods into your diet!  That is a huge freaking thing!!  Keep doing what you are doing.  I work in mental health and, honestly, a lot of people have a hard time relating or understanding something they have never experienced.  Family \"help\", well intentioned or not, can often act in opposition to what they are trying to achieve. Keep up the good work.  It's hard not to be understood so I am glad you found a community that does get it.",
      "created_utc": 1635356762.0,
      "score": 7,
      "context": []
    },
    {
      "id": "hiascqx",
      "author": "sbiel001",
      "body": "I want to show this post to my parents on behalf of my brother. I'm so sorry you're going through this and I'm so sorry your parents don't understand and are unsupportive. It breaks my heart to read this. And it makes me so angry to hear about how little my parents try to understand my brother, even though he has a diagnosis. I picked up the phone the other day and basically yelled at my mum that \"just because it's not real for you, that doesn't mean it's not real for someone else! So stop making out that my brother not eating is somehow a purposeful thing he does to annoy you!\"",
      "created_utc": 1635369661.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hj86xj8",
      "author": "Snoopfernee",
      "body": "I’m in tears. I’m sorry that you feel that way. I came here tonight bc my son will be 5 in a few months and from everything we’ve seen since he was 1-2, he’s dealing with ARFID. We’re struggling with trying to understand, trying to help him be healthy, and trying to not pressure him so he’ll be happy. I hope that is what your family was intending, even if it didn’t come across that way. I wish my son was old enough to tell me what he needs. Best of luck to you!",
      "created_utc": 1635988641.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hi8n8ly",
      "author": "Prestigious_Ad432",
      "body": "I feel ya :/",
      "created_utc": 1635338154.0,
      "score": 3,
      "context": [
        {
          "id": "hi7ikqf",
          "author": "RenalW1ndhelm",
          "body": "I wish I could show this to my family, without them trying to argue with me.",
          "created_utc": 1635308320.0
        }
      ]
    },
    {
      "id": "higs0dr",
      "author": "Prestigious_Ad432",
      "body": "thank you, this really means a lot to me <3 :')",
      "created_utc": 1635475651.0,
      "score": 2,
      "context": [
        {
          "id": "hi9uwd9",
          "author": "hell_kat",
          "body": "I am sorry you feel so alone. As a mom of a teen with ARFID, I know how hard it is for you. I am really proud of you for working so hard and being able to work those fear foods into your diet!  That is a huge freaking thing!!  Keep doing what you are doing.  I work in mental health and, honestly, a lot of people have a hard time relating or understanding something they have never experienced.  Family \"help\", well intentioned or not, can often act in opposition to what they are trying to achieve. Keep up the good work.  It's hard not to be understood so I am glad you found a community that does get it.",
          "created_utc": 1635356762.0
        }
      ]
    },
    {
      "id": "higs3yi",
      "author": "Prestigious_Ad432",
      "body": "I hope your brother can get through eating a little smoothly, you're a good sibling :)",
      "created_utc": 1635475697.0,
      "score": 2,
      "context": [
        {
          "id": "hiascqx",
          "author": "sbiel001",
          "body": "I want to show this post to my parents on behalf of my brother. I'm so sorry you're going through this and I'm so sorry your parents don't understand and are unsupportive. It breaks my heart to read this. And it makes me so angry to hear about how little my parents try to understand my brother, even though he has a diagnosis. I picked up the phone the other day and basically yelled at my mum that \"just because it's not real for you, that doesn't mean it's not real for someone else! So stop making out that my brother not eating is somehow a purposeful thing he does to annoy you!\"",
          "created_utc": 1635369661.0
        }
      ]
    },
    {
      "id": "hild33u",
      "author": "SpaceWitchScoofs",
      "body": "That last bit reminds me how my mom thought (still thinks?) my \"picky eating\" as a teen was me rebelling against her. That I just wanted to be difficult. It's horrible struggling to eat and makes social gatherings (especially holidays) so frustrating and upsetting. Why the fuck would anyone do that to themselves to upset someone else? It makes no sense. After a lifetime of having ARFID it's become exhausting to try to get people to even consider that my eating disorder is a real thing that actually impacts my life in severe ways.",
      "created_utc": 1635559387.0,
      "score": 2,
      "context": [
        {
          "id": "hiascqx",
          "author": "sbiel001",
          "body": "I want to show this post to my parents on behalf of my brother. I'm so sorry you're going through this and I'm so sorry your parents don't understand and are unsupportive. It breaks my heart to read this. And it makes me so angry to hear about how little my parents try to understand my brother, even though he has a diagnosis. I picked up the phone the other day and basically yelled at my mum that \"just because it's not real for you, that doesn't mean it's not real for someone else! So stop making out that my brother not eating is somehow a purposeful thing he does to annoy you!\"",
          "created_utc": 1635369661.0
        }
      ]
    },
    {
      "id": "hjavkbt",
      "author": "Prestigious_Ad432",
      "body": "thank you! They do try, it's just a little complicated, my advice is to kind of \"hide\" his fear foods with foods he likes (eg. I love cheese, but hate spinach, so I make a pizza with spinach cut in very small pieces so my brain doesn't notice) coach him slowly but surely, avoid forcing and if you can, consult with a nutritionist, best of luck to y'all! :)",
      "created_utc": 1636044308.0,
      "score": 2,
      "context": [
        {
          "id": "hj86xj8",
          "author": "Snoopfernee",
          "body": "I’m in tears. I’m sorry that you feel that way. I came here tonight bc my son will be 5 in a few months and from everything we’ve seen since he was 1-2, he’s dealing with ARFID. We’re struggling with trying to understand, trying to help him be healthy, and trying to not pressure him so he’ll be happy. I hope that is what your family was intending, even if it didn’t come across that way. I wish my son was old enough to tell me what he needs. Best of luck to you!",
          "created_utc": 1635988641.0
        }
      ]
    }
  ]
}