{
  "id": "qiuekr",
  "subreddit": "ARFID",
  "author": "i-love-sloths-530",
  "created_utc": 1635570068.0,
  "title": "I ordered something OTHER than my safe food at a restaurant!!!",
  "selftext": "My go to safe food is always pasta. Alfredo is a yes, aglio olio is a maybe, and red sauce is a maybe. Well this restaurant was a very upscale 5 star sophisticated kinda place and if I wanted my safe food, I wouldve had to special order... which always dampens my mood.\n\nSo I ordered a roasted garlic and butternut squash soup expecting to hate it but hoping to love it since it sounded so good, and a ceaser salad to bulk it up a bit.   It was FANTASTIC!!! One of the best soups I've ever tasted and I practically licked the bowl clean. I pulled out large chunks of the squash (it was really only there for decoration) but I'm hardcore counting it as a win!! Ordered something new, AND cleaned my plates!!! \n\nI even had a new wine!",
  "url": "https://www.reddit.com/r/ARFID/comments/qiuekr/i_ordered_something_other_than_my_safe_food_at_a/",
  "score": 114,
  "num_comments": 4,
  "comments": [
    {
      "id": "hilz7kf",
      "author": "lelaluv",
      "body": "i love this for u🥺 when i was in italy i kinda had to do the same, my safe food was really just pepperoni pizza there bc the pasta and stuff was always too fancy and i didn’t even speak italian. ended up being forced to try some new stuff and it was actually not bad! it feels good :)",
      "created_utc": 1635571720.0,
      "score": 12,
      "context": []
    },
    {
      "id": "hin72sn",
      "author": "None",
      "body": "I need money to go to a restaurant...i have yet to go to one since i was 10 XD i need to step out of my comfort zone more you are awesome",
      "created_utc": 1635602674.0,
      "score": 4,
      "context": []
    },
    {
      "id": "himmhv5",
      "author": "BubbaMc",
      "body": "Fantastic work!!!",
      "created_utc": 1635590101.0,
      "score": 2,
      "context": []
    },
    {
      "id": "himppig",
      "author": "Jadotine",
      "body": "Congrats!",
      "created_utc": 1635592535.0,
      "score": 2,
      "context": []
    }
  ]
}