{
  "id": "r2fp68",
  "subreddit": "ARFID",
  "author": "ArtisticPassage",
  "created_utc": 1637904225.0,
  "title": "new doctor did NOT understand",
  "selftext": "I went to try out a new doctor today and it did NOT go well. Explained to her that i have ARFID and told her what it was (since ya know, most people don’t know), and she told me “well sometimes you just have to be brave like NORMAL people and just try the food. you cant keep complaining about it if you don’t do anything to fix it”. Like WHY DO YOU THINK IM HERE?? But also- i’ve done lots of work on it and am even starting a program in a month or so (brain mapping), which i told her. Then, as i was leaving she said “well youre still skinny so whatever youre doing, it’s working!” who says that to someone with an ED?! Safe to say i won’t be seeing her again.\n\nanyways, just needed to rant. spent the whole car ride home crying in frustration and anger. i just wish people, especially medical professionals, would understand :/\n\nsorry for bad grammar and punctuation i am angry typing",
  "url": "https://www.reddit.com/r/ARFID/comments/r2fp68/new_doctor_did_not_understand/",
  "score": 96,
  "num_comments": 14,
  "comments": [
    {
      "id": "hm4h8zl",
      "author": "dcddy-issues",
      "body": "take her license away omfg",
      "created_utc": 1637905266.0,
      "score": 56,
      "context": []
    },
    {
      "id": "hm4pk9i",
      "author": "None",
      "body": "Report her...immediately",
      "created_utc": 1637910924.0,
      "score": 46,
      "context": []
    },
    {
      "id": "hm5bf2v",
      "author": "LuxandGold",
      "body": "That sounds like grounds for reporting her to the relevant authorities. \n\nYou came to her with a legitimate eating disorder. It exists in the DSM-5 for a reason. She then made multiple, extremely inappropriate comments about your size and dismissed your concerns about this disorder. \n\nIncredibly highly unprofessional.",
      "created_utc": 1637928972.0,
      "score": 41,
      "context": []
    },
    {
      "id": "hm5mj1r",
      "author": "kaleidoscopichazard",
      "body": "“You’re still skinny so whatever you’re doing is working”???! Bc malnourished people are heathy? \nReport her. That’s incredibly unprofessional. \n\nAlso, were they a gp or a psychiatrist?\nI would also advise against ED specialists bc ARFID is nothing like your typical EDs. Probably best to go with a psych specialising in developmental issues",
      "created_utc": 1637936031.0,
      "score": 22,
      "context": []
    },
    {
      "id": "hm51nap",
      "author": "sleepy_and_bored",
      "body": "That really sucks. I’m sorry you weren’t taken seriously. I’ve been there. \n\nWhat sort of doctor was it? Did they specialize in ED or were they something different?\n\nDon’t give up! It’s amazing that you’re able to even go looking to solve this issue and that puts you so far ahead of the game than most people!",
      "created_utc": 1637920622.0,
      "score": 13,
      "context": []
    },
    {
      "id": "hm5tqtx",
      "author": "rockydurga503",
      "body": "general practitioners really have NO insight into eating disorders and treatment. We are running into this all the time. Next time ask if the MD has any background in ED. Luckily my daughter's adult MD happens to have done some extra training in ED management which I hope proves to be helpful. \n\nIf you have worked with an RD or nutritionist ask them which doctors have a lot of ED patients. Those providers could be more experienced. \n\nAlso your health insurance company may have some insight of better suited providers",
      "created_utc": 1637939766.0,
      "score": 10,
      "context": []
    },
    {
      "id": "hm5prn2",
      "author": "tshnaxo",
      "body": "Every doctor I’ve brought up ARFID too has just given me a weird look and basically no acknowledgement. I feel too embarrassed to even bring it up anymore, I’m looking into buying therapy videos made specifically for ARFID. \n\nReminds me of when I came to the doctor covered in hives and he lectured me for being underweight.",
      "created_utc": 1637937773.0,
      "score": 6,
      "context": []
    },
    {
      "id": "hm6a592",
      "author": "floorenjoyer",
      "body": "I swear half of these so called medical professionals either need to have their licenses revoked, or need to undergo SERIOUS retraining.  It's absurd how many horror stories there are like this; infuriates me. I'm sorry this happened, it can be so degrading and discouraging, but please keep trying if you think this is something you need. I have only similar experiences so unfortunately I can't say it will get better, but some of the other comments seem to have better ideas :)",
      "created_utc": 1637947159.0,
      "score": 4,
      "context": []
    },
    {
      "id": "hm57uys",
      "author": "moo-moo420",
      "body": "That sucks :( Hope you find a better doctor",
      "created_utc": 1637926063.0,
      "score": 4,
      "context": []
    },
    {
      "id": "hm723o3",
      "author": "WoodWideWeb",
      "body": "Yes please report her! Some great advice I've learned from some reddit comment was to demand that a doctor put their shitty words/advice/neglect in official notes. I've had bad doctor/other appts and I typically leave, get really upset, and call to complain. I'm working on being able to call out the unacceptable behavior right then, though. Like, \"How could you say such an insensitive thing!\" You have every right to feel the way you do and she sounds like someone who shouldn't be a doctor.",
      "created_utc": 1637960008.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hm72nlq",
      "author": "i_enjoy_music_n_stuf",
      "body": "tel someone that works there that ducked up she could actually hurt someone",
      "created_utc": 1637960268.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hm7r5xq",
      "author": "None",
      "body": "Give her a bad review!  We don't want anyone else to feel as bad as you did.  Don't think about anything she said.  She is obviously unprofessional.",
      "created_utc": 1637971941.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hm6kr9i",
      "author": "NotApplicableMC",
      "body": "Ikr like what would she say to an anorexic? Unbelievable.",
      "created_utc": 1637951876.0,
      "score": 7,
      "context": [
        {
          "id": "hm5mj1r",
          "author": "kaleidoscopichazard",
          "body": "“You’re still skinny so whatever you’re doing is working”???! Bc malnourished people are heathy? \nReport her. That’s incredibly unprofessional. \n\nAlso, were they a gp or a psychiatrist?\nI would also advise against ED specialists bc ARFID is nothing like your typical EDs. Probably best to go with a psych specialising in developmental issues",
          "created_utc": 1637936031.0
        }
      ]
    },
    {
      "id": "hm618ig",
      "author": "bobainwonderland",
      "body": "I finally got a therapist to look into what it was to understand it better. It was so validating. Medical doctors? No way",
      "created_utc": 1637943248.0,
      "score": 6,
      "context": [
        {
          "id": "hm5prn2",
          "author": "tshnaxo",
          "body": "Every doctor I’ve brought up ARFID too has just given me a weird look and basically no acknowledgement. I feel too embarrassed to even bring it up anymore, I’m looking into buying therapy videos made specifically for ARFID. \n\nReminds me of when I came to the doctor covered in hives and he lectured me for being underweight.",
          "created_utc": 1637937773.0
        }
      ]
    }
  ]
}