{
  "id": "rjh9q1",
  "subreddit": "ARFID",
  "author": "bubble6066",
  "created_utc": 1639863524.0,
  "title": "Anyone with ARFID not a particularly picky eater (flexible trying new things) but will skip out on eating entirely if there’s nothing I want to eat availible, too lazy to eat sometimes",
  "selftext": "I haven’t been diagnosed with ARFID but fit a lot of the symptom profile and have ADD Inattentive. I’ve been dealing with stomach issues- particularly constipation for the past couple years. I went to a doctor over it and she thought they could be caused by anorexia because I’ve considered “severely underweight” (BMI of 15, but it hasn’t changed much since I was a kid). I was annoyed at this because body image has never played a role in my eating habits- it doesn’t seem to be a good explanation from a mental/emotional standpoint, but perhaps I wasn’t consuming enough calories and think I could have an eating disorder. Often when I’m on my own at college I won’t feel motivated to eat until like 5 PM and sometimes have only 1-2 meals a day. My dad has said before sometimes it seems like I’m too lazy to eat. However I’m really not a picky eater and am adventurous in trying new foods, however what I feed myself can be a bit samey, sometimes I go through food fixations of only eating certain foods which I heard is common with ADHD folks. For example, my breakfast always contains either a bagel with cream cheese, toast and eggs, or yogurt and I don’t really deviate from that. I’ve always been a slower eater than the rest of my family and don’t like the feeling of being full as it’s uncomfortable.\n\nMy question is could these habits be ARFID or would it be better explained by a different eating disorder or simply ADD brain? Most posts I see here are people who are extremely picky eaters to the point it interferes socially which is not my case.",
  "url": "https://www.reddit.com/r/ARFID/comments/rjh9q1/anyone_with_arfid_not_a_particularly_picky_eater/",
  "score": 96,
  "num_comments": 16,
  "comments": [
    {
      "id": "hp4mvtc",
      "author": "WhenSoulMeetsBody_",
      "body": "This is exactly my type of symptoms and I am diagnosed with ARFID. I lack motivation to make any food and often file through things in my brain trying to find something that might sound appetizing, but nothing usually does. I imagine the taste and texture of food before I eat it and if it doesn’t appeal to me, I just won’t eat. I don’t know the cure, I’ve been to treatment and I still have a lot of issues.",
      "created_utc": 1639885703.0,
      "score": 30,
      "context": []
    },
    {
      "id": "hp3mtuo",
      "author": "Fit-Distribution-252",
      "body": "Yes, I'll try almost anything once. If that once goes wrong, never again. But I also tend to stick to safe foods so I only try new when eating out, on very rare occasions.",
      "created_utc": 1639867578.0,
      "score": 20,
      "context": []
    },
    {
      "id": "hp4kcrf",
      "author": "cl0akincellar",
      "body": "This sounds exactly like me, I’m awaiting ADHD assessment, I often only eat one meal a day which is dinner and then some snacks just before/after, but I fixate on particular foods a lot, but sometimes I get bored of that food so I’ll have something I’ve not had in a while, which feels new but isn’t exactly, I’m willing to try some new things as long as I don’t have a texture aversion to it already! (Beans/mushrooms/eggs/tomatoes etc are big no-nos for me)",
      "created_utc": 1639884391.0,
      "score": 9,
      "context": []
    },
    {
      "id": "hp3jw8o",
      "author": "NoIron9582",
      "body": "Yep, sounds like me.",
      "created_utc": 1639866159.0,
      "score": 7,
      "context": []
    },
    {
      "id": "hp3wmvb",
      "author": "Hmariey",
      "body": "Definitely. Though I do also have stress induced food aversions.",
      "created_utc": 1639872360.0,
      "score": 5,
      "context": []
    },
    {
      "id": "hp4z8ps",
      "author": "crowcas",
      "body": "i have both ADHD and ARFID, and i do something kind of similar with the intermittent meals—if my routine gets messed up, i just don’t eat until either i’m so hungry i’m faint/hurting, or someone sits me down and tells me to eat. even now, i usually only have two meals a day, sometimes snacking between, sometimes not. \n\nthat being said, ive always attributed that to ADHD, and based on what you’ve said, especially with what you said about being away at school, i think that’s probably the case for you too. it sounds like it’s not the eating itself that you’re avoiding, so much as the process. especially with ADHD, things that are otherwise simple tasks are these arduous multi-step processes that feel like they take forever. \n\nthis is what my first year of college was like, if i was thinking about getting food (via dining hall): \n\n step 0 - find a good stopping point for the current activity. step 1 - get up. step 2 - find meal card. (step 2.5 - find keys. my student ID was both, so that was one less step for me) step 3 - go downstairs. step 4 - walk to dining hall. step 5 - realize that this dining hall closed twenty minutes ago. step 6 - cuss/cry about it. step 7 - look up which dining halls are still open. step 8 - go back to your room because you just don’t have the energy to go across campus for some shitty pizza and whatever other mediocre food they’re serving. \n\ni lost a lot of weight freshman year because my college’s dining hall was closed more than it was open, and the next nearest one was half a mile away. (i also lived on the sixth floor, and the elevator was usually out, which didn’t help with “i’ll just make a quick run to get some food”, knowing i had six flights of stairs waiting for me, but you get the point)\n\nthe samey foods thing is fairly common among ADHD and autism, so i guess it’s just a question of are they samey because you *want* those same foods, or because you *dont* want other ones? if you had those foods *right* in front of you, would you eat them? even if it was disappointing, would you still be fine eating other (safe) foods, if they were what was available? \n\n\nin any case, i empathize with your situation, OP. with a lot of these kinds of comorbidities, it’s really hard to tell what’s causing what—and sometimes that’s because *everything* is contributing in some way. i hope you’re able to find some clarity 💪",
      "created_utc": 1639892673.0,
      "score": 6,
      "context": []
    },
    {
      "id": "hp7qsnr",
      "author": "calamitylamb",
      "body": "This is me 10,000%. I also have ADHD, and have been dealing with stomach issues, particularly nausea and vomiting, for years. I have food aversions to just about every animal product which strongly limits my diet, but am an adventurous eater if the menu is plant-based. \n\nMy main issue is that I often either forget to eat, can’t think of anything I want to eat, don’t have the energy/motivation/executive function to prepare a meal, have zero appetite, feel too tired or weak, etc.\n\nI have a low BMI but it’s not because of body image issues or me trying to lose weight - in fact I’d like to gain some muscle so I can be better at my physically-active hobbies, but the whole extra aspect of eating enough food to fuel those gains has proven incredibly difficult. \n\nSome people live to eat, but I’m over here just eating to live lol",
      "created_utc": 1639948496.0,
      "score": 5,
      "context": []
    },
    {
      "id": "hp4785c",
      "author": "mandelaXeffective",
      "body": "Ah yes! This is very similar to my experience. I definitely have a long list of foods I dislike, but I am still relatively open to trying new things as long as I know what's in them.",
      "created_utc": 1639877797.0,
      "score": 4,
      "context": []
    },
    {
      "id": "hp4uibx",
      "author": "Berrienboo",
      "body": "There are three types of ARFID, and you can have any combination of the three. (I unfortunately do have all three, but some parts are better or worse then others)\n\nBut what you are describing is a type of ARFID. It's the lack of interest in food type.\n\nNo worries, as far as this disorder goes, you're not alone.",
      "created_utc": 1639889851.0,
      "score": 4,
      "context": []
    },
    {
      "id": "hp44xdk",
      "author": "crystalfairie",
      "body": "Yup. But I also have nausea and vomiting associated with fibro.",
      "created_utc": 1639876609.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hp4c4zg",
      "author": "killrtaco",
      "body": "Yep this is exactly me",
      "created_utc": 1639880241.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hp4wxpd",
      "author": "bubble6066",
      "body": "thanks for commenting, it makes me feel more sane to know others have the same thing- I didn’t even know what ARFID was until a few weeks ago, it was never suggested to me by a doctor\n\nand yeah I’m concerned treatment might not be productive for me and that I would encounter more doctors/therapists who will assume it’s covert anorexia off the bat! the only thing I’ve found helps me is being around people who kind of regulate my eating habits in a social setting- I tend to mold to my environment, but on my own I’m a lost cause.",
      "created_utc": 1639891292.0,
      "score": 5,
      "context": [
        {
          "id": "hp4mvtc",
          "author": "WhenSoulMeetsBody_",
          "body": "This is exactly my type of symptoms and I am diagnosed with ARFID. I lack motivation to make any food and often file through things in my brain trying to find something that might sound appetizing, but nothing usually does. I imagine the taste and texture of food before I eat it and if it doesn’t appeal to me, I just won’t eat. I don’t know the cure, I’ve been to treatment and I still have a lot of issues.",
          "created_utc": 1639885703.0
        }
      ]
    },
    {
      "id": "hp6ev87",
      "author": "feyre_0001",
      "body": "This comment make me feel so seen.",
      "created_utc": 1639928693.0,
      "score": 3,
      "context": [
        {
          "id": "hp4kcrf",
          "author": "cl0akincellar",
          "body": "This sounds exactly like me, I’m awaiting ADHD assessment, I often only eat one meal a day which is dinner and then some snacks just before/after, but I fixate on particular foods a lot, but sometimes I get bored of that food so I’ll have something I’ve not had in a while, which feels new but isn’t exactly, I’m willing to try some new things as long as I don’t have a texture aversion to it already! (Beans/mushrooms/eggs/tomatoes etc are big no-nos for me)",
          "created_utc": 1639884391.0
        }
      ]
    },
    {
      "id": "hp522w3",
      "author": "bubble6066",
      "body": "thank you so much for this response! I relate so much to what you said about the process of going to the dining hall LMAO. my first year away at college I lost a concerning amount of weight living in the dorms, due to the dining halls being far away or having shitty hours. I would get scattered and it would take too much effort to go and eat (I was always losing my keys as well lol). the food they were serving was just bad in quality and the preparation so it wasn’t that appetizing and caused demotivation to go at all.\n\nsince leaving the dorms I’ve struggled instead with grocery shopping without a car and preparing food consistently. I much prefer having a kitchen over the dining halls, but still struggle with eating enough and will forget to and get faint.\n\nbut as far as the samey foods go, I would 100% eat something else if it was available. I think it is because I want those particular things- I don’t not want everything else. I’m truly not a picky eater and there are few foods I find inherently bad if they’re well prepared, although I’ve been vegetarian for a few long periods in my life. \n\nI should add that I used to be a very picky eater and there were a number of foods I didn’t like up through my teens but I’ve completely lost that. I used to be made fun of for only liking Mac and cheese, didn’t like tomatoes or mushrooms for texture/taste reasons but I’ve gotten over it. my parents are also great cooks which I think helped me out. so I don’t know if this all disqualifies me from having ARFID and it is just ADD. the thing about “lack of interest in food” with this disorder is very much me though and I haven’t found much in the way of explanations for that. I think it might run deeper than just ADD but I am having trouble navigating the causes for it.",
      "created_utc": 1639894514.0,
      "score": 3,
      "context": [
        {
          "id": "hp4z8ps",
          "author": "crowcas",
          "body": "i have both ADHD and ARFID, and i do something kind of similar with the intermittent meals—if my routine gets messed up, i just don’t eat until either i’m so hungry i’m faint/hurting, or someone sits me down and tells me to eat. even now, i usually only have two meals a day, sometimes snacking between, sometimes not. \n\nthat being said, ive always attributed that to ADHD, and based on what you’ve said, especially with what you said about being away at school, i think that’s probably the case for you too. it sounds like it’s not the eating itself that you’re avoiding, so much as the process. especially with ADHD, things that are otherwise simple tasks are these arduous multi-step processes that feel like they take forever. \n\nthis is what my first year of college was like, if i was thinking about getting food (via dining hall): \n\n step 0 - find a good stopping point for the current activity. step 1 - get up. step 2 - find meal card. (step 2.5 - find keys. my student ID was both, so that was one less step for me) step 3 - go downstairs. step 4 - walk to dining hall. step 5 - realize that this dining hall closed twenty minutes ago. step 6 - cuss/cry about it. step 7 - look up which dining halls are still open. step 8 - go back to your room because you just don’t have the energy to go across campus for some shitty pizza and whatever other mediocre food they’re serving. \n\ni lost a lot of weight freshman year because my college’s dining hall was closed more than it was open, and the next nearest one was half a mile away. (i also lived on the sixth floor, and the elevator was usually out, which didn’t help with “i’ll just make a quick run to get some food”, knowing i had six flights of stairs waiting for me, but you get the point)\n\nthe samey foods thing is fairly common among ADHD and autism, so i guess it’s just a question of are they samey because you *want* those same foods, or because you *dont* want other ones? if you had those foods *right* in front of you, would you eat them? even if it was disappointing, would you still be fine eating other (safe) foods, if they were what was available? \n\n\nin any case, i empathize with your situation, OP. with a lot of these kinds of comorbidities, it’s really hard to tell what’s causing what—and sometimes that’s because *everything* is contributing in some way. i hope you’re able to find some clarity 💪",
          "created_utc": 1639892673.0
        }
      ]
    },
    {
      "id": "hp55rnt",
      "author": "WhenSoulMeetsBody_",
      "body": "This sounds exactly like me too! I never knew what ARFID was until my vitamin deficiency was so bad and I was seeing a kidney doctor who kept probing my eating habits.. eventually it clicked and now I clearly see the disordered eating habits. I relate so much to the need to be in a social setting and will adapt to others. It was relatively easy for me at treatment cause I was around other people and the food was prepared for me. Now that I’m back home and have to make it myself, I have zero interest.",
      "created_utc": 1639897147.0,
      "score": 4,
      "context": [
        {
          "id": "hp4mvtc",
          "author": "WhenSoulMeetsBody_",
          "body": "This is exactly my type of symptoms and I am diagnosed with ARFID. I lack motivation to make any food and often file through things in my brain trying to find something that might sound appetizing, but nothing usually does. I imagine the taste and texture of food before I eat it and if it doesn’t appeal to me, I just won’t eat. I don’t know the cure, I’ve been to treatment and I still have a lot of issues.",
          "created_utc": 1639885703.0
        },
        {
          "id": "hp4wxpd",
          "author": "bubble6066",
          "body": "thanks for commenting, it makes me feel more sane to know others have the same thing- I didn’t even know what ARFID was until a few weeks ago, it was never suggested to me by a doctor\n\nand yeah I’m concerned treatment might not be productive for me and that I would encounter more doctors/therapists who will assume it’s covert anorexia off the bat! the only thing I’ve found helps me is being around people who kind of regulate my eating habits in a social setting- I tend to mold to my environment, but on my own I’m a lost cause.",
          "created_utc": 1639891292.0
        }
      ]
    },
    {
      "id": "hp56ltr",
      "author": "crowcas",
      "body": "it could be a combination of both ADHD and ARFID! sometimes symptoms really do just combine in such a way that there’s no untangling them. \n\nin the meantime, since it sounds like you’re worried about caloric intake, you could try setting up a “snack station” of sorts where you’re inclined to spend most of your time. if you have one, there’s no rule that says that mini-fridges are only for college dorms—stick one of those bad boys nearby and fill it up with whatever you think will strike your fancy. basically: put food within your line of sight, ideally within arms reach.\n\nanother thing that has helped me has been to split up larger bags of snacks into one or two-serving containers as soon as i buy them—sure it takes a few minutes, but it’s easier for me to only go through the process ONCE and have convenient little grab-n-go snacks, rather than through the process every single time. \n\n(keeping the whole bag nearby is too dangerous…sometimes i get distracted and eat the whole thing and then regret it twice—the first time when i feel sick, the second when i realize i have no more snacks :( ) \n\n(and good riddance to dining hall days. their only redeeming quality was those chocolate muffins you could only get at the crack of dawn because they’d all be gone afterwards!)\n\nhope you find something that works for you! ✌️",
      "created_utc": 1639897776.0,
      "score": 5,
      "context": [
        {
          "id": "hp4z8ps",
          "author": "crowcas",
          "body": "i have both ADHD and ARFID, and i do something kind of similar with the intermittent meals—if my routine gets messed up, i just don’t eat until either i’m so hungry i’m faint/hurting, or someone sits me down and tells me to eat. even now, i usually only have two meals a day, sometimes snacking between, sometimes not. \n\nthat being said, ive always attributed that to ADHD, and based on what you’ve said, especially with what you said about being away at school, i think that’s probably the case for you too. it sounds like it’s not the eating itself that you’re avoiding, so much as the process. especially with ADHD, things that are otherwise simple tasks are these arduous multi-step processes that feel like they take forever. \n\nthis is what my first year of college was like, if i was thinking about getting food (via dining hall): \n\n step 0 - find a good stopping point for the current activity. step 1 - get up. step 2 - find meal card. (step 2.5 - find keys. my student ID was both, so that was one less step for me) step 3 - go downstairs. step 4 - walk to dining hall. step 5 - realize that this dining hall closed twenty minutes ago. step 6 - cuss/cry about it. step 7 - look up which dining halls are still open. step 8 - go back to your room because you just don’t have the energy to go across campus for some shitty pizza and whatever other mediocre food they’re serving. \n\ni lost a lot of weight freshman year because my college’s dining hall was closed more than it was open, and the next nearest one was half a mile away. (i also lived on the sixth floor, and the elevator was usually out, which didn’t help with “i’ll just make a quick run to get some food”, knowing i had six flights of stairs waiting for me, but you get the point)\n\nthe samey foods thing is fairly common among ADHD and autism, so i guess it’s just a question of are they samey because you *want* those same foods, or because you *dont* want other ones? if you had those foods *right* in front of you, would you eat them? even if it was disappointing, would you still be fine eating other (safe) foods, if they were what was available? \n\n\nin any case, i empathize with your situation, OP. with a lot of these kinds of comorbidities, it’s really hard to tell what’s causing what—and sometimes that’s because *everything* is contributing in some way. i hope you’re able to find some clarity 💪",
          "created_utc": 1639892673.0
        },
        {
          "id": "hp522w3",
          "author": "bubble6066",
          "body": "thank you so much for this response! I relate so much to what you said about the process of going to the dining hall LMAO. my first year away at college I lost a concerning amount of weight living in the dorms, due to the dining halls being far away or having shitty hours. I would get scattered and it would take too much effort to go and eat (I was always losing my keys as well lol). the food they were serving was just bad in quality and the preparation so it wasn’t that appetizing and caused demotivation to go at all.\n\nsince leaving the dorms I’ve struggled instead with grocery shopping without a car and preparing food consistently. I much prefer having a kitchen over the dining halls, but still struggle with eating enough and will forget to and get faint.\n\nbut as far as the samey foods go, I would 100% eat something else if it was available. I think it is because I want those particular things- I don’t not want everything else. I’m truly not a picky eater and there are few foods I find inherently bad if they’re well prepared, although I’ve been vegetarian for a few long periods in my life. \n\nI should add that I used to be a very picky eater and there were a number of foods I didn’t like up through my teens but I’ve completely lost that. I used to be made fun of for only liking Mac and cheese, didn’t like tomatoes or mushrooms for texture/taste reasons but I’ve gotten over it. my parents are also great cooks which I think helped me out. so I don’t know if this all disqualifies me from having ARFID and it is just ADD. the thing about “lack of interest in food” with this disorder is very much me though and I haven’t found much in the way of explanations for that. I think it might run deeper than just ADD but I am having trouble navigating the causes for it.",
          "created_utc": 1639894514.0
        }
      ]
    },
    {
      "id": "kz1iqkx",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1712818088.0,
      "score": 2,
      "context": [
        {
          "id": "hp4z8ps",
          "author": "crowcas",
          "body": "i have both ADHD and ARFID, and i do something kind of similar with the intermittent meals—if my routine gets messed up, i just don’t eat until either i’m so hungry i’m faint/hurting, or someone sits me down and tells me to eat. even now, i usually only have two meals a day, sometimes snacking between, sometimes not. \n\nthat being said, ive always attributed that to ADHD, and based on what you’ve said, especially with what you said about being away at school, i think that’s probably the case for you too. it sounds like it’s not the eating itself that you’re avoiding, so much as the process. especially with ADHD, things that are otherwise simple tasks are these arduous multi-step processes that feel like they take forever. \n\nthis is what my first year of college was like, if i was thinking about getting food (via dining hall): \n\n step 0 - find a good stopping point for the current activity. step 1 - get up. step 2 - find meal card. (step 2.5 - find keys. my student ID was both, so that was one less step for me) step 3 - go downstairs. step 4 - walk to dining hall. step 5 - realize that this dining hall closed twenty minutes ago. step 6 - cuss/cry about it. step 7 - look up which dining halls are still open. step 8 - go back to your room because you just don’t have the energy to go across campus for some shitty pizza and whatever other mediocre food they’re serving. \n\ni lost a lot of weight freshman year because my college’s dining hall was closed more than it was open, and the next nearest one was half a mile away. (i also lived on the sixth floor, and the elevator was usually out, which didn’t help with “i’ll just make a quick run to get some food”, knowing i had six flights of stairs waiting for me, but you get the point)\n\nthe samey foods thing is fairly common among ADHD and autism, so i guess it’s just a question of are they samey because you *want* those same foods, or because you *dont* want other ones? if you had those foods *right* in front of you, would you eat them? even if it was disappointing, would you still be fine eating other (safe) foods, if they were what was available? \n\n\nin any case, i empathize with your situation, OP. with a lot of these kinds of comorbidities, it’s really hard to tell what’s causing what—and sometimes that’s because *everything* is contributing in some way. i hope you’re able to find some clarity 💪",
          "created_utc": 1639892673.0
        },
        {
          "id": "hp522w3",
          "author": "bubble6066",
          "body": "thank you so much for this response! I relate so much to what you said about the process of going to the dining hall LMAO. my first year away at college I lost a concerning amount of weight living in the dorms, due to the dining halls being far away or having shitty hours. I would get scattered and it would take too much effort to go and eat (I was always losing my keys as well lol). the food they were serving was just bad in quality and the preparation so it wasn’t that appetizing and caused demotivation to go at all.\n\nsince leaving the dorms I’ve struggled instead with grocery shopping without a car and preparing food consistently. I much prefer having a kitchen over the dining halls, but still struggle with eating enough and will forget to and get faint.\n\nbut as far as the samey foods go, I would 100% eat something else if it was available. I think it is because I want those particular things- I don’t not want everything else. I’m truly not a picky eater and there are few foods I find inherently bad if they’re well prepared, although I’ve been vegetarian for a few long periods in my life. \n\nI should add that I used to be a very picky eater and there were a number of foods I didn’t like up through my teens but I’ve completely lost that. I used to be made fun of for only liking Mac and cheese, didn’t like tomatoes or mushrooms for texture/taste reasons but I’ve gotten over it. my parents are also great cooks which I think helped me out. so I don’t know if this all disqualifies me from having ARFID and it is just ADD. the thing about “lack of interest in food” with this disorder is very much me though and I haven’t found much in the way of explanations for that. I think it might run deeper than just ADD but I am having trouble navigating the causes for it.",
          "created_utc": 1639894514.0
        }
      ]
    }
  ]
}