{
  "id": "rl0hja",
  "subreddit": "ARFID",
  "author": "None",
  "created_utc": 1640043683.0,
  "title": "You guys need to read this. Have any of you ever heard of John Rosemond? He has some strong words to say about ARFID.",
  "selftext": "**I am so mad right now.  There is this man who gives parenting advice named John Rosemond.  Look at some of the things he said about ARFID.**\n\n**These are paragraphs from an article that he wrote about ARFID.  Here is the link if you want to read the whole thing:** [https://www.indexjournal.com/lifestyles/columnists/john-rosemond/john-rosemond-tackling-the-dreaded-arfid/article\\_893a04cb-a045-5482-affe-b81d445e9b04.html](https://www.indexjournal.com/lifestyles/columnists/john-rosemond/john-rosemond-tackling-the-dreaded-arfid/article_893a04cb-a045-5482-affe-b81d445e9b04.html) \n\n\"The latest manifestation of this fraud is Avoidant Restrictive Food Intake Disorder, or ARFID, formerly known as picky eating. Lots of university health centers and independent practitioners offer therapy for people of all ages whose parents never taught them that not eating what someone else, including one’s mother, has taken the time to prepare and serve is rude.\"\n\n\"Now, instead of picky eating being narcissistic and just plain rude, it is a psychological disorder that some people “have.” This ARFID thing has become big business, mind you.\"\n\n\"One psychologist, quoted in an online article, claims that picky eaters have control issues. That’s right. They have control over whether they eat broccoli and Brussels sprouts or not. They choose to be rude because they seek constant affirmation that their almighty feelings represent universal truths to which everyone else should genuflect.\"\n\n\"A true story: Once upon a time, a child became infested with ARFID demons at an early age. He would begin gagging and sobbing at the very sight of a food that caused his tongue to feel even slightly less than fully happy. His parents – bless their hearts – catered to the ARFID demons by feeding him only macaroni and cheese, French fries and fried chicken nuggets. Sure enough, the ARFID demons grew increasingly clamorous.\"\n\n\"By the time the parents sought my advice, the child was certifiably insufferable when it came to food. He was well on his way to becoming an adult whom no one wanted to be around if the event involved eating. I told the parents to (a) feed him only what they were eating, but in half-teaspoon portions; (b) set a timer for 15 minutes; (c) put him immediately to bed if he didn’t clean his plate before the time expired; and (d) let him have seconds of anything on his plate if he ate everything within the time allotted. Within a week, the ARFID demons had fled – demons cannot tolerate common sense – and said child was eating everything on his plate and asking for seconds.\"\n\n**After John Rosemond wrote this article, a petition was started by Laura Lyster-Mensh.  Here is the link if you want to sign:** [https://www.change.org/p/associated-press-apa-retract-picky-eating-article-ridiculing-children-with-mental-health-issues?utm\\_source=share\\_petition&utm\\_medium=custom\\_url&recruited\\_by\\_id=1e036a20-c391-012f](https://www.change.org/p/associated-press-apa-retract-picky-eating-article-ridiculing-children-with-mental-health-issues?utm_source=share_petition&utm_medium=custom_url&recruited_by_id=1e036a20-c391-012f)\n\n**Rosemond wrote another article about ARFID in response to this petition.  Here are some paragraphs from the newer article.  Link:** [https://www.indexjournal.com/lifestyles/columnists/john-rosemond/john-rosemond-arfid-is-a-fabrication/article\\_1fa59d58-15ed-5303-a98a-ade12f27b353.html](https://www.indexjournal.com/lifestyles/columnists/john-rosemond/john-rosemond-arfid-is-a-fabrication/article_1fa59d58-15ed-5303-a98a-ade12f27b353.html)\n\n\"Ah, but a mental health diagnosis refers to nothing other than a set of behaviors. The behaviors can certainly be verified — as in, “my child refuses to eat anything but junk food” — but no underlying, physiological cause has ever been proven for any mental health diagnosis. They don’t refer to conditions that some people “have,” although that is what mental health professionals want you to believe. Without any tangible evidence, they claim that their diagnoses reflect such things as biochemical imbalances and brain differences. The *fact* is that no one has ever proven that a mental health diagnosis represents something someone “has.”\n\n\"ARFID, like all mental health diagnoses, is a construct, a fabrication. The problem — as reflected in the feedback in question – is that parents would much rather believe their picky eaters “have” something that’s causing their tongues to reject normal food, than believe they created the problem by catering and enabling. One explanation absolves the parent of responsibility; the other does not. Which is more palatable, pun intended? Bingo!\"\n\n\"Per the Chinese adage again: Picky eating does not have to become “interesting.” It can be, and should be, nipped in the bud.\"\n\n**These articles are very sad and give people the wrong impression about people with ARFID (and that palatable joke was so RUDE).  If you can, please up vote this post and sign the petition.  Up voting the post will help more people become aware of the lies that John Rosemond (a somewhat famous person) is spreading through his articles.  Here is the link to the petition again if you would like to sign it:** [https://www.change.org/p/associated-press-apa-retract-picky-eating-article-ridiculing-children-with-mental-health-issues?utm\\_source=share\\_petition&utm\\_medium=custom\\_url&recruited\\_by\\_id=1e036a20-c391-012f](https://www.change.org/p/associated-press-apa-retract-picky-eating-article-ridiculing-children-with-mental-health-issues?utm_source=share_petition&utm_medium=custom_url&recruited_by_id=1e036a20-c391-012f)\n\n**Thank you so much for reading this!  Please comment below if this made you as mad as I was when I first read it.**",
  "url": "https://www.reddit.com/r/ARFID/comments/rl0hja/you_guys_need_to_read_this_have_any_of_you_ever/",
  "score": 98,
  "num_comments": 44,
  "comments": [
    {
      "id": "hpcyu5n",
      "author": "Fit-Distribution-252",
      "body": "My parents did do this and I wound up in the hospital, 80 lbs at 16, anemic, and malnourished. I chose death out of spite. Still would.",
      "created_utc": 1640044723.0,
      "score": 97,
      "context": []
    },
    {
      "id": "hpdfnx2",
      "author": "bewarethelemurs",
      "body": "What the fuck? This man has no idea what he's talking about",
      "created_utc": 1640052482.0,
      "score": 57,
      "context": []
    },
    {
      "id": "hpdo72v",
      "author": "TrentKama",
      "body": "Pay John Rosemond no mind. He's a piece of shit grifter who boasts 'the Christian way' of parenting by ignoring mental health and child physical and sexual abuse while parading corporal punishment. Fuck him.",
      "created_utc": 1640056422.0,
      "score": 44,
      "context": []
    },
    {
      "id": "hpdodpb",
      "author": "kaplowkabamm",
      "body": "Anybody else wanna help me find this dude and give him a swift kick in the face? /hj I hate people like this who don’t get that my brain isn’t just saying eww. It’s saying “DANGER!” with a dozen alarms going off at once and increasing my heart rate and blood pressure. I have a massive physical response and if I could snap my fingers and stop it, I would. Get a clue, John",
      "created_utc": 1640056506.0,
      "score": 35,
      "context": []
    },
    {
      "id": "hpe2ivw",
      "author": "flaiad",
      "body": "This doofus actually says that all mental health diagnoses are a fabrication, so I really can't take anything he says seriously.",
      "created_utc": 1640063650.0,
      "score": 30,
      "context": []
    },
    {
      "id": "hpdog8j",
      "author": "Kelekona",
      "body": "I talk about hoarders having trash demons, but that's to let people hate the problem without hating the parent.  And beating hoarding is mostly about emotional work, which does put responsibility on the sufferer.\n\nWith ARFID, it sounds like if emotional work was all it took, the sufferers would happily do it.  It sounds a little like phobia.  The person isn't refusing to put their hand into a box of scorpions because they decided to be rude, they're terrified.\n\nI'm hating that the person is trying to categorize mental health problems as a construct and a way to shirk responsibility for a moral problem.",
      "created_utc": 1640056538.0,
      "score": 23,
      "context": []
    },
    {
      "id": "hpdomo8",
      "author": "None",
      "body": "Yeah another old white dude makes a career talking out of his ass, preaching to a choir, causing more harm than good. What's new? His 'therapy' is basically just cognitive-behavioral without the empathy. I have no doubt starving your kid and taking away all their freedoms will work for some people (other kids might jump off a bridge, who knows?), but ultimately still doesn't solve the greater issue of the cause of ARFID. My intuition says anyone who is 'treated' with this method will have a horrendously unhealthy relationship with food the second they get away from their parents.",
      "created_utc": 1640056621.0,
      "score": 20,
      "context": []
    },
    {
      "id": "hpdnpee",
      "author": "Ruikiu",
      "body": "Signed it. But sadly those types of people never truely understand unless they suffer from the condition. More or less the same people saying that a rape is the victim's fault",
      "created_utc": 1640056199.0,
      "score": 17,
      "context": []
    },
    {
      "id": "hpeb67u",
      "author": "None",
      "body": "This is the most boomer shit I’ve ever heard…",
      "created_utc": 1640069200.0,
      "score": 15,
      "context": []
    },
    {
      "id": "hpec7d1",
      "author": "AlphaFoxZankee",
      "body": "Listen, Mr. Rosemond, if you have something that stops me from uncontrollable gagging and vomiting when I'm around my fear foods, you tell me. What's that? Slowly getting accustomed over years and years of therapy? How funny! Almost like it's a real disorder!",
      "created_utc": 1640069941.0,
      "score": 14,
      "context": []
    },
    {
      "id": "hpeax3r",
      "author": "floorenjoyer",
      "body": "According to what I assume is his wiki, this guy was a family THERAPIST at one point? Walking contradiction, for one, and secondly he is disgustingly underqualified based on his teachings that I'm familiar with (my friend has brought him up at a point before). It seems like he literally traipses around spewing child abuse as so-called parenting - even beyond his nonsense about ARFID. I pity the parents who fall for his gross rhetoric, and can't even begin to explain my feelings for the children in these circumstances. Horrific in so many ways.",
      "created_utc": 1640069018.0,
      "score": 11,
      "context": []
    },
    {
      "id": "hpebn95",
      "author": "floorenjoyer",
      "body": "This guy talking about the definitions of rudeness, and 'universal truths' is so absurd to me. Not like he's trying to enforce any of those in a rude manner or anything lmao /s",
      "created_utc": 1640069533.0,
      "score": 10,
      "context": []
    },
    {
      "id": "hpdnueb",
      "author": "feyre_0001",
      "body": "If anyone has a mental disorder, it’s this guy. I wonder why he’s so hot and bothered over people having eating disorders. Did his parents beat him for not cleaning his plate or something?",
      "created_utc": 1640056262.0,
      "score": 20,
      "context": []
    },
    {
      "id": "hpfrqzi",
      "author": "victorious-turnip",
      "body": "My parents did that until I sat at the dinner table for 36 hours straight and then they gave up. Before that they also tried holding me down and force feeding me. We don’t talk much anymore. \n\nThis dude sucks; he also clearly thinks of children as subjugates and not autonomous people. I can’t imagine reading this guys writing and thinking it sounds rational - anyone who agrees with him needs to go to therapy and figure out why they need so much control over their kids.",
      "created_utc": 1640102825.0,
      "score": 9,
      "context": []
    },
    {
      "id": "hpfc71u",
      "author": "TheRealSnowy",
      "body": "Only read the first quote and i have a subden urge to plan an assassination",
      "created_utc": 1640095913.0,
      "score": 8,
      "context": []
    },
    {
      "id": "hpe4ogj",
      "author": "creambunny",
      "body": "I had parents who did this basically with me. Guess who has fucked up eating habits now. I would love to eat but I literally starved myself during elementary and high school because I just couldn’t eat at home. none of this creates healthy food relationships. \n\nPlus this man is talking out of his ass. Half the time these parents can’t even fucking cook. Want your kid to eat more balanced meals? Figure out what textures and types of flavours they like. Unsalted chicken with canned veggies is gross for everyone. My dad hates broccoli stems but *thats* deemed unpicky. It’s only picky because kids/teens aren’t allowed a choice in what they prefer. Season your meals, cook things better (maybe softer veggies in soups), try hot sauce. This crusty white man probably makes his “good ol christian wife” do all the cooking lmfao",
      "created_utc": 1640064939.0,
      "score": 10,
      "context": []
    },
    {
      "id": "hpf6duj",
      "author": "hellokittycrackpipe",
      "body": "Yasss when I was a baby and refused to eat anything other than pancakes I totally did it to be rude",
      "created_utc": 1640092897.0,
      "score": 4,
      "context": []
    },
    {
      "id": "hpe3nnc",
      "author": "Equal-Ad-2193",
      "body": "This is one of my fears and it is one of the reason why it is hard to try new food and eat them with all this",
      "created_utc": 1640064316.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hpf0r96",
      "author": "Amekyras",
      "body": "[Look at the kind of people this guy usually associates with](https://youtu.be/ZUz1nCRJJBg)",
      "created_utc": 1640089493.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hpf3grq",
      "author": "YoWhatUpGlasgow",
      "body": "He's horrible, but not unique. I used to work very closely with psychiatrists and medical doctors who were retired from their profession but would be used in my industry to provide opinion. Such a large number basically had what they had learned at college as their viewpoint on 99% of issues regardless of how much of our understanding had changed in the 30 or 40 years since. We're talking a long list of mental health issues that simply weren't recognized as existing in say 1975, to these people they still didn't exist even if by that point there was 20 years of research into it.",
      "created_utc": 1640091186.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hpflanr",
      "author": "Mars_rocket",
      "body": "He doesn’t believe that mental health problems are real. That’s all I need to know to stop reading and start ignoring him.",
      "created_utc": 1640100088.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hpiy1mk",
      "author": "noahisafishie",
      "body": "There was usually always ONE thing on my plate I would eat, but my parents at one point got very attached to me finishing my plate and/or eating veggies/other unsafe foods. They would make the whole family, or at least one parent, sit at the table with me until I finished my plate or they gave up. I tried throwing mountains of salt on stuff, or butter, or cheese, but I couldn’t always choke it down (and I did choke down a fair bit, leading to a lot of issues). Sometimes they would make food they KNEW I wouldn’t eat (like sandwiches with mustard or whatever) and only have that, thinking it would get me to eat it. But I didn’t. I couldn’t.\nOne time during a broccoli battle, I actually threw up onto my plate because my gag reflex was triggered so hard. My dad yelled at me and they mostly gave up after that, but they always put food on my plate. It’s only recently when I spoke w my mom about eating issues that they’ve stopped that. My dad still gets feisty though.\nI could say more about this pattern during my time in the TTI, though that was staff, not my parents. But this comment is long enough lol.",
      "created_utc": 1640153045.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hpfm2w8",
      "author": "socialdotexe",
      "body": "What a wild ride of a read that was. At first, I was thinking... next-level troll, maybe? Then you got to the \"demons\" part and I nearly spit my drink out. LOL Oh boy, and I don't think he was being metaphorical. So, that made me laugh, to be completely honest. Then we got to the point where he had someone seek his advice and so I got pretty concerned about that. And then you got to the part about him basically attempting to go up against all of modern psychology and just... wow. And he's trying to say kids who are genuinely struggling and suffering are the ones who are full of it?\n\nUnfortunately, some people would probably take this kind of rhetoric seriously, so that's obviously a problem.\n\nI'll have to go through the links a bit later when I have more time.",
      "created_utc": 1640100428.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ituiyni",
      "author": "Business_State_6332",
      "body": "Horrifed. Arfid is not just picky eating. If you put down anything other then yogurt, waffles, or pasta I will not eat it. I'll sit there until I starve to death.",
      "created_utc": 1666787664.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hpiy3wb",
      "author": "noahisafishie",
      "body": "There was usually always ONE thing on my plate I would eat, but my parents at one point got very attached to me finishing my plate and/or eating veggies/other unsafe foods. They would make the whole family, or at least one parent, sit at the table with me until I finished my plate or they gave up. I tried throwing mountains of salt on stuff, or butter, or cheese, but I couldn’t always choke it down (and I did choke down a fair bit, leading to a lot of issues). Sometimes they would make food they KNEW I wouldn’t eat (like sandwiches with mustard or whatever) and only have that, thinking it would get me to eat it. But I didn’t. I couldn’t.\nOne time during a broccoli battle, I actually threw up onto my plate because my gag reflex was triggered so hard. My dad yelled at me and they mostly gave up after that, but they always put food on my plate. It’s only recently when I spoke w my mom about eating issues that they’ve stopped that. My dad still gets feisty though.\nI could say more about this pattern during my time in the TTI, though that was staff, not my parents. But this comment is long enough lol.",
      "created_utc": 1640153068.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k9wgyeq",
      "author": "rantinanton85",
      "body": "Rosemond is proof that some people should just not be allowed to have children.",
      "created_utc": 1700409783.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hpdyz1z",
      "author": "bfaithr",
      "body": "My parents did this until last year. I’m 23. It was very rare that I went to bed with a full stomach. I’m shocked I never ended up in the hospital. My BMI never went above 16 until a few months ago",
      "created_utc": 1640061655.0,
      "score": 31,
      "context": [
        {
          "id": "hpcyu5n",
          "author": "Fit-Distribution-252",
          "body": "My parents did do this and I wound up in the hospital, 80 lbs at 16, anemic, and malnourished. I chose death out of spite. Still would.",
          "created_utc": 1640044723.0
        }
      ]
    },
    {
      "id": "hpeb3g6",
      "author": "None",
      "body": "My parents attempted to do the same to get me out of “picky eating”. It never worked and I spent my entire childhood/teenhood underweight (and now at 21 I’m back there again). As a result, I was malnourished and didn’t develop as well as I should have. I learned some creative ways to get rid of food I couldn’t eat.",
      "created_utc": 1640069146.0,
      "score": 13,
      "context": [
        {
          "id": "hpcyu5n",
          "author": "Fit-Distribution-252",
          "body": "My parents did do this and I wound up in the hospital, 80 lbs at 16, anemic, and malnourished. I chose death out of spite. Still would.",
          "created_utc": 1640044723.0
        }
      ]
    },
    {
      "id": "hpfdiq1",
      "author": "None",
      "body": "My parents used to do this and they wonder why I am way below average weight for a fourteen year old.  I heard them talking about ARFID and how I have \"issues\" but they have not told me yet.\n\nAre you guys okay now though?  Just wondering. Sorry for what you went through. :(",
      "created_utc": 1640096557.0,
      "score": 7,
      "context": [
        {
          "id": "hpcyu5n",
          "author": "Fit-Distribution-252",
          "body": "My parents did do this and I wound up in the hospital, 80 lbs at 16, anemic, and malnourished. I chose death out of spite. Still would.",
          "created_utc": 1640044723.0
        }
      ]
    },
    {
      "id": "hpfa5ma",
      "author": "None",
      "body": "literally, what a twat",
      "created_utc": 1640094896.0,
      "score": 11,
      "context": [
        {
          "id": "hpdfnx2",
          "author": "bewarethelemurs",
          "body": "What the fuck? This man has no idea what he's talking about",
          "created_utc": 1640052482.0
        }
      ]
    },
    {
      "id": "lfld6dk",
      "author": "MaxMix3937",
      "body": "I've always wondered why you need a license to get a dog but not to have children. I wouldn't mind throwing him down the nearest flight of stairs.",
      "created_utc": 1722308352.0,
      "score": 1,
      "context": [
        {
          "id": "hpdodpb",
          "author": "kaplowkabamm",
          "body": "Anybody else wanna help me find this dude and give him a swift kick in the face? /hj I hate people like this who don’t get that my brain isn’t just saying eww. It’s saying “DANGER!” with a dozen alarms going off at once and increasing my heart rate and blood pressure. I have a massive physical response and if I could snap my fingers and stop it, I would. Get a clue, John",
          "created_utc": 1640056506.0
        }
      ]
    },
    {
      "id": "hpsgx1w",
      "author": "neko_mancy",
      "body": "i mean they are made up but like. in the same way language and money are made up",
      "created_utc": 1640336791.0,
      "score": 4,
      "context": [
        {
          "id": "hpe2ivw",
          "author": "flaiad",
          "body": "This doofus actually says that all mental health diagnoses are a fabrication, so I really can't take anything he says seriously.",
          "created_utc": 1640063650.0
        }
      ]
    },
    {
      "id": "hpff189",
      "author": "None",
      "body": "The petition is also trying to go to websites that have his ARFID articles.  He will probably never change, but the websites may remove the content.  At least I hope that these people see what the articles are doing and remove them.  Who knows.",
      "created_utc": 1640097271.0,
      "score": 5,
      "context": [
        {
          "id": "hpdnpee",
          "author": "Ruikiu",
          "body": "Signed it. But sadly those types of people never truely understand unless they suffer from the condition. More or less the same people saying that a rape is the victim's fault",
          "created_utc": 1640056199.0
        }
      ]
    },
    {
      "id": "hpeeihn",
      "author": "AlphaFoxZankee",
      "body": "Pretty sure it's that \"firsthand experiences\" problem again. Are they 100% reliable? No. People misremember, lie, see things with their own unique perspective. Does that mean they don't exist? Fuck no.\n\nJust because *you* don't experience it doesn't mean it doesn't exist. Just because it's not *tangible* doesn't mean it doesn't exist (that's the whole fucking point of mental disorders).",
      "created_utc": 1640071675.0,
      "score": 5,
      "context": [
        {
          "id": "hpec7d1",
          "author": "AlphaFoxZankee",
          "body": "Listen, Mr. Rosemond, if you have something that stops me from uncontrollable gagging and vomiting when I'm around my fear foods, you tell me. What's that? Slowly getting accustomed over years and years of therapy? How funny! Almost like it's a real disorder!",
          "created_utc": 1640069941.0
        }
      ]
    },
    {
      "id": "hpeuncu",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1640085044.0,
      "score": 4,
      "context": [
        {
          "id": "hpeax3r",
          "author": "floorenjoyer",
          "body": "According to what I assume is his wiki, this guy was a family THERAPIST at one point? Walking contradiction, for one, and secondly he is disgustingly underqualified based on his teachings that I'm familiar with (my friend has brought him up at a point before). It seems like he literally traipses around spewing child abuse as so-called parenting - even beyond his nonsense about ARFID. I pity the parents who fall for his gross rhetoric, and can't even begin to explain my feelings for the children in these circumstances. Horrific in so many ways.",
          "created_utc": 1640069018.0
        }
      ]
    },
    {
      "id": "hpffyeo",
      "author": "None",
      "body": "I bet he has a tragic super villain backstory...",
      "created_utc": 1640097699.0,
      "score": 7,
      "context": [
        {
          "id": "hpdnueb",
          "author": "feyre_0001",
          "body": "If anyone has a mental disorder, it’s this guy. I wonder why he’s so hot and bothered over people having eating disorders. Did his parents beat him for not cleaning his plate or something?",
          "created_utc": 1640056262.0
        }
      ]
    },
    {
      "id": "hpehysk",
      "author": "Fit-Distribution-252",
      "body": "I'm paralyzed from the waist down so my legs are atrophied to hell and back. Half my muscle mass is gone already so my normal weight is between 95 to 100. I literally can't afford to lose any weight. I have snacks around my room, just for me so I can graze if needed. I don't have any idea what the doctors would consider normal so I go with my normal.",
      "created_utc": 1640074404.0,
      "score": 16,
      "context": [
        {
          "id": "hpcyu5n",
          "author": "Fit-Distribution-252",
          "body": "My parents did do this and I wound up in the hospital, 80 lbs at 16, anemic, and malnourished. I chose death out of spite. Still would.",
          "created_utc": 1640044723.0
        },
        {
          "id": "hpdyz1z",
          "author": "bfaithr",
          "body": "My parents did this until last year. I’m 23. It was very rare that I went to bed with a full stomach. I’m shocked I never ended up in the hospital. My BMI never went above 16 until a few months ago",
          "created_utc": 1640061655.0
        }
      ]
    },
    {
      "id": "hpfeyu3",
      "author": "SeefoodDisco",
      "body": "The BMI isn't an accurate indicator of health, and it shouldn't be taken as such. It's useful for satiating your curiosity, but nothing more.",
      "created_utc": 1640097240.0,
      "score": -3,
      "context": [
        {
          "id": "hpcyu5n",
          "author": "Fit-Distribution-252",
          "body": "My parents did do this and I wound up in the hospital, 80 lbs at 16, anemic, and malnourished. I chose death out of spite. Still would.",
          "created_utc": 1640044723.0
        },
        {
          "id": "hpdyz1z",
          "author": "bfaithr",
          "body": "My parents did this until last year. I’m 23. It was very rare that I went to bed with a full stomach. I’m shocked I never ended up in the hospital. My BMI never went above 16 until a few months ago",
          "created_utc": 1640061655.0
        }
      ]
    },
    {
      "id": "hpehpji",
      "author": "Fit-Distribution-252",
      "body": "Dogs when I could and waiting them out. When they weren't watching, I'd hide it under one of their plates in the trash. I'd get caught sometimes but it was a risk I took. I couldn't sneak to get food because I use an electric wheelchair. It's loud. So I learned to ignore and starve.",
      "created_utc": 1640074195.0,
      "score": 10,
      "context": [
        {
          "id": "hpcyu5n",
          "author": "Fit-Distribution-252",
          "body": "My parents did do this and I wound up in the hospital, 80 lbs at 16, anemic, and malnourished. I chose death out of spite. Still would.",
          "created_utc": 1640044723.0
        },
        {
          "id": "hpeb3g6",
          "author": "None",
          "body": "My parents attempted to do the same to get me out of “picky eating”. It never worked and I spent my entire childhood/teenhood underweight (and now at 21 I’m back there again). As a result, I was malnourished and didn’t develop as well as I should have. I learned some creative ways to get rid of food I couldn’t eat.",
          "created_utc": 1640069146.0
        }
      ]
    },
    {
      "id": "hpfdyua",
      "author": "None",
      "body": "I used to shove food into my pockets and flush it down the toilet.  My parents would watch my dog so I couldn't give her any food.  I would also hide food in paper napkins and in chip bags.",
      "created_utc": 1640096771.0,
      "score": 7,
      "context": [
        {
          "id": "hpcyu5n",
          "author": "Fit-Distribution-252",
          "body": "My parents did do this and I wound up in the hospital, 80 lbs at 16, anemic, and malnourished. I chose death out of spite. Still would.",
          "created_utc": 1640044723.0
        },
        {
          "id": "hpeb3g6",
          "author": "None",
          "body": "My parents attempted to do the same to get me out of “picky eating”. It never worked and I spent my entire childhood/teenhood underweight (and now at 21 I’m back there again). As a result, I was malnourished and didn’t develop as well as I should have. I learned some creative ways to get rid of food I couldn’t eat.",
          "created_utc": 1640069146.0
        }
      ]
    },
    {
      "id": "hpg5csr",
      "author": "Fit-Distribution-252",
      "body": "I'm fine.  I'm free and able to eat properly, within reason now.  Controlling food was the issue.",
      "created_utc": 1640108282.0,
      "score": 2,
      "context": [
        {
          "id": "hpcyu5n",
          "author": "Fit-Distribution-252",
          "body": "My parents did do this and I wound up in the hospital, 80 lbs at 16, anemic, and malnourished. I chose death out of spite. Still would.",
          "created_utc": 1640044723.0
        },
        {
          "id": "hpfdiq1",
          "author": "None",
          "body": "My parents used to do this and they wonder why I am way below average weight for a fourteen year old.  I heard them talking about ARFID and how I have \"issues\" but they have not told me yet.\n\nAre you guys okay now though?  Just wondering. Sorry for what you went through. :(",
          "created_utc": 1640096557.0
        }
      ]
    },
    {
      "id": "hpffk25",
      "author": "None",
      "body": "Really? Did he get in trouble for something?",
      "created_utc": 1640097514.0,
      "score": 2,
      "context": [
        {
          "id": "hpeax3r",
          "author": "floorenjoyer",
          "body": "According to what I assume is his wiki, this guy was a family THERAPIST at one point? Walking contradiction, for one, and secondly he is disgustingly underqualified based on his teachings that I'm familiar with (my friend has brought him up at a point before). It seems like he literally traipses around spewing child abuse as so-called parenting - even beyond his nonsense about ARFID. I pity the parents who fall for his gross rhetoric, and can't even begin to explain my feelings for the children in these circumstances. Horrific in so many ways.",
          "created_utc": 1640069018.0
        },
        {
          "id": "hpeuncu",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1640085044.0
        }
      ]
    },
    {
      "id": "hph47tm",
      "author": "Jade-Balfour",
      "body": "Working with what you can do/eat is the way to do it. You’re doing good by keeping calories around to graze on",
      "created_utc": 1640122098.0,
      "score": 7,
      "context": [
        {
          "id": "hpcyu5n",
          "author": "Fit-Distribution-252",
          "body": "My parents did do this and I wound up in the hospital, 80 lbs at 16, anemic, and malnourished. I chose death out of spite. Still would.",
          "created_utc": 1640044723.0
        },
        {
          "id": "hpdyz1z",
          "author": "bfaithr",
          "body": "My parents did this until last year. I’m 23. It was very rare that I went to bed with a full stomach. I’m shocked I never ended up in the hospital. My BMI never went above 16 until a few months ago",
          "created_utc": 1640061655.0
        },
        {
          "id": "hpehysk",
          "author": "Fit-Distribution-252",
          "body": "I'm paralyzed from the waist down so my legs are atrophied to hell and back. Half my muscle mass is gone already so my normal weight is between 95 to 100. I literally can't afford to lose any weight. I have snacks around my room, just for me so I can graze if needed. I don't have any idea what the doctors would consider normal so I go with my normal.",
          "created_utc": 1640074404.0
        }
      ]
    },
    {
      "id": "hpffhwh",
      "author": "bfaithr",
      "body": "I understand that, I’m very healthy despite my weight. However, when my BMI is 15 for my entire life because I was rarely allowed to eat dinner, there’s an issue",
      "created_utc": 1640097486.0,
      "score": 10,
      "context": [
        {
          "id": "hpcyu5n",
          "author": "Fit-Distribution-252",
          "body": "My parents did do this and I wound up in the hospital, 80 lbs at 16, anemic, and malnourished. I chose death out of spite. Still would.",
          "created_utc": 1640044723.0
        },
        {
          "id": "hpdyz1z",
          "author": "bfaithr",
          "body": "My parents did this until last year. I’m 23. It was very rare that I went to bed with a full stomach. I’m shocked I never ended up in the hospital. My BMI never went above 16 until a few months ago",
          "created_utc": 1640061655.0
        },
        {
          "id": "hpfeyu3",
          "author": "SeefoodDisco",
          "body": "The BMI isn't an accurate indicator of health, and it shouldn't be taken as such. It's useful for satiating your curiosity, but nothing more.",
          "created_utc": 1640097240.0
        }
      ]
    }
  ]
}