{
  "id": "rpn31u",
  "subreddit": "ARFID",
  "author": "Kelekona",
  "created_utc": 1640610149.0,
  "title": "\"Picky Eaters\" The spirit is \"We shouldn't care about weirdness no matter what.\"",
  "selftext": "",
  "url": "https://i.redd.it/hb637f2k2x781.jpg",
  "score": 143,
  "num_comments": 3,
  "comments": [
    {
      "id": "hq883l4",
      "author": "saintceciliax",
      "body": "I am not autistic but I’ve felt this way about ARFID too. People will hate me for being a picky eater, and then I’ll say “I actually have this diagnosis which explains my behavior” and they’re like “ohh, well that’s fine then!”\n\nLike… why did I need to have a diagnosis for you to accept me? What if I was literally just a picky eater? You’d hate me for what I don’t like to eat?????",
      "created_utc": 1640659099.0,
      "score": 24,
      "context": []
    },
    {
      "id": "hq82ldo",
      "author": "small_pigeon",
      "body": "Yeah. As an autistic person with ARFID, people will shame me for being a “picky eater” until they find out I’m autistic and suddenly it’s not an issue anymore .. even if I wasn’t autistic, it shouldn’t matter if I’m “picky”. I definitely think that people need to care less about if others are “weird”, especially if it doesn’t affect them",
      "created_utc": 1640656600.0,
      "score": 18,
      "context": []
    },
    {
      "id": "hq89xnh",
      "author": "Kelekona",
      "body": "They want to blame a person for their moral failings, but a diagnosis means that they can't without picking on a disabled person.\n\nAn old joke in some fat-hating sub was \"muh genetiks\" and \"thyroid\" (maybe they changed in the years since I last read anything from them) but they wanted to make being fat about being lazy and a bad person.",
      "created_utc": 1640659929.0,
      "score": 12,
      "context": [
        {
          "id": "hq883l4",
          "author": "saintceciliax",
          "body": "I am not autistic but I’ve felt this way about ARFID too. People will hate me for being a picky eater, and then I’ll say “I actually have this diagnosis which explains my behavior” and they’re like “ohh, well that’s fine then!”\n\nLike… why did I need to have a diagnosis for you to accept me? What if I was literally just a picky eater? You’d hate me for what I don’t like to eat?????",
          "created_utc": 1640659099.0
        }
      ]
    }
  ]
}