{
  "id": "rzz1vm",
  "subreddit": "ARFID",
  "author": "ITriedSoHard419-68",
  "created_utc": 1641755773.0,
  "title": "Ableism against ARFID",
  "selftext": "As with a lot of us, I have a plethora of comorbidities. Autism, ADHD, generalized anxiety disorder, possibly depression...\n\nBut never, EVER, for any of those have I received the same level of vitriolic hatred I get about my ARFID.\n\nI am extremely open about all my diagnoses. They're in my bio on every website I'm on, including my Tiktok account which also has a video explaining that ovaltine chocolate milk is my most important safe-food and is basically carrying the team when it comes to getting a liveable amount of nutrients into my body. I eventually ended up privating that video. Why? Because *people were weaponizing it*. When I'd get into a disagreement with someone, they'd look through my profile, find that video, then go back to wherever I said something that pissed them off and reply along the lines of \"I hope you become allergic to chocolate milk.\"\n\n...I don't think I need to explain to other ARFID people everything that's wrong with that.\n\nMay I mention, this wasn't a one-off asshole; this happened multiple times to the point of privating the video because it just wasn't worth it anymore.\n\nBut the absolute worst tend to be the militant vegans. You know the type- meat is murder, abolish the meat industry, everyone should be vegan, all of that. Sometimes I try to educate them on why veganism isn't feasible for people like me, and today I got quite the doozy in response:\n\n>We need to continue factory farming animals because you will have panic attacks without access to cheap meat? r/unpopularopinion \\- you deserve panic attacks.\n\nI've had several other militant vegans come at me for my stances, but this is the first time I've been explicitly told I deserve the suffering. I've been overlooked as collateral damage to save the animals, I've been told \"just go get treatment it's not that hard\", but I've never had one of these people so blatantly wish harm on me. But something that is consistent with these types of people is the aforementioned viewing me as collateral damage. Not caring if I die, if it gets their goal met. I tell them I'd literally die of starvation if I cut the meat products from my diet, and I get told \"too bad\". Implying that my life is meaningless, not worth saving, because I have a crippling disorder.\n\nThere was also a post on r/unpopularopinion a while back where someone said adult picky eaters deserve to be publicly shamed. If someone said what they said in that post about people with autism or something, they would have been *crucified*. The post would have been removed and everyone would've been calling it what it is: ableism.\n\nFor all the disorders I have, ARFID is the only one I've explicitly had harm wished upon me for. People want me *dead* for my ARFID. People want me publicly shamed, people want me in pain, people want me to suffer for existing with this condition. In a way I've never experienced with any other disorder I have.\n\nSo, why does no one ever talk about that? Does mental health not matter when it's a disorder no one's heard of? Does mental health not matter when it's us?",
  "url": "https://www.reddit.com/r/ARFID/comments/rzz1vm/ableism_against_arfid/",
  "score": 154,
  "num_comments": 46,
  "comments": [
    {
      "id": "hryb6tt",
      "author": "grimmistired",
      "body": "For some reason there's a bizarre culture around food. Like if you don't eat certain things some people actually get offended or angry.. wack",
      "created_utc": 1641756299.0,
      "score": 112,
      "context": []
    },
    {
      "id": "hrysq6f",
      "author": "tharrison4815",
      "body": "As a vegan I can say that they are either misunderstanding the severity of ARFID or they are misunderstanding the definition of veganism.\n\nVeganism is and has always been about doing your best with what's possible to minimise animal exploitation.\n\nAlthough as vegans we think animal lives are more important than taste pleasure, we also think that human life is more important than animal life. You aren't making a choice to have animal products because you simply prefer them. You actually don't have a choice.\n\nI hope that one day the world becomes vegan enough that there are more options and more potential vegan safe foods so you are at least able to make that choice. Until then keep doing what you have to do to survive.",
      "created_utc": 1641762474.0,
      "score": 42,
      "context": []
    },
    {
      "id": "hrymk3b",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1641760320.0,
      "score": 32,
      "context": []
    },
    {
      "id": "hrz2950",
      "author": "SeefoodDisco",
      "body": "While I agree with some vegans on some things (the meat industry is bad, the unethical treatment of animals is bad, capitalism is bad, etc.), there are just a lot of privileged doofus vegans out there who just don't understand how the real world works. The type who think that if everyone goes vegan then the world will be better just don't understand that meat products aren't the only thing that's even vaguely hurting the world rn. They're naive and complete dicknozzles.",
      "created_utc": 1641765886.0,
      "score": 23,
      "context": []
    },
    {
      "id": "hrywg3o",
      "author": "ITriedSoHard419-68",
      "body": "I've noticed some people are making this comment section mostly about veganism. Though bastardized vegan ideas do contribute heavily, the point of this post was not solely calling out vegans but just how intense ableism against ARFID is as a whole.",
      "created_utc": 1641763833.0,
      "score": 21,
      "context": []
    },
    {
      "id": "hryylwa",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1641764588.0,
      "score": 28,
      "context": []
    },
    {
      "id": "hs03wrh",
      "author": "Kofukura",
      "body": "I was a vegetarian for 6 years until recently. My ARFID started getting really severe, and I lost 16 pounds. Eating “cheap meat” literally saved my life. I will go back to being a vegetarian when I am treated, but right now, I need to put my health first and be selfish so I don’t end up in the hospital. I am nothing but thankful to all the animals who lost their lives to save mine.",
      "created_utc": 1641780214.0,
      "score": 10,
      "context": []
    },
    {
      "id": "hs14p3p",
      "author": "_jspain",
      "body": "i love showing them the receipts from the $100,000 of quality ARFID treatment i got every day over 8 weeks last summer that ... did nothing </3 Yeah girl let me just get better real quick do you have $100,000 to give me?\n\nalso re: militant vegans. many of them are repulsed by the thought of eating flesh but can't imagine feeling that way about a vegetable even though it should be really easy imo. shoutout to vegans who actually value human beings tho like my sexy boyfriend who i love",
      "created_utc": 1641796508.0,
      "score": 8,
      "context": []
    },
    {
      "id": "hs1ga65",
      "author": "Possible_Parrot",
      "body": "Dude, I feel this. I've always gotten weird looks or comments about the way I eat. I even got into a argument with my BF just the other day about it. He managed to get me to try broccoli and cheese, and when I didn't like it he got mad instead of being happy that I faced a legit fear and issue. Like yeah, I took my sweet time getting to it, but I had to work up the courage. But the thing that *really* pissed me off was him saying \"you act like it's a dragon\". It fucking *is a dragon* to me, it's hard as hell and I'm already ashamed of it, and stuff like that makes me want to stay in my safe food space even more.",
      "created_utc": 1641804090.0,
      "score": 7,
      "context": []
    },
    {
      "id": "hrzwmp7",
      "author": "helpmeimconcerned",
      "body": "I'm sorry you had to experience this. Some people are ignorant assholes with a superiority complex. I've tried to explain it to people especially the issue around not being able to drop all animal products but some just aren't interested in hearing anything that disagrees with their opinion. Feel free to message me if you need to rant or need any support!",
      "created_utc": 1641777274.0,
      "score": 6,
      "context": []
    },
    {
      "id": "hs1ewmo",
      "author": "sarahelizam",
      "body": "My husband may or may not technically have ARFID, but he has some severe neurological shit and very similar symptoms (and he and his docs consider it similar enough). I try to chime in in general defense when “picky eating” is brought up because it’s sickening how much he has to deal with and he has given me a lot of detail to help my outsider perspective. I keep it simple and mostly stick to calling out the blatantly ableist. There are a couple things in my life that make me a good target for online harassment (being trans and BPD are favorites), but I swear I get 10x the vitriol for his eating disorder. I have been told I am abusive for “enabling” him, I shit you not. Absolutely stunningly stupid.",
      "created_utc": 1641803089.0,
      "score": 5,
      "context": []
    },
    {
      "id": "hryuexa",
      "author": "None",
      "body": "Militant vegan here:\n\nI love you and good job.",
      "created_utc": 1641763086.0,
      "score": 10,
      "context": []
    },
    {
      "id": "hs26x71",
      "author": "Kyarmak",
      "body": "Why can't they just understand that I eat only to live, eating is not a thing I'm happy about, I don't want to go to the restaurant, I don't want to eat at your parents house just leave me alone with my crackers",
      "created_utc": 1641821785.0,
      "score": 5,
      "context": []
    },
    {
      "id": "hryfemk",
      "author": "your_death12",
      "body": "vegans are such weird people, they pretend to love every living thing but then they pull shit like this and it makes me sick. just know that me and everyone on this sub supports you!",
      "created_utc": 1641757796.0,
      "score": 12,
      "context": []
    },
    {
      "id": "hs03n2u",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1641780103.0,
      "score": 6,
      "context": []
    },
    {
      "id": "hs1d4gp",
      "author": "Equal-Ad-2193",
      "body": "It is hard for someone with no experience with mental illnesses to understand. The best you can do(probably)is educate them about it, like when someone criticise you because of ARFID, tell them more about ARFID and why they are wrong, be patient with them so you at least can prevent others from getting hurt. It is hard to deal with this but you are not alone, just remember there are people out there that understand you. Good luck",
      "created_utc": 1641801837.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hs46kqr",
      "author": "broken_krystal_ball",
      "body": "\"just go get treatment,\" \n\n*Treatment facilities refuse anyone over the age of 10*",
      "created_utc": 1641849027.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hsfyjr3",
      "author": "i_enjoy_music_n_stuf",
      "body": "the other day someone told me my life was important, but it doesn’t justify murder. they then told me that i can stomach and food and be fine. no i can’t, if it’s not a safe food it won’t make it down my thought before i yack. i told them i’d starve and they said it’s my fault for having suck extreme preferences. i asked him if he would say that to someone with anorexia or bolimia because they’re all eating disorders. he responded with yes he would because it is. they really did mental gymnastics so hard to prove me wrong that they justified me starving me having to being alive through tubes in my throat if i went vegan, and then ended with a passive aggressive i hope you get the help you need to stop murdering hundreds of animals a year. BITCH my meat intake is pepperoni pizza and mcdonald’s chicken nuggets i’ve maybe eaten 5 animals in my entire fucking life",
      "created_utc": 1642045673.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hrzs86p",
      "author": "teureg",
      "body": "Tbh most vegans are just a bunch of stuck ups with a guilty conscience and a moral superiority complex as a result.",
      "created_utc": 1641775514.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hs0xss4",
      "author": "Orgone_Wolfie_Waxson",
      "body": "i get this alot with meat. I don't like any seafood except for tuna (but only if its in a pasta i make- nobody else).  \ni only like beef if its cooked right through, if i see steak with any pink in it, i feel sick just looking at it. this has been used against me plenty of time because i like my meat chewy, its the only texture i like from steak. if it's 'juicy' (eww), or red juices are dripping from it, in my mind it sees it as blood. i know it isnt blood but might aswell be.   \nI also hate seasoned food. I never add salt to home cooked things, or pepper or anything else. even a tiny it of it makes the food revoulting. And yes this goes for during the cooking process and after it. I can only eat blander food because my senses just go through the roof otherwise. stronger tasting foods are to much for me. To sour, to sweet, top spicy, too salty- it has to be as little of everything as possible.\n\na lot of my ARFID is linked against interpersonal racism i go through too. 'white people cant season, white people don't know good food, oh of course you dislike this- you're white' and so on. it fucking sucks and its makes it really hard for me to talk food- probably the biggest thing humans can connect over ever- with anyone.  \n\n\nAlso the idea fat people cant have arfid. sure it might be more likely for people to be on the thinner side of things when it comes to arfid but that's because arfid was mischaracterizes as only a 'thin person thing' for ages. if your safe foods are all unhealthy foods (full os sugars, processed etc- like mine are) and its all you eat and you have no bearing on calory counting, ofc you'd be on the heavier side like i am.  \n\n\nalso body dysphoria/dysmophia- yaaaay.\n\n^((i know there might be one person who thinks 'whites cant experience racism' but i'd like to you just re consider what racism is, and that anybody can experience interpersonal racism.))",
      "created_utc": 1641792741.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hryy1s6",
      "author": "RhenHarper",
      "body": "Absolutely. I hate that everything revolves around food. \n\nCatching up with friends? You grab lunch. \nFirst meet up/date? Dinner or maybe drink/apps. \nFamily reunion? Lots of food. \nParty? Food again. \nWork meeting? More eating. \n\nTalk about never wanting to be around people. Everyone always has to comment about your plate.",
      "created_utc": 1641764389.0,
      "score": 58,
      "context": [
        {
          "id": "hryb6tt",
          "author": "grimmistired",
          "body": "For some reason there's a bizarre culture around food. Like if you don't eat certain things some people actually get offended or angry.. wack",
          "created_utc": 1641756299.0
        }
      ]
    },
    {
      "id": "hsd7o37",
      "author": "daydreamer_35",
      "body": "Absolutely omg ,in my country if you go to someone's house and refuse food ,it's like you are insulting them ,I HATE it so much",
      "created_utc": 1642005734.0,
      "score": 6,
      "context": [
        {
          "id": "hryb6tt",
          "author": "grimmistired",
          "body": "For some reason there's a bizarre culture around food. Like if you don't eat certain things some people actually get offended or angry.. wack",
          "created_utc": 1641756299.0
        }
      ]
    },
    {
      "id": "i01qvy0",
      "author": "wzy519",
      "body": "It’s because picky eating is often a front for racism or ethnocentric views around food, I think that’s the main reason why some ppl get offended when ppl don’t try a new food or express disgust. Cuz if we’re being completely real, it’s predominantly non-western food that gets the gag or disgust treatment",
      "created_utc": 1646874285.0,
      "score": 0,
      "context": [
        {
          "id": "hryb6tt",
          "author": "grimmistired",
          "body": "For some reason there's a bizarre culture around food. Like if you don't eat certain things some people actually get offended or angry.. wack",
          "created_utc": 1641756299.0
        }
      ]
    },
    {
      "id": "hryttt1",
      "author": "ITriedSoHard419-68",
      "body": "I'm gonna lean towards \"misunderstanding of the definition of veganism\"- I could explain how severe ARFID is in detail, but then I just get responses like the \"you deserve the panic attacks\" guy. These people are more than ignorant, they're batty.\n\nAlso props to you on managing to make a vegan lifestyle work with ARFID, I really admire that. More power to you!",
      "created_utc": 1641762871.0,
      "score": 27,
      "context": [
        {
          "id": "hrysq6f",
          "author": "tharrison4815",
          "body": "As a vegan I can say that they are either misunderstanding the severity of ARFID or they are misunderstanding the definition of veganism.\n\nVeganism is and has always been about doing your best with what's possible to minimise animal exploitation.\n\nAlthough as vegans we think animal lives are more important than taste pleasure, we also think that human life is more important than animal life. You aren't making a choice to have animal products because you simply prefer them. You actually don't have a choice.\n\nI hope that one day the world becomes vegan enough that there are more options and more potential vegan safe foods so you are at least able to make that choice. Until then keep doing what you have to do to survive.",
          "created_utc": 1641762474.0
        }
      ]
    },
    {
      "id": "hrynsyg",
      "author": "ITriedSoHard419-68",
      "body": "Oh my god the \"how could you not like X?!?!\" is so annoying. I always heard it about pizza growing up, since apparently ALL kids should like pizza. I forgive that though, since it was just annoying and also the people asking were usually kids, who don't know better and have no filter. What bothers me is when grown adults do it.\n\nAnd I think something a lot of people don't realize with your chocolate shard situation is the obsession with \"contamination\" that some people with ARFID have. It doesn't matter if you remove the chocolate, brain will still say \"ew there's 3 molecules of chocolate left in there the whole icecream is contaminated\" and not let them eat it. Foods touching other foods used to be a HUGE no-no for me, I wouldn't eat something if I saw a non-safe food touch it. I'm a lot better with that now, but not everyone is so lucky. I wish people understood.",
      "created_utc": 1641760753.0,
      "score": 30,
      "context": [
        {
          "id": "hrymk3b",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1641760320.0
        }
      ]
    },
    {
      "id": "hrzfj36",
      "author": "FurretsOotersMinks",
      "body": "I tried to have a discussion about how simple some improvements would be for the meat industry and got tons of shit for it because I said it's not feasible to expect the meat industry to stop in our lifetime. In my field, that's like asking politely to stop all biodiversity loss, it's just not realistic to expect that. At have to triage our problems and work on mitigating the negative impact rather than abolishing the problem altogether.\n\nIt's the all or nothing fallacy to those vegans. You either want to stop the meat industry or wish for all the horrible practices to continue.",
      "created_utc": 1641770740.0,
      "score": 9,
      "context": [
        {
          "id": "hrz2950",
          "author": "SeefoodDisco",
          "body": "While I agree with some vegans on some things (the meat industry is bad, the unethical treatment of animals is bad, capitalism is bad, etc.), there are just a lot of privileged doofus vegans out there who just don't understand how the real world works. The type who think that if everyone goes vegan then the world will be better just don't understand that meat products aren't the only thing that's even vaguely hurting the world rn. They're naive and complete dicknozzles.",
          "created_utc": 1641765886.0
        }
      ]
    },
    {
      "id": "hrz2kvs",
      "author": "ITriedSoHard419-68",
      "body": "Completely agreed.",
      "created_utc": 1641766003.0,
      "score": 3,
      "context": [
        {
          "id": "hrz2950",
          "author": "SeefoodDisco",
          "body": "While I agree with some vegans on some things (the meat industry is bad, the unethical treatment of animals is bad, capitalism is bad, etc.), there are just a lot of privileged doofus vegans out there who just don't understand how the real world works. The type who think that if everyone goes vegan then the world will be better just don't understand that meat products aren't the only thing that's even vaguely hurting the world rn. They're naive and complete dicknozzles.",
          "created_utc": 1641765886.0
        }
      ]
    },
    {
      "id": "hryyqcr",
      "author": "ITriedSoHard419-68",
      "body": "ARFID being a neurological condition makes sense, considering it often overlaps with autism. It also explains why people with ARFID tend to be much harder to treat than people with other EDs, being more likely to need feeding tubes and stuff. It's hard to rewire the brain.",
      "created_utc": 1641764631.0,
      "score": 25,
      "context": [
        {
          "id": "hryylwa",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1641764588.0
        }
      ]
    },
    {
      "id": "hs21b04",
      "author": "ITriedSoHard419-68",
      "body": "See, you get it. As soon as it’s about food people become 10x more horrible. \n\nThank you for sticking up for your husband and being supportive.",
      "created_utc": 1641818858.0,
      "score": 4,
      "context": [
        {
          "id": "hs1ewmo",
          "author": "sarahelizam",
          "body": "My husband may or may not technically have ARFID, but he has some severe neurological shit and very similar symptoms (and he and his docs consider it similar enough). I try to chime in in general defense when “picky eating” is brought up because it’s sickening how much he has to deal with and he has given me a lot of detail to help my outsider perspective. I keep it simple and mostly stick to calling out the blatantly ableist. There are a couple things in my life that make me a good target for online harassment (being trans and BPD are favorites), but I swear I get 10x the vitriol for his eating disorder. I have been told I am abusive for “enabling” him, I shit you not. Absolutely stunningly stupid.",
          "created_utc": 1641803089.0
        }
      ]
    },
    {
      "id": "hs14te5",
      "author": "_jspain",
      "body": "when i see a tweet or tiktok mocking a picky eater i just comment google arfid and hope that educates at least some people who come across it bc that's all the time i have for them",
      "created_utc": 1641796580.0,
      "score": 9,
      "context": [
        {
          "id": "hs03n2u",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1641780103.0
        }
      ]
    },
    {
      "id": "hsfzom2",
      "author": "ITriedSoHard419-68",
      "body": "Oh my god I get the passive aggressive \"i hope you get the help you need to stop murdering\" one all the damn time. It's infuriating. It's patronizing and backhanded as all hell.",
      "created_utc": 1642046213.0,
      "score": 2,
      "context": [
        {
          "id": "hsfyjr3",
          "author": "i_enjoy_music_n_stuf",
          "body": "the other day someone told me my life was important, but it doesn’t justify murder. they then told me that i can stomach and food and be fine. no i can’t, if it’s not a safe food it won’t make it down my thought before i yack. i told them i’d starve and they said it’s my fault for having suck extreme preferences. i asked him if he would say that to someone with anorexia or bolimia because they’re all eating disorders. he responded with yes he would because it is. they really did mental gymnastics so hard to prove me wrong that they justified me starving me having to being alive through tubes in my throat if i went vegan, and then ended with a passive aggressive i hope you get the help you need to stop murdering hundreds of animals a year. BITCH my meat intake is pepperoni pizza and mcdonald’s chicken nuggets i’ve maybe eaten 5 animals in my entire fucking life",
          "created_utc": 1642045673.0
        }
      ]
    },
    {
      "id": "hrzgvfs",
      "author": "ITriedSoHard419-68",
      "body": "My college did an \"inclusive\" program for people from marginalized groups, including the disabled and neurodivergent. They weren't as \"inclusive\" with those subjects as they thought they were. Most of those stories are for another day, but one of them was that there were mandatory weekly lunch events. WHY?! WHY DID IT HAVE TO BE LUNCHES?! WHY DID IT HAVE TO BE MANDATORY?!\n\nI explained my disorder to them and asked to be excused from those lunches, and they said they'd negotiate it with me in a private meeting. That private meeting never came. I quit the program.",
      "created_utc": 1641771250.0,
      "score": 29,
      "context": [
        {
          "id": "hryb6tt",
          "author": "grimmistired",
          "body": "For some reason there's a bizarre culture around food. Like if you don't eat certain things some people actually get offended or angry.. wack",
          "created_utc": 1641756299.0
        },
        {
          "id": "hryy1s6",
          "author": "RhenHarper",
          "body": "Absolutely. I hate that everything revolves around food. \n\nCatching up with friends? You grab lunch. \nFirst meet up/date? Dinner or maybe drink/apps. \nFamily reunion? Lots of food. \nParty? Food again. \nWork meeting? More eating. \n\nTalk about never wanting to be around people. Everyone always has to comment about your plate.",
          "created_utc": 1641764389.0
        }
      ]
    },
    {
      "id": "hryyff5",
      "author": "grimmistired",
      "body": "There are people who won't judge! The issue is finding them",
      "created_utc": 1641764525.0,
      "score": 22,
      "context": [
        {
          "id": "hryb6tt",
          "author": "grimmistired",
          "body": "For some reason there's a bizarre culture around food. Like if you don't eat certain things some people actually get offended or angry.. wack",
          "created_utc": 1641756299.0
        },
        {
          "id": "hryy1s6",
          "author": "RhenHarper",
          "body": "Absolutely. I hate that everything revolves around food. \n\nCatching up with friends? You grab lunch. \nFirst meet up/date? Dinner or maybe drink/apps. \nFamily reunion? Lots of food. \nParty? Food again. \nWork meeting? More eating. \n\nTalk about never wanting to be around people. Everyone always has to comment about your plate.",
          "created_utc": 1641764389.0
        }
      ]
    },
    {
      "id": "jghhoi2",
      "author": "None",
      "body": "Let's also be real, ARFID is a primarily western diagnosis whose safe foods are primarily western and highly processed fast foods stuff - white foods like bread and potatoes, lots of cheese, and I've literally seen McDonds listed as a safe food and \"ethnic\" foods as unsafe. Seems a bit odd.",
      "created_utc": 1681655536.0,
      "score": 1,
      "context": [
        {
          "id": "hryb6tt",
          "author": "grimmistired",
          "body": "For some reason there's a bizarre culture around food. Like if you don't eat certain things some people actually get offended or angry.. wack",
          "created_utc": 1641756299.0
        },
        {
          "id": "i01qvy0",
          "author": "wzy519",
          "body": "It’s because picky eating is often a front for racism or ethnocentric views around food, I think that’s the main reason why some ppl get offended when ppl don’t try a new food or express disgust. Cuz if we’re being completely real, it’s predominantly non-western food that gets the gag or disgust treatment",
          "created_utc": 1646874285.0
        }
      ]
    },
    {
      "id": "hrzvsth",
      "author": "helpmeimconcerned",
      "body": "Yes omg I had this contamination obsession so bad until a few years ago. I still have it but only with certain things now. I wish people wouldn't draw so much attention to someone who orders something plain it just makes the situation so awkward.",
      "created_utc": 1641776935.0,
      "score": 8,
      "context": [
        {
          "id": "hrymk3b",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1641760320.0
        },
        {
          "id": "hrynsyg",
          "author": "ITriedSoHard419-68",
          "body": "Oh my god the \"how could you not like X?!?!\" is so annoying. I always heard it about pizza growing up, since apparently ALL kids should like pizza. I forgive that though, since it was just annoying and also the people asking were usually kids, who don't know better and have no filter. What bothers me is when grown adults do it.\n\nAnd I think something a lot of people don't realize with your chocolate shard situation is the obsession with \"contamination\" that some people with ARFID have. It doesn't matter if you remove the chocolate, brain will still say \"ew there's 3 molecules of chocolate left in there the whole icecream is contaminated\" and not let them eat it. Foods touching other foods used to be a HUGE no-no for me, I wouldn't eat something if I saw a non-safe food touch it. I'm a lot better with that now, but not everyone is so lucky. I wish people understood.",
          "created_utc": 1641760753.0
        }
      ]
    },
    {
      "id": "hs0hgj2",
      "author": "ThrowItAllAway003",
      "body": "Ugh mine is lettuce. I can tell if lettuce has been even near the stuff that’s in my food. Fast TexMex restaurants tend to be the worst. Lettuce is almost always by the cheese so it ends up in the cheese, then my whole taco tastes like freaking lettuce. Then I have to spit it out and toss it.",
      "created_utc": 1641785730.0,
      "score": 6,
      "context": [
        {
          "id": "hrymk3b",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1641760320.0
        },
        {
          "id": "hrynsyg",
          "author": "ITriedSoHard419-68",
          "body": "Oh my god the \"how could you not like X?!?!\" is so annoying. I always heard it about pizza growing up, since apparently ALL kids should like pizza. I forgive that though, since it was just annoying and also the people asking were usually kids, who don't know better and have no filter. What bothers me is when grown adults do it.\n\nAnd I think something a lot of people don't realize with your chocolate shard situation is the obsession with \"contamination\" that some people with ARFID have. It doesn't matter if you remove the chocolate, brain will still say \"ew there's 3 molecules of chocolate left in there the whole icecream is contaminated\" and not let them eat it. Foods touching other foods used to be a HUGE no-no for me, I wouldn't eat something if I saw a non-safe food touch it. I'm a lot better with that now, but not everyone is so lucky. I wish people understood.",
          "created_utc": 1641760753.0
        }
      ]
    },
    {
      "id": "hs4m5n1",
      "author": "sarahelizam",
      "body": "Always! I try to be careful not to speak *for* the people experiencing something I myself don’t, but I am armed with enough information that its worth sharing and running interference. You all shouldn’t always have to be the ones dealing with this on your own. I’m sorry for the haters, I hope you’re well :)",
      "created_utc": 1641854901.0,
      "score": 3,
      "context": [
        {
          "id": "hs1ewmo",
          "author": "sarahelizam",
          "body": "My husband may or may not technically have ARFID, but he has some severe neurological shit and very similar symptoms (and he and his docs consider it similar enough). I try to chime in in general defense when “picky eating” is brought up because it’s sickening how much he has to deal with and he has given me a lot of detail to help my outsider perspective. I keep it simple and mostly stick to calling out the blatantly ableist. There are a couple things in my life that make me a good target for online harassment (being trans and BPD are favorites), but I swear I get 10x the vitriol for his eating disorder. I have been told I am abusive for “enabling” him, I shit you not. Absolutely stunningly stupid.",
          "created_utc": 1641803089.0
        },
        {
          "id": "hs21b04",
          "author": "ITriedSoHard419-68",
          "body": "See, you get it. As soon as it’s about food people become 10x more horrible. \n\nThank you for sticking up for your husband and being supportive.",
          "created_utc": 1641818858.0
        }
      ]
    },
    {
      "id": "hsg51zw",
      "author": "i_enjoy_music_n_stuf",
      "body": "i always try to start if respectful and they just diminish this horrible struggle i’ve dealt with my entire life because they physically can not comprehend that not everyone eats what they do for flavor. idk if i even like the taste of kraft mac and cheese anymore, i can tolerate it tho. my diet is like 70% dairy 20% idk why i eat this but i’ve been able to stomach it my entire life, and 10% and pills for vitamins, supplements, and basically everything else you can’t get from mostly dairy. on top of that i’m lactose intolerant. so like don’t you think if i could go vegan i would like i fucking hate this and they literally just go like “hehe well your life can be a sacrifice for the animals good if it’s necessary” bullshit. and honestly i wouldn’t have a problem if they didn’t expect that everyone who isn’t vegan is selfish and cruel. so yeah honestly if i could go vegan i would  for my own fucking health in terms of lactose and shit and for the damage my body has already gotten from 20 years of arfid but it’s not that fucking easy",
      "created_utc": 1642048879.0,
      "score": 2,
      "context": [
        {
          "id": "hsfyjr3",
          "author": "i_enjoy_music_n_stuf",
          "body": "the other day someone told me my life was important, but it doesn’t justify murder. they then told me that i can stomach and food and be fine. no i can’t, if it’s not a safe food it won’t make it down my thought before i yack. i told them i’d starve and they said it’s my fault for having suck extreme preferences. i asked him if he would say that to someone with anorexia or bolimia because they’re all eating disorders. he responded with yes he would because it is. they really did mental gymnastics so hard to prove me wrong that they justified me starving me having to being alive through tubes in my throat if i went vegan, and then ended with a passive aggressive i hope you get the help you need to stop murdering hundreds of animals a year. BITCH my meat intake is pepperoni pizza and mcdonald’s chicken nuggets i’ve maybe eaten 5 animals in my entire fucking life",
          "created_utc": 1642045673.0
        },
        {
          "id": "hsfzom2",
          "author": "ITriedSoHard419-68",
          "body": "Oh my god I get the passive aggressive \"i hope you get the help you need to stop murdering\" one all the damn time. It's infuriating. It's patronizing and backhanded as all hell.",
          "created_utc": 1642046213.0
        }
      ]
    },
    {
      "id": "hrzj2rb",
      "author": "RhenHarper",
      "body": "I know people think that providing free food is a “nice” thing to do but it’s pretty awful when you’re forced to participate.",
      "created_utc": 1641772072.0,
      "score": 24,
      "context": [
        {
          "id": "hryb6tt",
          "author": "grimmistired",
          "body": "For some reason there's a bizarre culture around food. Like if you don't eat certain things some people actually get offended or angry.. wack",
          "created_utc": 1641756299.0
        },
        {
          "id": "hryy1s6",
          "author": "RhenHarper",
          "body": "Absolutely. I hate that everything revolves around food. \n\nCatching up with friends? You grab lunch. \nFirst meet up/date? Dinner or maybe drink/apps. \nFamily reunion? Lots of food. \nParty? Food again. \nWork meeting? More eating. \n\nTalk about never wanting to be around people. Everyone always has to comment about your plate.",
          "created_utc": 1641764389.0
        },
        {
          "id": "hrzgvfs",
          "author": "ITriedSoHard419-68",
          "body": "My college did an \"inclusive\" program for people from marginalized groups, including the disabled and neurodivergent. They weren't as \"inclusive\" with those subjects as they thought they were. Most of those stories are for another day, but one of them was that there were mandatory weekly lunch events. WHY?! WHY DID IT HAVE TO BE LUNCHES?! WHY DID IT HAVE TO BE MANDATORY?!\n\nI explained my disorder to them and asked to be excused from those lunches, and they said they'd negotiate it with me in a private meeting. That private meeting never came. I quit the program.",
          "created_utc": 1641771250.0
        }
      ]
    },
    {
      "id": "hsd7udd",
      "author": "daydreamer_35",
      "body": "Omg I would also quit ,hate being forced to eat,I consider it torture",
      "created_utc": 1642005800.0,
      "score": 5,
      "context": [
        {
          "id": "hryb6tt",
          "author": "grimmistired",
          "body": "For some reason there's a bizarre culture around food. Like if you don't eat certain things some people actually get offended or angry.. wack",
          "created_utc": 1641756299.0
        },
        {
          "id": "hryy1s6",
          "author": "RhenHarper",
          "body": "Absolutely. I hate that everything revolves around food. \n\nCatching up with friends? You grab lunch. \nFirst meet up/date? Dinner or maybe drink/apps. \nFamily reunion? Lots of food. \nParty? Food again. \nWork meeting? More eating. \n\nTalk about never wanting to be around people. Everyone always has to comment about your plate.",
          "created_utc": 1641764389.0
        },
        {
          "id": "hrzgvfs",
          "author": "ITriedSoHard419-68",
          "body": "My college did an \"inclusive\" program for people from marginalized groups, including the disabled and neurodivergent. They weren't as \"inclusive\" with those subjects as they thought they were. Most of those stories are for another day, but one of them was that there were mandatory weekly lunch events. WHY?! WHY DID IT HAVE TO BE LUNCHES?! WHY DID IT HAVE TO BE MANDATORY?!\n\nI explained my disorder to them and asked to be excused from those lunches, and they said they'd negotiate it with me in a private meeting. That private meeting never came. I quit the program.",
          "created_utc": 1641771250.0
        }
      ]
    },
    {
      "id": "hrzx0t5",
      "author": "helpmeimconcerned",
      "body": "Seconded! I enjoy going out for food so much more now that I have people that don't judge or bring attention to it.",
      "created_utc": 1641777434.0,
      "score": 9,
      "context": [
        {
          "id": "hryb6tt",
          "author": "grimmistired",
          "body": "For some reason there's a bizarre culture around food. Like if you don't eat certain things some people actually get offended or angry.. wack",
          "created_utc": 1641756299.0
        },
        {
          "id": "hryy1s6",
          "author": "RhenHarper",
          "body": "Absolutely. I hate that everything revolves around food. \n\nCatching up with friends? You grab lunch. \nFirst meet up/date? Dinner or maybe drink/apps. \nFamily reunion? Lots of food. \nParty? Food again. \nWork meeting? More eating. \n\nTalk about never wanting to be around people. Everyone always has to comment about your plate.",
          "created_utc": 1641764389.0
        },
        {
          "id": "hryyff5",
          "author": "grimmistired",
          "body": "There are people who won't judge! The issue is finding them",
          "created_utc": 1641764525.0
        }
      ]
    },
    {
      "id": "hs16zaw",
      "author": "usernametaken615",
      "body": "Yes!!! I hate lettuce so much. It’s so slimy and gross! I have the exact same reaction.",
      "created_utc": 1641797869.0,
      "score": 5,
      "context": [
        {
          "id": "hrymk3b",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1641760320.0
        },
        {
          "id": "hrynsyg",
          "author": "ITriedSoHard419-68",
          "body": "Oh my god the \"how could you not like X?!?!\" is so annoying. I always heard it about pizza growing up, since apparently ALL kids should like pizza. I forgive that though, since it was just annoying and also the people asking were usually kids, who don't know better and have no filter. What bothers me is when grown adults do it.\n\nAnd I think something a lot of people don't realize with your chocolate shard situation is the obsession with \"contamination\" that some people with ARFID have. It doesn't matter if you remove the chocolate, brain will still say \"ew there's 3 molecules of chocolate left in there the whole icecream is contaminated\" and not let them eat it. Foods touching other foods used to be a HUGE no-no for me, I wouldn't eat something if I saw a non-safe food touch it. I'm a lot better with that now, but not everyone is so lucky. I wish people understood.",
          "created_utc": 1641760753.0
        },
        {
          "id": "hs0hgj2",
          "author": "ThrowItAllAway003",
          "body": "Ugh mine is lettuce. I can tell if lettuce has been even near the stuff that’s in my food. Fast TexMex restaurants tend to be the worst. Lettuce is almost always by the cheese so it ends up in the cheese, then my whole taco tastes like freaking lettuce. Then I have to spit it out and toss it.",
          "created_utc": 1641785730.0
        }
      ]
    },
    {
      "id": "hsd8726",
      "author": "daydreamer_35",
      "body": "For me it's onion ,I can't stand it touching my food ,it has a strong flavour and my entire plate starts smelling like it 🤮",
      "created_utc": 1642005933.0,
      "score": 1,
      "context": [
        {
          "id": "hrymk3b",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1641760320.0
        },
        {
          "id": "hrynsyg",
          "author": "ITriedSoHard419-68",
          "body": "Oh my god the \"how could you not like X?!?!\" is so annoying. I always heard it about pizza growing up, since apparently ALL kids should like pizza. I forgive that though, since it was just annoying and also the people asking were usually kids, who don't know better and have no filter. What bothers me is when grown adults do it.\n\nAnd I think something a lot of people don't realize with your chocolate shard situation is the obsession with \"contamination\" that some people with ARFID have. It doesn't matter if you remove the chocolate, brain will still say \"ew there's 3 molecules of chocolate left in there the whole icecream is contaminated\" and not let them eat it. Foods touching other foods used to be a HUGE no-no for me, I wouldn't eat something if I saw a non-safe food touch it. I'm a lot better with that now, but not everyone is so lucky. I wish people understood.",
          "created_utc": 1641760753.0
        },
        {
          "id": "hs0hgj2",
          "author": "ThrowItAllAway003",
          "body": "Ugh mine is lettuce. I can tell if lettuce has been even near the stuff that’s in my food. Fast TexMex restaurants tend to be the worst. Lettuce is almost always by the cheese so it ends up in the cheese, then my whole taco tastes like freaking lettuce. Then I have to spit it out and toss it.",
          "created_utc": 1641785730.0
        }
      ]
    },
    {
      "id": "hs4ong8",
      "author": "ITriedSoHard419-68",
      "body": "You sound like an amazing ally. We need more people like you. Thank you so much. :) <3",
      "created_utc": 1641855907.0,
      "score": 2,
      "context": [
        {
          "id": "hs1ewmo",
          "author": "sarahelizam",
          "body": "My husband may or may not technically have ARFID, but he has some severe neurological shit and very similar symptoms (and he and his docs consider it similar enough). I try to chime in in general defense when “picky eating” is brought up because it’s sickening how much he has to deal with and he has given me a lot of detail to help my outsider perspective. I keep it simple and mostly stick to calling out the blatantly ableist. There are a couple things in my life that make me a good target for online harassment (being trans and BPD are favorites), but I swear I get 10x the vitriol for his eating disorder. I have been told I am abusive for “enabling” him, I shit you not. Absolutely stunningly stupid.",
          "created_utc": 1641803089.0
        },
        {
          "id": "hs21b04",
          "author": "ITriedSoHard419-68",
          "body": "See, you get it. As soon as it’s about food people become 10x more horrible. \n\nThank you for sticking up for your husband and being supportive.",
          "created_utc": 1641818858.0
        },
        {
          "id": "hs4m5n1",
          "author": "sarahelizam",
          "body": "Always! I try to be careful not to speak *for* the people experiencing something I myself don’t, but I am armed with enough information that its worth sharing and running interference. You all shouldn’t always have to be the ones dealing with this on your own. I’m sorry for the haters, I hope you’re well :)",
          "created_utc": 1641854901.0
        }
      ]
    },
    {
      "id": "hsg8r2e",
      "author": "ITriedSoHard419-68",
      "body": "> and they just diminish this horrible struggle i’ve dealt with my entire life because they physically can not comprehend that not everyone eats what they do for flavor.\n\nYep.\n\nI’ve gotten people telling me “think about the REAL victim” after I tell them all about my struggles with food. But oh, they said “I don’t mean to be insensitive” so I guess it’s fine and not dismissive at all /s\n\nAlso tried educating a guy on my struggles with food, and the whole time while he was playing armchair specialist with me he continued to say to other people that eating meat is about “gluttony” and nothing else. As though I wasn’t explaining to him just minutes before why it’s survival, not gluttony.\n\nI also had someone tell me he “finds it hard to believe” that I can’t eat any of the 80,000 vegan options there are, as though 1. I hadn’t stated previously that I can only eat 8 foods TOTAL and 2. There aren’t WAY weirder disorders out there.\n\nAnd a few days ago someone got banned from this very sub for telling me to “stop being dramatic” when I said I would literally die if I went vegan.\n\nThese are all examples from the past week. And in most of these conversations I got downvoted to oblivion just for advocating for my own health.",
      "created_utc": 1642050822.0,
      "score": 2,
      "context": [
        {
          "id": "hsfyjr3",
          "author": "i_enjoy_music_n_stuf",
          "body": "the other day someone told me my life was important, but it doesn’t justify murder. they then told me that i can stomach and food and be fine. no i can’t, if it’s not a safe food it won’t make it down my thought before i yack. i told them i’d starve and they said it’s my fault for having suck extreme preferences. i asked him if he would say that to someone with anorexia or bolimia because they’re all eating disorders. he responded with yes he would because it is. they really did mental gymnastics so hard to prove me wrong that they justified me starving me having to being alive through tubes in my throat if i went vegan, and then ended with a passive aggressive i hope you get the help you need to stop murdering hundreds of animals a year. BITCH my meat intake is pepperoni pizza and mcdonald’s chicken nuggets i’ve maybe eaten 5 animals in my entire fucking life",
          "created_utc": 1642045673.0
        },
        {
          "id": "hsfzom2",
          "author": "ITriedSoHard419-68",
          "body": "Oh my god I get the passive aggressive \"i hope you get the help you need to stop murdering\" one all the damn time. It's infuriating. It's patronizing and backhanded as all hell.",
          "created_utc": 1642046213.0
        },
        {
          "id": "hsg51zw",
          "author": "i_enjoy_music_n_stuf",
          "body": "i always try to start if respectful and they just diminish this horrible struggle i’ve dealt with my entire life because they physically can not comprehend that not everyone eats what they do for flavor. idk if i even like the taste of kraft mac and cheese anymore, i can tolerate it tho. my diet is like 70% dairy 20% idk why i eat this but i’ve been able to stomach it my entire life, and 10% and pills for vitamins, supplements, and basically everything else you can’t get from mostly dairy. on top of that i’m lactose intolerant. so like don’t you think if i could go vegan i would like i fucking hate this and they literally just go like “hehe well your life can be a sacrifice for the animals good if it’s necessary” bullshit. and honestly i wouldn’t have a problem if they didn’t expect that everyone who isn’t vegan is selfish and cruel. so yeah honestly if i could go vegan i would  for my own fucking health in terms of lactose and shit and for the damage my body has already gotten from 20 years of arfid but it’s not that fucking easy",
          "created_utc": 1642048879.0
        }
      ]
    },
    {
      "id": "hsdb99m",
      "author": "ITriedSoHard419-68",
      "body": "My problem wasn’t so much about being forced to eat- there was no rule against just sitting there and not eating- but having to be around other people’s food is super triggering for me. The smell gets me. I never eat with other people, even when I’m hungry.",
      "created_utc": 1642007080.0,
      "score": 4,
      "context": [
        {
          "id": "hryb6tt",
          "author": "grimmistired",
          "body": "For some reason there's a bizarre culture around food. Like if you don't eat certain things some people actually get offended or angry.. wack",
          "created_utc": 1641756299.0
        },
        {
          "id": "hryy1s6",
          "author": "RhenHarper",
          "body": "Absolutely. I hate that everything revolves around food. \n\nCatching up with friends? You grab lunch. \nFirst meet up/date? Dinner or maybe drink/apps. \nFamily reunion? Lots of food. \nParty? Food again. \nWork meeting? More eating. \n\nTalk about never wanting to be around people. Everyone always has to comment about your plate.",
          "created_utc": 1641764389.0
        },
        {
          "id": "hrzgvfs",
          "author": "ITriedSoHard419-68",
          "body": "My college did an \"inclusive\" program for people from marginalized groups, including the disabled and neurodivergent. They weren't as \"inclusive\" with those subjects as they thought they were. Most of those stories are for another day, but one of them was that there were mandatory weekly lunch events. WHY?! WHY DID IT HAVE TO BE LUNCHES?! WHY DID IT HAVE TO BE MANDATORY?!\n\nI explained my disorder to them and asked to be excused from those lunches, and they said they'd negotiate it with me in a private meeting. That private meeting never came. I quit the program.",
          "created_utc": 1641771250.0
        },
        {
          "id": "hsd7udd",
          "author": "daydreamer_35",
          "body": "Omg I would also quit ,hate being forced to eat,I consider it torture",
          "created_utc": 1642005800.0
        }
      ]
    },
    {
      "id": "hsghy2u",
      "author": "i_enjoy_music_n_stuf",
      "body": "yeah also they don’t even try to consider the three things that usually can cause arfid which is lack or desire, texture and trauma. when i has a kid it was lack of interest and texture and then my parents fucked me up with food by trying to fix me. and when i say ti people i have food trauma they always say the same like 3 things “how the hell do you have food trauma” “yeah but it’s just a fucking watermelon grow up” and “so wait you don’t like …proceeds to describe every flavor and texture of a food that i have trauma from which is triggering because then i remember what it tastes like and just thinking about the taste alone can be enough to make me sick",
      "created_utc": 1642056415.0,
      "score": 2,
      "context": [
        {
          "id": "hsfyjr3",
          "author": "i_enjoy_music_n_stuf",
          "body": "the other day someone told me my life was important, but it doesn’t justify murder. they then told me that i can stomach and food and be fine. no i can’t, if it’s not a safe food it won’t make it down my thought before i yack. i told them i’d starve and they said it’s my fault for having suck extreme preferences. i asked him if he would say that to someone with anorexia or bolimia because they’re all eating disorders. he responded with yes he would because it is. they really did mental gymnastics so hard to prove me wrong that they justified me starving me having to being alive through tubes in my throat if i went vegan, and then ended with a passive aggressive i hope you get the help you need to stop murdering hundreds of animals a year. BITCH my meat intake is pepperoni pizza and mcdonald’s chicken nuggets i’ve maybe eaten 5 animals in my entire fucking life",
          "created_utc": 1642045673.0
        },
        {
          "id": "hsfzom2",
          "author": "ITriedSoHard419-68",
          "body": "Oh my god I get the passive aggressive \"i hope you get the help you need to stop murdering\" one all the damn time. It's infuriating. It's patronizing and backhanded as all hell.",
          "created_utc": 1642046213.0
        },
        {
          "id": "hsg51zw",
          "author": "i_enjoy_music_n_stuf",
          "body": "i always try to start if respectful and they just diminish this horrible struggle i’ve dealt with my entire life because they physically can not comprehend that not everyone eats what they do for flavor. idk if i even like the taste of kraft mac and cheese anymore, i can tolerate it tho. my diet is like 70% dairy 20% idk why i eat this but i’ve been able to stomach it my entire life, and 10% and pills for vitamins, supplements, and basically everything else you can’t get from mostly dairy. on top of that i’m lactose intolerant. so like don’t you think if i could go vegan i would like i fucking hate this and they literally just go like “hehe well your life can be a sacrifice for the animals good if it’s necessary” bullshit. and honestly i wouldn’t have a problem if they didn’t expect that everyone who isn’t vegan is selfish and cruel. so yeah honestly if i could go vegan i would  for my own fucking health in terms of lactose and shit and for the damage my body has already gotten from 20 years of arfid but it’s not that fucking easy",
          "created_utc": 1642048879.0
        },
        {
          "id": "hsg8r2e",
          "author": "ITriedSoHard419-68",
          "body": "> and they just diminish this horrible struggle i’ve dealt with my entire life because they physically can not comprehend that not everyone eats what they do for flavor.\n\nYep.\n\nI’ve gotten people telling me “think about the REAL victim” after I tell them all about my struggles with food. But oh, they said “I don’t mean to be insensitive” so I guess it’s fine and not dismissive at all /s\n\nAlso tried educating a guy on my struggles with food, and the whole time while he was playing armchair specialist with me he continued to say to other people that eating meat is about “gluttony” and nothing else. As though I wasn’t explaining to him just minutes before why it’s survival, not gluttony.\n\nI also had someone tell me he “finds it hard to believe” that I can’t eat any of the 80,000 vegan options there are, as though 1. I hadn’t stated previously that I can only eat 8 foods TOTAL and 2. There aren’t WAY weirder disorders out there.\n\nAnd a few days ago someone got banned from this very sub for telling me to “stop being dramatic” when I said I would literally die if I went vegan.\n\nThese are all examples from the past week. And in most of these conversations I got downvoted to oblivion just for advocating for my own health.",
          "created_utc": 1642050822.0
        }
      ]
    },
    {
      "id": "hsgi06r",
      "author": "i_enjoy_music_n_stuf",
      "body": "i hate that they sit in their high hoarse and don’t believe that some people can’t go straight into veganism",
      "created_utc": 1642056455.0,
      "score": 1,
      "context": [
        {
          "id": "hsfyjr3",
          "author": "i_enjoy_music_n_stuf",
          "body": "the other day someone told me my life was important, but it doesn’t justify murder. they then told me that i can stomach and food and be fine. no i can’t, if it’s not a safe food it won’t make it down my thought before i yack. i told them i’d starve and they said it’s my fault for having suck extreme preferences. i asked him if he would say that to someone with anorexia or bolimia because they’re all eating disorders. he responded with yes he would because it is. they really did mental gymnastics so hard to prove me wrong that they justified me starving me having to being alive through tubes in my throat if i went vegan, and then ended with a passive aggressive i hope you get the help you need to stop murdering hundreds of animals a year. BITCH my meat intake is pepperoni pizza and mcdonald’s chicken nuggets i’ve maybe eaten 5 animals in my entire fucking life",
          "created_utc": 1642045673.0
        },
        {
          "id": "hsfzom2",
          "author": "ITriedSoHard419-68",
          "body": "Oh my god I get the passive aggressive \"i hope you get the help you need to stop murdering\" one all the damn time. It's infuriating. It's patronizing and backhanded as all hell.",
          "created_utc": 1642046213.0
        },
        {
          "id": "hsg51zw",
          "author": "i_enjoy_music_n_stuf",
          "body": "i always try to start if respectful and they just diminish this horrible struggle i’ve dealt with my entire life because they physically can not comprehend that not everyone eats what they do for flavor. idk if i even like the taste of kraft mac and cheese anymore, i can tolerate it tho. my diet is like 70% dairy 20% idk why i eat this but i’ve been able to stomach it my entire life, and 10% and pills for vitamins, supplements, and basically everything else you can’t get from mostly dairy. on top of that i’m lactose intolerant. so like don’t you think if i could go vegan i would like i fucking hate this and they literally just go like “hehe well your life can be a sacrifice for the animals good if it’s necessary” bullshit. and honestly i wouldn’t have a problem if they didn’t expect that everyone who isn’t vegan is selfish and cruel. so yeah honestly if i could go vegan i would  for my own fucking health in terms of lactose and shit and for the damage my body has already gotten from 20 years of arfid but it’s not that fucking easy",
          "created_utc": 1642048879.0
        },
        {
          "id": "hsg8r2e",
          "author": "ITriedSoHard419-68",
          "body": "> and they just diminish this horrible struggle i’ve dealt with my entire life because they physically can not comprehend that not everyone eats what they do for flavor.\n\nYep.\n\nI’ve gotten people telling me “think about the REAL victim” after I tell them all about my struggles with food. But oh, they said “I don’t mean to be insensitive” so I guess it’s fine and not dismissive at all /s\n\nAlso tried educating a guy on my struggles with food, and the whole time while he was playing armchair specialist with me he continued to say to other people that eating meat is about “gluttony” and nothing else. As though I wasn’t explaining to him just minutes before why it’s survival, not gluttony.\n\nI also had someone tell me he “finds it hard to believe” that I can’t eat any of the 80,000 vegan options there are, as though 1. I hadn’t stated previously that I can only eat 8 foods TOTAL and 2. There aren’t WAY weirder disorders out there.\n\nAnd a few days ago someone got banned from this very sub for telling me to “stop being dramatic” when I said I would literally die if I went vegan.\n\nThese are all examples from the past week. And in most of these conversations I got downvoted to oblivion just for advocating for my own health.",
          "created_utc": 1642050822.0
        }
      ]
    },
    {
      "id": "hsdcbnj",
      "author": "daydreamer_35",
      "body": "Absolutely the same with me ,smell makes me anxious",
      "created_utc": 1642007478.0,
      "score": 3,
      "context": [
        {
          "id": "hryb6tt",
          "author": "grimmistired",
          "body": "For some reason there's a bizarre culture around food. Like if you don't eat certain things some people actually get offended or angry.. wack",
          "created_utc": 1641756299.0
        },
        {
          "id": "hryy1s6",
          "author": "RhenHarper",
          "body": "Absolutely. I hate that everything revolves around food. \n\nCatching up with friends? You grab lunch. \nFirst meet up/date? Dinner or maybe drink/apps. \nFamily reunion? Lots of food. \nParty? Food again. \nWork meeting? More eating. \n\nTalk about never wanting to be around people. Everyone always has to comment about your plate.",
          "created_utc": 1641764389.0
        },
        {
          "id": "hrzgvfs",
          "author": "ITriedSoHard419-68",
          "body": "My college did an \"inclusive\" program for people from marginalized groups, including the disabled and neurodivergent. They weren't as \"inclusive\" with those subjects as they thought they were. Most of those stories are for another day, but one of them was that there were mandatory weekly lunch events. WHY?! WHY DID IT HAVE TO BE LUNCHES?! WHY DID IT HAVE TO BE MANDATORY?!\n\nI explained my disorder to them and asked to be excused from those lunches, and they said they'd negotiate it with me in a private meeting. That private meeting never came. I quit the program.",
          "created_utc": 1641771250.0
        },
        {
          "id": "hsd7udd",
          "author": "daydreamer_35",
          "body": "Omg I would also quit ,hate being forced to eat,I consider it torture",
          "created_utc": 1642005800.0
        },
        {
          "id": "hsdb99m",
          "author": "ITriedSoHard419-68",
          "body": "My problem wasn’t so much about being forced to eat- there was no rule against just sitting there and not eating- but having to be around other people’s food is super triggering for me. The smell gets me. I never eat with other people, even when I’m hungry.",
          "created_utc": 1642007080.0
        }
      ]
    }
  ]
}