{
  "id": "s23l0b",
  "subreddit": "ARFID",
  "author": "Natty1thecat",
  "created_utc": 1641984876.0,
  "title": "Thoughts on the statement, “if you’re hungry enough, you’ll eat it.”",
  "selftext": "Has anyone ever told you that if you’re hungry enough you’ll eat something? How does that statement make you feel? For me it is almost a trigger. When my parents say this to me, it makes me want to punch a hole in a wall.  It feels like my eating disorder is being disregarded and that I’m just being written off as picky. It’s almost like no matter how many times I explain ARFID to them, They don’t understand that I WILL NOT eat something I am not fond of….I literally would rather eat nothing. So the statement of “if you’re hungry enough you’ll eat it” is like a huge slap in the face to me. It’s as if they’re telling me to “just be normal and eat”….The Truth is, even if I feel that I AM hungry enough….I’m not going to eat it unless it appeals to me.",
  "url": "https://www.reddit.com/r/ARFID/comments/s23l0b/thoughts_on_the_statement_if_youre_hungry_enough/",
  "score": 118,
  "num_comments": 40,
  "comments": [
    {
      "id": "hsc3zpo",
      "author": "Fit-Distribution-252",
      "body": "This is how I almost died from malnutrition in the US. My dad learned the consequences of his actions when I was 16.\n\nEdit for typo:also to almost.",
      "created_utc": 1641986813.0,
      "score": 75,
      "context": []
    },
    {
      "id": "hscjdi8",
      "author": "Cinnamon-Unicorn",
      "body": "Throwback to sitting at the dinner table until 5 in the morning because I wasn't allowed to leave until I ate and my parents swore I would cave",
      "created_utc": 1641995797.0,
      "score": 66,
      "context": []
    },
    {
      "id": "hscjkvf",
      "author": "dogluver_99",
      "body": "Yes. And it triggers me too. I think it comes from a lack of understanding that ARFID is a real disorder. I literally have had ED therapists not know what ARFID was/take that approach of “well she won’t starve herself!” \nYes, I actually would lol.",
      "created_utc": 1641995892.0,
      "score": 45,
      "context": []
    },
    {
      "id": "hsc41fb",
      "author": "None",
      "body": "This was exactly the kind of thing I heard often a as a kid. I ended up being severely underweight. Common wisdom like this saying is so toxic",
      "created_utc": 1641986848.0,
      "score": 39,
      "context": []
    },
    {
      "id": "hsdassx",
      "author": "Kelekona",
      "body": "I can eat almost anything generally regarded as food, but I wouldn't eat crickets that aren't ground into flour, a cheese sandwich that has been taken over by green mold, or raw chicken.\n\nYour brain is just a bit miswired so that things that I could eat trigger your disgust in the same way.  I'm sure that if there was a way to \"cure\" that, you'd be open to it.",
      "created_utc": 1642006910.0,
      "score": 23,
      "context": []
    },
    {
      "id": "hsdasc3",
      "author": "No-Drummer9244",
      "body": "My parents had them same thought when I was hunger but they saw that was wrong when I would allow my self to starve, get grounded, and get toys taken in order to not eat something.",
      "created_utc": 1642006905.0,
      "score": 17,
      "context": []
    },
    {
      "id": "hsddecb",
      "author": "twice_twotimes",
      "body": "This is triggering for me too, but it doesn't make me angry as much as scared. As dismissive and annoying as it is, I just wish it was true.\n\nI'm really scared that I will someday be in the position where I'm not just threatened with going hungry for a meal or a couple days like I've done plenty of times before, but that I'm literally in a position of starving to death. It's not like I hate vegetables so much I'd rather die than eat them out of principle. I very actively try to feed myself and can't actually swallow it and get the calories into my body. \n\nI fully admit I'm a stubborn person who doesn't like to face a well-deserved \"told you so,\" but god I really really wish I could know I was wrong here.",
      "created_utc": 1642007879.0,
      "score": 13,
      "context": []
    },
    {
      "id": "hse7ktj",
      "author": "sharkprincefishstick",
      "body": "Whoever says something like that doesn’t have an eating disorder. It’s like saying “Just don’t worry about it.” to somebody having an anxiety attack. I *know* it’s ignorance, not an attempt to insult, but man, that kind of commentary is hard to let go.",
      "created_utc": 1642019181.0,
      "score": 10,
      "context": []
    },
    {
      "id": "hscv3li",
      "author": "BitchyKitschyWitchy",
      "body": "In my home country it's a thing to tell children that \"If you won't eat it, then you can go without eating.\" Of course it isn't actually meant, but I have sometimes considered repeating it back.",
      "created_utc": 1642000861.0,
      "score": 8,
      "context": []
    },
    {
      "id": "hsgkvsj",
      "author": "cabothief",
      "body": "One thing that works for me sometimes when explaining to neurotypicals is that when I \"don't like\" a food, it isn't just that I'm not a fan. It's that my brain literally doesn't process it as food. \n\nI've found when I say I don't like a certain food, people picture food *they* don't like. And the fact is, a person without ARFID who doesn't really like, say, asparagus, will still eat some if it's that or miss a meal. But ask them how hungry they'd have to be to eat like, a literal car tire. Or cement. *That's* what our brain is telling us we're eating. \n\nI've also had some success with changing my verbage. Saying you're \"not fond of\" certain foods will absolutely make people without ARFID think of food that is just kind of not their favorite, but that they would eat to be polite if the situation called for it. It just won't get through to them. I've had more success with \"can't eat\" or \"can't tolerate,\" but I'm still working on finding the best possible phrasing.",
      "created_utc": 1642058477.0,
      "score": 6,
      "context": []
    },
    {
      "id": "hsd29ij",
      "author": "i_enjoy_music_n_stuf",
      "body": "no i won’t",
      "created_utc": 1642003674.0,
      "score": 6,
      "context": []
    },
    {
      "id": "hsdeqnj",
      "author": "AlienRobotTrex",
      "body": "That just makes things worse",
      "created_utc": 1642008376.0,
      "score": 5,
      "context": []
    },
    {
      "id": "hsdexij",
      "author": "Splatfan1",
      "body": "its just bad. happy my parents never did it with me. a lot of my safe foods arent exactly healthy but its better that i eat something than i eat nothing and they get it",
      "created_utc": 1642008446.0,
      "score": 5,
      "context": []
    },
    {
      "id": "hse9hk2",
      "author": "LuminescentSapphire",
      "body": "It's true to a certain extent. For example, I don't usually eat museli bars but if I'm really hungry and that's the only thing there is I'll eat it. But some things my brain just won't let me eat. Like porridge. If anyone tried to eat something dangerous, like rotten meat, you would throw it up no matter how hungry you are because your brain registers it as dangerous. So my brain treats porridge like rotten meat, or any other harmful food. I will have a physical reaction that won't let me eat it no matter how hungry I am.",
      "created_utc": 1642019885.0,
      "score": 5,
      "context": []
    },
    {
      "id": "hsdf59o",
      "author": "anonymous-musician",
      "body": "My Mom always says it when she says I need to eat healthier. I don't think she'd ever actually act on it, but she definitely believes it's true. I know she is just worried about me and doesn't want me to end up with health issues later in life (diabetes runs in our family), but it drives me crazy. I doubt she'll ever really get it though, so I just kind of put up with it.",
      "created_utc": 1642008526.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hsdjcah",
      "author": "Telphsm4sh",
      "body": "It was a big trigger for me as a kid, not so much now, When my parents didn't know any better and used that logic to put me to bed starving for a couple days until they gave up on that strategy.\n\nBut my family raised me watching survivor on CBS every Wednesday. And a much better way they would use that train of thinking that was successful in getting me to try a couple more foods is asking me what if you were on survivor and just won your only food besides bugs and rice in 30 days? Would you want to be heroic like Ozzy on survivor and eat your reward? You'll need the energy of you want to win. That was a great way of turning it around into like a heroic thing rather than a foolish childish thing.",
      "created_utc": 1642010075.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hsflj6d",
      "author": "saintceciliax",
      "body": "Yeah people say this and don’t expect a “No, I’ll literally starve and die.” response🤣",
      "created_utc": 1642039854.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hsgd93o",
      "author": "Emotionallydepressed",
      "body": "I hate this statement. Im so hungry all the time but can eat very little. If this statement was true I’d be eating everything all the time",
      "created_utc": 1642053373.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hsgdyua",
      "author": "heartlckt",
      "body": "yeah my parents said this a lot to me as a kid. i would just sob and try to explain thats not how it worked, but i was a child so i didn't have the words or terminology to explain so :/ didn't bring up or know about the potential of ARFID until I was 17",
      "created_utc": 1642053813.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hvnvsmk",
      "author": "Floofers-Soda",
      "body": "It almost feels like a rug being pulled out from under you, the idea of actually getting help and having someone care being replaced with \"well I'll just starve you :)\"\n\nI'm SO lucky my mom understands how serious my Arfid is, hell, even before I did, so I never really hear this statement, but I have had other people sit me down when I was 8-9 for hours at a time and make me eat bits of food before I could eat anything else. Even after sobbing it wouldn't help :/\n\nOverall it just makes me feel even more like my ED is seen as some choice and not a debilitating disorder that controls almost every single aspect of my life.",
      "created_utc": 1644037706.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hsddnqz",
      "author": "Chagdoo",
      "body": "Didn't work when I was a kid. I see why people go with it but its just not a good idea",
      "created_utc": 1642007975.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hsfe06t",
      "author": "ferluci_",
      "body": "I've never experienced being *that* hungry, but when I first heard that phrase in elementary school, I couldn't even believe someone would do that. The kid who used it said they had eaten sprouts because they were hungry, and I couldn't imagine ever eaten something disgusting simply because I'm hungry. Are there really people that think like this?!",
      "created_utc": 1642036537.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ljk1136",
      "author": "Expensive_Call_4762",
      "body": "Pretty late i know but This still is happening to me and they wont give up, got so bad that i have iron deficiency and almost passed out alone at home one day because my mum rather let me starve than let me make myself like a toast instead. When she tries to stop me from making food for myself now i simply yell at her because its either being disrespectful or going back and forth to the doctors for weeks 🤷🏻‍♀️",
      "created_utc": 1724425387.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hsganey",
      "author": "ITriedSoHard419-68",
      "body": "I’ve been told this before. I usually just grumble in agreement because I don’t feel like explaining and looking stupid, but I *know* they’re wrong.",
      "created_utc": 1642051862.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hsgp01i",
      "author": "PureTadpole",
      "body": "I like to think of myself as a cat when it comes to food. Cats will literally starve rather than eat food they don't like. Same. For me, there is no line that determines \" after this point, I'll be hungry enough to eat anything\" if there was, I think I would have found it by now due to how restrictive my ARFID gets in summer.",
      "created_utc": 1642061597.0,
      "score": 1,
      "context": []
    },
    {
      "id": "isqjgb4",
      "author": "nelkesa",
      "body": "they actually tried this to me when i was a child. spoilers: it didn’t work.",
      "created_utc": 1666048874.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kjuuw0u",
      "author": "None",
      "body": "My hospital records say otherwise",
      "created_utc": 1706389160.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hscha8o",
      "author": "RedPringles",
      "body": "you died?",
      "created_utc": 1641994798.0,
      "score": 14,
      "context": [
        {
          "id": "hsc3zpo",
          "author": "Fit-Distribution-252",
          "body": "This is how I almost died from malnutrition in the US. My dad learned the consequences of his actions when I was 16.\n\nEdit for typo:also to almost.",
          "created_utc": 1641986813.0
        }
      ]
    },
    {
      "id": "hsdpt8t",
      "author": "_jspain",
      "body": "same lol and my parents would keep serving me the same cold green beans for every meal. i only ate at school for like 3 days",
      "created_utc": 1642012464.0,
      "score": 21,
      "context": [
        {
          "id": "hscjdi8",
          "author": "Cinnamon-Unicorn",
          "body": "Throwback to sitting at the dinner table until 5 in the morning because I wasn't allowed to leave until I ate and my parents swore I would cave",
          "created_utc": 1641995797.0
        }
      ]
    },
    {
      "id": "hscy79m",
      "author": "amdaly10",
      "body": "That sucks.  I was at least allowed to get up from the table at bed time to go to sleep.",
      "created_utc": 1642002098.0,
      "score": 14,
      "context": [
        {
          "id": "hscjdi8",
          "author": "Cinnamon-Unicorn",
          "body": "Throwback to sitting at the dinner table until 5 in the morning because I wasn't allowed to leave until I ate and my parents swore I would cave",
          "created_utc": 1641995797.0
        }
      ]
    },
    {
      "id": "hsdpw41",
      "author": "None",
      "body": "If I didn't eat within like an hour, I was beaten and sent to bed.",
      "created_utc": 1642012494.0,
      "score": 9,
      "context": [
        {
          "id": "hscjdi8",
          "author": "Cinnamon-Unicorn",
          "body": "Throwback to sitting at the dinner table until 5 in the morning because I wasn't allowed to leave until I ate and my parents swore I would cave",
          "created_utc": 1641995797.0
        }
      ]
    },
    {
      "id": "hseqkyr",
      "author": "Lovemusic1999",
      "body": "yess",
      "created_utc": 1642026247.0,
      "score": 1,
      "context": [
        {
          "id": "hscjdi8",
          "author": "Cinnamon-Unicorn",
          "body": "Throwback to sitting at the dinner table until 5 in the morning because I wasn't allowed to leave until I ate and my parents swore I would cave",
          "created_utc": 1641995797.0
        }
      ]
    },
    {
      "id": "hsgaw6e",
      "author": "ITriedSoHard419-68",
      "body": "Strange how they can watch anorexia victims starve themselves to conform to society’s standards, but the moment someone is starving themself for a reason other than conforming to society’s shitty beauty standards and giving in to societal gaslighting and conditioning, suddenly people just don’t starve themselves.",
      "created_utc": 1642051999.0,
      "score": 9,
      "context": [
        {
          "id": "hscjkvf",
          "author": "dogluver_99",
          "body": "Yes. And it triggers me too. I think it comes from a lack of understanding that ARFID is a real disorder. I literally have had ED therapists not know what ARFID was/take that approach of “well she won’t starve herself!” \nYes, I actually would lol.",
          "created_utc": 1641995892.0
        }
      ]
    },
    {
      "id": "hscu3oc",
      "author": "frozenchocolate",
      "body": "Same here. Now a grown adult and still very underweight as doctors insist I “just” have anorexia or some throat condition instead of the sensory issues I know I’ve experienced my whole life.",
      "created_utc": 1642000458.0,
      "score": 15,
      "context": [
        {
          "id": "hsc41fb",
          "author": "None",
          "body": "This was exactly the kind of thing I heard often a as a kid. I ended up being severely underweight. Common wisdom like this saying is so toxic",
          "created_utc": 1641986848.0
        }
      ]
    },
    {
      "id": "hsfgbba",
      "author": "orange_ones",
      "body": "This is so true.  I’d eat unground or even live crickets before I’d eat things that trip my ARFID.  I think most people simply don’t understand and think it’s more of a slight preference or mild dislike because that’s all they’ve ever experienced with edible foods.",
      "created_utc": 1642037569.0,
      "score": 6,
      "context": [
        {
          "id": "hsdassx",
          "author": "Kelekona",
          "body": "I can eat almost anything generally regarded as food, but I wouldn't eat crickets that aren't ground into flour, a cheese sandwich that has been taken over by green mold, or raw chicken.\n\nYour brain is just a bit miswired so that things that I could eat trigger your disgust in the same way.  I'm sure that if there was a way to \"cure\" that, you'd be open to it.",
          "created_utc": 1642006910.0
        }
      ]
    },
    {
      "id": "hse6qqi",
      "author": "trees4am",
      "body": "This is an excellent way of putting it!",
      "created_utc": 1642018867.0,
      "score": 7,
      "context": [
        {
          "id": "hsdassx",
          "author": "Kelekona",
          "body": "I can eat almost anything generally regarded as food, but I wouldn't eat crickets that aren't ground into flour, a cheese sandwich that has been taken over by green mold, or raw chicken.\n\nYour brain is just a bit miswired so that things that I could eat trigger your disgust in the same way.  I'm sure that if there was a way to \"cure\" that, you'd be open to it.",
          "created_utc": 1642006910.0
        }
      ]
    },
    {
      "id": "hseetb3",
      "author": "SophLuvsBTS",
      "body": "I am on my way to your worst case scenario and it's awful. It's true that I can't see how thin I am, but I've never tried actively not eating. Only recently when I went down with a depression, did my appetite go completely away. I've always been driven to eat by my appetite, even though it has always been for few specific foods etc. Without my appetite, I'm just a person who can't get anything down. It's like I despise the thought of tasting, every flavor is somehow unappealing and even in a way revolting. It's been like this for around 2 months now and I'm scared that it won't come back until I've already been hospitalized or something for my lack of eating. \n\nIf only my parents understood that it's much harder to eat than they would ever know. They have always been overweight and have trouble going on diets because they are so driven by food, so it's really hard for them to understand, but it's like they don't even try. At least give me a \"hey we know it's hard for you, we may not understand why or how it's so hard for you to eat, but we'll be here to support you through it until you've overcome it or gotten good help for it\". Instead they say \"it's not that hard\", \"just eat\" and \"if you're not eating, you're not truly hungry\".\n\nBut I still have hope and believe that I'll someday be at a point in my life where I've gotten my appetite back. (also my parents confuse appetite with hunger??)",
      "created_utc": 1642021829.0,
      "score": 6,
      "context": [
        {
          "id": "hsddecb",
          "author": "twice_twotimes",
          "body": "This is triggering for me too, but it doesn't make me angry as much as scared. As dismissive and annoying as it is, I just wish it was true.\n\nI'm really scared that I will someday be in the position where I'm not just threatened with going hungry for a meal or a couple days like I've done plenty of times before, but that I'm literally in a position of starving to death. It's not like I hate vegetables so much I'd rather die than eat them out of principle. I very actively try to feed myself and can't actually swallow it and get the calories into my body. \n\nI fully admit I'm a stubborn person who doesn't like to face a well-deserved \"told you so,\" but god I really really wish I could know I was wrong here.",
          "created_utc": 1642007879.0
        }
      ]
    },
    {
      "id": "hschdhd",
      "author": "Fit-Distribution-252",
      "body": "Sorry typo. I'll edit it.",
      "created_utc": 1641994841.0,
      "score": 7,
      "context": [
        {
          "id": "hsc3zpo",
          "author": "Fit-Distribution-252",
          "body": "This is how I almost died from malnutrition in the US. My dad learned the consequences of his actions when I was 16.\n\nEdit for typo:also to almost.",
          "created_utc": 1641986813.0
        },
        {
          "id": "hscha8o",
          "author": "RedPringles",
          "body": "you died?",
          "created_utc": 1641994798.0
        }
      ]
    },
    {
      "id": "hsgwnlz",
      "author": "Taxouck",
      "body": "Child abuse. But it’s okay because “EDs aren’t real”.",
      "created_utc": 1642067807.0,
      "score": 10,
      "context": [
        {
          "id": "hscjdi8",
          "author": "Cinnamon-Unicorn",
          "body": "Throwback to sitting at the dinner table until 5 in the morning because I wasn't allowed to leave until I ate and my parents swore I would cave",
          "created_utc": 1641995797.0
        },
        {
          "id": "hsdpt8t",
          "author": "_jspain",
          "body": "same lol and my parents would keep serving me the same cold green beans for every meal. i only ate at school for like 3 days",
          "created_utc": 1642012464.0
        }
      ]
    },
    {
      "id": "hsfocwq",
      "author": "Kelekona",
      "body": "I wonder if these people have never gotten ill after eating something.  I had a very temporary thing with mac & cheese, but I also had a period where I had to be careful with candies and sugary snacks because my gut bacteria was a bit bonkers.  I still don't really like more than a little cake.\n\nMy mom is still getting over some sort of trauma involving carrots, (a bad flu, I think?) but when I cook enough for both of us it's more \"there's extra if you're interested\" instead of actually doing meals together.",
      "created_utc": 1642041069.0,
      "score": 5,
      "context": [
        {
          "id": "hsdassx",
          "author": "Kelekona",
          "body": "I can eat almost anything generally regarded as food, but I wouldn't eat crickets that aren't ground into flour, a cheese sandwich that has been taken over by green mold, or raw chicken.\n\nYour brain is just a bit miswired so that things that I could eat trigger your disgust in the same way.  I'm sure that if there was a way to \"cure\" that, you'd be open to it.",
          "created_utc": 1642006910.0
        },
        {
          "id": "hsfgbba",
          "author": "orange_ones",
          "body": "This is so true.  I’d eat unground or even live crickets before I’d eat things that trip my ARFID.  I think most people simply don’t understand and think it’s more of a slight preference or mild dislike because that’s all they’ve ever experienced with edible foods.",
          "created_utc": 1642037569.0
        }
      ]
    }
  ]
}