{
  "id": "sr068d",
  "subreddit": "ARFID",
  "author": "WellDoneEngineer",
  "created_utc": 1644696901.0,
  "title": "I was just broken up with for having ARFID",
  "selftext": "28,M here\n\nI've been talking to this girl for about 2 months. We went on a few dates and things really seemed to be going great.\nShe was nerdy like me, and seemed to really vibe with me and ease my anxiety.\nAfter we started dating, she asked if we could go to an Italian restaurant for Valentine's Day. \nI regretfully admitted that I wasnt going to be able to eat there, due to my eating disorder.\nI explained briefly what it is and stressed how I hate having it and am actively trying to improve upon it and expand my pallet\n\nWell she did not like this.. She ended up saying that this was a deal breaker, and that is would inevitably lead to issues and she just preferred to end it there..\n\nI tried to explain I couldn't control it, and asked her is she really wanted to end this over food.. Well I got my answer\n\nI feel so unwanted, I feel like I'm never going to be able to find someone if food is such a big deal with people. How am I supposed to find someone?\n\nFeeling really down and hopeless.\n\n\nEDIT: Thank you all for the wonderful and thoughtful responses; it does hurt, but it is what it is.\n\nAnd to clarify, i didn't straight up refuse the Italian restaurant (bad choice of words on my part), I simply said \"it may be hard for me to find something there, but maybe if you send me the menu i can check it out\" and that's what kicked off the whole conversation.\n\nYes she's a little younger than me (23), but everything else she had done/said up to this point didnt phase me one bit, she seemed like a really solid match. \n\nIt took me 4 years to get to the point i was ready to date again, and this just felt like a big strikeout..\nThanks again everyone for your comments, nice to have support on this <3",
  "url": "https://www.reddit.com/r/ARFID/comments/sr068d/i_was_just_broken_up_with_for_having_arfid/",
  "score": 107,
  "num_comments": 34,
  "comments": [
    {
      "id": "hwpdygs",
      "author": "victorious-turnip",
      "body": "Hey, I’m 26f and when I started dating my boyfriend I was convinced he’d break up with me over ARFID bc he always said “food was his love language” - but when I told him he was understanding and concerned but accommodating. \n\nWhen I started going on regular work lunches, I was terrified they’d notice and make fun of me, and one coworker did. Always pointed out that I didn’t touch my vegetables until I pulled her aside and told her to quit it. \n\nThere are people out there who will accept it and people who will hassle you about it and if this girl was going to be the latter, I think you dodged a huge bullet. You don’t want to be self conscious and shamed every time you have to eat with the person you’re dating, you want someone who can compromise. It sucks that this girl chose to be petty, but we can’t control other peoples dealbreakers. I promise you’ll find someone who will make things easy for you. They do exist out there.",
      "created_utc": 1644706210.0,
      "score": 51,
      "context": []
    },
    {
      "id": "hwpntm9",
      "author": "None",
      "body": "My partner has ARFID and I hate how much it makes him suffer, but I do not think any less of him for it. Honestly, the fact that he’s come so far with something that’s always so present, since food is such a big part of our culture, is all the more remarkable. I promise you there are people out there for whom this will not be an issue, and they will want to hold your hand and support you as best they can. This is not your fault, you are worthy of love, and people are out there for you. I hope you find someone wonderful.",
      "created_utc": 1644710452.0,
      "score": 29,
      "context": []
    },
    {
      "id": "hwpul1r",
      "author": "chunkeymunkeyandrunt",
      "body": "Honestly it hurts now but be thankful she decided to bail at 2 months. She clearly values food experiences as something important in her relationships. Which is not a bad thing on its own, but she definitely could have been politer about it. \n\nI dated someone who didn’t start having a problem with my eating until 2 years in …. Suddenly he realized that when I said it wasn’t going to change … I wasn’t being dramatic lmao \n\nI’m now engaged to someone who doesn’t give a shit what I like to eat. He’ll eat pretty much anything if it’s offered but is content to keep a simple diet at home with me. When he wants food I don’t like, he makes plans with a friend to go get some! Great way to keep in touch with his friends, and not make me feel shitty. \n\nI recommend being open and honest about it upfront. Weed out those who are incompatible right away. There is someone out there who will not run away from your eating, and instead help you thrive as you are. Lift you up. As a good partnership should.",
      "created_utc": 1644713500.0,
      "score": 28,
      "context": []
    },
    {
      "id": "hwp3v74",
      "author": "frozenchocolate",
      "body": "The fact is that there will always be people who see food as a different part of identity than ours — instead of seeing food with anxiety and pain, they see food as something to explore and share with loved ones and need a partner that has their same approach to new/different foods. There’s nothing wrong with either sides, they’re just different and aren’t compatible with each other. \n\nI’ve met a lot of people who had a personal problem with my eating struggles, and many weren’t too nice about it calling me anorexic, picky, difficult etc. (even though I always look after myself to make sure no one is bending to my weird habits). My partner now LOVES food and will eat pretty much anything put in front of him, and there were definitely some growing pains in the start. But he doesn’t make me feel bad for feeling nauseous and not physically being able to eat many things. I end up getting myself a lot of sides and kid’s meals when possible when we go out so he’s not limited and can still eat the cuisines and dishes he wants. I think there has to be some compromise ultimately and to be honest, she might’ve just thought that your outright refusal to even visit certain places was indicative of inflexibility in general down the road. I totally get the struggle of finding things to eat that won’t make you sick, but you also have to understand how that makes partners feel to get better about your approach to this situation and find a way forward over time.",
      "created_utc": 1644702031.0,
      "score": 38,
      "context": []
    },
    {
      "id": "hwoyyeg",
      "author": "sylviapalth",
      "body": "i'm so sorry she responded that way!! trust me though, food isn't a big deal for everyone, so don't despair. the right person won't care about your eating habits, and will want to spend time with you no matter what you can/can't eat",
      "created_utc": 1644700038.0,
      "score": 16,
      "context": []
    },
    {
      "id": "hwpm8ai",
      "author": "cellocats",
      "body": "Here are my thoughts.  This connection was very very new, it's possible she didn't know you well enough to be motivated to make what could be some major lifestyle adjustments for her.  Maybe she's a foodie and Italian is her favorite cuisine and you just straight up refuse to go to the restaurant with her.  Perhaps in your explanation, you made it sound like you'd refuse to go to any restaurant that wasn't of your choosing.  Then she got to thinking how she'd feel never getting a say in where you went out to eat.  Then she got to thinking how one sided your relationship might be if you were like this in other areas.  Maybe she likes to cook and you'd refuse to let her cook for you.  Maybe she likes to travel and you'd refuse to go anywhere with her if you didn't like the cuisine.  Maybe she thought she'd have a huge hassle just trying to share a meal with you.  It may not be that she broke up with you because of the ARFID, but because of the uncompromising way you explained it.  She may have wanted to break up before she invested too far emotionally in a relationship that would make her unhappy, and that's fair.  \n\nNow, I don't know what exactly you said, and I'm not assuming anything, just giving a possible scenario.  When I hang out with foodies I don't refuse to go to restaurants just because I can't eat the main food items, I usually find at least an appetizer that I can have or sometimes I just eat beforehand so I'm not hungry and have a drink and dessert.  Maybe you can try that if you don't already.  Maybe you can adjust the way you explain ARFID to people if it's coming across badly.  I wouldn't want to date anyone if I couldn't eat what I liked around them, so I try not to do that to other people.  It is for sure a difficult task though, and I am still single so I am definitely not an expert.",
      "created_utc": 1644709766.0,
      "score": 7,
      "context": []
    },
    {
      "id": "hwq4fqq",
      "author": "None",
      "body": "This scares me. I tend to avoid social situations involving food completely because I both don’t want to “get caught” not being able to find something I like and I don’t feel comfortable eating in front of others, especially people I may become romantically interested in. I think part of that fear is rooted in anxiety over being judged for what I choose to eat. I’ve always told myself that this anxiety is illogical and not based in reality but, after reading this, I guess I’ve learned that food really is a dealbreaker for some people. You deserve someone better than this girl. People need to understand that ARFID is not a choice. If she were to break up with you because you had a condition that manifests itself physically like, say, psoriasis, everyone would immediately come to the conclusion that she’s not a good person. I don’t think people view ARFID in the same way… yet. I hope that changes. Sending you love! A better person will come your way!",
      "created_utc": 1644718101.0,
      "score": 6,
      "context": []
    },
    {
      "id": "hwpt1u4",
      "author": "None",
      "body": "21m, considering just living the single life forever. ARFID and ADHD just makes relationships too difficult for me tbh.",
      "created_utc": 1644712801.0,
      "score": 5,
      "context": []
    },
    {
      "id": "hwqtuz5",
      "author": "crash----",
      "body": "This is huge fear of mine when it comes to dating. I’m so afraid any potential romantic partner will immediately lose interest in me once they learn about my, um, unideal eating habits.\n\nAlso.. what if they want to take me to dinner with their parents? What if they invite me over for a Christmas dinner with their extended family? What would I do???? Just cease to exist????\n\nUgh. I’m sorry this happened to you. We don’t deserve this shit.",
      "created_utc": 1644731171.0,
      "score": 6,
      "context": []
    },
    {
      "id": "hwxddme",
      "author": "Straight-Kick5824",
      "body": "My partner has been very sad to see me suffer with not being able to eat. He's never once been upset, or angry. You deserve better.",
      "created_utc": 1644857495.0,
      "score": 5,
      "context": []
    },
    {
      "id": "hwp3sjc",
      "author": "None",
      "body": "She's the weird one here. Seems childish to me.",
      "created_utc": 1644702001.0,
      "score": 18,
      "context": []
    },
    {
      "id": "hwrbrix",
      "author": "i_enjoy_music_n_stuf",
      "body": "hey you can find someone chin up, i know you you will find someone because im talking to someone who is supportive, she doesn’t really understand it but the approach ive been taking that i feel like is helpful is that i’ve been very upfront and honest about it and because i’ve been so upfront she is very open to learn more, and she doesn’t judge me",
      "created_utc": 1644743588.0,
      "score": 4,
      "context": []
    },
    {
      "id": "hwr0l18",
      "author": "None",
      "body": "I don’t wanna seem like I lack empathy because it must suck, but imo food is an important thing to many people, if food is an important thing to her, and she needs to explore food and your incapable of joining her for it (as am I) then it probably would cause issues, and tbh it seems reasonable enough to let you know rather than saying nothing and resenting you for it.\nIt sucks, and I hope you find someone who can supporting you, but it’s our own conditions not someone else’s, so as much at it sucks it is t anyone else’s responsibility to accommodate it.\nI hope you can find someone who can accomodate it, but sometimes it just won’t work out.",
      "created_utc": 1644735332.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hwri15q",
      "author": "jizzyjazz2",
      "body": "I feel you man. This type of thing extends to my whole social life. I think we're just not built to be social and get into relationships with this disorder. It would require all people to be able to tolerate a very minor issue, but as drab as it sounds, that's probably not happening in the near future. \n\nI'd encourage you to keep going though. There are people out there who are open to it, you just have to find them.",
      "created_utc": 1644748475.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hwrynyc",
      "author": "khrrxehk",
      "body": "you are loveable.\n\nmy ex loved to cook and was kinda famous in our friend group for always baking and cooking delicious stuff. I was about never able to eat it. I never explained my ED in detail to him. He accepted it and asked a few questions I wasnt ready to answer back then. But he accepted that. I'm sure it wasn't easy for him. But he always made sure to let me know that me having an ED is okey. He never pushed me to eat and never gave me the feeling I'm a bad person for not eating his food.\n\nIf having an ED is a dealbreaker for some people thats ok.\n\nThere are lots of people who will love you whether you have an ED or not.",
      "created_utc": 1644759944.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hws4z8l",
      "author": "None",
      "body": "That's pretty much every relationship I've had in my 38 years on this planet. The relationship I'm in now, she understands it. She doesn't give me any shit at all. My point is there is gonna be someone who's gonna understand you and not judge you. I've been with my girlfriend for a year and a half now. It's gets better. Believe me",
      "created_utc": 1644763138.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hyqix2y",
      "author": "None",
      "body": "This is really sad and I hope she regrets it later.  She might see that you did nothing wrong and you were nice.  I hope you feel better soon.  If she is this mean about something that you cannot control, think about the other things that she would make fun of for no reason.",
      "created_utc": 1646021164.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hyqke8n",
      "author": "None",
      "body": "Who is down voting this...?  Is the old girlfriend on here?",
      "created_utc": 1646021920.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hwp717r",
      "author": "Familiar_Hold8167",
      "body": "At least now you know she’s a pos",
      "created_utc": 1644703333.0,
      "score": 5,
      "context": []
    },
    {
      "id": "hwpdqt6",
      "author": "nomoreadminspls",
      "body": "This person is despicable. The only people who have had any problems with my condition have proven to be awful people not worth my time; more concerned about appearances than people. \n\nOn the other hand finding someone who supports you in this particular journey feels like a huge weight is lifted off your shoulders. You should not settle for anything less. \n\nThe problem is not with you, the problem is with that other person.",
      "created_utc": 1644706120.0,
      "score": 4,
      "context": []
    },
    {
      "id": "hwpgire",
      "author": "RhenHarper",
      "body": "I’m so sorry. That’s rough. If anything, it seems you dodged a bullet. I know that doesn’t help much right now though. \n\nThere will always be judgy a holes in the world and we can never do a thing about it. \n\nCan someone make a ARFID dating app? That would help so many of us. 😂",
      "created_utc": 1644707294.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hwp5v3k",
      "author": "Calypso257",
      "body": "There were so many ways to solve this issue you both could have gotten different takeout an made a cozy time instead it's really sad that people are like this but there are people out there an your not alone it feels really lonely but I promise your not alone an it doesn't mean you should stop being you you will find someone that understands an that will show kindness it's out there it has to be",
      "created_utc": 1644702847.0,
      "score": 3,
      "context": []
    },
    {
      "id": "irpnyf4",
      "author": "None",
      "body": "\"I feel like I'm never going to be able to find someone if food is such a big deal with people\"\n\nUhh it's obviously a big deal to you so why shouldn't it be a big deal to others?",
      "created_utc": 1665367444.0,
      "score": 0,
      "context": []
    },
    {
      "id": "hwri43u",
      "author": "TuggAndWink",
      "body": "There are understanding people out there. I developed Arfid during my current relationship and he has been very patient with me. He helps encourage me and we celebrate little victories. You will find someone, don't give up. ♥️",
      "created_utc": 1644748538.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hwrnrjz",
      "author": "Cam_044",
      "body": "100% dodged a bullet there imo, if food was her dealbreaker.. man could've been ditched at any point",
      "created_utc": 1644752878.0,
      "score": 15,
      "context": [
        {
          "id": "hwpdygs",
          "author": "victorious-turnip",
          "body": "Hey, I’m 26f and when I started dating my boyfriend I was convinced he’d break up with me over ARFID bc he always said “food was his love language” - but when I told him he was understanding and concerned but accommodating. \n\nWhen I started going on regular work lunches, I was terrified they’d notice and make fun of me, and one coworker did. Always pointed out that I didn’t touch my vegetables until I pulled her aside and told her to quit it. \n\nThere are people out there who will accept it and people who will hassle you about it and if this girl was going to be the latter, I think you dodged a huge bullet. You don’t want to be self conscious and shamed every time you have to eat with the person you’re dating, you want someone who can compromise. It sucks that this girl chose to be petty, but we can’t control other peoples dealbreakers. I promise you’ll find someone who will make things easy for you. They do exist out there.",
          "created_utc": 1644706210.0
        }
      ]
    },
    {
      "id": "hwrnymu",
      "author": "Cam_044",
      "body": "Yea i personally never understood how someone can all of a sudden lose interest simply over your food preference",
      "created_utc": 1644753019.0,
      "score": 14,
      "context": [
        {
          "id": "hwpul1r",
          "author": "chunkeymunkeyandrunt",
          "body": "Honestly it hurts now but be thankful she decided to bail at 2 months. She clearly values food experiences as something important in her relationships. Which is not a bad thing on its own, but she definitely could have been politer about it. \n\nI dated someone who didn’t start having a problem with my eating until 2 years in …. Suddenly he realized that when I said it wasn’t going to change … I wasn’t being dramatic lmao \n\nI’m now engaged to someone who doesn’t give a shit what I like to eat. He’ll eat pretty much anything if it’s offered but is content to keep a simple diet at home with me. When he wants food I don’t like, he makes plans with a friend to go get some! Great way to keep in touch with his friends, and not make me feel shitty. \n\nI recommend being open and honest about it upfront. Weed out those who are incompatible right away. There is someone out there who will not run away from your eating, and instead help you thrive as you are. Lift you up. As a good partnership should.",
          "created_utc": 1644713500.0
        }
      ]
    },
    {
      "id": "hwr96sg",
      "author": "bluejen",
      "body": "Yeah, not to sound condescending, but you’re 21… give it time. I’m not saying life magically gets easier but you’ll have more and more dating experiences that show you the spectrum of kindness that various people have and will end up finding people who are smart enough to give a shit about what others eat and will even feel empathy for your struggle and help you feel as comfortable with them as possible.",
      "created_utc": 1644741586.0,
      "score": 3,
      "context": [
        {
          "id": "hwpt1u4",
          "author": "None",
          "body": "21m, considering just living the single life forever. ARFID and ADHD just makes relationships too difficult for me tbh.",
          "created_utc": 1644712801.0
        }
      ]
    },
    {
      "id": "hwp6kr2",
      "author": "saintceciliax",
      "body": "She is 100% the weird one here. Was she younger? This is just not normal lol. You did absolutely nothing wrong and I know for a fact you’ll find other partner(s) who are accepting.",
      "created_utc": 1644703146.0,
      "score": 12,
      "context": [
        {
          "id": "hwp3sjc",
          "author": "None",
          "body": "She's the weird one here. Seems childish to me.",
          "created_utc": 1644702001.0
        }
      ]
    },
    {
      "id": "hwpdtd4",
      "author": "SquidsAreSeaBirds",
      "body": "I was about to say, sounds like the bullet has been dodged. Lol\n\nAs unfortunate as it is to have to be shot at at all, some people are just weird or judgy, and they do be bullets.",
      "created_utc": 1644706150.0,
      "score": 7,
      "context": [
        {
          "id": "hwp717r",
          "author": "Familiar_Hold8167",
          "body": "At least now you know she’s a pos",
          "created_utc": 1644703333.0
        }
      ]
    },
    {
      "id": "hwrjtd6",
      "author": "jizzyjazz2",
      "body": "Calm down man. it's shitty, but people are allowed to have a preference.",
      "created_utc": 1644749866.0,
      "score": 2,
      "context": [
        {
          "id": "hwp717r",
          "author": "Familiar_Hold8167",
          "body": "At least now you know she’s a pos",
          "created_utc": 1644703333.0
        }
      ]
    },
    {
      "id": "hwwd1sj",
      "author": "HighOnGoofballs",
      "body": "If what you enjoy most is going to nice restaurants and your potential partner says they can never go to any of them, I totally get it.  It’s like someone who values a bottle of wine with dinner not wanting a teetotaler \n\nI’m picky as hell but luckily can find at least one dish at any restaurant so it’s much less of an issue.  I may not share apps with them but at least I can go and eat something",
      "created_utc": 1644839132.0,
      "score": 5,
      "context": [
        {
          "id": "hwpul1r",
          "author": "chunkeymunkeyandrunt",
          "body": "Honestly it hurts now but be thankful she decided to bail at 2 months. She clearly values food experiences as something important in her relationships. Which is not a bad thing on its own, but she definitely could have been politer about it. \n\nI dated someone who didn’t start having a problem with my eating until 2 years in …. Suddenly he realized that when I said it wasn’t going to change … I wasn’t being dramatic lmao \n\nI’m now engaged to someone who doesn’t give a shit what I like to eat. He’ll eat pretty much anything if it’s offered but is content to keep a simple diet at home with me. When he wants food I don’t like, he makes plans with a friend to go get some! Great way to keep in touch with his friends, and not make me feel shitty. \n\nI recommend being open and honest about it upfront. Weed out those who are incompatible right away. There is someone out there who will not run away from your eating, and instead help you thrive as you are. Lift you up. As a good partnership should.",
          "created_utc": 1644713500.0
        },
        {
          "id": "hwrnymu",
          "author": "Cam_044",
          "body": "Yea i personally never understood how someone can all of a sudden lose interest simply over your food preference",
          "created_utc": 1644753019.0
        }
      ]
    },
    {
      "id": "hws0yqo",
      "author": "None",
      "body": "I get that, but it’s just as much the ADHD as the ARFID. Rejection sensitive dysphoria is a bitch. And while I’m a lot better than when I was a kid, it never goes away 100%. Meds do help a lot with it though.",
      "created_utc": 1644761170.0,
      "score": 3,
      "context": [
        {
          "id": "hwpt1u4",
          "author": "None",
          "body": "21m, considering just living the single life forever. ARFID and ADHD just makes relationships too difficult for me tbh.",
          "created_utc": 1644712801.0
        },
        {
          "id": "hwr96sg",
          "author": "bluejen",
          "body": "Yeah, not to sound condescending, but you’re 21… give it time. I’m not saying life magically gets easier but you’ll have more and more dating experiences that show you the spectrum of kindness that various people have and will end up finding people who are smart enough to give a shit about what others eat and will even feel empathy for your struggle and help you feel as comfortable with them as possible.",
          "created_utc": 1644741586.0
        }
      ]
    },
    {
      "id": "hws74bu",
      "author": "Familiar_Hold8167",
      "body": "A preference? Bro that’s not a preference, just a shitty thought process😭",
      "created_utc": 1644764118.0,
      "score": 1,
      "context": [
        {
          "id": "hwp717r",
          "author": "Familiar_Hold8167",
          "body": "At least now you know she’s a pos",
          "created_utc": 1644703333.0
        },
        {
          "id": "hwrjtd6",
          "author": "jizzyjazz2",
          "body": "Calm down man. it's shitty, but people are allowed to have a preference.",
          "created_utc": 1644749866.0
        }
      ]
    },
    {
      "id": "hwt11o8",
      "author": "bluejen",
      "body": "I hear you. I didn’t comment on the ADHD part because I don’t have that typical ADHD experience so it didn’t feel right to comment on that part. \n\nI can say though, regardless of what you’ve got going on… dating does get better. Just always choose yourself and stand by yourself and you’ll do fine. Sometimes that’s a skill that takes awhile to learn. For me it took awhile. But with time, you learn who you are and what you can offer and what you can reasonably expect of people and then it’s like the universe magically starts filtering the people it sends to you. Doesn’t mean you find your person straight away but it ends up being more fun to date.",
      "created_utc": 1644776383.0,
      "score": 2,
      "context": [
        {
          "id": "hwpt1u4",
          "author": "None",
          "body": "21m, considering just living the single life forever. ARFID and ADHD just makes relationships too difficult for me tbh.",
          "created_utc": 1644712801.0
        },
        {
          "id": "hwr96sg",
          "author": "bluejen",
          "body": "Yeah, not to sound condescending, but you’re 21… give it time. I’m not saying life magically gets easier but you’ll have more and more dating experiences that show you the spectrum of kindness that various people have and will end up finding people who are smart enough to give a shit about what others eat and will even feel empathy for your struggle and help you feel as comfortable with them as possible.",
          "created_utc": 1644741586.0
        },
        {
          "id": "hws0yqo",
          "author": "None",
          "body": "I get that, but it’s just as much the ADHD as the ARFID. Rejection sensitive dysphoria is a bitch. And while I’m a lot better than when I was a kid, it never goes away 100%. Meds do help a lot with it though.",
          "created_utc": 1644761170.0
        }
      ]
    }
  ]
}