{
  "id": "sy40uu",
  "subreddit": "ARFID",
  "author": "TheSisterFisterr29",
  "created_utc": 1645476566.0,
  "title": "credits to the account",
  "selftext": "",
  "url": "https://i.redd.it/nsb7oal419j81.jpg",
  "score": 136,
  "num_comments": 6,
  "comments": [
    {
      "id": "hxxubb2",
      "author": "kenzzi24",
      "body": "The worst. And always right after I’ve just restocked way too many of whatever it is this time. For a while there it was Little Debbie oatmeal crème pies. Like months. but now they’re out and I can’t even look at them. My currents are Chiobani Flips yogurt - but only a certain flavor - and cinnamon applesauce.  🤷🏼‍♀️",
      "created_utc": 1645515737.0,
      "score": 9,
      "context": []
    },
    {
      "id": "hxxrw7u",
      "author": "isakami02",
      "body": "this one brand of plant based nuggets, i love vegan food but the texture turned bad in the end",
      "created_utc": 1645513929.0,
      "score": 5,
      "context": []
    },
    {
      "id": "hxyb75j",
      "author": "braedizzle",
      "body": "I survived off peanut butter and jelly. Can’t eat it anymore. I miss it so bad.",
      "created_utc": 1645529667.0,
      "score": 4,
      "context": []
    },
    {
      "id": "hy6p0zd",
      "author": "m_grace2018",
      "body": "I used to love Schneiders hotdogs when I was younger. My mom went away one time for like a week and whenever I would tell my dad that I was hungry the first thing he offered me was a hotdog. The day my mom came back I was so excited. She asked me if I was hungry and I said I was. She then offered me (you guessed it) a hotdog. I just about cried, there was definitely tears in my eyes.\n\nI haven't had a hotdog since. I had enough in that week to last me a lifetime.",
      "created_utc": 1645669472.0,
      "score": 4,
      "context": []
    },
    {
      "id": "hxye8bd",
      "author": "Aspirience",
      "body": "And usually it happens just after I’ve decided that I’ve been obsessed long enough for me to savely buy more of it in bulk because I eat it every day anyways. Welp..",
      "created_utc": 1645531823.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hy5h0n0",
      "author": "LittleChickenNuggi",
      "body": "Me with chicken nuggets lol",
      "created_utc": 1645651015.0,
      "score": 2,
      "context": []
    }
  ]
}