{
  "id": "tbzmq8",
  "subreddit": "ARFID",
  "author": "m_grace2018",
  "created_utc": 1647031394.0,
  "title": "The Picky Eater's recovery Book",
  "selftext": "I ordered the Picky Eater's recovery book - Overcoming Avoidant/Restrictive Food Intake Disorder. and it just arrived today!\n\nFirst off, I wanted to tell you that they definitely aren't trivializing ARFID in what I've read so far (for those concerned about the title). Like I saw another reddit user suggest, it seems that they have picky in the title simply because it will be a keyword that will help more people find the book. For those who may not have gone in knowing about ARFID.\n\nI'm a bit more than a quarter of a way through the book (so still plenty more to go). However, even just having read this much it definitely seems like it was the right thing to do. If anyone is wondering if they should buy the book I would definitely encourage it (especially if you are unable to go to therapy, like me).\n\nWish me luck y'all. I'm really hopeful that this book is going to make a big difference in helping me overcome my ARFID. <3",
  "url": "https://www.reddit.com/r/ARFID/comments/tbzmq8/the_picky_eaters_recovery_book/",
  "score": 94,
  "num_comments": 23,
  "comments": [
    {
      "id": "i0bgqi1",
      "author": "kendraro",
      "body": "I read it for my loved one (that I am on this sub for) and I thought it was worthwhile. There are a few other books on amazon too, glad there is growing awareness.",
      "created_utc": 1647049446.0,
      "score": 16,
      "context": []
    },
    {
      "id": "i0bf5dy",
      "author": "Flowering-Tea-Plant",
      "body": "Good luck! Give us an update when you finish it if you feel like it :)",
      "created_utc": 1647048661.0,
      "score": 12,
      "context": []
    },
    {
      "id": "i0brxxt",
      "author": "nueve",
      "body": "I agree and recommend the book to all struggling with ARFID.",
      "created_utc": 1647055217.0,
      "score": 10,
      "context": []
    },
    {
      "id": "i0c3ij5",
      "author": "DeeniAwliya",
      "body": "Please do post all titles for books for Arfid, Im desperately need help to help my daughter",
      "created_utc": 1647061701.0,
      "score": 7,
      "context": []
    },
    {
      "id": "i0couxs",
      "author": "Imagineer_cam",
      "body": "Thanks. \nThis book has been sitting in my Amazon wishlist for awhile because I've been wondering if it's worth buying. Your the third person who's said it's worth reading so I think I'll try it in the near future.",
      "created_utc": 1647077700.0,
      "score": 5,
      "context": []
    },
    {
      "id": "i0d44f1",
      "author": "m_grace2018",
      "body": "In case anyone needs to know the authors are: Jennifer J. Thomas, Kendra R. Becker, and Kamryn T. Eddy.  It might be easier for you to find it with the authors. It's available on Amazon, I live in Ireland and was able to get from Easons (though I still could have gotten it on Amazon).",
      "created_utc": 1647089907.0,
      "score": 3,
      "context": []
    },
    {
      "id": "i0n6gax",
      "author": "ADHDAntlion",
      "body": "Thank you, I bought it too after i saw your post. Here's to starting a journey.",
      "created_utc": 1647280221.0,
      "score": 3,
      "context": []
    },
    {
      "id": "i0mcqxy",
      "author": "None",
      "body": "Just bought this book because of your post, and I’m starting it today!! \n\nThe case studies/sample patients in the book have been SO helpful so far for helping me find the language to talk about my own issues w food. I’m not currently seeing any professional\nabt this disorder, nor do I have an official diagnosis, but after reading the first few chapters, I’m sure this is what I needed. And now I can go to my therapist w/ a real resource! \n\nThank you for posting this rec!!",
      "created_utc": 1647268297.0,
      "score": 2,
      "context": []
    },
    {
      "id": "i0pgak1",
      "author": "ok-cali-1974",
      "body": "I bought this after this recommendation. Can't wait to get it! Hopefully will be able to get some good info to help my son. I also bought the book Nourishing Your Child Through An Eating Disorder. Hopefully, it can help me help him. Thank you for the recommendation!",
      "created_utc": 1647315281.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lkonlgb",
      "author": "Spud-81",
      "body": "Has this book helped anyone try new foods?",
      "created_utc": 1725031046.0,
      "score": 2,
      "context": []
    },
    {
      "id": "i0meurn",
      "author": "m_grace2018",
      "body": "You're welcome! I'm happy for you! :)",
      "created_utc": 1647269233.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m8rqx6d",
      "author": "None",
      "body": "Would this book be suitable for parents with a child who suffers from ARFID and possible anorexia comorbidity?",
      "created_utc": 1737658139.0,
      "score": 1,
      "context": []
    },
    {
      "id": "icuyflc",
      "author": "AlyeskaYoung",
      "body": "Awesome! I think I’ll check this book out. It’s good to know that there’s at least one solid resource out there. What do you think of the book if you’ve finished it?",
      "created_utc": 1655577600.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i0bumdv",
      "author": "Still-Swimming-5650",
      "body": "Any of them better than others?\n\nThis is literally the first resource I have seen for afrid.",
      "created_utc": 1647056637.0,
      "score": 5,
      "context": [
        {
          "id": "i0bgqi1",
          "author": "kendraro",
          "body": "I read it for my loved one (that I am on this sub for) and I thought it was worthwhile. There are a few other books on amazon too, glad there is growing awareness.",
          "created_utc": 1647049446.0
        }
      ]
    },
    {
      "id": "i0czpe2",
      "author": "m_grace2018",
      "body": "Will do ;)",
      "created_utc": 1647086817.0,
      "score": 2,
      "context": [
        {
          "id": "i0bf5dy",
          "author": "Flowering-Tea-Plant",
          "body": "Good luck! Give us an update when you finish it if you feel like it :)",
          "created_utc": 1647048661.0
        }
      ]
    },
    {
      "id": "i0d2s3n",
      "author": "m_grace2018",
      "body": "Also, if you haven't, maybe you could make a post about your daughter. If you give specifics about her situation there might be others within the community who could give you some really useful targeted advice. For example - including her triggers (is it sensory based, based on fear of negative consequences such as gagging or vomiting, a lack of interest in eating, or a combination). What are her safe foods. Knowing this we might be able to give you some useful information for next steps.",
      "created_utc": 1647089037.0,
      "score": 4,
      "context": [
        {
          "id": "i0c3ij5",
          "author": "DeeniAwliya",
          "body": "Please do post all titles for books for Arfid, Im desperately need help to help my daughter",
          "created_utc": 1647061701.0
        }
      ]
    },
    {
      "id": "i0d26rf",
      "author": "m_grace2018",
      "body": "This is the only book I have read/am reading, if I find and read anything more that is useful I will absolutely make sure to let you know though.\n\nIf you haven't read the book yet please do! I truly believe it could be of help to you in helping your daughter.\n\nThat said, I think it would be most helpful to those who are most eager to start their journey to recovery personally. I don't know how old your daughter is or how much she herself is eager to move on from her current state.\n\nStill I think there is useful information in the book regardless that will be helpful to you and your daughter.\n\nI would really encourage you to make it a dialogue between you and your daughter though, for her to see that this is really going to be beneficial to her life. The beginning of the book gives the user perspective on how AFRID influences their life in a self assessment type manner, these might be some good discussion points with your daughter.",
      "created_utc": 1647088629.0,
      "score": 2,
      "context": [
        {
          "id": "i0c3ij5",
          "author": "DeeniAwliya",
          "body": "Please do post all titles for books for Arfid, Im desperately need help to help my daughter",
          "created_utc": 1647061701.0
        }
      ]
    },
    {
      "id": "i0cuems",
      "author": "NotApplicableMC",
      "body": "I'd say it's definitely worth buying if you're an adult. It's very hard to find resources that aren't for \"parents of kids with ARFID\".",
      "created_utc": 1647082488.0,
      "score": 7,
      "context": [
        {
          "id": "i0couxs",
          "author": "Imagineer_cam",
          "body": "Thanks. \nThis book has been sitting in my Amazon wishlist for awhile because I've been wondering if it's worth buying. Your the third person who's said it's worth reading so I think I'll try it in the near future.",
          "created_utc": 1647077700.0
        }
      ]
    },
    {
      "id": "i0n7kst",
      "author": "m_grace2018",
      "body": "You're welcome! Yes indeed, good luck!",
      "created_utc": 1647280651.0,
      "score": 1,
      "context": [
        {
          "id": "i0n6gax",
          "author": "ADHDAntlion",
          "body": "Thank you, I bought it too after i saw your post. Here's to starting a journey.",
          "created_utc": 1647280221.0
        }
      ]
    },
    {
      "id": "mu52qa1",
      "author": "m_grace2018",
      "body": "Though it is mainly designed for someone who is ready to take on the challenge of undertaking dealing with their ARFID personally, I still think it is a valuable resource. I don't think I've ever come across another resource where I felt that the disorder was so thoroughly tackled and understood. I think I'll always recommend the book, but also if your child is young I think it will be helpful to look at resources that specifically targeted for children as well. Though I wouldn't be surprised if you have already done/are doing this. It is hard for me to speak on the comorbidity. I think certain principles would perhaps be helpful for both such as getting blood work done, food logs and and working to implement regular meals and snacks, at regular times. Also, though, if it really is anorexia/body image related as well, I don't know if something like a food log could be triggering? Although I think that could be something you help them with keeping track of, maybe? Ultimately I think it's something worth trying out. It can be so difficult to get actual help for this disorder, especially at a more accessable price. This I think can be somewhat helpful in helping someone help themselves. Or in helping someone help someone they care about. I don't think it will be something you regret. At the very least then it's there for your child in the future, when/if they they want to access this information.",
      "created_utc": 1748161439.0,
      "score": 1,
      "context": [
        {
          "id": "m8rqx6d",
          "author": "None",
          "body": "Would this book be suitable for parents with a child who suffers from ARFID and possible anorexia comorbidity?",
          "created_utc": 1737658139.0
        }
      ]
    },
    {
      "id": "i0d3fnf",
      "author": "m_grace2018",
      "body": "I can't say (as I've only read this one) what any others are like. However, this book definitely seems like a worthwhile investment and a great book to start with. This is the only book that I have constantly seen recommended as a really great resource, which is why I took the plunge. Also it is a great book in terms of the fact that it is not simply geared towards helping children as many ARFID books are. The book is very new and up to date. This may very well be one of the best, if not the best (non in person) resource out there.",
      "created_utc": 1647089469.0,
      "score": 7,
      "context": [
        {
          "id": "i0bgqi1",
          "author": "kendraro",
          "body": "I read it for my loved one (that I am on this sub for) and I thought it was worthwhile. There are a few other books on amazon too, glad there is growing awareness.",
          "created_utc": 1647049446.0
        },
        {
          "id": "i0bumdv",
          "author": "Still-Swimming-5650",
          "body": "Any of them better than others?\n\nThis is literally the first resource I have seen for afrid.",
          "created_utc": 1647056637.0
        }
      ]
    },
    {
      "id": "i0fd6ps",
      "author": "kendraro",
      "body": "The only other one I have read is Decoding Anorexia, which has lots of studies and information, but is not ARFID specific. It is also pretty expensive, though interesting info.",
      "created_utc": 1647126255.0,
      "score": 3,
      "context": [
        {
          "id": "i0bgqi1",
          "author": "kendraro",
          "body": "I read it for my loved one (that I am on this sub for) and I thought it was worthwhile. There are a few other books on amazon too, glad there is growing awareness.",
          "created_utc": 1647049446.0
        },
        {
          "id": "i0bumdv",
          "author": "Still-Swimming-5650",
          "body": "Any of them better than others?\n\nThis is literally the first resource I have seen for afrid.",
          "created_utc": 1647056637.0
        }
      ]
    },
    {
      "id": "i0d0gvl",
      "author": "m_grace2018",
      "body": "100%! This is something I forget to mention but will next time I update on the book. The book is catered to directly be helpful to a mature audience in a way that is so much better than a book that was simply for helping children with ARFID. (Though it can absolutely still be used to help parents, help their children).",
      "created_utc": 1647087392.0,
      "score": 3,
      "context": [
        {
          "id": "i0couxs",
          "author": "Imagineer_cam",
          "body": "Thanks. \nThis book has been sitting in my Amazon wishlist for awhile because I've been wondering if it's worth buying. Your the third person who's said it's worth reading so I think I'll try it in the near future.",
          "created_utc": 1647077700.0
        },
        {
          "id": "i0cuems",
          "author": "NotApplicableMC",
          "body": "I'd say it's definitely worth buying if you're an adult. It's very hard to find resources that aren't for \"parents of kids with ARFID\".",
          "created_utc": 1647082488.0
        }
      ]
    }
  ]
}