{
  "id": "tcvzd7",
  "subreddit": "ARFID",
  "author": "Lucille11",
  "created_utc": 1647135154.0,
  "title": "Restaurant items that don't include everything on the menu",
  "selftext": "I need to rant for a minute because this sub is the only place where I don't feel like a crazy person for venting about this. I recently went to a Hibachi grill for the first time. It would not have been my first pick, as I don't like any time of seafood, but the group I was with wanted to go and they said they also have chicken. \n\nAfter looking through the menu, I was happy to see that they had a chicken teriyaki dish that came with a side of white rice. Chicken and rice are both safe foods for me and I like teriyaki, so that sounded perfect. Some of the other dishes were described as being served with vegetable, shrimp, etc. But this one didn't, so I thought it would be fine. \n\nWhen they brought it out there were also cooked vegetables and the whole thing was mixed with onions. I hate drawing attention to myself and feel self conscious about my eating habits so I didn't say anything. I ate some of the chicken that was on top and away from the onions, but the further down I got, the more of the onion flavor it had. I eventually switched to just eating my rice, which, luckily, was served on the side.\n\nI just really wish the menu completely described everything served with a particular dish. If I had known there would be onions, I could have ordered it without, and thus would not have to either send it back or not enjoy my meal which was otherwise delicious. \n\nDoes anyone else feel this way?\n\nTL;DR: I wish restaurants put on the menu everything that comes with a particular dish, so if it comes with something you can't/don't eat, you can order it without.",
  "url": "https://www.reddit.com/r/ARFID/comments/tcvzd7/restaurant_items_that_dont_include_everything_on/",
  "score": 135,
  "num_comments": 23,
  "comments": [
    {
      "id": "i0fwjn2",
      "author": "RhenHarper",
      "body": "I totally agree. It’s wild that they don’t with as many allergies are out there. Seems super dangerous.",
      "created_utc": 1647135801.0,
      "score": 65,
      "context": []
    },
    {
      "id": "i0g59ms",
      "author": "YoWhatUpGlasgow",
      "body": "It sounds so minor but I ordered a margherita pizza when with friends at a place nearby and it came out with hundreds of chopped chives all over it. Apparently their chef adds chives on top of everything, OK cool maybe mention that on the menu so that I know to specifically ask them not to this time. I'd have been slightly more understanding if it was something reasonable (for example I don't like big chunks of whole tomato so when the menu fit a pizza says \"tomato\" I know there's a slight risk and can enquire (it's almost always just the sauce being referred to)) but even I, with my limited food knowledge know that chives don't normally come on a margherita pizza",
      "created_utc": 1647140360.0,
      "score": 37,
      "context": []
    },
    {
      "id": "i0ga5qs",
      "author": "deandratb",
      "body": "I absolutely feel this way. Potatoes are a relatively safe restaurant food for me, but it's so frustrating that cooks mix things into them without mentioning it. Because the only 'normal' restaurant meal I can usually order is breakfast, I've had to learn the hard way to always ask if there's onion or garlic in the breakfast potatoes/hash browns. They never say so on the menu! And I can't eat around that flavor, so when the food arrives is too late to find out.",
      "created_utc": 1647143017.0,
      "score": 23,
      "context": []
    },
    {
      "id": "i0g1gxq",
      "author": "fsocietyy",
      "body": "i feel the same way! this has been an issue for me so many times... to be honest i've only eaten in public at a restaurant twice since the pandemic started two years ago... and honestly i realized i really don't like eating out at all! but back to the point, they really should list all other items in the food!",
      "created_utc": 1647138365.0,
      "score": 16,
      "context": []
    },
    {
      "id": "i0gg4d0",
      "author": "Rand0mtask",
      "body": "yup, this is absolutely a nightmare for me\n\ncoincidentally, one of the many reasons i knew my wife was the one for me was when she introduced me to Ruth's Chris and made a point of letting me know it was 100% a-la-carte. You get *exactly* what you want. She knew how much that meant to me.",
      "created_utc": 1647146416.0,
      "score": 14,
      "context": []
    },
    {
      "id": "i0il99s",
      "author": "twixpie",
      "body": "Years ago I was excited to try a new restaurant that was pie based (since closed). The one I was going to get was a baked macaroni and cheese in a pie crust. All of those things individually are perfectly fine, and I'm comfy enough eating mixes of safe foods.\n\nWelp, the restaurant mixed diced onions into the cheese sauce. Bad times.\n\nI've gotten comfortable enough asking about onions. I can handle a bit of the flavour, but the sensation of biting into one is awful. I have a friend who is allergic to onions (but otherwise a very open eater, opposite of me) and she commiserates with me about secret onions in dishes.",
      "created_utc": 1647193838.0,
      "score": 9,
      "context": []
    },
    {
      "id": "i0gbb3b",
      "author": "mandelaXeffective",
      "body": "I relate so much. I recently was looking at a menu that had several different kinds of steak and cheese and some of them listed mayonnaise in the ingredients and some of them didn't, so I didn't feel like I could safely order any of them without running the risk of it having mayonnaise on it.",
      "created_utc": 1647143648.0,
      "score": 7,
      "context": []
    },
    {
      "id": "i0h4xua",
      "author": "AlphaFoxZankee",
      "body": "When I was a kid I HATED, genuinely DESPISED aromatic herbs. Every time I ordered a steak from the kids' menu, there was a bunch of mysterious tiny chopped green bits on it, that miraculously appeared on it since I ordered from the menu that didn't mention them. So often. Who puts thinly chopped parsley on the kids' menu? \n\nNow I can eat them, but I never see them anymore. The irony of life.",
      "created_utc": 1647164731.0,
      "score": 6,
      "context": []
    },
    {
      "id": "i0gu8g7",
      "author": "pileofpinecones",
      "body": "I love spinach artichoke dip but I always feel like I'm playing Russian roulette when I order it because I hate onions too, like OP. And they usually don't say on the menu if they are included or not",
      "created_utc": 1647155918.0,
      "score": 6,
      "context": []
    },
    {
      "id": "i0glkmj",
      "author": "OvercookedRedditor",
      "body": "I ordered a chicken bacon ranch quesadilla, no ranch sauce. Bunch of jalapeños on it, what???",
      "created_utc": 1647149779.0,
      "score": 3,
      "context": []
    },
    {
      "id": "i0hxc24",
      "author": "Rynoff",
      "body": "Absolutely, it’s always so panic inducing",
      "created_utc": 1647183602.0,
      "score": 3,
      "context": []
    },
    {
      "id": "i0i6j2b",
      "author": "xedtax",
      "body": "I really don’t mean to sound like a dick but as someone with ARFID, it’s best to just ask exactly what comes w the item u order beforehand.. and don’t be afraid to ask, it’s a fair question! it’s simply not practical for restaurants to list everything. Same for people w allergies",
      "created_utc": 1647187684.0,
      "score": 3,
      "context": []
    },
    {
      "id": "i0j1sqw",
      "author": "05blob",
      "body": "As someone who works in a cafe, always complain and send it back. We have burgers on our menu and for a while they came with coleslaw but with no mention of this on the menu, enough burgers were sent back that the next printing of the menu included the coleslaw listed with the burger. Some chefs have a weird view of food and sometimes won't list what they consider a 'common sense' ingredient on the menu (see onions in hashbrowns mentioned elsewhere in these comments, hashbrown with onion is the norm not the exception so of course restaurants don't put it on the menu) and it's on the customer to ask about allergens. Even if something isn't listed on the menu, they will have an allergen chart somewhere with every single allergen in each item.\n\nNever be afraid to ask all the questions when ordering, the staff would rather spend 5mins answering your questions then risk having to remake your order or for posts like this to end up on trip advisor. As long as you aren't rude about it nobody will care.",
      "created_utc": 1647200828.0,
      "score": 3,
      "context": []
    },
    {
      "id": "i0j5r28",
      "author": "latenightsadhours",
      "body": "yeah it’s really frustrating! something i do is look up the restaurant beforehand on google reviews and usually there is pictures of the food. it really helps a lot to see what im gonna get beforehand and if there’s any “extra surprises” haha.",
      "created_utc": 1647202560.0,
      "score": 3,
      "context": []
    },
    {
      "id": "i0j9oa5",
      "author": "None",
      "body": "Last night I ordered a Taco salad it had surprise green olives in it. Those don't belong in a fricken Taco salad to begin with. I couldn't eat it.",
      "created_utc": 1647204256.0,
      "score": 3,
      "context": []
    },
    {
      "id": "i0k52t1",
      "author": "suburbanstevens",
      "body": "Idk if it's a french thing but restaurants who add random salads to my plates have ruined so many dinners for me (especially because they always come with some sort of sauce that spills to the entire plate, or juicy tomatoes etc.) It makes it just so hard to try new places because you never know how many details they omit from their menu.\n\nLately I've started checking food pictures on Google reviews so I can see if the chef does weird stuff like putting chives on marguerita pizza.",
      "created_utc": 1647218172.0,
      "score": 2,
      "context": []
    },
    {
      "id": "i0uy9lr",
      "author": "BreadRecent",
      "body": "Once there was an option for a cheese sandwich at a sandwich shop (I can’t have anything on sandwiches other than cheese), but when I got it it had lettuce, tomatoes, onions, and all this other stuff that I had to force down in front of my coworkers and throw up later. Felt so sick the rest of the day. To be fair, I had a feeling it was too good to be true, but I trusted what it said. I am so with you on this one.",
      "created_utc": 1647417115.0,
      "score": 2,
      "context": []
    },
    {
      "id": "i0gm1ee",
      "author": "Gragegrl",
      "body": "100 percent!!!![",
      "created_utc": 1647150079.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i0ga4q4",
      "author": "kendraro",
      "body": "As someone with a million food allergies (they are sneeze allergies but still I don't want to eat things that make me sneeze!) I could not agree more!",
      "created_utc": 1647143001.0,
      "score": 10,
      "context": [
        {
          "id": "i0fwjn2",
          "author": "RhenHarper",
          "body": "I totally agree. It’s wild that they don’t with as many allergies are out there. Seems super dangerous.",
          "created_utc": 1647135801.0
        }
      ]
    },
    {
      "id": "i0g8rpv",
      "author": "fsocietyy",
      "body": "ive never heard of chives on pizza at all?! seems sorta out of place lol 😆",
      "created_utc": 1647142265.0,
      "score": 10,
      "context": [
        {
          "id": "i0g59ms",
          "author": "YoWhatUpGlasgow",
          "body": "It sounds so minor but I ordered a margherita pizza when with friends at a place nearby and it came out with hundreds of chopped chives all over it. Apparently their chef adds chives on top of everything, OK cool maybe mention that on the menu so that I know to specifically ask them not to this time. I'd have been slightly more understanding if it was something reasonable (for example I don't like big chunks of whole tomato so when the menu fit a pizza says \"tomato\" I know there's a slight risk and can enquire (it's almost always just the sauce being referred to)) but even I, with my limited food knowledge know that chives don't normally come on a margherita pizza",
          "created_utc": 1647140360.0
        }
      ]
    },
    {
      "id": "i0ggrnm",
      "author": "pinkpiggles",
      "body": "I read this as chives on a Margherita and I was picturing you scooping chives out of a frozen Margherita. Still gross on a pizza but much better than in a drink!",
      "created_utc": 1647146797.0,
      "score": 6,
      "context": [
        {
          "id": "i0g59ms",
          "author": "YoWhatUpGlasgow",
          "body": "It sounds so minor but I ordered a margherita pizza when with friends at a place nearby and it came out with hundreds of chopped chives all over it. Apparently their chef adds chives on top of everything, OK cool maybe mention that on the menu so that I know to specifically ask them not to this time. I'd have been slightly more understanding if it was something reasonable (for example I don't like big chunks of whole tomato so when the menu fit a pizza says \"tomato\" I know there's a slight risk and can enquire (it's almost always just the sauce being referred to)) but even I, with my limited food knowledge know that chives don't normally come on a margherita pizza",
          "created_utc": 1647140360.0
        }
      ]
    },
    {
      "id": "i0galc1",
      "author": "Lucille11",
      "body": "Those flavors especially are strong and it would be nice if they labeled them as \"garlic hasbrowns\" or \"hashbrowns with onion\" or something like that. I always feel so petty being upset about it, but it's such a simple thing that could easily be avoided if they just gave you the full information right away",
      "created_utc": 1647143255.0,
      "score": 12,
      "context": [
        {
          "id": "i0ga5qs",
          "author": "deandratb",
          "body": "I absolutely feel this way. Potatoes are a relatively safe restaurant food for me, but it's so frustrating that cooks mix things into them without mentioning it. Because the only 'normal' restaurant meal I can usually order is breakfast, I've had to learn the hard way to always ask if there's onion or garlic in the breakfast potatoes/hash browns. They never say so on the menu! And I can't eat around that flavor, so when the food arrives is too late to find out.",
          "created_utc": 1647143017.0
        }
      ]
    },
    {
      "id": "i0iqs1n",
      "author": "justalilnug",
      "body": "That would be a margarita then lol",
      "created_utc": 1647196110.0,
      "score": 3,
      "context": [
        {
          "id": "i0g59ms",
          "author": "YoWhatUpGlasgow",
          "body": "It sounds so minor but I ordered a margherita pizza when with friends at a place nearby and it came out with hundreds of chopped chives all over it. Apparently their chef adds chives on top of everything, OK cool maybe mention that on the menu so that I know to specifically ask them not to this time. I'd have been slightly more understanding if it was something reasonable (for example I don't like big chunks of whole tomato so when the menu fit a pizza says \"tomato\" I know there's a slight risk and can enquire (it's almost always just the sauce being referred to)) but even I, with my limited food knowledge know that chives don't normally come on a margherita pizza",
          "created_utc": 1647140360.0
        },
        {
          "id": "i0ggrnm",
          "author": "pinkpiggles",
          "body": "I read this as chives on a Margherita and I was picturing you scooping chives out of a frozen Margherita. Still gross on a pizza but much better than in a drink!",
          "created_utc": 1647146797.0
        }
      ]
    }
  ]
}