{
  "id": "tdz2w8",
  "subreddit": "ARFID",
  "author": "alrighteyaphrodite",
  "created_utc": 1647269025.0,
  "title": "the soul crushing disappointment of spending time/money preparing a new meal just to hate it",
  "selftext": "holy fuck am I so sick of wasting food. literally just so annoying. this is why i don’t try new things. \n\nat least my boyfriend ate some of it this time. although..it’s like such a kick in the ass watching him scarf down food that made me gag. glad it didn’t get wasted but it sure would’ve been nice if i enjoyed it half that much lmao",
  "url": "https://www.reddit.com/r/ARFID/comments/tdz2w8/the_soul_crushing_disappointment_of_spending/",
  "score": 91,
  "num_comments": 12,
  "comments": [
    {
      "id": "i0mqvuh",
      "author": "cappy412",
      "body": "I feel this. It’s why I usually will just take a couple bites of something my girlfriend is eating instead of going out of my way to make a whole new thing. It’s so overly stressful",
      "created_utc": 1647274213.0,
      "score": 13,
      "context": []
    },
    {
      "id": "i0pdwec",
      "author": "QuantumCow",
      "body": "you know what though? at least you tried!!! you did all the work of buying and cooking the food when you knew it might not work out but you did it anyway. and eventually you will find a new food you enjoy.\n\nyou've inspired me to try a new recipe soon. I have been eating basically only safe meals for the past few years and haven't tried to push it at all. progress is possible with time and patience. 10 years ago I couldn't imagine I'd be able to eat some foods that I now really enjoy.",
      "created_utc": 1647314088.0,
      "score": 9,
      "context": []
    },
    {
      "id": "i0n29i8",
      "author": "ThatchStelleri",
      "body": "Omg this. I live alone + don't have anyone to pass off a meal to or finish food before it goes bad in the fridge and I hate the food waste so much",
      "created_utc": 1647278601.0,
      "score": 6,
      "context": []
    },
    {
      "id": "i0n4g4w",
      "author": "chunkeymunkeyandrunt",
      "body": "I’m so glad my fiancé likes pretty much all food. If I want to try something new I just make sure he’s on board to eat it if I don’t like it! Or, if we’re eating out, I’ll tell him I’m interested in trying a bit of his food. That way I still order my safe food but can at least try his.",
      "created_utc": 1647279455.0,
      "score": 4,
      "context": []
    },
    {
      "id": "i0ocvh3",
      "author": "chuckfinleysmojito",
      "body": "I have started eating a lot of frozen appetizers bc you can make one or two to see how you like it. If I don’t like it someone at work will take the rest of the box, if I like it, I can make more, if I like it but don’t want any more at that moment, it stays frozen until next time ☺️",
      "created_utc": 1647297345.0,
      "score": 5,
      "context": []
    },
    {
      "id": "i0mujtd",
      "author": "giraffemoo",
      "body": "I've learned how to tweak recipes to fit my needs. It's not always possible but definitely worth a try!",
      "created_utc": 1647275628.0,
      "score": 3,
      "context": []
    },
    {
      "id": "i0p8lm9",
      "author": "dmlzr",
      "body": "What a fucking vibe. Drives me insane not being able to enjoy food like others.",
      "created_utc": 1647311616.0,
      "score": 3,
      "context": []
    },
    {
      "id": "i0p9n1p",
      "author": "isakami02",
      "body": "felt😭",
      "created_utc": 1647312097.0,
      "score": 2,
      "context": []
    },
    {
      "id": "i0piz5j",
      "author": "Venus-Death-Trap",
      "body": "Omg this is me. I take adderall xr and have NO appetite whatsoever so I have to force myself to eat. I’ll order take-out food to be delivered, have two bites and then I’m disgusted by it. Waste of money and food yayyyyy",
      "created_utc": 1647316677.0,
      "score": 2,
      "context": []
    },
    {
      "id": "i0thuxe",
      "author": "Kitten_Kupcake",
      "body": "I've just begun my journey addressing ARFID at 24 and it's been going okay so far with lots of family support,but I know how challenging it can be to actually find foods you're comfortable eating or adding a new food/veggie/fruit to your diet. I want to help and spread awareness about ARFID so I made a TikTok and will use it as a food diary to share some meal ideas I have that I think will be helpful in the community. Just started today so there's oy one video up, but I plan to have at least 2 or 3 more by the end of the week.\n\n[Buffalo Chicken Tortilla Wraps ](https://vm.tiktok.com/ZTdyEXsTY/?k=1)",
      "created_utc": 1647388381.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i0ms0ql",
      "author": "alrighteyaphrodite",
      "body": "dude that’s one of the awesome things about having a partner that eats normal. he’s always offering me shit with no pressure & I’ve found out I like so many things this way\n\nso jealous of him tho lol! it still surprises me how some people can literally just eat anything.",
      "created_utc": 1647274661.0,
      "score": 10,
      "context": [
        {
          "id": "i0mqvuh",
          "author": "cappy412",
          "body": "I feel this. It’s why I usually will just take a couple bites of something my girlfriend is eating instead of going out of my way to make a whole new thing. It’s so overly stressful",
          "created_utc": 1647274213.0
        }
      ]
    },
    {
      "id": "i0t3li0",
      "author": "alrighteyaphrodite",
      "body": "thank you this comment is so sweet this actually made me feel a lot better 😭😊 good luck i hope you find some more foods you like",
      "created_utc": 1647382332.0,
      "score": 3,
      "context": [
        {
          "id": "i0pdwec",
          "author": "QuantumCow",
          "body": "you know what though? at least you tried!!! you did all the work of buying and cooking the food when you knew it might not work out but you did it anyway. and eventually you will find a new food you enjoy.\n\nyou've inspired me to try a new recipe soon. I have been eating basically only safe meals for the past few years and haven't tried to push it at all. progress is possible with time and patience. 10 years ago I couldn't imagine I'd be able to eat some foods that I now really enjoy.",
          "created_utc": 1647314088.0
        }
      ]
    }
  ]
}