{
  "id": "tpprws",
  "subreddit": "ARFID",
  "author": "Lonely_Custard_5838",
  "created_utc": 1648405269.0,
  "title": "I Survived ARFID",
  "selftext": "I wanted to share this here in hopes of giving somebody encouragement and hope that it DOES get better.\n\nMAJOR trigger warning: I go into detail about my relapse into a very severe case of ARFID.\n\nLast year, I experienced perhaps one of if not the worst experiences of my entire life. I’ve had ARFID for as long as I can remember, but it spiked due to an anxiety disorder, and not only was I sensitive to textures, but the sensitivity turned into an irrational fear of swallowing.\n\nI slowly lost the ability to eat solid food, and even soups with seasoning due to constantly choking from my body having literally forgotten how to swallow. The state of my body slowly began to deteriorate. I dropped to about 85 pounds at my worst.\n\nI was only consuming maybe 200 calories a day. My fear of choking was so debilitating that I refused to eat alone. I would wait for my mother to come home for lunch and try to consume anything I could within a 30 minute window, I was starving but my body couldn’t eat, and just drinking wasn’t nearly enough.\n\nI had shrunken to such a small size that I couldn’t work on my art anymore. My hands were so thin that my fingers made me sick just looking at them, and the sight of my hip bones in the mirror felt disgusting, and I was still so hungry.\n\nWe were begging my doctor for help, but nothing seemed to be working. I finally began to see a therapist, a woman who had recently cured another young woman of a similar eating disorder, almost identical to mine.\n\nMy exposure therapy began and I learned to feel my throat when I swallowed, not to avoid it, but it took awhile. I slowly worked my way up a literal food pyramid, from soft to progressively more and more solid foods. It took months. \n\nBy the time I started exposure therapy, my stomach had shrunken down so much that I could only eat about half of the breading of a single chicken nugget (which at this point would take me around 30 minutes to swallow) before feeling completely full. It sounds pathetically hilarious, I can laugh at it now, but it really sucked then.\n\nMy exposure therapy began with having me eat one of the lower tier foods on call with my therapist, and my mother to keep watch in the room. It took me the full hour of our session to eat one quarter of my meal. The positive reinforcement felt relieving and I felt safe, but I also was so glad to eat. I was scared but I was so desperate to eat that it almost didn’t matter, even if I could only eat a quarter of it I was so thankful to have something that wasn’t soup in my stomach.\n\nI was still in therapy when thanksgiving rolled around, and Christmas as well. It was torture but for once I was glad that the pandemic had prevented me from being around so many family members. Of course I couldn’t eat much, and my body was still so thin and exhausted, I could only stand for 5 minutes to decorate the Christmas tree before feeling too weak to stand.\n\nBy the time the new year rolled around, I was eating more solid foods, and my stomach finally began to grow again. It was a slog eating enough calories in one day. You don’t realize how much you eat in one day until it becomes a chore to do. Eating three times a day when your stomach isn’t big enough to carry that much is painful, and stressful, especially considering how long it would take me to eat anything. But my hunger was finally subsiding and that’s all I cared about.\n\nMy therapist had me establish a goal to reach by the end of my therapy.\nMy goal was to be able to eat a sandwich all alone in the house, on call with my therapist. I finally reached that goal after almost 7 months in therapy, at 85 pounds. It took me 2-3 more months of therapy to learn how to eat by myself again, and another 2-3 months of no therapy the become self sufficient. So about a full year from start to finish.\n\nA year after my last day of exposure therapy, I’ve gained ten pounds and can take care of myself again. My stomach size is back to normal, and I can finally eat full solid meals like I used to, except now I’m more comfortable eating than I’ve ever been in my whole life.\n\nIt gets better, and it’s okay to ask for help. Hoping everyone here succeeds in all that they wish to accomplish 👍\n\nAlso I did not check for spelling so I apologize if anything is wonky lol.",
  "url": "https://www.reddit.com/r/ARFID/comments/tpprws/i_survived_arfid/",
  "score": 127,
  "num_comments": 25,
  "comments": [
    {
      "id": "i2cjvzr",
      "author": "Shiva-333",
      "body": "Congrats!  This is a brilliant account of your journey, very tangible to read.  You should consider writing a piece to publish.  It would help the millions of people who live with ARFID and have no idea what is happening or what to do about it.",
      "created_utc": 1648408758.0,
      "score": 21,
      "context": []
    },
    {
      "id": "i2dakkw",
      "author": "idahopancakes",
      "body": "Thank you for sharing this, and AMAZING progress!!",
      "created_utc": 1648421169.0,
      "score": 10,
      "context": []
    },
    {
      "id": "i2cq8pg",
      "author": "whats1more7",
      "body": "Thank you so much for sharing your story. My son is 14 and we’re pretty sure he has ARFID triggered by a combination of factors. It’s nice to know that once he’s willing to get help to expand his safe foods there is therapy out there that works.",
      "created_utc": 1648411536.0,
      "score": 6,
      "context": []
    },
    {
      "id": "i2cwnn8",
      "author": "SherlockLady",
      "body": "This is awesome! Congratulations!!!!!",
      "created_utc": 1648414459.0,
      "score": 3,
      "context": []
    },
    {
      "id": "i2ksy3y",
      "author": "wan02",
      "body": "My goodness this sounds like the path my daughter is heading.\n\nMy wife is doing a lot to get her into a treatment program, but due to insurance issues, weird bureaucratic issues with medical institutions, etc, this has been a battle.\n\nDo you mind if I ask you how old you are, and what part of the world you are in?\n\nI'm happy to hear you survived, and are getting better.",
      "created_utc": 1648569019.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ilrhtix",
      "author": "orionis_",
      "body": "This is an incredibly familiar story! I’m (unfortunately) still in the depths of it, I feel like I have to force a swallow for even liquids, and hot liquids feel impossible! I was able to get to very soft solids like mashed potatoes once if I could wash them down, but I feel stuck with this overwhelming fear just generally and when I think of trying everything else. I miss food a lot though. 🥲 Do you have any advice on what kind of therapy I should look for or anything I could do to lessen my fear? It heavily surrounds the fear of choking so I’m struggling a LOT these days.",
      "created_utc": 1661450433.0,
      "score": 2,
      "context": []
    },
    {
      "id": "i2ck0yd",
      "author": "Lonely_Custard_5838",
      "body": "Thank you so much! I’ve never considered writing anything before. Perhaps if I had the time.",
      "created_utc": 1648408818.0,
      "score": 8,
      "context": [
        {
          "id": "i2cjvzr",
          "author": "Shiva-333",
          "body": "Congrats!  This is a brilliant account of your journey, very tangible to read.  You should consider writing a piece to publish.  It would help the millions of people who live with ARFID and have no idea what is happening or what to do about it.",
          "created_utc": 1648408758.0
        }
      ]
    },
    {
      "id": "i2g3tmg",
      "author": "Lonely_Custard_5838",
      "body": "Thank you!💕",
      "created_utc": 1648480978.0,
      "score": 2,
      "context": [
        {
          "id": "i2dakkw",
          "author": "idahopancakes",
          "body": "Thank you for sharing this, and AMAZING progress!!",
          "created_utc": 1648421169.0
        }
      ]
    },
    {
      "id": "i2cyczf",
      "author": "PixelVector",
      "body": "Absolutely. I had zero progress on new foods for 27 years.\n\nI was convinced therapists/doctors didn't really know of ARFID unless they were far off specialists, so I never brought it up to the therapist I had for anxiety/depression treatment. Then one day it happened to come up in a session. As I started to explain she immediately told me she knew what it was and that she wants to start treatment right away if I was interested.\n\nWe're at about 8 months into our treatment plan largely using exposure therapy with slow build ups. Our major goal at 6 months was for me to go to a restaurant and order a salad from the menu and I achieved that and more. I had near zero vegetables prior. Mostly just pizza, bread, mac and cheese. Foods I'm comfortable eating way more than tripled and I'm not nearly as avoidant of trying new things or making slight adjustments on existing safe meals.\n\nIt can take time. And it isn't easy. And progress can be slow. But thankfully, ARFID is finally getting more notice and being taught to new therapists alongside other eating disorders. There's more awareness. More people that can help. It should only improve from here.",
      "created_utc": 1648415248.0,
      "score": 9,
      "context": [
        {
          "id": "i2cq8pg",
          "author": "whats1more7",
          "body": "Thank you so much for sharing your story. My son is 14 and we’re pretty sure he has ARFID triggered by a combination of factors. It’s nice to know that once he’s willing to get help to expand his safe foods there is therapy out there that works.",
          "created_utc": 1648411536.0
        }
      ]
    },
    {
      "id": "i2d69mr",
      "author": "Lonely_Custard_5838",
      "body": "Thank you!",
      "created_utc": 1648419023.0,
      "score": 3,
      "context": [
        {
          "id": "i2cwnn8",
          "author": "SherlockLady",
          "body": "This is awesome! Congratulations!!!!!",
          "created_utc": 1648414459.0
        }
      ]
    },
    {
      "id": "i2kt7wf",
      "author": "Lonely_Custard_5838",
      "body": "Thanks, I hope your daughter is okay!\n\nAt the time when I started treatment I was 17, about to turn 18, so I went to see a child and family phycologist. I live in the US.",
      "created_utc": 1648569125.0,
      "score": 1,
      "context": [
        {
          "id": "i2ksy3y",
          "author": "wan02",
          "body": "My goodness this sounds like the path my daughter is heading.\n\nMy wife is doing a lot to get her into a treatment program, but due to insurance issues, weird bureaucratic issues with medical institutions, etc, this has been a battle.\n\nDo you mind if I ask you how old you are, and what part of the world you are in?\n\nI'm happy to hear you survived, and are getting better.",
          "created_utc": 1648569019.0
        }
      ]
    },
    {
      "id": "ilriufq",
      "author": "Lonely_Custard_5838",
      "body": "Hi! I’m so sorry you’re struggling with it, I went to a family and childcare phycologist center even though I was 18, and since it was during the pandemic I did telehealth exposure therapy. My therapist had treated someone with ARFID before, which is why we chose her. I recommend inquiring about ARFID with a therapist while you’re looking for one, if they seem confident and understanding of your condition, go ahead and try them out!",
      "created_utc": 1661450830.0,
      "score": 2,
      "context": [
        {
          "id": "ilrhtix",
          "author": "orionis_",
          "body": "This is an incredibly familiar story! I’m (unfortunately) still in the depths of it, I feel like I have to force a swallow for even liquids, and hot liquids feel impossible! I was able to get to very soft solids like mashed potatoes once if I could wash them down, but I feel stuck with this overwhelming fear just generally and when I think of trying everything else. I miss food a lot though. 🥲 Do you have any advice on what kind of therapy I should look for or anything I could do to lessen my fear? It heavily surrounds the fear of choking so I’m struggling a LOT these days.",
          "created_utc": 1661450433.0
        }
      ]
    },
    {
      "id": "ilrk8c0",
      "author": "Lonely_Custard_5838",
      "body": "My therapist went through the steps of what the fear looks like in my head, and then we talked about how rare it is to choke and how difficult it is to actually choke on something. She also taught me to feel my throat when I swallow, and become very acquainted with it and how it feels.\n\nThis helped me a lot with the liquids: you will NEVER choke on a liquid. Ever. And mashed potatoes and soft foods cannot choke you either, it’s impossible. Chewing your food makes it impossible to choke on it, you will never choke and it’s so rare for someone to choke to a dangerous extent, you will not die from it. We also spoke about how many people I knew who suffered from a terrible choking episode, and if so how many? It’s very very rare, you are unlikely to be hurt at all especially if you chew solid foods properly. And your safe foods your eating now cannot hurt you, it feels scary but it’s impossible for the food you’re eating now to hurt you.\n\nThe fear and choked up feeling you get is what’s causing your body to feel like it’s choking, sometimes it’s the mucus in your throat that makes it difficult to swallow, but that’s completely normal and it is also impossible for it to be able to hurt you.\n\nYou’re doing great and I’m telling you now that what you’re eating is not going to harm you in any way because it is physically impossible for it to hurt you at all.",
      "created_utc": 1661451370.0,
      "score": 2,
      "context": [
        {
          "id": "ilrhtix",
          "author": "orionis_",
          "body": "This is an incredibly familiar story! I’m (unfortunately) still in the depths of it, I feel like I have to force a swallow for even liquids, and hot liquids feel impossible! I was able to get to very soft solids like mashed potatoes once if I could wash them down, but I feel stuck with this overwhelming fear just generally and when I think of trying everything else. I miss food a lot though. 🥲 Do you have any advice on what kind of therapy I should look for or anything I could do to lessen my fear? It heavily surrounds the fear of choking so I’m struggling a LOT these days.",
          "created_utc": 1661450433.0
        }
      ]
    },
    {
      "id": "i2lyegp",
      "author": "Shiva-333",
      "body": "Do you mind if I use some of the content from your post in a blog on my therapy website?  This can really inspire and help people.",
      "created_utc": 1648584748.0,
      "score": 1,
      "context": [
        {
          "id": "i2cjvzr",
          "author": "Shiva-333",
          "body": "Congrats!  This is a brilliant account of your journey, very tangible to read.  You should consider writing a piece to publish.  It would help the millions of people who live with ARFID and have no idea what is happening or what to do about it.",
          "created_utc": 1648408758.0
        },
        {
          "id": "i2ck0yd",
          "author": "Lonely_Custard_5838",
          "body": "Thank you so much! I’ve never considered writing anything before. Perhaps if I had the time.",
          "created_utc": 1648408818.0
        }
      ]
    },
    {
      "id": "i2g3uva",
      "author": "exclaim_bot",
      "body": ">Thank you!💕\n\nYou're welcome!",
      "created_utc": 1648480992.0,
      "score": 1,
      "context": [
        {
          "id": "i2dakkw",
          "author": "idahopancakes",
          "body": "Thank you for sharing this, and AMAZING progress!!",
          "created_utc": 1648421169.0
        },
        {
          "id": "i2g3tmg",
          "author": "Lonely_Custard_5838",
          "body": "Thank you!💕",
          "created_utc": 1648480978.0
        }
      ]
    },
    {
      "id": "i2d694k",
      "author": "Lonely_Custard_5838",
      "body": "Yes this^, it will take time for your son to grow more comfortable, but it will be very beneficial. I would suggest when looking for therapists that you ask them specifically about ARFID, and if they have been able to help others prior to your son (such as my therapist) then that’s even better.",
      "created_utc": 1648419017.0,
      "score": 3,
      "context": [
        {
          "id": "i2cq8pg",
          "author": "whats1more7",
          "body": "Thank you so much for sharing your story. My son is 14 and we’re pretty sure he has ARFID triggered by a combination of factors. It’s nice to know that once he’s willing to get help to expand his safe foods there is therapy out there that works.",
          "created_utc": 1648411536.0
        },
        {
          "id": "i2cyczf",
          "author": "PixelVector",
          "body": "Absolutely. I had zero progress on new foods for 27 years.\n\nI was convinced therapists/doctors didn't really know of ARFID unless they were far off specialists, so I never brought it up to the therapist I had for anxiety/depression treatment. Then one day it happened to come up in a session. As I started to explain she immediately told me she knew what it was and that she wants to start treatment right away if I was interested.\n\nWe're at about 8 months into our treatment plan largely using exposure therapy with slow build ups. Our major goal at 6 months was for me to go to a restaurant and order a salad from the menu and I achieved that and more. I had near zero vegetables prior. Mostly just pizza, bread, mac and cheese. Foods I'm comfortable eating way more than tripled and I'm not nearly as avoidant of trying new things or making slight adjustments on existing safe meals.\n\nIt can take time. And it isn't easy. And progress can be slow. But thankfully, ARFID is finally getting more notice and being taught to new therapists alongside other eating disorders. There's more awareness. More people that can help. It should only improve from here.",
          "created_utc": 1648415248.0
        }
      ]
    },
    {
      "id": "i2ktfzj",
      "author": "wan02",
      "body": "Thanks for responding so quickly\n\nI'm in IL, and eating disorder treatment options are so damn rare here.",
      "created_utc": 1648569213.0,
      "score": 1,
      "context": [
        {
          "id": "i2ksy3y",
          "author": "wan02",
          "body": "My goodness this sounds like the path my daughter is heading.\n\nMy wife is doing a lot to get her into a treatment program, but due to insurance issues, weird bureaucratic issues with medical institutions, etc, this has been a battle.\n\nDo you mind if I ask you how old you are, and what part of the world you are in?\n\nI'm happy to hear you survived, and are getting better.",
          "created_utc": 1648569019.0
        },
        {
          "id": "i2kt7wf",
          "author": "Lonely_Custard_5838",
          "body": "Thanks, I hope your daughter is okay!\n\nAt the time when I started treatment I was 17, about to turn 18, so I went to see a child and family phycologist. I live in the US.",
          "created_utc": 1648569125.0
        }
      ]
    },
    {
      "id": "l11gujw",
      "author": "Muma34",
      "body": "Hi 👋  thank you for sharing! I know this post is old but it's reassuring I'm not alone. I'm currently going through this now and any tips or reassurance would be truly grateful. I am starting to struggle with fluids too 😞 it's so bloody exhausting ❤️ how are you doing now? Have you fully recovered? Xx",
      "created_utc": 1713964687.0,
      "score": 2,
      "context": [
        {
          "id": "ilrhtix",
          "author": "orionis_",
          "body": "This is an incredibly familiar story! I’m (unfortunately) still in the depths of it, I feel like I have to force a swallow for even liquids, and hot liquids feel impossible! I was able to get to very soft solids like mashed potatoes once if I could wash them down, but I feel stuck with this overwhelming fear just generally and when I think of trying everything else. I miss food a lot though. 🥲 Do you have any advice on what kind of therapy I should look for or anything I could do to lessen my fear? It heavily surrounds the fear of choking so I’m struggling a LOT these days.",
          "created_utc": 1661450433.0
        },
        {
          "id": "ilrk8c0",
          "author": "Lonely_Custard_5838",
          "body": "My therapist went through the steps of what the fear looks like in my head, and then we talked about how rare it is to choke and how difficult it is to actually choke on something. She also taught me to feel my throat when I swallow, and become very acquainted with it and how it feels.\n\nThis helped me a lot with the liquids: you will NEVER choke on a liquid. Ever. And mashed potatoes and soft foods cannot choke you either, it’s impossible. Chewing your food makes it impossible to choke on it, you will never choke and it’s so rare for someone to choke to a dangerous extent, you will not die from it. We also spoke about how many people I knew who suffered from a terrible choking episode, and if so how many? It’s very very rare, you are unlikely to be hurt at all especially if you chew solid foods properly. And your safe foods your eating now cannot hurt you, it feels scary but it’s impossible for the food you’re eating now to hurt you.\n\nThe fear and choked up feeling you get is what’s causing your body to feel like it’s choking, sometimes it’s the mucus in your throat that makes it difficult to swallow, but that’s completely normal and it is also impossible for it to be able to hurt you.\n\nYou’re doing great and I’m telling you now that what you’re eating is not going to harm you in any way because it is physically impossible for it to hurt you at all.",
          "created_utc": 1661451370.0
        }
      ]
    },
    {
      "id": "i2lz9c2",
      "author": "Lonely_Custard_5838",
      "body": "Go right ahead. Just link this back and make sure to add that it’s cited from a survivor’s personal record and not a Doctor or anybody with those types of credentials haha. I’d love to see your blog!",
      "created_utc": 1648585077.0,
      "score": 1,
      "context": [
        {
          "id": "i2cjvzr",
          "author": "Shiva-333",
          "body": "Congrats!  This is a brilliant account of your journey, very tangible to read.  You should consider writing a piece to publish.  It would help the millions of people who live with ARFID and have no idea what is happening or what to do about it.",
          "created_utc": 1648408758.0
        },
        {
          "id": "i2ck0yd",
          "author": "Lonely_Custard_5838",
          "body": "Thank you so much! I’ve never considered writing anything before. Perhaps if I had the time.",
          "created_utc": 1648408818.0
        },
        {
          "id": "i2lyegp",
          "author": "Shiva-333",
          "body": "Do you mind if I use some of the content from your post in a blog on my therapy website?  This can really inspire and help people.",
          "created_utc": 1648584748.0
        }
      ]
    },
    {
      "id": "i2kwojj",
      "author": "Lonely_Custard_5838",
      "body": "I’m sorry to hear that, if you can find a good therapist or phycologist for your daughter then that should help her tremendously. I wouldn’t suggest seeing any medical doctors for treatment, since ARFID is mostly a phycological and fear based disorder, medical doctors will be of very little help.\n\nHere are some foods I ate while I was recovering that may help your daughter (if you want)\n\nSmoothie’s (blended frozen fruits and vegetables are good), I really liked peanut butter and banana smoothie’s, easy to swallow since it’s not solid. A large portion that she can take her time with should be fine, make sure it’s in a container she feels safe drinking from.\n\nEnsure’s or protein drinks are great ways of getting in a lot of calories. They’re generally sold in pharmacy’s off the shelf or near the dairy section.\n\nSoups (soup at hands are good), potato soup is a good filling food as well, if she doesn’t mind potato chunks.\n\nYogurt, my parents would get me those yogurts that came with m&m’s since they would dissolve into the yogurt, so I’d feel more inclined to eat it.\n\nSoft scrambled eggs. If you put your stove on low heat and beat at the eggs in the pan then they’ll be mushy enough that they’re barely solid anymore. Put a lot of butter in the pan before hand to help with the mushy consistency.\n\nMake sure to look for lots of different foods she can eat and cycle through new ones regularly. At least for me, eating the same things for months on end made me feel worse about my condition, and it will make her body feel better to have lots of different options. There’s tons of other foods on the subreddit that people have posted but those were just some of my safe foods. I hope things get better soon.\n\nI know for my parents it was difficult to see me go through what happened, so I feel great sympathy for you guys, just know that she’s going to be okay, ARFID seems impossible to fix when it’s at its worst but once she starts recovering it will happen fast, just make sure that ultimately she feels safe. If she has anxiety or is home alone often because of the pandemic then quality time with her might help to ease any of the anxiety she might have. Anxiety is what makes ARFID so harmful, and anything she’s anxious about can trigger it, making her feel relaxed will be the most helpful thing for her.\n\nKeeping you guys in my thoughts, I hope everything goes well. If you need anything don’t hesitate to message me either!",
      "created_utc": 1648570451.0,
      "score": 1,
      "context": [
        {
          "id": "i2ksy3y",
          "author": "wan02",
          "body": "My goodness this sounds like the path my daughter is heading.\n\nMy wife is doing a lot to get her into a treatment program, but due to insurance issues, weird bureaucratic issues with medical institutions, etc, this has been a battle.\n\nDo you mind if I ask you how old you are, and what part of the world you are in?\n\nI'm happy to hear you survived, and are getting better.",
          "created_utc": 1648569019.0
        },
        {
          "id": "i2kt7wf",
          "author": "Lonely_Custard_5838",
          "body": "Thanks, I hope your daughter is okay!\n\nAt the time when I started treatment I was 17, about to turn 18, so I went to see a child and family phycologist. I live in the US.",
          "created_utc": 1648569125.0
        },
        {
          "id": "i2ktfzj",
          "author": "wan02",
          "body": "Thanks for responding so quickly\n\nI'm in IL, and eating disorder treatment options are so damn rare here.",
          "created_utc": 1648569213.0
        }
      ]
    },
    {
      "id": "i2kx580",
      "author": "Lonely_Custard_5838",
      "body": "I forgot to mention, but just a personal therapist that she can grow close to might be more helpful than a program dedicated to curing eating disorders specifically. (And I might be wrong but I think insurance will cover the cost more, depending on your options) just make sure that any therapist you look for knows what ARFID or “fear based” eating disorders are.",
      "created_utc": 1648570628.0,
      "score": 1,
      "context": [
        {
          "id": "i2ksy3y",
          "author": "wan02",
          "body": "My goodness this sounds like the path my daughter is heading.\n\nMy wife is doing a lot to get her into a treatment program, but due to insurance issues, weird bureaucratic issues with medical institutions, etc, this has been a battle.\n\nDo you mind if I ask you how old you are, and what part of the world you are in?\n\nI'm happy to hear you survived, and are getting better.",
          "created_utc": 1648569019.0
        },
        {
          "id": "i2kt7wf",
          "author": "Lonely_Custard_5838",
          "body": "Thanks, I hope your daughter is okay!\n\nAt the time when I started treatment I was 17, about to turn 18, so I went to see a child and family phycologist. I live in the US.",
          "created_utc": 1648569125.0
        },
        {
          "id": "i2ktfzj",
          "author": "wan02",
          "body": "Thanks for responding so quickly\n\nI'm in IL, and eating disorder treatment options are so damn rare here.",
          "created_utc": 1648569213.0
        }
      ]
    },
    {
      "id": "l11qujg",
      "author": "Lonely_Custard_5838",
      "body": "Aw dang I haven’t read this post in ages.\n\nHi! Sorry you’re going through this, it absolutely sucks. I would like to say I’m fully recovered now, I will always eat tenderly and slowly and I don’t think that will ever change, but it reassures me! Just know that you will not choke on liquids, what helped me was knowing that I was completely safe eating things like yogurt or soup.\n\nIf you’re not in therapy already I highly encourage you to start that as soon as possible. Just having somebody to teach me the skills to reassure myself when I eat was the biggest help and support that I needed, and I was back to eating solids in a matter of months.\n\nAs long as you have the skills to reassure yourself, you will get better. Just know that you are completely safe while eating soft foods, especially when you’re only taking in liquids. You will feel safe eating solids again with extra support.",
      "created_utc": 1713968432.0,
      "score": 1,
      "context": [
        {
          "id": "ilrhtix",
          "author": "orionis_",
          "body": "This is an incredibly familiar story! I’m (unfortunately) still in the depths of it, I feel like I have to force a swallow for even liquids, and hot liquids feel impossible! I was able to get to very soft solids like mashed potatoes once if I could wash them down, but I feel stuck with this overwhelming fear just generally and when I think of trying everything else. I miss food a lot though. 🥲 Do you have any advice on what kind of therapy I should look for or anything I could do to lessen my fear? It heavily surrounds the fear of choking so I’m struggling a LOT these days.",
          "created_utc": 1661450433.0
        },
        {
          "id": "ilrk8c0",
          "author": "Lonely_Custard_5838",
          "body": "My therapist went through the steps of what the fear looks like in my head, and then we talked about how rare it is to choke and how difficult it is to actually choke on something. She also taught me to feel my throat when I swallow, and become very acquainted with it and how it feels.\n\nThis helped me a lot with the liquids: you will NEVER choke on a liquid. Ever. And mashed potatoes and soft foods cannot choke you either, it’s impossible. Chewing your food makes it impossible to choke on it, you will never choke and it’s so rare for someone to choke to a dangerous extent, you will not die from it. We also spoke about how many people I knew who suffered from a terrible choking episode, and if so how many? It’s very very rare, you are unlikely to be hurt at all especially if you chew solid foods properly. And your safe foods your eating now cannot hurt you, it feels scary but it’s impossible for the food you’re eating now to hurt you.\n\nThe fear and choked up feeling you get is what’s causing your body to feel like it’s choking, sometimes it’s the mucus in your throat that makes it difficult to swallow, but that’s completely normal and it is also impossible for it to be able to hurt you.\n\nYou’re doing great and I’m telling you now that what you’re eating is not going to harm you in any way because it is physically impossible for it to hurt you at all.",
          "created_utc": 1661451370.0
        },
        {
          "id": "l11gujw",
          "author": "Muma34",
          "body": "Hi 👋  thank you for sharing! I know this post is old but it's reassuring I'm not alone. I'm currently going through this now and any tips or reassurance would be truly grateful. I am starting to struggle with fluids too 😞 it's so bloody exhausting ❤️ how are you doing now? Have you fully recovered? Xx",
          "created_utc": 1713964687.0
        }
      ]
    },
    {
      "id": "i2m029f",
      "author": "Shiva-333",
      "body": "ABSOLUTELY!!!  This is all the more powerful because it's YOUR story.  I'll link you in when I have posted and you can have executive control of how it looks. Maybe it will get you working on that memoirs ;)",
      "created_utc": 1648585380.0,
      "score": 2,
      "context": [
        {
          "id": "i2cjvzr",
          "author": "Shiva-333",
          "body": "Congrats!  This is a brilliant account of your journey, very tangible to read.  You should consider writing a piece to publish.  It would help the millions of people who live with ARFID and have no idea what is happening or what to do about it.",
          "created_utc": 1648408758.0
        },
        {
          "id": "i2ck0yd",
          "author": "Lonely_Custard_5838",
          "body": "Thank you so much! I’ve never considered writing anything before. Perhaps if I had the time.",
          "created_utc": 1648408818.0
        },
        {
          "id": "i2lyegp",
          "author": "Shiva-333",
          "body": "Do you mind if I use some of the content from your post in a blog on my therapy website?  This can really inspire and help people.",
          "created_utc": 1648584748.0
        },
        {
          "id": "i2lz9c2",
          "author": "Lonely_Custard_5838",
          "body": "Go right ahead. Just link this back and make sure to add that it’s cited from a survivor’s personal record and not a Doctor or anybody with those types of credentials haha. I’d love to see your blog!",
          "created_utc": 1648585077.0
        }
      ]
    },
    {
      "id": "l11x717",
      "author": "Muma34",
      "body": "Thank you so much 💓 \n\nAnd we'll done you on your recovery 👏😀 I'm so happy for you and knowing there's hope at the end is reassuring.\n\nI'm currently waiting on cbt therapy and on medication for my anxiety, it's only been 6-7 weeks when this fear started bit it truly feels a life time 😞\n\nI can manage yogurt,custard, mash and soup which takes me 2 hours to eat 🙈 and on nutrition shakes to boost my calories but at the time of taking any of these the fear is deliberating and exhausting.\n\nI even get highly anxious with a cold (mucus) thinking il choke or it block my air waves and il stop breathing. It's truly awful 😖 \n\nThank you for your reassurance you are a true warrior and should be proud of yourself overcoming this and helping others 💖",
      "created_utc": 1713970645.0,
      "score": 1,
      "context": [
        {
          "id": "ilrhtix",
          "author": "orionis_",
          "body": "This is an incredibly familiar story! I’m (unfortunately) still in the depths of it, I feel like I have to force a swallow for even liquids, and hot liquids feel impossible! I was able to get to very soft solids like mashed potatoes once if I could wash them down, but I feel stuck with this overwhelming fear just generally and when I think of trying everything else. I miss food a lot though. 🥲 Do you have any advice on what kind of therapy I should look for or anything I could do to lessen my fear? It heavily surrounds the fear of choking so I’m struggling a LOT these days.",
          "created_utc": 1661450433.0
        },
        {
          "id": "ilrk8c0",
          "author": "Lonely_Custard_5838",
          "body": "My therapist went through the steps of what the fear looks like in my head, and then we talked about how rare it is to choke and how difficult it is to actually choke on something. She also taught me to feel my throat when I swallow, and become very acquainted with it and how it feels.\n\nThis helped me a lot with the liquids: you will NEVER choke on a liquid. Ever. And mashed potatoes and soft foods cannot choke you either, it’s impossible. Chewing your food makes it impossible to choke on it, you will never choke and it’s so rare for someone to choke to a dangerous extent, you will not die from it. We also spoke about how many people I knew who suffered from a terrible choking episode, and if so how many? It’s very very rare, you are unlikely to be hurt at all especially if you chew solid foods properly. And your safe foods your eating now cannot hurt you, it feels scary but it’s impossible for the food you’re eating now to hurt you.\n\nThe fear and choked up feeling you get is what’s causing your body to feel like it’s choking, sometimes it’s the mucus in your throat that makes it difficult to swallow, but that’s completely normal and it is also impossible for it to be able to hurt you.\n\nYou’re doing great and I’m telling you now that what you’re eating is not going to harm you in any way because it is physically impossible for it to hurt you at all.",
          "created_utc": 1661451370.0
        },
        {
          "id": "l11gujw",
          "author": "Muma34",
          "body": "Hi 👋  thank you for sharing! I know this post is old but it's reassuring I'm not alone. I'm currently going through this now and any tips or reassurance would be truly grateful. I am starting to struggle with fluids too 😞 it's so bloody exhausting ❤️ how are you doing now? Have you fully recovered? Xx",
          "created_utc": 1713964687.0
        },
        {
          "id": "l11qujg",
          "author": "Lonely_Custard_5838",
          "body": "Aw dang I haven’t read this post in ages.\n\nHi! Sorry you’re going through this, it absolutely sucks. I would like to say I’m fully recovered now, I will always eat tenderly and slowly and I don’t think that will ever change, but it reassures me! Just know that you will not choke on liquids, what helped me was knowing that I was completely safe eating things like yogurt or soup.\n\nIf you’re not in therapy already I highly encourage you to start that as soon as possible. Just having somebody to teach me the skills to reassure myself when I eat was the biggest help and support that I needed, and I was back to eating solids in a matter of months.\n\nAs long as you have the skills to reassure yourself, you will get better. Just know that you are completely safe while eating soft foods, especially when you’re only taking in liquids. You will feel safe eating solids again with extra support.",
          "created_utc": 1713968432.0
        }
      ]
    },
    {
      "id": "i2m0bx0",
      "author": "Lonely_Custard_5838",
      "body": "Haha, I’m excited!",
      "created_utc": 1648585482.0,
      "score": 2,
      "context": [
        {
          "id": "i2cjvzr",
          "author": "Shiva-333",
          "body": "Congrats!  This is a brilliant account of your journey, very tangible to read.  You should consider writing a piece to publish.  It would help the millions of people who live with ARFID and have no idea what is happening or what to do about it.",
          "created_utc": 1648408758.0
        },
        {
          "id": "i2ck0yd",
          "author": "Lonely_Custard_5838",
          "body": "Thank you so much! I’ve never considered writing anything before. Perhaps if I had the time.",
          "created_utc": 1648408818.0
        },
        {
          "id": "i2lyegp",
          "author": "Shiva-333",
          "body": "Do you mind if I use some of the content from your post in a blog on my therapy website?  This can really inspire and help people.",
          "created_utc": 1648584748.0
        },
        {
          "id": "i2lz9c2",
          "author": "Lonely_Custard_5838",
          "body": "Go right ahead. Just link this back and make sure to add that it’s cited from a survivor’s personal record and not a Doctor or anybody with those types of credentials haha. I’d love to see your blog!",
          "created_utc": 1648585077.0
        },
        {
          "id": "i2m029f",
          "author": "Shiva-333",
          "body": "ABSOLUTELY!!!  This is all the more powerful because it's YOUR story.  I'll link you in when I have posted and you can have executive control of how it looks. Maybe it will get you working on that memoirs ;)",
          "created_utc": 1648585380.0
        }
      ]
    }
  ]
}