{
  "id": "tqw7v2",
  "subreddit": "ARFID",
  "author": "NotApplicableMC",
  "created_utc": 1648547527.0,
  "title": "If OP had ARFID this post would be dunked on so much, but no, they're vegetarian so everyone is supporting them. I hate the double standards, people treat ARFID like a lifestyle choice like veganism but it's an EATING DISORDER.",
  "selftext": "",
  "url": "/r/TrueOffMyChest/comments/tqpny1/i_was_taken_to_dinner_for_my_29th_birthday/",
  "score": 91,
  "num_comments": 19,
  "comments": [
    {
      "id": "i2jnqg7",
      "author": "alien-errors",
      "body": "ARFID is sadly not taken seriously, just gets blamed for being \"spoiled brat and picky\" which...hurts. My family have always commented on my ARFID, it sucks. I just \"ashame\" for not eating everything like them",
      "created_utc": 1648547880.0,
      "score": 51,
      "context": []
    },
    {
      "id": "i2jptm1",
      "author": "AFreshlySkinnedEgg",
      "body": "Literally someone says they’re vegetarian by choice it’s offensive if restaurants don’t accommodate for them. \n\nBut if I’m out with family I’m ruining everything and I should just ‘find something and eat it’ when I’m literally having a panic attack because I already know they have nothing I can stomach.",
      "created_utc": 1648549591.0,
      "score": 44,
      "context": []
    },
    {
      "id": "i2k738a",
      "author": "itsuki-shu",
      "body": "extremely true lol, but if i eat chicken nuggets at a fancy restaurant i'm the disrespectful one? and i act like a child? where's that energy now, under that post? smh",
      "created_utc": 1648560012.0,
      "score": 23,
      "context": []
    },
    {
      "id": "i2khd0x",
      "author": "giraffemoo",
      "body": "When I was a kid I used to tell people I was a vegetarian to avoid being forced to eat what everyone else was eating, backfired pretty spectacularly because I was offered veggie dishes which none of us like lol",
      "created_utc": 1648564430.0,
      "score": 22,
      "context": []
    },
    {
      "id": "i2ksl3l",
      "author": "Telphsm4sh",
      "body": "There's so many \"AITA for not gagging at my MILs cooking\" or similar on r/AmItheAsshole . And there's overwhelming YTA comments saying suck it up and eat it, you're acting like a 5 year old. The social pressures around the whole spectacle of eating meals together is baffling. It's just sustenance, a need, a bodily necessary. Why is\ndaily hygiene a private event but eating is a public spectacle, where personal preference is publicly judged?",
      "created_utc": 1648568880.0,
      "score": 18,
      "context": []
    },
    {
      "id": "i2kkco5",
      "author": "None",
      "body": "Absolutely. This is one of the things which really annoys me about vegetarians and vegans. They’re restricting their diet by choice but many feel entitled for the world to cater for them. Meanwhile we literally can’t eat certain foods no matter what, but we have to just suck it up. Deal with the lack of options, the abuse and the condescension. If you complain you’re just treated like a kid. Really frustrating!",
      "created_utc": 1648565643.0,
      "score": 14,
      "context": []
    },
    {
      "id": "i2l090y",
      "author": "saintceciliax",
      "body": "You’re absolutely right. Any and every post on this entire website that involves picky eating or ARFID, the OP gets crucified. This is so frustrating.",
      "created_utc": 1648571800.0,
      "score": 8,
      "context": []
    },
    {
      "id": "i2qqljo",
      "author": "nopizzaonmypineapple",
      "body": "Ok I'm sorry but I'm both a vegetarian and I have arfid, vegetarians and vegans still get A LOT of shit online and IRL. Lots of people view both the same way, aka making a fuss for no reason. Let's not act like eating differently from the norm in any way is received well in society...",
      "created_utc": 1648662737.0,
      "score": 8,
      "context": []
    },
    {
      "id": "i2o4786",
      "author": "None",
      "body": "I recently made a comment on facebook (don’t judge me for using facebook still i like the groups i’m in ) on a random post about not eating vegetables and said that some of us have texture aversions and the way people reacted was awful. everyone was telling me to “grow up and be an adult” and shit like that. i hate the way people treat arfid and just any picky eaters really like they’re freaks. it’s embarrassing (at least for me i’m not sure how everyone feels) and i don’t have control over the fact that i want to vomit and quite possibly could vomit while eating certain textures. none of us want to be like this\n\nedit: just want to add i know picky eating is not as intense as arfid can be but picky eaters still get treated like they are freaks. not to the same extent ofc.",
      "created_utc": 1648609562.0,
      "score": 7,
      "context": []
    },
    {
      "id": "i2l5uoy",
      "author": "Jim-theSpaceman",
      "body": "Man idk I guess I’m just lucky I’ve never had anyone make me feel bad for needing 15 minutes to look at the menu or for ordering something “difficult” I’ll go out to chili’s and just eat chips and salsa and a fancy drink maybe half way through the meal I’ll decide I can stand one of the sides or an appetizer and then I’ll order it nbd maybe I won’t eat what I ordered at all also no biggie. I don’t understand why anyone is making a thing out of it at all. My friends and family is always saying well you can try som of mine befor you order or if you get it and don’t like it I’ll eat it. Or it’s no big deal order something else. Get you new people and stop beating your self up. Or just be like me and look at anyone with a negative opinion like there crazy (cause they are) give it a chuckle and order your self two sides of French frys and have a good time.",
      "created_utc": 1648573916.0,
      "score": 3,
      "context": []
    },
    {
      "id": "i2llbnr",
      "author": "orange_ones",
      "body": "Not as extreme as it being for my birthday, but this has happened to me so many times, and people make out like I’m just a piece of shit because apparently it’s too bothersome for them to even see that I have no food in front of me.",
      "created_utc": 1648579723.0,
      "score": 2,
      "context": []
    },
    {
      "id": "i2omkn9",
      "author": "APleasantMartini",
      "body": "Honestly, I hate it.\n\nI really should have jumped on the vegan craze beforehand because they seem to get more respect.\n\nOr, hell, Anna Wintour's stupid regimented diet shit doesn't get criticized because she's influential.",
      "created_utc": 1648620610.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i33ps9c",
      "author": "Galaxena7",
      "body": "unwritten ad hoc spoon chop languid marry north direction offbeat fall\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
      "created_utc": 1648904009.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ip8ia9k",
      "author": "fml2727",
      "body": "I’m a vegetarian and I have ARFID. People aren’t always accommodating of vegetarians. I can’t even begin to count how many times I’ve been forced to go to a restaurant with nothing I can eat solely due to my vegetarianism because no one cared",
      "created_utc": 1663702967.0,
      "score": 6,
      "context": [
        {
          "id": "i2jptm1",
          "author": "AFreshlySkinnedEgg",
          "body": "Literally someone says they’re vegetarian by choice it’s offensive if restaurants don’t accommodate for them. \n\nBut if I’m out with family I’m ruining everything and I should just ‘find something and eat it’ when I’m literally having a panic attack because I already know they have nothing I can stomach.",
          "created_utc": 1648549591.0
        }
      ]
    },
    {
      "id": "i2k785u",
      "author": "itsuki-shu",
      "body": "shit like this really gets to you when you've seen people send death threats over someone's choice of food over the internet🙈 nope, not exaggerating",
      "created_utc": 1648560076.0,
      "score": 10,
      "context": [
        {
          "id": "i2k738a",
          "author": "itsuki-shu",
          "body": "extremely true lol, but if i eat chicken nuggets at a fancy restaurant i'm the disrespectful one? and i act like a child? where's that energy now, under that post? smh",
          "created_utc": 1648560012.0
        }
      ]
    },
    {
      "id": "i2qnftr",
      "author": "TyNyeTheTransGuy",
      "body": "Restaurant: *serves plain/bland/simple food as a menu item/allows outside food, charges less/no money for said food which makes the meal overall less expensive for whoever is paying, atmosphere doesn’t change based on the food order*\n\nRest of the table: “How DARE you order that?! If you’re not ordering braised baked charbroiled steak and scallop stew over onions and rice, what are you even *doing* outside your own kitchen?!”",
      "created_utc": 1648661504.0,
      "score": 6,
      "context": [
        {
          "id": "i2k738a",
          "author": "itsuki-shu",
          "body": "extremely true lol, but if i eat chicken nuggets at a fancy restaurant i'm the disrespectful one? and i act like a child? where's that energy now, under that post? smh",
          "created_utc": 1648560012.0
        }
      ]
    },
    {
      "id": "i2kuoxy",
      "author": "Telphsm4sh",
      "body": "I still do that. I am vegetarian not by choice, but I usually say white lies and say vegan all the time. And then when those veggie dishes come, I just keep on tacking on more and more popular eating restrictions. Gluten intolerance, lactose intolerance, allergies... And then I just say, I usually just come to these type of events with a full belly anyways since I can't trust the food prep, so you don't have to worry about me.\n\nI shouldn't have to have a 20+ minute argument to defend the validity of my non optional eating restrictions to every person I meet. I use white lies and lies by omission all the time because the bacon bros just don't get it. \"But everyone loves bacon it's the best thing in the world\" stfu.",
      "created_utc": 1648569690.0,
      "score": 13,
      "context": [
        {
          "id": "i2khd0x",
          "author": "giraffemoo",
          "body": "When I was a kid I used to tell people I was a vegetarian to avoid being forced to eat what everyone else was eating, backfired pretty spectacularly because I was offered veggie dishes which none of us like lol",
          "created_utc": 1648564430.0
        }
      ]
    },
    {
      "id": "i4zdiv7",
      "author": "WTFShouldIBeCalled",
      "body": "I’ve only just found this post but YES! I’m also a vegetarian with ARFID and I’ve gotten shit for both of those things. Rather than everyone on this sub being annoyed at vegetarians and vegans, why don’t they try taking their frustrations out on the people who give anyone shit for what they eat instead?",
      "created_utc": 1650131185.0,
      "score": 5,
      "context": [
        {
          "id": "i2qqljo",
          "author": "nopizzaonmypineapple",
          "body": "Ok I'm sorry but I'm both a vegetarian and I have arfid, vegetarians and vegans still get A LOT of shit online and IRL. Lots of people view both the same way, aka making a fuss for no reason. Let's not act like eating differently from the norm in any way is received well in society...",
          "created_utc": 1648662737.0
        }
      ]
    },
    {
      "id": "i8vqi8k",
      "author": "Yuna-sHuman",
      "body": "I love this energy\n\nIn my family we often eat privately ~(bc everyone's got a lil 'spicy brain)~\n\nWhen we eat out my stance is: unless you want me to roast you over your food choices and never eat with you again; Respect my food choices.\n\nSometimes you have to choose violence and bully them back a little 🤷‍♀️",
      "created_utc": 1652742470.0,
      "score": 1,
      "context": [
        {
          "id": "i2l5uoy",
          "author": "Jim-theSpaceman",
          "body": "Man idk I guess I’m just lucky I’ve never had anyone make me feel bad for needing 15 minutes to look at the menu or for ordering something “difficult” I’ll go out to chili’s and just eat chips and salsa and a fancy drink maybe half way through the meal I’ll decide I can stand one of the sides or an appetizer and then I’ll order it nbd maybe I won’t eat what I ordered at all also no biggie. I don’t understand why anyone is making a thing out of it at all. My friends and family is always saying well you can try som of mine befor you order or if you get it and don’t like it I’ll eat it. Or it’s no big deal order something else. Get you new people and stop beating your self up. Or just be like me and look at anyone with a negative opinion like there crazy (cause they are) give it a chuckle and order your self two sides of French frys and have a good time.",
          "created_utc": 1648573916.0
        }
      ]
    }
  ]
}