{
  "id": "tskx1y",
  "subreddit": "ARFID",
  "author": "Rynoff",
  "created_utc": 1648678945.0,
  "title": "Having arfid as an adult is so embarrassing",
  "selftext": "I’m in my 20s going to a dinner event for my little brother. It’s embarrassing to see little kids be more adventurous eaters than me. I’m a vegetarian for environmental reasons but besides that arfid really restricts me. Since this is a school event for him the meals are pre made so I can’t even order off a menu. So basically I need to hope that the one vegetarian option they’ll have is something I can eat. If not, it’s gonna be a long and shameful night for me.",
  "url": "https://www.reddit.com/r/ARFID/comments/tskx1y/having_arfid_as_an_adult_is_so_embarrassing/",
  "score": 92,
  "num_comments": 9,
  "comments": [
    {
      "id": "i2s2m58",
      "author": "jessmcl14",
      "body": "Ugh I totally understand. I'm also a young adult and feel the same. Tonight I'm going to my boyfriend's coworkers bi-annual group dinner at someone's house where they make food for everyone... I'm crossing my fingers that nobody will ask questions when I politely decline to eat :(\n\nYou're not alone OP, best of luck tonight!",
      "created_utc": 1648682350.0,
      "score": 25,
      "context": []
    },
    {
      "id": "i2tu2lr",
      "author": "isakami02",
      "body": ">It’s embarrassing to see little kids be more adventurous eaters than me.\n\nFR LIKE HOW??? I'm nearly 20 and i have seen 3 year olds eating things i couldn't touch with a 10 foot pole",
      "created_utc": 1648720164.0,
      "score": 11,
      "context": []
    },
    {
      "id": "i2uz2a3",
      "author": "axw3555",
      "body": "TBH, I'm kinda past the embarrassing thing. When I was your age, I had it really bad.\n\nBut now I'm like \"people do *way* more embarrassing shit than having a narrow diet and treat it like it's normal\", so I just don't feel the embarrassment anymore. When people ask, I just say I don't like it. If they push, I just go \"so do you like \\[insert unpleasant thing here - often anchovies\\]?\" (adding a few \"well what about...?\" if they do like it). When I hit one they don't, I ask the same pushy question at them that they asked me. If they keep pushing, I literally just turn around and walk away.\n\nIt helps that my friend circle has a lot of mental health and physical disability issues in it (ASD, ARFID, OCD, depression, suicidal ideation, GAD, self harm, Cerebral Palsy, epilepsy, ADHD, etc among many others that I'm probably forgetting - not by design, we just kinda ended up friends and over time opened up to each other. Turns out we literally all have something, so we all understand working around these things. \n\nLike for a friends birthday, a meal was organised a Wagamama (Japanese based food). My friends knew that there was going to be a 0% chance of me eating any real food, but it was the birthday guy's choice. They just said \"if you want to come and not eat, just have a drink and be social, that's cool, if you don't want to come, don't worry. If you come and want to try something, say and one of us will order it and if you don't like, it's our food and it won't seem odd if you don't eat it\".",
      "created_utc": 1648741391.0,
      "score": 8,
      "context": []
    },
    {
      "id": "i2scunv",
      "author": "APleasantMartini",
      "body": "Oh, tell me about it.\n\nI hate food now and have decided to starve myself until dinner, of which I have planned on asking my parents what they're eating from now on to save THEM the issue of trying to feed me.",
      "created_utc": 1648687062.0,
      "score": 6,
      "context": []
    },
    {
      "id": "i8kuqhf",
      "author": "ShelbySleeps",
      "body": "Dating has been a particularly hard issue for me, as I cannot stand the texture of all beef and any ground or shredded meat. Every time I've dated someone new and I go to meet their family for the first time, they want to cook for me and it's embarrassing because I can't tell them my list of foods I don't eat because I don't want to seem difficult or like a diva and I don't want to just not eat when I go over. I had a boyfriend's family who would cook grilled chicken for me completely separate from whatever beef meal they were having, and while that was so considerate and I really appreciated it, I also felt insanely guilty.",
      "created_utc": 1652537927.0,
      "score": 2,
      "context": []
    },
    {
      "id": "i2spmo9",
      "author": "Rynoff",
      "body": "Thanks friend good luck to you too",
      "created_utc": 1648692868.0,
      "score": 6,
      "context": [
        {
          "id": "i2s2m58",
          "author": "jessmcl14",
          "body": "Ugh I totally understand. I'm also a young adult and feel the same. Tonight I'm going to my boyfriend's coworkers bi-annual group dinner at someone's house where they make food for everyone... I'm crossing my fingers that nobody will ask questions when I politely decline to eat :(\n\nYou're not alone OP, best of luck tonight!",
          "created_utc": 1648682350.0
        }
      ]
    },
    {
      "id": "i2uzk7l",
      "author": "lieunee",
      "body": "I don’t feel embarrassed anymore but phew, watching my own child eat ANYTHING / EVERYTHING and also silently, internally, shuddering with disgust when I have to make it for her is… not awesome, lol.",
      "created_utc": 1648741582.0,
      "score": 6,
      "context": [
        {
          "id": "i2tu2lr",
          "author": "isakami02",
          "body": ">It’s embarrassing to see little kids be more adventurous eaters than me.\n\nFR LIKE HOW??? I'm nearly 20 and i have seen 3 year olds eating things i couldn't touch with a 10 foot pole",
          "created_utc": 1648720164.0
        }
      ]
    },
    {
      "id": "i2t4qid",
      "author": "jessmcl14",
      "body": "Thank you, hope it went okay on your end :)",
      "created_utc": 1648700664.0,
      "score": 4,
      "context": [
        {
          "id": "i2s2m58",
          "author": "jessmcl14",
          "body": "Ugh I totally understand. I'm also a young adult and feel the same. Tonight I'm going to my boyfriend's coworkers bi-annual group dinner at someone's house where they make food for everyone... I'm crossing my fingers that nobody will ask questions when I politely decline to eat :(\n\nYou're not alone OP, best of luck tonight!",
          "created_utc": 1648682350.0
        },
        {
          "id": "i2spmo9",
          "author": "Rynoff",
          "body": "Thanks friend good luck to you too",
          "created_utc": 1648692868.0
        }
      ]
    },
    {
      "id": "i2ybd5n",
      "author": "isakami02",
      "body": "nooo omg😭😭",
      "created_utc": 1648794761.0,
      "score": 1,
      "context": [
        {
          "id": "i2tu2lr",
          "author": "isakami02",
          "body": ">It’s embarrassing to see little kids be more adventurous eaters than me.\n\nFR LIKE HOW??? I'm nearly 20 and i have seen 3 year olds eating things i couldn't touch with a 10 foot pole",
          "created_utc": 1648720164.0
        },
        {
          "id": "i2uzk7l",
          "author": "lieunee",
          "body": "I don’t feel embarrassed anymore but phew, watching my own child eat ANYTHING / EVERYTHING and also silently, internally, shuddering with disgust when I have to make it for her is… not awesome, lol.",
          "created_utc": 1648741582.0
        }
      ]
    }
  ]
}