{
  "id": "u5yerp",
  "subreddit": "ARFID",
  "author": "None",
  "created_utc": 1650235986.0,
  "title": "Family dinners suck.",
  "selftext": "Sitting at Easter dinner right now. Multiple comments on my lack of eating, even though these people know I’ve been doing this every holiday for years. Y’all know the comments I don’t even have to quote them :/ I love Easter- I love the colors, the candy, I love bunnies- but every years it’s the same. I cry at this same table every year after having the spotlight stuck on me and have to compose myself in the bathroom each time. Happy Easter, hope all you guys are having nicer dinner experiences today <3",
  "url": "https://www.reddit.com/r/ARFID/comments/u5yerp/family_dinners_suck/",
  "score": 117,
  "num_comments": 17,
  "comments": [
    {
      "id": "i557xq4",
      "author": "EnthusiasmSweet834",
      "body": "I was the chicken nugget joke for years at family dinners. I never changed. Just got older and now I don’t have to attend these dinners.",
      "created_utc": 1650238939.0,
      "score": 50,
      "context": []
    },
    {
      "id": "i55lg0y",
      "author": "Neocactus",
      "body": "I skipped my family’s Easter dinner this year. I’ve skipped the past two Thanksgiving dinners as well and have regretted nothing.\n\nJust stayed at home to play video games and watch Twitch lol",
      "created_utc": 1650245178.0,
      "score": 16,
      "context": []
    },
    {
      "id": "i563ay4",
      "author": "Just_Smurfin_Around",
      "body": "every holiday dinner I attend, I get countless comments on how \"lacking\" my plate looks. Sorry I can only tolerate to eat 2 or 3 of the things that were made, it was the same as last year, and the year before...and the one before that, etc.",
      "created_utc": 1650254171.0,
      "score": 14,
      "context": []
    },
    {
      "id": "i55elrl",
      "author": "target__official",
      "body": "happened to me all the time, now, i don’t deal with it anymore and tell my family to stop commenting on my eating habits. will keep telling them until they stop",
      "created_utc": 1650242021.0,
      "score": 9,
      "context": []
    },
    {
      "id": "i570ffl",
      "author": "DeeSnow97",
      "body": "Your family sucks tbh. There is no justification for bullying, and it honestly weirds me out when people think food is an exception for that.",
      "created_utc": 1650279715.0,
      "score": 7,
      "context": []
    },
    {
      "id": "i57lkdq",
      "author": "SubzeroNYC",
      "body": "It's a medical disorder.   If they can't understand it, they are the ignorant ones, not you.",
      "created_utc": 1650291330.0,
      "score": 5,
      "context": []
    },
    {
      "id": "i554k13",
      "author": "None",
      "body": "Hope the rest of it goes by fast for you and you have a good rest from all this later!",
      "created_utc": 1650237382.0,
      "score": 5,
      "context": []
    },
    {
      "id": "i55oyls",
      "author": "officialpomegranate",
      "body": "same same same… sigh",
      "created_utc": 1650246846.0,
      "score": 6,
      "context": []
    },
    {
      "id": "i56z5f2",
      "author": "None",
      "body": "I stopped going to family dinners years ago. Too many comments and too much anxiety around them it's easier just to stay in my own little bubble.",
      "created_utc": 1650278751.0,
      "score": 5,
      "context": []
    },
    {
      "id": "i56fvog",
      "author": "BreadRecent",
      "body": "I didn’t attend and had some pasta instead and I was so happy!!!!",
      "created_utc": 1650262713.0,
      "score": 4,
      "context": []
    },
    {
      "id": "i5l4p41",
      "author": "ieatbonesss",
      "body": "while i can’t escape the joking comments on my eating habits, i’m fortunate enough to have it be the “norm” to have a separate meal for me. it’s been in place since i can remember and it’s usually pasta or something plain, but one specific event that happened involved green beans. i was eating dinner and everything was fine and i have trouble with food touching so i’ll either get food one at a time or separate plates. anyways my mom made two separate green bean dishes one plain and one with add ins and placed the utensil we were using to scoop them out from the one with add ins and placed it into the plain one for me and was joking when i wouldn’t eat them anymore. i know it wasn’t in malice just upsetting to be singled out. she even moved the utensil out of the way but the food was still contaminated. she specifically always brings up this super old arthur episode where dw doesn’t want her food touching and freaks out about it and it’s kind of upsetting to be compared to a child when i’m 20 but there isn’t much i can do about it. i know she doesn’t fully understand but she does her best to accommodate and that’s really all i can ask for",
      "created_utc": 1650522858.0,
      "score": 5,
      "context": []
    },
    {
      "id": "i55iesy",
      "author": "AnxietyTurbulent4861",
      "body": "My family never had a special dinner for it, just candy.",
      "created_utc": 1650243765.0,
      "score": 3,
      "context": []
    },
    {
      "id": "i6oj0zm",
      "author": "Asm0p",
      "body": "Family/social Thanksgiving and Christmas dinners can go to hell I'm eating pizza.",
      "created_utc": 1651248389.0,
      "score": 2,
      "context": []
    },
    {
      "id": "i5588nj",
      "author": "None",
      "body": "Yup. My bf’s parents gave me the nickname “nugget.” I don’t entirely hate it, just don’t like that I have a nickname that reminds me of food. But they’re super sweet so they’re the only ones allowed to call me that 😅",
      "created_utc": 1650239079.0,
      "score": 20,
      "context": [
        {
          "id": "i557xq4",
          "author": "EnthusiasmSweet834",
          "body": "I was the chicken nugget joke for years at family dinners. I never changed. Just got older and now I don’t have to attend these dinners.",
          "created_utc": 1650238939.0
        }
      ]
    },
    {
      "id": "i5590mp",
      "author": "EnthusiasmSweet834",
      "body": "That’s cool they’re understanding. I had to lose my shit with my in-laws for them to understand my problems run far deeper than being “picky”. My granma was the only allowed to get away with chicken nugget jokes because she was making them lol.",
      "created_utc": 1650239433.0,
      "score": 12,
      "context": [
        {
          "id": "i557xq4",
          "author": "EnthusiasmSweet834",
          "body": "I was the chicken nugget joke for years at family dinners. I never changed. Just got older and now I don’t have to attend these dinners.",
          "created_utc": 1650238939.0
        }
      ]
    },
    {
      "id": "i56r134",
      "author": "braedizzle",
      "body": "Those jokes are the main reason I don’t go anymore",
      "created_utc": 1650271992.0,
      "score": 3,
      "context": [
        {
          "id": "i557xq4",
          "author": "EnthusiasmSweet834",
          "body": "I was the chicken nugget joke for years at family dinners. I never changed. Just got older and now I don’t have to attend these dinners.",
          "created_utc": 1650238939.0
        }
      ]
    },
    {
      "id": "i5l49nw",
      "author": "ieatbonesss",
      "body": "honestly it’s so normalized to poke fun at peoples eating habits that i don’t even think people realize the damage they’re causing. it’s upsetting and i wish it wasn’t as widely accepted",
      "created_utc": 1650522527.0,
      "score": 2,
      "context": [
        {
          "id": "i570ffl",
          "author": "DeeSnow97",
          "body": "Your family sucks tbh. There is no justification for bullying, and it honestly weirds me out when people think food is an exception for that.",
          "created_utc": 1650279715.0
        }
      ]
    }
  ]
}