{
  "id": "u6hw3b",
  "subreddit": "ARFID",
  "author": "EDRD621",
  "created_utc": 1650301130.0,
  "title": "ED Dietitian specializing in ARFID - Ask me anything!",
  "selftext": "Mods - no self promotion here. I just have some time and would like to help if I can. Will verify if needed, just reach out.\n\nI’m a Registered Dietitian who helps people work through a number of eating disorders. I have had a particularly heavy caseload of those struggling with ARFID due to our success with treatment. I recently saw this subreddit pop up on a google search and figured I’d offer tips/advice for those who need it.\n\nARFID is a very common eating disorder that can be treated effectively and efficiently with a strategic and sound approach. I know how difficult it can be to work through - what questions do you have for me?\n\nEdit: Need to take a break for now, I'll try getting to the rest when I can. :)",
  "url": "https://www.reddit.com/r/ARFID/comments/u6hw3b/ed_dietitian_specializing_in_arfid_ask_me_anything/",
  "score": 148,
  "num_comments": 126,
  "comments": [
    {
      "id": "i58pfky",
      "author": "The-Canary",
      "body": "What are the first steps that someone should take when they first recognize the possibility of having ARFID?",
      "created_utc": 1650307437.0,
      "score": 39,
      "context": []
    },
    {
      "id": "i59c68y",
      "author": "cellocats",
      "body": "How does one find a therapist who knows about/how to treat ARFID?  The last few I've asked have never even heard of it \n\nDo frozen fruits and veggies provide adequate nutrition if you can't stomach fresh produce?",
      "created_utc": 1650316707.0,
      "score": 30,
      "context": []
    },
    {
      "id": "i59crvm",
      "author": "deandratb",
      "body": "Have you treated anyone who finds all food disgusting? If so, how did you approach their treatment?\n\nI'm 37F and have presented ARFID symptoms since I was 3, but only learned of it two years ago. Also autistic w/anxiety, but while I know those are factors...I just don't like or enjoy food. I have my safe foods which I survive on, but if I pay too much attention to their taste and texture, then even they disgust me. \n\nThe only treatment help I've been able to access so far is a dietician without ARFID experience, and her first step was requiring me to eat at regular intervals and eat without distractions. \n\nReading while I eat has been my coping mechanism since childhood, and focusing on my food now makes me so grossed out that I'd rather starve. I had to pause treatment for unrelated reasons and am not sure how to approach that when I begin again.\n\nDo you recommend mindful eating to your ARFID clients? If so, how do you coach them through it? I've been poor my whole life, so I have a lot of experience going hungry--and when I pay attention to what I eat and that causes me to gag and choke on the food, I'd much rather just stop trying to eat at all.\n\nThank you so much for doing this! My healthcare system doesn't seem to know what ARFID even is, and denied that I need help.",
      "created_utc": 1650316997.0,
      "score": 21,
      "context": []
    },
    {
      "id": "i59378v",
      "author": "Telphsm4sh",
      "body": "I wanna try going on a meal replacement drink, like maybe Soylent, for a more healthy diet. But my family is saying that it's not a healthy mindset because its a cop out, it causes even more \"abnormal\" eating habits, and doesn't solve the actual problem of not eating food in public places. They say that it might end up narrowing my food choices, and that eventually I would just be on that drink. But me, I'm thinking I need to live with a healthy diet before I get anemia and/or diabetes at a young age, and if this can solve it, then that's a success, Feeling comfortable in social settings by expanding my safe foods is an optional/secondary goal. Am I having a bad mindset here? Is your end goal with patients completely \"normal\" eating habits? Or is it like this sort of damage control with meal replacement drinks and supplements?",
      "created_utc": 1650313017.0,
      "score": 19,
      "context": []
    },
    {
      "id": "i59sad3",
      "author": "mamaxchaos",
      "body": "How do you approach weight bias within ED treatment, and how do you support clients who are not visibly malnourished but need support all the same? I’m 28 and I’ve been fat my whole life, so no one has ever believed that I could truly have an ED - I’ve even been encouraged by multiple doctors across states and insurance networks to keep restricting even if my calorie intake is dangerously low. \n\nIt took finding my current HAES-certified nutritionist advocating for me to get ANYONE to take me seriously. It’s hard to even want to get treatment if your docs are outright encouraging it, you know?",
      "created_utc": 1650323967.0,
      "score": 11,
      "context": []
    },
    {
      "id": "i59im3r",
      "author": "ProudRavenclaw24",
      "body": "Can I still be diagnosed if it’s not having super severe health effects?\n\nMost of my safe foods are decently healthy (Nuts, fruits, most meats). I actually can’t stand most of the common, less healthy, safe foods (pizza, cheeseburgers, etc). It’s one of the main reasons I haven’t bright it up with any doctor, because I’m worried the nutritional deficit part is necessary for a diagnosis. \n\nIt still causes a lot of stress and anxiety for me though, because, sadly, I can’t just never eat in public ever.",
      "created_utc": 1650319607.0,
      "score": 10,
      "context": []
    },
    {
      "id": "i5965wl",
      "author": "stink3rbelle",
      "body": "I'm getting to know someone with ARFID. He's been open about it, but we haven't discussed it too deeply, and also haven't had any meals together yet. I'm under no illusions that I'm equipped to treat him, but would like to be helpful, and avoid triggers. Any tips for discussing food and eating? Or avoiding common triggers?",
      "created_utc": 1650314215.0,
      "score": 9,
      "context": []
    },
    {
      "id": "i58d2w4",
      "author": "thrivingsad",
      "body": "What approach do you use for ARFID? \n\nFor people with ARFID who have Autism and it comes from a sensory issue, what can you do to help make more food appealing? \n\nFor those who struggle with no appetite, what do you recommend to keep them eating daily?\n\nAnd how long on average does a typical ARFID patient develop normal/healthier eating habits to where they no longer need a dietitians assistance?",
      "created_utc": 1650302524.0,
      "score": 16,
      "context": []
    },
    {
      "id": "i59h0mv",
      "author": "jennymayg13",
      "body": "How do you treat an adult with ARFID? We are in England and it’s impossible to find treatment, especially as an adult. Doctors have no clue and there are very few private services in the country.",
      "created_utc": 1650318893.0,
      "score": 9,
      "context": []
    },
    {
      "id": "i59fffw",
      "author": "j_p96",
      "body": "Hi, thanks for doing this. I have a few questions I think...\n\n1. How can I try to live a “normal” life while dealing with this? I’ve found it difficult to date (due to not eating and feeling sick. I don’t want them to have to deal with my BS) \n\n2. What can this disorder do to your body over time? I’ve noticed my eyesight and memory have declined a bit. But I also tend to abuse laxatives. I’ll take some after I eat pretty much every time. What are the repercussions of this over an extended period of time? \n\n3. I feel like my eating disorder can “switch” from ARFID to anorexia. How can I navigate this? \n\nSorry... I just feel stuck, and like I’ll never live like a “normal” person. It’s been a struggle for many, many years. I don’t know what to do at this point...",
      "created_utc": 1650318187.0,
      "score": 7,
      "context": []
    },
    {
      "id": "i58x6c0",
      "author": "Rigga-Goo-Goo",
      "body": "At what point do you consider someone to be treating ARFID effectively? If I currently have no anxiety in relation to what I eat and have enough variety in my diet that I'm not experiencing health issues (but still have a restrictive diet), is it still something that needs to be treated?\n\nI have a difficult time understanding why a restrictive diet like choosing to be vegan is socially acceptable but my own restrictive diet isn't (only speaking for my case, specifically because it's not impacting my health or mental state - I understand the seriousness of ARFID and why some people do need treatment).",
      "created_utc": 1650310611.0,
      "score": 11,
      "context": []
    },
    {
      "id": "i5961tj",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1650314170.0,
      "score": 4,
      "context": []
    },
    {
      "id": "i5a6ldd",
      "author": "Alaskaaasky",
      "body": "Do you have experience with arfid meat aversion? Ever since I was a kid (I grew up in a religious household where a lot of meat was not allowed and was what had to be super particular.) I have had some success being more flexible with good but I can’t do meat to the point where I ask at restaurants about every dish, can’t really eat other food cooked on the same pan as meat. I’ve been vegetarian but soon I’m moving to a part of the world where most dishes are commonly made with some sort of meat and I really really want to be able to experience eating there without constantly worrying if I’m possibly eating meat.",
      "created_utc": 1650330192.0,
      "score": 4,
      "context": []
    },
    {
      "id": "i5935c3",
      "author": "museum-mama",
      "body": "How do I go about finding a therapist that takes my insurance (for my daughter that is amenable to treatment)?  Her GP agreed that she needs treatment and then gave us a list of therapists, none of which take our insurance.  I want her to have help but $150/session is a financial burden. And no, we don't qualify for aide of any kind.",
      "created_utc": 1650312996.0,
      "score": 6,
      "context": []
    },
    {
      "id": "i58q5cu",
      "author": "Mynotredditaccount",
      "body": "Bookmarking so I can read later! I'm currently working and don't have a question yet but I might later. \n\nThanks for doing this AMA, it's much appreciated OP <3",
      "created_utc": 1650307722.0,
      "score": 6,
      "context": []
    },
    {
      "id": "i59h4rp",
      "author": "Heartkid2022",
      "body": "May not be the question you are looking for, but how did you become an RD and what kind of setting do you work in? For reference, I am entering a community nutrition program planning on becoming a dietician and am interested in working with children with eating disorders.",
      "created_utc": 1650318945.0,
      "score": 3,
      "context": []
    },
    {
      "id": "i59hig8",
      "author": "FurretsOotersMinks",
      "body": "Is it enough to meet caloric intake and include healthy meals? Is it okay to eat unhealthy meals?\n\nI think I tend to beat myself up over this for no reason. I make and eat stuff like black bean and turkey enchiladas, soups like broccoli and cheddar, pasta fagioli, chicken tortilla soup, and so on and add spinach to things where I can (like soup). But I'm also busy so it's easy to just eat spaghetti, mac and cheese, or just sugary cereal for dinner. I feel like I know I have a good balance, but I don't feel like it's healthy enough when other people regularly eat salad and raw vegetables for snacks and whole meals. Can I still be healthy when not every meal I eat is nutritious?",
      "created_utc": 1650319114.0,
      "score": 3,
      "context": []
    },
    {
      "id": "i59iddk",
      "author": "AnxietyTurbulent4861",
      "body": "Is anxiety comorbid With arfid?  Why does it seem like even people who treat EDs don't know about arfid?",
      "created_utc": 1650319497.0,
      "score": 3,
      "context": []
    },
    {
      "id": "i5afyu1",
      "author": "thicketcosplay",
      "body": "How do you manage the stress and anxiety of treatment?\n\nEvery treatment that I've heard of basically involves either chaining similar foods or starving yourself until you're willing to eat anything or otherwise basically forcing yourself to eat unsafe foods until your brain accepts them. Maybe these aren't the best treatments, but it's what has always been suggested to me. I can't actually see a specialist for a long BS list of reasons, so maybe I just have no idea.\n\nFor me, even food chaining is extremely stressful. I can have a breakdown just trying a safe food with a different spice on it. Chaining to something similar but slightly different is very very stressful. Whenever I've tried to expand my safe foods this way, I've basically been unable to do anything else with my day because the stress and anxiety sapped all my energy and time and made me a distracted mess. I feel like if I ever did find some way to go through therapy, I'd have to quit my job/drop out of school and basically devote myself 100% to the treatment in order to succeed. I just wouldn't be able to handle that amount of stress and anxiety while having other things on my plate.",
      "created_utc": 1650334271.0,
      "score": 3,
      "context": []
    },
    {
      "id": "i5amzac",
      "author": "Pugtastic_smile",
      "body": "I was diagnosed with ARFID but do not meet the diagnostic criteria. My therapist said she diagnosed me because I restrict. I'm terrified to recover because of weight gain. I'm obese, which i figured played a part in my diagnosis. Can this possible wrong diagnoses hurt my treatment?",
      "created_utc": 1650337396.0,
      "score": 3,
      "context": []
    },
    {
      "id": "i5bcmo8",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1650353183.0,
      "score": 3,
      "context": []
    },
    {
      "id": "i5df15m",
      "author": "star-rise",
      "body": "I think I have this. Lately I've been afraid to eat solid food (I have emetophobia and it has worsened) so I've mostly been having protein shakes. Other than that, there are only a few foods I consider safe because whenever I do get the courage to eat because they have a low risk of vomiting: rice, pasta, broth, and tomato sauce. And I have them paired with cooked carrots, celery, or peas. Also gentle foods such as bananas with peanut butter or applesauce. \n\nI read that emetophobia is a common cause of ARFID. If you have had any emetophobia-related ARFID patients who improved or recovered, what helped them?",
      "created_utc": 1650391193.0,
      "score": 3,
      "context": []
    },
    {
      "id": "i58kx07",
      "author": "Grungslinger",
      "body": "Tactics to lower anxiety? Mainly eating around other people and the fear of being criticized for food selection.\n\nObviously the best tactic is to go to a Dietician and think of tatics together, but do you have anything off the top of your head you'll recommend anybody struggling with that sort of anxiety?",
      "created_utc": 1650305647.0,
      "score": 7,
      "context": []
    },
    {
      "id": "i58dzrs",
      "author": "AbunaiE",
      "body": "Recommendations for calcium?  I take a calcium supplement but I need a larger dose and have a very hard time swallowing pills.  My DEXA just showed that I'm osteopenic and I need to further supplement my diet (I can't eat dairy).  How much should I look to get every day and do you have recommendations for supplements that are easy to swallow or foods I can incorporate?\n\nI have a dietician but all she wants to talk about are my feelings and I really just want to make sure my hips aren't going to snap off.\n\nBonus question: Other than mechanical eating how do you encourage someone that is disinterested?  I have a very limited diet due to Eosinophilic Esophagitis and am just bummed at every meal.  \n\n\nThank you, I very much appreciate your help.",
      "created_utc": 1650302891.0,
      "score": 4,
      "context": []
    },
    {
      "id": "i58ovuh",
      "author": "odythecat",
      "body": "I have a family member with celiac disease and ARFID, so her list of safe foods is influenced by both her ED and by gluten content. She’s also vegetarian (by choice-we offer opportunities to try different meats, but not interested). I’ve often wondered if the ARFID grew out of the dietary restrictions she’s grown up with (diagnosed celiac at age 6). \n\nLately her list of safe foods has shrunk to just a handful of things - mostly corn tortillas, cholula, and candy. She hasn’t eaten a single lunch at school all year. We’re worried her ED is starting to include anorexia. She declined participation in our local ED program (which, to be fair, seemed to not understand ARFID at all) and has gone to a psychologist in past but is generally not open to talking about eating. \n\nAny thoughts? 14F.",
      "created_utc": 1650307220.0,
      "score": 3,
      "context": []
    },
    {
      "id": "i58qhwe",
      "author": "Kindlabs",
      "body": "I hadn’t considered trying a dietitian, I’ve unsuccessfully contacted a few therapists and had kinda given up hope. Would this be a good avenue for me to pursue next?\n\nI’m on the spectrum and have sensory issues, texture and taste sensitivity both impact my eating, and some minor childhood trauma around food cemented it in. I have strong will, I was able to overcome my fear of roller coasters on my own, but my food issues still evade me into my 30s. \n\nI was hoping to get into therapy and maybe do some sort of exposure therapy. What would treatment with a dietitian look like?",
      "created_utc": 1650307864.0,
      "score": 5,
      "context": []
    },
    {
      "id": "i5beckn",
      "author": "lieunee",
      "body": "“I'm under the impression that ARFID is often caused (at least in part) by lack of sensory exposure to foods at a young age. Why would this be the case? Well...a few different reasons. You simply might not have had exposure, and parents never made an effort for whatever reason.”\n\nAs a parent of a kid with ARFID I hear stuff like this a lot but, I feel like families with multiple kids don’t often have more than one with ARFID so, I’m alway intrigued by this explanation. (I was the one with ARFID growing up, my sister was and is and adventurous eater. My son has ARFID, his sister will eat anything. In both cases the same varied diet was available.)",
      "created_utc": 1650354616.0,
      "score": 5,
      "context": []
    },
    {
      "id": "i59rq8l",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1650323718.0,
      "score": 2,
      "context": []
    },
    {
      "id": "i5ag512",
      "author": "LexCyborg",
      "body": "How often do you see people with arfid and rapid weight gain? How does treatment differ in that case? I have severe arfid but still eat a lot of the same food… just entirely empty calories. Trying to find treatment but I don’t seem to fit the criteria for a lot of places :/",
      "created_utc": 1650334349.0,
      "score": 2,
      "context": []
    },
    {
      "id": "i5ak4ef",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1650336101.0,
      "score": 2,
      "context": []
    },
    {
      "id": "i5bn0bd",
      "author": "Johnny-of-Suburbia",
      "body": "When it comes to food adversion specifically related to trauma, do you feel it's best to have a therapist for trauma treatment as well as an ED specialist? I would assume so but figured I would ask.\n\nMy most unsafe foods have a delightful double whammy of trauma and being bad feeling sensory wise for multiple reasons. I've attempted to work through it by exposure but when I can get myself to eat a little I'm often just... Put-off and lose my appetite, or I feel really grossed out.\n\nI've come a long long way already in many areas but those ones remain very elusive.",
      "created_utc": 1650361915.0,
      "score": 2,
      "context": []
    },
    {
      "id": "i5bqrx8",
      "author": "jimbobhas",
      "body": "Have you any advice for a type 1 diabetic who is struggling with ARFID? Is there any changes to normal treatment that need to be considered?",
      "created_utc": 1650364813.0,
      "score": 2,
      "context": []
    },
    {
      "id": "i5btl3y",
      "author": "wernerherzogsurethra",
      "body": "Thank you for doing this work!\n\nI am curious -- how often do you get ARFID clients presenting with actual demonstrated micronutrient deficiencies?",
      "created_utc": 1650366739.0,
      "score": 2,
      "context": []
    },
    {
      "id": "i5bxjjr",
      "author": "johto_stan",
      "body": "i am undergoing immense stress and can now eat very few foods; i've always had ARFID, but now i'm losing dangerous amounts of weight because of it. i'm looking into things like meal replacement shakes, but i need to find something affordable if i go that route.\n\nmore practically, though, is there anything at all you'd recommend for someone who's rapidly losing safe foods? i have a prescription for zofran, which at least helps keep me from vomiting if i stop soon enough, but regardless that's kind of all i have. any recommendations appreciated.",
      "created_utc": 1650369143.0,
      "score": 2,
      "context": []
    },
    {
      "id": "i5dgwvi",
      "author": "Gmzorz",
      "body": "Do you believe exposure therapy will do more good than harm? To me, having ARFID since age 4, i was heavily encouraged and sometimes (not physically) forced to eat until i was eighteen. this led to even more hatred towards the foods and short lived trauma which impacted most of my evenings.",
      "created_utc": 1650391899.0,
      "score": 2,
      "context": []
    },
    {
      "id": "i5es1tv",
      "author": "Professional_Bee534",
      "body": "Is it worth it in your opinion for someone to seek diagnosis if they manage to work around their food aversion (finding comfortable foods, no problem with lack of hunger, etc)? In other words, as an adult, what do I stand to gain from an ARFID diagnosis vs non diagnosed “picky eating”?",
      "created_utc": 1650410105.0,
      "score": 2,
      "context": []
    },
    {
      "id": "i59xk4p",
      "author": "saintceciliax",
      "body": "Since it’s your job, do you believe everyone with ARFID should/has to “recover”?",
      "created_utc": 1650326302.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kweds8j",
      "author": "imisstherxge",
      "body": "i know this is an older post but what about for someone who’s emetophobic? i go through cycles of being fine but still kind of restricting but the second i eat or drink something that hurts my stomach i fall into a spiral of anxiety and nausea and am only able to eat like 3-4 safe foods for a while until im out of it",
      "created_utc": 1711317057.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lue8fe3",
      "author": "Independent-Pen1023",
      "body": "Hoping this thread is still active as I am trying to figure out if I should take my AuDHD 8 yr old daughter to a dietician for help. She has a very restricted number of foods she will eat that are considered \"healthy\", and it is a constant source of challenge for me to ensure she is eating enough to meet her nutritional needs, in spite of her eating enough as I don't limit her safe foods - she is tall and a healthy weight. She has indicated that apart from texture, and a fear of what something will taste like, she cannot handle foods that make too much noise inside her head when she chews. Anything too crunchy is a real problem, as well as anything mushy or gristly in texture. \n\nI am quite exhausted by the rotating of these safe foods in order to ensure she doesn't tire of them, and wondering what a dietician might do to support? And, if this sounds like ARFID in spite of her seeming to thrive? She often won't eat much at all outside of the house if there aren't any safe foods for her.\n\nThank you!",
      "created_utc": 1730228380.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mefedqe",
      "author": "None",
      "body": "I'm three years late to this post but I have been doing some research on ARFID. All signs point to an ED therapist or dietitian are who can diagnose ARFID but someone I know said a nutritionist diagnosed their relative. Does a nutritionist have the qualifications to do so?",
      "created_utc": 1740353092.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mt76vn4",
      "author": "Lazy_Reward4810",
      "body": "RD here too :) How do you go about specializing in this specific area?",
      "created_utc": 1747693086.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n1w95ih",
      "author": "Ineedavodka2019",
      "body": "How do I get diagnosed as a 45 year old? I’m sick of people saying I need to try harder and grow up. I am not ASD but I do have ARFID. My doctors don’t take me seriously and I am hitting middle age and it’s starting to affect my health and weight since I can’t switch to a diet of salads and veggies. I’m getting very sad and giving up.",
      "created_utc": 1751931997.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i5922un",
      "author": "Engatar",
      "body": "I have tried looking in my area for help with AFRID but only found one location with horrible reviews which makes me anxious. What would you suggest for those of us not near treatment locations? Is there an online option for treatment with AFRID? Thank you for taking the time to anwer questions.",
      "created_utc": 1650312560.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i59k261",
      "author": "ARFIDMama",
      "body": "I have a three year old with ARFID, and we found a therapist here in Arizona.  She said she is going to start by restricting the adrenal gland near the kidney?  Have you heard of this?  Or what treatment can you recommend for a three year old?\n\n&#x200B;\n\nThank you!!!!!!!",
      "created_utc": 1650320270.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i58sl5z",
      "author": "purplechunkymonkey",
      "body": "I suspect my daughter might have ARFID. Her pediatrician calls her a difficult feeder. She will eat chicken but only seasoned with salt, pepper, and garlic. Same with pork and beef and salmon. The other protein she eats is the occasional cocktail shrimp no sauce. For fruit she eats watermelon, grapes, specific types of apples, and mandarin oranges. The only cooked vegetable she will eat is green beans. She eats all colors of bell peppers, cucumbers, celery, baby spinach, and lettuce but it has to be shredded. She is fine with most starches but will only eat potatoes in the form of fries from very specific places. The only sauce she will eat is alfredo. She will not touch anything that has tomatoes. So no ketchup, no pizza sauce, no spaghetti sauce. She can tell if I bought a new kind of pasta.\n\nShe has intense anxiety surrounding food. She needs to have control over what she eats. She has been like this since she was a toddler. At 12 she is better. We have a system worked out. If I am cooking something she doesn't like she is allowed to make her own dinner. She can cook and is quite the avid baker. If I am making pasta alfredo she gets pasta with alfredo sauce on top and whatever meat element on the side. For tacos she gets unseasoned ground beef, a tortilla,  a pile of cheese, a pile of shredded lettuce, and sometimes a pile of sour cream. These are all eaten separately. For spaghetti she gets plain noodles and usually adds parmesan. \n\nThis is just a general idea of her around food. Does this sound like ARFID to you?\n\nIs there anything else I can do to support her? We do buy whatever food she asks to try.",
      "created_utc": 1650308712.0,
      "score": 0,
      "context": []
    },
    {
      "id": "i5ckuk8",
      "author": "coarsekitten",
      "body": "Thank you for taking the time to answer questions! I have Eosinophilic esophagitis which has led to ARFID for me. My current \"safe\" foods are ground turkey breast, sweet potato, water and Sprite. Nutritionally, I know I'm probably lacking a lot but it's really hard to add things in as I react to almost everything I've tried. What one single food would you suggest trying to add in that would make up for whatever my diet is most lacking?\n\nThank you again :)",
      "created_utc": 1650379718.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i5cnjfy",
      "author": "AofMooberry",
      "body": "Hey! I am having some trouble as a fat person with ARFID. I’m in a residential program right now and had to fight my insurance company to continue to cover my stay since they don’t see treatment as necessary for me (my doctors and everyone else says otherwise).\n\nHow would you recommend explaining to people why fat people can have ARFID and hate food?\n\nAlso, how do you recommend getting over foods that have gotten you sick before? I’ve gotten food poisoning from things like chicken and eggs, so it makes what I eat even more limited.",
      "created_utc": 1650380775.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i7pk9id",
      "author": "Jealous-Fishing-6233",
      "body": "Can you still have arfid if you’re not a picky eater? I will eat almost anything (except meat as i’m vegetarian) and love trying new foods. I just hardly have an appetite and I have to schedule meal times throughout the day and force myself to eat. I am able to eat fine if something sounds very good in the moment, but otherwise I have to force myself or just skip meals completely. I have been severely underweight my whole life and have extreme dread around eating; I also have depression though so I’m not sure if that could contribute.\nThank you so much for helping!",
      "created_utc": 1651950568.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iaio5on",
      "author": "lexielesko",
      "body": "I believe I have ARFID and Aerophagia. It makes it really difficult to eat constantly, I’m probably 70-80 pounds currently but desperately want to gain more and I’m not sure what protein products to go to or start with because I am broke, and I just puked because I’ve been burping all day long since I woke up and it’s almost time for me to go to sleep. I’m not sure what to do because no doctor around me knows what either are or would help me with either. Any advice at all would be greatly appreciated! I seriously have trouble some days swallowing way too much air and making sure to eat enough every day.",
      "created_utc": 1653893069.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iew1tgt",
      "author": "Bromo_Bro",
      "body": "Have you ever tried having patients use some type of anxiolytic hallucocingen or depressant, such as benzodiazepines, alcohol, or marijuana to lower their anxiety while trying new foods? I have found I was able to try new things under the influence of these substances since my anxiety was lower and I was able to remember the taste of the food after the effects of these drugs wore off and continue to eat them.",
      "created_utc": 1656984466.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jxq9et5",
      "author": "Sunny_days02",
      "body": "Thank you for answering questions! At what age would you recommend therapy for a toddler with ARFID? My 3 year old son was recently diagnosed - he eats a pretty broad range of foods, but is highly restrictive in what he eats. Since he was an infant, it’s almost like he’s lacked an appetite or any motivation to eat and our team of doctors suspect it was severe food intolerances and reflux that took us awhile to fully figure out, that created a general aversion to food. We’re trying to create positive food experiences with him, but everyday is a struggle and he just never really shows hunger or desire to eat much. Any tips you have would be appreciated and wondering when kids seem to hit an age that types of therapy (CBT, play therapy) might be helpful?",
      "created_utc": 1692988824.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jzntrp1",
      "author": "Quiet-Tourist-6273",
      "body": "Is it possible to be more sensitive to certain foods at certain times than others? Example: yesterday my grandmother cooked sausage and rice and it’s usually one of my safe foods but I couldn’t bring myself to eat it for lunch. But at dinner I was able to eat an entire bowl of it.",
      "created_utc": 1694174291.0,
      "score": 1,
      "context": []
    },
    {
      "id": "i58xby8",
      "author": "EDRD621",
      "body": "That’s a good question. Aside from reaching out to someone for guidance, just doing some self reflection on what you’d be looking for in regards to improvement. What are your goals? What do you lose from your avoidant nature with food? This type of exercise is not to wallow in self pity, but to be matter of fact about your current situation. Life shouldn’t be manipulated around food, food should fit into someone’s life comfortably and ideally should enhance most situations. \n\nRunning through a list of foods and getting a gauge on which ones you commonly eat, which ones you’ve never tried, which ones you are apprehensive of, and which you are interested in can give you and/or a provider a great idea of opportunities for improvement",
      "created_utc": 1650310677.0,
      "score": 34,
      "context": [
        {
          "id": "i58pfky",
          "author": "The-Canary",
          "body": "What are the first steps that someone should take when they first recognize the possibility of having ARFID?",
          "created_utc": 1650307437.0
        }
      ]
    },
    {
      "id": "i5b2f0m",
      "author": "EDRD621",
      "body": "I'd look for therapists who work with eating disorders and just ask them if they have experience. If you're working with a dietitian who know ARFID well, you probably don't need to find a therapist who knows exactly how ARFID presents. They will still be helpful with their guidance.",
      "created_utc": 1650345638.0,
      "score": 17,
      "context": [
        {
          "id": "i59c68y",
          "author": "cellocats",
          "body": "How does one find a therapist who knows about/how to treat ARFID?  The last few I've asked have never even heard of it \n\nDo frozen fruits and veggies provide adequate nutrition if you can't stomach fresh produce?",
          "created_utc": 1650316707.0
        }
      ]
    },
    {
      "id": "i5a6p1p",
      "author": "Alaskaaasky",
      "body": "Can’t answer the first part and am not a dietician but frozen fruits and veggies are basically the same nutritionally as fresh.",
      "created_utc": 1650330235.0,
      "score": 18,
      "context": [
        {
          "id": "i59c68y",
          "author": "cellocats",
          "body": "How does one find a therapist who knows about/how to treat ARFID?  The last few I've asked have never even heard of it \n\nDo frozen fruits and veggies provide adequate nutrition if you can't stomach fresh produce?",
          "created_utc": 1650316707.0
        }
      ]
    },
    {
      "id": "i5pwzdf",
      "author": "HyALioP",
      "body": "Hello  \nI'm a UK based specialist in ARFID. A client of mine directed me to this thread, hope it's Ok to chat here alongside another ED professional (if not, then EDRD621 pls let me know).  \n\n\nDetails are available on [https://www.the-heath.co.uk/treatment/arfid.php](https://www.the-heath.co.uk/treatment/arfid.php)\n\nregards",
      "created_utc": 1650609676.0,
      "score": 2,
      "context": [
        {
          "id": "i59c68y",
          "author": "cellocats",
          "body": "How does one find a therapist who knows about/how to treat ARFID?  The last few I've asked have never even heard of it \n\nDo frozen fruits and veggies provide adequate nutrition if you can't stomach fresh produce?",
          "created_utc": 1650316707.0
        }
      ]
    },
    {
      "id": "i5ayz40",
      "author": "EDRD621",
      "body": "Good question. There's two ways people often go about life with an ED, in my opinion. \n\n1. They manage the situation and deal with it. There's distress and it's uncomfortable, but it's almost 'accepted' as \"I get this is a big obstacle in my life... but this is just me\".  \n2. They are actively working on treatment and recovery.\n\nMany people flip flop in between these two as well. The dilemma is that in treatment for ARFID the client is required to work through significant anxiety and discomfort. It doesn't feel good. There's very little reward for completing the task, and when compared to the avoidance techniques developed to cope with the issue (distraction for example) it's hard to consistently feel like you're in the place to challenge these behaviors. Doubled down by the fact that you need food to live, so there's this dichotomy muddying the water as well.   \n\n\nThe brain needs this persistence though. With ARFID the brain really needs to understand food and the sensations that come with it. I always remove the 'self' from the explanation because it's not a fault of the person that this has happened, as our behaviors are dictated significantly by experiences and observations. But it's the client's goal to start noticing the sensations that come with the experience of eating, which is technically mindfulness. The forces the brain to adapt. Eating consistently is a fairly good recommendation as well because our hunger hormones (and a lot of our biology) is rhythmic. \n\n&#x200B;\n\nSo, yes - you would feel better not being mindful. And in many cases, this is a good route to get someone nourished. But it's not actually working on the issue as much as it is avoidance behavior as interpreted by the brain. The brain learns that distracting is the solution, as opposed to adapting to the sensations the come with food. A good approach would utilize distraction at most meals to start, and then gradually bring in a small amount of hyper mindful eating. A snack a day or a snack a week even is helpful.",
      "created_utc": 1650343534.0,
      "score": 23,
      "context": [
        {
          "id": "i59crvm",
          "author": "deandratb",
          "body": "Have you treated anyone who finds all food disgusting? If so, how did you approach their treatment?\n\nI'm 37F and have presented ARFID symptoms since I was 3, but only learned of it two years ago. Also autistic w/anxiety, but while I know those are factors...I just don't like or enjoy food. I have my safe foods which I survive on, but if I pay too much attention to their taste and texture, then even they disgust me. \n\nThe only treatment help I've been able to access so far is a dietician without ARFID experience, and her first step was requiring me to eat at regular intervals and eat without distractions. \n\nReading while I eat has been my coping mechanism since childhood, and focusing on my food now makes me so grossed out that I'd rather starve. I had to pause treatment for unrelated reasons and am not sure how to approach that when I begin again.\n\nDo you recommend mindful eating to your ARFID clients? If so, how do you coach them through it? I've been poor my whole life, so I have a lot of experience going hungry--and when I pay attention to what I eat and that causes me to gag and choke on the food, I'd much rather just stop trying to eat at all.\n\nThank you so much for doing this! My healthcare system doesn't seem to know what ARFID even is, and denied that I need help.",
          "created_utc": 1650316997.0
        }
      ]
    },
    {
      "id": "i5a90dq",
      "author": "knappellis",
      "body": "My kiddo is currently in treatment for ARFID. Our dietician recommended that we let our kid have their phone or any distraction they want while they eat. The point is to nourish your body so you can live. I think people who put \"mindfulness\" on a pedestal need to take a seat. It is not the be all and end all of life, and it is a trendy buzzword sometimes. I hope you get all you need to address your situation, and that the actual dietician gives their informed opinion here as well.",
      "created_utc": 1650331239.0,
      "score": 22,
      "context": [
        {
          "id": "i59crvm",
          "author": "deandratb",
          "body": "Have you treated anyone who finds all food disgusting? If so, how did you approach their treatment?\n\nI'm 37F and have presented ARFID symptoms since I was 3, but only learned of it two years ago. Also autistic w/anxiety, but while I know those are factors...I just don't like or enjoy food. I have my safe foods which I survive on, but if I pay too much attention to their taste and texture, then even they disgust me. \n\nThe only treatment help I've been able to access so far is a dietician without ARFID experience, and her first step was requiring me to eat at regular intervals and eat without distractions. \n\nReading while I eat has been my coping mechanism since childhood, and focusing on my food now makes me so grossed out that I'd rather starve. I had to pause treatment for unrelated reasons and am not sure how to approach that when I begin again.\n\nDo you recommend mindful eating to your ARFID clients? If so, how do you coach them through it? I've been poor my whole life, so I have a lot of experience going hungry--and when I pay attention to what I eat and that causes me to gag and choke on the food, I'd much rather just stop trying to eat at all.\n\nThank you so much for doing this! My healthcare system doesn't seem to know what ARFID even is, and denied that I need help.",
          "created_utc": 1650316997.0
        }
      ]
    },
    {
      "id": "i59a7hu",
      "author": "EDRD621",
      "body": "You strike me as very wise! Considering that one doesn't always have a perfect mindset or perspective of a topic is an important skill in life.    \n\n\nYour logic makes sense, you'd like to ensure that you're nutritionally sound. I think that's great. But the logic is rooted in the thought that you will always be a little 'stuck in your ways' when it comes to eating. So you're looking for alternatives to 'make due', to some extent. Clients that I've worked with improve significantly - a full recovery is possible. Of course, one's perspective on foods will always be considering past experiences so it's not like they just 'forgot' about dealing with ARFID. \n\n&#x200B;\n\nI dislike the idea of replacing meals with a drink. It's what I'd call an avoidance behavior, or a management behavior in certain cases. If you're REALLY struggling, a meal replacement will be preferable to not eating. But even attempting a meal is progress. During the recovery from something like ARFID, you will be physically changing the contents of your mind as you work through some of this anxiety. It's very difficult to imagine a state of recovery, so sometimes I suggest not getting tripped up in this. Trust the process. Set small realistic goals that provide a little bit of a challenge. Ideally, you want to go into food situations/trials pretty confident that you'll be able to complete whatever the task is. For example, if eating in social situations is very difficult - try specific challenges where you eat in front of close friends/family/ or as suggested above even in front of pets/animals! Every time you engage with food, and create a positive experience, the brain starts learning that the anxiety response is unnecessary. Over time, the anxiety response disappears - but it does take continued effort and persistence. People do often get stuck in avoiding the situations that make them feel uncomfortable, but that only perpetuates the problem. The brain then starts learning 'well I deal with this problem by avoiding it', and this isn't a realistic or healthy solution. You need the brain to recognize that whatever aversion it has picked up, is irrational.",
      "created_utc": 1650315846.0,
      "score": 22,
      "context": [
        {
          "id": "i59378v",
          "author": "Telphsm4sh",
          "body": "I wanna try going on a meal replacement drink, like maybe Soylent, for a more healthy diet. But my family is saying that it's not a healthy mindset because its a cop out, it causes even more \"abnormal\" eating habits, and doesn't solve the actual problem of not eating food in public places. They say that it might end up narrowing my food choices, and that eventually I would just be on that drink. But me, I'm thinking I need to live with a healthy diet before I get anemia and/or diabetes at a young age, and if this can solve it, then that's a success, Feeling comfortable in social settings by expanding my safe foods is an optional/secondary goal. Am I having a bad mindset here? Is your end goal with patients completely \"normal\" eating habits? Or is it like this sort of damage control with meal replacement drinks and supplements?",
          "created_utc": 1650313017.0
        }
      ]
    },
    {
      "id": "i5diga7",
      "author": "Gmzorz",
      "body": "I think your family not believing that you will be in control of yourself is a problem they are facing themselves. I’m on my second year actively drinking shakes and i the only issue is that i sometimes feel bad for missing a day, this was never going to be a habit i became obsessed with. It’s “meh” in terms of taste and its fine in terms of texture, there’s yummier foods \n\nI guess the result of it takes long, but it feeds a healthy mindset and a better physical feeling",
      "created_utc": 1650392477.0,
      "score": 2,
      "context": [
        {
          "id": "i59378v",
          "author": "Telphsm4sh",
          "body": "I wanna try going on a meal replacement drink, like maybe Soylent, for a more healthy diet. But my family is saying that it's not a healthy mindset because its a cop out, it causes even more \"abnormal\" eating habits, and doesn't solve the actual problem of not eating food in public places. They say that it might end up narrowing my food choices, and that eventually I would just be on that drink. But me, I'm thinking I need to live with a healthy diet before I get anemia and/or diabetes at a young age, and if this can solve it, then that's a success, Feeling comfortable in social settings by expanding my safe foods is an optional/secondary goal. Am I having a bad mindset here? Is your end goal with patients completely \"normal\" eating habits? Or is it like this sort of damage control with meal replacement drinks and supplements?",
          "created_utc": 1650313017.0
        }
      ]
    },
    {
      "id": "i5abrya",
      "author": "EDRD621",
      "body": "Weight bias is real and is something I’m careful of. Ultimately I’m concerned and advocate for the patient based on the behaviors they present to me with. Very little is actually known about weight and eating disorders, and some healthcare professionals act very matter of fact about their opinions.\n\nHealthcare needs to work on disregarding current weight centric care, and focus on treating the problems. And this is true whether or not weight has an impact on health - studies have shown the weight focus doesn’t help.",
      "created_utc": 1650332452.0,
      "score": 6,
      "context": [
        {
          "id": "i59sad3",
          "author": "mamaxchaos",
          "body": "How do you approach weight bias within ED treatment, and how do you support clients who are not visibly malnourished but need support all the same? I’m 28 and I’ve been fat my whole life, so no one has ever believed that I could truly have an ED - I’ve even been encouraged by multiple doctors across states and insurance networks to keep restricting even if my calorie intake is dangerously low. \n\nIt took finding my current HAES-certified nutritionist advocating for me to get ANYONE to take me seriously. It’s hard to even want to get treatment if your docs are outright encouraging it, you know?",
          "created_utc": 1650323967.0
        }
      ]
    },
    {
      "id": "i5b1zz4",
      "author": "EDRD621",
      "body": "Yup. The diagnosis doesn't really matter all that much, and neither does the types of food someone eats. It's usually not fruits/veg/and meats with ARFID but that's not a defining characteristic in my opinion.",
      "created_utc": 1650345374.0,
      "score": 6,
      "context": [
        {
          "id": "i59im3r",
          "author": "ProudRavenclaw24",
          "body": "Can I still be diagnosed if it’s not having super severe health effects?\n\nMost of my safe foods are decently healthy (Nuts, fruits, most meats). I actually can’t stand most of the common, less healthy, safe foods (pizza, cheeseburgers, etc). It’s one of the main reasons I haven’t bright it up with any doctor, because I’m worried the nutritional deficit part is necessary for a diagnosis. \n\nIt still causes a lot of stress and anxiety for me though, because, sadly, I can’t just never eat in public ever.",
          "created_utc": 1650319607.0
        }
      ]
    },
    {
      "id": "i59cr5o",
      "author": "EDRD621",
      "body": "Very kind of you to take the time to learn more! \n\n&#x200B;\n\nI think the best thing you can do is understand that ARFID is, at the core, restriction driven by an anxiety response which is typically out of the control of the person working through it. Rationale, logical decision making, and even physical functioning are somewhat thrown out the window during a period of high anxiety. It's not that these people are choosing this, or just dislike certain foods. It's a lot more than that, and loved ones not understanding this is a common frustration shared by those with ARFID. \n\n&#x200B;\n\nHow you approach definitely depends on where he's at in recovery. I've had clients whose BF/GF are super helpful in assisting with new foods and challenging them. But I've also had clients who just aren't ready for that. The best you can do is communicate, and support him wherever he's at. As long as you come from a place of wanting to understand, I don't think you should worry about discussing food and eating. Of course, not everyone is ready to 'get better' and that can be difficult for a significant other to accept as well.",
      "created_utc": 1650316987.0,
      "score": 13,
      "context": [
        {
          "id": "i5965wl",
          "author": "stink3rbelle",
          "body": "I'm getting to know someone with ARFID. He's been open about it, but we haven't discussed it too deeply, and also haven't had any meals together yet. I'm under no illusions that I'm equipped to treat him, but would like to be helpful, and avoid triggers. Any tips for discussing food and eating? Or avoiding common triggers?",
          "created_utc": 1650314215.0
        }
      ]
    },
    {
      "id": "i58ia3l",
      "author": "EDRD621",
      "body": "ARFID has just a few different etiologies. Most people who struggle with ARFID have some sort of sensory sensitivity. Why this occurs can be important for an individual’s curiosity, but doesn’t seem to be particularly important for recovery. \n\nI believe it helps a lot to be “strategic” around the approach, and that’s where someone like a dietitian (who has experience in ARFID) can help a lot. \n\nHowever, the work boils down to the avoidant behavior being the limiting factor to progress. We work through two phases typically 1. Food trials which start at very low intensity such as bringing back foods that were “dropped” (used to eat), or even just changing the presentation of a food (such as sandwiches that are typically cut in half, try uncut). These increase in difficulty until the person feels comfortable working with heavily feared foods. Phase 2. Is incorporation. Taking the foods that were less aversive and working them into the diet frequently. Food being unappealing or having low appetite is often a complicating factor, but improves as a persons nutritional status improves and as consistency in eating improves. Our body is very rhythmic, so hunger cues will self regulation to our behaviors. If eating sporadically, hunger cues typically fade or we just don’t get the same impact from them. Sometimes phone reminders can be nice to just remind the person to eat -something- and keep their body consistent.\n\nAlmost everyone I’ve worked with makes really fast progress in the world of eating disorders. 20-30 sessions can yield enough progress to fix many nutritional deficiencies and reduce anxiety around eating so that the client can continue the work outside of guidance. Many people make huge improvement in just one month of consistent effort, and this month benchmark is often a good indicator for future progress in recovery.  6-8 months is the typical amount of time I’d work with someone, but it can vary a lot depending on many different factors",
      "created_utc": 1650304597.0,
      "score": 21,
      "context": [
        {
          "id": "i58d2w4",
          "author": "thrivingsad",
          "body": "What approach do you use for ARFID? \n\nFor people with ARFID who have Autism and it comes from a sensory issue, what can you do to help make more food appealing? \n\nFor those who struggle with no appetite, what do you recommend to keep them eating daily?\n\nAnd how long on average does a typical ARFID patient develop normal/healthier eating habits to where they no longer need a dietitians assistance?",
          "created_utc": 1650302524.0
        }
      ]
    },
    {
      "id": "i5ch0hm",
      "author": "EDRD621",
      "body": "I most work with adults, believe it or not. I would imagine ED treatment in England is a lot more difficult. It's probably the one and only situation where US is superior in Healthcare. You can find niche providers. \n\nYou could always reach out to telehealth providers in the US and pay privately if finances allow. This work can be done on your own, it's just more difficult and has less accountability. Start with small food exposures, ones that you KNOW you can do. Even if it's simple like just smelling a feared food, or being in the same room with it.",
      "created_utc": 1650378208.0,
      "score": 4,
      "context": [
        {
          "id": "i59h0mv",
          "author": "jennymayg13",
          "body": "How do you treat an adult with ARFID? We are in England and it’s impossible to find treatment, especially as an adult. Doctors have no clue and there are very few private services in the country.",
          "created_utc": 1650318893.0
        }
      ]
    },
    {
      "id": "i5chknr",
      "author": "EDRD621",
      "body": "The hallmark of an ED is feeling like you'll never be 'normal'. This is untrue, and full recovery is possible and happens all the time. \n\nJust from the comments you've made it sounds more like aligned with anorexia. Someone can have anorexia with ARFID like behaviors, but a defining characteristic of ARFID is lack of concern about body image. This of course is vastly different from other EDs. \n\n&#x200B;\n\nReach out to a dietitian or therapist who works helps people with eating disorders. You don't have to 'accept' the situation, and you shouldn't. You deserve better.",
      "created_utc": 1650378434.0,
      "score": 3,
      "context": [
        {
          "id": "i59fffw",
          "author": "j_p96",
          "body": "Hi, thanks for doing this. I have a few questions I think...\n\n1. How can I try to live a “normal” life while dealing with this? I’ve found it difficult to date (due to not eating and feeling sick. I don’t want them to have to deal with my BS) \n\n2. What can this disorder do to your body over time? I’ve noticed my eyesight and memory have declined a bit. But I also tend to abuse laxatives. I’ll take some after I eat pretty much every time. What are the repercussions of this over an extended period of time? \n\n3. I feel like my eating disorder can “switch” from ARFID to anorexia. How can I navigate this? \n\nSorry... I just feel stuck, and like I’ll never live like a “normal” person. It’s been a struggle for many, many years. I don’t know what to do at this point...",
          "created_utc": 1650318187.0
        }
      ]
    },
    {
      "id": "i59267a",
      "author": "EDRD621",
      "body": "Definitely a good question. \n\nI guess it comes down to why is the person engaging (or limited to) such a restricted diet? Someone who chooses to be vegan or vegetarian is typically making a cultural or spiritual choice that supersedes other potential desires or needs. This is fine, but people are often dishonest about their intentions and when it comes to self-care, you have to be honest with yourself.\n\nRestrictive diets get repetitive, and often lead to food fatigue. Food fatigue is a real experience, and usually leads to weight loss and nutritional deficiency. Someone might be fine eating the same foods on repeat for a few years…but a few decades? It’s worth considering if that’s acceptable for the person.\n\n\nThere’s also the fact that food is such a big part of our lives, and we cannot change human nature. So if someone is feeling that they can’t go to events without some emergency food plan, or food decisions are active and consistent thoughts I would reckon there is a problem.  When food is not enjoyable, a very deep psychological issue can develop as abstinence from the sources of natural pleasures has been studied deeply. We do need to engage with these pleasures and have moderation around them. \n\n\nJust be honest with yourself. No one can be honest for you. They can offer suggestions and guidance, and an honest decision should take all information into account. I always tell people, check your certainty because if you are CERTAIN about something you’re likely ill-prepared or not as informed as you should be.",
      "created_utc": 1650312598.0,
      "score": 8,
      "context": [
        {
          "id": "i58x6c0",
          "author": "Rigga-Goo-Goo",
          "body": "At what point do you consider someone to be treating ARFID effectively? If I currently have no anxiety in relation to what I eat and have enough variety in my diet that I'm not experiencing health issues (but still have a restrictive diet), is it still something that needs to be treated?\n\nI have a difficult time understanding why a restrictive diet like choosing to be vegan is socially acceptable but my own restrictive diet isn't (only speaking for my case, specifically because it's not impacting my health or mental state - I understand the seriousness of ARFID and why some people do need treatment).",
          "created_utc": 1650310611.0
        }
      ]
    },
    {
      "id": "i59buft",
      "author": "EDRD621",
      "body": "Ah, yes it does seem that autism and ARFID are two peas in a pod. \n\nThere are some really interesting dynamics with autism, nutrition, and ARFID. All of which are relatively new fields to study, so we probably won't have concrete research for many decades. I'm under the impression that ARFID is often caused (at least in part) by lack of sensory exposure to foods at a young age. Why would this be the case? Well...a few different reasons. You simply might not have had exposure, and parents never made an effort for whatever reason. You might have had a traumatic food event (like choking) which never really was worked through and this can cause self regulating avoidance behaviors which cause limited sensory exposure. Or you might just have a predisposition, such as the 'super taster' gene which makes foods a little more intense and this can cause avoidance.\n\nWhat's interesting is that autism is showing connections to our gut microbiome. So an underdeveloped gut microbiome is connected to Autism, but that's really the extent of what science knows so far. Poor gut microbiome is usually a result of limited exposure to bacteria, but especially bacteria in the food we eat. So it becomes an interesting question of what comes first? Is it that Autism being more connected with restricted food intake = poor microbiota? Or is it the microbiome leading, which is impacted by a more hygienically fixated society? I don't know the answers to these questions, but these are the questions that are limiting further developments in the field.",
      "created_utc": 1650316544.0,
      "score": 6,
      "context": [
        {
          "id": "i5961tj",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1650314170.0
        }
      ]
    },
    {
      "id": "i5ck2eh",
      "author": "EDRD621",
      "body": "Meat aversion is really common in ARFID. It's helpful to talk through with someone why you are worrying about foods cooked on the same pan as meat. The process of reframing these thoughts can be super helpful along with strategic exposures",
      "created_utc": 1650379414.0,
      "score": 3,
      "context": [
        {
          "id": "i5a6ldd",
          "author": "Alaskaaasky",
          "body": "Do you have experience with arfid meat aversion? Ever since I was a kid (I grew up in a religious household where a lot of meat was not allowed and was what had to be super particular.) I have had some success being more flexible with good but I can’t do meat to the point where I ask at restaurants about every dish, can’t really eat other food cooked on the same pan as meat. I’ve been vegetarian but soon I’m moving to a part of the world where most dishes are commonly made with some sort of meat and I really really want to be able to experience eating there without constantly worrying if I’m possibly eating meat.",
          "created_utc": 1650330192.0
        }
      ]
    },
    {
      "id": "i594j9x",
      "author": "EDRD621",
      "body": "The age old question of trying to find a therapist! Unfortunately given the rise of anxiety and depression over the last few years, the task is quite difficult. I’d recommend looking on a site like healthprofs or psychology today and filter searches to those who take your insurance. You’ll probably need to sign up on a waitlist but it’s better than nothing. Don’t be afraid to look for those doing telehealth, it’s a great option and this expands the search to anyone who is licensed in that state.",
      "created_utc": 1650313553.0,
      "score": 10,
      "context": [
        {
          "id": "i5935c3",
          "author": "museum-mama",
          "body": "How do I go about finding a therapist that takes my insurance (for my daughter that is amenable to treatment)?  Her GP agreed that she needs treatment and then gave us a list of therapists, none of which take our insurance.  I want her to have help but $150/session is a financial burden. And no, we don't qualify for aide of any kind.",
          "created_utc": 1650312996.0
        }
      ]
    },
    {
      "id": "i5ci45f",
      "author": "EDRD621",
      "body": "No problem. My RD track was 4 years as it was a program that combined academics and the supervised practice hours. It was pretty difficult, but now you need a masters so it's a bit more involved. \n\nExpanding into the field you want to do is the hard part. We opened our own practice, which is also a lot of work but is very much worth it. Generally for this I'd recommend just focusing on making friends wherever you go. Pick up hobbies that gets you engaged with big social groups, and make it your mission to learn about people. We know a lot of people just by some of the activities we do...it feels like a really strong safety net when you own a business.",
      "created_utc": 1650378647.0,
      "score": 3,
      "context": [
        {
          "id": "i59h4rp",
          "author": "Heartkid2022",
          "body": "May not be the question you are looking for, but how did you become an RD and what kind of setting do you work in? For reference, I am entering a community nutrition program planning on becoming a dietician and am interested in working with children with eating disorders.",
          "created_utc": 1650318945.0
        }
      ]
    },
    {
      "id": "i5b3xk3",
      "author": "EDRD621",
      "body": "It’s a good point. I think many people over exaggerate how “healthy” you need to eat to be well. That being said, you don’t need to guess if you’re well - get a check up and see! Foods shouldn’t be viewed as subtractive from health. You don’t eat sugary cereal and “lose health”. You would decline in nutritional status by not having enough of certain nutrients and compounds. Always think, “how can I get more fruits and vegetables” as opposed to viewing it as “how can I eat less of X food”",
      "created_utc": 1650346632.0,
      "score": 4,
      "context": [
        {
          "id": "i59hig8",
          "author": "FurretsOotersMinks",
          "body": "Is it enough to meet caloric intake and include healthy meals? Is it okay to eat unhealthy meals?\n\nI think I tend to beat myself up over this for no reason. I make and eat stuff like black bean and turkey enchiladas, soups like broccoli and cheddar, pasta fagioli, chicken tortilla soup, and so on and add spinach to things where I can (like soup). But I'm also busy so it's easy to just eat spaghetti, mac and cheese, or just sugary cereal for dinner. I feel like I know I have a good balance, but I don't feel like it's healthy enough when other people regularly eat salad and raw vegetables for snacks and whole meals. Can I still be healthy when not every meal I eat is nutritious?",
          "created_utc": 1650319114.0
        }
      ]
    },
    {
      "id": "i5cinhe",
      "author": "EDRD621",
      "body": "Yup, I have never seen someone struggle with ARFID without anxiety. If that were the case, I'm not sure I'd call it ARFID. \n\nARFID is bit more niche, especially with adults. It's not uncommon though, I think people just generally need to know that what they are struggling with is a very real phenomenon. As a dietitian I believe I just find it a bit more naturally in my work because...well I talk about food a lot. I don't think there is any other profession that would be looking into the specifics about what someone eats, so that's likely the reason why its not seen as much.",
      "created_utc": 1650378859.0,
      "score": 4,
      "context": [
        {
          "id": "i59iddk",
          "author": "AnxietyTurbulent4861",
          "body": "Is anxiety comorbid With arfid?  Why does it seem like even people who treat EDs don't know about arfid?",
          "created_utc": 1650319497.0
        }
      ]
    },
    {
      "id": "i5b1tqf",
      "author": "EDRD621",
      "body": "Yeah, disagree with the starving method haha. \n\nThe work IS super stressful. Sometimes people will have to take a medical leave. The best way to manage the stress is to start ridiculously small. Food chaining is a fairly advanced strategy. Some people have to start with just being in the same room as a feared food. And as one person mentioned, distraction can be used to help navigate the 'getting enough nutrition' part of eating.  Set small small goals that you know you'll achieve, and don't push very fast. The point is that you should be feeling success with each challenge, despite the hopefully mild stress that accompanies that challenge. Starting with an insurmountable challenge will probably lead to failure",
      "created_utc": 1650345263.0,
      "score": 4,
      "context": [
        {
          "id": "i5afyu1",
          "author": "thicketcosplay",
          "body": "How do you manage the stress and anxiety of treatment?\n\nEvery treatment that I've heard of basically involves either chaining similar foods or starving yourself until you're willing to eat anything or otherwise basically forcing yourself to eat unsafe foods until your brain accepts them. Maybe these aren't the best treatments, but it's what has always been suggested to me. I can't actually see a specialist for a long BS list of reasons, so maybe I just have no idea.\n\nFor me, even food chaining is extremely stressful. I can have a breakdown just trying a safe food with a different spice on it. Chaining to something similar but slightly different is very very stressful. Whenever I've tried to expand my safe foods this way, I've basically been unable to do anything else with my day because the stress and anxiety sapped all my energy and time and made me a distracted mess. I feel like if I ever did find some way to go through therapy, I'd have to quit my job/drop out of school and basically devote myself 100% to the treatment in order to succeed. I just wouldn't be able to handle that amount of stress and anxiety while having other things on my plate.",
          "created_utc": 1650334271.0
        }
      ]
    },
    {
      "id": "i5azdnz",
      "author": "EDRD621",
      "body": "ARFID doesn't typically present with body image issues, so I usually treat that situation differently. This doesn't mean you were misdiagnosed at all, I'm just suggesting how I deal with that. At the end of the day, the semantics of what the diagnosis is doesn't really matter much for improving, in the beginning. Most people struggling with any disordered eating will benefit from ED specific treatment.",
      "created_utc": 1650343766.0,
      "score": 2,
      "context": [
        {
          "id": "i5amzac",
          "author": "Pugtastic_smile",
          "body": "I was diagnosed with ARFID but do not meet the diagnostic criteria. My therapist said she diagnosed me because I restrict. I'm terrified to recover because of weight gain. I'm obese, which i figured played a part in my diagnosis. Can this possible wrong diagnoses hurt my treatment?",
          "created_utc": 1650337396.0
        }
      ]
    },
    {
      "id": "i5cewfr",
      "author": "EDRD621",
      "body": "Sorry to hear the stress and anxiety this has put on you. Part of the reason why I do the work that I do is that I love helping and seeing people go from that feeling of despair to hope. There's hope for everyone - don't let negative thoughts convince you otherwise.\n\n&#x200B;\n\nI don't know of any other treatments for ARFID. Exposure is really the main way because it forces the brain to adapt. Some people confuse that statement with 'It forces you to deal with it' - not exactly true. The brain and body will eventually decrease the anxiety response, but it does take time and hard work. \n\n&#x200B;\n\nA feeding tube wouldn't be a relief. A relief would be freedom with food, eating when you are hungry, having your health, being able to do to things you want to do, etc. Living off products like that isn't *ideal*. Fruits and vegetables contain small compounds called phytochemicals that cannot be synthesized or extracted from foods. These compounds do a lot - strong anti inflammatory, anti chronic disease, etc. You would miss out on these which can be a problem. Given their elusivity, it would also be an impossible thing to 'prove' that you're not getting enough. Those on tube feedings usually  have a lot of GI symptoms, which can get old. \n\n&#x200B;\n\nARFID is recognized in some treatment centers, and if not they usually have connections to people who do this work. I don't know of any services on cooking classes, but I'm sure there is something! I'd also caution the thinking that some behaviors are 'part of the OCD' and some aren't. We have one brain and mind, and mental health diagnoses are just someone's best guess at what defining criteria you fit in. Other thoughts and behaviors that don't fit within that exact criteria don't mean they are a different problem or won't improve with the work that is done in general therapy/treatment. \n\n&#x200B;\n\nSounds like you definitely should check in with someone - feeling that weak and having those symptoms like you did in college should be addressed ASAP. I know it's hard...you can do this.",
      "created_utc": 1650377351.0,
      "score": 2,
      "context": [
        {
          "id": "i5bcmo8",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1650353183.0
        }
      ]
    },
    {
      "id": "i5i2yvw",
      "author": "Telphsm4sh",
      "body": "Replying because I also want to see an answer to their perspective on patients with emetophobia. I also have it.",
      "created_utc": 1650473473.0,
      "score": 1,
      "context": [
        {
          "id": "i5df15m",
          "author": "star-rise",
          "body": "I think I have this. Lately I've been afraid to eat solid food (I have emetophobia and it has worsened) so I've mostly been having protein shakes. Other than that, there are only a few foods I consider safe because whenever I do get the courage to eat because they have a low risk of vomiting: rice, pasta, broth, and tomato sauce. And I have them paired with cooked carrots, celery, or peas. Also gentle foods such as bananas with peanut butter or applesauce. \n\nI read that emetophobia is a common cause of ARFID. If you have had any emetophobia-related ARFID patients who improved or recovered, what helped them?",
          "created_utc": 1650391193.0
        }
      ]
    },
    {
      "id": "i58u66r",
      "author": "EDRD621",
      "body": "First, I always try to explain that anxiety is inherently functional. It’s somewhat normal that our brain’s neurological pathways have associated aspects of fear and anxiety with food. \n\nOur brains are actively learning every single time we eat. As someone with a passion in the subject, I’m still amazed by the degree to which people of all ages subconsciously learn during eating. \n\nOf course the problem is that we don’t have a filter on that learning. Food aversions are created just as easily as preferred foods. Food situations, especially the social situations you mentioned, can be as fulfilling as they can be detrimental.\n\nThe specifics of what will help you will be individual, but the process is ultimately consistent for everyone. You need to create more positive food-centric social situations. That strategy of how this is done is really the key, but someone who is introspective could do this on their own. Start as small as you need to, these challenges should be challenging without seeming impossible. If eating in front of ANYONE produces anxiety - have a tea party with your dog or cat. Seriously. If you can tolerate a few close friends or family, practice that. \n\nYou want a surmountable challenge, you do not want to be practicing at some grand feast. The problem typically is that people start with challenges far too hard and/or avoid challenges all together. The work is meant to induce this anxiety, and you need to work through it, but it needs to be an appropriately tailored challenge so that you can almost guarantee success.\n\nFurthermore, practicing in controlling our inward focus (are they watching me? What do I look like? Are they judging the foods I’m eating?) with meditation is totally invaluable. Meditation is the skill of consciousness, NOT an activity that is done to reduce stress. Practice observing without judgement. I like the app Waking up by Sam Harris for this.",
      "created_utc": 1650309371.0,
      "score": 4,
      "context": [
        {
          "id": "i58kx07",
          "author": "Grungslinger",
          "body": "Tactics to lower anxiety? Mainly eating around other people and the fear of being criticized for food selection.\n\nObviously the best tactic is to go to a Dietician and think of tatics together, but do you have anything off the top of your head you'll recommend anybody struggling with that sort of anxiety?",
          "created_utc": 1650305647.0
        }
      ]
    },
    {
      "id": "i58kro3",
      "author": "EDRD621",
      "body": "Chewable calcium citrate is a good alternative and well absorbed - better than many calcium carbonate pills. The problem with bone density is that we stop building stores for this in our early 20s, and the job then becomes maintaining that density through healthy behaviors. \n\nFor appetite - it can often improve with consistency due to your hunger hormones becoming more regular. If someone has been consistently eating and sees no improvement we would often look at ways to reduce for most meals. Some will seek treatment and be told to eat challenging meals frequently, but this will backfire often. Look at the meal experience as a whole - are you in a comfortable environment? Meals that you eat should be preferred unless you’re specifically working on 1 or 2 foods to incorporate during that meal. Are there other things in life that might be worked on to help with the baseline anxiety and/or depression? Connection to others, sense of meaning, etc - these can be topics discussed with a therapist and often do come up as significant behaviors for eating so the RD might touch upon these. If you’re undernourished, getting nourished is the primary goal because malnourishment will breed anxiety and often will lead to poor appetite. If that’s the case, often you’d want to distract yourself at meals as opposed to being mindful. Television, phone, music, etc. These can be helpful in the pursuit of nutritional restoration. \n\nOften those who struggle with ARFID lack intake of omega-3 fatty acids which can really exacerbate poor mood and anxiety. It’s smart to start getting more of these if general mood is a concern.",
      "created_utc": 1650305587.0,
      "score": 8,
      "context": [
        {
          "id": "i58dzrs",
          "author": "AbunaiE",
          "body": "Recommendations for calcium?  I take a calcium supplement but I need a larger dose and have a very hard time swallowing pills.  My DEXA just showed that I'm osteopenic and I need to further supplement my diet (I can't eat dairy).  How much should I look to get every day and do you have recommendations for supplements that are easy to swallow or foods I can incorporate?\n\nI have a dietician but all she wants to talk about are my feelings and I really just want to make sure my hips aren't going to snap off.\n\nBonus question: Other than mechanical eating how do you encourage someone that is disinterested?  I have a very limited diet due to Eosinophilic Esophagitis and am just bummed at every meal.  \n\n\nThank you, I very much appreciate your help.",
          "created_utc": 1650302891.0
        }
      ]
    },
    {
      "id": "i58w3oh",
      "author": "EDRD621",
      "body": "Lack of sensory exposure to different foods at early age can bring about ARFID like restriction, I suspect it to be causal but there’s likely genetic predispositions as well.\n\nTo be very clear, ARFIDs defining characteristics contradict the characteristics of Anorexia. If Anorexia is suspected then you’ll have more success exploring that avenue. I’ve worked with clients who have Anorexia who do have sensory based aversions, and wouldn’t be surprised to see ARFID like behaviors grow into Anorexia like behaviors. The etiologies are very different though, so approach to treatment is different. \n\nIf there’s concern about body image it’s more Anorexic. Fear regarding treatment is usually Anorexia as well because to someone struggling with ARFID the idea of treatment usually promotes a feeling of relief rather than anxiety. \n\nA child with Anorexia should be forced to go into treatment. It’s too much of a slippery slope to allow those behaviors to continue. It’s sad…quite frankly there have been epidemic-like increases in Anorexia over the last 2 years.",
      "created_utc": 1650310169.0,
      "score": 7,
      "context": [
        {
          "id": "i58ovuh",
          "author": "odythecat",
          "body": "I have a family member with celiac disease and ARFID, so her list of safe foods is influenced by both her ED and by gluten content. She’s also vegetarian (by choice-we offer opportunities to try different meats, but not interested). I’ve often wondered if the ARFID grew out of the dietary restrictions she’s grown up with (diagnosed celiac at age 6). \n\nLately her list of safe foods has shrunk to just a handful of things - mostly corn tortillas, cholula, and candy. She hasn’t eaten a single lunch at school all year. We’re worried her ED is starting to include anorexia. She declined participation in our local ED program (which, to be fair, seemed to not understand ARFID at all) and has gone to a psychologist in past but is generally not open to talking about eating. \n\nAny thoughts? 14F.",
          "created_utc": 1650307220.0
        }
      ]
    },
    {
      "id": "i58ym3b",
      "author": "EDRD621",
      "body": "It can be hit or miss. You definitely need a dietitian who is familiar with ARFID. That’s not always easy. I have ED clinics reaching out to me for support with ARFID, and these are people who are supposed to be qualified. \n\nTherapy is always recommended, but reasons why you might have current ARFID like behaviors are somewhat irrelevant for progress in treatment. Of course, discussing where some of these things originated from can be helpful for healing in general.\n\nHow did you conquer the fear of roller coasters? My guess is that you exposed yourself slowly, but strategically. The same for ARFID! I typically assist people with being mindful during specific food trials. One common question I ask is “how would you describe this food, as if I had NO idea what it was?” It’s not an easy task to do this, and requires really paying attention and fixating on the sensations without judgement. Of course, we would work in general diet patterns as well because this is often an aspect of the overall problem as well",
      "created_utc": 1650311164.0,
      "score": 6,
      "context": [
        {
          "id": "i58qhwe",
          "author": "Kindlabs",
          "body": "I hadn’t considered trying a dietitian, I’ve unsuccessfully contacted a few therapists and had kinda given up hope. Would this be a good avenue for me to pursue next?\n\nI’m on the spectrum and have sensory issues, texture and taste sensitivity both impact my eating, and some minor childhood trauma around food cemented it in. I have strong will, I was able to overcome my fear of roller coasters on my own, but my food issues still evade me into my 30s. \n\nI was hoping to get into therapy and maybe do some sort of exposure therapy. What would treatment with a dietitian look like?",
          "created_utc": 1650307864.0
        }
      ]
    },
    {
      "id": "i5cbpwg",
      "author": "EDRD621",
      "body": "There's also a genetic component too! Many of my clients have the 'supertaster' gene which impacts how taste is perceived, but there are probably many more individual predispositions.",
      "created_utc": 1650376022.0,
      "score": 3,
      "context": [
        {
          "id": "i5beckn",
          "author": "lieunee",
          "body": "“I'm under the impression that ARFID is often caused (at least in part) by lack of sensory exposure to foods at a young age. Why would this be the case? Well...a few different reasons. You simply might not have had exposure, and parents never made an effort for whatever reason.”\n\nAs a parent of a kid with ARFID I hear stuff like this a lot but, I feel like families with multiple kids don’t often have more than one with ARFID so, I’m alway intrigued by this explanation. (I was the one with ARFID growing up, my sister was and is and adventurous eater. My son has ARFID, his sister will eat anything. In both cases the same varied diet was available.)",
          "created_utc": 1650354616.0
        }
      ]
    },
    {
      "id": "i5beoeq",
      "author": "lieunee",
      "body": "Oh, but my question I guess is do you have recommendations for parents of kids with ARFID? Your approach to treatment seems sound for adults who wish to make changes. My kid is currently in treatment (for 2 years now) BUT his heart isn’t in it so, progress is S L O W.\n\nETA: Not trying to suggest he isn’t trying, he really is! The maturity level for an undertaking of this magnitude however, I feel like he’s just not there yet.",
      "created_utc": 1650354901.0,
      "score": 1,
      "context": [
        {
          "id": "i5beckn",
          "author": "lieunee",
          "body": "“I'm under the impression that ARFID is often caused (at least in part) by lack of sensory exposure to foods at a young age. Why would this be the case? Well...a few different reasons. You simply might not have had exposure, and parents never made an effort for whatever reason.”\n\nAs a parent of a kid with ARFID I hear stuff like this a lot but, I feel like families with multiple kids don’t often have more than one with ARFID so, I’m alway intrigued by this explanation. (I was the one with ARFID growing up, my sister was and is and adventurous eater. My son has ARFID, his sister will eat anything. In both cases the same varied diet was available.)",
          "created_utc": 1650354616.0
        }
      ]
    },
    {
      "id": "i5b32kb",
      "author": "EDRD621",
      "body": "It’s hard to do specific actions with this because it can be hard to gauge exactly how someone may be feeling in a certain situation. The most supportive significant others are very understanding and will advocate for them when it’s difficult to do so. Being supportive in recovery is of course something that will feel like a push pull dynamic. I have clients with significant others who have figured this out well - they push them just enough and accommodate just enough. Of course I don’t really have a solid view of the scenario in which the person struggling doesn’t have a desire to improve. If this is the case then the dynamic is probably mostly accommodating, communication, and a gentle push to seek treatment and improve the stressors/anxieties of daily life",
      "created_utc": 1650346062.0,
      "score": 2,
      "context": [
        {
          "id": "i59rq8l",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1650323718.0
        }
      ]
    },
    {
      "id": "i5aomv9",
      "author": "EDRD621",
      "body": "It's pretty common to struggle with weight gain and ARFID actually. It's strange that even within ARFID treatment you don't see a lot of acceptance regarding this fact. Look for an outpatient dietitian!",
      "created_utc": 1650338157.0,
      "score": 3,
      "context": [
        {
          "id": "i5ag512",
          "author": "LexCyborg",
          "body": "How often do you see people with arfid and rapid weight gain? How does treatment differ in that case? I have severe arfid but still eat a lot of the same food… just entirely empty calories. Trying to find treatment but I don’t seem to fit the criteria for a lot of places :/",
          "created_utc": 1650334349.0
        }
      ]
    },
    {
      "id": "i5b0frg",
      "author": "EDRD621",
      "body": "Hm, I guess this is a difficult question for me as I don't actually believe sugar addiction is real. I think the act of eating certain foods could be appealing and rewarding enough to mimic how an addiction presents, but I don't think sugar specifically plays a role in that. I know there are many people who would disagree with this though.",
      "created_utc": 1650344409.0,
      "score": 3,
      "context": [
        {
          "id": "i5ak4ef",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1650336101.0
        }
      ]
    },
    {
      "id": "i5ac1zj",
      "author": "EDRD621",
      "body": "Has to recover? I wouldn’t say HAS to, but they should work on this in my opinion. Ultimately we are free to do whatever we would like…when we are 18 at least.",
      "created_utc": 1650332570.0,
      "score": 2,
      "context": [
        {
          "id": "i59xk4p",
          "author": "saintceciliax",
          "body": "Since it’s your job, do you believe everyone with ARFID should/has to “recover”?",
          "created_utc": 1650326302.0
        }
      ]
    },
    {
      "id": "i592j4k",
      "author": "EDRD621",
      "body": "Luckily telehealth is a thing now. This is something that my business has be utilizing heavily, and offers invaluable flexibility and convenience for the patient. This work doesn’t require you to be in person!",
      "created_utc": 1650312744.0,
      "score": 3,
      "context": [
        {
          "id": "i5922un",
          "author": "Engatar",
          "body": "I have tried looking in my area for help with AFRID but only found one location with horrible reviews which makes me anxious. What would you suggest for those of us not near treatment locations? Is there an online option for treatment with AFRID? Thank you for taking the time to anwer questions.",
          "created_utc": 1650312560.0
        }
      ]
    },
    {
      "id": "i5cntrh",
      "author": "EDRD621",
      "body": ">restricting the adrenal gland\n\nThought to be 'turned off' or limited by touch therapy. It's an interesting approach and has some decent evidence behind it. I don't do this though so I can speak much on it.",
      "created_utc": 1650380887.0,
      "score": 3,
      "context": [
        {
          "id": "i59k261",
          "author": "ARFIDMama",
          "body": "I have a three year old with ARFID, and we found a therapist here in Arizona.  She said she is going to start by restricting the adrenal gland near the kidney?  Have you heard of this?  Or what treatment can you recommend for a three year old?\n\n&#x200B;\n\nThank you!!!!!!!",
          "created_utc": 1650320270.0
        }
      ]
    },
    {
      "id": "i58zzod",
      "author": "EDRD621",
      "body": "Maybe…\n\nOff that description it seems like she eats a fairly diverse set of foods. It can be difficult for parents to discern because kids naturally are working through a lot of the processes involved with acquiring tastes for foods. I’d say if severe anxiety is present, and is a limiting factor to eating in certain situations then it could definitely be ARFID. \n\nIt almost sounds like the control aspect she displays around food could be more of the “problem” rather than something sensory or rooted in fear. Of course, take that with a grain of salt because these issues are often complicated and dynamic",
      "created_utc": 1650311711.0,
      "score": 1,
      "context": [
        {
          "id": "i58sl5z",
          "author": "purplechunkymonkey",
          "body": "I suspect my daughter might have ARFID. Her pediatrician calls her a difficult feeder. She will eat chicken but only seasoned with salt, pepper, and garlic. Same with pork and beef and salmon. The other protein she eats is the occasional cocktail shrimp no sauce. For fruit she eats watermelon, grapes, specific types of apples, and mandarin oranges. The only cooked vegetable she will eat is green beans. She eats all colors of bell peppers, cucumbers, celery, baby spinach, and lettuce but it has to be shredded. She is fine with most starches but will only eat potatoes in the form of fries from very specific places. The only sauce she will eat is alfredo. She will not touch anything that has tomatoes. So no ketchup, no pizza sauce, no spaghetti sauce. She can tell if I bought a new kind of pasta.\n\nShe has intense anxiety surrounding food. She needs to have control over what she eats. She has been like this since she was a toddler. At 12 she is better. We have a system worked out. If I am cooking something she doesn't like she is allowed to make her own dinner. She can cook and is quite the avid baker. If I am making pasta alfredo she gets pasta with alfredo sauce on top and whatever meat element on the side. For tacos she gets unseasoned ground beef, a tortilla,  a pile of cheese, a pile of shredded lettuce, and sometimes a pile of sour cream. These are all eaten separately. For spaghetti she gets plain noodles and usually adds parmesan. \n\nThis is just a general idea of her around food. Does this sound like ARFID to you?\n\nIs there anything else I can do to support her? We do buy whatever food she asks to try.",
          "created_utc": 1650308712.0
        }
      ]
    },
    {
      "id": "idgrbkk",
      "author": "EDRD621",
      "body": "Sorry to hear that - look up dietitians around you (in your state is good enough with telehealth) with experience in eating disorders. HealthProfs is a site where you can search for this :). These types of issues require support from someone, even if they aren’t the most experienced with these specific issues they can be helpful for moving forward.",
      "created_utc": 1656010778.0,
      "score": 2,
      "context": [
        {
          "id": "iaio5on",
          "author": "lexielesko",
          "body": "I believe I have ARFID and Aerophagia. It makes it really difficult to eat constantly, I’m probably 70-80 pounds currently but desperately want to gain more and I’m not sure what protein products to go to or start with because I am broke, and I just puked because I’ve been burping all day long since I woke up and it’s almost time for me to go to sleep. I’m not sure what to do because no doctor around me knows what either are or would help me with either. Any advice at all would be greatly appreciated! I seriously have trouble some days swallowing way too much air and making sure to eat enough every day.",
          "created_utc": 1653893069.0
        }
      ]
    },
    {
      "id": "i5bf7vq",
      "author": "deandratb",
      "body": "Thank you so much!! This makes complete sense to me, and the advice at the end may be much more possible, for a slow progression before I go back to working with my dietician. I really appreciate your engagement here.",
      "created_utc": 1650355365.0,
      "score": 5,
      "context": [
        {
          "id": "i59crvm",
          "author": "deandratb",
          "body": "Have you treated anyone who finds all food disgusting? If so, how did you approach their treatment?\n\nI'm 37F and have presented ARFID symptoms since I was 3, but only learned of it two years ago. Also autistic w/anxiety, but while I know those are factors...I just don't like or enjoy food. I have my safe foods which I survive on, but if I pay too much attention to their taste and texture, then even they disgust me. \n\nThe only treatment help I've been able to access so far is a dietician without ARFID experience, and her first step was requiring me to eat at regular intervals and eat without distractions. \n\nReading while I eat has been my coping mechanism since childhood, and focusing on my food now makes me so grossed out that I'd rather starve. I had to pause treatment for unrelated reasons and am not sure how to approach that when I begin again.\n\nDo you recommend mindful eating to your ARFID clients? If so, how do you coach them through it? I've been poor my whole life, so I have a lot of experience going hungry--and when I pay attention to what I eat and that causes me to gag and choke on the food, I'd much rather just stop trying to eat at all.\n\nThank you so much for doing this! My healthcare system doesn't seem to know what ARFID even is, and denied that I need help.",
          "created_utc": 1650316997.0
        },
        {
          "id": "i5ayz40",
          "author": "EDRD621",
          "body": "Good question. There's two ways people often go about life with an ED, in my opinion. \n\n1. They manage the situation and deal with it. There's distress and it's uncomfortable, but it's almost 'accepted' as \"I get this is a big obstacle in my life... but this is just me\".  \n2. They are actively working on treatment and recovery.\n\nMany people flip flop in between these two as well. The dilemma is that in treatment for ARFID the client is required to work through significant anxiety and discomfort. It doesn't feel good. There's very little reward for completing the task, and when compared to the avoidance techniques developed to cope with the issue (distraction for example) it's hard to consistently feel like you're in the place to challenge these behaviors. Doubled down by the fact that you need food to live, so there's this dichotomy muddying the water as well.   \n\n\nThe brain needs this persistence though. With ARFID the brain really needs to understand food and the sensations that come with it. I always remove the 'self' from the explanation because it's not a fault of the person that this has happened, as our behaviors are dictated significantly by experiences and observations. But it's the client's goal to start noticing the sensations that come with the experience of eating, which is technically mindfulness. The forces the brain to adapt. Eating consistently is a fairly good recommendation as well because our hunger hormones (and a lot of our biology) is rhythmic. \n\n&#x200B;\n\nSo, yes - you would feel better not being mindful. And in many cases, this is a good route to get someone nourished. But it's not actually working on the issue as much as it is avoidance behavior as interpreted by the brain. The brain learns that distracting is the solution, as opposed to adapting to the sensations the come with food. A good approach would utilize distraction at most meals to start, and then gradually bring in a small amount of hyper mindful eating. A snack a day or a snack a week even is helpful.",
          "created_utc": 1650343534.0
        }
      ]
    },
    {
      "id": "i5asabu",
      "author": "deandratb",
      "body": "Thank you for this. When I get back in touch with my dietician, I do plan to ask her what the reasoning is behind the mindfulness suggestion. After struggling to get any help at all, I was so grateful for her kind competence that I didn't ask further questions--but I have no idea how mindfulness is supposed to be helpful for me, given my specific issues. I hope to get a reply here as well.",
      "created_utc": 1650339934.0,
      "score": 8,
      "context": [
        {
          "id": "i59crvm",
          "author": "deandratb",
          "body": "Have you treated anyone who finds all food disgusting? If so, how did you approach their treatment?\n\nI'm 37F and have presented ARFID symptoms since I was 3, but only learned of it two years ago. Also autistic w/anxiety, but while I know those are factors...I just don't like or enjoy food. I have my safe foods which I survive on, but if I pay too much attention to their taste and texture, then even they disgust me. \n\nThe only treatment help I've been able to access so far is a dietician without ARFID experience, and her first step was requiring me to eat at regular intervals and eat without distractions. \n\nReading while I eat has been my coping mechanism since childhood, and focusing on my food now makes me so grossed out that I'd rather starve. I had to pause treatment for unrelated reasons and am not sure how to approach that when I begin again.\n\nDo you recommend mindful eating to your ARFID clients? If so, how do you coach them through it? I've been poor my whole life, so I have a lot of experience going hungry--and when I pay attention to what I eat and that causes me to gag and choke on the food, I'd much rather just stop trying to eat at all.\n\nThank you so much for doing this! My healthcare system doesn't seem to know what ARFID even is, and denied that I need help.",
          "created_utc": 1650316997.0
        },
        {
          "id": "i5a90dq",
          "author": "knappellis",
          "body": "My kiddo is currently in treatment for ARFID. Our dietician recommended that we let our kid have their phone or any distraction they want while they eat. The point is to nourish your body so you can live. I think people who put \"mindfulness\" on a pedestal need to take a seat. It is not the be all and end all of life, and it is a trendy buzzword sometimes. I hope you get all you need to address your situation, and that the actual dietician gives their informed opinion here as well.",
          "created_utc": 1650331239.0
        }
      ]
    },
    {
      "id": "i5al2se",
      "author": "seddit_rucks",
      "body": "> I dislike the idea of replacing meals with a drink. It's what I'd call an avoidance behavior, or a management behavior in certain cases.\n\nSo what.  That's not justification.  Meal replacements drinks are...meal replacements.  Meaning meals.\n\nIf people with ARFID are getting their nutrition through a drink, that's surely a major improvement over saltines and chicken nuggets, no?",
      "created_utc": 1650336530.0,
      "score": 11,
      "context": [
        {
          "id": "i59378v",
          "author": "Telphsm4sh",
          "body": "I wanna try going on a meal replacement drink, like maybe Soylent, for a more healthy diet. But my family is saying that it's not a healthy mindset because its a cop out, it causes even more \"abnormal\" eating habits, and doesn't solve the actual problem of not eating food in public places. They say that it might end up narrowing my food choices, and that eventually I would just be on that drink. But me, I'm thinking I need to live with a healthy diet before I get anemia and/or diabetes at a young age, and if this can solve it, then that's a success, Feeling comfortable in social settings by expanding my safe foods is an optional/secondary goal. Am I having a bad mindset here? Is your end goal with patients completely \"normal\" eating habits? Or is it like this sort of damage control with meal replacement drinks and supplements?",
          "created_utc": 1650313017.0
        },
        {
          "id": "i59a7hu",
          "author": "EDRD621",
          "body": "You strike me as very wise! Considering that one doesn't always have a perfect mindset or perspective of a topic is an important skill in life.    \n\n\nYour logic makes sense, you'd like to ensure that you're nutritionally sound. I think that's great. But the logic is rooted in the thought that you will always be a little 'stuck in your ways' when it comes to eating. So you're looking for alternatives to 'make due', to some extent. Clients that I've worked with improve significantly - a full recovery is possible. Of course, one's perspective on foods will always be considering past experiences so it's not like they just 'forgot' about dealing with ARFID. \n\n&#x200B;\n\nI dislike the idea of replacing meals with a drink. It's what I'd call an avoidance behavior, or a management behavior in certain cases. If you're REALLY struggling, a meal replacement will be preferable to not eating. But even attempting a meal is progress. During the recovery from something like ARFID, you will be physically changing the contents of your mind as you work through some of this anxiety. It's very difficult to imagine a state of recovery, so sometimes I suggest not getting tripped up in this. Trust the process. Set small realistic goals that provide a little bit of a challenge. Ideally, you want to go into food situations/trials pretty confident that you'll be able to complete whatever the task is. For example, if eating in social situations is very difficult - try specific challenges where you eat in front of close friends/family/ or as suggested above even in front of pets/animals! Every time you engage with food, and create a positive experience, the brain starts learning that the anxiety response is unnecessary. Over time, the anxiety response disappears - but it does take continued effort and persistence. People do often get stuck in avoiding the situations that make them feel uncomfortable, but that only perpetuates the problem. The brain then starts learning 'well I deal with this problem by avoiding it', and this isn't a realistic or healthy solution. You need the brain to recognize that whatever aversion it has picked up, is irrational.",
          "created_utc": 1650315846.0
        }
      ]
    },
    {
      "id": "i5angbe",
      "author": "mamaxchaos",
      "body": "Thank you so much for saying that. I studied weight bias in undergrad and it’s insane to me that obesity is the only thing like it that’s treated as both a symptom and cause. Constantly. If it was a matter of wanting to be thin and working hard enough on it, NO ONE would be overweight. But the reality is it’s way more complicated than that and fat patients STILL deserve medical care?? Like even if obesity was 100% of the time the obese persons “fault”, they’d still deserve ethical and humane treatment of their illnesses and symptoms. \n\nI’m really glad you’re on the weight neutrality side. I’d have gotten help so much sooner with a doc like you",
      "created_utc": 1650337609.0,
      "score": 2,
      "context": [
        {
          "id": "i59sad3",
          "author": "mamaxchaos",
          "body": "How do you approach weight bias within ED treatment, and how do you support clients who are not visibly malnourished but need support all the same? I’m 28 and I’ve been fat my whole life, so no one has ever believed that I could truly have an ED - I’ve even been encouraged by multiple doctors across states and insurance networks to keep restricting even if my calorie intake is dangerously low. \n\nIt took finding my current HAES-certified nutritionist advocating for me to get ANYONE to take me seriously. It’s hard to even want to get treatment if your docs are outright encouraging it, you know?",
          "created_utc": 1650323967.0
        },
        {
          "id": "i5abrya",
          "author": "EDRD621",
          "body": "Weight bias is real and is something I’m careful of. Ultimately I’m concerned and advocate for the patient based on the behaviors they present to me with. Very little is actually known about weight and eating disorders, and some healthcare professionals act very matter of fact about their opinions.\n\nHealthcare needs to work on disregarding current weight centric care, and focus on treating the problems. And this is true whether or not weight has an impact on health - studies have shown the weight focus doesn’t help.",
          "created_utc": 1650332452.0
        }
      ]
    },
    {
      "id": "i598v4c",
      "author": "museum-mama",
      "body": "thanks - I am aware of those sites but there is no way to filter out people who don't have experience with ARFID.  I really don't want my child to experience the trauma of another health professional that just tells her to eat her vegetables.  We've had enough of that.  I was hoping you would know how to find ARFID-aware specialists because they are few and far between.",
      "created_utc": 1650315304.0,
      "score": 12,
      "context": [
        {
          "id": "i5935c3",
          "author": "museum-mama",
          "body": "How do I go about finding a therapist that takes my insurance (for my daughter that is amenable to treatment)?  Her GP agreed that she needs treatment and then gave us a list of therapists, none of which take our insurance.  I want her to have help but $150/session is a financial burden. And no, we don't qualify for aide of any kind.",
          "created_utc": 1650312996.0
        },
        {
          "id": "i594j9x",
          "author": "EDRD621",
          "body": "The age old question of trying to find a therapist! Unfortunately given the rise of anxiety and depression over the last few years, the task is quite difficult. I’d recommend looking on a site like healthprofs or psychology today and filter searches to those who take your insurance. You’ll probably need to sign up on a waitlist but it’s better than nothing. Don’t be afraid to look for those doing telehealth, it’s a great option and this expands the search to anyone who is licensed in that state.",
          "created_utc": 1650313553.0
        }
      ]
    },
    {
      "id": "i5cbqnv",
      "author": "FurretsOotersMinks",
      "body": "Thank you!",
      "created_utc": 1650376031.0,
      "score": 1,
      "context": [
        {
          "id": "i59hig8",
          "author": "FurretsOotersMinks",
          "body": "Is it enough to meet caloric intake and include healthy meals? Is it okay to eat unhealthy meals?\n\nI think I tend to beat myself up over this for no reason. I make and eat stuff like black bean and turkey enchiladas, soups like broccoli and cheddar, pasta fagioli, chicken tortilla soup, and so on and add spinach to things where I can (like soup). But I'm also busy so it's easy to just eat spaghetti, mac and cheese, or just sugary cereal for dinner. I feel like I know I have a good balance, but I don't feel like it's healthy enough when other people regularly eat salad and raw vegetables for snacks and whole meals. Can I still be healthy when not every meal I eat is nutritious?",
          "created_utc": 1650319114.0
        },
        {
          "id": "i5b3xk3",
          "author": "EDRD621",
          "body": "It’s a good point. I think many people over exaggerate how “healthy” you need to eat to be well. That being said, you don’t need to guess if you’re well - get a check up and see! Foods shouldn’t be viewed as subtractive from health. You don’t eat sugary cereal and “lose health”. You would decline in nutritional status by not having enough of certain nutrients and compounds. Always think, “how can I get more fruits and vegetables” as opposed to viewing it as “how can I eat less of X food”",
          "created_utc": 1650346632.0
        }
      ]
    },
    {
      "id": "i5d8gki",
      "author": "AnxietyTurbulent4861",
      "body": "Thanks :)",
      "created_utc": 1650388773.0,
      "score": 1,
      "context": [
        {
          "id": "i59iddk",
          "author": "AnxietyTurbulent4861",
          "body": "Is anxiety comorbid With arfid?  Why does it seem like even people who treat EDs don't know about arfid?",
          "created_utc": 1650319497.0
        },
        {
          "id": "i5cinhe",
          "author": "EDRD621",
          "body": "Yup, I have never seen someone struggle with ARFID without anxiety. If that were the case, I'm not sure I'd call it ARFID. \n\nARFID is bit more niche, especially with adults. It's not uncommon though, I think people just generally need to know that what they are struggling with is a very real phenomenon. As a dietitian I believe I just find it a bit more naturally in my work because...well I talk about food a lot. I don't think there is any other profession that would be looking into the specifics about what someone eats, so that's likely the reason why its not seen as much.",
          "created_utc": 1650378859.0
        }
      ]
    },
    {
      "id": "i5cqcl4",
      "author": "thicketcosplay",
      "body": "For me, I'm usually fine until I have to actually put the food in my mouth. Smelling it, looking at it, that's all fine for me. I've tried just licking the food, putting it in my mouth and spitting it out, all those slow steps. But the anxiety just gets too high even with small steps, even if it's just a safe food with an added spice or some other very minor change. And it seems like such a long process that a short leave isn't enough to do any kind of meaningful treatment, I'd have to step back from everything in my life for months to be able to manage the anxiety and make any kind of progress.",
      "created_utc": 1650381853.0,
      "score": 2,
      "context": [
        {
          "id": "i5afyu1",
          "author": "thicketcosplay",
          "body": "How do you manage the stress and anxiety of treatment?\n\nEvery treatment that I've heard of basically involves either chaining similar foods or starving yourself until you're willing to eat anything or otherwise basically forcing yourself to eat unsafe foods until your brain accepts them. Maybe these aren't the best treatments, but it's what has always been suggested to me. I can't actually see a specialist for a long BS list of reasons, so maybe I just have no idea.\n\nFor me, even food chaining is extremely stressful. I can have a breakdown just trying a safe food with a different spice on it. Chaining to something similar but slightly different is very very stressful. Whenever I've tried to expand my safe foods this way, I've basically been unable to do anything else with my day because the stress and anxiety sapped all my energy and time and made me a distracted mess. I feel like if I ever did find some way to go through therapy, I'd have to quit my job/drop out of school and basically devote myself 100% to the treatment in order to succeed. I just wouldn't be able to handle that amount of stress and anxiety while having other things on my plate.",
          "created_utc": 1650334271.0
        },
        {
          "id": "i5b1tqf",
          "author": "EDRD621",
          "body": "Yeah, disagree with the starving method haha. \n\nThe work IS super stressful. Sometimes people will have to take a medical leave. The best way to manage the stress is to start ridiculously small. Food chaining is a fairly advanced strategy. Some people have to start with just being in the same room as a feared food. And as one person mentioned, distraction can be used to help navigate the 'getting enough nutrition' part of eating.  Set small small goals that you know you'll achieve, and don't push very fast. The point is that you should be feeling success with each challenge, despite the hopefully mild stress that accompanies that challenge. Starting with an insurmountable challenge will probably lead to failure",
          "created_utc": 1650345263.0
        }
      ]
    },
    {
      "id": "i5smbtp",
      "author": "star-rise",
      "body": "I'm sorry you have it too, it's rough :( I hope OP replies, I can't find much information about this.",
      "created_utc": 1650659173.0,
      "score": 2,
      "context": [
        {
          "id": "i5df15m",
          "author": "star-rise",
          "body": "I think I have this. Lately I've been afraid to eat solid food (I have emetophobia and it has worsened) so I've mostly been having protein shakes. Other than that, there are only a few foods I consider safe because whenever I do get the courage to eat because they have a low risk of vomiting: rice, pasta, broth, and tomato sauce. And I have them paired with cooked carrots, celery, or peas. Also gentle foods such as bananas with peanut butter or applesauce. \n\nI read that emetophobia is a common cause of ARFID. If you have had any emetophobia-related ARFID patients who improved or recovered, what helped them?",
          "created_utc": 1650391193.0
        },
        {
          "id": "i5i2yvw",
          "author": "Telphsm4sh",
          "body": "Replying because I also want to see an answer to their perspective on patients with emetophobia. I also have it.",
          "created_utc": 1650473473.0
        }
      ]
    },
    {
      "id": "i5964y5",
      "author": "odythecat",
      "body": "Thanks, appreciate the response",
      "created_utc": 1650314204.0,
      "score": 4,
      "context": [
        {
          "id": "i58ovuh",
          "author": "odythecat",
          "body": "I have a family member with celiac disease and ARFID, so her list of safe foods is influenced by both her ED and by gluten content. She’s also vegetarian (by choice-we offer opportunities to try different meats, but not interested). I’ve often wondered if the ARFID grew out of the dietary restrictions she’s grown up with (diagnosed celiac at age 6). \n\nLately her list of safe foods has shrunk to just a handful of things - mostly corn tortillas, cholula, and candy. She hasn’t eaten a single lunch at school all year. We’re worried her ED is starting to include anorexia. She declined participation in our local ED program (which, to be fair, seemed to not understand ARFID at all) and has gone to a psychologist in past but is generally not open to talking about eating. \n\nAny thoughts? 14F.",
          "created_utc": 1650307220.0
        },
        {
          "id": "i58w3oh",
          "author": "EDRD621",
          "body": "Lack of sensory exposure to different foods at early age can bring about ARFID like restriction, I suspect it to be causal but there’s likely genetic predispositions as well.\n\nTo be very clear, ARFIDs defining characteristics contradict the characteristics of Anorexia. If Anorexia is suspected then you’ll have more success exploring that avenue. I’ve worked with clients who have Anorexia who do have sensory based aversions, and wouldn’t be surprised to see ARFID like behaviors grow into Anorexia like behaviors. The etiologies are very different though, so approach to treatment is different. \n\nIf there’s concern about body image it’s more Anorexic. Fear regarding treatment is usually Anorexia as well because to someone struggling with ARFID the idea of treatment usually promotes a feeling of relief rather than anxiety. \n\nA child with Anorexia should be forced to go into treatment. It’s too much of a slippery slope to allow those behaviors to continue. It’s sad…quite frankly there have been epidemic-like increases in Anorexia over the last 2 years.",
          "created_utc": 1650310169.0
        }
      ]
    },
    {
      "id": "i5d1kg7",
      "author": "lieunee",
      "body": "There is a genetic component 100%. Absolutely true also that there are parents who do not foster great relationships with food. That said, I’ve never read anything that supports your claim. Parents are ALWAYS blamed for our kids’ “picky eating” so if there’s a study pointing to parental behavior and ARFID I would be interested to read it. \n\nDefinitely true about super tasters. My son and I both are. By age 6 he could identify the individual ingredients in a baked good down to differentiating between dark and light brown sugar, salted and unsalted butter, vanilla and imitation vanilla, etc. 🤷🏼‍♀️",
      "created_utc": 1650386145.0,
      "score": 3,
      "context": [
        {
          "id": "i5beckn",
          "author": "lieunee",
          "body": "“I'm under the impression that ARFID is often caused (at least in part) by lack of sensory exposure to foods at a young age. Why would this be the case? Well...a few different reasons. You simply might not have had exposure, and parents never made an effort for whatever reason.”\n\nAs a parent of a kid with ARFID I hear stuff like this a lot but, I feel like families with multiple kids don’t often have more than one with ARFID so, I’m alway intrigued by this explanation. (I was the one with ARFID growing up, my sister was and is and adventurous eater. My son has ARFID, his sister will eat anything. In both cases the same varied diet was available.)",
          "created_utc": 1650354616.0
        },
        {
          "id": "i5cbpwg",
          "author": "EDRD621",
          "body": "There's also a genetic component too! Many of my clients have the 'supertaster' gene which impacts how taste is perceived, but there are probably many more individual predispositions.",
          "created_utc": 1650376022.0
        }
      ]
    },
    {
      "id": "i5ccaud",
      "author": "EDRD621",
      "body": "Young children are really difficult. It's roughly the same process, but without the capacity to understand the work it is very slow. \n\n&#x200B;\n\nThe best thing parents can do is try to create positive food experiences, minimize general stress/anxiety at meals, and continue efforts to help with food exposures at home. Create variety at meals for preferred foods - cut foods differently each time, use different plates and silverware, use different brands of food. Try to make all preferred foods consistently inconsistent.",
      "created_utc": 1650376265.0,
      "score": 1,
      "context": [
        {
          "id": "i5beckn",
          "author": "lieunee",
          "body": "“I'm under the impression that ARFID is often caused (at least in part) by lack of sensory exposure to foods at a young age. Why would this be the case? Well...a few different reasons. You simply might not have had exposure, and parents never made an effort for whatever reason.”\n\nAs a parent of a kid with ARFID I hear stuff like this a lot but, I feel like families with multiple kids don’t often have more than one with ARFID so, I’m alway intrigued by this explanation. (I was the one with ARFID growing up, my sister was and is and adventurous eater. My son has ARFID, his sister will eat anything. In both cases the same varied diet was available.)",
          "created_utc": 1650354616.0
        },
        {
          "id": "i5beoeq",
          "author": "lieunee",
          "body": "Oh, but my question I guess is do you have recommendations for parents of kids with ARFID? Your approach to treatment seems sound for adults who wish to make changes. My kid is currently in treatment (for 2 years now) BUT his heart isn’t in it so, progress is S L O W.\n\nETA: Not trying to suggest he isn’t trying, he really is! The maturity level for an undertaking of this magnitude however, I feel like he’s just not there yet.",
          "created_utc": 1650354901.0
        }
      ]
    },
    {
      "id": "i5ag4mv",
      "author": "saintceciliax",
      "body": "Exactly what I was afraid you’d say, yikes. Some (many) of us are happy the way we are just so you know.",
      "created_utc": 1650334345.0,
      "score": 4,
      "context": [
        {
          "id": "i59xk4p",
          "author": "saintceciliax",
          "body": "Since it’s your job, do you believe everyone with ARFID should/has to “recover”?",
          "created_utc": 1650326302.0
        },
        {
          "id": "i5ac1zj",
          "author": "EDRD621",
          "body": "Has to recover? I wouldn’t say HAS to, but they should work on this in my opinion. Ultimately we are free to do whatever we would like…when we are 18 at least.",
          "created_utc": 1650332570.0
        }
      ]
    },
    {
      "id": "i59367l",
      "author": "Engatar",
      "body": "Thank you, ill begin to look into telehealth",
      "created_utc": 1650313006.0,
      "score": 1,
      "context": [
        {
          "id": "i5922un",
          "author": "Engatar",
          "body": "I have tried looking in my area for help with AFRID but only found one location with horrible reviews which makes me anxious. What would you suggest for those of us not near treatment locations? Is there an online option for treatment with AFRID? Thank you for taking the time to anwer questions.",
          "created_utc": 1650312560.0
        },
        {
          "id": "i592j4k",
          "author": "EDRD621",
          "body": "Luckily telehealth is a thing now. This is something that my business has be utilizing heavily, and offers invaluable flexibility and convenience for the patient. This work doesn’t require you to be in person!",
          "created_utc": 1650312744.0
        }
      ]
    },
    {
      "id": "i590ws4",
      "author": "purplechunkymonkey",
      "body": "She is scared to try new foods. And will sometimes randomly decide a previous safe food is now off limits. Her anxiety gets her to the point of vomiting. I want to encourage healthy behaviors around food. My younger sister suffered from anorexia nervosa and bulimia. I myself have gastroparesis so am very limited in what I can eat. With her about to be a teenager it is worrisome. \n\nThank you for the response.",
      "created_utc": 1650312085.0,
      "score": 1,
      "context": [
        {
          "id": "i58sl5z",
          "author": "purplechunkymonkey",
          "body": "I suspect my daughter might have ARFID. Her pediatrician calls her a difficult feeder. She will eat chicken but only seasoned with salt, pepper, and garlic. Same with pork and beef and salmon. The other protein she eats is the occasional cocktail shrimp no sauce. For fruit she eats watermelon, grapes, specific types of apples, and mandarin oranges. The only cooked vegetable she will eat is green beans. She eats all colors of bell peppers, cucumbers, celery, baby spinach, and lettuce but it has to be shredded. She is fine with most starches but will only eat potatoes in the form of fries from very specific places. The only sauce she will eat is alfredo. She will not touch anything that has tomatoes. So no ketchup, no pizza sauce, no spaghetti sauce. She can tell if I bought a new kind of pasta.\n\nShe has intense anxiety surrounding food. She needs to have control over what she eats. She has been like this since she was a toddler. At 12 she is better. We have a system worked out. If I am cooking something she doesn't like she is allowed to make her own dinner. She can cook and is quite the avid baker. If I am making pasta alfredo she gets pasta with alfredo sauce on top and whatever meat element on the side. For tacos she gets unseasoned ground beef, a tortilla,  a pile of cheese, a pile of shredded lettuce, and sometimes a pile of sour cream. These are all eaten separately. For spaghetti she gets plain noodles and usually adds parmesan. \n\nThis is just a general idea of her around food. Does this sound like ARFID to you?\n\nIs there anything else I can do to support her? We do buy whatever food she asks to try.",
          "created_utc": 1650308712.0
        },
        {
          "id": "i58zzod",
          "author": "EDRD621",
          "body": "Maybe…\n\nOff that description it seems like she eats a fairly diverse set of foods. It can be difficult for parents to discern because kids naturally are working through a lot of the processes involved with acquiring tastes for foods. I’d say if severe anxiety is present, and is a limiting factor to eating in certain situations then it could definitely be ARFID. \n\nIt almost sounds like the control aspect she displays around food could be more of the “problem” rather than something sensory or rooted in fear. Of course, take that with a grain of salt because these issues are often complicated and dynamic",
          "created_utc": 1650311711.0
        }
      ]
    },
    {
      "id": "idgwa6o",
      "author": "lexielesko",
      "body": "Thank you so much, you have no clue how much I appreciate this!! ♥️",
      "created_utc": 1656012818.0,
      "score": 2,
      "context": [
        {
          "id": "iaio5on",
          "author": "lexielesko",
          "body": "I believe I have ARFID and Aerophagia. It makes it really difficult to eat constantly, I’m probably 70-80 pounds currently but desperately want to gain more and I’m not sure what protein products to go to or start with because I am broke, and I just puked because I’ve been burping all day long since I woke up and it’s almost time for me to go to sleep. I’m not sure what to do because no doctor around me knows what either are or would help me with either. Any advice at all would be greatly appreciated! I seriously have trouble some days swallowing way too much air and making sure to eat enough every day.",
          "created_utc": 1653893069.0
        },
        {
          "id": "idgrbkk",
          "author": "EDRD621",
          "body": "Sorry to hear that - look up dietitians around you (in your state is good enough with telehealth) with experience in eating disorders. HealthProfs is a site where you can search for this :). These types of issues require support from someone, even if they aren’t the most experienced with these specific issues they can be helpful for moving forward.",
          "created_utc": 1656010778.0
        }
      ]
    },
    {
      "id": "i5byiro",
      "author": "knappellis",
      "body": "You are welcome! I am hopeful for you. I believe this is very very difficult, but you are trying your best. You are asking good questions. Some days are better than others. I'm hoping you have more and more good days and that you get what you need to feel nourished.",
      "created_utc": 1650369696.0,
      "score": 1,
      "context": [
        {
          "id": "i59crvm",
          "author": "deandratb",
          "body": "Have you treated anyone who finds all food disgusting? If so, how did you approach their treatment?\n\nI'm 37F and have presented ARFID symptoms since I was 3, but only learned of it two years ago. Also autistic w/anxiety, but while I know those are factors...I just don't like or enjoy food. I have my safe foods which I survive on, but if I pay too much attention to their taste and texture, then even they disgust me. \n\nThe only treatment help I've been able to access so far is a dietician without ARFID experience, and her first step was requiring me to eat at regular intervals and eat without distractions. \n\nReading while I eat has been my coping mechanism since childhood, and focusing on my food now makes me so grossed out that I'd rather starve. I had to pause treatment for unrelated reasons and am not sure how to approach that when I begin again.\n\nDo you recommend mindful eating to your ARFID clients? If so, how do you coach them through it? I've been poor my whole life, so I have a lot of experience going hungry--and when I pay attention to what I eat and that causes me to gag and choke on the food, I'd much rather just stop trying to eat at all.\n\nThank you so much for doing this! My healthcare system doesn't seem to know what ARFID even is, and denied that I need help.",
          "created_utc": 1650316997.0
        },
        {
          "id": "i5a90dq",
          "author": "knappellis",
          "body": "My kiddo is currently in treatment for ARFID. Our dietician recommended that we let our kid have their phone or any distraction they want while they eat. The point is to nourish your body so you can live. I think people who put \"mindfulness\" on a pedestal need to take a seat. It is not the be all and end all of life, and it is a trendy buzzword sometimes. I hope you get all you need to address your situation, and that the actual dietician gives their informed opinion here as well.",
          "created_utc": 1650331239.0
        },
        {
          "id": "i5asabu",
          "author": "deandratb",
          "body": "Thank you for this. When I get back in touch with my dietician, I do plan to ask her what the reasoning is behind the mindfulness suggestion. After struggling to get any help at all, I was so grateful for her kind competence that I didn't ask further questions--but I have no idea how mindfulness is supposed to be helpful for me, given my specific issues. I hope to get a reply here as well.",
          "created_utc": 1650339934.0
        }
      ]
    },
    {
      "id": "i5b036i",
      "author": "EDRD621",
      "body": "Imagine you got a laceration and the treatment was to place a tourniquet, and that's it. Sure it's better than bleeding, but it's not going to solve the problem. \n\nSame thing with this. It's management behavior and will keep you more nutritionally sound than before, probably,  but you'll still be struggling with ARFID. It's best to use both a tourniquet to lessen the bleeding AND stitches to fix the bleeding at its source.",
      "created_utc": 1650344191.0,
      "score": 13,
      "context": [
        {
          "id": "i59378v",
          "author": "Telphsm4sh",
          "body": "I wanna try going on a meal replacement drink, like maybe Soylent, for a more healthy diet. But my family is saying that it's not a healthy mindset because its a cop out, it causes even more \"abnormal\" eating habits, and doesn't solve the actual problem of not eating food in public places. They say that it might end up narrowing my food choices, and that eventually I would just be on that drink. But me, I'm thinking I need to live with a healthy diet before I get anemia and/or diabetes at a young age, and if this can solve it, then that's a success, Feeling comfortable in social settings by expanding my safe foods is an optional/secondary goal. Am I having a bad mindset here? Is your end goal with patients completely \"normal\" eating habits? Or is it like this sort of damage control with meal replacement drinks and supplements?",
          "created_utc": 1650313017.0
        },
        {
          "id": "i59a7hu",
          "author": "EDRD621",
          "body": "You strike me as very wise! Considering that one doesn't always have a perfect mindset or perspective of a topic is an important skill in life.    \n\n\nYour logic makes sense, you'd like to ensure that you're nutritionally sound. I think that's great. But the logic is rooted in the thought that you will always be a little 'stuck in your ways' when it comes to eating. So you're looking for alternatives to 'make due', to some extent. Clients that I've worked with improve significantly - a full recovery is possible. Of course, one's perspective on foods will always be considering past experiences so it's not like they just 'forgot' about dealing with ARFID. \n\n&#x200B;\n\nI dislike the idea of replacing meals with a drink. It's what I'd call an avoidance behavior, or a management behavior in certain cases. If you're REALLY struggling, a meal replacement will be preferable to not eating. But even attempting a meal is progress. During the recovery from something like ARFID, you will be physically changing the contents of your mind as you work through some of this anxiety. It's very difficult to imagine a state of recovery, so sometimes I suggest not getting tripped up in this. Trust the process. Set small realistic goals that provide a little bit of a challenge. Ideally, you want to go into food situations/trials pretty confident that you'll be able to complete whatever the task is. For example, if eating in social situations is very difficult - try specific challenges where you eat in front of close friends/family/ or as suggested above even in front of pets/animals! Every time you engage with food, and create a positive experience, the brain starts learning that the anxiety response is unnecessary. Over time, the anxiety response disappears - but it does take continued effort and persistence. People do often get stuck in avoiding the situations that make them feel uncomfortable, but that only perpetuates the problem. The brain then starts learning 'well I deal with this problem by avoiding it', and this isn't a realistic or healthy solution. You need the brain to recognize that whatever aversion it has picked up, is irrational.",
          "created_utc": 1650315846.0
        },
        {
          "id": "i5al2se",
          "author": "seddit_rucks",
          "body": "> I dislike the idea of replacing meals with a drink. It's what I'd call an avoidance behavior, or a management behavior in certain cases.\n\nSo what.  That's not justification.  Meal replacements drinks are...meal replacements.  Meaning meals.\n\nIf people with ARFID are getting their nutrition through a drink, that's surely a major improvement over saltines and chicken nuggets, no?",
          "created_utc": 1650336530.0
        }
      ]
    },
    {
      "id": "i5az58w",
      "author": "hiphoplarry27",
      "body": "I think what it means is that you should think of the drinks as a helper instead of a replacement. If cracker and chicken is the only thing that's working so far you wouldn't wanna replace it just add to it",
      "created_utc": 1650343633.0,
      "score": 8,
      "context": [
        {
          "id": "i59378v",
          "author": "Telphsm4sh",
          "body": "I wanna try going on a meal replacement drink, like maybe Soylent, for a more healthy diet. But my family is saying that it's not a healthy mindset because its a cop out, it causes even more \"abnormal\" eating habits, and doesn't solve the actual problem of not eating food in public places. They say that it might end up narrowing my food choices, and that eventually I would just be on that drink. But me, I'm thinking I need to live with a healthy diet before I get anemia and/or diabetes at a young age, and if this can solve it, then that's a success, Feeling comfortable in social settings by expanding my safe foods is an optional/secondary goal. Am I having a bad mindset here? Is your end goal with patients completely \"normal\" eating habits? Or is it like this sort of damage control with meal replacement drinks and supplements?",
          "created_utc": 1650313017.0
        },
        {
          "id": "i59a7hu",
          "author": "EDRD621",
          "body": "You strike me as very wise! Considering that one doesn't always have a perfect mindset or perspective of a topic is an important skill in life.    \n\n\nYour logic makes sense, you'd like to ensure that you're nutritionally sound. I think that's great. But the logic is rooted in the thought that you will always be a little 'stuck in your ways' when it comes to eating. So you're looking for alternatives to 'make due', to some extent. Clients that I've worked with improve significantly - a full recovery is possible. Of course, one's perspective on foods will always be considering past experiences so it's not like they just 'forgot' about dealing with ARFID. \n\n&#x200B;\n\nI dislike the idea of replacing meals with a drink. It's what I'd call an avoidance behavior, or a management behavior in certain cases. If you're REALLY struggling, a meal replacement will be preferable to not eating. But even attempting a meal is progress. During the recovery from something like ARFID, you will be physically changing the contents of your mind as you work through some of this anxiety. It's very difficult to imagine a state of recovery, so sometimes I suggest not getting tripped up in this. Trust the process. Set small realistic goals that provide a little bit of a challenge. Ideally, you want to go into food situations/trials pretty confident that you'll be able to complete whatever the task is. For example, if eating in social situations is very difficult - try specific challenges where you eat in front of close friends/family/ or as suggested above even in front of pets/animals! Every time you engage with food, and create a positive experience, the brain starts learning that the anxiety response is unnecessary. Over time, the anxiety response disappears - but it does take continued effort and persistence. People do often get stuck in avoiding the situations that make them feel uncomfortable, but that only perpetuates the problem. The brain then starts learning 'well I deal with this problem by avoiding it', and this isn't a realistic or healthy solution. You need the brain to recognize that whatever aversion it has picked up, is irrational.",
          "created_utc": 1650315846.0
        },
        {
          "id": "i5al2se",
          "author": "seddit_rucks",
          "body": "> I dislike the idea of replacing meals with a drink. It's what I'd call an avoidance behavior, or a management behavior in certain cases.\n\nSo what.  That's not justification.  Meal replacements drinks are...meal replacements.  Meaning meals.\n\nIf people with ARFID are getting their nutrition through a drink, that's surely a major improvement over saltines and chicken nuggets, no?",
          "created_utc": 1650336530.0
        }
      ]
    },
    {
      "id": "i5cgi6w",
      "author": "EDRD621",
      "body": "I'd say clinicians working specifically with eating disorders should have at least been exposed to ARFID. It's not an exactly 'niche' eating disorder these days. Search specifically for eating disorder focused, not 'I treat everything'. The 'I do it all' mentality of some clinicians is something I'd personally avoid. \n\nMake sure they are ED focused, visit their website if they have one, feel free to email them and ask if they treat ARFID. Healthcare is really strange, and I can't imagine trying to navigate it when not being in healthcare myself. Think of it as if you were buying a car and wanted a dealer who made you feel comfortable. Healthcare is a business in the US, shop around.",
      "created_utc": 1650378006.0,
      "score": 3,
      "context": [
        {
          "id": "i5935c3",
          "author": "museum-mama",
          "body": "How do I go about finding a therapist that takes my insurance (for my daughter that is amenable to treatment)?  Her GP agreed that she needs treatment and then gave us a list of therapists, none of which take our insurance.  I want her to have help but $150/session is a financial burden. And no, we don't qualify for aide of any kind.",
          "created_utc": 1650312996.0
        },
        {
          "id": "i594j9x",
          "author": "EDRD621",
          "body": "The age old question of trying to find a therapist! Unfortunately given the rise of anxiety and depression over the last few years, the task is quite difficult. I’d recommend looking on a site like healthprofs or psychology today and filter searches to those who take your insurance. You’ll probably need to sign up on a waitlist but it’s better than nothing. Don’t be afraid to look for those doing telehealth, it’s a great option and this expands the search to anyone who is licensed in that state.",
          "created_utc": 1650313553.0
        },
        {
          "id": "i598v4c",
          "author": "museum-mama",
          "body": "thanks - I am aware of those sites but there is no way to filter out people who don't have experience with ARFID.  I really don't want my child to experience the trauma of another health professional that just tells her to eat her vegetables.  We've had enough of that.  I was hoping you would know how to find ARFID-aware specialists because they are few and far between.",
          "created_utc": 1650315304.0
        }
      ]
    },
    {
      "id": "i5dm3g7",
      "author": "EDRD621",
      "body": "Which claim are you referencing? That there can be a nurture element in the development of ARFID? I'm not blaming parents, a kid might not have had sensory exposure because of a genetic component early on that resulted in heavy resistance to trying particular foods from the start. But there does seem to be a correlation with lack of sensory exposure early on and ARFID. For example, 'Higher rates of feeding problems are seen in children whose mothers suffer from an eating disorder' (DSM-V, American Psychological Association, 2014)",
      "created_utc": 1650393856.0,
      "score": 1,
      "context": [
        {
          "id": "i5beckn",
          "author": "lieunee",
          "body": "“I'm under the impression that ARFID is often caused (at least in part) by lack of sensory exposure to foods at a young age. Why would this be the case? Well...a few different reasons. You simply might not have had exposure, and parents never made an effort for whatever reason.”\n\nAs a parent of a kid with ARFID I hear stuff like this a lot but, I feel like families with multiple kids don’t often have more than one with ARFID so, I’m alway intrigued by this explanation. (I was the one with ARFID growing up, my sister was and is and adventurous eater. My son has ARFID, his sister will eat anything. In both cases the same varied diet was available.)",
          "created_utc": 1650354616.0
        },
        {
          "id": "i5cbpwg",
          "author": "EDRD621",
          "body": "There's also a genetic component too! Many of my clients have the 'supertaster' gene which impacts how taste is perceived, but there are probably many more individual predispositions.",
          "created_utc": 1650376022.0
        },
        {
          "id": "i5d1kg7",
          "author": "lieunee",
          "body": "There is a genetic component 100%. Absolutely true also that there are parents who do not foster great relationships with food. That said, I’ve never read anything that supports your claim. Parents are ALWAYS blamed for our kids’ “picky eating” so if there’s a study pointing to parental behavior and ARFID I would be interested to read it. \n\nDefinitely true about super tasters. My son and I both are. By age 6 he could identify the individual ingredients in a baked good down to differentiating between dark and light brown sugar, salted and unsalted butter, vanilla and imitation vanilla, etc. 🤷🏼‍♀️",
          "created_utc": 1650386145.0
        }
      ]
    },
    {
      "id": "i5d20xd",
      "author": "lieunee",
      "body": "Thanks for your reply. This is similar to the approach we took during his first year of therapy. I have a high degree of confidence these strategies work for some kids. I think it’s good advice, generally speaking. Certainly a good place to start.",
      "created_utc": 1650386322.0,
      "score": 1,
      "context": [
        {
          "id": "i5beckn",
          "author": "lieunee",
          "body": "“I'm under the impression that ARFID is often caused (at least in part) by lack of sensory exposure to foods at a young age. Why would this be the case? Well...a few different reasons. You simply might not have had exposure, and parents never made an effort for whatever reason.”\n\nAs a parent of a kid with ARFID I hear stuff like this a lot but, I feel like families with multiple kids don’t often have more than one with ARFID so, I’m alway intrigued by this explanation. (I was the one with ARFID growing up, my sister was and is and adventurous eater. My son has ARFID, his sister will eat anything. In both cases the same varied diet was available.)",
          "created_utc": 1650354616.0
        },
        {
          "id": "i5beoeq",
          "author": "lieunee",
          "body": "Oh, but my question I guess is do you have recommendations for parents of kids with ARFID? Your approach to treatment seems sound for adults who wish to make changes. My kid is currently in treatment (for 2 years now) BUT his heart isn’t in it so, progress is S L O W.\n\nETA: Not trying to suggest he isn’t trying, he really is! The maturity level for an undertaking of this magnitude however, I feel like he’s just not there yet.",
          "created_utc": 1650354901.0
        },
        {
          "id": "i5ccaud",
          "author": "EDRD621",
          "body": "Young children are really difficult. It's roughly the same process, but without the capacity to understand the work it is very slow. \n\n&#x200B;\n\nThe best thing parents can do is try to create positive food experiences, minimize general stress/anxiety at meals, and continue efforts to help with food exposures at home. Create variety at meals for preferred foods - cut foods differently each time, use different plates and silverware, use different brands of food. Try to make all preferred foods consistently inconsistent.",
          "created_utc": 1650376265.0
        }
      ]
    },
    {
      "id": "i5b1chc",
      "author": "EDRD621",
      "body": "Why would you be afraid of this? I said one can decide on what they want, if they are 18 :)\n\nMany struggling with ARFID are actually very hopeful at the idea of treatment. It's a defining characteristic of this disorder.",
      "created_utc": 1650344961.0,
      "score": 2,
      "context": [
        {
          "id": "i59xk4p",
          "author": "saintceciliax",
          "body": "Since it’s your job, do you believe everyone with ARFID should/has to “recover”?",
          "created_utc": 1650326302.0
        },
        {
          "id": "i5ac1zj",
          "author": "EDRD621",
          "body": "Has to recover? I wouldn’t say HAS to, but they should work on this in my opinion. Ultimately we are free to do whatever we would like…when we are 18 at least.",
          "created_utc": 1650332570.0
        },
        {
          "id": "i5ag4mv",
          "author": "saintceciliax",
          "body": "Exactly what I was afraid you’d say, yikes. Some (many) of us are happy the way we are just so you know.",
          "created_utc": 1650334345.0
        }
      ]
    },
    {
      "id": "i594xia",
      "author": "EDRD621",
      "body": "I’d definitely have her receive an evaluation from a dietitian or therapist who works in ED treatment.  Eating disorders are slippery slopes…behaviors can evolve rapidly and can get increasingly difficult to treat",
      "created_utc": 1650313716.0,
      "score": 2,
      "context": [
        {
          "id": "i58sl5z",
          "author": "purplechunkymonkey",
          "body": "I suspect my daughter might have ARFID. Her pediatrician calls her a difficult feeder. She will eat chicken but only seasoned with salt, pepper, and garlic. Same with pork and beef and salmon. The other protein she eats is the occasional cocktail shrimp no sauce. For fruit she eats watermelon, grapes, specific types of apples, and mandarin oranges. The only cooked vegetable she will eat is green beans. She eats all colors of bell peppers, cucumbers, celery, baby spinach, and lettuce but it has to be shredded. She is fine with most starches but will only eat potatoes in the form of fries from very specific places. The only sauce she will eat is alfredo. She will not touch anything that has tomatoes. So no ketchup, no pizza sauce, no spaghetti sauce. She can tell if I bought a new kind of pasta.\n\nShe has intense anxiety surrounding food. She needs to have control over what she eats. She has been like this since she was a toddler. At 12 she is better. We have a system worked out. If I am cooking something she doesn't like she is allowed to make her own dinner. She can cook and is quite the avid baker. If I am making pasta alfredo she gets pasta with alfredo sauce on top and whatever meat element on the side. For tacos she gets unseasoned ground beef, a tortilla,  a pile of cheese, a pile of shredded lettuce, and sometimes a pile of sour cream. These are all eaten separately. For spaghetti she gets plain noodles and usually adds parmesan. \n\nThis is just a general idea of her around food. Does this sound like ARFID to you?\n\nIs there anything else I can do to support her? We do buy whatever food she asks to try.",
          "created_utc": 1650308712.0
        },
        {
          "id": "i58zzod",
          "author": "EDRD621",
          "body": "Maybe…\n\nOff that description it seems like she eats a fairly diverse set of foods. It can be difficult for parents to discern because kids naturally are working through a lot of the processes involved with acquiring tastes for foods. I’d say if severe anxiety is present, and is a limiting factor to eating in certain situations then it could definitely be ARFID. \n\nIt almost sounds like the control aspect she displays around food could be more of the “problem” rather than something sensory or rooted in fear. Of course, take that with a grain of salt because these issues are often complicated and dynamic",
          "created_utc": 1650311711.0
        },
        {
          "id": "i590ws4",
          "author": "purplechunkymonkey",
          "body": "She is scared to try new foods. And will sometimes randomly decide a previous safe food is now off limits. Her anxiety gets her to the point of vomiting. I want to encourage healthy behaviors around food. My younger sister suffered from anorexia nervosa and bulimia. I myself have gastroparesis so am very limited in what I can eat. With her about to be a teenager it is worrisome. \n\nThank you for the response.",
          "created_utc": 1650312085.0
        }
      ]
    },
    {
      "id": "idgwl5q",
      "author": "EDRD621",
      "body": "Best of luck with your recovery - you are resilient :)",
      "created_utc": 1656012944.0,
      "score": 2,
      "context": [
        {
          "id": "iaio5on",
          "author": "lexielesko",
          "body": "I believe I have ARFID and Aerophagia. It makes it really difficult to eat constantly, I’m probably 70-80 pounds currently but desperately want to gain more and I’m not sure what protein products to go to or start with because I am broke, and I just puked because I’ve been burping all day long since I woke up and it’s almost time for me to go to sleep. I’m not sure what to do because no doctor around me knows what either are or would help me with either. Any advice at all would be greatly appreciated! I seriously have trouble some days swallowing way too much air and making sure to eat enough every day.",
          "created_utc": 1653893069.0
        },
        {
          "id": "idgrbkk",
          "author": "EDRD621",
          "body": "Sorry to hear that - look up dietitians around you (in your state is good enough with telehealth) with experience in eating disorders. HealthProfs is a site where you can search for this :). These types of issues require support from someone, even if they aren’t the most experienced with these specific issues they can be helpful for moving forward.",
          "created_utc": 1656010778.0
        },
        {
          "id": "idgwa6o",
          "author": "lexielesko",
          "body": "Thank you so much, you have no clue how much I appreciate this!! ♥️",
          "created_utc": 1656012818.0
        }
      ]
    },
    {
      "id": "i5bcgtq",
      "author": "Gmzorz",
      "body": "So putting ARFID as a disorder that needs getting rid off to the side… Can you make do with supplements and replacements? I’m starting to just live with it and finally feeling confident about what i (can) eat. \n\nTo sum it up, are there downsides or things missing with supplements like shakes?",
      "created_utc": 1650353048.0,
      "score": 3,
      "context": [
        {
          "id": "i59378v",
          "author": "Telphsm4sh",
          "body": "I wanna try going on a meal replacement drink, like maybe Soylent, for a more healthy diet. But my family is saying that it's not a healthy mindset because its a cop out, it causes even more \"abnormal\" eating habits, and doesn't solve the actual problem of not eating food in public places. They say that it might end up narrowing my food choices, and that eventually I would just be on that drink. But me, I'm thinking I need to live with a healthy diet before I get anemia and/or diabetes at a young age, and if this can solve it, then that's a success, Feeling comfortable in social settings by expanding my safe foods is an optional/secondary goal. Am I having a bad mindset here? Is your end goal with patients completely \"normal\" eating habits? Or is it like this sort of damage control with meal replacement drinks and supplements?",
          "created_utc": 1650313017.0
        },
        {
          "id": "i59a7hu",
          "author": "EDRD621",
          "body": "You strike me as very wise! Considering that one doesn't always have a perfect mindset or perspective of a topic is an important skill in life.    \n\n\nYour logic makes sense, you'd like to ensure that you're nutritionally sound. I think that's great. But the logic is rooted in the thought that you will always be a little 'stuck in your ways' when it comes to eating. So you're looking for alternatives to 'make due', to some extent. Clients that I've worked with improve significantly - a full recovery is possible. Of course, one's perspective on foods will always be considering past experiences so it's not like they just 'forgot' about dealing with ARFID. \n\n&#x200B;\n\nI dislike the idea of replacing meals with a drink. It's what I'd call an avoidance behavior, or a management behavior in certain cases. If you're REALLY struggling, a meal replacement will be preferable to not eating. But even attempting a meal is progress. During the recovery from something like ARFID, you will be physically changing the contents of your mind as you work through some of this anxiety. It's very difficult to imagine a state of recovery, so sometimes I suggest not getting tripped up in this. Trust the process. Set small realistic goals that provide a little bit of a challenge. Ideally, you want to go into food situations/trials pretty confident that you'll be able to complete whatever the task is. For example, if eating in social situations is very difficult - try specific challenges where you eat in front of close friends/family/ or as suggested above even in front of pets/animals! Every time you engage with food, and create a positive experience, the brain starts learning that the anxiety response is unnecessary. Over time, the anxiety response disappears - but it does take continued effort and persistence. People do often get stuck in avoiding the situations that make them feel uncomfortable, but that only perpetuates the problem. The brain then starts learning 'well I deal with this problem by avoiding it', and this isn't a realistic or healthy solution. You need the brain to recognize that whatever aversion it has picked up, is irrational.",
          "created_utc": 1650315846.0
        },
        {
          "id": "i5al2se",
          "author": "seddit_rucks",
          "body": "> I dislike the idea of replacing meals with a drink. It's what I'd call an avoidance behavior, or a management behavior in certain cases.\n\nSo what.  That's not justification.  Meal replacements drinks are...meal replacements.  Meaning meals.\n\nIf people with ARFID are getting their nutrition through a drink, that's surely a major improvement over saltines and chicken nuggets, no?",
          "created_utc": 1650336530.0
        },
        {
          "id": "i5b036i",
          "author": "EDRD621",
          "body": "Imagine you got a laceration and the treatment was to place a tourniquet, and that's it. Sure it's better than bleeding, but it's not going to solve the problem. \n\nSame thing with this. It's management behavior and will keep you more nutritionally sound than before, probably,  but you'll still be struggling with ARFID. It's best to use both a tourniquet to lessen the bleeding AND stitches to fix the bleeding at its source.",
          "created_utc": 1650344191.0
        }
      ]
    },
    {
      "id": "i5ba19d",
      "author": "TheFakeAtoM",
      "body": "I agree with this, and the idea that meal replacements won't actually (necessarily) treat ARFID. However, I think they could be useful for replacing less healthy options, and, as you've suggested, simply adding calories to one's diet, if needed.",
      "created_utc": 1650351092.0,
      "score": 4,
      "context": [
        {
          "id": "i59378v",
          "author": "Telphsm4sh",
          "body": "I wanna try going on a meal replacement drink, like maybe Soylent, for a more healthy diet. But my family is saying that it's not a healthy mindset because its a cop out, it causes even more \"abnormal\" eating habits, and doesn't solve the actual problem of not eating food in public places. They say that it might end up narrowing my food choices, and that eventually I would just be on that drink. But me, I'm thinking I need to live with a healthy diet before I get anemia and/or diabetes at a young age, and if this can solve it, then that's a success, Feeling comfortable in social settings by expanding my safe foods is an optional/secondary goal. Am I having a bad mindset here? Is your end goal with patients completely \"normal\" eating habits? Or is it like this sort of damage control with meal replacement drinks and supplements?",
          "created_utc": 1650313017.0
        },
        {
          "id": "i59a7hu",
          "author": "EDRD621",
          "body": "You strike me as very wise! Considering that one doesn't always have a perfect mindset or perspective of a topic is an important skill in life.    \n\n\nYour logic makes sense, you'd like to ensure that you're nutritionally sound. I think that's great. But the logic is rooted in the thought that you will always be a little 'stuck in your ways' when it comes to eating. So you're looking for alternatives to 'make due', to some extent. Clients that I've worked with improve significantly - a full recovery is possible. Of course, one's perspective on foods will always be considering past experiences so it's not like they just 'forgot' about dealing with ARFID. \n\n&#x200B;\n\nI dislike the idea of replacing meals with a drink. It's what I'd call an avoidance behavior, or a management behavior in certain cases. If you're REALLY struggling, a meal replacement will be preferable to not eating. But even attempting a meal is progress. During the recovery from something like ARFID, you will be physically changing the contents of your mind as you work through some of this anxiety. It's very difficult to imagine a state of recovery, so sometimes I suggest not getting tripped up in this. Trust the process. Set small realistic goals that provide a little bit of a challenge. Ideally, you want to go into food situations/trials pretty confident that you'll be able to complete whatever the task is. For example, if eating in social situations is very difficult - try specific challenges where you eat in front of close friends/family/ or as suggested above even in front of pets/animals! Every time you engage with food, and create a positive experience, the brain starts learning that the anxiety response is unnecessary. Over time, the anxiety response disappears - but it does take continued effort and persistence. People do often get stuck in avoiding the situations that make them feel uncomfortable, but that only perpetuates the problem. The brain then starts learning 'well I deal with this problem by avoiding it', and this isn't a realistic or healthy solution. You need the brain to recognize that whatever aversion it has picked up, is irrational.",
          "created_utc": 1650315846.0
        },
        {
          "id": "i5al2se",
          "author": "seddit_rucks",
          "body": "> I dislike the idea of replacing meals with a drink. It's what I'd call an avoidance behavior, or a management behavior in certain cases.\n\nSo what.  That's not justification.  Meal replacements drinks are...meal replacements.  Meaning meals.\n\nIf people with ARFID are getting their nutrition through a drink, that's surely a major improvement over saltines and chicken nuggets, no?",
          "created_utc": 1650336530.0
        },
        {
          "id": "i5az58w",
          "author": "hiphoplarry27",
          "body": "I think what it means is that you should think of the drinks as a helper instead of a replacement. If cracker and chicken is the only thing that's working so far you wouldn't wanna replace it just add to it",
          "created_utc": 1650343633.0
        }
      ]
    },
    {
      "id": "i5dtcsf",
      "author": "lieunee",
      "body": "From a blaming parents perspective, I guess I was confused by the lack of sensory exposure and the fact that “parents may never have made an effort for whatever reason”. Perhaps I’m misunderstanding what sensory exposure is in this context. Additionally I’ve never seen this cited as a cause (or frequent contributing factor) of ARFID. I’m not saying you’re wrong, at all. I’m just fascinated that this is the first time I’m hearing it (and Google has been no help).",
      "created_utc": 1650396543.0,
      "score": 2,
      "context": [
        {
          "id": "i5beckn",
          "author": "lieunee",
          "body": "“I'm under the impression that ARFID is often caused (at least in part) by lack of sensory exposure to foods at a young age. Why would this be the case? Well...a few different reasons. You simply might not have had exposure, and parents never made an effort for whatever reason.”\n\nAs a parent of a kid with ARFID I hear stuff like this a lot but, I feel like families with multiple kids don’t often have more than one with ARFID so, I’m alway intrigued by this explanation. (I was the one with ARFID growing up, my sister was and is and adventurous eater. My son has ARFID, his sister will eat anything. In both cases the same varied diet was available.)",
          "created_utc": 1650354616.0
        },
        {
          "id": "i5cbpwg",
          "author": "EDRD621",
          "body": "There's also a genetic component too! Many of my clients have the 'supertaster' gene which impacts how taste is perceived, but there are probably many more individual predispositions.",
          "created_utc": 1650376022.0
        },
        {
          "id": "i5d1kg7",
          "author": "lieunee",
          "body": "There is a genetic component 100%. Absolutely true also that there are parents who do not foster great relationships with food. That said, I’ve never read anything that supports your claim. Parents are ALWAYS blamed for our kids’ “picky eating” so if there’s a study pointing to parental behavior and ARFID I would be interested to read it. \n\nDefinitely true about super tasters. My son and I both are. By age 6 he could identify the individual ingredients in a baked good down to differentiating between dark and light brown sugar, salted and unsalted butter, vanilla and imitation vanilla, etc. 🤷🏼‍♀️",
          "created_utc": 1650386145.0
        },
        {
          "id": "i5dm3g7",
          "author": "EDRD621",
          "body": "Which claim are you referencing? That there can be a nurture element in the development of ARFID? I'm not blaming parents, a kid might not have had sensory exposure because of a genetic component early on that resulted in heavy resistance to trying particular foods from the start. But there does seem to be a correlation with lack of sensory exposure early on and ARFID. For example, 'Higher rates of feeding problems are seen in children whose mothers suffer from an eating disorder' (DSM-V, American Psychological Association, 2014)",
          "created_utc": 1650393856.0
        }
      ]
    },
    {
      "id": "i5dtqh7",
      "author": "lieunee",
      "body": "Furthering the idea that I don’t fully understand the nature of sensory exposure, I’m unsure how that’s related to a family history of eating disorders.",
      "created_utc": 1650396685.0,
      "score": 2,
      "context": [
        {
          "id": "i5beckn",
          "author": "lieunee",
          "body": "“I'm under the impression that ARFID is often caused (at least in part) by lack of sensory exposure to foods at a young age. Why would this be the case? Well...a few different reasons. You simply might not have had exposure, and parents never made an effort for whatever reason.”\n\nAs a parent of a kid with ARFID I hear stuff like this a lot but, I feel like families with multiple kids don’t often have more than one with ARFID so, I’m alway intrigued by this explanation. (I was the one with ARFID growing up, my sister was and is and adventurous eater. My son has ARFID, his sister will eat anything. In both cases the same varied diet was available.)",
          "created_utc": 1650354616.0
        },
        {
          "id": "i5cbpwg",
          "author": "EDRD621",
          "body": "There's also a genetic component too! Many of my clients have the 'supertaster' gene which impacts how taste is perceived, but there are probably many more individual predispositions.",
          "created_utc": 1650376022.0
        },
        {
          "id": "i5d1kg7",
          "author": "lieunee",
          "body": "There is a genetic component 100%. Absolutely true also that there are parents who do not foster great relationships with food. That said, I’ve never read anything that supports your claim. Parents are ALWAYS blamed for our kids’ “picky eating” so if there’s a study pointing to parental behavior and ARFID I would be interested to read it. \n\nDefinitely true about super tasters. My son and I both are. By age 6 he could identify the individual ingredients in a baked good down to differentiating between dark and light brown sugar, salted and unsalted butter, vanilla and imitation vanilla, etc. 🤷🏼‍♀️",
          "created_utc": 1650386145.0
        },
        {
          "id": "i5dm3g7",
          "author": "EDRD621",
          "body": "Which claim are you referencing? That there can be a nurture element in the development of ARFID? I'm not blaming parents, a kid might not have had sensory exposure because of a genetic component early on that resulted in heavy resistance to trying particular foods from the start. But there does seem to be a correlation with lack of sensory exposure early on and ARFID. For example, 'Higher rates of feeding problems are seen in children whose mothers suffer from an eating disorder' (DSM-V, American Psychological Association, 2014)",
          "created_utc": 1650393856.0
        }
      ]
    },
    {
      "id": "i5chj04",
      "author": "TheFakeAtoM",
      "body": "I'm not a dietitian like u/EDRD621 but as someone who has done a lot of research into meal replacements I would say that you can definitely 'make do' with a nutritionally complete meal replacement like Soylent. Any product that is branded in that way will contain all the nutrients that are generally considered by expert organisations (e.g. the WHO or FAO) to be essential in the human diet, and will, on average, tend to be healthier than any other type of food or meal (although this may depend on the dietary context).\n\nHowever, if you are talking about living solely (100%) on meal replacements, there are important caveats that I should state here. The issues below mostly arise from the fact that meal replacements are typically based around a small (restricted) number of ingredients, and, in terms of the last one, that they are typically liquids.\n\nFirstly, it is possible that there are other nutrients which will in the future be discovered to be essential, or to improve / optimise human health, and they may not currently be included in one or many meal replacement products. Some phytonutrients are a possible example of this. There are definitely phytonutrients in essentially all meal replacements, from their plant-derived ingredients (e.g. oat flour), however there may not be as many as there are in whole foods. I would emphasise, however, that such nutrients are unlikely to be important, as many of them have already been researched in some detail. That's especially true for whether nutrients are essential. If there were more essential nutrients, we probably would've discovered that from the numerous people who actually have lived on meal replacements for months at a time. I would further note that the benefits from having an otherwise nutritionally complete diet are likely to outweigh any negatives caused from missing one or two beneficial but non-essential nutrients.\n\nAs a stronger criticism of the above, this caveat probably also applies to most modern diets, which are likely to be missing not only some beneficial nutrients, but to contain significantly insufficient quantities of some (or many) essential nutrients. You could, however, make a stronger case for a comparison to a whole foods diet which is, in fact, close to nutritionally complete, although it's my view that such diets are quite rare, even among the health-conscious.\n\nNonetheless it is entirely possible to supplement a particular non-essential nutrient or two if one has good reasons to be concerned about it, and there are meal replacement formulations out there that include such nutrients, e.g. Super Body Fuel. In the case of phytonutrients, it is not difficult to add tons of different ones using some sort of dried vegetable powder (e.g. 'Super Greens').\n\nA second caveat is probiotics, which actually seem quite important. Again, however, these are easy to add to one's diet, and some meal replacements, e.g. Huel, include them. Also again, they are not necessarily included in the average solid-food diet. Finally, chewing may be important, even for brain health. However, this issue can easily be eliminated by chewing gum, or using some solid-food meal replacements.\n\nAt the moment, I can't think of any other relevant issues, but I'll let you know if I do. I have thought about this topic quite a bit in the past.\n\nIn summary, a sceptical person may think it is safer, at our current level of knowledge, to not go on a 100% meal replacement diet, although some people have been successful with this. It also seems that the uncertainties surrounding such a diet are fairly minor, and may not even exceed the uncertainties we have about many other modern diets.\n\nApologies for the long post by the way - just wanted to make it comprehensive.",
      "created_utc": 1650378416.0,
      "score": 7,
      "context": [
        {
          "id": "i59378v",
          "author": "Telphsm4sh",
          "body": "I wanna try going on a meal replacement drink, like maybe Soylent, for a more healthy diet. But my family is saying that it's not a healthy mindset because its a cop out, it causes even more \"abnormal\" eating habits, and doesn't solve the actual problem of not eating food in public places. They say that it might end up narrowing my food choices, and that eventually I would just be on that drink. But me, I'm thinking I need to live with a healthy diet before I get anemia and/or diabetes at a young age, and if this can solve it, then that's a success, Feeling comfortable in social settings by expanding my safe foods is an optional/secondary goal. Am I having a bad mindset here? Is your end goal with patients completely \"normal\" eating habits? Or is it like this sort of damage control with meal replacement drinks and supplements?",
          "created_utc": 1650313017.0
        },
        {
          "id": "i59a7hu",
          "author": "EDRD621",
          "body": "You strike me as very wise! Considering that one doesn't always have a perfect mindset or perspective of a topic is an important skill in life.    \n\n\nYour logic makes sense, you'd like to ensure that you're nutritionally sound. I think that's great. But the logic is rooted in the thought that you will always be a little 'stuck in your ways' when it comes to eating. So you're looking for alternatives to 'make due', to some extent. Clients that I've worked with improve significantly - a full recovery is possible. Of course, one's perspective on foods will always be considering past experiences so it's not like they just 'forgot' about dealing with ARFID. \n\n&#x200B;\n\nI dislike the idea of replacing meals with a drink. It's what I'd call an avoidance behavior, or a management behavior in certain cases. If you're REALLY struggling, a meal replacement will be preferable to not eating. But even attempting a meal is progress. During the recovery from something like ARFID, you will be physically changing the contents of your mind as you work through some of this anxiety. It's very difficult to imagine a state of recovery, so sometimes I suggest not getting tripped up in this. Trust the process. Set small realistic goals that provide a little bit of a challenge. Ideally, you want to go into food situations/trials pretty confident that you'll be able to complete whatever the task is. For example, if eating in social situations is very difficult - try specific challenges where you eat in front of close friends/family/ or as suggested above even in front of pets/animals! Every time you engage with food, and create a positive experience, the brain starts learning that the anxiety response is unnecessary. Over time, the anxiety response disappears - but it does take continued effort and persistence. People do often get stuck in avoiding the situations that make them feel uncomfortable, but that only perpetuates the problem. The brain then starts learning 'well I deal with this problem by avoiding it', and this isn't a realistic or healthy solution. You need the brain to recognize that whatever aversion it has picked up, is irrational.",
          "created_utc": 1650315846.0
        },
        {
          "id": "i5al2se",
          "author": "seddit_rucks",
          "body": "> I dislike the idea of replacing meals with a drink. It's what I'd call an avoidance behavior, or a management behavior in certain cases.\n\nSo what.  That's not justification.  Meal replacements drinks are...meal replacements.  Meaning meals.\n\nIf people with ARFID are getting their nutrition through a drink, that's surely a major improvement over saltines and chicken nuggets, no?",
          "created_utc": 1650336530.0
        },
        {
          "id": "i5b036i",
          "author": "EDRD621",
          "body": "Imagine you got a laceration and the treatment was to place a tourniquet, and that's it. Sure it's better than bleeding, but it's not going to solve the problem. \n\nSame thing with this. It's management behavior and will keep you more nutritionally sound than before, probably,  but you'll still be struggling with ARFID. It's best to use both a tourniquet to lessen the bleeding AND stitches to fix the bleeding at its source.",
          "created_utc": 1650344191.0
        },
        {
          "id": "i5bcgtq",
          "author": "Gmzorz",
          "body": "So putting ARFID as a disorder that needs getting rid off to the side… Can you make do with supplements and replacements? I’m starting to just live with it and finally feeling confident about what i (can) eat. \n\nTo sum it up, are there downsides or things missing with supplements like shakes?",
          "created_utc": 1650353048.0
        }
      ]
    },
    {
      "id": "i5cfqf2",
      "author": "EDRD621",
      "body": "People do live off of tube feedings, which is essentially (and many cases the exact same thing) as certain supplement shakes. \n\n&#x200B;\n\nThe fact is there are real downsides. Lack of real fiber, lack of phytonutrients which prevent chronic diseases and inflammation, and abstinence from important social, cultural, spiritual, pleasurable aspects of food. The last may seem obvious for someone struggling with ARFID, but it's important for us to find peace with food. Accepting a poor food situation is just settling, and will always feel like a drag.\n\n&#x200B;\n\nAlso the obvious fact about foods on repeat, shakes or not, will eventually get fatigued. What happens when shakes make you gag or vomit?",
      "created_utc": 1650377693.0,
      "score": 1,
      "context": [
        {
          "id": "i59378v",
          "author": "Telphsm4sh",
          "body": "I wanna try going on a meal replacement drink, like maybe Soylent, for a more healthy diet. But my family is saying that it's not a healthy mindset because its a cop out, it causes even more \"abnormal\" eating habits, and doesn't solve the actual problem of not eating food in public places. They say that it might end up narrowing my food choices, and that eventually I would just be on that drink. But me, I'm thinking I need to live with a healthy diet before I get anemia and/or diabetes at a young age, and if this can solve it, then that's a success, Feeling comfortable in social settings by expanding my safe foods is an optional/secondary goal. Am I having a bad mindset here? Is your end goal with patients completely \"normal\" eating habits? Or is it like this sort of damage control with meal replacement drinks and supplements?",
          "created_utc": 1650313017.0
        },
        {
          "id": "i59a7hu",
          "author": "EDRD621",
          "body": "You strike me as very wise! Considering that one doesn't always have a perfect mindset or perspective of a topic is an important skill in life.    \n\n\nYour logic makes sense, you'd like to ensure that you're nutritionally sound. I think that's great. But the logic is rooted in the thought that you will always be a little 'stuck in your ways' when it comes to eating. So you're looking for alternatives to 'make due', to some extent. Clients that I've worked with improve significantly - a full recovery is possible. Of course, one's perspective on foods will always be considering past experiences so it's not like they just 'forgot' about dealing with ARFID. \n\n&#x200B;\n\nI dislike the idea of replacing meals with a drink. It's what I'd call an avoidance behavior, or a management behavior in certain cases. If you're REALLY struggling, a meal replacement will be preferable to not eating. But even attempting a meal is progress. During the recovery from something like ARFID, you will be physically changing the contents of your mind as you work through some of this anxiety. It's very difficult to imagine a state of recovery, so sometimes I suggest not getting tripped up in this. Trust the process. Set small realistic goals that provide a little bit of a challenge. Ideally, you want to go into food situations/trials pretty confident that you'll be able to complete whatever the task is. For example, if eating in social situations is very difficult - try specific challenges where you eat in front of close friends/family/ or as suggested above even in front of pets/animals! Every time you engage with food, and create a positive experience, the brain starts learning that the anxiety response is unnecessary. Over time, the anxiety response disappears - but it does take continued effort and persistence. People do often get stuck in avoiding the situations that make them feel uncomfortable, but that only perpetuates the problem. The brain then starts learning 'well I deal with this problem by avoiding it', and this isn't a realistic or healthy solution. You need the brain to recognize that whatever aversion it has picked up, is irrational.",
          "created_utc": 1650315846.0
        },
        {
          "id": "i5al2se",
          "author": "seddit_rucks",
          "body": "> I dislike the idea of replacing meals with a drink. It's what I'd call an avoidance behavior, or a management behavior in certain cases.\n\nSo what.  That's not justification.  Meal replacements drinks are...meal replacements.  Meaning meals.\n\nIf people with ARFID are getting their nutrition through a drink, that's surely a major improvement over saltines and chicken nuggets, no?",
          "created_utc": 1650336530.0
        },
        {
          "id": "i5b036i",
          "author": "EDRD621",
          "body": "Imagine you got a laceration and the treatment was to place a tourniquet, and that's it. Sure it's better than bleeding, but it's not going to solve the problem. \n\nSame thing with this. It's management behavior and will keep you more nutritionally sound than before, probably,  but you'll still be struggling with ARFID. It's best to use both a tourniquet to lessen the bleeding AND stitches to fix the bleeding at its source.",
          "created_utc": 1650344191.0
        },
        {
          "id": "i5bcgtq",
          "author": "Gmzorz",
          "body": "So putting ARFID as a disorder that needs getting rid off to the side… Can you make do with supplements and replacements? I’m starting to just live with it and finally feeling confident about what i (can) eat. \n\nTo sum it up, are there downsides or things missing with supplements like shakes?",
          "created_utc": 1650353048.0
        }
      ]
    },
    {
      "id": "i5clj3a",
      "author": "Gmzorz",
      "body": "I think i was really hoping to receive a reply like this, completely technical. Very helpful and definitely reassuring. Most of the foods i tolerate are pretty much all meats, fish, white rice, pasta, bread, apples and bananas being the only fruits so i believe my two shakes a day fit nicely in between (prescribed by a dietitian). It really is just vegetables i am lacking. Is there any good way for regular check-ups regarding nutrients? ive done blood tests which were fine.",
      "created_utc": 1650379986.0,
      "score": 3,
      "context": [
        {
          "id": "i59378v",
          "author": "Telphsm4sh",
          "body": "I wanna try going on a meal replacement drink, like maybe Soylent, for a more healthy diet. But my family is saying that it's not a healthy mindset because its a cop out, it causes even more \"abnormal\" eating habits, and doesn't solve the actual problem of not eating food in public places. They say that it might end up narrowing my food choices, and that eventually I would just be on that drink. But me, I'm thinking I need to live with a healthy diet before I get anemia and/or diabetes at a young age, and if this can solve it, then that's a success, Feeling comfortable in social settings by expanding my safe foods is an optional/secondary goal. Am I having a bad mindset here? Is your end goal with patients completely \"normal\" eating habits? Or is it like this sort of damage control with meal replacement drinks and supplements?",
          "created_utc": 1650313017.0
        },
        {
          "id": "i59a7hu",
          "author": "EDRD621",
          "body": "You strike me as very wise! Considering that one doesn't always have a perfect mindset or perspective of a topic is an important skill in life.    \n\n\nYour logic makes sense, you'd like to ensure that you're nutritionally sound. I think that's great. But the logic is rooted in the thought that you will always be a little 'stuck in your ways' when it comes to eating. So you're looking for alternatives to 'make due', to some extent. Clients that I've worked with improve significantly - a full recovery is possible. Of course, one's perspective on foods will always be considering past experiences so it's not like they just 'forgot' about dealing with ARFID. \n\n&#x200B;\n\nI dislike the idea of replacing meals with a drink. It's what I'd call an avoidance behavior, or a management behavior in certain cases. If you're REALLY struggling, a meal replacement will be preferable to not eating. But even attempting a meal is progress. During the recovery from something like ARFID, you will be physically changing the contents of your mind as you work through some of this anxiety. It's very difficult to imagine a state of recovery, so sometimes I suggest not getting tripped up in this. Trust the process. Set small realistic goals that provide a little bit of a challenge. Ideally, you want to go into food situations/trials pretty confident that you'll be able to complete whatever the task is. For example, if eating in social situations is very difficult - try specific challenges where you eat in front of close friends/family/ or as suggested above even in front of pets/animals! Every time you engage with food, and create a positive experience, the brain starts learning that the anxiety response is unnecessary. Over time, the anxiety response disappears - but it does take continued effort and persistence. People do often get stuck in avoiding the situations that make them feel uncomfortable, but that only perpetuates the problem. The brain then starts learning 'well I deal with this problem by avoiding it', and this isn't a realistic or healthy solution. You need the brain to recognize that whatever aversion it has picked up, is irrational.",
          "created_utc": 1650315846.0
        },
        {
          "id": "i5al2se",
          "author": "seddit_rucks",
          "body": "> I dislike the idea of replacing meals with a drink. It's what I'd call an avoidance behavior, or a management behavior in certain cases.\n\nSo what.  That's not justification.  Meal replacements drinks are...meal replacements.  Meaning meals.\n\nIf people with ARFID are getting their nutrition through a drink, that's surely a major improvement over saltines and chicken nuggets, no?",
          "created_utc": 1650336530.0
        },
        {
          "id": "i5b036i",
          "author": "EDRD621",
          "body": "Imagine you got a laceration and the treatment was to place a tourniquet, and that's it. Sure it's better than bleeding, but it's not going to solve the problem. \n\nSame thing with this. It's management behavior and will keep you more nutritionally sound than before, probably,  but you'll still be struggling with ARFID. It's best to use both a tourniquet to lessen the bleeding AND stitches to fix the bleeding at its source.",
          "created_utc": 1650344191.0
        },
        {
          "id": "i5bcgtq",
          "author": "Gmzorz",
          "body": "So putting ARFID as a disorder that needs getting rid off to the side… Can you make do with supplements and replacements? I’m starting to just live with it and finally feeling confident about what i (can) eat. \n\nTo sum it up, are there downsides or things missing with supplements like shakes?",
          "created_utc": 1650353048.0
        },
        {
          "id": "i5chj04",
          "author": "TheFakeAtoM",
          "body": "I'm not a dietitian like u/EDRD621 but as someone who has done a lot of research into meal replacements I would say that you can definitely 'make do' with a nutritionally complete meal replacement like Soylent. Any product that is branded in that way will contain all the nutrients that are generally considered by expert organisations (e.g. the WHO or FAO) to be essential in the human diet, and will, on average, tend to be healthier than any other type of food or meal (although this may depend on the dietary context).\n\nHowever, if you are talking about living solely (100%) on meal replacements, there are important caveats that I should state here. The issues below mostly arise from the fact that meal replacements are typically based around a small (restricted) number of ingredients, and, in terms of the last one, that they are typically liquids.\n\nFirstly, it is possible that there are other nutrients which will in the future be discovered to be essential, or to improve / optimise human health, and they may not currently be included in one or many meal replacement products. Some phytonutrients are a possible example of this. There are definitely phytonutrients in essentially all meal replacements, from their plant-derived ingredients (e.g. oat flour), however there may not be as many as there are in whole foods. I would emphasise, however, that such nutrients are unlikely to be important, as many of them have already been researched in some detail. That's especially true for whether nutrients are essential. If there were more essential nutrients, we probably would've discovered that from the numerous people who actually have lived on meal replacements for months at a time. I would further note that the benefits from having an otherwise nutritionally complete diet are likely to outweigh any negatives caused from missing one or two beneficial but non-essential nutrients.\n\nAs a stronger criticism of the above, this caveat probably also applies to most modern diets, which are likely to be missing not only some beneficial nutrients, but to contain significantly insufficient quantities of some (or many) essential nutrients. You could, however, make a stronger case for a comparison to a whole foods diet which is, in fact, close to nutritionally complete, although it's my view that such diets are quite rare, even among the health-conscious.\n\nNonetheless it is entirely possible to supplement a particular non-essential nutrient or two if one has good reasons to be concerned about it, and there are meal replacement formulations out there that include such nutrients, e.g. Super Body Fuel. In the case of phytonutrients, it is not difficult to add tons of different ones using some sort of dried vegetable powder (e.g. 'Super Greens').\n\nA second caveat is probiotics, which actually seem quite important. Again, however, these are easy to add to one's diet, and some meal replacements, e.g. Huel, include them. Also again, they are not necessarily included in the average solid-food diet. Finally, chewing may be important, even for brain health. However, this issue can easily be eliminated by chewing gum, or using some solid-food meal replacements.\n\nAt the moment, I can't think of any other relevant issues, but I'll let you know if I do. I have thought about this topic quite a bit in the past.\n\nIn summary, a sceptical person may think it is safer, at our current level of knowledge, to not go on a 100% meal replacement diet, although some people have been successful with this. It also seems that the uncertainties surrounding such a diet are fairly minor, and may not even exceed the uncertainties we have about many other modern diets.\n\nApologies for the long post by the way - just wanted to make it comprehensive.",
          "created_utc": 1650378416.0
        }
      ]
    },
    {
      "id": "i5cn4s4",
      "author": "TheFakeAtoM",
      "body": "> many cases the exact same thing\n\nI'm not sure that I agree that tube feedings are, \"in many cases\", the same thing as modern meal replacements (which is what is being discussed here), although I would have to look into it more. Are products like Soylent used for feeding tubes?\n\n> Lack of real fiber\n\nAll modern meal replacements contain 'real fiber', i.e. sufficient quantities of soluble and insoluble fiber (an example of the latter is oat fiber).\n\n> lack of phytonutrients\n\nSee my other reply for more about this. It's my understanding that there is no conclusive evidence that they have beneficial health effects, as stated [here](https://lpi.oregonstate.edu/mic/dietary-factors/phytochemicals) by the LPI, and in the various subpages (excluding fiber). Nonetheless, if one believes there are important ones which are not present in meal replacements, they can easily be added, and have been in some products.\n\n> abstinence from important social, cultural, spiritual, pleasurable aspects of food.\n\nI would note here that there is such a thing as solid-food meal replacements (which I think is a great idea), e.g. noodles and burgers, and more are being developed.\n\n> will eventually get fatigued.\n\nFair point, although I don't think it applies to everyone. There are people in the meal replacement community who seem to have no such issues with \"foods on repeat\". And I would repeat my point about solid-food versions (and other versions such as soups).\n\nNote: all of what I'm writing here is with the previous premise of 'putting ARFID to the side'.",
      "created_utc": 1650380617.0,
      "score": 3,
      "context": [
        {
          "id": "i59378v",
          "author": "Telphsm4sh",
          "body": "I wanna try going on a meal replacement drink, like maybe Soylent, for a more healthy diet. But my family is saying that it's not a healthy mindset because its a cop out, it causes even more \"abnormal\" eating habits, and doesn't solve the actual problem of not eating food in public places. They say that it might end up narrowing my food choices, and that eventually I would just be on that drink. But me, I'm thinking I need to live with a healthy diet before I get anemia and/or diabetes at a young age, and if this can solve it, then that's a success, Feeling comfortable in social settings by expanding my safe foods is an optional/secondary goal. Am I having a bad mindset here? Is your end goal with patients completely \"normal\" eating habits? Or is it like this sort of damage control with meal replacement drinks and supplements?",
          "created_utc": 1650313017.0
        },
        {
          "id": "i59a7hu",
          "author": "EDRD621",
          "body": "You strike me as very wise! Considering that one doesn't always have a perfect mindset or perspective of a topic is an important skill in life.    \n\n\nYour logic makes sense, you'd like to ensure that you're nutritionally sound. I think that's great. But the logic is rooted in the thought that you will always be a little 'stuck in your ways' when it comes to eating. So you're looking for alternatives to 'make due', to some extent. Clients that I've worked with improve significantly - a full recovery is possible. Of course, one's perspective on foods will always be considering past experiences so it's not like they just 'forgot' about dealing with ARFID. \n\n&#x200B;\n\nI dislike the idea of replacing meals with a drink. It's what I'd call an avoidance behavior, or a management behavior in certain cases. If you're REALLY struggling, a meal replacement will be preferable to not eating. But even attempting a meal is progress. During the recovery from something like ARFID, you will be physically changing the contents of your mind as you work through some of this anxiety. It's very difficult to imagine a state of recovery, so sometimes I suggest not getting tripped up in this. Trust the process. Set small realistic goals that provide a little bit of a challenge. Ideally, you want to go into food situations/trials pretty confident that you'll be able to complete whatever the task is. For example, if eating in social situations is very difficult - try specific challenges where you eat in front of close friends/family/ or as suggested above even in front of pets/animals! Every time you engage with food, and create a positive experience, the brain starts learning that the anxiety response is unnecessary. Over time, the anxiety response disappears - but it does take continued effort and persistence. People do often get stuck in avoiding the situations that make them feel uncomfortable, but that only perpetuates the problem. The brain then starts learning 'well I deal with this problem by avoiding it', and this isn't a realistic or healthy solution. You need the brain to recognize that whatever aversion it has picked up, is irrational.",
          "created_utc": 1650315846.0
        },
        {
          "id": "i5al2se",
          "author": "seddit_rucks",
          "body": "> I dislike the idea of replacing meals with a drink. It's what I'd call an avoidance behavior, or a management behavior in certain cases.\n\nSo what.  That's not justification.  Meal replacements drinks are...meal replacements.  Meaning meals.\n\nIf people with ARFID are getting their nutrition through a drink, that's surely a major improvement over saltines and chicken nuggets, no?",
          "created_utc": 1650336530.0
        },
        {
          "id": "i5b036i",
          "author": "EDRD621",
          "body": "Imagine you got a laceration and the treatment was to place a tourniquet, and that's it. Sure it's better than bleeding, but it's not going to solve the problem. \n\nSame thing with this. It's management behavior and will keep you more nutritionally sound than before, probably,  but you'll still be struggling with ARFID. It's best to use both a tourniquet to lessen the bleeding AND stitches to fix the bleeding at its source.",
          "created_utc": 1650344191.0
        },
        {
          "id": "i5bcgtq",
          "author": "Gmzorz",
          "body": "So putting ARFID as a disorder that needs getting rid off to the side… Can you make do with supplements and replacements? I’m starting to just live with it and finally feeling confident about what i (can) eat. \n\nTo sum it up, are there downsides or things missing with supplements like shakes?",
          "created_utc": 1650353048.0
        },
        {
          "id": "i5cfqf2",
          "author": "EDRD621",
          "body": "People do live off of tube feedings, which is essentially (and many cases the exact same thing) as certain supplement shakes. \n\n&#x200B;\n\nThe fact is there are real downsides. Lack of real fiber, lack of phytonutrients which prevent chronic diseases and inflammation, and abstinence from important social, cultural, spiritual, pleasurable aspects of food. The last may seem obvious for someone struggling with ARFID, but it's important for us to find peace with food. Accepting a poor food situation is just settling, and will always feel like a drag.\n\n&#x200B;\n\nAlso the obvious fact about foods on repeat, shakes or not, will eventually get fatigued. What happens when shakes make you gag or vomit?",
          "created_utc": 1650377693.0
        }
      ]
    },
    {
      "id": "i5cnxog",
      "author": "TheFakeAtoM",
      "body": "Glad to be of assistance. I don't know about regular check-ups. Blood tests are probably the main thing. Other than that you can use something like [Cronometer](https://cronometer.com/) or [CompleteFoods](https://www.completefoods.co/) to try to estimate your average daily nutrient intake including meal replacements and all your other foods, and compare it to standard nutritional guidelines. It takes a fair bit of effort though, and doesn't really account for personal characteristics (e.g. how well you personally can absorb or use certain nutrients).\n\nEdit: By the way, what meal replacements are you planning to use (if you have any mind)? I would recommend double checking that they are in fact nutritionally complete, as there are some imitators, and/or products which aren't as healthy, e.g. due to having a high sugar content. You may also find [this website](https://www.blendrunner.com/) useful, which has a great database of meal replacement products.",
      "created_utc": 1650380930.0,
      "score": 2,
      "context": [
        {
          "id": "i59378v",
          "author": "Telphsm4sh",
          "body": "I wanna try going on a meal replacement drink, like maybe Soylent, for a more healthy diet. But my family is saying that it's not a healthy mindset because its a cop out, it causes even more \"abnormal\" eating habits, and doesn't solve the actual problem of not eating food in public places. They say that it might end up narrowing my food choices, and that eventually I would just be on that drink. But me, I'm thinking I need to live with a healthy diet before I get anemia and/or diabetes at a young age, and if this can solve it, then that's a success, Feeling comfortable in social settings by expanding my safe foods is an optional/secondary goal. Am I having a bad mindset here? Is your end goal with patients completely \"normal\" eating habits? Or is it like this sort of damage control with meal replacement drinks and supplements?",
          "created_utc": 1650313017.0
        },
        {
          "id": "i59a7hu",
          "author": "EDRD621",
          "body": "You strike me as very wise! Considering that one doesn't always have a perfect mindset or perspective of a topic is an important skill in life.    \n\n\nYour logic makes sense, you'd like to ensure that you're nutritionally sound. I think that's great. But the logic is rooted in the thought that you will always be a little 'stuck in your ways' when it comes to eating. So you're looking for alternatives to 'make due', to some extent. Clients that I've worked with improve significantly - a full recovery is possible. Of course, one's perspective on foods will always be considering past experiences so it's not like they just 'forgot' about dealing with ARFID. \n\n&#x200B;\n\nI dislike the idea of replacing meals with a drink. It's what I'd call an avoidance behavior, or a management behavior in certain cases. If you're REALLY struggling, a meal replacement will be preferable to not eating. But even attempting a meal is progress. During the recovery from something like ARFID, you will be physically changing the contents of your mind as you work through some of this anxiety. It's very difficult to imagine a state of recovery, so sometimes I suggest not getting tripped up in this. Trust the process. Set small realistic goals that provide a little bit of a challenge. Ideally, you want to go into food situations/trials pretty confident that you'll be able to complete whatever the task is. For example, if eating in social situations is very difficult - try specific challenges where you eat in front of close friends/family/ or as suggested above even in front of pets/animals! Every time you engage with food, and create a positive experience, the brain starts learning that the anxiety response is unnecessary. Over time, the anxiety response disappears - but it does take continued effort and persistence. People do often get stuck in avoiding the situations that make them feel uncomfortable, but that only perpetuates the problem. The brain then starts learning 'well I deal with this problem by avoiding it', and this isn't a realistic or healthy solution. You need the brain to recognize that whatever aversion it has picked up, is irrational.",
          "created_utc": 1650315846.0
        },
        {
          "id": "i5al2se",
          "author": "seddit_rucks",
          "body": "> I dislike the idea of replacing meals with a drink. It's what I'd call an avoidance behavior, or a management behavior in certain cases.\n\nSo what.  That's not justification.  Meal replacements drinks are...meal replacements.  Meaning meals.\n\nIf people with ARFID are getting their nutrition through a drink, that's surely a major improvement over saltines and chicken nuggets, no?",
          "created_utc": 1650336530.0
        },
        {
          "id": "i5b036i",
          "author": "EDRD621",
          "body": "Imagine you got a laceration and the treatment was to place a tourniquet, and that's it. Sure it's better than bleeding, but it's not going to solve the problem. \n\nSame thing with this. It's management behavior and will keep you more nutritionally sound than before, probably,  but you'll still be struggling with ARFID. It's best to use both a tourniquet to lessen the bleeding AND stitches to fix the bleeding at its source.",
          "created_utc": 1650344191.0
        },
        {
          "id": "i5bcgtq",
          "author": "Gmzorz",
          "body": "So putting ARFID as a disorder that needs getting rid off to the side… Can you make do with supplements and replacements? I’m starting to just live with it and finally feeling confident about what i (can) eat. \n\nTo sum it up, are there downsides or things missing with supplements like shakes?",
          "created_utc": 1650353048.0
        },
        {
          "id": "i5chj04",
          "author": "TheFakeAtoM",
          "body": "I'm not a dietitian like u/EDRD621 but as someone who has done a lot of research into meal replacements I would say that you can definitely 'make do' with a nutritionally complete meal replacement like Soylent. Any product that is branded in that way will contain all the nutrients that are generally considered by expert organisations (e.g. the WHO or FAO) to be essential in the human diet, and will, on average, tend to be healthier than any other type of food or meal (although this may depend on the dietary context).\n\nHowever, if you are talking about living solely (100%) on meal replacements, there are important caveats that I should state here. The issues below mostly arise from the fact that meal replacements are typically based around a small (restricted) number of ingredients, and, in terms of the last one, that they are typically liquids.\n\nFirstly, it is possible that there are other nutrients which will in the future be discovered to be essential, or to improve / optimise human health, and they may not currently be included in one or many meal replacement products. Some phytonutrients are a possible example of this. There are definitely phytonutrients in essentially all meal replacements, from their plant-derived ingredients (e.g. oat flour), however there may not be as many as there are in whole foods. I would emphasise, however, that such nutrients are unlikely to be important, as many of them have already been researched in some detail. That's especially true for whether nutrients are essential. If there were more essential nutrients, we probably would've discovered that from the numerous people who actually have lived on meal replacements for months at a time. I would further note that the benefits from having an otherwise nutritionally complete diet are likely to outweigh any negatives caused from missing one or two beneficial but non-essential nutrients.\n\nAs a stronger criticism of the above, this caveat probably also applies to most modern diets, which are likely to be missing not only some beneficial nutrients, but to contain significantly insufficient quantities of some (or many) essential nutrients. You could, however, make a stronger case for a comparison to a whole foods diet which is, in fact, close to nutritionally complete, although it's my view that such diets are quite rare, even among the health-conscious.\n\nNonetheless it is entirely possible to supplement a particular non-essential nutrient or two if one has good reasons to be concerned about it, and there are meal replacement formulations out there that include such nutrients, e.g. Super Body Fuel. In the case of phytonutrients, it is not difficult to add tons of different ones using some sort of dried vegetable powder (e.g. 'Super Greens').\n\nA second caveat is probiotics, which actually seem quite important. Again, however, these are easy to add to one's diet, and some meal replacements, e.g. Huel, include them. Also again, they are not necessarily included in the average solid-food diet. Finally, chewing may be important, even for brain health. However, this issue can easily be eliminated by chewing gum, or using some solid-food meal replacements.\n\nAt the moment, I can't think of any other relevant issues, but I'll let you know if I do. I have thought about this topic quite a bit in the past.\n\nIn summary, a sceptical person may think it is safer, at our current level of knowledge, to not go on a 100% meal replacement diet, although some people have been successful with this. It also seems that the uncertainties surrounding such a diet are fairly minor, and may not even exceed the uncertainties we have about many other modern diets.\n\nApologies for the long post by the way - just wanted to make it comprehensive.",
          "created_utc": 1650378416.0
        },
        {
          "id": "i5clj3a",
          "author": "Gmzorz",
          "body": "I think i was really hoping to receive a reply like this, completely technical. Very helpful and definitely reassuring. Most of the foods i tolerate are pretty much all meats, fish, white rice, pasta, bread, apples and bananas being the only fruits so i believe my two shakes a day fit nicely in between (prescribed by a dietitian). It really is just vegetables i am lacking. Is there any good way for regular check-ups regarding nutrients? ive done blood tests which were fine.",
          "created_utc": 1650379986.0
        }
      ]
    },
    {
      "id": "i5cuwen",
      "author": "EDRD621",
      "body": "I can assure you most tube feedings are the same, I have a lot of experience with them! Abbott and Nestle basically own the tube feeding industry and the formulas of the pre-packed drinks and TFs are mostly identical. The company that owns Soylent likely has no actual contracts with insurance companies or healthcare facilities. Doesn't mean someone couldn't use it if they have a PEG, but it's likely not being supported by insurance or their MD. It's a money thing. \n\nLiquid fibers aren't as effective in many cases, some are better than others, and this is also a cost/money issue. \n\nI don't think there's enough information on phytonutrients to make a definitive judgement, it just seems better to assume they are helpful. \n\nSeems like you've done a lot of research and have helped many people though! Kudos :)",
      "created_utc": 1650383580.0,
      "score": 3,
      "context": [
        {
          "id": "i59378v",
          "author": "Telphsm4sh",
          "body": "I wanna try going on a meal replacement drink, like maybe Soylent, for a more healthy diet. But my family is saying that it's not a healthy mindset because its a cop out, it causes even more \"abnormal\" eating habits, and doesn't solve the actual problem of not eating food in public places. They say that it might end up narrowing my food choices, and that eventually I would just be on that drink. But me, I'm thinking I need to live with a healthy diet before I get anemia and/or diabetes at a young age, and if this can solve it, then that's a success, Feeling comfortable in social settings by expanding my safe foods is an optional/secondary goal. Am I having a bad mindset here? Is your end goal with patients completely \"normal\" eating habits? Or is it like this sort of damage control with meal replacement drinks and supplements?",
          "created_utc": 1650313017.0
        },
        {
          "id": "i59a7hu",
          "author": "EDRD621",
          "body": "You strike me as very wise! Considering that one doesn't always have a perfect mindset or perspective of a topic is an important skill in life.    \n\n\nYour logic makes sense, you'd like to ensure that you're nutritionally sound. I think that's great. But the logic is rooted in the thought that you will always be a little 'stuck in your ways' when it comes to eating. So you're looking for alternatives to 'make due', to some extent. Clients that I've worked with improve significantly - a full recovery is possible. Of course, one's perspective on foods will always be considering past experiences so it's not like they just 'forgot' about dealing with ARFID. \n\n&#x200B;\n\nI dislike the idea of replacing meals with a drink. It's what I'd call an avoidance behavior, or a management behavior in certain cases. If you're REALLY struggling, a meal replacement will be preferable to not eating. But even attempting a meal is progress. During the recovery from something like ARFID, you will be physically changing the contents of your mind as you work through some of this anxiety. It's very difficult to imagine a state of recovery, so sometimes I suggest not getting tripped up in this. Trust the process. Set small realistic goals that provide a little bit of a challenge. Ideally, you want to go into food situations/trials pretty confident that you'll be able to complete whatever the task is. For example, if eating in social situations is very difficult - try specific challenges where you eat in front of close friends/family/ or as suggested above even in front of pets/animals! Every time you engage with food, and create a positive experience, the brain starts learning that the anxiety response is unnecessary. Over time, the anxiety response disappears - but it does take continued effort and persistence. People do often get stuck in avoiding the situations that make them feel uncomfortable, but that only perpetuates the problem. The brain then starts learning 'well I deal with this problem by avoiding it', and this isn't a realistic or healthy solution. You need the brain to recognize that whatever aversion it has picked up, is irrational.",
          "created_utc": 1650315846.0
        },
        {
          "id": "i5al2se",
          "author": "seddit_rucks",
          "body": "> I dislike the idea of replacing meals with a drink. It's what I'd call an avoidance behavior, or a management behavior in certain cases.\n\nSo what.  That's not justification.  Meal replacements drinks are...meal replacements.  Meaning meals.\n\nIf people with ARFID are getting their nutrition through a drink, that's surely a major improvement over saltines and chicken nuggets, no?",
          "created_utc": 1650336530.0
        },
        {
          "id": "i5b036i",
          "author": "EDRD621",
          "body": "Imagine you got a laceration and the treatment was to place a tourniquet, and that's it. Sure it's better than bleeding, but it's not going to solve the problem. \n\nSame thing with this. It's management behavior and will keep you more nutritionally sound than before, probably,  but you'll still be struggling with ARFID. It's best to use both a tourniquet to lessen the bleeding AND stitches to fix the bleeding at its source.",
          "created_utc": 1650344191.0
        },
        {
          "id": "i5bcgtq",
          "author": "Gmzorz",
          "body": "So putting ARFID as a disorder that needs getting rid off to the side… Can you make do with supplements and replacements? I’m starting to just live with it and finally feeling confident about what i (can) eat. \n\nTo sum it up, are there downsides or things missing with supplements like shakes?",
          "created_utc": 1650353048.0
        },
        {
          "id": "i5cfqf2",
          "author": "EDRD621",
          "body": "People do live off of tube feedings, which is essentially (and many cases the exact same thing) as certain supplement shakes. \n\n&#x200B;\n\nThe fact is there are real downsides. Lack of real fiber, lack of phytonutrients which prevent chronic diseases and inflammation, and abstinence from important social, cultural, spiritual, pleasurable aspects of food. The last may seem obvious for someone struggling with ARFID, but it's important for us to find peace with food. Accepting a poor food situation is just settling, and will always feel like a drag.\n\n&#x200B;\n\nAlso the obvious fact about foods on repeat, shakes or not, will eventually get fatigued. What happens when shakes make you gag or vomit?",
          "created_utc": 1650377693.0
        },
        {
          "id": "i5cn4s4",
          "author": "TheFakeAtoM",
          "body": "> many cases the exact same thing\n\nI'm not sure that I agree that tube feedings are, \"in many cases\", the same thing as modern meal replacements (which is what is being discussed here), although I would have to look into it more. Are products like Soylent used for feeding tubes?\n\n> Lack of real fiber\n\nAll modern meal replacements contain 'real fiber', i.e. sufficient quantities of soluble and insoluble fiber (an example of the latter is oat fiber).\n\n> lack of phytonutrients\n\nSee my other reply for more about this. It's my understanding that there is no conclusive evidence that they have beneficial health effects, as stated [here](https://lpi.oregonstate.edu/mic/dietary-factors/phytochemicals) by the LPI, and in the various subpages (excluding fiber). Nonetheless, if one believes there are important ones which are not present in meal replacements, they can easily be added, and have been in some products.\n\n> abstinence from important social, cultural, spiritual, pleasurable aspects of food.\n\nI would note here that there is such a thing as solid-food meal replacements (which I think is a great idea), e.g. noodles and burgers, and more are being developed.\n\n> will eventually get fatigued.\n\nFair point, although I don't think it applies to everyone. There are people in the meal replacement community who seem to have no such issues with \"foods on repeat\". And I would repeat my point about solid-food versions (and other versions such as soups).\n\nNote: all of what I'm writing here is with the previous premise of 'putting ARFID to the side'.",
          "created_utc": 1650380617.0
        }
      ]
    },
    {
      "id": "i5dc4jc",
      "author": "Gmzorz",
      "body": "I have been using this for about two years: \n\nhttps://www.nutricia.nl/-/media/Websites/Medical-Nutrition/Voedingstabellen/NL/Powders_modules/Voedingstabel_Nutridrink_Powder_122020.ashx",
      "created_utc": 1650390119.0,
      "score": 1,
      "context": [
        {
          "id": "i59378v",
          "author": "Telphsm4sh",
          "body": "I wanna try going on a meal replacement drink, like maybe Soylent, for a more healthy diet. But my family is saying that it's not a healthy mindset because its a cop out, it causes even more \"abnormal\" eating habits, and doesn't solve the actual problem of not eating food in public places. They say that it might end up narrowing my food choices, and that eventually I would just be on that drink. But me, I'm thinking I need to live with a healthy diet before I get anemia and/or diabetes at a young age, and if this can solve it, then that's a success, Feeling comfortable in social settings by expanding my safe foods is an optional/secondary goal. Am I having a bad mindset here? Is your end goal with patients completely \"normal\" eating habits? Or is it like this sort of damage control with meal replacement drinks and supplements?",
          "created_utc": 1650313017.0
        },
        {
          "id": "i59a7hu",
          "author": "EDRD621",
          "body": "You strike me as very wise! Considering that one doesn't always have a perfect mindset or perspective of a topic is an important skill in life.    \n\n\nYour logic makes sense, you'd like to ensure that you're nutritionally sound. I think that's great. But the logic is rooted in the thought that you will always be a little 'stuck in your ways' when it comes to eating. So you're looking for alternatives to 'make due', to some extent. Clients that I've worked with improve significantly - a full recovery is possible. Of course, one's perspective on foods will always be considering past experiences so it's not like they just 'forgot' about dealing with ARFID. \n\n&#x200B;\n\nI dislike the idea of replacing meals with a drink. It's what I'd call an avoidance behavior, or a management behavior in certain cases. If you're REALLY struggling, a meal replacement will be preferable to not eating. But even attempting a meal is progress. During the recovery from something like ARFID, you will be physically changing the contents of your mind as you work through some of this anxiety. It's very difficult to imagine a state of recovery, so sometimes I suggest not getting tripped up in this. Trust the process. Set small realistic goals that provide a little bit of a challenge. Ideally, you want to go into food situations/trials pretty confident that you'll be able to complete whatever the task is. For example, if eating in social situations is very difficult - try specific challenges where you eat in front of close friends/family/ or as suggested above even in front of pets/animals! Every time you engage with food, and create a positive experience, the brain starts learning that the anxiety response is unnecessary. Over time, the anxiety response disappears - but it does take continued effort and persistence. People do often get stuck in avoiding the situations that make them feel uncomfortable, but that only perpetuates the problem. The brain then starts learning 'well I deal with this problem by avoiding it', and this isn't a realistic or healthy solution. You need the brain to recognize that whatever aversion it has picked up, is irrational.",
          "created_utc": 1650315846.0
        },
        {
          "id": "i5al2se",
          "author": "seddit_rucks",
          "body": "> I dislike the idea of replacing meals with a drink. It's what I'd call an avoidance behavior, or a management behavior in certain cases.\n\nSo what.  That's not justification.  Meal replacements drinks are...meal replacements.  Meaning meals.\n\nIf people with ARFID are getting their nutrition through a drink, that's surely a major improvement over saltines and chicken nuggets, no?",
          "created_utc": 1650336530.0
        },
        {
          "id": "i5b036i",
          "author": "EDRD621",
          "body": "Imagine you got a laceration and the treatment was to place a tourniquet, and that's it. Sure it's better than bleeding, but it's not going to solve the problem. \n\nSame thing with this. It's management behavior and will keep you more nutritionally sound than before, probably,  but you'll still be struggling with ARFID. It's best to use both a tourniquet to lessen the bleeding AND stitches to fix the bleeding at its source.",
          "created_utc": 1650344191.0
        },
        {
          "id": "i5bcgtq",
          "author": "Gmzorz",
          "body": "So putting ARFID as a disorder that needs getting rid off to the side… Can you make do with supplements and replacements? I’m starting to just live with it and finally feeling confident about what i (can) eat. \n\nTo sum it up, are there downsides or things missing with supplements like shakes?",
          "created_utc": 1650353048.0
        },
        {
          "id": "i5chj04",
          "author": "TheFakeAtoM",
          "body": "I'm not a dietitian like u/EDRD621 but as someone who has done a lot of research into meal replacements I would say that you can definitely 'make do' with a nutritionally complete meal replacement like Soylent. Any product that is branded in that way will contain all the nutrients that are generally considered by expert organisations (e.g. the WHO or FAO) to be essential in the human diet, and will, on average, tend to be healthier than any other type of food or meal (although this may depend on the dietary context).\n\nHowever, if you are talking about living solely (100%) on meal replacements, there are important caveats that I should state here. The issues below mostly arise from the fact that meal replacements are typically based around a small (restricted) number of ingredients, and, in terms of the last one, that they are typically liquids.\n\nFirstly, it is possible that there are other nutrients which will in the future be discovered to be essential, or to improve / optimise human health, and they may not currently be included in one or many meal replacement products. Some phytonutrients are a possible example of this. There are definitely phytonutrients in essentially all meal replacements, from their plant-derived ingredients (e.g. oat flour), however there may not be as many as there are in whole foods. I would emphasise, however, that such nutrients are unlikely to be important, as many of them have already been researched in some detail. That's especially true for whether nutrients are essential. If there were more essential nutrients, we probably would've discovered that from the numerous people who actually have lived on meal replacements for months at a time. I would further note that the benefits from having an otherwise nutritionally complete diet are likely to outweigh any negatives caused from missing one or two beneficial but non-essential nutrients.\n\nAs a stronger criticism of the above, this caveat probably also applies to most modern diets, which are likely to be missing not only some beneficial nutrients, but to contain significantly insufficient quantities of some (or many) essential nutrients. You could, however, make a stronger case for a comparison to a whole foods diet which is, in fact, close to nutritionally complete, although it's my view that such diets are quite rare, even among the health-conscious.\n\nNonetheless it is entirely possible to supplement a particular non-essential nutrient or two if one has good reasons to be concerned about it, and there are meal replacement formulations out there that include such nutrients, e.g. Super Body Fuel. In the case of phytonutrients, it is not difficult to add tons of different ones using some sort of dried vegetable powder (e.g. 'Super Greens').\n\nA second caveat is probiotics, which actually seem quite important. Again, however, these are easy to add to one's diet, and some meal replacements, e.g. Huel, include them. Also again, they are not necessarily included in the average solid-food diet. Finally, chewing may be important, even for brain health. However, this issue can easily be eliminated by chewing gum, or using some solid-food meal replacements.\n\nAt the moment, I can't think of any other relevant issues, but I'll let you know if I do. I have thought about this topic quite a bit in the past.\n\nIn summary, a sceptical person may think it is safer, at our current level of knowledge, to not go on a 100% meal replacement diet, although some people have been successful with this. It also seems that the uncertainties surrounding such a diet are fairly minor, and may not even exceed the uncertainties we have about many other modern diets.\n\nApologies for the long post by the way - just wanted to make it comprehensive.",
          "created_utc": 1650378416.0
        },
        {
          "id": "i5clj3a",
          "author": "Gmzorz",
          "body": "I think i was really hoping to receive a reply like this, completely technical. Very helpful and definitely reassuring. Most of the foods i tolerate are pretty much all meats, fish, white rice, pasta, bread, apples and bananas being the only fruits so i believe my two shakes a day fit nicely in between (prescribed by a dietitian). It really is just vegetables i am lacking. Is there any good way for regular check-ups regarding nutrients? ive done blood tests which were fine.",
          "created_utc": 1650379986.0
        },
        {
          "id": "i5cnxog",
          "author": "TheFakeAtoM",
          "body": "Glad to be of assistance. I don't know about regular check-ups. Blood tests are probably the main thing. Other than that you can use something like [Cronometer](https://cronometer.com/) or [CompleteFoods](https://www.completefoods.co/) to try to estimate your average daily nutrient intake including meal replacements and all your other foods, and compare it to standard nutritional guidelines. It takes a fair bit of effort though, and doesn't really account for personal characteristics (e.g. how well you personally can absorb or use certain nutrients).\n\nEdit: By the way, what meal replacements are you planning to use (if you have any mind)? I would recommend double checking that they are in fact nutritionally complete, as there are some imitators, and/or products which aren't as healthy, e.g. due to having a high sugar content. You may also find [this website](https://www.blendrunner.com/) useful, which has a great database of meal replacement products.",
          "created_utc": 1650380930.0
        }
      ]
    },
    {
      "id": "i5d0as6",
      "author": "TheFakeAtoM",
      "body": "> I can assure you most tube feedings are the same\n\nNo offence but Ensure and Optifast are significantly different to most modern meal replacements like Soylent. To name a few things, both are far higher in sugar, use worse sources of complex carbohydrates (which also increases their GI substantially), and their macronutrient ratios are also quite different. It's my understanding that they were developed to taste good and keep people functional, whereas Soylent and co. are more concerned with allowing average people to conveniently obtain optimal nutrition, and/or improve on their previous diet.\n\n> Liquid fibers aren't as effective in many cases\n\nThe fibers used come from solid, whole foods, which are also fiber sources in many typical diets. If you're referring to the fact that they are mixed with water in meal replacement drinks, that's also true of other fiber sources, e.g. porridge. I'm not sure I see how that would have any impact on efficacy.\n\n> I don't think there's enough information on phytonutrients to make a definitive judgement, it just seems better to assume they are helpful.\n\nUnderstandable, and that is why some people (and companies) include them in their meal replacements.\n\n> Seems like you've done a lot of research and have helped many people though! Kudos :)\n\nThank you!\n\nEdit: For other examples of what I'm referring to by 'modern meal replacements' see [this website](https://www.blendrunner.com/). Obviously some are better than others though.",
      "created_utc": 1650385665.0,
      "score": 3,
      "context": [
        {
          "id": "i59378v",
          "author": "Telphsm4sh",
          "body": "I wanna try going on a meal replacement drink, like maybe Soylent, for a more healthy diet. But my family is saying that it's not a healthy mindset because its a cop out, it causes even more \"abnormal\" eating habits, and doesn't solve the actual problem of not eating food in public places. They say that it might end up narrowing my food choices, and that eventually I would just be on that drink. But me, I'm thinking I need to live with a healthy diet before I get anemia and/or diabetes at a young age, and if this can solve it, then that's a success, Feeling comfortable in social settings by expanding my safe foods is an optional/secondary goal. Am I having a bad mindset here? Is your end goal with patients completely \"normal\" eating habits? Or is it like this sort of damage control with meal replacement drinks and supplements?",
          "created_utc": 1650313017.0
        },
        {
          "id": "i59a7hu",
          "author": "EDRD621",
          "body": "You strike me as very wise! Considering that one doesn't always have a perfect mindset or perspective of a topic is an important skill in life.    \n\n\nYour logic makes sense, you'd like to ensure that you're nutritionally sound. I think that's great. But the logic is rooted in the thought that you will always be a little 'stuck in your ways' when it comes to eating. So you're looking for alternatives to 'make due', to some extent. Clients that I've worked with improve significantly - a full recovery is possible. Of course, one's perspective on foods will always be considering past experiences so it's not like they just 'forgot' about dealing with ARFID. \n\n&#x200B;\n\nI dislike the idea of replacing meals with a drink. It's what I'd call an avoidance behavior, or a management behavior in certain cases. If you're REALLY struggling, a meal replacement will be preferable to not eating. But even attempting a meal is progress. During the recovery from something like ARFID, you will be physically changing the contents of your mind as you work through some of this anxiety. It's very difficult to imagine a state of recovery, so sometimes I suggest not getting tripped up in this. Trust the process. Set small realistic goals that provide a little bit of a challenge. Ideally, you want to go into food situations/trials pretty confident that you'll be able to complete whatever the task is. For example, if eating in social situations is very difficult - try specific challenges where you eat in front of close friends/family/ or as suggested above even in front of pets/animals! Every time you engage with food, and create a positive experience, the brain starts learning that the anxiety response is unnecessary. Over time, the anxiety response disappears - but it does take continued effort and persistence. People do often get stuck in avoiding the situations that make them feel uncomfortable, but that only perpetuates the problem. The brain then starts learning 'well I deal with this problem by avoiding it', and this isn't a realistic or healthy solution. You need the brain to recognize that whatever aversion it has picked up, is irrational.",
          "created_utc": 1650315846.0
        },
        {
          "id": "i5al2se",
          "author": "seddit_rucks",
          "body": "> I dislike the idea of replacing meals with a drink. It's what I'd call an avoidance behavior, or a management behavior in certain cases.\n\nSo what.  That's not justification.  Meal replacements drinks are...meal replacements.  Meaning meals.\n\nIf people with ARFID are getting their nutrition through a drink, that's surely a major improvement over saltines and chicken nuggets, no?",
          "created_utc": 1650336530.0
        },
        {
          "id": "i5b036i",
          "author": "EDRD621",
          "body": "Imagine you got a laceration and the treatment was to place a tourniquet, and that's it. Sure it's better than bleeding, but it's not going to solve the problem. \n\nSame thing with this. It's management behavior and will keep you more nutritionally sound than before, probably,  but you'll still be struggling with ARFID. It's best to use both a tourniquet to lessen the bleeding AND stitches to fix the bleeding at its source.",
          "created_utc": 1650344191.0
        },
        {
          "id": "i5bcgtq",
          "author": "Gmzorz",
          "body": "So putting ARFID as a disorder that needs getting rid off to the side… Can you make do with supplements and replacements? I’m starting to just live with it and finally feeling confident about what i (can) eat. \n\nTo sum it up, are there downsides or things missing with supplements like shakes?",
          "created_utc": 1650353048.0
        },
        {
          "id": "i5cfqf2",
          "author": "EDRD621",
          "body": "People do live off of tube feedings, which is essentially (and many cases the exact same thing) as certain supplement shakes. \n\n&#x200B;\n\nThe fact is there are real downsides. Lack of real fiber, lack of phytonutrients which prevent chronic diseases and inflammation, and abstinence from important social, cultural, spiritual, pleasurable aspects of food. The last may seem obvious for someone struggling with ARFID, but it's important for us to find peace with food. Accepting a poor food situation is just settling, and will always feel like a drag.\n\n&#x200B;\n\nAlso the obvious fact about foods on repeat, shakes or not, will eventually get fatigued. What happens when shakes make you gag or vomit?",
          "created_utc": 1650377693.0
        },
        {
          "id": "i5cn4s4",
          "author": "TheFakeAtoM",
          "body": "> many cases the exact same thing\n\nI'm not sure that I agree that tube feedings are, \"in many cases\", the same thing as modern meal replacements (which is what is being discussed here), although I would have to look into it more. Are products like Soylent used for feeding tubes?\n\n> Lack of real fiber\n\nAll modern meal replacements contain 'real fiber', i.e. sufficient quantities of soluble and insoluble fiber (an example of the latter is oat fiber).\n\n> lack of phytonutrients\n\nSee my other reply for more about this. It's my understanding that there is no conclusive evidence that they have beneficial health effects, as stated [here](https://lpi.oregonstate.edu/mic/dietary-factors/phytochemicals) by the LPI, and in the various subpages (excluding fiber). Nonetheless, if one believes there are important ones which are not present in meal replacements, they can easily be added, and have been in some products.\n\n> abstinence from important social, cultural, spiritual, pleasurable aspects of food.\n\nI would note here that there is such a thing as solid-food meal replacements (which I think is a great idea), e.g. noodles and burgers, and more are being developed.\n\n> will eventually get fatigued.\n\nFair point, although I don't think it applies to everyone. There are people in the meal replacement community who seem to have no such issues with \"foods on repeat\". And I would repeat my point about solid-food versions (and other versions such as soups).\n\nNote: all of what I'm writing here is with the previous premise of 'putting ARFID to the side'.",
          "created_utc": 1650380617.0
        },
        {
          "id": "i5cuwen",
          "author": "EDRD621",
          "body": "I can assure you most tube feedings are the same, I have a lot of experience with them! Abbott and Nestle basically own the tube feeding industry and the formulas of the pre-packed drinks and TFs are mostly identical. The company that owns Soylent likely has no actual contracts with insurance companies or healthcare facilities. Doesn't mean someone couldn't use it if they have a PEG, but it's likely not being supported by insurance or their MD. It's a money thing. \n\nLiquid fibers aren't as effective in many cases, some are better than others, and this is also a cost/money issue. \n\nI don't think there's enough information on phytonutrients to make a definitive judgement, it just seems better to assume they are helpful. \n\nSeems like you've done a lot of research and have helped many people though! Kudos :)",
          "created_utc": 1650383580.0
        }
      ]
    },
    {
      "id": "i5z6tce",
      "author": "TheFakeAtoM",
      "body": "Sorry for the late reply. It's a little hard for me to judge that meal replacement since I can't read that language, and there is no ingredients list. From what I can see it looks alright, although I would say there is room for improvement (which is pretty common with these products). E.g. the ratio of omega-6 to omega-3 is higher than what is optimal (although that's not a huge issue). I would still recommend having a look at some other products on [BlendRunner](https://www.blendrunner.com/) as you might find something good there, and potentially something which is even better nutritionally (or cheaper, etc.).",
      "created_utc": 1650787124.0,
      "score": 1,
      "context": [
        {
          "id": "i59378v",
          "author": "Telphsm4sh",
          "body": "I wanna try going on a meal replacement drink, like maybe Soylent, for a more healthy diet. But my family is saying that it's not a healthy mindset because its a cop out, it causes even more \"abnormal\" eating habits, and doesn't solve the actual problem of not eating food in public places. They say that it might end up narrowing my food choices, and that eventually I would just be on that drink. But me, I'm thinking I need to live with a healthy diet before I get anemia and/or diabetes at a young age, and if this can solve it, then that's a success, Feeling comfortable in social settings by expanding my safe foods is an optional/secondary goal. Am I having a bad mindset here? Is your end goal with patients completely \"normal\" eating habits? Or is it like this sort of damage control with meal replacement drinks and supplements?",
          "created_utc": 1650313017.0
        },
        {
          "id": "i59a7hu",
          "author": "EDRD621",
          "body": "You strike me as very wise! Considering that one doesn't always have a perfect mindset or perspective of a topic is an important skill in life.    \n\n\nYour logic makes sense, you'd like to ensure that you're nutritionally sound. I think that's great. But the logic is rooted in the thought that you will always be a little 'stuck in your ways' when it comes to eating. So you're looking for alternatives to 'make due', to some extent. Clients that I've worked with improve significantly - a full recovery is possible. Of course, one's perspective on foods will always be considering past experiences so it's not like they just 'forgot' about dealing with ARFID. \n\n&#x200B;\n\nI dislike the idea of replacing meals with a drink. It's what I'd call an avoidance behavior, or a management behavior in certain cases. If you're REALLY struggling, a meal replacement will be preferable to not eating. But even attempting a meal is progress. During the recovery from something like ARFID, you will be physically changing the contents of your mind as you work through some of this anxiety. It's very difficult to imagine a state of recovery, so sometimes I suggest not getting tripped up in this. Trust the process. Set small realistic goals that provide a little bit of a challenge. Ideally, you want to go into food situations/trials pretty confident that you'll be able to complete whatever the task is. For example, if eating in social situations is very difficult - try specific challenges where you eat in front of close friends/family/ or as suggested above even in front of pets/animals! Every time you engage with food, and create a positive experience, the brain starts learning that the anxiety response is unnecessary. Over time, the anxiety response disappears - but it does take continued effort and persistence. People do often get stuck in avoiding the situations that make them feel uncomfortable, but that only perpetuates the problem. The brain then starts learning 'well I deal with this problem by avoiding it', and this isn't a realistic or healthy solution. You need the brain to recognize that whatever aversion it has picked up, is irrational.",
          "created_utc": 1650315846.0
        },
        {
          "id": "i5al2se",
          "author": "seddit_rucks",
          "body": "> I dislike the idea of replacing meals with a drink. It's what I'd call an avoidance behavior, or a management behavior in certain cases.\n\nSo what.  That's not justification.  Meal replacements drinks are...meal replacements.  Meaning meals.\n\nIf people with ARFID are getting their nutrition through a drink, that's surely a major improvement over saltines and chicken nuggets, no?",
          "created_utc": 1650336530.0
        },
        {
          "id": "i5b036i",
          "author": "EDRD621",
          "body": "Imagine you got a laceration and the treatment was to place a tourniquet, and that's it. Sure it's better than bleeding, but it's not going to solve the problem. \n\nSame thing with this. It's management behavior and will keep you more nutritionally sound than before, probably,  but you'll still be struggling with ARFID. It's best to use both a tourniquet to lessen the bleeding AND stitches to fix the bleeding at its source.",
          "created_utc": 1650344191.0
        },
        {
          "id": "i5bcgtq",
          "author": "Gmzorz",
          "body": "So putting ARFID as a disorder that needs getting rid off to the side… Can you make do with supplements and replacements? I’m starting to just live with it and finally feeling confident about what i (can) eat. \n\nTo sum it up, are there downsides or things missing with supplements like shakes?",
          "created_utc": 1650353048.0
        },
        {
          "id": "i5chj04",
          "author": "TheFakeAtoM",
          "body": "I'm not a dietitian like u/EDRD621 but as someone who has done a lot of research into meal replacements I would say that you can definitely 'make do' with a nutritionally complete meal replacement like Soylent. Any product that is branded in that way will contain all the nutrients that are generally considered by expert organisations (e.g. the WHO or FAO) to be essential in the human diet, and will, on average, tend to be healthier than any other type of food or meal (although this may depend on the dietary context).\n\nHowever, if you are talking about living solely (100%) on meal replacements, there are important caveats that I should state here. The issues below mostly arise from the fact that meal replacements are typically based around a small (restricted) number of ingredients, and, in terms of the last one, that they are typically liquids.\n\nFirstly, it is possible that there are other nutrients which will in the future be discovered to be essential, or to improve / optimise human health, and they may not currently be included in one or many meal replacement products. Some phytonutrients are a possible example of this. There are definitely phytonutrients in essentially all meal replacements, from their plant-derived ingredients (e.g. oat flour), however there may not be as many as there are in whole foods. I would emphasise, however, that such nutrients are unlikely to be important, as many of them have already been researched in some detail. That's especially true for whether nutrients are essential. If there were more essential nutrients, we probably would've discovered that from the numerous people who actually have lived on meal replacements for months at a time. I would further note that the benefits from having an otherwise nutritionally complete diet are likely to outweigh any negatives caused from missing one or two beneficial but non-essential nutrients.\n\nAs a stronger criticism of the above, this caveat probably also applies to most modern diets, which are likely to be missing not only some beneficial nutrients, but to contain significantly insufficient quantities of some (or many) essential nutrients. You could, however, make a stronger case for a comparison to a whole foods diet which is, in fact, close to nutritionally complete, although it's my view that such diets are quite rare, even among the health-conscious.\n\nNonetheless it is entirely possible to supplement a particular non-essential nutrient or two if one has good reasons to be concerned about it, and there are meal replacement formulations out there that include such nutrients, e.g. Super Body Fuel. In the case of phytonutrients, it is not difficult to add tons of different ones using some sort of dried vegetable powder (e.g. 'Super Greens').\n\nA second caveat is probiotics, which actually seem quite important. Again, however, these are easy to add to one's diet, and some meal replacements, e.g. Huel, include them. Also again, they are not necessarily included in the average solid-food diet. Finally, chewing may be important, even for brain health. However, this issue can easily be eliminated by chewing gum, or using some solid-food meal replacements.\n\nAt the moment, I can't think of any other relevant issues, but I'll let you know if I do. I have thought about this topic quite a bit in the past.\n\nIn summary, a sceptical person may think it is safer, at our current level of knowledge, to not go on a 100% meal replacement diet, although some people have been successful with this. It also seems that the uncertainties surrounding such a diet are fairly minor, and may not even exceed the uncertainties we have about many other modern diets.\n\nApologies for the long post by the way - just wanted to make it comprehensive.",
          "created_utc": 1650378416.0
        },
        {
          "id": "i5clj3a",
          "author": "Gmzorz",
          "body": "I think i was really hoping to receive a reply like this, completely technical. Very helpful and definitely reassuring. Most of the foods i tolerate are pretty much all meats, fish, white rice, pasta, bread, apples and bananas being the only fruits so i believe my two shakes a day fit nicely in between (prescribed by a dietitian). It really is just vegetables i am lacking. Is there any good way for regular check-ups regarding nutrients? ive done blood tests which were fine.",
          "created_utc": 1650379986.0
        },
        {
          "id": "i5cnxog",
          "author": "TheFakeAtoM",
          "body": "Glad to be of assistance. I don't know about regular check-ups. Blood tests are probably the main thing. Other than that you can use something like [Cronometer](https://cronometer.com/) or [CompleteFoods](https://www.completefoods.co/) to try to estimate your average daily nutrient intake including meal replacements and all your other foods, and compare it to standard nutritional guidelines. It takes a fair bit of effort though, and doesn't really account for personal characteristics (e.g. how well you personally can absorb or use certain nutrients).\n\nEdit: By the way, what meal replacements are you planning to use (if you have any mind)? I would recommend double checking that they are in fact nutritionally complete, as there are some imitators, and/or products which aren't as healthy, e.g. due to having a high sugar content. You may also find [this website](https://www.blendrunner.com/) useful, which has a great database of meal replacement products.",
          "created_utc": 1650380930.0
        },
        {
          "id": "i5dc4jc",
          "author": "Gmzorz",
          "body": "I have been using this for about two years: \n\nhttps://www.nutricia.nl/-/media/Websites/Medical-Nutrition/Voedingstabellen/NL/Powders_modules/Voedingstabel_Nutridrink_Powder_122020.ashx",
          "created_utc": 1650390119.0
        }
      ]
    },
    {
      "id": "i5zhc1u",
      "author": "Gmzorz",
      "body": "That’s understandable, i do have trust in this product as it was initially prescribed and fully covered. Health care in the Netherlands is less competitive and privatized so it feels in good faith. i will have a look at the comparison site, it is quite a lot of nutrients to cover and study.",
      "created_utc": 1650795927.0,
      "score": 1,
      "context": [
        {
          "id": "i59378v",
          "author": "Telphsm4sh",
          "body": "I wanna try going on a meal replacement drink, like maybe Soylent, for a more healthy diet. But my family is saying that it's not a healthy mindset because its a cop out, it causes even more \"abnormal\" eating habits, and doesn't solve the actual problem of not eating food in public places. They say that it might end up narrowing my food choices, and that eventually I would just be on that drink. But me, I'm thinking I need to live with a healthy diet before I get anemia and/or diabetes at a young age, and if this can solve it, then that's a success, Feeling comfortable in social settings by expanding my safe foods is an optional/secondary goal. Am I having a bad mindset here? Is your end goal with patients completely \"normal\" eating habits? Or is it like this sort of damage control with meal replacement drinks and supplements?",
          "created_utc": 1650313017.0
        },
        {
          "id": "i59a7hu",
          "author": "EDRD621",
          "body": "You strike me as very wise! Considering that one doesn't always have a perfect mindset or perspective of a topic is an important skill in life.    \n\n\nYour logic makes sense, you'd like to ensure that you're nutritionally sound. I think that's great. But the logic is rooted in the thought that you will always be a little 'stuck in your ways' when it comes to eating. So you're looking for alternatives to 'make due', to some extent. Clients that I've worked with improve significantly - a full recovery is possible. Of course, one's perspective on foods will always be considering past experiences so it's not like they just 'forgot' about dealing with ARFID. \n\n&#x200B;\n\nI dislike the idea of replacing meals with a drink. It's what I'd call an avoidance behavior, or a management behavior in certain cases. If you're REALLY struggling, a meal replacement will be preferable to not eating. But even attempting a meal is progress. During the recovery from something like ARFID, you will be physically changing the contents of your mind as you work through some of this anxiety. It's very difficult to imagine a state of recovery, so sometimes I suggest not getting tripped up in this. Trust the process. Set small realistic goals that provide a little bit of a challenge. Ideally, you want to go into food situations/trials pretty confident that you'll be able to complete whatever the task is. For example, if eating in social situations is very difficult - try specific challenges where you eat in front of close friends/family/ or as suggested above even in front of pets/animals! Every time you engage with food, and create a positive experience, the brain starts learning that the anxiety response is unnecessary. Over time, the anxiety response disappears - but it does take continued effort and persistence. People do often get stuck in avoiding the situations that make them feel uncomfortable, but that only perpetuates the problem. The brain then starts learning 'well I deal with this problem by avoiding it', and this isn't a realistic or healthy solution. You need the brain to recognize that whatever aversion it has picked up, is irrational.",
          "created_utc": 1650315846.0
        },
        {
          "id": "i5al2se",
          "author": "seddit_rucks",
          "body": "> I dislike the idea of replacing meals with a drink. It's what I'd call an avoidance behavior, or a management behavior in certain cases.\n\nSo what.  That's not justification.  Meal replacements drinks are...meal replacements.  Meaning meals.\n\nIf people with ARFID are getting their nutrition through a drink, that's surely a major improvement over saltines and chicken nuggets, no?",
          "created_utc": 1650336530.0
        },
        {
          "id": "i5b036i",
          "author": "EDRD621",
          "body": "Imagine you got a laceration and the treatment was to place a tourniquet, and that's it. Sure it's better than bleeding, but it's not going to solve the problem. \n\nSame thing with this. It's management behavior and will keep you more nutritionally sound than before, probably,  but you'll still be struggling with ARFID. It's best to use both a tourniquet to lessen the bleeding AND stitches to fix the bleeding at its source.",
          "created_utc": 1650344191.0
        },
        {
          "id": "i5bcgtq",
          "author": "Gmzorz",
          "body": "So putting ARFID as a disorder that needs getting rid off to the side… Can you make do with supplements and replacements? I’m starting to just live with it and finally feeling confident about what i (can) eat. \n\nTo sum it up, are there downsides or things missing with supplements like shakes?",
          "created_utc": 1650353048.0
        },
        {
          "id": "i5chj04",
          "author": "TheFakeAtoM",
          "body": "I'm not a dietitian like u/EDRD621 but as someone who has done a lot of research into meal replacements I would say that you can definitely 'make do' with a nutritionally complete meal replacement like Soylent. Any product that is branded in that way will contain all the nutrients that are generally considered by expert organisations (e.g. the WHO or FAO) to be essential in the human diet, and will, on average, tend to be healthier than any other type of food or meal (although this may depend on the dietary context).\n\nHowever, if you are talking about living solely (100%) on meal replacements, there are important caveats that I should state here. The issues below mostly arise from the fact that meal replacements are typically based around a small (restricted) number of ingredients, and, in terms of the last one, that they are typically liquids.\n\nFirstly, it is possible that there are other nutrients which will in the future be discovered to be essential, or to improve / optimise human health, and they may not currently be included in one or many meal replacement products. Some phytonutrients are a possible example of this. There are definitely phytonutrients in essentially all meal replacements, from their plant-derived ingredients (e.g. oat flour), however there may not be as many as there are in whole foods. I would emphasise, however, that such nutrients are unlikely to be important, as many of them have already been researched in some detail. That's especially true for whether nutrients are essential. If there were more essential nutrients, we probably would've discovered that from the numerous people who actually have lived on meal replacements for months at a time. I would further note that the benefits from having an otherwise nutritionally complete diet are likely to outweigh any negatives caused from missing one or two beneficial but non-essential nutrients.\n\nAs a stronger criticism of the above, this caveat probably also applies to most modern diets, which are likely to be missing not only some beneficial nutrients, but to contain significantly insufficient quantities of some (or many) essential nutrients. You could, however, make a stronger case for a comparison to a whole foods diet which is, in fact, close to nutritionally complete, although it's my view that such diets are quite rare, even among the health-conscious.\n\nNonetheless it is entirely possible to supplement a particular non-essential nutrient or two if one has good reasons to be concerned about it, and there are meal replacement formulations out there that include such nutrients, e.g. Super Body Fuel. In the case of phytonutrients, it is not difficult to add tons of different ones using some sort of dried vegetable powder (e.g. 'Super Greens').\n\nA second caveat is probiotics, which actually seem quite important. Again, however, these are easy to add to one's diet, and some meal replacements, e.g. Huel, include them. Also again, they are not necessarily included in the average solid-food diet. Finally, chewing may be important, even for brain health. However, this issue can easily be eliminated by chewing gum, or using some solid-food meal replacements.\n\nAt the moment, I can't think of any other relevant issues, but I'll let you know if I do. I have thought about this topic quite a bit in the past.\n\nIn summary, a sceptical person may think it is safer, at our current level of knowledge, to not go on a 100% meal replacement diet, although some people have been successful with this. It also seems that the uncertainties surrounding such a diet are fairly minor, and may not even exceed the uncertainties we have about many other modern diets.\n\nApologies for the long post by the way - just wanted to make it comprehensive.",
          "created_utc": 1650378416.0
        },
        {
          "id": "i5clj3a",
          "author": "Gmzorz",
          "body": "I think i was really hoping to receive a reply like this, completely technical. Very helpful and definitely reassuring. Most of the foods i tolerate are pretty much all meats, fish, white rice, pasta, bread, apples and bananas being the only fruits so i believe my two shakes a day fit nicely in between (prescribed by a dietitian). It really is just vegetables i am lacking. Is there any good way for regular check-ups regarding nutrients? ive done blood tests which were fine.",
          "created_utc": 1650379986.0
        },
        {
          "id": "i5cnxog",
          "author": "TheFakeAtoM",
          "body": "Glad to be of assistance. I don't know about regular check-ups. Blood tests are probably the main thing. Other than that you can use something like [Cronometer](https://cronometer.com/) or [CompleteFoods](https://www.completefoods.co/) to try to estimate your average daily nutrient intake including meal replacements and all your other foods, and compare it to standard nutritional guidelines. It takes a fair bit of effort though, and doesn't really account for personal characteristics (e.g. how well you personally can absorb or use certain nutrients).\n\nEdit: By the way, what meal replacements are you planning to use (if you have any mind)? I would recommend double checking that they are in fact nutritionally complete, as there are some imitators, and/or products which aren't as healthy, e.g. due to having a high sugar content. You may also find [this website](https://www.blendrunner.com/) useful, which has a great database of meal replacement products.",
          "created_utc": 1650380930.0
        },
        {
          "id": "i5dc4jc",
          "author": "Gmzorz",
          "body": "I have been using this for about two years: \n\nhttps://www.nutricia.nl/-/media/Websites/Medical-Nutrition/Voedingstabellen/NL/Powders_modules/Voedingstabel_Nutridrink_Powder_122020.ashx",
          "created_utc": 1650390119.0
        },
        {
          "id": "i5z6tce",
          "author": "TheFakeAtoM",
          "body": "Sorry for the late reply. It's a little hard for me to judge that meal replacement since I can't read that language, and there is no ingredients list. From what I can see it looks alright, although I would say there is room for improvement (which is pretty common with these products). E.g. the ratio of omega-6 to omega-3 is higher than what is optimal (although that's not a huge issue). I would still recommend having a look at some other products on [BlendRunner](https://www.blendrunner.com/) as you might find something good there, and potentially something which is even better nutritionally (or cheaper, etc.).",
          "created_utc": 1650787124.0
        }
      ]
    }
  ]
}