{
  "id": "v04cm3",
  "subreddit": "ARFID",
  "author": "Ghosted_Gurl",
  "created_utc": 1653801582.0,
  "title": "I spend too much $$$ eating out because I feel like food at home is dirty",
  "selftext": "I know it’s silly, it’s actually the complete opposite. If I make a meal at home, than I know what goes in it. And yet I can’t bring myself to do it.\n\nFor example, I could make a salad at home, very cheap and healthy. But I won’t. It doesn’t feel “safe”. I will, however, go out to a restaurant and happily eat a $9 salad made by a stranger. Restaurant salad is “safe”.\n\nAlso, I can eat out and then take home leftovers. But once the food is brought into the home it feels… contaminated. Old. Rotten? Dirty. \n\nI don’t know if anyone else experiences this. But it’s been a problem I’ve had my whole life. And I feel guilty for wasting money because I’m actually irrational. 😔",
  "url": "https://www.reddit.com/r/ARFID/comments/v04cm3/i_spend_too_much_eating_out_because_i_feel_like/",
  "score": 104,
  "num_comments": 13,
  "comments": [
    {
      "id": "iaec88h",
      "author": "None",
      "body": "I cannot “make” food in my house bc of similar feelings. I only use a microwave and a fridge. I do not put meals together - the most I can do is a sandwich. Everything else is pre-made and cannot require anything but heating up. I also really really hate my cabinets and cannot eat food thats been in them. I buy food every 2-3 days and hope that I do not get grossed out by it. I just buy everything in small quantities so I do not feel wasteful but I also give myself grace in understanding that I am doing my best. I try to challenge myself occasionally using the oven or the stovetop but its not something I can do everyday. I do not eat leftovers easily as well.\n\nI initially tried to clean everything multiple times but it still did not ease my anxieties so now I just do what makes my life easiest and what gets food into my body.",
      "created_utc": 1653803558.0,
      "score": 19,
      "context": []
    },
    {
      "id": "iafcgiy",
      "author": "sunnymonarch",
      "body": "I try to trick myself by putting my food in pretty containers. I have Mason jars that I have plastic lids for that keep my food air tight and it last longer. Then I can wash it after every use. (Gives it a \"clean\" feeling)\n\nI try also to deep clean the kitchen once a month. Stove, fridge, counters...etc. \n\nIf your cabinets/drawers are the problem, I use the cabinet liners to help hide the imperfect shelf bottoms.",
      "created_utc": 1653831730.0,
      "score": 13,
      "context": []
    },
    {
      "id": "iahf7ng",
      "author": "Hanhula",
      "body": "Hey.. have you ever been tested for OCD? Contamination OCD is quite common, acts like this, and ARFID certainly aligns with it.",
      "created_utc": 1653867269.0,
      "score": 3,
      "context": []
    },
    {
      "id": "iahdgn3",
      "author": "littleghool",
      "body": "For me it's similar, but food at home is basically tasteless. One of my safest and most favorite foods is McDonald's chicken nuggets but if I buy frozen chicken nuggets and cook them at home the texture feels so weird and foreign and if I manage to eat them, it tastes like cardboard. Just bland and tasteless :/",
      "created_utc": 1653866342.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lna6cq0",
      "author": "dovekitten",
      "body": "was just searching to try and find someone else who feels this way. YES!\n\nthere’s a sauce at a restaurant i love made by combining ketchup and mayonnaise or something like that. my dad used to make it at home and i’d tell him that i can’t eat it because i know that he mixed those disgusting sauces together. but i still like it from the restaurant.\n\nalso, a plain hamburger made at home tastes too “real” and i prefer the safety of assuming a fast food plain hamburger 🤣\n\nbut i also can’t think about it too much or i will logic myself out of restaurant food too\n\nETA: also food being in my fridge makes it gross for no reason. i hate it.",
      "created_utc": 1726422947.0,
      "score": 2,
      "context": []
    },
    {
      "id": "iageaic",
      "author": "Civil-Personality26",
      "body": "Maybe you try heading over to kitchen confidential and reading some of the dirtiness of restaurant kitchens.\n\nThe sounds like a cognitive therapy program you need. You should definitely talk to someone professional regarding this issue.\n\nSomething that helps me a lot is I have a glass spray bottle with a silicone boot. It's filled with 70% isopropyl alcohol and a bit of Myers soap and water. And I spray that on everything in my kitchen and wipe it down.\n\nAlso, a steam cleaner is like $30 and chemical free sanitization is a great option.\n\nFinally, it might help you to learn some basic food safety and become more confident in yourself and your abilities to prepare food safely for yourself. The food handler is safety card. Is a mandatory thing in the United States to be obtained by anyone who works in the food industry. It's the questionnaire that should be easy to answer without studying. You should be able to find a practice test online. Go check it out and if you can't answer some questions you might want to do some reading for yourself. The best thing you can do is make yourself confident about you, your capabilities to take care of yourself and your surroundings.",
      "created_utc": 1653849141.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iaf4a4v",
      "author": "sleeplessbeauty101",
      "body": "More food poisoning is from restaurants then at home if that helps. Food is way dirtier from people that don't have much of a stake in your good health. Haven't you ever worked in food service before?",
      "created_utc": 1653827126.0,
      "score": -13,
      "context": []
    },
    {
      "id": "iah8brb",
      "author": "Ghosted_Gurl",
      "body": "This is a neat idea, thank you!",
      "created_utc": 1653863671.0,
      "score": 2,
      "context": [
        {
          "id": "iafcgiy",
          "author": "sunnymonarch",
          "body": "I try to trick myself by putting my food in pretty containers. I have Mason jars that I have plastic lids for that keep my food air tight and it last longer. Then I can wash it after every use. (Gives it a \"clean\" feeling)\n\nI try also to deep clean the kitchen once a month. Stove, fridge, counters...etc. \n\nIf your cabinets/drawers are the problem, I use the cabinet liners to help hide the imperfect shelf bottoms.",
          "created_utc": 1653831730.0
        }
      ]
    },
    {
      "id": "iahpx8p",
      "author": "Ghosted_Gurl",
      "body": "I’ve never been screened for OCD. It’s not always an issue, sometimes I can cook at home and be okay. But I’ve noticed that when I’m stressed, or something traumatic happens, it gets much worse.",
      "created_utc": 1653872918.0,
      "score": 3,
      "context": [
        {
          "id": "iahf7ng",
          "author": "Hanhula",
          "body": "Hey.. have you ever been tested for OCD? Contamination OCD is quite common, acts like this, and ARFID certainly aligns with it.",
          "created_utc": 1653867269.0
        }
      ]
    },
    {
      "id": "iai3ye8",
      "author": "None",
      "body": "I recommend Tyson chicken fries ,cook slightly longer than it says on package though ,they’re the only packaged ones I’ve ever had that taste good",
      "created_utc": 1653880116.0,
      "score": 1,
      "context": [
        {
          "id": "iahdgn3",
          "author": "littleghool",
          "body": "For me it's similar, but food at home is basically tasteless. One of my safest and most favorite foods is McDonald's chicken nuggets but if I buy frozen chicken nuggets and cook them at home the texture feels so weird and foreign and if I manage to eat them, it tastes like cardboard. Just bland and tasteless :/",
          "created_utc": 1653866342.0
        }
      ]
    },
    {
      "id": "me5juhl",
      "author": "chimtae",
      "body": "oh my god are you my twin\n\ni was searching to see if anyone felt the same about ‘fridge food’ and you described everything i deal with too lmao",
      "created_utc": 1740227396.0,
      "score": 1,
      "context": [
        {
          "id": "lna6cq0",
          "author": "dovekitten",
          "body": "was just searching to try and find someone else who feels this way. YES!\n\nthere’s a sauce at a restaurant i love made by combining ketchup and mayonnaise or something like that. my dad used to make it at home and i’d tell him that i can’t eat it because i know that he mixed those disgusting sauces together. but i still like it from the restaurant.\n\nalso, a plain hamburger made at home tastes too “real” and i prefer the safety of assuming a fast food plain hamburger 🤣\n\nbut i also can’t think about it too much or i will logic myself out of restaurant food too\n\nETA: also food being in my fridge makes it gross for no reason. i hate it.",
          "created_utc": 1726422947.0
        }
      ]
    },
    {
      "id": "iafi0d0",
      "author": "suckmyduck29",
      "body": "I really don't think that's gonna help at all. That'll just make OP uncomfortable with eating at home AND eating at restaurants",
      "created_utc": 1653834491.0,
      "score": 12,
      "context": [
        {
          "id": "iaf4a4v",
          "author": "sleeplessbeauty101",
          "body": "More food poisoning is from restaurants then at home if that helps. Food is way dirtier from people that don't have much of a stake in your good health. Haven't you ever worked in food service before?",
          "created_utc": 1653827126.0
        }
      ]
    },
    {
      "id": "iai1koo",
      "author": "Hanhula",
      "body": "Definitely sounds like contamination ocd! I have OCD so I'm very familiar. Can you talk to a psych?",
      "created_utc": 1653878890.0,
      "score": 2,
      "context": [
        {
          "id": "iahf7ng",
          "author": "Hanhula",
          "body": "Hey.. have you ever been tested for OCD? Contamination OCD is quite common, acts like this, and ARFID certainly aligns with it.",
          "created_utc": 1653867269.0
        },
        {
          "id": "iahpx8p",
          "author": "Ghosted_Gurl",
          "body": "I’ve never been screened for OCD. It’s not always an issue, sometimes I can cook at home and be okay. But I’ve noticed that when I’m stressed, or something traumatic happens, it gets much worse.",
          "created_utc": 1653872918.0
        }
      ]
    }
  ]
}