{
  "id": "v4o55o",
  "subreddit": "ARFID",
  "author": "stumpyspice",
  "created_utc": 1654346736.0,
  "title": "My discomfort at going to restaurants where I can’t eat has caused minor tension in a group chat with my friends",
  "selftext": "UPDATE: one of them apologised out of the blue, so I guess they realised that they went about things the wrong way. It’s clear that there was no malice there or anything and they thought their comments would be helpful rather than hurtful. I’m assuming here that it’s a lesson learnt for this friend in particular, at least. \n\nI’m in a group chat with my mates and one of them suggested going out for food and drink soon. Bearing in mind, I have recently put in the group saying I have ARFID but didn’t expand further other than stating it’s an ED - one of them knew this already as I had been discussing my therapy sessions with him.\n\nAnyway, it was mentioned we could go to two places, either a restaurant that has absolutely nothing on the menu for me, or a place that does - this was stated as, if I was coming then we could go to the second place. I have said I’d like to go, but if they want to go to the first place then I can always meet them for drinks afterwards. \n\nMy friend who already knew about my disorder clearly wants to go to the first place and suggested I just sit with them and drink whilst they eat. I have never and will never be comfortable with this as this is something I was forced to do throughout my life and made to feel ashamed for. As a child my family would tell me i’m an embarrassment because I wouldn’t eat anything but fries, and continuing as an adult comments have continued to be made which makes me feel shameful and embarrassed. \n\nI said that I’m not keen on this idea as it makes me uncomfortable and another friend joined in basically saying it’s not a big deal and i’m over thinking it. Naturally, I got frustrated and defensive and tried to explain that it’s not as simple as “getting over it”especially when I have anxiety alongside an ED. I stated I know they probably think it’s silly and not a big deal but it is for me. \n\nMy frustration at this guy was evident, I was genuinely emotional over it anyway since it brought back some very unpleasant memories from childhood and an abusive relationship. It’s absolutely caused tension in the chat and I know that they’re probably messaging each other privately calling me dramatic or whatnot.\n\nIt’s just so frustrating that they jump to “well it wouldn’t bother me”. Like…ok? Good for you? It bothers me?\n\nI don’t get why it can’t just be left at the fact that I feel uncomfortable with the notion? Has anyone else experienced this kind of thing? How am I even supposed to approach this now?",
  "url": "https://www.reddit.com/r/ARFID/comments/v4o55o/my_discomfort_at_going_to_restaurants_where_i/",
  "score": 102,
  "num_comments": 14,
  "comments": [
    {
      "id": "ib5574c",
      "author": "feyre_0001",
      "body": "This person seems to be pulling a power move, that or they are just totally unaware of how this ED has affected you throughout your life. \n\nI would drop this fight for now and, in the future, always say “oh I have something going on before (during the mealtime at the unsafe restaurant) but I’ll be able to stop by for drinks!” Don’t bring ARFID into the equation. As people spend more time around you and learn more about your habits, soon they’ll be better able to take them into account. \n\nIt took my best friends years to understand that my ARFID is both an eating disorder and a neurological one that is deeply rooted in anxiety. They don’t force me to eat anything I don’t want to- they will offer, but I am free to refuse. When I do try something and like it, they celebrate with me. When you finally find your people it feels amazing, you just have to be patient and deal with a lot of rude, obnoxious jerks first.",
      "created_utc": 1654347681.0,
      "score": 38,
      "context": []
    },
    {
      "id": "ib56fa9",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1654348506.0,
      "score": 15,
      "context": []
    },
    {
      "id": "ib5mr1q",
      "author": "peace_makes_plenty_",
      "body": "If you feel like it’s worth it, you could write up a little guide for your loved ones. It worked really well with (some) of my family and most of my friends. \n\nI don’t choose to share it with everyone, just the people who really seem like they mean well. It’s basically just 1. What is ARFID, 2. Things That Help, 3. Things That Hurt \n\nBeyond that, I agree with another comment here: at the end of the day, it’s not their business and you HAVE to do what’s best for you. If it were any other disorder, there wouldn’t even be a question about it. More information would probably help (if they’re good friends) but otherwise it’s okay to shut it down and do your own thing.\n\nNot every friend is a good friend, don’t be afraid to cut some of the bad fruit if they won’t be supportive",
      "created_utc": 1654357985.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ib5paoi",
      "author": "None",
      "body": "You need better friends",
      "created_utc": 1654359321.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ib5oo4v",
      "author": "UnlikelyConcept",
      "body": "Your friends are assholes. ARFID aside, who would be happy to sit and watch their friend eat dinner while going hungry themselves?? That is fucked up. Why is your idea (meeting them afterwards) not okay with them, but they somehow have the high ground and are allowed to belittle you? They are being insensitive fucks about it. Friends care about each other.   \nYou didn't make a big deal out of it, you offered a solution that was suitable for everyone but somehow they didn't like it. Horrible friends. They don't get to decide if you 'overthink' something or whether or not it makes you uncomfortable; that is your call only.   \n\n\nI'm sorry I don't have a solution :/ But just know that your feelings are absolutely valid and your friends suck.",
      "created_utc": 1654358985.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ib5lk61",
      "author": "Peppermint_Witch",
      "body": ">My friend who already knew about my disorder clearly wants to go to the first place and suggested I just sit with them and drink whilst they eat.\n\n\"Hey come and watch the rest of us eat while you starve?\"\n\nNah fuck that",
      "created_utc": 1654357345.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ib5avrv",
      "author": "ilikedogs420butt",
      "body": "What I used to do before coming homebound agoraphobic. Was get something and take some out it in a napkin and get the rest to go home. I’m not saying you have to do this, or go with them at all but that’s my suggestion. However other suggestion would be to try for exposure therapy. Remember that this disorder is mental. Even if it’s two bites it something. Wish you healing !",
      "created_utc": 1654351319.0,
      "score": 0,
      "context": []
    },
    {
      "id": "ib6i7ns",
      "author": "DeeSnow97",
      "body": "Fuck. That. Your \"friends\" are assholes, that's not how friendships work. _Especially_ the one who knows about your therapy, knows this is not just a choice for you, and still pushes the restaurant they know you aren't comfortable with, because they like it better? What the fuck...\n\nAnd then this \"well it wouldn't bother me\" stuff... holy fuck, that's just not something you say to a person. Would they knowingly give the wrong food to people with allergies, telling people that \"well, it wouldn't kill me\"? Would they tell a depressed person that \"well, I'm not sad\"? If not, why the fuck do they think that it's okay to do this to people with ARFID? Just because it's not commonly known yet? So they can't shill themselves that \"oh my god I'm so moral\" bullshit, standing up for things people already recognize, while they act like this when they'd need to legit help but there's nothing in it for them... this whole fake friendship game hurts a lot more than it helps.\n\nI don't know how anxiety works, so feel free to ignore anything past this point, but honestly, I would recommend confronting them. If they're going to stay shitty, it's better to dodge the bullet now, break these friendships, and look for better ones, than to keep it around for years until some straw finally breaks the camel's back. And breaking the friendship is just the worst case scenario, best case, they will actually understand and stop being shitty. It's their choice at that point.\n\nARFID is not something to be ashamed of, it's not your fault that you experience food the way you do. It's on you to communicate, but once you do and they still refuse to accommodate you (as _real_ friends do) they're the problem, not you. And if you stay confrontational, double down on jokes when someone makes fun of you for it instead of shying away, and just in general hold that line firmly, people who would be assholes about food will self-select out of interacting with you, _and that's a good thing._ You don't need to appease them. There are so many people in the world who are not dicks, so why waste your time on them?\n\n(On a different note, fuck your family too, that's no way to treat a child.)",
      "created_utc": 1654374811.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ibltmio",
      "author": "PsychologicalCase10",
      "body": "I remember one time my family was between 2 breweries with food trucks. One had lobster rolls, that at the time I hadn’t tired. My mom was super upset I made them go to the other food truck. This was a few years before I finally tried lobster only to find out I’m actually allergic to shellfish.",
      "created_utc": 1654694522.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ib55ssa",
      "author": "stumpyspice",
      "body": "I feel for some people you can try to explain as best as you can and provide source material for them too, and they will still lack empathy or an understanding. \n\nI just wish people would be more open minded.",
      "created_utc": 1654348087.0,
      "score": 10,
      "context": [
        {
          "id": "ib5574c",
          "author": "feyre_0001",
          "body": "This person seems to be pulling a power move, that or they are just totally unaware of how this ED has affected you throughout your life. \n\nI would drop this fight for now and, in the future, always say “oh I have something going on before (during the mealtime at the unsafe restaurant) but I’ll be able to stop by for drinks!” Don’t bring ARFID into the equation. As people spend more time around you and learn more about your habits, soon they’ll be better able to take them into account. \n\nIt took my best friends years to understand that my ARFID is both an eating disorder and a neurological one that is deeply rooted in anxiety. They don’t force me to eat anything I don’t want to- they will offer, but I am free to refuse. When I do try something and like it, they celebrate with me. When you finally find your people it feels amazing, you just have to be patient and deal with a lot of rude, obnoxious jerks first.",
          "created_utc": 1654347681.0
        }
      ]
    },
    {
      "id": "ib57209",
      "author": "stumpyspice",
      "body": "This is really good advice and a good point. I always worry about holding people back from eating where they want, which is why I said I’d meet them after as well. \n\nAnd to be fair, the second place hosts a range of different vendors from food all around, whereas the first place was purely Asian cuisine - where I have no safe options. So it wasn’t as if choosing a comfortable setting for me meant missing out on more worldly options either.",
      "created_utc": 1654348917.0,
      "score": 5,
      "context": [
        {
          "id": "ib56fa9",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1654348506.0
        }
      ]
    },
    {
      "id": "ib6dqbv",
      "author": "kfilks",
      "body": "See this is actually my preferred way for my friends to treat me, because I'd rather them not make a big deal of what I am or am not going to eat. I get that OP has a lot of trauma but a lot of people with ARFID don't necessarily want their eating to be the center of attention. \n\nAnd also my friends don't want to eat American food every single time we go out lol",
      "created_utc": 1654372389.0,
      "score": 6,
      "context": [
        {
          "id": "ib5lk61",
          "author": "Peppermint_Witch",
          "body": ">My friend who already knew about my disorder clearly wants to go to the first place and suggested I just sit with them and drink whilst they eat.\n\n\"Hey come and watch the rest of us eat while you starve?\"\n\nNah fuck that",
          "created_utc": 1654357345.0
        }
      ]
    },
    {
      "id": "ib5cco1",
      "author": "feyre_0001",
      "body": "I agree, it really is an uphill battle with this disorder. I remember how delighted I was, at 25, to find this sub and learn my life-long issue had a *name.* There is simply not enough awareness around this issue. Instead, the “picky eating” crowd really loves to dump on people like you or I for just existing. \n\nI’ve always explained it to my family this way: that meal you’re making there, that smells wonderful and makes my tummy rumble?? I’d love to eat it, really I would, but I can’t. The moment I put a bite of it into my mouth my throat seems to close, and I miraculously forget how to swallow. Then I am overrun with anxiety; the food that I wanted so desperately to eat is now turning to a weird mush in my mouth and triggering the gag reflex and oh, oh no, NO— I’m gagging. Now I have to spit the food out and feel ashamed.\n\nIt isn’t fun for us. It isn’t being “picky” or “spoiled.” It’s some sort of mental block. It is not fun to be belittled and mocked your entire life for something you cannot control.",
      "created_utc": 1654352193.0,
      "score": 11,
      "context": [
        {
          "id": "ib5574c",
          "author": "feyre_0001",
          "body": "This person seems to be pulling a power move, that or they are just totally unaware of how this ED has affected you throughout your life. \n\nI would drop this fight for now and, in the future, always say “oh I have something going on before (during the mealtime at the unsafe restaurant) but I’ll be able to stop by for drinks!” Don’t bring ARFID into the equation. As people spend more time around you and learn more about your habits, soon they’ll be better able to take them into account. \n\nIt took my best friends years to understand that my ARFID is both an eating disorder and a neurological one that is deeply rooted in anxiety. They don’t force me to eat anything I don’t want to- they will offer, but I am free to refuse. When I do try something and like it, they celebrate with me. When you finally find your people it feels amazing, you just have to be patient and deal with a lot of rude, obnoxious jerks first.",
          "created_utc": 1654347681.0
        },
        {
          "id": "ib55ssa",
          "author": "stumpyspice",
          "body": "I feel for some people you can try to explain as best as you can and provide source material for them too, and they will still lack empathy or an understanding. \n\nI just wish people would be more open minded.",
          "created_utc": 1654348087.0
        }
      ]
    },
    {
      "id": "ib5r23g",
      "author": "perelesnyk",
      "body": "The most effective explanation I've found actually came from this sub somewhere (I wish I had saved the comment, probably would be more articulate), but it's like if someone served you a plate of mud, and as much as you want to believe them that it tastes good, or to make them happy, and you see everyone else around you eating it--which leads to discomfort too, you just can't make yourself eat something that doesn't seem like food. Not a perfect explanation, but my son has ARFID and this metaphor has worked every time someone hasn't understood.",
      "created_utc": 1654360238.0,
      "score": 4,
      "context": [
        {
          "id": "ib5574c",
          "author": "feyre_0001",
          "body": "This person seems to be pulling a power move, that or they are just totally unaware of how this ED has affected you throughout your life. \n\nI would drop this fight for now and, in the future, always say “oh I have something going on before (during the mealtime at the unsafe restaurant) but I’ll be able to stop by for drinks!” Don’t bring ARFID into the equation. As people spend more time around you and learn more about your habits, soon they’ll be better able to take them into account. \n\nIt took my best friends years to understand that my ARFID is both an eating disorder and a neurological one that is deeply rooted in anxiety. They don’t force me to eat anything I don’t want to- they will offer, but I am free to refuse. When I do try something and like it, they celebrate with me. When you finally find your people it feels amazing, you just have to be patient and deal with a lot of rude, obnoxious jerks first.",
          "created_utc": 1654347681.0
        },
        {
          "id": "ib55ssa",
          "author": "stumpyspice",
          "body": "I feel for some people you can try to explain as best as you can and provide source material for them too, and they will still lack empathy or an understanding. \n\nI just wish people would be more open minded.",
          "created_utc": 1654348087.0
        }
      ]
    },
    {
      "id": "ib8os4g",
      "author": "osmith181",
      "body": "I used this excuse all the time. It deffo worked as an excuse and helped people understand but all it really did was provide an excuse to not get over my phobia of food",
      "created_utc": 1654427235.0,
      "score": 1,
      "context": [
        {
          "id": "ib5574c",
          "author": "feyre_0001",
          "body": "This person seems to be pulling a power move, that or they are just totally unaware of how this ED has affected you throughout your life. \n\nI would drop this fight for now and, in the future, always say “oh I have something going on before (during the mealtime at the unsafe restaurant) but I’ll be able to stop by for drinks!” Don’t bring ARFID into the equation. As people spend more time around you and learn more about your habits, soon they’ll be better able to take them into account. \n\nIt took my best friends years to understand that my ARFID is both an eating disorder and a neurological one that is deeply rooted in anxiety. They don’t force me to eat anything I don’t want to- they will offer, but I am free to refuse. When I do try something and like it, they celebrate with me. When you finally find your people it feels amazing, you just have to be patient and deal with a lot of rude, obnoxious jerks first.",
          "created_utc": 1654347681.0
        },
        {
          "id": "ib55ssa",
          "author": "stumpyspice",
          "body": "I feel for some people you can try to explain as best as you can and provide source material for them too, and they will still lack empathy or an understanding. \n\nI just wish people would be more open minded.",
          "created_utc": 1654348087.0
        },
        {
          "id": "ib5r23g",
          "author": "perelesnyk",
          "body": "The most effective explanation I've found actually came from this sub somewhere (I wish I had saved the comment, probably would be more articulate), but it's like if someone served you a plate of mud, and as much as you want to believe them that it tastes good, or to make them happy, and you see everyone else around you eating it--which leads to discomfort too, you just can't make yourself eat something that doesn't seem like food. Not a perfect explanation, but my son has ARFID and this metaphor has worked every time someone hasn't understood.",
          "created_utc": 1654360238.0
        }
      ]
    }
  ]
}