{
  "id": "v89lz7",
  "subreddit": "ARFID",
  "author": "MyBallsSuck",
  "created_utc": 1654752762.0,
  "title": "My boss announced he’s treating our team to an expensive fixed-menu sashimi dinner and I’m having a panic attack.",
  "selftext": "**Update: it miraculously worked out. Full update at the bottom of my post.**\n\nI’m an iOS developer flying out to San Francisco next week to meet my boss and team for the first time since I started my job 2 years ago. My boss has been telling us he’s “extremely excited” to treat us all to sushi. \n\nEven though I have ARFID this is normally not a problem, because at every sushi restaurant I’ve been to I can eat a California roll, a side of rice, or simply sit and sip on sake wine - things I can all tolerate. But I just learned that my boss is taking us to a small, intimate sushi restaurant with professional chefs that basically hand feed you 12 pieces of sashimi over 90 minutes on a fixed menu. He is basically renting their entire restaurant out for this.\n\nThis meal is around $150 per person and our team is about 10 people.\n\nI am fully panicking and I don’t know what to do. The last time I tried to eat sashimi I got a few pieces down before the texture and smell made me gag and almost vomit. Going to this dinner is not an option because if I don’t eat anything my boss will be charged $150+ dollars for me to sit there and not eat anything - which would also be extremely embarrassing.\n\nI called the restaurant to ask if they do substitutions and they said they don’t, so that’s also not an option. They are very “authentic” aka inflexible.\n\nOption 1: I tell my boss I can’t attend and ask him to not rebook the dinner. I explain to him I have a dietary restriction and that I’ll meet him and the team afterwards to grab drinks. Unfortunately because my boss is such a nice person I am almost 100% certain he will rebook the whole thing (despite himself being so excited for this meal) and I fear that the whole team (and my boss) will secretly hate me. I am worried that everyone will be upset with me - I’ll be denying them all this amazing private, sushi dinner experience. I don’t think I could live with myself if that happened. \n\nOption 2: I fake a stomach illness the day of and say I can’t go to dinner. The downside here is that I’m lying, and my boss will be charged a $50 no show fee for me (if he doesn’t give my spot to someone else in the office) but this is cheaper than $150. I know this will not feel great for me mentally (getting to miss out on another thing because I have an eating disorder), but at least everyone will get their amazing dinner and I can sit in my hotel room for 6 hours pretending to be sick.\n\n/r/ARFID please help me out - what would you do in this situation? I’m panicking so, so bad - I am panicking so much I haven’t been able to work or function since I found out about this dinner 2 days ago. I am crying so hard I haven’t been able to turn on my zoom camera during the work day on calls. I know this sounds insane, but I had extensive family shaming and guilt growing up for being picky and it hurts so much. I’m so distraught I’m considering not going to San Francisco at all anymore and pretending I have Covid. \n\nARFID has ruined my fucking life.\n\n**Update: it worked out.** I told my boss honestly and said I’d like to respectfully bow out of dinner because of a dietary restriction and let the team enjoy the amazing experience he had planned. \n\nHe was understanding and said he regretted not asking for dietary restrictions (it’s standard procedure). He said he’d really prefer to keep the team together for dinner but would respect my wishes. \n\nTo my surprise - he gave me an optional plan: he said he can always go to the sashimi restaurant for lunch on a different day during the trip (lunches are optional affairs) and he could simply rebook the dinner at a different highly-reviewed restaurant that was also a favorite of his with a private chef table experience. He also said he’d tell a small lie about the sashimi restaurant calling and cancelling on him so the team wouldn’t know it was me with the restriction. He said it was up to me if I wanted to take him up on it.\n\nSo I decided to take him up on it. \n\nThe new restaurant looks awesome. Also three people on my team have already expressed they’re more excited for this new restaurant than the sashimi one! Wow! I guess it all worked out. I would not have sent the message to my boss without Reddit’s encouragement. Thanks Reddit. 🧡",
  "url": "https://www.reddit.com/r/ARFID/comments/v89lz7/my_boss_announced_hes_treating_our_team_to_an/",
  "score": 143,
  "num_comments": 29,
  "comments": [
    {
      "id": "ibpeiqq",
      "author": "jo-nee",
      "body": "I think honesty is your best policy here. Drop him an email explaining that you have quite specific dietary needs and don't want to waste his money. Add that you know everyone else is really looking forward to it so you're happy to meet them afterwards. \n\nOtherwise find a human dumpster in the team who can eat $300 worth of sashimi and make sure you sit next to them",
      "created_utc": 1654757551.0,
      "score": 139,
      "context": []
    },
    {
      "id": "ibpi8eb",
      "author": "SecretSquirrelSpot",
      "body": "There’s no way I’d be eating that. Just tell them you have an eating disorder and can’t eat fish. \n\nWould you force someone to eat extra spicy food just because you like it? The answer is always no. Why should people expect you to eat something they like? I’m sure they will understand. \n\nIf you don’t communicate you are suffering in silence and that’s only hurting yourself while they all have a merry old time eating what can only be described as an abomination of food",
      "created_utc": 1654760833.0,
      "score": 37,
      "context": []
    },
    {
      "id": "ibq2dnr",
      "author": "eaterofgoldenfish",
      "body": "I agree that in this case, honesty is your best bet. Even in the worst case scenario in option #1 where he rebooks the whole thing (which isn't a guarantee) - if the scenario was reversed, and there was a dinner you were excited for that consisted only of peanuts but someone on the team had a peanut allergy, would you resent them? It's not reasonable to be mad at someone about things they can't control. Tell him the truth, tell him you're sorry, tell him you don't want him to rebook it but you'd feel more comfortable meeting up afterwards for drinks and then believe what he tells you when he says he's sorry and he wants you to feel included and anything else. It sucks, but I think this is mostly an issue of shame on your part (and believe me, I know it sucks, big big time). Go to San Francisco. Don't let ARFID take this from you. Play it clean. Tell the truth. The consequences won't be that bad. Workplaces have accommodations for things like this.",
      "created_utc": 1654777307.0,
      "score": 21,
      "context": []
    },
    {
      "id": "ibqvdpk",
      "author": "scoophog",
      "body": "Be honest. You know lying about this will increase your anxiety. \n\nIn your own words, say something like:\n\n“thank you for organizing this team event, it is very gracious of you and I’m looking forward to it. However, I wanted to discuss something with you before we go. I wasn’t planning on sharing this with anyone but I privately deal with a very particular dietary restriction that would make this particular dish difficult to consume. I called the restaurant to see if any substitutions can be made but unfortunately they said no. I wouldn’t want anyone to spend $150 on my seat when I cannot eat the dish. Again, I’m very grateful that we can do this together. Do you have any ideas of how to navigate this situation? This is part of my daily life so I am happy to attend without eating, arrange to eat prior or even meet you all afterwards for drinks. My intention and expectation is not to cancel or reschedule this but I would love to participate. Hopefully we can find a solution together.”\n\nThis touches on your disorder without being specific (no one understands anyway, it’s your business), it lets your boss know you’re excited to go and that not eating is totally okay with you as to not disturb the plans, that you’ve already been proactive in finding solutions & and that you’re inviting them to help you navigate the problem.",
      "created_utc": 1654790946.0,
      "score": 18,
      "context": []
    },
    {
      "id": "ibpldkn",
      "author": "jclom0",
      "body": "Do they know you eat fish? If not, just say you’re allergic. I use this all the time to avoid awkward situations. Also, sashimi is not for everyone even if you don’t have ARFID so it wouldn’t be awful to just say you do not want to eat raw fish. Like, thanks for doing something nice for the tram but not for you.",
      "created_utc": 1654763816.0,
      "score": 21,
      "context": []
    },
    {
      "id": "ibqf0xh",
      "author": "None",
      "body": "Uff I don't have ARFID but this sounds like hell, why would anyone want to have someone else choose their food for them and be in a situation where it's rude to not eat it if you don't like it!? Maybe if *they* paid *me* large amounts of money.. but not 150 dollars that wouldn't be enough.\n\nSo with ARFID I can imagine how much horrible this already horrible thing would be, I just want you to know this isn't even an ARFID-only issue, it is perfectly reasonable not to want to do this and that is an absolutely terrible business model for that restaurant. Lots of people hate sushi too, I bet a lot of people are dreading this but don't want to be impolite\n\nmy intention with this post is to provide genuine validation, I don't have any advice, it's an awful situation",
      "created_utc": 1654783890.0,
      "score": 6,
      "context": []
    },
    {
      "id": "ibpmh6a",
      "author": "ShabuShabu2018",
      "body": "Can you say you’ve had a previously very bad reaction to sushi / sashimi and that you absolutely want to be there for this team meal and you would be more than happy to have edamame beans, sushi rice and sake? I doubt the restaurant wouldn’t accommodate such simple requests for the price being paid?",
      "created_utc": 1654764868.0,
      "score": 16,
      "context": []
    },
    {
      "id": "ibp90zn",
      "author": "Thomas_Raith",
      "body": "Can you tell him you have an allergy or has he seen/heard of you eating fish before. I can’t eat seafood at all and always just say I have an allergy if we’re getting sushi.",
      "created_utc": 1654753226.0,
      "score": 7,
      "context": []
    },
    {
      "id": "ibs4971",
      "author": "MrsJack14",
      "body": "This is a horrible dinner decision your boss made. Not everyone likes seafood let alone raw seafood; Afrid or not.",
      "created_utc": 1654810103.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ibqaz88",
      "author": "NewAccWhoDis93",
      "body": "I'm really sorry about this and its extremly frustrating and people dont think about eating disorders.\n\n&#x200B;\n\ni think you have 2 options\n\n&#x200B;\n\n1. One hour before the dinner say there is a family emergency and offer to cover the no show fee.\n2. email him privately thanking him for his generosity but say you are unable to attend due to you being allergic to seafood (more common and ARFID)",
      "created_utc": 1654781949.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ibqn93x",
      "author": "nomoreadminspls",
      "body": "I've had nearly this exact situation in SF no less. Just be upfront, if your boss is truly kind and reasonable he will understand. \n\nIn my experience, most people are very understanding about arfid, those that aren't are usually deeply unpleasant even awful people.",
      "created_utc": 1654787516.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ibt192i",
      "author": "jouledog",
      "body": "Your update makes me incredibly happy. Sounds like he’s a great boss and you are a valued member of the team!",
      "created_utc": 1654826248.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ibqj86t",
      "author": "TyNyeTheTransGuy",
      "body": "Wow. This sucks. I’m so sorry. \n\nI agree with other people, tell the truth, or the sort-of-truth. If you’d prefer to say it’s an allergy (intolerance is probably a better bet) that’s fine but remember that you need to keep up that lie basically forever.\n\nEdit: also… what the fuck is this restaurant? “Here’s some fish we cut real good. That’s $150.” Like I get private bookings like that are $$$ so I guess that’s the majority of the cost, but still, just sashimi would not impress me at any restaurant. “Look how well we didn’t cook this” like what? You didn’t make that the ocean did.",
      "created_utc": 1654785779.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ibphv57",
      "author": "Roothytooth",
      "body": "Tell the boss that you really appreciate the generous offer of the meal but that you have an eating disorder and eating with others is very distressing to you. It’s painful but if you tell it all truthfully he won’t put you through’can you eat here? Could you eat there?’ endlessly trying to rearrange which would be embarrassing. Also it’s done then and you’ve established that you do work drinks but not work food and you hopefully don’t have to explain yourself again at least to this boss.",
      "created_utc": 1654760495.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ibpcudm",
      "author": "Calypso257",
      "body": "Is there any way you could bring your own food ? I think if this is stressing you out this much to the point that you can't function I wouldn't go to San Francisco at all it could be a huge trigger an your mental health an safety is worth more than a stupid expensive dinner it's okay to not go to things like this I know ARFID is  a pain an it feels like it has destroyed your life but if you focus more on caring for your needs you'll feel better than you would if you put yourself in this stressful situation",
      "created_utc": 1654756187.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l5jzp36",
      "author": "Forsaken-Student-396",
      "body": "THATS WHY GOD TOLD US TO TELL THE TRUTH. SEEK THE LORD.",
      "created_utc": 1716600433.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ibp9cam",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1654753459.0,
      "score": -1,
      "context": []
    },
    {
      "id": "ibqxr40",
      "author": "victorious-turnip",
      "body": "This sucks and I’m sorry you have to deal with it. I’ve been in a similar situation (not sushi but generically fancy food) and what I did was email my boss and ask for a meeting and then when we were face to face I let her know that I have “long-term” stomach/gastro issues and I follow a strict diet to mitigate its effects. I told her that the foods I couldn’t eat were not her responsibility and that I was happy she included me but I didn’t want to waste company money or force them to change their plans since the rest of the team was really looking forward to it. I also said I didn’t want to miss out on team building time so I think the best option would be to give my meal service to someone on the team who could appreciate it without consequence and I would join and either bring my own meal or order off the regular menu. (I don’t drink either so maybe you could enjoy drinks too?). \n\nShe appreciated the heads up and invited one of the other managers in my place and had me look at the menu and called ahead to let them know I would be having a regular entree (it was fancy steak and it was awesome) and someone else would fill my place in the booking. I think it ended up costing her extra for the price of my meal but she was really kind about it and my coworkers were understanding. I did get some comments like “wow I wish you could taste this!” But I just deflected to something else. A question about a weird topping or smile and ask if they’ve had something similar before. People prefer to talk about themselves - use that. \n\nI managed through it and I got some good face time in with everyone, and if you’re feeling bold about any of it you can always ask to try a bite of a coworkers to “get the taste without the consequences” and if it’s awful try not to make a face. Turns out I like mushroom risotto if it’s prepared very, very well. \n\nAlternatively tell them you’re allergic to seafood and baaaail. Good luck either way!! You can do it!",
      "created_utc": 1654791943.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ibr7jb9",
      "author": "Chagdoo",
      "body": "You said he's nice right? Why not tell him about your disorder? Hell pull it up on Google and let him read a bit. \n\nAfter that suggest he give your seat to someone else. I'm sure there's someone in the world who would love a free sushi dinner",
      "created_utc": 1654796032.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ibrvasm",
      "author": "SubzeroNYC",
      "body": "You need to be up front with your boss and tell him you have an actual medical disorder.  This isn't \"picky eating.\"",
      "created_utc": 1654806194.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ibs72bi",
      "author": "runfattiesrun",
      "body": "Last option is so smart! Or even give everyone a piece of yours",
      "created_utc": 1654811369.0,
      "score": 9,
      "context": [
        {
          "id": "ibpeiqq",
          "author": "jo-nee",
          "body": "I think honesty is your best policy here. Drop him an email explaining that you have quite specific dietary needs and don't want to waste his money. Add that you know everyone else is really looking forward to it so you're happy to meet them afterwards. \n\nOtherwise find a human dumpster in the team who can eat $300 worth of sashimi and make sure you sit next to them",
          "created_utc": 1654757551.0
        }
      ]
    },
    {
      "id": "ibsqzqb",
      "author": "MyBallsSuck",
      "body": "I decided to do this - being honest. It was the right call, and it all worked out. I added the full update above in my post.",
      "created_utc": 1654821083.0,
      "score": 3,
      "context": [
        {
          "id": "ibpeiqq",
          "author": "jo-nee",
          "body": "I think honesty is your best policy here. Drop him an email explaining that you have quite specific dietary needs and don't want to waste his money. Add that you know everyone else is really looking forward to it so you're happy to meet them afterwards. \n\nOtherwise find a human dumpster in the team who can eat $300 worth of sashimi and make sure you sit next to them",
          "created_utc": 1654757551.0
        }
      ]
    },
    {
      "id": "ibqg24c",
      "author": "kfilks",
      "body": "I agree with this - tell your boss, but keep the details minimal. Assuming you're fine with not eating - I would just tell him the above that you don't eat fish or that this restaurant doesn't meet your dietary needs, but you know how excited the group is so you're happy to attend and you are wondering if it might be possible to just attend and not eat. (I run events for a living so It should be something fairly commonplace for the restaurant to have requests like this.)\n\n\nI've done that at a bunch of dinners, the wait staff looks at you weird for 2 seconds when you first say it and then they keep it moving - but they have no way of knowing that you didn't have another dinner right beforehand. The other alternative is to make up that you have some dinner plans beforehand, but obviously given this situation and the amount of heads up I don't think that's the best move.",
      "created_utc": 1654784362.0,
      "score": 16,
      "context": [
        {
          "id": "ibpi8eb",
          "author": "SecretSquirrelSpot",
          "body": "There’s no way I’d be eating that. Just tell them you have an eating disorder and can’t eat fish. \n\nWould you force someone to eat extra spicy food just because you like it? The answer is always no. Why should people expect you to eat something they like? I’m sure they will understand. \n\nIf you don’t communicate you are suffering in silence and that’s only hurting yourself while they all have a merry old time eating what can only be described as an abomination of food",
          "created_utc": 1654760833.0
        }
      ]
    },
    {
      "id": "ibqb634",
      "author": "NewAccWhoDis93",
      "body": "this is the best course of action. My friends know (Im picky) but when it comes so seafood i just say im allergic and they accept it.",
      "created_utc": 1654782042.0,
      "score": 9,
      "context": [
        {
          "id": "ibpldkn",
          "author": "jclom0",
          "body": "Do they know you eat fish? If not, just say you’re allergic. I use this all the time to avoid awkward situations. Also, sashimi is not for everyone even if you don’t have ARFID so it wouldn’t be awful to just say you do not want to eat raw fish. Like, thanks for doing something nice for the tram but not for you.",
          "created_utc": 1654763816.0
        }
      ]
    },
    {
      "id": "ibqf87w",
      "author": "None",
      "body": "this is my favorite idea",
      "created_utc": 1654783983.0,
      "score": 3,
      "context": [
        {
          "id": "ibpmh6a",
          "author": "ShabuShabu2018",
          "body": "Can you say you’ve had a previously very bad reaction to sushi / sashimi and that you absolutely want to be there for this team meal and you would be more than happy to have edamame beans, sushi rice and sake? I doubt the restaurant wouldn’t accommodate such simple requests for the price being paid?",
          "created_utc": 1654764868.0
        }
      ]
    },
    {
      "id": "ibs2jrd",
      "author": "frozenchocolate",
      "body": "The post says they already called the restaurant and were told there are no substitutions on a fixed menu.",
      "created_utc": 1654809345.0,
      "score": 2,
      "context": [
        {
          "id": "ibpmh6a",
          "author": "ShabuShabu2018",
          "body": "Can you say you’ve had a previously very bad reaction to sushi / sashimi and that you absolutely want to be there for this team meal and you would be more than happy to have edamame beans, sushi rice and sake? I doubt the restaurant wouldn’t accommodate such simple requests for the price being paid?",
          "created_utc": 1654764868.0
        }
      ]
    },
    {
      "id": "ibql1wp",
      "author": "None",
      "body": "I would absolutely not tell your boss that you have an eating disorder, but rather very specific dietary restrictions. Unfortunately sharing an ED is very stigmatized and tbh no one from work needs to or should know about it",
      "created_utc": 1654786568.0,
      "score": 9,
      "context": [
        {
          "id": "ibphv57",
          "author": "Roothytooth",
          "body": "Tell the boss that you really appreciate the generous offer of the meal but that you have an eating disorder and eating with others is very distressing to you. It’s painful but if you tell it all truthfully he won’t put you through’can you eat here? Could you eat there?’ endlessly trying to rearrange which would be embarrassing. Also it’s done then and you’ve established that you do work drinks but not work food and you hopefully don’t have to explain yourself again at least to this boss.",
          "created_utc": 1654760495.0
        }
      ]
    },
    {
      "id": "ibqflea",
      "author": "kfilks",
      "body": "With all due respect, we're talking about a nice restaurant and a business dinner it would hardly be appropriate for them to bring their own food and that doesn't actually solve any of the problems they're listing here. As a fellow professional who has to go to a lot of dinners like this, I would not recommend that approach at all.",
      "created_utc": 1654784151.0,
      "score": 10,
      "context": [
        {
          "id": "ibpcudm",
          "author": "Calypso257",
          "body": "Is there any way you could bring your own food ? I think if this is stressing you out this much to the point that you can't function I wouldn't go to San Francisco at all it could be a huge trigger an your mental health an safety is worth more than a stupid expensive dinner it's okay to not go to things like this I know ARFID is  a pain an it feels like it has destroyed your life but if you focus more on caring for your needs you'll feel better than you would if you put yourself in this stressful situation",
          "created_utc": 1654756187.0
        }
      ]
    },
    {
      "id": "ibp9lfo",
      "author": "MyBallsSuck",
      "body": "It’s a fixed course meal - I can’t choose what they serve me unfortunately. It’s all sashimi.",
      "created_utc": 1654753650.0,
      "score": 6,
      "context": [
        {
          "id": "ibp9cam",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1654753459.0
        }
      ]
    },
    {
      "id": "ibvql86",
      "author": "ShabuShabu2018",
      "body": "I saw that - from my experience, if a call for changes in menu comes from the person organising / paying than the restaurants are usually much more accommodating!",
      "created_utc": 1654883462.0,
      "score": 1,
      "context": [
        {
          "id": "ibpmh6a",
          "author": "ShabuShabu2018",
          "body": "Can you say you’ve had a previously very bad reaction to sushi / sashimi and that you absolutely want to be there for this team meal and you would be more than happy to have edamame beans, sushi rice and sake? I doubt the restaurant wouldn’t accommodate such simple requests for the price being paid?",
          "created_utc": 1654764868.0
        },
        {
          "id": "ibs2jrd",
          "author": "frozenchocolate",
          "body": "The post says they already called the restaurant and were told there are no substitutions on a fixed menu.",
          "created_utc": 1654809345.0
        }
      ]
    }
  ]
}