{
  "id": "wjo8hh",
  "subreddit": "ARFID",
  "author": "daisychain_toker",
  "created_utc": 1660003002.0,
  "title": "I did shrooms on the weekend and I can finally eat.",
  "selftext": "I never considered how psilocybin could help with ARFID until I got the chance to trip with a good friend for the first time. For context- I believe I’ve had ARFID for my entire 24 years. I had very few safe foods and prior to my trip I was eating 3 safe foods and spiralling pretty much everyday. I actually wanted to do shrooms to help with my depression but decided to set an intention to deal with ARFID right before drinking the tea. That itself was so hard because I have never been able to eat mushrooms and I was crying while we were making it and telling my friend I couldn’t but I powered through. \n\nAnyways, on my trip my friend offered me blueberries and fed them to me. And I tasted them for the first time. It was incredible. And somehow I ended up naked in the bathtub with cherry tomatoes and blueberries and cucumbers and I was squishing them and eating them and rubbing food on my body. And I looked in the mirror and saw myself as a skeleton and dead because I had never been able to nourish my body. \n\nMy friend made me pea soup- I’ve never been able to eat it before but I did while high and it was amazing. And now two days later I have tried so many new foods and am snacking and eating new meals. I actually can’t believe it. I really hope there is more research on psilocybin and eating disorders because this shift would have never happened without their help. I feel brand new and excited to eat for the first time in my life. \n\nCurious if anyone else has successfully treated ARFID with the help of shrooms.",
  "url": "https://www.reddit.com/r/ARFID/comments/wjo8hh/i_did_shrooms_on_the_weekend_and_i_can_finally_eat/",
  "score": 165,
  "num_comments": 45,
  "comments": [
    {
      "id": "ijivpbi",
      "author": "5MoK3",
      "body": "Food looks even more disgusting to me when im tripping. But I wonder if that was just the anxiety showing me what i expected whenever food has popped up. I've never went in with those intentions, i'll have to try on my next trip.\n\nHappy for you",
      "created_utc": 1660009732.0,
      "score": 31,
      "context": []
    },
    {
      "id": "ijj0k84",
      "author": "Princess_Queen",
      "body": "I'm so happy for you, that's incredible. Experiencing things for the first time like that in a positive way sounds fantastic.",
      "created_utc": 1660011805.0,
      "score": 9,
      "context": []
    },
    {
      "id": "ijkkdpf",
      "author": "ripyourlungsdave",
      "body": "I've got about a quarter ounce of mushrooms in my room. I'm waiting for the right night for a full-on experience. \n\nBut every single time I do it, which is usually once or twice a year, I not only feel mentally better for months afterwards, I usually am able to get two meals down a day for almost a month. Which is incredible.\n\nMushrooms have an incredible effect on our physiology. And I'm glad it's finally starting to get some of the medical attention it deserves.",
      "created_utc": 1660047812.0,
      "score": 10,
      "context": []
    },
    {
      "id": "ijkpvg8",
      "author": "FuriousFireyFeline",
      "body": "That was honestly one of the most amazing things I've read",
      "created_utc": 1660050527.0,
      "score": 9,
      "context": []
    },
    {
      "id": "ijjb5k6",
      "author": "games820",
      "body": "I wanna try them so bad. But I'm not sure I can even eat them.",
      "created_utc": 1660016794.0,
      "score": 7,
      "context": []
    },
    {
      "id": "ijl4crc",
      "author": "dj_norvo",
      "body": "So happy for you. I love this sense of play and curiosity that was opened up.",
      "created_utc": 1660056632.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ijl5bxz",
      "author": "peanutbutter2112",
      "body": "I had a very similar experience. It’s almost like tripping let me get out of my own head for a few hours, and I “realized” lots of things that I logically knew in my head but my ego wouldn’t let me internalize. For example I “realized” that my “unsafe” foods aren’t actually unsafe, and there is nothing really different about them. The real work comes after the trip though. Tripping definitely helps, but when you come down you’re faced with the same challenges as before and you need to learn how to use your new knowledge.\n\nIdk if anyone can relate to this, but whenever I trip or even smoke a lot of weed I find processed food gross. Then I kinda crave vegetables and I’m driven to try more of them.",
      "created_utc": 1660057006.0,
      "score": 6,
      "context": []
    },
    {
      "id": "ijm56kk",
      "author": "MelonElbows",
      "body": "Is this possible without the nudity?  🤣",
      "created_utc": 1660070430.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ijjjmij",
      "author": "NECROM4NCY",
      "body": "this is so interesting, I HATE the taste of shrooms and edibles but i will eat it and power through for the trip,,, but trying different food textures and flavors is out of the question\nI’ll have to try eating while tripping and see if it makes a difference",
      "created_utc": 1660021538.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ijkznja",
      "author": "annualcereal",
      "body": "Wow! I’m so grateful to have seen this post. Thank you SO much for sharing! I hope you continue to integrate and find relief. Can I ask how much you consumed for this trip?",
      "created_utc": 1660054762.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ijna2c5",
      "author": "sharkprincefishstick",
      "body": "I’ve never tried shrooms, but weed helps TREMENDOUSLY. One 5-10mg gummy bear will have me eating more calories in an hour than I ate the month previous. It’s amazing and pretty much the only reason I haven’t withered away to dust.",
      "created_utc": 1660086507.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ijlbxuz",
      "author": "Celeste_Minerva",
      "body": "This is a gorgeous post, thank you",
      "created_utc": 1660059563.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ijneiup",
      "author": "Bromo_Bro",
      "body": "This is very encouraging. On an ARFID dietitian AMA, I asked about anxiolytic/intoxicants as a nexus to try different foods and this seems to support that idea. I agree that I think you have to want to try different things or be offered them otherwise there’s no impetus to change. I’d be curious to know if this inclination to try new foods lasts or is temporary.",
      "created_utc": 1660088438.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ijmodej",
      "author": "dolores_h4ze",
      "body": "that’s amazing 🤩",
      "created_utc": 1660077740.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ijqqx1j",
      "author": "starrazei",
      "body": "this sounds beautiful and amazing and I’m so happy for you. I’ve been thinking about taking some mushrooms recently and this post made me decide I really need to. I’ve tripped before but food has always been inedible to me while tripping. I think if I set intentions like you did, that could really change and I could possibly experience something great and get some type of break thru cuz I’ve been struggling so much with my arfid and I am ready to heal from it and move on",
      "created_utc": 1660151649.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iswdh6d",
      "author": "SachiKaM",
      "body": "I MDd for fun but not even considering ARFID. When I caught myself in the kitchen at 730pm making avocado toast after week 5 of trail mix only something clicked.. something really clicked 🥹",
      "created_utc": 1666153961.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ijiz6vb",
      "author": "daisychain_toker",
      "body": "I think if I had gone in without the intention of dealing with it I wouldn’t have been able to eat. And it helped that my trip buddy was also working through food and body stuff and we talked about it a lot and she was really gentle with me. I’m curious if things will start to creep back but for now I’m enjoying this change.",
      "created_utc": 1660011222.0,
      "score": 29,
      "context": [
        {
          "id": "ijivpbi",
          "author": "5MoK3",
          "body": "Food looks even more disgusting to me when im tripping. But I wonder if that was just the anxiety showing me what i expected whenever food has popped up. I've never went in with those intentions, i'll have to try on my next trip.\n\nHappy for you",
          "created_utc": 1660009732.0
        }
      ]
    },
    {
      "id": "ijj9to0",
      "author": "brando56894",
      "body": "I can never eat on LSD. food feels odd in my mouth, like I'm hyper aware of the bolus of food.",
      "created_utc": 1660016122.0,
      "score": 7,
      "context": [
        {
          "id": "ijivpbi",
          "author": "5MoK3",
          "body": "Food looks even more disgusting to me when im tripping. But I wonder if that was just the anxiety showing me what i expected whenever food has popped up. I've never went in with those intentions, i'll have to try on my next trip.\n\nHappy for you",
          "created_utc": 1660009732.0
        }
      ]
    },
    {
      "id": "ijje1lw",
      "author": "666Skittles",
      "body": "Me too, both acid and shrooms makes my appetite disappear, and if I’m having visuals then all food looks like it’s crawling with maggots. But everyone is different, and I’m stoked OP had this experience!",
      "created_utc": 1660018325.0,
      "score": 4,
      "context": [
        {
          "id": "ijivpbi",
          "author": "5MoK3",
          "body": "Food looks even more disgusting to me when im tripping. But I wonder if that was just the anxiety showing me what i expected whenever food has popped up. I've never went in with those intentions, i'll have to try on my next trip.\n\nHappy for you",
          "created_utc": 1660009732.0
        }
      ]
    },
    {
      "id": "ijj5uwh",
      "author": "daisychain_toker",
      "body": "I kept saying that it felt like I was a baby trying food for the first time. Thank you! I really hope more research about this drug comes out, it’s so life changing.",
      "created_utc": 1660014188.0,
      "score": 7,
      "context": [
        {
          "id": "ijj0k84",
          "author": "Princess_Queen",
          "body": "I'm so happy for you, that's incredible. Experiencing things for the first time like that in a positive way sounds fantastic.",
          "created_utc": 1660011805.0
        }
      ]
    },
    {
      "id": "ijke55x",
      "author": "Blujay12",
      "body": "dice them up, kinda like you're chopping up onions, small maybe 2cm cubes,  make a regular cup of tea, while it's still pretty hot, steep them for at least 10 minutes, in some kind of filter (if you're into tea you probably already have one of those mesh cases for loose solid teas, cheesecloth or some other regular solutions work, etc).\n\nDepending on how strong your preferred drink/tea is, you might want to add some more sugar, honey, etc. But overall, you can't even taste it and it actually works even better, and hits faster.\n\nWould recommend, as someone who also hates mushrooms (foodwise).",
      "created_utc": 1660044256.0,
      "score": 10,
      "context": [
        {
          "id": "ijjb5k6",
          "author": "games820",
          "body": "I wanna try them so bad. But I'm not sure I can even eat them.",
          "created_utc": 1660016794.0
        }
      ]
    },
    {
      "id": "ijjgmg9",
      "author": "5MoK3",
      "body": "Making them into a tea is much easier. Its still kinda gross but I prefer to just chug a quick glass. I've never done it but people sometimes add stuff to the tea for the taste, like honey or whatever (idk anything about regular tea).\n\nYou could also do capsules but you might have to take a handful.",
      "created_utc": 1660019759.0,
      "score": 8,
      "context": [
        {
          "id": "ijjb5k6",
          "author": "games820",
          "body": "I wanna try them so bad. But I'm not sure I can even eat them.",
          "created_utc": 1660016794.0
        }
      ]
    },
    {
      "id": "ik43u6w",
      "author": "s_v_m4040",
      "body": "I was scared too, but I chopped them up really fine and mixed them through some vanilla and chocolate flavoured yogurt and drank some tea to get rid of the aftertaste. I could barely taste/notice the shrooms, so it worked really well for me!\n\nI know that you’re not really meant to eat sugary foods when taking shrooms, but I didn’t feel like it made a difference during my trip.",
      "created_utc": 1660387536.0,
      "score": 2,
      "context": [
        {
          "id": "ijjb5k6",
          "author": "games820",
          "body": "I wanna try them so bad. But I'm not sure I can even eat them.",
          "created_utc": 1660016794.0
        }
      ]
    },
    {
      "id": "ijne3ah",
      "author": "daisychain_toker",
      "body": "Thank you! Me too!!",
      "created_utc": 1660088246.0,
      "score": 1,
      "context": [
        {
          "id": "ijl4crc",
          "author": "dj_norvo",
          "body": "So happy for you. I love this sense of play and curiosity that was opened up.",
          "created_utc": 1660056632.0
        }
      ]
    },
    {
      "id": "ijndpyj",
      "author": "daisychain_toker",
      "body": "Probably! I brought a swim suit, but my high self decided against it in the last moment hahaha",
      "created_utc": 1660088086.0,
      "score": 3,
      "context": [
        {
          "id": "ijm56kk",
          "author": "MelonElbows",
          "body": "Is this possible without the nudity?  🤣",
          "created_utc": 1660070430.0
        }
      ]
    },
    {
      "id": "ijl34fk",
      "author": "daisychain_toker",
      "body": "I think the biggest thing was setting an intention to overcome this. I probably wouldn’t have been able to eat had I not gone in wanting to find the root of my issues with food.",
      "created_utc": 1660056155.0,
      "score": 3,
      "context": [
        {
          "id": "ijjjmij",
          "author": "NECROM4NCY",
          "body": "this is so interesting, I HATE the taste of shrooms and edibles but i will eat it and power through for the trip,,, but trying different food textures and flavors is out of the question\nI’ll have to try eating while tripping and see if it makes a difference",
          "created_utc": 1660021538.0
        }
      ]
    },
    {
      "id": "ijl2tys",
      "author": "daisychain_toker",
      "body": "I did around 4g! If you give it a go, I’d love to hear how it goes for you.",
      "created_utc": 1660056041.0,
      "score": 2,
      "context": [
        {
          "id": "ijkznja",
          "author": "annualcereal",
          "body": "Wow! I’m so grateful to have seen this post. Thank you SO much for sharing! I hope you continue to integrate and find relief. Can I ask how much you consumed for this trip?",
          "created_utc": 1660054762.0
        }
      ]
    },
    {
      "id": "ijndxn0",
      "author": "daisychain_toker",
      "body": "I am an avid stoner and while it helps, it’s never let me try NEW food. And it’s usually junk. I wasn’t ever able to eat fruit because of how much the texture can be unpredictable and I’ve been eating nectarines and cherries and blueberries the past few days. I was never able to try them before!!",
      "created_utc": 1660088178.0,
      "score": 3,
      "context": [
        {
          "id": "ijna2c5",
          "author": "sharkprincefishstick",
          "body": "I’ve never tried shrooms, but weed helps TREMENDOUSLY. One 5-10mg gummy bear will have me eating more calories in an hour than I ate the month previous. It’s amazing and pretty much the only reason I haven’t withered away to dust.",
          "created_utc": 1660086507.0
        }
      ]
    },
    {
      "id": "ijnib3m",
      "author": "daisychain_toker",
      "body": "I’m very curious too. From the research I’ve done (nothing extensive) psilocybin opens the brain up to reword neural pathways. But also after that first experience, I know that I will continue to use psilocybin throughout my life because the healing is so intense. I have no drive to really go on my phone except for when I have a reason to, I’m feeling inspired to draw and listen to music again after a prolonged bout of depression, and my days are feeling way less overwhelming and the only change was doing shrooms. On antidepressants my symptoms go away but I’m never able to change my habits and the loop just continues endlessly.",
      "created_utc": 1660090106.0,
      "score": 2,
      "context": [
        {
          "id": "ijneiup",
          "author": "Bromo_Bro",
          "body": "This is very encouraging. On an ARFID dietitian AMA, I asked about anxiolytic/intoxicants as a nexus to try different foods and this seems to support that idea. I agree that I think you have to want to try different things or be offered them otherwise there’s no impetus to change. I’d be curious to know if this inclination to try new foods lasts or is temporary.",
          "created_utc": 1660088438.0
        }
      ]
    },
    {
      "id": "ijj107k",
      "author": "jtreasure1",
      "body": "That sounds amazing. What a great friend to have, hope your results stick 🙂",
      "created_utc": 1660011999.0,
      "score": 9,
      "context": [
        {
          "id": "ijivpbi",
          "author": "5MoK3",
          "body": "Food looks even more disgusting to me when im tripping. But I wonder if that was just the anxiety showing me what i expected whenever food has popped up. I've never went in with those intentions, i'll have to try on my next trip.\n\nHappy for you",
          "created_utc": 1660009732.0
        },
        {
          "id": "ijiz6vb",
          "author": "daisychain_toker",
          "body": "I think if I had gone in without the intention of dealing with it I wouldn’t have been able to eat. And it helped that my trip buddy was also working through food and body stuff and we talked about it a lot and she was really gentle with me. I’m curious if things will start to creep back but for now I’m enjoying this change.",
          "created_utc": 1660011222.0
        }
      ]
    },
    {
      "id": "ikvws5t",
      "author": "annualcereal",
      "body": "I need to thank you again. I’m stunned. Since Saturday, I have:\n- Eaten the first salad of my life \n- Successfully tried at least 50 news foods (I stopped counting at 50!) \n- Haven’t gagged, wanted to throw up, or felt like I made a serious mistake in trying these foods \n- Learned I love chunky salsa, honeycrisp apples, prosciutto, massaman curry, tofu, hard rice instead of just sticky rice, peanut butter (crunchy or creamy), chunky fig jam, cabbage (!), plums, nectarines, avocados, mayo, carne asada, and sooo much more \n- Experienced food smells completely differently! All fresh fruits used to smell like decay and mold. I haven’t experienced that even once since Saturday. Fruit smells GOOD! This is the strangest part!! \n\nI still have a fear of new foods when I consider eating them. But that’s 100% about thought patterns and past experiences. Once I try the foods, nothing is wrong. I’m just eating. \n\nI set my intention as “Goodbye ARFID.” I’ve done food therapy for years and I’m confident the skills I’ve built in therapy are helping me eat these new foods every meal. But therapy alone would not have gotten me here. I’ve tried more foods this week than in my entire adult life. On Saturday I had an eating disorder. Now I don’t. \n\nAlso: I’m on an SSRI and feel confident that dulled the effects. But it still worked. My sweet husband was my trip sitter. I followed the Johns Hopkins study design closely for a safe set and setting. \n\nI feel like I have a chance to be healthy and happy. I already feel like a happy child with every food I’m trying for the first time. Only one of these foods was unpleasant for me - and I still ate it without gagging or spitting it out. I’m learning that people without eating disorders have valid food preferences like this! \n\nI’m in disbelief and want to help more people with ARFID understand our experiences! And I want to be careful in every way - this is a medicine, not for fun. I feel alive and free of anxiety. Amazed.",
      "created_utc": 1660878345.0,
      "score": 4,
      "context": [
        {
          "id": "ijkznja",
          "author": "annualcereal",
          "body": "Wow! I’m so grateful to have seen this post. Thank you SO much for sharing! I hope you continue to integrate and find relief. Can I ask how much you consumed for this trip?",
          "created_utc": 1660054762.0
        },
        {
          "id": "ijl2tys",
          "author": "daisychain_toker",
          "body": "I did around 4g! If you give it a go, I’d love to hear how it goes for you.",
          "created_utc": 1660056041.0
        }
      ]
    },
    {
      "id": "ikw4fm2",
      "author": "daisychain_toker",
      "body": "I am crying. Thank you for sharing this update- how fucking beautiful. I just want to hug you! Cheers to breakthrough & healing and thank you to the magical mushroom. I wish you well on your journey! ❤️",
      "created_utc": 1660882345.0,
      "score": 3,
      "context": [
        {
          "id": "ijkznja",
          "author": "annualcereal",
          "body": "Wow! I’m so grateful to have seen this post. Thank you SO much for sharing! I hope you continue to integrate and find relief. Can I ask how much you consumed for this trip?",
          "created_utc": 1660054762.0
        },
        {
          "id": "ijl2tys",
          "author": "daisychain_toker",
          "body": "I did around 4g! If you give it a go, I’d love to hear how it goes for you.",
          "created_utc": 1660056041.0
        },
        {
          "id": "ikvws5t",
          "author": "annualcereal",
          "body": "I need to thank you again. I’m stunned. Since Saturday, I have:\n- Eaten the first salad of my life \n- Successfully tried at least 50 news foods (I stopped counting at 50!) \n- Haven’t gagged, wanted to throw up, or felt like I made a serious mistake in trying these foods \n- Learned I love chunky salsa, honeycrisp apples, prosciutto, massaman curry, tofu, hard rice instead of just sticky rice, peanut butter (crunchy or creamy), chunky fig jam, cabbage (!), plums, nectarines, avocados, mayo, carne asada, and sooo much more \n- Experienced food smells completely differently! All fresh fruits used to smell like decay and mold. I haven’t experienced that even once since Saturday. Fruit smells GOOD! This is the strangest part!! \n\nI still have a fear of new foods when I consider eating them. But that’s 100% about thought patterns and past experiences. Once I try the foods, nothing is wrong. I’m just eating. \n\nI set my intention as “Goodbye ARFID.” I’ve done food therapy for years and I’m confident the skills I’ve built in therapy are helping me eat these new foods every meal. But therapy alone would not have gotten me here. I’ve tried more foods this week than in my entire adult life. On Saturday I had an eating disorder. Now I don’t. \n\nAlso: I’m on an SSRI and feel confident that dulled the effects. But it still worked. My sweet husband was my trip sitter. I followed the Johns Hopkins study design closely for a safe set and setting. \n\nI feel like I have a chance to be healthy and happy. I already feel like a happy child with every food I’m trying for the first time. Only one of these foods was unpleasant for me - and I still ate it without gagging or spitting it out. I’m learning that people without eating disorders have valid food preferences like this! \n\nI’m in disbelief and want to help more people with ARFID understand our experiences! And I want to be careful in every way - this is a medicine, not for fun. I feel alive and free of anxiety. Amazed.",
          "created_utc": 1660878345.0
        }
      ]
    },
    {
      "id": "indjg11",
      "author": "mystery-hog",
      "body": "This is giving me so much hope. This whole entire post. Thank you both so much, I am going to try this safely and carefully and with the right intentions.",
      "created_utc": 1662504016.0,
      "score": 3,
      "context": [
        {
          "id": "ijkznja",
          "author": "annualcereal",
          "body": "Wow! I’m so grateful to have seen this post. Thank you SO much for sharing! I hope you continue to integrate and find relief. Can I ask how much you consumed for this trip?",
          "created_utc": 1660054762.0
        },
        {
          "id": "ijl2tys",
          "author": "daisychain_toker",
          "body": "I did around 4g! If you give it a go, I’d love to hear how it goes for you.",
          "created_utc": 1660056041.0
        },
        {
          "id": "ikvws5t",
          "author": "annualcereal",
          "body": "I need to thank you again. I’m stunned. Since Saturday, I have:\n- Eaten the first salad of my life \n- Successfully tried at least 50 news foods (I stopped counting at 50!) \n- Haven’t gagged, wanted to throw up, or felt like I made a serious mistake in trying these foods \n- Learned I love chunky salsa, honeycrisp apples, prosciutto, massaman curry, tofu, hard rice instead of just sticky rice, peanut butter (crunchy or creamy), chunky fig jam, cabbage (!), plums, nectarines, avocados, mayo, carne asada, and sooo much more \n- Experienced food smells completely differently! All fresh fruits used to smell like decay and mold. I haven’t experienced that even once since Saturday. Fruit smells GOOD! This is the strangest part!! \n\nI still have a fear of new foods when I consider eating them. But that’s 100% about thought patterns and past experiences. Once I try the foods, nothing is wrong. I’m just eating. \n\nI set my intention as “Goodbye ARFID.” I’ve done food therapy for years and I’m confident the skills I’ve built in therapy are helping me eat these new foods every meal. But therapy alone would not have gotten me here. I’ve tried more foods this week than in my entire adult life. On Saturday I had an eating disorder. Now I don’t. \n\nAlso: I’m on an SSRI and feel confident that dulled the effects. But it still worked. My sweet husband was my trip sitter. I followed the Johns Hopkins study design closely for a safe set and setting. \n\nI feel like I have a chance to be healthy and happy. I already feel like a happy child with every food I’m trying for the first time. Only one of these foods was unpleasant for me - and I still ate it without gagging or spitting it out. I’m learning that people without eating disorders have valid food preferences like this! \n\nI’m in disbelief and want to help more people with ARFID understand our experiences! And I want to be careful in every way - this is a medicine, not for fun. I feel alive and free of anxiety. Amazed.",
          "created_utc": 1660878345.0
        }
      ]
    },
    {
      "id": "l9356vc",
      "author": "sapphireblues_",
      "body": "Hi! Can you tell me if the study design you followed was Psychedelic‐Assisted Therapy for People with Eating Disorders, first author Natalie Gukasyan?",
      "created_utc": 1718672284.0,
      "score": 1,
      "context": [
        {
          "id": "ijkznja",
          "author": "annualcereal",
          "body": "Wow! I’m so grateful to have seen this post. Thank you SO much for sharing! I hope you continue to integrate and find relief. Can I ask how much you consumed for this trip?",
          "created_utc": 1660054762.0
        },
        {
          "id": "ijl2tys",
          "author": "daisychain_toker",
          "body": "I did around 4g! If you give it a go, I’d love to hear how it goes for you.",
          "created_utc": 1660056041.0
        },
        {
          "id": "ikvws5t",
          "author": "annualcereal",
          "body": "I need to thank you again. I’m stunned. Since Saturday, I have:\n- Eaten the first salad of my life \n- Successfully tried at least 50 news foods (I stopped counting at 50!) \n- Haven’t gagged, wanted to throw up, or felt like I made a serious mistake in trying these foods \n- Learned I love chunky salsa, honeycrisp apples, prosciutto, massaman curry, tofu, hard rice instead of just sticky rice, peanut butter (crunchy or creamy), chunky fig jam, cabbage (!), plums, nectarines, avocados, mayo, carne asada, and sooo much more \n- Experienced food smells completely differently! All fresh fruits used to smell like decay and mold. I haven’t experienced that even once since Saturday. Fruit smells GOOD! This is the strangest part!! \n\nI still have a fear of new foods when I consider eating them. But that’s 100% about thought patterns and past experiences. Once I try the foods, nothing is wrong. I’m just eating. \n\nI set my intention as “Goodbye ARFID.” I’ve done food therapy for years and I’m confident the skills I’ve built in therapy are helping me eat these new foods every meal. But therapy alone would not have gotten me here. I’ve tried more foods this week than in my entire adult life. On Saturday I had an eating disorder. Now I don’t. \n\nAlso: I’m on an SSRI and feel confident that dulled the effects. But it still worked. My sweet husband was my trip sitter. I followed the Johns Hopkins study design closely for a safe set and setting. \n\nI feel like I have a chance to be healthy and happy. I already feel like a happy child with every food I’m trying for the first time. Only one of these foods was unpleasant for me - and I still ate it without gagging or spitting it out. I’m learning that people without eating disorders have valid food preferences like this! \n\nI’m in disbelief and want to help more people with ARFID understand our experiences! And I want to be careful in every way - this is a medicine, not for fun. I feel alive and free of anxiety. Amazed.",
          "created_utc": 1660878345.0
        }
      ]
    },
    {
      "id": "ine05jo",
      "author": "annualcereal",
      "body": "Wishing you the best! 3 weeks later, I’m doing even better. I’ve tried over 100 foods and haven’t gagged once. The key for me: a loving, patient, supportive person to continue suggesting and offering new food to me. My partner is a great eater. He offers me everything he eats without pressure or expectation - just offers! My challenge to myself is to say yes every single time, and I do. This has helped me find new staples that I love: Caesar salad, avocados, oranges, and so much more. Every meal I incorporate something new, and I’ve chosen not to rely on my safe foods each meal. I can’t give advice but these steps have absolutely transformed me. Finally, reading the book Your Psilocybin Mushroom Companion by Michelle Janikian helped me prepare and my partner serve as a successful trip sitter. \n\nI’ve also learned that I have food preferences that have nothing to do with my (former!) eating disorder. \n\nI felt ready for this experience and relied on past exposure therapy to help me integrate. Everyone’s experience will be different. Please update us. I’m already happy for you!",
      "created_utc": 1662511570.0,
      "score": 3,
      "context": [
        {
          "id": "ijkznja",
          "author": "annualcereal",
          "body": "Wow! I’m so grateful to have seen this post. Thank you SO much for sharing! I hope you continue to integrate and find relief. Can I ask how much you consumed for this trip?",
          "created_utc": 1660054762.0
        },
        {
          "id": "ijl2tys",
          "author": "daisychain_toker",
          "body": "I did around 4g! If you give it a go, I’d love to hear how it goes for you.",
          "created_utc": 1660056041.0
        },
        {
          "id": "ikvws5t",
          "author": "annualcereal",
          "body": "I need to thank you again. I’m stunned. Since Saturday, I have:\n- Eaten the first salad of my life \n- Successfully tried at least 50 news foods (I stopped counting at 50!) \n- Haven’t gagged, wanted to throw up, or felt like I made a serious mistake in trying these foods \n- Learned I love chunky salsa, honeycrisp apples, prosciutto, massaman curry, tofu, hard rice instead of just sticky rice, peanut butter (crunchy or creamy), chunky fig jam, cabbage (!), plums, nectarines, avocados, mayo, carne asada, and sooo much more \n- Experienced food smells completely differently! All fresh fruits used to smell like decay and mold. I haven’t experienced that even once since Saturday. Fruit smells GOOD! This is the strangest part!! \n\nI still have a fear of new foods when I consider eating them. But that’s 100% about thought patterns and past experiences. Once I try the foods, nothing is wrong. I’m just eating. \n\nI set my intention as “Goodbye ARFID.” I’ve done food therapy for years and I’m confident the skills I’ve built in therapy are helping me eat these new foods every meal. But therapy alone would not have gotten me here. I’ve tried more foods this week than in my entire adult life. On Saturday I had an eating disorder. Now I don’t. \n\nAlso: I’m on an SSRI and feel confident that dulled the effects. But it still worked. My sweet husband was my trip sitter. I followed the Johns Hopkins study design closely for a safe set and setting. \n\nI feel like I have a chance to be healthy and happy. I already feel like a happy child with every food I’m trying for the first time. Only one of these foods was unpleasant for me - and I still ate it without gagging or spitting it out. I’m learning that people without eating disorders have valid food preferences like this! \n\nI’m in disbelief and want to help more people with ARFID understand our experiences! And I want to be careful in every way - this is a medicine, not for fun. I feel alive and free of anxiety. Amazed.",
          "created_utc": 1660878345.0
        },
        {
          "id": "indjg11",
          "author": "mystery-hog",
          "body": "This is giving me so much hope. This whole entire post. Thank you both so much, I am going to try this safely and carefully and with the right intentions.",
          "created_utc": 1662504016.0
        }
      ]
    },
    {
      "id": "l9bjdl6",
      "author": "annualcereal",
      "body": "Hi! That looks like a good one. I mostly relied on these: [MAPS “Clinical Study Protocol,”](https://maps.org/research-archive/cluster/psilo-lsd/pca1protocol.pdf) plus their MDMA [clinical trial study design](https://mapscontent.s3-us-west-1.amazonaws.com/research-archive/mdma/mapp1/FINAL+MAPP1+Public+Protocol+A4V1_+22MAY2020.pdf) and [therapist guide](https://maps.org/wp-content/uploads/2022/05/MDMA-Assisted-Psychotherapy-Treatment-Manual-V8.1-22AUG2017.pdf), and [MAPS “LSD and Psilocybin Documents & Resources.”](https://maps.org/2014/02/12/lsd-and-psilocybin-documents-resources-list/) \n\nLet me know if you're interested in more resources.",
      "created_utc": 1718810641.0,
      "score": 2,
      "context": [
        {
          "id": "ijkznja",
          "author": "annualcereal",
          "body": "Wow! I’m so grateful to have seen this post. Thank you SO much for sharing! I hope you continue to integrate and find relief. Can I ask how much you consumed for this trip?",
          "created_utc": 1660054762.0
        },
        {
          "id": "ijl2tys",
          "author": "daisychain_toker",
          "body": "I did around 4g! If you give it a go, I’d love to hear how it goes for you.",
          "created_utc": 1660056041.0
        },
        {
          "id": "ikvws5t",
          "author": "annualcereal",
          "body": "I need to thank you again. I’m stunned. Since Saturday, I have:\n- Eaten the first salad of my life \n- Successfully tried at least 50 news foods (I stopped counting at 50!) \n- Haven’t gagged, wanted to throw up, or felt like I made a serious mistake in trying these foods \n- Learned I love chunky salsa, honeycrisp apples, prosciutto, massaman curry, tofu, hard rice instead of just sticky rice, peanut butter (crunchy or creamy), chunky fig jam, cabbage (!), plums, nectarines, avocados, mayo, carne asada, and sooo much more \n- Experienced food smells completely differently! All fresh fruits used to smell like decay and mold. I haven’t experienced that even once since Saturday. Fruit smells GOOD! This is the strangest part!! \n\nI still have a fear of new foods when I consider eating them. But that’s 100% about thought patterns and past experiences. Once I try the foods, nothing is wrong. I’m just eating. \n\nI set my intention as “Goodbye ARFID.” I’ve done food therapy for years and I’m confident the skills I’ve built in therapy are helping me eat these new foods every meal. But therapy alone would not have gotten me here. I’ve tried more foods this week than in my entire adult life. On Saturday I had an eating disorder. Now I don’t. \n\nAlso: I’m on an SSRI and feel confident that dulled the effects. But it still worked. My sweet husband was my trip sitter. I followed the Johns Hopkins study design closely for a safe set and setting. \n\nI feel like I have a chance to be healthy and happy. I already feel like a happy child with every food I’m trying for the first time. Only one of these foods was unpleasant for me - and I still ate it without gagging or spitting it out. I’m learning that people without eating disorders have valid food preferences like this! \n\nI’m in disbelief and want to help more people with ARFID understand our experiences! And I want to be careful in every way - this is a medicine, not for fun. I feel alive and free of anxiety. Amazed.",
          "created_utc": 1660878345.0
        },
        {
          "id": "l9356vc",
          "author": "sapphireblues_",
          "body": "Hi! Can you tell me if the study design you followed was Psychedelic‐Assisted Therapy for People with Eating Disorders, first author Natalie Gukasyan?",
          "created_utc": 1718672284.0
        }
      ]
    },
    {
      "id": "infpaik",
      "author": "mystery-hog",
      "body": "Thank you so much for the thoughtful time you took to write out all of this. I appreciate it so much. There is a rant below, which you don’t have to read if it’s a potential trigger. \n\nARFID takes loads of forms, and mine flares up when I get too anxious. Otherwise, my friends and family see me as a “foodie”, which adds to the pressure. So I have tried most foods in my life, and enjoyed them immensely when life is going well, it’s when it becomes too stressful that I suddenly develop an aversion to almost everything. I’ve even been feeling like my safe foods are “too delicious” (i.e. they have too much flavour), and it’s depressing the hell out of me. The pressure I put on myself is enormous because at the best of times, I’m underweight. It’s so scary and exhausting. \n\nBut I do have hope, and I have been eating better in the last few days. I have a new hypnotherapist and I am looking for an ARFID specialist as well. I am taking two weeks off work to sit in my feelings and fears and let them come up with a sense of curious calm. Breathing exercises and weed are helping me enormously. \n\nAgain, thank you so much for the messages. To all my fellow beloved ARFID peeps, I send all of us my love. Xxxx",
      "created_utc": 1662549173.0,
      "score": 3,
      "context": [
        {
          "id": "ijkznja",
          "author": "annualcereal",
          "body": "Wow! I’m so grateful to have seen this post. Thank you SO much for sharing! I hope you continue to integrate and find relief. Can I ask how much you consumed for this trip?",
          "created_utc": 1660054762.0
        },
        {
          "id": "ijl2tys",
          "author": "daisychain_toker",
          "body": "I did around 4g! If you give it a go, I’d love to hear how it goes for you.",
          "created_utc": 1660056041.0
        },
        {
          "id": "ikvws5t",
          "author": "annualcereal",
          "body": "I need to thank you again. I’m stunned. Since Saturday, I have:\n- Eaten the first salad of my life \n- Successfully tried at least 50 news foods (I stopped counting at 50!) \n- Haven’t gagged, wanted to throw up, or felt like I made a serious mistake in trying these foods \n- Learned I love chunky salsa, honeycrisp apples, prosciutto, massaman curry, tofu, hard rice instead of just sticky rice, peanut butter (crunchy or creamy), chunky fig jam, cabbage (!), plums, nectarines, avocados, mayo, carne asada, and sooo much more \n- Experienced food smells completely differently! All fresh fruits used to smell like decay and mold. I haven’t experienced that even once since Saturday. Fruit smells GOOD! This is the strangest part!! \n\nI still have a fear of new foods when I consider eating them. But that’s 100% about thought patterns and past experiences. Once I try the foods, nothing is wrong. I’m just eating. \n\nI set my intention as “Goodbye ARFID.” I’ve done food therapy for years and I’m confident the skills I’ve built in therapy are helping me eat these new foods every meal. But therapy alone would not have gotten me here. I’ve tried more foods this week than in my entire adult life. On Saturday I had an eating disorder. Now I don’t. \n\nAlso: I’m on an SSRI and feel confident that dulled the effects. But it still worked. My sweet husband was my trip sitter. I followed the Johns Hopkins study design closely for a safe set and setting. \n\nI feel like I have a chance to be healthy and happy. I already feel like a happy child with every food I’m trying for the first time. Only one of these foods was unpleasant for me - and I still ate it without gagging or spitting it out. I’m learning that people without eating disorders have valid food preferences like this! \n\nI’m in disbelief and want to help more people with ARFID understand our experiences! And I want to be careful in every way - this is a medicine, not for fun. I feel alive and free of anxiety. Amazed.",
          "created_utc": 1660878345.0
        },
        {
          "id": "indjg11",
          "author": "mystery-hog",
          "body": "This is giving me so much hope. This whole entire post. Thank you both so much, I am going to try this safely and carefully and with the right intentions.",
          "created_utc": 1662504016.0
        },
        {
          "id": "ine05jo",
          "author": "annualcereal",
          "body": "Wishing you the best! 3 weeks later, I’m doing even better. I’ve tried over 100 foods and haven’t gagged once. The key for me: a loving, patient, supportive person to continue suggesting and offering new food to me. My partner is a great eater. He offers me everything he eats without pressure or expectation - just offers! My challenge to myself is to say yes every single time, and I do. This has helped me find new staples that I love: Caesar salad, avocados, oranges, and so much more. Every meal I incorporate something new, and I’ve chosen not to rely on my safe foods each meal. I can’t give advice but these steps have absolutely transformed me. Finally, reading the book Your Psilocybin Mushroom Companion by Michelle Janikian helped me prepare and my partner serve as a successful trip sitter. \n\nI’ve also learned that I have food preferences that have nothing to do with my (former!) eating disorder. \n\nI felt ready for this experience and relied on past exposure therapy to help me integrate. Everyone’s experience will be different. Please update us. I’m already happy for you!",
          "created_utc": 1662511570.0
        }
      ]
    },
    {
      "id": "isamagp",
      "author": "annualcereal",
      "body": "I wanted to share an update 2 months later: I’m doing better than ever. Summary:\n\n- I can try any food. I don’t experience the same fear I had in my first few weeks after this experience. I feared each new food, but thankfully felt happy or neutral when actually eating it. Now I’m filled with curiosity and interest. I attribute this to an ongoing choice to engage in self-directed exposure therapy: it would have been easy to revert to old ways. But because it felt *available to me* to try new foods – and because of the positive experiences each time I tried foods – I’ve consistently chosen curiosity. It’s paid off. This experience seems similar to how children learn how to eat: some holistically choose curiosity which leads to a wide palate. Some choose comfort which can lead to fewer new food experiences. No judgment – and I’m grateful to now have the tools to consistently choose this curiosity. \n- My husband jokes that each time I go to a restaurant I say “this is a top 5 food for me now!” Recently I’ve tried and loved escargots, pig’s feet, poke bowls, caviar, Brussels sprouts (previously I couldn’t be in the same room with the smell), and so much more. I love food. I LOVE food. \n- Socially, the world is open to me in a way it never was before. Before, I felt anxious eating with anyone. Now I love surprising friends with my diverse approach to foods. I can eat in front of and among people. I’ve also told everyone I’m close to how this happened. Each person, including all my family, are relieved and overjoyed for me. This has enriched my relationships. My openness to food and to talking about it without shame has helped me grow closer to family and friends. This is a beautiful, unintended side effect. \n- I feel compelled to share my story. I’ve emailed academic and health experts of ARFID and psychedelics to get this case study of healing on their radar. I haven’t connected with anyone in detail on this but welcome it. To readers: if you or someone you love have ARFID, I’m open to discussing with you. If you’re a researcher on one of these topics, I want to help in any way I can. I feel so much relief and desire to live fully now. And I feel a responsibility to share my experience to help others understand how I got here. \n\nWishing you and any readers relief and hope in any healthy ways you might find!",
      "created_utc": 1665758703.0,
      "score": 3,
      "context": [
        {
          "id": "ijkznja",
          "author": "annualcereal",
          "body": "Wow! I’m so grateful to have seen this post. Thank you SO much for sharing! I hope you continue to integrate and find relief. Can I ask how much you consumed for this trip?",
          "created_utc": 1660054762.0
        },
        {
          "id": "ijl2tys",
          "author": "daisychain_toker",
          "body": "I did around 4g! If you give it a go, I’d love to hear how it goes for you.",
          "created_utc": 1660056041.0
        },
        {
          "id": "ikvws5t",
          "author": "annualcereal",
          "body": "I need to thank you again. I’m stunned. Since Saturday, I have:\n- Eaten the first salad of my life \n- Successfully tried at least 50 news foods (I stopped counting at 50!) \n- Haven’t gagged, wanted to throw up, or felt like I made a serious mistake in trying these foods \n- Learned I love chunky salsa, honeycrisp apples, prosciutto, massaman curry, tofu, hard rice instead of just sticky rice, peanut butter (crunchy or creamy), chunky fig jam, cabbage (!), plums, nectarines, avocados, mayo, carne asada, and sooo much more \n- Experienced food smells completely differently! All fresh fruits used to smell like decay and mold. I haven’t experienced that even once since Saturday. Fruit smells GOOD! This is the strangest part!! \n\nI still have a fear of new foods when I consider eating them. But that’s 100% about thought patterns and past experiences. Once I try the foods, nothing is wrong. I’m just eating. \n\nI set my intention as “Goodbye ARFID.” I’ve done food therapy for years and I’m confident the skills I’ve built in therapy are helping me eat these new foods every meal. But therapy alone would not have gotten me here. I’ve tried more foods this week than in my entire adult life. On Saturday I had an eating disorder. Now I don’t. \n\nAlso: I’m on an SSRI and feel confident that dulled the effects. But it still worked. My sweet husband was my trip sitter. I followed the Johns Hopkins study design closely for a safe set and setting. \n\nI feel like I have a chance to be healthy and happy. I already feel like a happy child with every food I’m trying for the first time. Only one of these foods was unpleasant for me - and I still ate it without gagging or spitting it out. I’m learning that people without eating disorders have valid food preferences like this! \n\nI’m in disbelief and want to help more people with ARFID understand our experiences! And I want to be careful in every way - this is a medicine, not for fun. I feel alive and free of anxiety. Amazed.",
          "created_utc": 1660878345.0
        },
        {
          "id": "indjg11",
          "author": "mystery-hog",
          "body": "This is giving me so much hope. This whole entire post. Thank you both so much, I am going to try this safely and carefully and with the right intentions.",
          "created_utc": 1662504016.0
        },
        {
          "id": "ine05jo",
          "author": "annualcereal",
          "body": "Wishing you the best! 3 weeks later, I’m doing even better. I’ve tried over 100 foods and haven’t gagged once. The key for me: a loving, patient, supportive person to continue suggesting and offering new food to me. My partner is a great eater. He offers me everything he eats without pressure or expectation - just offers! My challenge to myself is to say yes every single time, and I do. This has helped me find new staples that I love: Caesar salad, avocados, oranges, and so much more. Every meal I incorporate something new, and I’ve chosen not to rely on my safe foods each meal. I can’t give advice but these steps have absolutely transformed me. Finally, reading the book Your Psilocybin Mushroom Companion by Michelle Janikian helped me prepare and my partner serve as a successful trip sitter. \n\nI’ve also learned that I have food preferences that have nothing to do with my (former!) eating disorder. \n\nI felt ready for this experience and relied on past exposure therapy to help me integrate. Everyone’s experience will be different. Please update us. I’m already happy for you!",
          "created_utc": 1662511570.0
        }
      ]
    },
    {
      "id": "l9bv21c",
      "author": "sapphireblues_",
      "body": "Thank you! I read your Slate article, I’m actually in metro atlanta as well. Considering a psilocybin therapy session in Oregon.",
      "created_utc": 1718814585.0,
      "score": 1,
      "context": [
        {
          "id": "ijkznja",
          "author": "annualcereal",
          "body": "Wow! I’m so grateful to have seen this post. Thank you SO much for sharing! I hope you continue to integrate and find relief. Can I ask how much you consumed for this trip?",
          "created_utc": 1660054762.0
        },
        {
          "id": "ijl2tys",
          "author": "daisychain_toker",
          "body": "I did around 4g! If you give it a go, I’d love to hear how it goes for you.",
          "created_utc": 1660056041.0
        },
        {
          "id": "ikvws5t",
          "author": "annualcereal",
          "body": "I need to thank you again. I’m stunned. Since Saturday, I have:\n- Eaten the first salad of my life \n- Successfully tried at least 50 news foods (I stopped counting at 50!) \n- Haven’t gagged, wanted to throw up, or felt like I made a serious mistake in trying these foods \n- Learned I love chunky salsa, honeycrisp apples, prosciutto, massaman curry, tofu, hard rice instead of just sticky rice, peanut butter (crunchy or creamy), chunky fig jam, cabbage (!), plums, nectarines, avocados, mayo, carne asada, and sooo much more \n- Experienced food smells completely differently! All fresh fruits used to smell like decay and mold. I haven’t experienced that even once since Saturday. Fruit smells GOOD! This is the strangest part!! \n\nI still have a fear of new foods when I consider eating them. But that’s 100% about thought patterns and past experiences. Once I try the foods, nothing is wrong. I’m just eating. \n\nI set my intention as “Goodbye ARFID.” I’ve done food therapy for years and I’m confident the skills I’ve built in therapy are helping me eat these new foods every meal. But therapy alone would not have gotten me here. I’ve tried more foods this week than in my entire adult life. On Saturday I had an eating disorder. Now I don’t. \n\nAlso: I’m on an SSRI and feel confident that dulled the effects. But it still worked. My sweet husband was my trip sitter. I followed the Johns Hopkins study design closely for a safe set and setting. \n\nI feel like I have a chance to be healthy and happy. I already feel like a happy child with every food I’m trying for the first time. Only one of these foods was unpleasant for me - and I still ate it without gagging or spitting it out. I’m learning that people without eating disorders have valid food preferences like this! \n\nI’m in disbelief and want to help more people with ARFID understand our experiences! And I want to be careful in every way - this is a medicine, not for fun. I feel alive and free of anxiety. Amazed.",
          "created_utc": 1660878345.0
        },
        {
          "id": "l9356vc",
          "author": "sapphireblues_",
          "body": "Hi! Can you tell me if the study design you followed was Psychedelic‐Assisted Therapy for People with Eating Disorders, first author Natalie Gukasyan?",
          "created_utc": 1718672284.0
        },
        {
          "id": "l9bjdl6",
          "author": "annualcereal",
          "body": "Hi! That looks like a good one. I mostly relied on these: [MAPS “Clinical Study Protocol,”](https://maps.org/research-archive/cluster/psilo-lsd/pca1protocol.pdf) plus their MDMA [clinical trial study design](https://mapscontent.s3-us-west-1.amazonaws.com/research-archive/mdma/mapp1/FINAL+MAPP1+Public+Protocol+A4V1_+22MAY2020.pdf) and [therapist guide](https://maps.org/wp-content/uploads/2022/05/MDMA-Assisted-Psychotherapy-Treatment-Manual-V8.1-22AUG2017.pdf), and [MAPS “LSD and Psilocybin Documents & Resources.”](https://maps.org/2014/02/12/lsd-and-psilocybin-documents-resources-list/) \n\nLet me know if you're interested in more resources.",
          "created_utc": 1718810641.0
        }
      ]
    },
    {
      "id": "j3kbcss",
      "author": "annualcereal",
      "body": "This log of progress is helpful to me, so I’m posting again! Hello to anyone else reading this, too 😃\n\nTl;dr My progress is holding strong. And now I have stronger food preferences. My diet is intentionally and joyfully diverse. \n\n\nI feel more like a “healthy adult” eater now. My first few months after this experience, I felt like a child in a healthy environment learning about food. I tasted vegetables for the first time. I didn’t know how to cook anything expect my prior safe foods. And each food experience felt new and interesting. \n\nToday, I’ve experienced hundreds of new foods. Most of these new foods I’ve tried in several ways: cooked differently, combined with different ingredients, and in different social/physical environments. That means I’m becoming acclimated to most foods and the typical experiences they provide. Today I ate pork belly on a crostini: both pieces were familiar to me, and the combination felt 10% different (that’s a guess). The first month, food was 90-100% different each time I tried something. \n\nI see this (mostly) neutrally. A pro: food is less of a time-consuming distraction. Fewer new experiences means less information to process and understand every meal. A con is I have food preferences (like any human does) that make me *slightly* less curious and open to new foods. \n\nExample: Every time I bring up this concern, my partner reminds me of how he perceives me. He says, “You will try anything, even if you choose not to eat the entire plate. Then every meal, you exclusively eat ‘new’ foods compared to Old You. That is still adventurous.” And that, “your food preferences are that you like *good* food. You always like broccoli when it’s cooked right.” And I agree. I had an eating disorder for 27 years, and I’m sometimes nervous that not enjoying a dish of undercooked veggies means that it’s creeping back. It’s not. I just have snobby taste, I think? 😹\n\nI’ll also share details about my typical meals. Before I changed, I ate 1-2 of the same frozen pizzas each day. I also relied on toast with cheese, cereals, some yogurt brands, freeze-dried smoothies, and various carbs in rotation. \n\nTo compare, my favorite foods now are avocado, pork belly, oranges, kiwis, salmon avocado sushi, passion fruit, and…most things!\n\nMy typical M-F meal schedule:\n* Breakfast: Hi-caf black tea, no-sugar lowfat greek yogurt with pumpkin seeds and wheat germ, orange or kiwi on the side.\n* Lunch: The sandwich is the main dish: A piece of my partner’s homemade part-whole-grain sourdough bread, fried egg with salt/pepper/nutritional yeast, piece of fried cheese, whole avocado, cherry tomatoes, and microgreens if we have them around. I'll also eat another piece of fruit and a handful of nuts like pistachios.\n* Dinner: Usually a salad of some kind. Caesar is my favorite! Once a week we do salmon avocado sushi. If I’m still hungry, I’ll have peanut butter sourdough toast, or some nuts, or something with hummus. \n\nI hope this information is helpful to someone. This is still the best thing that’s ever happened to me. Wishing any readers relief!\n\nEdits: typos.",
      "created_utc": 1673235949.0,
      "score": 1,
      "context": [
        {
          "id": "ijkznja",
          "author": "annualcereal",
          "body": "Wow! I’m so grateful to have seen this post. Thank you SO much for sharing! I hope you continue to integrate and find relief. Can I ask how much you consumed for this trip?",
          "created_utc": 1660054762.0
        },
        {
          "id": "ijl2tys",
          "author": "daisychain_toker",
          "body": "I did around 4g! If you give it a go, I’d love to hear how it goes for you.",
          "created_utc": 1660056041.0
        },
        {
          "id": "ikvws5t",
          "author": "annualcereal",
          "body": "I need to thank you again. I’m stunned. Since Saturday, I have:\n- Eaten the first salad of my life \n- Successfully tried at least 50 news foods (I stopped counting at 50!) \n- Haven’t gagged, wanted to throw up, or felt like I made a serious mistake in trying these foods \n- Learned I love chunky salsa, honeycrisp apples, prosciutto, massaman curry, tofu, hard rice instead of just sticky rice, peanut butter (crunchy or creamy), chunky fig jam, cabbage (!), plums, nectarines, avocados, mayo, carne asada, and sooo much more \n- Experienced food smells completely differently! All fresh fruits used to smell like decay and mold. I haven’t experienced that even once since Saturday. Fruit smells GOOD! This is the strangest part!! \n\nI still have a fear of new foods when I consider eating them. But that’s 100% about thought patterns and past experiences. Once I try the foods, nothing is wrong. I’m just eating. \n\nI set my intention as “Goodbye ARFID.” I’ve done food therapy for years and I’m confident the skills I’ve built in therapy are helping me eat these new foods every meal. But therapy alone would not have gotten me here. I’ve tried more foods this week than in my entire adult life. On Saturday I had an eating disorder. Now I don’t. \n\nAlso: I’m on an SSRI and feel confident that dulled the effects. But it still worked. My sweet husband was my trip sitter. I followed the Johns Hopkins study design closely for a safe set and setting. \n\nI feel like I have a chance to be healthy and happy. I already feel like a happy child with every food I’m trying for the first time. Only one of these foods was unpleasant for me - and I still ate it without gagging or spitting it out. I’m learning that people without eating disorders have valid food preferences like this! \n\nI’m in disbelief and want to help more people with ARFID understand our experiences! And I want to be careful in every way - this is a medicine, not for fun. I feel alive and free of anxiety. Amazed.",
          "created_utc": 1660878345.0
        },
        {
          "id": "indjg11",
          "author": "mystery-hog",
          "body": "This is giving me so much hope. This whole entire post. Thank you both so much, I am going to try this safely and carefully and with the right intentions.",
          "created_utc": 1662504016.0
        },
        {
          "id": "ine05jo",
          "author": "annualcereal",
          "body": "Wishing you the best! 3 weeks later, I’m doing even better. I’ve tried over 100 foods and haven’t gagged once. The key for me: a loving, patient, supportive person to continue suggesting and offering new food to me. My partner is a great eater. He offers me everything he eats without pressure or expectation - just offers! My challenge to myself is to say yes every single time, and I do. This has helped me find new staples that I love: Caesar salad, avocados, oranges, and so much more. Every meal I incorporate something new, and I’ve chosen not to rely on my safe foods each meal. I can’t give advice but these steps have absolutely transformed me. Finally, reading the book Your Psilocybin Mushroom Companion by Michelle Janikian helped me prepare and my partner serve as a successful trip sitter. \n\nI’ve also learned that I have food preferences that have nothing to do with my (former!) eating disorder. \n\nI felt ready for this experience and relied on past exposure therapy to help me integrate. Everyone’s experience will be different. Please update us. I’m already happy for you!",
          "created_utc": 1662511570.0
        },
        {
          "id": "isamagp",
          "author": "annualcereal",
          "body": "I wanted to share an update 2 months later: I’m doing better than ever. Summary:\n\n- I can try any food. I don’t experience the same fear I had in my first few weeks after this experience. I feared each new food, but thankfully felt happy or neutral when actually eating it. Now I’m filled with curiosity and interest. I attribute this to an ongoing choice to engage in self-directed exposure therapy: it would have been easy to revert to old ways. But because it felt *available to me* to try new foods – and because of the positive experiences each time I tried foods – I’ve consistently chosen curiosity. It’s paid off. This experience seems similar to how children learn how to eat: some holistically choose curiosity which leads to a wide palate. Some choose comfort which can lead to fewer new food experiences. No judgment – and I’m grateful to now have the tools to consistently choose this curiosity. \n- My husband jokes that each time I go to a restaurant I say “this is a top 5 food for me now!” Recently I’ve tried and loved escargots, pig’s feet, poke bowls, caviar, Brussels sprouts (previously I couldn’t be in the same room with the smell), and so much more. I love food. I LOVE food. \n- Socially, the world is open to me in a way it never was before. Before, I felt anxious eating with anyone. Now I love surprising friends with my diverse approach to foods. I can eat in front of and among people. I’ve also told everyone I’m close to how this happened. Each person, including all my family, are relieved and overjoyed for me. This has enriched my relationships. My openness to food and to talking about it without shame has helped me grow closer to family and friends. This is a beautiful, unintended side effect. \n- I feel compelled to share my story. I’ve emailed academic and health experts of ARFID and psychedelics to get this case study of healing on their radar. I haven’t connected with anyone in detail on this but welcome it. To readers: if you or someone you love have ARFID, I’m open to discussing with you. If you’re a researcher on one of these topics, I want to help in any way I can. I feel so much relief and desire to live fully now. And I feel a responsibility to share my experience to help others understand how I got here. \n\nWishing you and any readers relief and hope in any healthy ways you might find!",
          "created_utc": 1665758703.0
        }
      ]
    },
    {
      "id": "l9c7zdh",
      "author": "annualcereal",
      "body": "Amazing! I'm not familiar with any particular providers but (if you haven't yet) I encourage you to do research on others' experiences at providers you're interested in. The sense I get is safety and quality greatly vary between providers. \n\n  \nAtlanta: So cool! If you're interested in learning more locally, the quarterly [Atlanta Mushroom Festival](https://atlantamushroomfestival.com/pages/event-schedule) (there's one this Sunday) and [PsySalon](https://www.eventbrite.ca/o/cesar-marin-cultivating-wisdom-68234369343) are great places to learn more in person.",
      "created_utc": 1718818916.0,
      "score": 2,
      "context": [
        {
          "id": "ijkznja",
          "author": "annualcereal",
          "body": "Wow! I’m so grateful to have seen this post. Thank you SO much for sharing! I hope you continue to integrate and find relief. Can I ask how much you consumed for this trip?",
          "created_utc": 1660054762.0
        },
        {
          "id": "ijl2tys",
          "author": "daisychain_toker",
          "body": "I did around 4g! If you give it a go, I’d love to hear how it goes for you.",
          "created_utc": 1660056041.0
        },
        {
          "id": "ikvws5t",
          "author": "annualcereal",
          "body": "I need to thank you again. I’m stunned. Since Saturday, I have:\n- Eaten the first salad of my life \n- Successfully tried at least 50 news foods (I stopped counting at 50!) \n- Haven’t gagged, wanted to throw up, or felt like I made a serious mistake in trying these foods \n- Learned I love chunky salsa, honeycrisp apples, prosciutto, massaman curry, tofu, hard rice instead of just sticky rice, peanut butter (crunchy or creamy), chunky fig jam, cabbage (!), plums, nectarines, avocados, mayo, carne asada, and sooo much more \n- Experienced food smells completely differently! All fresh fruits used to smell like decay and mold. I haven’t experienced that even once since Saturday. Fruit smells GOOD! This is the strangest part!! \n\nI still have a fear of new foods when I consider eating them. But that’s 100% about thought patterns and past experiences. Once I try the foods, nothing is wrong. I’m just eating. \n\nI set my intention as “Goodbye ARFID.” I’ve done food therapy for years and I’m confident the skills I’ve built in therapy are helping me eat these new foods every meal. But therapy alone would not have gotten me here. I’ve tried more foods this week than in my entire adult life. On Saturday I had an eating disorder. Now I don’t. \n\nAlso: I’m on an SSRI and feel confident that dulled the effects. But it still worked. My sweet husband was my trip sitter. I followed the Johns Hopkins study design closely for a safe set and setting. \n\nI feel like I have a chance to be healthy and happy. I already feel like a happy child with every food I’m trying for the first time. Only one of these foods was unpleasant for me - and I still ate it without gagging or spitting it out. I’m learning that people without eating disorders have valid food preferences like this! \n\nI’m in disbelief and want to help more people with ARFID understand our experiences! And I want to be careful in every way - this is a medicine, not for fun. I feel alive and free of anxiety. Amazed.",
          "created_utc": 1660878345.0
        },
        {
          "id": "l9356vc",
          "author": "sapphireblues_",
          "body": "Hi! Can you tell me if the study design you followed was Psychedelic‐Assisted Therapy for People with Eating Disorders, first author Natalie Gukasyan?",
          "created_utc": 1718672284.0
        },
        {
          "id": "l9bjdl6",
          "author": "annualcereal",
          "body": "Hi! That looks like a good one. I mostly relied on these: [MAPS “Clinical Study Protocol,”](https://maps.org/research-archive/cluster/psilo-lsd/pca1protocol.pdf) plus their MDMA [clinical trial study design](https://mapscontent.s3-us-west-1.amazonaws.com/research-archive/mdma/mapp1/FINAL+MAPP1+Public+Protocol+A4V1_+22MAY2020.pdf) and [therapist guide](https://maps.org/wp-content/uploads/2022/05/MDMA-Assisted-Psychotherapy-Treatment-Manual-V8.1-22AUG2017.pdf), and [MAPS “LSD and Psilocybin Documents & Resources.”](https://maps.org/2014/02/12/lsd-and-psilocybin-documents-resources-list/) \n\nLet me know if you're interested in more resources.",
          "created_utc": 1718810641.0
        },
        {
          "id": "l9bv21c",
          "author": "sapphireblues_",
          "body": "Thank you! I read your Slate article, I’m actually in metro atlanta as well. Considering a psilocybin therapy session in Oregon.",
          "created_utc": 1718814585.0
        }
      ]
    },
    {
      "id": "jiuwgzx",
      "author": "annualcereal",
      "body": "An update for myself and for any readers:\n\n* My eating disorder is still in the past. I'm healthier than ever!\n* I lost 15+ pounds without trying. I was slightly overweight before. This means working out, yoga, and daily activities feel easier and more fun than before! \n* My (new) favorite foods are the same. However, I'm in a bit of a food rut. I'm still eating diversely – I'll try any sushi at a restaurant, I order veggie dishes any time I'm out, and I love trying new fruit. But when I cook for myself at home, it's the same dishes (food group sandwich with all the fixins, a plate of snacks from each food group, etc). My palate is diverse but my home-cooking progress has slowed. Learning several new skills at once (eating and cooking) is intense!\n* This is still the best choice I've ever made.",
      "created_utc": 1683222473.0,
      "score": 3,
      "context": [
        {
          "id": "ijkznja",
          "author": "annualcereal",
          "body": "Wow! I’m so grateful to have seen this post. Thank you SO much for sharing! I hope you continue to integrate and find relief. Can I ask how much you consumed for this trip?",
          "created_utc": 1660054762.0
        },
        {
          "id": "ijl2tys",
          "author": "daisychain_toker",
          "body": "I did around 4g! If you give it a go, I’d love to hear how it goes for you.",
          "created_utc": 1660056041.0
        },
        {
          "id": "ikvws5t",
          "author": "annualcereal",
          "body": "I need to thank you again. I’m stunned. Since Saturday, I have:\n- Eaten the first salad of my life \n- Successfully tried at least 50 news foods (I stopped counting at 50!) \n- Haven’t gagged, wanted to throw up, or felt like I made a serious mistake in trying these foods \n- Learned I love chunky salsa, honeycrisp apples, prosciutto, massaman curry, tofu, hard rice instead of just sticky rice, peanut butter (crunchy or creamy), chunky fig jam, cabbage (!), plums, nectarines, avocados, mayo, carne asada, and sooo much more \n- Experienced food smells completely differently! All fresh fruits used to smell like decay and mold. I haven’t experienced that even once since Saturday. Fruit smells GOOD! This is the strangest part!! \n\nI still have a fear of new foods when I consider eating them. But that’s 100% about thought patterns and past experiences. Once I try the foods, nothing is wrong. I’m just eating. \n\nI set my intention as “Goodbye ARFID.” I’ve done food therapy for years and I’m confident the skills I’ve built in therapy are helping me eat these new foods every meal. But therapy alone would not have gotten me here. I’ve tried more foods this week than in my entire adult life. On Saturday I had an eating disorder. Now I don’t. \n\nAlso: I’m on an SSRI and feel confident that dulled the effects. But it still worked. My sweet husband was my trip sitter. I followed the Johns Hopkins study design closely for a safe set and setting. \n\nI feel like I have a chance to be healthy and happy. I already feel like a happy child with every food I’m trying for the first time. Only one of these foods was unpleasant for me - and I still ate it without gagging or spitting it out. I’m learning that people without eating disorders have valid food preferences like this! \n\nI’m in disbelief and want to help more people with ARFID understand our experiences! And I want to be careful in every way - this is a medicine, not for fun. I feel alive and free of anxiety. Amazed.",
          "created_utc": 1660878345.0
        },
        {
          "id": "indjg11",
          "author": "mystery-hog",
          "body": "This is giving me so much hope. This whole entire post. Thank you both so much, I am going to try this safely and carefully and with the right intentions.",
          "created_utc": 1662504016.0
        },
        {
          "id": "ine05jo",
          "author": "annualcereal",
          "body": "Wishing you the best! 3 weeks later, I’m doing even better. I’ve tried over 100 foods and haven’t gagged once. The key for me: a loving, patient, supportive person to continue suggesting and offering new food to me. My partner is a great eater. He offers me everything he eats without pressure or expectation - just offers! My challenge to myself is to say yes every single time, and I do. This has helped me find new staples that I love: Caesar salad, avocados, oranges, and so much more. Every meal I incorporate something new, and I’ve chosen not to rely on my safe foods each meal. I can’t give advice but these steps have absolutely transformed me. Finally, reading the book Your Psilocybin Mushroom Companion by Michelle Janikian helped me prepare and my partner serve as a successful trip sitter. \n\nI’ve also learned that I have food preferences that have nothing to do with my (former!) eating disorder. \n\nI felt ready for this experience and relied on past exposure therapy to help me integrate. Everyone’s experience will be different. Please update us. I’m already happy for you!",
          "created_utc": 1662511570.0
        },
        {
          "id": "isamagp",
          "author": "annualcereal",
          "body": "I wanted to share an update 2 months later: I’m doing better than ever. Summary:\n\n- I can try any food. I don’t experience the same fear I had in my first few weeks after this experience. I feared each new food, but thankfully felt happy or neutral when actually eating it. Now I’m filled with curiosity and interest. I attribute this to an ongoing choice to engage in self-directed exposure therapy: it would have been easy to revert to old ways. But because it felt *available to me* to try new foods – and because of the positive experiences each time I tried foods – I’ve consistently chosen curiosity. It’s paid off. This experience seems similar to how children learn how to eat: some holistically choose curiosity which leads to a wide palate. Some choose comfort which can lead to fewer new food experiences. No judgment – and I’m grateful to now have the tools to consistently choose this curiosity. \n- My husband jokes that each time I go to a restaurant I say “this is a top 5 food for me now!” Recently I’ve tried and loved escargots, pig’s feet, poke bowls, caviar, Brussels sprouts (previously I couldn’t be in the same room with the smell), and so much more. I love food. I LOVE food. \n- Socially, the world is open to me in a way it never was before. Before, I felt anxious eating with anyone. Now I love surprising friends with my diverse approach to foods. I can eat in front of and among people. I’ve also told everyone I’m close to how this happened. Each person, including all my family, are relieved and overjoyed for me. This has enriched my relationships. My openness to food and to talking about it without shame has helped me grow closer to family and friends. This is a beautiful, unintended side effect. \n- I feel compelled to share my story. I’ve emailed academic and health experts of ARFID and psychedelics to get this case study of healing on their radar. I haven’t connected with anyone in detail on this but welcome it. To readers: if you or someone you love have ARFID, I’m open to discussing with you. If you’re a researcher on one of these topics, I want to help in any way I can. I feel so much relief and desire to live fully now. And I feel a responsibility to share my experience to help others understand how I got here. \n\nWishing you and any readers relief and hope in any healthy ways you might find!",
          "created_utc": 1665758703.0
        },
        {
          "id": "j3kbcss",
          "author": "annualcereal",
          "body": "This log of progress is helpful to me, so I’m posting again! Hello to anyone else reading this, too 😃\n\nTl;dr My progress is holding strong. And now I have stronger food preferences. My diet is intentionally and joyfully diverse. \n\n\nI feel more like a “healthy adult” eater now. My first few months after this experience, I felt like a child in a healthy environment learning about food. I tasted vegetables for the first time. I didn’t know how to cook anything expect my prior safe foods. And each food experience felt new and interesting. \n\nToday, I’ve experienced hundreds of new foods. Most of these new foods I’ve tried in several ways: cooked differently, combined with different ingredients, and in different social/physical environments. That means I’m becoming acclimated to most foods and the typical experiences they provide. Today I ate pork belly on a crostini: both pieces were familiar to me, and the combination felt 10% different (that’s a guess). The first month, food was 90-100% different each time I tried something. \n\nI see this (mostly) neutrally. A pro: food is less of a time-consuming distraction. Fewer new experiences means less information to process and understand every meal. A con is I have food preferences (like any human does) that make me *slightly* less curious and open to new foods. \n\nExample: Every time I bring up this concern, my partner reminds me of how he perceives me. He says, “You will try anything, even if you choose not to eat the entire plate. Then every meal, you exclusively eat ‘new’ foods compared to Old You. That is still adventurous.” And that, “your food preferences are that you like *good* food. You always like broccoli when it’s cooked right.” And I agree. I had an eating disorder for 27 years, and I’m sometimes nervous that not enjoying a dish of undercooked veggies means that it’s creeping back. It’s not. I just have snobby taste, I think? 😹\n\nI’ll also share details about my typical meals. Before I changed, I ate 1-2 of the same frozen pizzas each day. I also relied on toast with cheese, cereals, some yogurt brands, freeze-dried smoothies, and various carbs in rotation. \n\nTo compare, my favorite foods now are avocado, pork belly, oranges, kiwis, salmon avocado sushi, passion fruit, and…most things!\n\nMy typical M-F meal schedule:\n* Breakfast: Hi-caf black tea, no-sugar lowfat greek yogurt with pumpkin seeds and wheat germ, orange or kiwi on the side.\n* Lunch: The sandwich is the main dish: A piece of my partner’s homemade part-whole-grain sourdough bread, fried egg with salt/pepper/nutritional yeast, piece of fried cheese, whole avocado, cherry tomatoes, and microgreens if we have them around. I'll also eat another piece of fruit and a handful of nuts like pistachios.\n* Dinner: Usually a salad of some kind. Caesar is my favorite! Once a week we do salmon avocado sushi. If I’m still hungry, I’ll have peanut butter sourdough toast, or some nuts, or something with hummus. \n\nI hope this information is helpful to someone. This is still the best thing that’s ever happened to me. Wishing any readers relief!\n\nEdits: typos.",
          "created_utc": 1673235949.0
        }
      ]
    }
  ]
}