{
  "id": "wp9oku",
  "subreddit": "ARFID",
  "author": "lieunee",
  "created_utc": 1660594567.0,
  "title": "ARFID and IEPs (USA)",
  "selftext": "Got my son’s ARFID paperwork sent to his school today, for the start of the school year. I’ve emailed his teachers and support staff to leave him alone about food and now have permission to pick him up for lunch on a regular basis. (His safe foods are not easily packable and even if they were, the cafeteria is too overwhelming for him to eat there. I was exactly the same way when I was a kid and never ate lunch at school.)\n\nHis laminated “don’t try to make my kid eat and if you have a problem with it call me at this number” card is in his lunch box (just in case) for days I don’t or can’t pick him up.\n\nHe’s so excited to escape the misery of the cafeteria. Feeling optimistic about this school year. \n\n(IEPs in the U.S. are Individualized Education Plans designed to ensure students with disabilities receive reasonable accommodations. We are implementing one this year to ensure he’s not pressured by teachers and staff to eat and also to give him a chance to eat during the day whenever possible.)",
  "url": "https://www.reddit.com/r/ARFID/comments/wp9oku/arfid_and_ieps_usa/",
  "score": 105,
  "num_comments": 15,
  "comments": [
    {
      "id": "ikfh9qx",
      "author": "lieunee",
      "body": "Hope it’s ok I posted this. I know there are a lot of parents who lurk this sub, plus I’m excited to do something for my kid I wish my parents had been able to do for me.",
      "created_utc": 1660595485.0,
      "score": 50,
      "context": []
    },
    {
      "id": "ikfmk76",
      "author": "TyNyeTheTransGuy",
      "body": "Congrats on getting the paperwork in!! \n\nI don’t have any direct experience with IEPs but someone I know has had to deal with them (a parent and their teenager with lifelong nameless disability that school doesn’t take seriously) and from what they’ve said time and time again, sometimes schools just straight up don’t take disability stuff seriously and will try to get away with things. But from what they’ve said, IEPs are a huge step since they HAVE to follow them to the letter, so even if you aren’t *actually* prepared to fight them in court/with the state over it, you have to be a super strong advocate for your son and insist that they do as the letter says. Schools want to cover their own asses, make sure they see your son can’t and won’t just “deal with it”. They’ve also had issues with the school trying to persuade them into a 504 plan, which (unless I have it backwards) isn’t as heavily enforceable since afaik it doesn’t involve the state making sure the school follows it. Their school district tried to convince them to have both at one point with the apparent end goal of getting rid of the IEP since the 504 would supposedly be “enough” (it’s not). Really the school wanted more wiggle room to ignore the kid and do what they wanted. Beware of that, but hopefully your district isn’t so malicious.\n\n I hope this wasn’t too off topic and that it’s at least somewhat helpful advice, good luck to you and your son!",
      "created_utc": 1660597489.0,
      "score": 20,
      "context": []
    },
    {
      "id": "ikgwcbw",
      "author": "laughingintothevoid",
      "body": "You are awesome!\n\nIt's also about time for groups like this to start seeing feedback over time of how things go differently when a kid has some fucking support. I know it will still be a hard road but I could never imagine anything like this happening for a kid where I came up.",
      "created_utc": 1660617119.0,
      "score": 9,
      "context": []
    },
    {
      "id": "ikh23zu",
      "author": "None",
      "body": "This made me emotional. You are a really amazing parent.",
      "created_utc": 1660619831.0,
      "score": 7,
      "context": []
    },
    {
      "id": "ikii8p8",
      "author": "Opposite-Birthday69",
      "body": "Look into FAPE because if they continuously violate it they’re both violating the terms of the IEP and FAPE in terms of emotional damage",
      "created_utc": 1660654781.0,
      "score": 7,
      "context": []
    },
    {
      "id": "ikja1js",
      "author": "nopizzaonmypineapple",
      "body": "Man that's so cool! I'm happy to see kids with ARFID getting all the accommodations and empathy I didn't get as a kid. You're an awesome parent",
      "created_utc": 1660665976.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ikiplpm",
      "author": "None",
      "body": "This is awesome! I’m happy that accommodations like this exist now. Things are so much better than when I was in school.",
      "created_utc": 1660658154.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ikj3iyh",
      "author": "lieunee",
      "body": "Thanks so much for the feedback, everyone!",
      "created_utc": 1660663556.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ikqjxh3",
      "author": "thebeautifulduckling",
      "body": "WHAT THE HECK. \nThis is actually amazing, I had no idea this kind of thing was possible! Bless you for being an advocate for your kiddo, he is SO lucky to have you",
      "created_utc": 1660785510.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ikmcbej",
      "author": "treefittybananas",
      "body": "That's amazing.  I'm so happy for you and your son.  As someone with ARFID and also as someone who tried so hard to be a SPED inclusion teacher for as long as I could tolerate it, verrrry long story short, it makes me extremely happy to read this.  I really wish I had the same thing when I was a kid, too, and I can only imagine how many people with ARFID would say the same if they'd known about it sooner in life and could've had the same support.  I would always pack a Pepsi and a fancy cake snack cake, wolf them down before students finished lining up in the cafeteria, and then hide in the bathroom until lunch was over every day for so much of my K-12 years just because I couldn't tolerate the smells of the disgusting excuses for food that was served.  One of the only exceptions was in kindergarten, my first week of attending school whatsoever, I tried telling my teachers I couldn't be in the cafeteria if they were serving fish because I'd puke.  I didn't ever have an IEP or anything and wasn't aware I had ARFID until adulthood, but they forced me to go anyway.  Not ten minutes later, I threw up all over the entire 24-foot long tables and more than half the kids had to go back through line for second lunches, and it held up the next group of kids I was also humiliated in front of when they loudly went off about what I had done to hold them up.  They called my mom saying I was sick and needed to go home, she was like, \"I'm sure she told someone she couldn't be around them serving that, right?\" They said, \"Well, yeah, but she has to be in here with everyone else.\" This was one of three times my mom ever took up for me, and she was like, \"It seems to me that if you didn't listen to her, it's your fault and you shouldn't subject kids to that kind of treatment.  She feels fine.  I'm not taking her home.  If she says she can't be around the food they're serving because it'll make her sick, maybe next time you'll fucking listen to her.\"  And honestly, after seeing so many IEPs violated left and right with no accountability in the school I worked for, I'm relieved that there's hope here for kids dealing with the same issues, too.  Thank you so much for sharing this.",
      "created_utc": 1660713440.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ikk05cd",
      "author": "WeakDress4909",
      "body": "This is so smart! I didn’t even know we could do this. Thanks for posting.",
      "created_utc": 1660675785.0,
      "score": 5,
      "context": [
        {
          "id": "ikfh9qx",
          "author": "lieunee",
          "body": "Hope it’s ok I posted this. I know there are a lot of parents who lurk this sub, plus I’m excited to do something for my kid I wish my parents had been able to do for me.",
          "created_utc": 1660595485.0
        }
      ]
    },
    {
      "id": "ikfn2g1",
      "author": "lieunee",
      "body": "Not off topic, at all. Thanks!",
      "created_utc": 1660597685.0,
      "score": 6,
      "context": [
        {
          "id": "ikfmk76",
          "author": "TyNyeTheTransGuy",
          "body": "Congrats on getting the paperwork in!! \n\nI don’t have any direct experience with IEPs but someone I know has had to deal with them (a parent and their teenager with lifelong nameless disability that school doesn’t take seriously) and from what they’ve said time and time again, sometimes schools just straight up don’t take disability stuff seriously and will try to get away with things. But from what they’ve said, IEPs are a huge step since they HAVE to follow them to the letter, so even if you aren’t *actually* prepared to fight them in court/with the state over it, you have to be a super strong advocate for your son and insist that they do as the letter says. Schools want to cover their own asses, make sure they see your son can’t and won’t just “deal with it”. They’ve also had issues with the school trying to persuade them into a 504 plan, which (unless I have it backwards) isn’t as heavily enforceable since afaik it doesn’t involve the state making sure the school follows it. Their school district tried to convince them to have both at one point with the apparent end goal of getting rid of the IEP since the 504 would supposedly be “enough” (it’s not). Really the school wanted more wiggle room to ignore the kid and do what they wanted. Beware of that, but hopefully your district isn’t so malicious.\n\n I hope this wasn’t too off topic and that it’s at least somewhat helpful advice, good luck to you and your son!",
          "created_utc": 1660597489.0
        }
      ]
    },
    {
      "id": "ikipexz",
      "author": "Magazinebeast",
      "body": "504 plans are still enforceable, under disability rights. It is true that they do not get as much direct oversight as IEPs do though. \n\nIn general, IEPs are for students that will need educational accommodations and services that include special instruction and 504s are for all other accommodations (physical access, excused frequent medical absence, some tech supports as examples) for students that can otherwise access education with their peers. In all honesty, if the removal for meals and food accommodations are all OPs child has a 504 would be more appropriate.",
      "created_utc": 1660658072.0,
      "score": 3,
      "context": [
        {
          "id": "ikfmk76",
          "author": "TyNyeTheTransGuy",
          "body": "Congrats on getting the paperwork in!! \n\nI don’t have any direct experience with IEPs but someone I know has had to deal with them (a parent and their teenager with lifelong nameless disability that school doesn’t take seriously) and from what they’ve said time and time again, sometimes schools just straight up don’t take disability stuff seriously and will try to get away with things. But from what they’ve said, IEPs are a huge step since they HAVE to follow them to the letter, so even if you aren’t *actually* prepared to fight them in court/with the state over it, you have to be a super strong advocate for your son and insist that they do as the letter says. Schools want to cover their own asses, make sure they see your son can’t and won’t just “deal with it”. They’ve also had issues with the school trying to persuade them into a 504 plan, which (unless I have it backwards) isn’t as heavily enforceable since afaik it doesn’t involve the state making sure the school follows it. Their school district tried to convince them to have both at one point with the apparent end goal of getting rid of the IEP since the 504 would supposedly be “enough” (it’s not). Really the school wanted more wiggle room to ignore the kid and do what they wanted. Beware of that, but hopefully your district isn’t so malicious.\n\n I hope this wasn’t too off topic and that it’s at least somewhat helpful advice, good luck to you and your son!",
          "created_utc": 1660597489.0
        }
      ]
    },
    {
      "id": "ikmyjrt",
      "author": "lieunee",
      "body": "Oh man, I am so sorry. The smells get to my son too. I could tolerate them but couldn’t bear to eat or be around everyone eating in the cafeteria so, I often asked to go to the bathroom then hid in empty classrooms during lunch. When I was in the cafeteria I would just stare at the door to the playground waiting until they opened then I would bolt.\n\nLast year I ordered an essential oils sampler and my son and I went through one by one to find which scents he liked. I then put a cotton ball with a couple drops of oil in his lunch box so he had an emergency pleasant smell if needed. I’ve also carried around lemons for the same purpose. Scratch the peel, hand it to him, instant fresh scent. Last year we finally worked out he could eat lunch (see: sit undisturbed) away from where other kids were eating but that led to teasing (which he said was better than being around kids eating, I can’t argue that) but not every teacher / lunch monitor allowed him to do this. (Which is why he now has a laminated note from me in his lunch box.) Some lunch monitors decided he wasn’t allowed to go to recess until he ate something so my poor kid was not even able to go outside. By the end of the year I convinced the school to let me sit at the playground picnic table with him during lunch and that mostly worked but was logistically awkward and the weather didn’t always cooperate. \n\nANYWAY. He’s 7. If he’s gonna hate school I want it to be because of things like homework and group projects, not lunch. I want him to grow up feeling like he can go to a friend’s house after school or do an extracurricular. I didn’t do those things because I would get too tired and hungry. I want him to be able to focus on learning and not suffer the all too familiar combo of morning dread of the cafeteria followed by afternoon stomach grumbling. \n\nI don’t know how many different ways I’ll need to communicate this to his schools over time, or how much I’m going to have to fight. I know some years will be better than others. But, we fought for therapy, we fought for a diagnosis, we’ll keep going.\n\nSometimes though I want to scream (at the school, not him) “IT’S JUST LUNCH!” He’s present and attentive in class, he’s friendly with his peers, he’s not asking for anything (in fact he’s literally asking for nothing). Give him a freaking break when he politely declines a fruit cup or whatever. Like, seriously.\n\nOH, and you did warn them about the fish smell. I have a severe fear of needles (was worse when I was a kid but, yeah). I once went to class only to learn we were going to be watching a video about blood donation. I told my teacher “I absolutely cannot watch this” and asked to go to the library. He refused. The video started and I asked to go to the bathroom. He refused. I threw up, passed out, and hit my head on a filing cabinet. When I woke up, dude was like “I probably should have let you go to the library.” I’m sympathetic to teachers, I really am. They have a lot on their plate. Some of us just literally can’t do what they’re asking.",
      "created_utc": 1660730813.0,
      "score": 2,
      "context": [
        {
          "id": "ikmcbej",
          "author": "treefittybananas",
          "body": "That's amazing.  I'm so happy for you and your son.  As someone with ARFID and also as someone who tried so hard to be a SPED inclusion teacher for as long as I could tolerate it, verrrry long story short, it makes me extremely happy to read this.  I really wish I had the same thing when I was a kid, too, and I can only imagine how many people with ARFID would say the same if they'd known about it sooner in life and could've had the same support.  I would always pack a Pepsi and a fancy cake snack cake, wolf them down before students finished lining up in the cafeteria, and then hide in the bathroom until lunch was over every day for so much of my K-12 years just because I couldn't tolerate the smells of the disgusting excuses for food that was served.  One of the only exceptions was in kindergarten, my first week of attending school whatsoever, I tried telling my teachers I couldn't be in the cafeteria if they were serving fish because I'd puke.  I didn't ever have an IEP or anything and wasn't aware I had ARFID until adulthood, but they forced me to go anyway.  Not ten minutes later, I threw up all over the entire 24-foot long tables and more than half the kids had to go back through line for second lunches, and it held up the next group of kids I was also humiliated in front of when they loudly went off about what I had done to hold them up.  They called my mom saying I was sick and needed to go home, she was like, \"I'm sure she told someone she couldn't be around them serving that, right?\" They said, \"Well, yeah, but she has to be in here with everyone else.\" This was one of three times my mom ever took up for me, and she was like, \"It seems to me that if you didn't listen to her, it's your fault and you shouldn't subject kids to that kind of treatment.  She feels fine.  I'm not taking her home.  If she says she can't be around the food they're serving because it'll make her sick, maybe next time you'll fucking listen to her.\"  And honestly, after seeing so many IEPs violated left and right with no accountability in the school I worked for, I'm relieved that there's hope here for kids dealing with the same issues, too.  Thank you so much for sharing this.",
          "created_utc": 1660713440.0
        }
      ]
    },
    {
      "id": "ikix06o",
      "author": "lieunee",
      "body": "Thanks for this! It is rolled up with a couple other things but I’m still learning how all this works. Last year we had nothing formal. He’s still in elementary, a lot of trial and error is ahead. We may need a 504. My goal is to have it down to a science by the time he hits middle school.",
      "created_utc": 1660661187.0,
      "score": 2,
      "context": [
        {
          "id": "ikfmk76",
          "author": "TyNyeTheTransGuy",
          "body": "Congrats on getting the paperwork in!! \n\nI don’t have any direct experience with IEPs but someone I know has had to deal with them (a parent and their teenager with lifelong nameless disability that school doesn’t take seriously) and from what they’ve said time and time again, sometimes schools just straight up don’t take disability stuff seriously and will try to get away with things. But from what they’ve said, IEPs are a huge step since they HAVE to follow them to the letter, so even if you aren’t *actually* prepared to fight them in court/with the state over it, you have to be a super strong advocate for your son and insist that they do as the letter says. Schools want to cover their own asses, make sure they see your son can’t and won’t just “deal with it”. They’ve also had issues with the school trying to persuade them into a 504 plan, which (unless I have it backwards) isn’t as heavily enforceable since afaik it doesn’t involve the state making sure the school follows it. Their school district tried to convince them to have both at one point with the apparent end goal of getting rid of the IEP since the 504 would supposedly be “enough” (it’s not). Really the school wanted more wiggle room to ignore the kid and do what they wanted. Beware of that, but hopefully your district isn’t so malicious.\n\n I hope this wasn’t too off topic and that it’s at least somewhat helpful advice, good luck to you and your son!",
          "created_utc": 1660597489.0
        },
        {
          "id": "ikipexz",
          "author": "Magazinebeast",
          "body": "504 plans are still enforceable, under disability rights. It is true that they do not get as much direct oversight as IEPs do though. \n\nIn general, IEPs are for students that will need educational accommodations and services that include special instruction and 504s are for all other accommodations (physical access, excused frequent medical absence, some tech supports as examples) for students that can otherwise access education with their peers. In all honesty, if the removal for meals and food accommodations are all OPs child has a 504 would be more appropriate.",
          "created_utc": 1660658072.0
        }
      ]
    }
  ]
}