{
  "id": "xdhy75",
  "subreddit": "ARFID",
  "author": "Aiolitothesandwich",
  "created_utc": 1663101505.0,
  "title": "I wish I could \"just eat\"",
  "selftext": "Undiagnosed, if I don't have ARFID it's gotta be some other disordered eating. It's been a constant battle my whole effing life.\n\nyet people who don't watch me try to force myself to eat will have the audacity to tell me to \"just eat\"\n\nYou think I don't try? Just to end up gagging on food that I usually like, making me even more turned off to eating for longer. \n\nI can put the food in my mouth, chew it, but if I don't want it, swallowing is almost impossible\n\nI want to eat, I want to be easy. \n\nI'm so tired",
  "url": "https://www.reddit.com/r/ARFID/comments/xdhy75/i_wish_i_could_just_eat/",
  "score": 113,
  "num_comments": 12,
  "comments": [
    {
      "id": "iobcqou",
      "author": "Auntie2Joints",
      "body": "I feel you, sug. Some days are so hard... You've got all us here for you, though. <hugs>",
      "created_utc": 1663106166.0,
      "score": 15,
      "context": []
    },
    {
      "id": "iobal77",
      "author": "KatsaridaReign",
      "body": "I completely understand that feeling. I have been there. Can't even always get the food to my mouth but when I can I just chew forever.\n\nI have found that liquid is easier for me than food is a lot of the time, and so if I'm having a really rough time of it I will go for a nutrition drink of some variety. It took some testing before I found ones that were tolerable. They vary widely.\n\nAnother thing that helped me was figuring out what textures are more likely to be edible and which ones are more likely to set me off such that I can't eat for a while. Once I learned the safest textures, I have tried to make sure to have that type of food around. It doesn't always work, but sometimes it helps.\n\nI wish the \"just eat\" people could walk a mile in my shoes.",
      "created_utc": 1663105295.0,
      "score": 11,
      "context": []
    },
    {
      "id": "ioc6msf",
      "author": "Cajjunb",
      "body": "There was a time that i could only eat 5 or 6 things, i was 16-17.\nI challenged myself to at least chew the food that i wasnt used to at least 15 times.\nI challenged myself to try the smallest cut vegetables i could find.\nYou can do it! You just need time and perseverance! You'll eventually do it!",
      "created_utc": 1663119261.0,
      "score": 9,
      "context": []
    },
    {
      "id": "ioc8zvf",
      "author": "nomoreadminspls",
      "body": "That's definitely arfid and I quite understand",
      "created_utc": 1663120302.0,
      "score": 3,
      "context": []
    },
    {
      "id": "iocy6vq",
      "author": "Jaffacakeyy",
      "body": "My word do I get this, I was diagnosed about 4 months ago now (I'm not sure, time boogles me) and this is beyond relatable but if you're struggling keep doing what you're doing basically like chewing a food you don't like then spitting it out or try (if you haven't already) cooking it in different ways to try it that way... By doing that sort of thing you are trying and succeeding, you probably won't realise it but these small wins of even having the food in your mouth are one of the best ways to improve because its feels less immense then sitting there saying \"I am going to eat this\" or \"just eat food\" because that's not realistic, setting smaller simple targets that you think you can mange and if you can't, it's okay, try something else. Whatever you do, don't put yourself down and don't listen to people who don't understand, go at your own pace and you can do it! \n\n\"just eat\" is a ludicrous thing to say to someone with any eating problem/disorder so ethier explain to them or just tell them to (excuse my French) bugger off.",
      "created_utc": 1663133267.0,
      "score": 3,
      "context": []
    },
    {
      "id": "iod3vik",
      "author": "phunkygeeza",
      "body": "Just stop being bald.\n\nCan you try to be a bit less white?\n\nJust try to have a high pitched voice when with family to make things easier \n\nCan't you find another arm to replace your lost one just for the wedding?",
      "created_utc": 1663137084.0,
      "score": 3,
      "context": []
    },
    {
      "id": "iof0tk0",
      "author": "tittylamp",
      "body": "also undiagnosed. this is my life as well. plus constant anxiety induced nausea/vomiting. i feel you bro.",
      "created_utc": 1663173840.0,
      "score": 3,
      "context": []
    },
    {
      "id": "iohavml",
      "author": "savannalee319",
      "body": "I feel the same way. The most frustrating thing ever is when I’m struggling to eat and a family member or friend says, “ur so picky omg just eat.”\nNo one really understands how different ARFID is than just simple picky eating unless it’s experienced. By far the most difficult thing I’ve ever faced in my life. Eating is a chore, and I know it shouldn’t be. I stare at my food until I have a pit in my stomach and I become all choked up and ready to start crying. And when I finally take a bite, I sit and chew and chew and chew and chew until it turns to mush. Swallowing is the most difficult part. But as time goes on it gets easier. There are still some extremely difficult and draining days, but the easier days feel so rewarding. I’ve finally made a breakthrough and made it into the minimum range of my goal weight! If I can do it you can too🫶🏻",
      "created_utc": 1663208791.0,
      "score": 2,
      "context": []
    },
    {
      "id": "irz2qnl",
      "author": "trashintreasure",
      "body": "Them: \"just eat, food is wonderful!\" \nMe: 🤢\n\nI've never had a doctor who knew about ARFID before I handed them papers on it. Even in eating disorder treatment it was misunderstood. This reddit is honestly so so key to my continued recovery. Just knowing there are more of us out there and that it really can get better.\n\nIt sucks, and I wouldn't wish it on anyone. Also I'm glad you're here!",
      "created_utc": 1665542133.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iobyl21",
      "author": "Aiolitothesandwich",
      "body": "Thank you. . I really needed this",
      "created_utc": 1663115713.0,
      "score": 6,
      "context": [
        {
          "id": "iobcqou",
          "author": "Auntie2Joints",
          "body": "I feel you, sug. Some days are so hard... You've got all us here for you, though. <hugs>",
          "created_utc": 1663106166.0
        }
      ]
    },
    {
      "id": "ioc8rua",
      "author": "Aiolitothesandwich",
      "body": "Thank you. I'm gonna keep this in mind",
      "created_utc": 1663120205.0,
      "score": 3,
      "context": [
        {
          "id": "iobal77",
          "author": "KatsaridaReign",
          "body": "I completely understand that feeling. I have been there. Can't even always get the food to my mouth but when I can I just chew forever.\n\nI have found that liquid is easier for me than food is a lot of the time, and so if I'm having a really rough time of it I will go for a nutrition drink of some variety. It took some testing before I found ones that were tolerable. They vary widely.\n\nAnother thing that helped me was figuring out what textures are more likely to be edible and which ones are more likely to set me off such that I can't eat for a while. Once I learned the safest textures, I have tried to make sure to have that type of food around. It doesn't always work, but sometimes it helps.\n\nI wish the \"just eat\" people could walk a mile in my shoes.",
          "created_utc": 1663105295.0
        }
      ]
    },
    {
      "id": "ioddyl4",
      "author": "Phantasizer",
      "body": "I’m over 40 and because I like traveling, it is still a problem for me, fortunately only a few times per year. But just this week I was invited to a ‘feast’ with plenty of food , all different kinds, and I was lucky to find one or two things of which I could at least eat a little bit. It wasn’t enough really, people wouldn’t stop asking me why I don’t eat more, what else do you want, don’t you like it….over and over again, it’s so annoying",
      "created_utc": 1663144779.0,
      "score": 5,
      "context": [
        {
          "id": "iobcqou",
          "author": "Auntie2Joints",
          "body": "I feel you, sug. Some days are so hard... You've got all us here for you, though. <hugs>",
          "created_utc": 1663106166.0
        },
        {
          "id": "iobyl21",
          "author": "Aiolitothesandwich",
          "body": "Thank you. . I really needed this",
          "created_utc": 1663115713.0
        }
      ]
    }
  ]
}