{
  "id": "xgml6r",
  "subreddit": "ARFID",
  "author": "Accomplished-Match50",
  "created_utc": 1663421461.0,
  "title": "Anyone else fall into a lot of categories of arfid?",
  "selftext": "",
  "url": "https://i.redd.it/rd70876i8fo91.jpg",
  "score": 170,
  "num_comments": 55,
  "comments": [
    {
      "id": "iosp3fr",
      "author": "Hungry-Primary8158",
      "body": "I don’t understand why so many people refuse to acknowledge that taste can be a factor in arfid. Most non arfid people would agree that taste is the most important sensory aspect of food, but the moment it’s about arfid people forget it exists. It’s extremely frustrating to me, as the avoidant side of my arfid revolves almost entirely around taste.",
      "created_utc": 1663422864.0,
      "score": 86,
      "context": []
    },
    {
      "id": "iotfjw9",
      "author": "CandidateSolid",
      "body": "Arfid+ sounds like yet another streaming service I’ll end up paying $15 a month for",
      "created_utc": 1663434121.0,
      "score": 76,
      "context": []
    },
    {
      "id": "iotdcll",
      "author": "maisalsa",
      "body": "i feel like restrictive type has something to do with adhd at least for me",
      "created_utc": 1663433225.0,
      "score": 25,
      "context": []
    },
    {
      "id": "iourf5s",
      "author": "fml2727",
      "body": "These are not the types of ARFID recognized by ARFID researchers and experts in psychology community. This is misinformation (not blaming op or anyone as there is a lot of misinformation regarding arfid)\n\nThe subtypes (while not yet in the DSM) are sensory, fear of adverse consequences, lack of interest in food. Also by definition ARFID is not impacted by body image issues, that would be another eating disorder or ARFID with a comorbid eating disorder.\n\nAnd yea you can have multiple types, most people do",
      "created_utc": 1663454557.0,
      "score": 18,
      "context": []
    },
    {
      "id": "iothpva",
      "author": "Myodokaii",
      "body": "I feel like I got a bingo by hitting all of them. Do I win something?\n\n/j",
      "created_utc": 1663435004.0,
      "score": 17,
      "context": []
    },
    {
      "id": "iosynhm",
      "author": "capitannn",
      "body": "Just avoidant for me, but it's pretty extreme",
      "created_utc": 1663427126.0,
      "score": 9,
      "context": []
    },
    {
      "id": "iot0sk3",
      "author": "None",
      "body": "I feel like I don’t fit into any of these. I have a little bit of all of them, yes, but mainly I avoid food outside of my safe foods because they garner disgust in me. Like, eating vegetables is akin to trying to eat poop. It just doesn’t register in my mind as food. Touching or smelling that food has the same effect. Like, if someone next to me is eating broccoli I feel like I need to wash my body in bleach.",
      "created_utc": 1663428038.0,
      "score": 9,
      "context": []
    },
    {
      "id": "iosqltr",
      "author": "wyldcynic",
      "body": "My 6yo is not formally diagnosed but she exhibits food avoidance that I would consider avoidant, aversive, and restrictive. She has sensory issues, lots of stomachaches and vomiting that makes her not want to eat and scared to try new food, and oftentimes has no hunger cues or will only eat a few bites of a meal.",
      "created_utc": 1663423565.0,
      "score": 8,
      "context": []
    },
    {
      "id": "iotd7qr",
      "author": "Mx-Helix-pomatia",
      "body": "“Individuals who are experiencing more than one type of ARFID can begin to develop feature of anorexia nervosa”\n\n*o h.*",
      "created_utc": 1663433171.0,
      "score": 13,
      "context": []
    },
    {
      "id": "ioth1ox",
      "author": "caralynncat",
      "body": "I'm curious on the source for this types/categories breakdown. I've seen it maybe twice and not in any peer reviewed research. I wonder of this is just some single therapist's breakdown that got popularized through tiktok or if it's a recognized thing.",
      "created_utc": 1663434732.0,
      "score": 7,
      "context": []
    },
    {
      "id": "iotg5qz",
      "author": "CaramelDramatic",
      "body": "I’m all but the last one. There are days where just thinking about the whole process of food is exhausting. By that I mean: picking out what to eat, cooking or getting it, eating, cleaning up. Some days it’s just too much to handle",
      "created_utc": 1663434368.0,
      "score": 5,
      "context": []
    },
    {
      "id": "iouoosg",
      "author": "Catmanfresh",
      "body": "Another aspect of ARFID as an adult is the stress of having to shop for, afford, prepare, store food etc.\n\nEspecially if you are like me and we're forced to work in a lot of food service jobs which were abusive and horrible (I think that neurodivergence is probably very common with people with arfid and we're also more likely to have horrible job experiences).\n\nGoing to the grocery store even if you have money the experience of the grocery store and not having transportation, having to have roommates even when you're older and share a fridge and a kitchen, weird hours if you're able to work so it's hard to get a normal schedule etc. \n\nPlus the stress of if you are also eternally single and in such poverty like living situations that having to always cook for yourself and never being able to afford take out and having food become something that is not fun and kind of depressing especially when the people around you who are supposed to be your friends and family seem to be completely unaffected by the reality of someone who is in your situation. \n\nIf eating or something that we didn't have to do I would happily give it up, it just consumes so much of life and so many ways. One huge gigantic thing that can take over your life if you're struggling with lots of health, money and living issues. \n\nIt never ends it's just something that you have to do every single day, on the harder it is to eat and all the stuff around food the more likely it is for my body to feel like garbage which makes it harder to overcome any of these things.\n\nAnd all the help run are for seems to be about trying to get people to eat more food rather than trying to improve the quality of life, though because of how we don't take care of our poor sick disabled people even if people did start thinking that way most of us wouldn't have access to what is recommended.\n\nThis subreddit is one of the only places where I've seen honest conversations about what it's like. It's all so exhausting.",
      "created_utc": 1663453316.0,
      "score": 5,
      "context": []
    },
    {
      "id": "iot6nxh",
      "author": "latenightsadhours",
      "body": "im mostly avoidant, and a little bit of restrictive (i constantly wish that i didn’t have to eat at all lol) and adult arfid, as ive been experiencing these symptoms my entire life. this post was really eye opening though, because recently i feel like ive been picking up more “”traditional”” eating disorder behaviors and now i wonder if im ARFID+ as well.",
      "created_utc": 1663430479.0,
      "score": 3,
      "context": []
    },
    {
      "id": "iotra32",
      "author": "littleghool",
      "body": "Adult avoidant here ✌️",
      "created_utc": 1663438931.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ioxouo4",
      "author": "Sylentt_",
      "body": "I think my ARFID has ties to my OCD? I have a disorder (trichotillomania) with heavy ties to OCD, and my ARFID has weird ties to OCD as well. Like, I have rules about eating that I can’t break or I feel like I’m going to die. Certain foods I can’t puncture with a fork. I prefer to eat them like finger food but if I’m forced I’ll scoop them with a fork. Puncturing them makes me intensely uncomfortable and I feel like I’m going to die. Some examples are broccoli, and green beans. idk why I have those rules, but I do, and my specialist said it’s a thing people with ARFID sometimes have.",
      "created_utc": 1663513940.0,
      "score": 3,
      "context": []
    },
    {
      "id": "iqgh92z",
      "author": "None",
      "body": "I'm just learning about this now! lol\n\nI've ALWAYS had eating issues.  I was just labeled a picky eater. It's caused a lot of issues, discomfort, and anxiety for me. People don't understand it and feel like they have to give their 2 cents on it. \n\nI have avoided get-togethers at people's homes when I've felt that my food choices could cause an issue. I don't want anybody having to prepare anything special for me. Usually, I can eat something of what is served. \n\nSome people get very offended when you don't want to eat something that they've prepared. I understand that as I cook myself. \n\nI have gotten somewhat better over the years. Their are definitely a lot of foods I will never eat, though.",
      "created_utc": 1664509439.0,
      "score": 3,
      "context": []
    },
    {
      "id": "iot0rd7",
      "author": "Mynotredditaccount",
      "body": "Anyone feel like they're in multiple categories 🥴😭",
      "created_utc": 1663428024.0,
      "score": 5,
      "context": []
    },
    {
      "id": "iotqf6j",
      "author": "Solid-Comment2490",
      "body": "I didn’t realize there were different types but I am all of these types lol yay me 🙃",
      "created_utc": 1663438576.0,
      "score": 2,
      "context": []
    },
    {
      "id": "iotsux4",
      "author": "cmerson",
      "body": "It is research based. Let me find it!",
      "created_utc": 1663439596.0,
      "score": 2,
      "context": []
    },
    {
      "id": "iov5at6",
      "author": "justvance",
      "body": "avoidant and restrictive",
      "created_utc": 1663461091.0,
      "score": 2,
      "context": []
    },
    {
      "id": "iov9kb3",
      "author": "snottyresort",
      "body": "Wait so you can have body image issues and still be ARFID?",
      "created_utc": 1663463105.0,
      "score": 2,
      "context": []
    },
    {
      "id": "iovt6xy",
      "author": "elainethebrain",
      "body": "I feel like there should be another type in between avoidant and aversive. I'm definitely more extreme than avoidant and less extreme as aversive.",
      "created_utc": 1663472781.0,
      "score": 2,
      "context": []
    },
    {
      "id": "iovtem5",
      "author": "snow_witch535",
      "body": "I fall in the first 3",
      "created_utc": 1663472900.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ioxo9t5",
      "author": "Sylentt_",
      "body": "Yeah only one I don’t have is “adult arfid” because I’m not an adult. It feels weird to break arfid down into more labels, because I literally experience all of this. Also I can’t get over how “ARFID+” sounds like a goddamn subscription service. “Limited Time offer! Two EDs for the price of one!!”",
      "created_utc": 1663513708.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jvcyf3k",
      "author": "justbrowsing_______",
      "body": "I dont think i have arfid but I forget to eat and don't have the executive function to eat and find eating and drinking to be a chore (adhd + autism)\n\nI'm only  moderately picky tho",
      "created_utc": 1691531505.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kz1zn4m",
      "author": "ecstasyangell",
      "body": "i’m 100% avoidant and 100% restrictive. it is living hell.",
      "created_utc": 1712830519.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iotatyu",
      "author": "turnipkitty112",
      "body": "Yeah, I guess i have avoidant ARFID+ (and techincally adult too?)\n\nAlso what would you call it if you have comorbid GI issues that make it difficult to eat and cause anxiety around food? Like I’m not irrationally scared of vomiting/nausea, it’s just that it actually happens a lot and therefore kills my appetite…",
      "created_utc": 1663432203.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ipom7tf",
      "author": "lizabellarose1234",
      "body": "Restrictive   .. fear of diarrhea",
      "created_utc": 1663995467.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jvcyea3",
      "author": "justbrowsing_______",
      "body": "I dont think i have arfid but I forget to eat and don't have the executive function to eat and find eating and drinking to be a chore (adhd + autism)\n\nI'm only  moderately picky tho",
      "created_utc": 1691531497.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jz83i90",
      "author": "GlitteringBimbo",
      "body": "Okay but why is this me? I’m afraid to choking and afraid of anaphylactic shock, I can’t eat food unless it’s a certain consistency and a lot of the times I end up spitting out food out of fear of choking I’ve had multiple barium swallows some even that manometry test everything came back perfect yet I can’t bring myself to eat certain foods. I don’t know if it’s a manifestation of my own anxiety\nBut when I do chew food I end up choking every time. Yet the swallowing test study shows everything working fine…",
      "created_utc": 1693917294.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k3h0e1z",
      "author": "OddAd3525",
      "body": "Anyone found any effective treatment for long-term ARFID?",
      "created_utc": 1696447856.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ksgagdp",
      "author": "None",
      "body": "I have restrictive kind",
      "created_utc": 1709075728.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iosr49f",
      "author": "Accomplished-Match50",
      "body": "Definitely, agree with thiss. Everyone is so different and has different experiences of arfid that aren’t discussed about as much, taste is definitely a huge factor for me too",
      "created_utc": 1663423801.0,
      "score": 22,
      "context": [
        {
          "id": "iosp3fr",
          "author": "Hungry-Primary8158",
          "body": "I don’t understand why so many people refuse to acknowledge that taste can be a factor in arfid. Most non arfid people would agree that taste is the most important sensory aspect of food, but the moment it’s about arfid people forget it exists. It’s extremely frustrating to me, as the avoidant side of my arfid revolves almost entirely around taste.",
          "created_utc": 1663422864.0
        }
      ]
    },
    {
      "id": "iotvupd",
      "author": "CrashTestDumby1984",
      "body": "Except for this one I can’t figure out how to cancel",
      "created_utc": 1663440858.0,
      "score": 28,
      "context": [
        {
          "id": "iotfjw9",
          "author": "CandidateSolid",
          "body": "Arfid+ sounds like yet another streaming service I’ll end up paying $15 a month for",
          "created_utc": 1663434121.0
        }
      ]
    },
    {
      "id": "iotfopw",
      "author": "Accomplished-Match50",
      "body": "Ahah me too",
      "created_utc": 1663434177.0,
      "score": 4,
      "context": [
        {
          "id": "iotfjw9",
          "author": "CandidateSolid",
          "body": "Arfid+ sounds like yet another streaming service I’ll end up paying $15 a month for",
          "created_utc": 1663434121.0
        }
      ]
    },
    {
      "id": "iotsjyb",
      "author": "cmerson",
      "body": "ADHD, Autism and some intellectual disabilities are actually risk factors for ARFID. https://www.verywellmind.com/what-is-arfid-4137232",
      "created_utc": 1663439467.0,
      "score": 20,
      "context": [
        {
          "id": "iotdcll",
          "author": "maisalsa",
          "body": "i feel like restrictive type has something to do with adhd at least for me",
          "created_utc": 1663433225.0
        }
      ]
    },
    {
      "id": "iotrf64",
      "author": "littleghool",
      "body": "Same here",
      "created_utc": 1663438989.0,
      "score": 1,
      "context": [
        {
          "id": "iosynhm",
          "author": "capitannn",
          "body": "Just avoidant for me, but it's pretty extreme",
          "created_utc": 1663427126.0
        }
      ]
    },
    {
      "id": "m75u8p6",
      "author": "ShyTownHigh",
      "body": "Sounds like avoidant",
      "created_utc": 1736888744.0,
      "score": 1,
      "context": [
        {
          "id": "iot0sk3",
          "author": "None",
          "body": "I feel like I don’t fit into any of these. I have a little bit of all of them, yes, but mainly I avoid food outside of my safe foods because they garner disgust in me. Like, eating vegetables is akin to trying to eat poop. It just doesn’t register in my mind as food. Touching or smelling that food has the same effect. Like, if someone next to me is eating broccoli I feel like I need to wash my body in bleach.",
          "created_utc": 1663428038.0
        }
      ]
    },
    {
      "id": "iovwapu",
      "author": "EyeBirb",
      "body": "I hope you're seeing specialists if you can. It's extremely important to nip it in the bud as young as possible",
      "created_utc": 1663474550.0,
      "score": 4,
      "context": [
        {
          "id": "iosqltr",
          "author": "wyldcynic",
          "body": "My 6yo is not formally diagnosed but she exhibits food avoidance that I would consider avoidant, aversive, and restrictive. She has sensory issues, lots of stomachaches and vomiting that makes her not want to eat and scared to try new food, and oftentimes has no hunger cues or will only eat a few bites of a meal.",
          "created_utc": 1663423565.0
        }
      ]
    },
    {
      "id": "ioz0nh0",
      "author": "OddAd3525",
      "body": "Sometimes Arfid in children is a manifestation of Inflammatory Bowel Disease.  My child finally got diagnosed with Crohn's Disease which accounted for his trouble eating.",
      "created_utc": 1663531887.0,
      "score": 2,
      "context": [
        {
          "id": "iosqltr",
          "author": "wyldcynic",
          "body": "My 6yo is not formally diagnosed but she exhibits food avoidance that I would consider avoidant, aversive, and restrictive. She has sensory issues, lots of stomachaches and vomiting that makes her not want to eat and scared to try new food, and oftentimes has no hunger cues or will only eat a few bites of a meal.",
          "created_utc": 1663423565.0
        }
      ]
    },
    {
      "id": "iotr62x",
      "author": "KennaLikesPizza",
      "body": "I literally got diagnosed with arfid 5 days ago- I thought it would make me feel better, but I've noticed this happening to me :(((",
      "created_utc": 1663438885.0,
      "score": 3,
      "context": [
        {
          "id": "iotd7qr",
          "author": "Mx-Helix-pomatia",
          "body": "“Individuals who are experiencing more than one type of ARFID can begin to develop feature of anorexia nervosa”\n\n*o h.*",
          "created_utc": 1663433171.0
        }
      ]
    },
    {
      "id": "iots9xd",
      "author": "deandratb",
      "body": "It reminds me of the breakdown in The Picky Eater's Recovery Book, just with different (maybe meant to be simpler to understand) names. Avoidant = sensory sensitivity, aversive = fear of adverse consequences, restrictive = low appetite. \n\nThat book was written by three ARFID specialists at Harvard Medical School so I have no idea if things may have gotten lost in online translation/tiktok explainers, but it was my first introduction to the idea that you could only have some aspects of ARFID rather than all of them...I have all three and assumed that was standard.",
      "created_utc": 1663439348.0,
      "score": 6,
      "context": [
        {
          "id": "ioth1ox",
          "author": "caralynncat",
          "body": "I'm curious on the source for this types/categories breakdown. I've seen it maybe twice and not in any peer reviewed research. I wonder of this is just some single therapist's breakdown that got popularized through tiktok or if it's a recognized thing.",
          "created_utc": 1663434732.0
        }
      ]
    },
    {
      "id": "ioth65x",
      "author": "Accomplished-Match50",
      "body": "yeah that’s what I was thinking, never heard about it until now",
      "created_utc": 1663434782.0,
      "score": 1,
      "context": [
        {
          "id": "ioth1ox",
          "author": "caralynncat",
          "body": "I'm curious on the source for this types/categories breakdown. I've seen it maybe twice and not in any peer reviewed research. I wonder of this is just some single therapist's breakdown that got popularized through tiktok or if it's a recognized thing.",
          "created_utc": 1663434732.0
        }
      ]
    },
    {
      "id": "ip7z0im",
      "author": "ifoundxaway",
      "body": "Oh, wow.   I was telling myself I was lazy for being overwhelmed by and too tired to do food things.  Sometimes just thinking of doing food things is exhausting (I have chronic health conditions).  I really feel like if I could afford to eat out more,  I would at least try.  It might be more safe foods, but at least I'd be eating.  Sometimes the act of eating is exhausting.   I wish I could hook myself up to an IV full of all the nutrients I need every day.",
      "created_utc": 1663695532.0,
      "score": 5,
      "context": [
        {
          "id": "iouoosg",
          "author": "Catmanfresh",
          "body": "Another aspect of ARFID as an adult is the stress of having to shop for, afford, prepare, store food etc.\n\nEspecially if you are like me and we're forced to work in a lot of food service jobs which were abusive and horrible (I think that neurodivergence is probably very common with people with arfid and we're also more likely to have horrible job experiences).\n\nGoing to the grocery store even if you have money the experience of the grocery store and not having transportation, having to have roommates even when you're older and share a fridge and a kitchen, weird hours if you're able to work so it's hard to get a normal schedule etc. \n\nPlus the stress of if you are also eternally single and in such poverty like living situations that having to always cook for yourself and never being able to afford take out and having food become something that is not fun and kind of depressing especially when the people around you who are supposed to be your friends and family seem to be completely unaffected by the reality of someone who is in your situation. \n\nIf eating or something that we didn't have to do I would happily give it up, it just consumes so much of life and so many ways. One huge gigantic thing that can take over your life if you're struggling with lots of health, money and living issues. \n\nIt never ends it's just something that you have to do every single day, on the harder it is to eat and all the stuff around food the more likely it is for my body to feel like garbage which makes it harder to overcome any of these things.\n\nAnd all the help run are for seems to be about trying to get people to eat more food rather than trying to improve the quality of life, though because of how we don't take care of our poor sick disabled people even if people did start thinking that way most of us wouldn't have access to what is recommended.\n\nThis subreddit is one of the only places where I've seen honest conversations about what it's like. It's all so exhausting.",
          "created_utc": 1663453316.0
        }
      ]
    },
    {
      "id": "ip5umcb",
      "author": "Accomplished-Match50",
      "body": "That’s interesting because I had trich, never connected the dots actually",
      "created_utc": 1663653264.0,
      "score": 2,
      "context": [
        {
          "id": "ioxouo4",
          "author": "Sylentt_",
          "body": "I think my ARFID has ties to my OCD? I have a disorder (trichotillomania) with heavy ties to OCD, and my ARFID has weird ties to OCD as well. Like, I have rules about eating that I can’t break or I feel like I’m going to die. Certain foods I can’t puncture with a fork. I prefer to eat them like finger food but if I’m forced I’ll scoop them with a fork. Puncturing them makes me intensely uncomfortable and I feel like I’m going to die. Some examples are broccoli, and green beans. idk why I have those rules, but I do, and my specialist said it’s a thing people with ARFID sometimes have.",
          "created_utc": 1663513940.0
        }
      ]
    },
    {
      "id": "iot559c",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1663429852.0,
      "score": 7,
      "context": [
        {
          "id": "iot0rd7",
          "author": "Mynotredditaccount",
          "body": "Anyone feel like they're in multiple categories 🥴😭",
          "created_utc": 1663428024.0
        }
      ]
    },
    {
      "id": "iowmf8w",
      "author": "Accomplished-Match50",
      "body": "yeah I found I started to develop the typical anorexia symptoms after a lifetime of arfid, I struggle with body image a lot even though I was constantly told that arfid was not based on body image at all. I guess it’s just different for everyone",
      "created_utc": 1663493603.0,
      "score": 3,
      "context": [
        {
          "id": "iov9kb3",
          "author": "snottyresort",
          "body": "Wait so you can have body image issues and still be ARFID?",
          "created_utc": 1663463105.0
        }
      ]
    },
    {
      "id": "ip5uoah",
      "author": "Accomplished-Match50",
      "body": "Lmao literally haha",
      "created_utc": 1663653304.0,
      "score": 2,
      "context": [
        {
          "id": "ioxo9t5",
          "author": "Sylentt_",
          "body": "Yeah only one I don’t have is “adult arfid” because I’m not an adult. It feels weird to break arfid down into more labels, because I literally experience all of this. Also I can’t get over how “ARFID+” sounds like a goddamn subscription service. “Limited Time offer! Two EDs for the price of one!!”",
          "created_utc": 1663513708.0
        }
      ]
    },
    {
      "id": "iovzdej",
      "author": "Ryzarony23",
      "body": "Add PDA and CPTSD, and you have me.",
      "created_utc": 1663476402.0,
      "score": 9,
      "context": [
        {
          "id": "iotdcll",
          "author": "maisalsa",
          "body": "i feel like restrictive type has something to do with adhd at least for me",
          "created_utc": 1663433225.0
        },
        {
          "id": "iotsjyb",
          "author": "cmerson",
          "body": "ADHD, Autism and some intellectual disabilities are actually risk factors for ARFID. https://www.verywellmind.com/what-is-arfid-4137232",
          "created_utc": 1663439467.0
        }
      ]
    },
    {
      "id": "iovxg8g",
      "author": "wyldcynic",
      "body": "Oh we are seeing them all. She’s in therapy and seeing a GI now. If GI doesn’t find anything we will probably see neurologist and allergist next. We’ve enrolled in an ARFID study starting soon. Her pediatrician is aware but we just keep getting referred to specialists and doing tons of tests. A few years back we saw an endocrinologist, developmental pediatrician, did a sleep study, did environmental allergy testing, abdominal x-rays. It’s been a real journey that I feel has just led us in circles.",
      "created_utc": 1663475231.0,
      "score": 4,
      "context": [
        {
          "id": "iosqltr",
          "author": "wyldcynic",
          "body": "My 6yo is not formally diagnosed but she exhibits food avoidance that I would consider avoidant, aversive, and restrictive. She has sensory issues, lots of stomachaches and vomiting that makes her not want to eat and scared to try new food, and oftentimes has no hunger cues or will only eat a few bites of a meal.",
          "created_utc": 1663423565.0
        },
        {
          "id": "iovwapu",
          "author": "EyeBirb",
          "body": "I hope you're seeing specialists if you can. It's extremely important to nip it in the bud as young as possible",
          "created_utc": 1663474550.0
        }
      ]
    },
    {
      "id": "iozssjf",
      "author": "wyldcynic",
      "body": "Yes I think an endoscopy is going to have to be our next diagnostic step. Lots of testing being done to rule things out right now.",
      "created_utc": 1663542925.0,
      "score": 1,
      "context": [
        {
          "id": "iosqltr",
          "author": "wyldcynic",
          "body": "My 6yo is not formally diagnosed but she exhibits food avoidance that I would consider avoidant, aversive, and restrictive. She has sensory issues, lots of stomachaches and vomiting that makes her not want to eat and scared to try new food, and oftentimes has no hunger cues or will only eat a few bites of a meal.",
          "created_utc": 1663423565.0
        },
        {
          "id": "ioz0nh0",
          "author": "OddAd3525",
          "body": "Sometimes Arfid in children is a manifestation of Inflammatory Bowel Disease.  My child finally got diagnosed with Crohn's Disease which accounted for his trouble eating.",
          "created_utc": 1663531887.0
        }
      ]
    },
    {
      "id": "k3h04om",
      "author": "OddAd3525",
      "body": "Same.  My child had early onset Crohn’s Disease and wasn’t correctly diagnosed till he was 11.  Avoided food all his life.  Still does as an adult.",
      "created_utc": 1696447767.0,
      "score": 1,
      "context": [
        {
          "id": "iosqltr",
          "author": "wyldcynic",
          "body": "My 6yo is not formally diagnosed but she exhibits food avoidance that I would consider avoidant, aversive, and restrictive. She has sensory issues, lots of stomachaches and vomiting that makes her not want to eat and scared to try new food, and oftentimes has no hunger cues or will only eat a few bites of a meal.",
          "created_utc": 1663423565.0
        },
        {
          "id": "ioz0nh0",
          "author": "OddAd3525",
          "body": "Sometimes Arfid in children is a manifestation of Inflammatory Bowel Disease.  My child finally got diagnosed with Crohn's Disease which accounted for his trouble eating.",
          "created_utc": 1663531887.0
        }
      ]
    },
    {
      "id": "iotxhhl",
      "author": "Mx-Helix-pomatia",
      "body": "Putting a label to something initially makes you notice it more, don’t worry :)",
      "created_utc": 1663441549.0,
      "score": 5,
      "context": [
        {
          "id": "iotd7qr",
          "author": "Mx-Helix-pomatia",
          "body": "“Individuals who are experiencing more than one type of ARFID can begin to develop feature of anorexia nervosa”\n\n*o h.*",
          "created_utc": 1663433171.0
        },
        {
          "id": "iotr62x",
          "author": "KennaLikesPizza",
          "body": "I literally got diagnosed with arfid 5 days ago- I thought it would make me feel better, but I've noticed this happening to me :(((",
          "created_utc": 1663438885.0
        }
      ]
    },
    {
      "id": "iotvtkv",
      "author": "caralynncat",
      "body": "I have the book and have found it very helpful. I agree that this may be a lost in translation type of situation. Unfortunately by trying to make it easy to digest, things may have been a little misconstrued.",
      "created_utc": 1663440845.0,
      "score": 3,
      "context": [
        {
          "id": "ioth1ox",
          "author": "caralynncat",
          "body": "I'm curious on the source for this types/categories breakdown. I've seen it maybe twice and not in any peer reviewed research. I wonder of this is just some single therapist's breakdown that got popularized through tiktok or if it's a recognized thing.",
          "created_utc": 1663434732.0
        },
        {
          "id": "iots9xd",
          "author": "deandratb",
          "body": "It reminds me of the breakdown in The Picky Eater's Recovery Book, just with different (maybe meant to be simpler to understand) names. Avoidant = sensory sensitivity, aversive = fear of adverse consequences, restrictive = low appetite. \n\nThat book was written by three ARFID specialists at Harvard Medical School so I have no idea if things may have gotten lost in online translation/tiktok explainers, but it was my first introduction to the idea that you could only have some aspects of ARFID rather than all of them...I have all three and assumed that was standard.",
          "created_utc": 1663439348.0
        }
      ]
    },
    {
      "id": "iotj2x6",
      "author": "caralynncat",
      "body": "I also don't understand the importance of this breakdown. I would understand separating trauma vs sensory (again possible to see both) which is found in peer reviewed research. But separating Avoidant and Restrictive is very counterintuitive as by definition someone with ARFID has both...",
      "created_utc": 1663435552.0,
      "score": 6,
      "context": [
        {
          "id": "ioth1ox",
          "author": "caralynncat",
          "body": "I'm curious on the source for this types/categories breakdown. I've seen it maybe twice and not in any peer reviewed research. I wonder of this is just some single therapist's breakdown that got popularized through tiktok or if it's a recognized thing.",
          "created_utc": 1663434732.0
        },
        {
          "id": "ioth65x",
          "author": "Accomplished-Match50",
          "body": "yeah that’s what I was thinking, never heard about it until now",
          "created_utc": 1663434782.0
        }
      ]
    },
    {
      "id": "iothb81",
      "author": "Accomplished-Match50",
      "body": "😭",
      "created_utc": 1663434839.0,
      "score": 2,
      "context": [
        {
          "id": "iot0rd7",
          "author": "Mynotredditaccount",
          "body": "Anyone feel like they're in multiple categories 🥴😭",
          "created_utc": 1663428024.0
        },
        {
          "id": "iot559c",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1663429852.0
        }
      ]
    }
  ]
}