{
  "id": "xm43tw",
  "subreddit": "ARFID",
  "author": "mamaxchaos",
  "created_utc": 1663954888.0,
  "title": "mind-blowing revelation: if there are aspects of food I can’t eat, but those foods are things I WANT to eat, I can take away the obstacles holding me back",
  "selftext": "These are such small things and I feel silly for not realizing it sooner. Here’s some examples: \n\nStrawberries: seeds are bad, and I can’t handle them even in smoothies or anything BUT I cut off the outside of strawberries yesterday to get rid of all the seeds and I ATE THEM and they were DELICIOUS \n\nPasta salad: there’s just a bunch of textures I hate, but it’s so easy to eat and I don’t have to heat/cook it. I made it yesterday and just DIDN’T put the things that are “supposed” to be in it. It’s just the dressing, cheese, and some scoops of a completely tasteless and texture-free protein powder - filling and nutritious, all one texture! \n\nSpaghetti sauce: I just BLENDED that shit to get rid of all textures, added that same protein powder, but no meat at all \n\nGranola bars/easy grabbable snacks for when I don’t feel like I can eat: a lot of times, the texture or the different nuts are too much, so I made peanut butter balls - chopped the nuts up super fine and then ran them through a food processor until they were powdered, added protein powder, peanut butter, and chocolate chips, added flaxseed meal with zero texture, and SO FILLING AND TASTY. \n\nAnother safe food is grilled cheeses and soup, but when I just can’t cook, I take tortillas and cheese, flatten them like a quesadilla, microwave it, and dip it in ketchup. Also delicious, tastes enough like tomatoes and puts food in my body \n\nAnother soup thing: I will buy soups and bisques (with no noodles or anything in it, but I supposed you could do that too) and I put it in a travel mug, it stays warm and I can easily take it with me without being embarrassed. \n\nThere are more things like this, I’m sure,  it I’m just realizing now how much of my ARFID is related to how I’m “supposed” to eat things!",
  "url": "https://www.reddit.com/r/ARFID/comments/xm43tw/mindblowing_revelation_if_there_are_aspects_of/",
  "score": 114,
  "num_comments": 17,
  "comments": [
    {
      "id": "ipmim7g",
      "author": "SecretSquirrelSpot",
      "body": "I peel grapes and I don’t care what everyone thinks about it :)\n\nI also fry avocado into crispy cubes.\n\nAnd I blend my veg too, no shame from here, you do what you must.",
      "created_utc": 1663957699.0,
      "score": 27,
      "context": []
    },
    {
      "id": "ipmitj2",
      "author": "chunkeymunkeyandrunt",
      "body": "When my dietician told me there was no reason to have three meals a day when I could just as easily get my nutrients in smaller snack sized ‘meals’ throughout the day, or that dinner doesn’t HAVE TO BE ‘meat, fiber/carb, veg’ … my mind was blown lol. It was like o needed permission to change!",
      "created_utc": 1663957790.0,
      "score": 22,
      "context": []
    },
    {
      "id": "ipmxfpa",
      "author": "SecretSquirrelSpot",
      "body": "Similar to your peanut butter balls but I have also made “power balls” with blended dates, blended (to oblivion cashew nuts) cocoa powder & flavourings like mint or orange etc. never thought to put protein powder in them so will have to try that next time.",
      "created_utc": 1663964333.0,
      "score": 6,
      "context": []
    },
    {
      "id": "ipnevtk",
      "author": "None",
      "body": "Bread is often on my avoidant list, so I do deconstructed sandwiches a lot.  I can eat sandwiches sometimes if I toast the bread.\n\nI absolutely cannot eat soggy bread. So, when I was younger, if I *had* to pack lunch, I had to pack my sandwich as parts in separate bags. So I'd toast the bread and that went in one baggie. Then the slightly wets (meat, lettuce, cheese) in another baggie. Fully wets (tomatoes, any sauces) each get their own baggie. For sauces I make a little icing style baggie and squeeze it onto the sandwich later.\n\nI always keep a napkin nearby when eating in case I have to spit out a bite. Once a food has changed from safe to not safe, I start eating it as separate ingredients.\n\nSo if I have to spit out a bite of pizza, I'll take the toppings off and try eating those (or set them aside if that's the issue), then repeat with the cheese, and finally the bread.\n\nI never know what's going to set off an \"avoid\" alarm while eating. I can generally be sure that *temperature* will always be an issue. So if I'm eating with people and talking I know I won't be able to finish, because the food will get too cold at some point. Gotta have that napkin on hand 😁",
      "created_utc": 1663972146.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ipnx1af",
      "author": "PatrioticGrandma420",
      "body": "I don't put syrup on pancakes",
      "created_utc": 1663981151.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ipo2eo0",
      "author": "magicalstella",
      "body": "This was partially what arfid treatment was for me, learning ways to short circuit what makes an unsafe food vs a safe food. Now I can even handle some of the things I used to work around by blending, dicing impossibly tiny, etc. I'm glad you're on board! :)",
      "created_utc": 1663983913.0,
      "score": 6,
      "context": []
    },
    {
      "id": "ippwp4d",
      "author": "knappellis",
      "body": "This post gives me so much hope! I think that most great cooks got that way because they are creative innovators. They take what they are given a tweak it a bit. \n\nWhat you are doing is the same! You are tweaking things to please you, and that is so empowering. I'm a parent, and I hope my kiddo gets to the place where you are now.",
      "created_utc": 1664029146.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ipnatc7",
      "author": "anonymous-musician",
      "body": "Why have I never though to put protein powder in spaghetti sauce, I put it in smoothies all the time, but that could work just as well",
      "created_utc": 1663970252.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ipowi5p",
      "author": "BlueEyedA",
      "body": "Omg it never even hit me I can blend spaghetti sauce! I detest the chunky bits of tomatoes that are in most, thank you!",
      "created_utc": 1664003255.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ipqge7x",
      "author": "NECROM4NCY",
      "body": "whats the protein powder brand? if you dont mind sharing! trying to find ways to get the stuff i need in my body 😅",
      "created_utc": 1664037906.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ipqi6xx",
      "author": "calamitylamb",
      "body": "Yes!!! Food rules are arbitrary and make-believe! Eat whatever you want, whenever you want, however you want it!",
      "created_utc": 1664038673.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ipnivy3",
      "author": "mamaxchaos",
      "body": "Wait I need this fried avocado recipe!",
      "created_utc": 1663974059.0,
      "score": 3,
      "context": [
        {
          "id": "ipmim7g",
          "author": "SecretSquirrelSpot",
          "body": "I peel grapes and I don’t care what everyone thinks about it :)\n\nI also fry avocado into crispy cubes.\n\nAnd I blend my veg too, no shame from here, you do what you must.",
          "created_utc": 1663957699.0
        }
      ]
    },
    {
      "id": "ipnt5c2",
      "author": "StJimmyNeutron",
      "body": "Yup! Moments like those make me wonder what it’s like to live without ARFID.",
      "created_utc": 1663979196.0,
      "score": 3,
      "context": [
        {
          "id": "ipmitj2",
          "author": "chunkeymunkeyandrunt",
          "body": "When my dietician told me there was no reason to have three meals a day when I could just as easily get my nutrients in smaller snack sized ‘meals’ throughout the day, or that dinner doesn’t HAVE TO BE ‘meat, fiber/carb, veg’ … my mind was blown lol. It was like o needed permission to change!",
          "created_utc": 1663957790.0
        }
      ]
    },
    {
      "id": "ipqhig6",
      "author": "mamaxchaos",
      "body": "Yeah! I linked it above but it’s GenePro and it’s AMAZING",
      "created_utc": 1664038384.0,
      "score": 2,
      "context": [
        {
          "id": "ipqge7x",
          "author": "NECROM4NCY",
          "body": "whats the protein powder brand? if you dont mind sharing! trying to find ways to get the stuff i need in my body 😅",
          "created_utc": 1664037906.0
        }
      ]
    },
    {
      "id": "ipp0h3j",
      "author": "SecretSquirrelSpot",
      "body": "It’s not really a recipe, more a changing of texture to the standard smush that is avocado. Plus I’m allergic to it in its raw form. \n\nAll I do is cut it into about 1.5cm cubes, then shallow fry them in olive oil until they crisp / go darker on the edges. Sometimes I slice them into little moons and fry them that way but I prefer the cube shape personally. \nThen I put them on buttered French toast / crisp bread and sprinkle on a pinch of salt. Voila they go from creamy mush to hot crispy crunch.",
      "created_utc": 1664006586.0,
      "score": 2,
      "context": [
        {
          "id": "ipmim7g",
          "author": "SecretSquirrelSpot",
          "body": "I peel grapes and I don’t care what everyone thinks about it :)\n\nI also fry avocado into crispy cubes.\n\nAnd I blend my veg too, no shame from here, you do what you must.",
          "created_utc": 1663957699.0
        },
        {
          "id": "ipnivy3",
          "author": "mamaxchaos",
          "body": "Wait I need this fried avocado recipe!",
          "created_utc": 1663974059.0
        }
      ]
    },
    {
      "id": "ipqsdrv",
      "author": "NECROM4NCY",
      "body": "thank you!! 🙏",
      "created_utc": 1664042965.0,
      "score": 1,
      "context": [
        {
          "id": "ipqge7x",
          "author": "NECROM4NCY",
          "body": "whats the protein powder brand? if you dont mind sharing! trying to find ways to get the stuff i need in my body 😅",
          "created_utc": 1664037906.0
        },
        {
          "id": "ipqhig6",
          "author": "mamaxchaos",
          "body": "Yeah! I linked it above but it’s GenePro and it’s AMAZING",
          "created_utc": 1664038384.0
        }
      ]
    }
  ]
}