{
  "id": "y45mir",
  "subreddit": "ARFID",
  "author": "ilja05",
  "created_utc": 1665782500.0,
  "title": "I don't actually mind having ARFID, just the constant judgement",
  "selftext": "I Iike eating the same food every day. I mostly enjoy my safe foods. I'm physically healthy, just a little underweight. Every time I have had bloodwork done it has come back fine. I know my diet isn't super healthy but I'm happy this way.\n\nHowever I hate constantly being judged for what I eat. I would honeslty say over 90% of my ARFID issues are entirely because of other people. If nobody ever got offended when I don't eat their food or made mean comments or gor frustrated when I don't want to try something everything else would be manageable. Yes, it sucks that I get nauseaus for no reason and that I sometimes can't eat when I'm hungry but I can deal with that. It's the enormous toll it takes on my social life that is by far the worst part. \n\nI don't even really want to get treatment. It feels like I would mostly just be doing it for the sake of other people, putting myself in stressful situations just so people won't think I'm weird. Does anyone else feel this way?",
  "url": "https://www.reddit.com/r/ARFID/comments/y45mir/i_dont_actually_mind_having_arfid_just_the/",
  "score": 141,
  "num_comments": 16,
  "comments": [
    {
      "id": "iscp9iq",
      "author": "5minutecall",
      "body": "I mostly agree.  I’m quite content eating the same things over and over.  I just hate that I can’t be more social or travel and all that because of it.  It has caused so many issues within my family and such too",
      "created_utc": 1665789460.0,
      "score": 38,
      "context": []
    },
    {
      "id": "iscjxm1",
      "author": "potatochip400",
      "body": "Yes I agree, I don’t mind being this way. Personally I do have some mild health issues from it.  As an adult, I haven’t had people judge me much.  As a kid though I had a hard time with some of my family members and that made me feel ashamed of having it as a kid.  I don’t feel much desire to expand what I eat.",
      "created_utc": 1665786991.0,
      "score": 17,
      "context": []
    },
    {
      "id": "isd67xy",
      "author": "KNVM",
      "body": "100% understand you and my overall situation is very similar to yours. \n\nThe social aspect is truly the worst to deal with. I have been trying to manage to get better for years- I did \"food therapy\" last year for this very reason and I got incredibly frustrated. The people working with me told me, \"you're allowed to not like some foods\" at one point and it was honestly such a shitty moment. Nothing inherently wrong with that statement, we are allowed to like and dislike food, but it invalidates so much of my experience with ARFID. I wouldn't have gone to therapy in the first place if I were allowed to not like what i don't like and not eat what i can't tolerate. If only! My life would be so much easier if that were the case.",
      "created_utc": 1665797650.0,
      "score": 11,
      "context": []
    },
    {
      "id": "isd00zq",
      "author": "MagnoliaEvergreen",
      "body": "I agree except most of my safe foods are high calorie foods (peanut butter, cream cheese, macaroni...etc) and it's difficult for me to keep myself from gaining weight. But the eating the same exact sandwich every night for the past 7 years doesn't bother me at all.\n\nI hate social eating and I will only ever go out to eat with my husband and room mates because none of them judge me at all. I've had terrible experiences eating in groups and get high anxiety at just the thought. Luckily, I'm also an introvert and by now (mid 30s) everyone I know already knows that I decline most social events because it's too exhausting so it's not that difficult to navigate now days. The holidays are the only thing that's difficult but we always do potluck get togethers so I just make my own food to bring. I do have to figure out ways to decline someone's offer to try their \"amazing turkey stuffing and white gravy\" but I've found that I can usually say that I'm already so full that I couldn't eat another bite if I wanted to and that's good enough.\n\nI do have some minor issues with malnutrition (low protein, low iron...etc) but most of those can be maintained with multivitamins and the like.",
      "created_utc": 1665794627.0,
      "score": 7,
      "context": []
    },
    {
      "id": "isfbvwe",
      "author": "lily_fairy",
      "body": "i totally understand this. every single time i was with my friends or extended family, someone would make a joke about the food i was eating. i think it made my bad relationship with food even worse. one of my weird arfid things is i don't like red food (except apples because the red color doesn't spill anywhere. idk.) so that rules out pizza with red sauce, pasta with red sauce, hot dogs, and hamburgers. aka the only foods available at every single party in the US. it would annoy me because these foods are not even that healthy but i'd get ripped apart for not eating them.\n\nthen 2 years ago i was diagnosed with celiac disease so now im strictly gluten free. celiac obviously sucks especially for someone who already has a restrictive eating disorder, but it's kinda relieving that i don't have to be as socially embarrassed when i don't eat certain foods. i can just say i have celiac now and won't be judged as much.\n\ni really hate that people make comments about anyone's food. they think it's just one little harmless joke but don't realize we have to hear these jokes EVERY SINGLE TIME WE EAT WITH OTHER PEOPLE. it's exhausting.",
      "created_utc": 1665847576.0,
      "score": 4,
      "context": []
    },
    {
      "id": "isdah2z",
      "author": "Poppamunz",
      "body": "I feel the exact same way and I wish this perspective were more common. I really don't want to \"recover\" from ARFID and am not in a mentally healthy place to do so; I just want it to be more accepted by people so that the world can be a bit more accommodating.",
      "created_utc": 1665799747.0,
      "score": 9,
      "context": []
    },
    {
      "id": "iscof2k",
      "author": "whaleweaves",
      "body": "Honestly I don’t even mind people judging me, cause I’m just eating food. I don’t mind eating from a limited pool of foods, and same as you my bloodwork is always fine. The only thing I hate is that I never want to eat lol",
      "created_utc": 1665789061.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ise1rm1",
      "author": "morning_tree",
      "body": "I feel like I have plenty of safe foods and the ones I have aren’t too bad. It’s definitely enough to keep me from becoming underweight or unhealthy so I feel you. Most of my issues come from anxiety around new or unsafe foods and other people’s perception of me. The only other thing I worry about is my future kids potentially learning from my disordered eating. I can manage my own but I also wouldn’t wish it on anyone else, yknow?",
      "created_utc": 1665817137.0,
      "score": 4,
      "context": []
    },
    {
      "id": "iseyijz",
      "author": "Hot-Journalist1139",
      "body": "i relate 100%. i don’t mind the way i am and i enjoy what i eat. i have also never had health issues caused by my ARFID. the worst part of it is when it comes to eating with people!! i get so anxious i will not like the food and i will be judged for it. i’ve been judged and questioned all my life for it and it’s so embarrassing every time it happens",
      "created_utc": 1665841380.0,
      "score": 3,
      "context": []
    },
    {
      "id": "isumy4s",
      "author": "Christabel1991",
      "body": "My ex told me he hates going to restaurants with me because I always ask the waiters to change of remove some ingredients from the dish I'm ordering. Why would that embarrass anyone?",
      "created_utc": 1666125607.0,
      "score": 3,
      "context": []
    },
    {
      "id": "iscxdal",
      "author": "kilroy-was-here-2543",
      "body": "Totally agree, my diet isn’t super balanced or healthy, but I get enough calories to stay active in pursuits I enjoy, and it’s kinda nice not worrying about what to eat when you eat the same thing every day.",
      "created_utc": 1665793344.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ise9j67",
      "author": "heighh",
      "body": "I agree except for the fact that I struggle to gain weight, despite wanting to. My safe foods tend to be low calorie/nothing so I lose weight quickly and it’s really hard for me to maintain. I’ve been trying to eat more though!",
      "created_utc": 1665823856.0,
      "score": 2,
      "context": []
    },
    {
      "id": "isf3kse",
      "author": "its_tea_time-",
      "body": "Yes, absolutely. My family eats much larger portions than I do, so sometimes they would get so mad at me just because I was taking too long to eat since I was feeling nauseous.",
      "created_utc": 1665843831.0,
      "score": 2,
      "context": []
    },
    {
      "id": "itl4fss",
      "author": "celestial-typhoon",
      "body": "Agreed. I work in an office that loves to do group lunches. They always pick these very random places that have foods that are not safe to me. I’ve been made fun of for not wanting to eat at these restaurants and it even has gone as far as accusing me of being racist for not wanting to try these restaurants. It’s hurtful.",
      "created_utc": 1666618148.0,
      "score": 2,
      "context": []
    },
    {
      "id": "isfg1l2",
      "author": "Dashing_Banana420",
      "body": "This so hard, Im sorry you are going through this. I can really relate and I agree with some of the other commenters that its gotten easier as I've gotten older and can choose who I am around. The only people I eat around are my fiance and roommates and they don't give me any grief at all. If anything they are very gently encouraging.",
      "created_utc": 1665849396.0,
      "score": 1,
      "context": []
    },
    {
      "id": "isfg7ha",
      "author": "Dashing_Banana420",
      "body": "The travelling...I've been thinking about this too. No solutions yet.",
      "created_utc": 1665849468.0,
      "score": 3,
      "context": [
        {
          "id": "iscp9iq",
          "author": "5minutecall",
          "body": "I mostly agree.  I’m quite content eating the same things over and over.  I just hate that I can’t be more social or travel and all that because of it.  It has caused so many issues within my family and such too",
          "created_utc": 1665789460.0
        }
      ]
    }
  ]
}