{
  "id": "y4jvs6",
  "subreddit": "ARFID",
  "author": "None",
  "created_utc": 1665827740.0,
  "title": "If you ate your safe food 3-5x a day every day for the rest of your life, that would be okay and better than not eating or judging yourself until you're miserable <3",
  "selftext": "*This may not apply to everyone but I felt like somebody else must need to hear this the way I did. Work with your health team but please recognize that even professionals with great education and wonderful intentions can approach things in a way that just isn't compatible for you, generally or at a given moment.*\n\nYou need to eat, first and foremost. As someone who only became able to start trying new and more foods after allowing myself to completely remove absolutely every single restriction (INCLUDING \"but nutrition\"), please know that it's okay to indefinitely commit to no priority other than \"getting fed\" for as long as is comfortable. It could even potentially help food exploration in the future, after a period of genuinely ZERO pressure without any specified deadline. It can effectively make food a safe concept again because you regain control over the concept that there's an issue with your present habits. I think people would truly be amazed just how much the self-judgement about our relationship with food impacts our relationship with food-- I didn't see the full impact of it until trying this and being allowed to have ARFID without it being a \"problem\" for the first time. \n\nYou are still valid and worthy of gentleness if you have to eat nothing but tortilla chips or fruit cups or Mac and cheese or white bread for way longer than anyone around you, including docs or even yourself, thinks is \"acceptable.\" *The total pressure removal might even help you crave a change!!!* Do not let the pressures of people who need you to reach a goal at any certain pace trap you into a tighter box. ❤️",
  "url": "https://www.reddit.com/r/ARFID/comments/y4jvs6/if_you_ate_your_safe_food_35x_a_day_every_day_for/",
  "score": 110,
  "num_comments": 7,
  "comments": [
    {
      "id": "isf3u22",
      "author": "Threspian",
      "body": "It may sound silly, but I’ve found myself using the classic saying in the breastfeeding/formula debate: fed is best.",
      "created_utc": 1665843950.0,
      "score": 29,
      "context": []
    },
    {
      "id": "isff05d",
      "author": "swiftb00ks",
      "body": "I mentioned being extremely picky to my GP and she told me that’s okay as long as you eat something and i’ve truly never felt so validated",
      "created_utc": 1665848947.0,
      "score": 17,
      "context": []
    },
    {
      "id": "iset3f2",
      "author": "giraffemoo",
      "body": "This. This is how I finally made peace with my ARFID",
      "created_utc": 1665838494.0,
      "score": 11,
      "context": []
    },
    {
      "id": "isfovpe",
      "author": "None",
      "body": "Remember if your safe food causes constipation it's 100% okay to take a laxative - talk to your Dr about dosage. Same with gas - it's okay to take gas medication. Your food should work for you.",
      "created_utc": 1665853153.0,
      "score": 10,
      "context": []
    },
    {
      "id": "isgrjft",
      "author": "deandratb",
      "body": "I still struggle with this, as somebody whose symptoms were painfully worsened by my environment and well-meaning adults when I was growing up--but nothing is more true. ARFID is intertwined with four other disorders in my fun brain, and my food issues are worse whenever my mental health is otherwise tanking. So I've had to learn to ask myself \"what **can** you eat right now?\" when my brain and body are protesting the very idea of food, rather than \"what **should** you be eating?\" because the pressure of 'shoulds' has always made my disorder symptoms worse, from bipolar not-sleeping to ARFID food avoidance. If I find something, anything, that I can eat, and focus on doing that while refusing to feel guilty about it, then I'm able to wait out the bad patches until I go back to being able to incorporate my slightly bigger range of safe foods. At this point I don't have professional help and it feels like I'll never successfully get it, but I'm still proud of myself for surviving this long on my own, no matter how 'unhealthy' I am as a result.",
      "created_utc": 1665869587.0,
      "score": 3,
      "context": []
    },
    {
      "id": "isfq235",
      "author": "None",
      "body": "This is a wonderful suggestion for accommodations!! I have also been guilty of taking a specifically *prenatal* multivitamin before to add myself a little bit extra nutrition that I know I won't get any of through food.",
      "created_utc": 1665853642.0,
      "score": 7,
      "context": [
        {
          "id": "isfovpe",
          "author": "None",
          "body": "Remember if your safe food causes constipation it's 100% okay to take a laxative - talk to your Dr about dosage. Same with gas - it's okay to take gas medication. Your food should work for you.",
          "created_utc": 1665853153.0
        }
      ]
    },
    {
      "id": "isfqhry",
      "author": "None",
      "body": "Yes! Supplements are definitely something people with an eating disorder need to discuss with their Dr. My Dr recommended a full spectrum vitamin with D and B vitamins in it due to my nutritional deficiencies. I also started a fish oil supplement recently and take magnesium as needed (ie if I start getting muscle spasms).",
      "created_utc": 1665853824.0,
      "score": 5,
      "context": [
        {
          "id": "isfovpe",
          "author": "None",
          "body": "Remember if your safe food causes constipation it's 100% okay to take a laxative - talk to your Dr about dosage. Same with gas - it's okay to take gas medication. Your food should work for you.",
          "created_utc": 1665853153.0
        },
        {
          "id": "isfq235",
          "author": "None",
          "body": "This is a wonderful suggestion for accommodations!! I have also been guilty of taking a specifically *prenatal* multivitamin before to add myself a little bit extra nutrition that I know I won't get any of through food.",
          "created_utc": 1665853642.0
        }
      ]
    }
  ]
}