{
  "id": "y8zx2n",
  "subreddit": "ARFID",
  "author": "Business_State_6332",
  "created_utc": 1666276502.0,
  "title": "sobbing.",
  "selftext": "I just found this and im crying. I've struggled with arfid my whole life. but no one understood. People have told me its all in my head, it isn't a real disorder. But now, there is a whole reddit chain just for it. there are 18.8k people just like me.",
  "url": "https://www.reddit.com/r/ARFID/comments/y8zx2n/sobbing/",
  "score": 166,
  "num_comments": 11,
  "comments": [
    {
      "id": "it2xctn",
      "author": "2much-2na",
      "body": "I had a very similar feeling of pure relief when I found this sub last year. This sub has helped me so much. I used to feel so alone and crazy but now I have a community. Welcome! I'm so glad you found us :)",
      "created_utc": 1666279814.0,
      "score": 30,
      "context": []
    },
    {
      "id": "it3950f",
      "author": "gabs781227",
      "body": "Even though it's just an online community, it really helps me when I'm in the throes of arfid and I remember there are others.",
      "created_utc": 1666284371.0,
      "score": 23,
      "context": []
    },
    {
      "id": "it3ggcl",
      "author": "Mynotredditaccount",
      "body": "The same thing happened to me years ago. Welcome, my friend. You're not alone. In my opinion, this is one of the kindest, most accepting subs on reddit <3",
      "created_utc": 1666287164.0,
      "score": 10,
      "context": []
    },
    {
      "id": "it3njnq",
      "author": "willsterbillster4",
      "body": "It was an amazing feeling discovering this subreddit and a huge relief. Wishing you a warm welcome!",
      "created_utc": 1666289920.0,
      "score": 11,
      "context": []
    },
    {
      "id": "it3s17h",
      "author": "NotDavidWalliams",
      "body": "I had the same feeling when I found the wikipedia page about it. It used to be called Selective Eating Disorder but is now ARFID, and I've been struggling with it all my life. As soon as I read through the symptoms the epiphany feeling hit over and over, especially when they said it was typical for those with autism, which is what I'm currently on the waiting list to get formally diagnosed for.",
      "created_utc": 1666291668.0,
      "score": 9,
      "context": []
    },
    {
      "id": "it3qq35",
      "author": "None",
      "body": "I was in therapy for 3 years and I heard the exact same thing, that it’s all in my head. Well that was completely proven wrong when I tried a medication that restored my eating habits and weight by 50 pounds. It’s called Pantoprazole, talk to your doctor about it. It saved me",
      "created_utc": 1666291159.0,
      "score": 3,
      "context": []
    },
    {
      "id": "it43kfk",
      "author": "Louloubelle0312",
      "body": "Yes, you aren't alone. I finally discovered at 62 that this is my problem as well. Years, and years of hearing \"oh, you're just a fussy eater\". I hope this place helps you. I mostly just read, but when I saw you were crying, my heart went out to you. No one should be made to feel bad about how they eat, and why. I hope you can reach that point in your life. I have, but I think when you hit my age, you kind of say f\\*\\*\\* you to people who want to give you grief. Keep working on it, but at the end of the day, it's your body, and your condition. Don't take crap from anyone. I can usually shut people down with \"Why do you care what I eat?\".",
      "created_utc": 1666296118.0,
      "score": 3,
      "context": []
    },
    {
      "id": "it6gffd",
      "author": "RavenRain_",
      "body": "I feel the same way. I've been called dramatic and a picky eater my entire life and I \"just need to get over it\". I never realised it was an actual disorder until I started doing research and then found this sub. It's comforting to know that I'm not alone in this and that there are people who wouldn't judge me for it either.",
      "created_utc": 1666338470.0,
      "score": 3,
      "context": []
    },
    {
      "id": "it53rsd",
      "author": "SachiKaM",
      "body": "Deep breath.. it was a pain none of us could have been ready to endure. It is real, you are here, and now you know it was never just in your head. Rest safe in this new knowledge. Have the most compassion for the phase of feelings you are likely going to endure very soon. Just because now you understand, do not have the highest anticipations that your circle will as well. Consider this a leap in self-discovery and understanding yourself that much more 🫶🏽 you are the same you that you have always been and have spent your entire life searching for. Replace the frustration and confusion for kindness and saftey. Just because you may not have known the name doesn’t mean you haven’t been battling it from birth. And by battling I mean providing by the only means you knew how. Relief and hope in discovery. Recharge, because this is only the beginning. One love 🌱",
      "created_utc": 1666311497.0,
      "score": 2,
      "context": []
    },
    {
      "id": "it5bfyq",
      "author": "blondegator",
      "body": "Welcome to a safe and understanding place 💛",
      "created_utc": 1666314889.0,
      "score": 2,
      "context": []
    },
    {
      "id": "it5m9ci",
      "author": "R-nd-",
      "body": "Of course it's in your head, that's where your brain is! Why should that mean it's not real?",
      "created_utc": 1666319667.0,
      "score": 2,
      "context": []
    }
  ]
}