{
  "id": "ykxhgz",
  "subreddit": "ARFID",
  "author": "tetrislesbian",
  "created_utc": 1667468335.0,
  "title": "An ARFIDer's pet peeve on dating apps:",
  "selftext": "I hate that everyone's dating profile seems to say \"foodie\" or \"I love trying new foods\" or \"let me cook for you\". And I hate that food just isn't going to be a part of my romantic relationships ever.\n\nI've had significant others in the past who accept my food restrictions, so I'm not *completely* feeling hopeless about my love life... But it still makes me feel sad/isolated. Some people even go so far as to say their biggest turn off is a picky eater?? Literally why? How does it affect them?\n\nWill I ever find \"the one\", or am I doomed to be turned down forever just because I won't go on a pizza date?",
  "url": "https://www.reddit.com/r/ARFID/comments/ykxhgz/an_arfiders_pet_peeve_on_dating_apps/",
  "score": 244,
  "num_comments": 100,
  "comments": [
    {
      "id": "iuvm603",
      "author": "andthennini",
      "body": "I just don't really get why food plays such a significant role in relationships. Like, no I don't want you to cook my food so we both don't end up upset. Why's that a deal breaker?",
      "created_utc": 1667472015.0,
      "score": 128,
      "context": []
    },
    {
      "id": "iuvhxwa",
      "author": "Aletayr",
      "body": "I was having similar thoughts earlier today. I've had multiple (edit: long term) relationships end with ARFID as one of the prime causes. Are there enough of us out there to make our own app??",
      "created_utc": 1667468583.0,
      "score": 60,
      "context": []
    },
    {
      "id": "iuw8uw3",
      "author": "kaleidoscopichazard",
      "body": "We’re not picky eaters though, we have a condition. Much in the same way an anorexic person wouldn’t be called a “picky eater” we shouldn’t either. \n\nIf a date says that, run. There’s plenty of people out there that are more compassionate and understanding and I’d rather date those. \n\nFunnily enough, my ex was a “foodie” and my ARFID was never a problem. \nEven if they have that on their bio, if you click give them a chance. I find people use food bc it’s usually easy to bond over it. Find a common hobby and use that instead",
      "created_utc": 1667484299.0,
      "score": 53,
      "context": []
    },
    {
      "id": "iuxaer3",
      "author": "_jspain",
      "body": "On Hinge where you choose like 6 things to show about yourself and people still take the time to say they hate picky eaters 🙃 Like you have nothing else in your personality that takes precedence over that???",
      "created_utc": 1667499006.0,
      "score": 34,
      "context": []
    },
    {
      "id": "iuwp41h",
      "author": "curs3dfairyy",
      "body": "I'm sorry, people can be so dumb. \"hOw dArE yOu nOt EaT tHiS ???!\" What a stupid pet peeve.",
      "created_utc": 1667490868.0,
      "score": 29,
      "context": []
    },
    {
      "id": "iuw4awg",
      "author": "aangiev",
      "body": "the foodie part is what ticks me off although I don’t blame them. Worst part is I want to go to restaurants and do want to try new foods but I have crippling social anxiety when it comes to eating in public and I’m an emetophobe. For the ones who have ARFID due to texture issues I can’t imagine how hard this must be because not everyone is educated let alone compassionate enough to understand not everyone has the same eating patterns and styles",
      "created_utc": 1667482291.0,
      "score": 21,
      "context": []
    },
    {
      "id": "iuvusta",
      "author": "Carina_Nebula89",
      "body": "My ex basically took advantage of m ARFID. When we moved in together, whenever I would cook. I would often make 2 seperate meals because I felt bad that he had to eat the same things over and over again because that was all I could eat.   \nHe could have cooked himself but well.. I just wanted to make him happy. Eventually it wasn't a favor I did for him anymore but it was expected because he would emotionally manipulate me and make me feel bad for being a \"picky eater\" (I did not even know about ARFID back then)   \nEventually I broke up with him when I realized I became nothing more than a cook.   \n\n\nI've been single ever since and encountered the same problem you described..   \nIt is not easy finding someone who truly accepts ARFID (or even understands it because even when explaining a lot of people still think I'm just picky)",
      "created_utc": 1667477559.0,
      "score": 18,
      "context": []
    },
    {
      "id": "iuwum81",
      "author": "FancyArtichoke",
      "body": "It's such a big hurdle when dating and it's SO hard to explain. I try to be extremely flexible when it comes to social events and dates with food. If we're at a restaurant without safe foods or I'm in a mode where nothing feels safe, I'll order something I know a family member/roommate/friend will like, pay for it myself, and box it up for them later. I never complain or ask to be accommodated, and I'll happily go hungry in order to keep the status quo. Even then, when I'm not disrupting anyone else, there are people who make it their personal mission to \"call me out\". At the end of the day, I've decided that I'm simply not compatible with someone who is offended by or unwilling to understand ARFID, especially when I bend over backwards to be unobtrusive.",
      "created_utc": 1667493002.0,
      "score": 13,
      "context": []
    },
    {
      "id": "iuxp1us",
      "author": "SadPomegranate1020",
      "body": "My ex used to complain that he loved fish and could never have it because I didn’t like it. I was like but you can have fish and I can have something I like (you know, common sense) and he threw a strop saying it was too much hassle to cook different dinners.\n\nYep clearly my fault he couldn’t have fish, nothing to do with him being awkward…..",
      "created_utc": 1667504619.0,
      "score": 12,
      "context": []
    },
    {
      "id": "iuxx3ba",
      "author": "Akavinceblack",
      "body": "Personally (I don’t have ARFID, my daughter does and her dad has…aversions), ‘picky’ or ARFID eating is never an issue UNLESS it becomes judginess about what I eat.\n\nI mean, if soup is inedible to you I will never cook you or serve you soup.  I do not, however, want to listen to you go on about in detail about why soup is a disgusting food, or why the way they NEED their steak cooked is right and the way I like mine is wrong.\n\nAnd there is a large segment of the non-foodie public that feels driven to make it really clear that they don’t like your fancy foods, just on general principles.",
      "created_utc": 1667507640.0,
      "score": 12,
      "context": []
    },
    {
      "id": "iuvrq7l",
      "author": "None",
      "body": "At least they're up front about it. My abusive ex didn't become a \"lover of cooking\" until we were married and I thought it was too late to leave them.",
      "created_utc": 1667475785.0,
      "score": 21,
      "context": []
    },
    {
      "id": "iuxvy2n",
      "author": "lsatwillendme2000",
      "body": "This! i had a guy call me a brat over text when it came up that i was a picky eater. it was his “biggest pet peeve” -_-  after that, i put i was a picky eater on one of the prompts and my matches went down drastically. im attractive so it was a shock that the food part had such an impact.",
      "created_utc": 1667507209.0,
      "score": 9,
      "context": []
    },
    {
      "id": "iuyeigl",
      "author": "gillebro",
      "body": "Don’t give up, my friend. I’m a foodie in a relationship with a girl with ARFID (she’s why I’m in this community), and… whatever? Of course, for some food lovers, picky eating is a deal breaker, but for many of us it isn’t. \nIt helps I’m a very, what I call, “unpretentious” foodie. I love a macca’s as much as I love high-end sushi. So fiancée and I can bond over her safe foods, because I love those foods too. \n\nTl;dr: love finds a way.",
      "created_utc": 1667516204.0,
      "score": 9,
      "context": []
    },
    {
      "id": "iuvwzfu",
      "author": "FiguringItOut--",
      "body": "It’s really stupid. But you’ll find them. I never thought I’d find someone as picky as me, yet I found someone even pickier! I love him for many reasons, but one is that he never pressures me to eat things I don’t want. There’s a lid for every pot <3",
      "created_utc": 1667478741.0,
      "score": 15,
      "context": []
    },
    {
      "id": "iuvqd9s",
      "author": "stitchbitch420",
      "body": "A lot of people that love food want to be with someone that also loves food because for them eating new things together is a bonding experience. Especially when it comes to traveling.",
      "created_utc": 1667474932.0,
      "score": 17,
      "context": []
    },
    {
      "id": "iuvkotn",
      "author": "CounselorGowron",
      "body": "This was very hard for me too, ableism is rampant and often they don’t even know that’s what they’re doing. 🫠 That’s where the problem is, not with you. \n\nHowever, I’m also now proof that it’s possible to have a loving partner who truly accepts me and my food limitations; we have wonderful meal experiences together, just often eating different foods at the same time.",
      "created_utc": 1667470878.0,
      "score": 24,
      "context": []
    },
    {
      "id": "iuww38v",
      "author": "joshb44231",
      "body": "I completely agree. I mean, they can cook me Mac and cheese and French fries, but I don’t know if they consider that cooking. 😂😂",
      "created_utc": 1667493566.0,
      "score": 6,
      "context": []
    },
    {
      "id": "iuxxy1d",
      "author": "InevitablePersimmon6",
      "body": "I don’t understand the way food is so important to people the same way I don’t understand why grown adults brag about how much alcohol they drink. My husband thankfully never says a word about what/how I eat. He knows I hate it when he eats anything with peanuts/nuts/seafood/fish, but I also don’t bother him about it and he always brushes his teeth for me as soon as he’s done. I couldn’t imagine being with someone who forced me to eat things or got upset that I wouldn’t try their food. There are just people out there who think that we are acting like children because we have an eating disorder.",
      "created_utc": 1667507961.0,
      "score": 6,
      "context": []
    },
    {
      "id": "iuvod3v",
      "author": "Dramatic-Growth1335",
      "body": "It's definitely gonna make things difficult for you. \n\nMy first date to a nandos and I ordered chicken wings for the 2nd time in my life. \nThe waiter, for reasons unbeknownst to me as they never do this, asked if I wanted a knife and fork so I said yes.\n\nI then tried to eat chicken wings with a knife and fork 🤣\nAmazingly I got more dates \n\nYou don't have to let ARFID limit your life. You can take steps to overcome it",
      "created_utc": 1667473598.0,
      "score": 14,
      "context": []
    },
    {
      "id": "iuxoa10",
      "author": "redwater0",
      "body": "I’ve struggled with Arfid for as long as I have memory. I was in a study about it before it even had a name. I couldn’t touch, smell, even look at certain foods (even certain brands/logos) without feeling sick and I now love those foods. It’s draining and humiliating and hard to have ARFID but don’t let yourself start to believe you will NEVER have these things that you want. It IS possible to recover, slowly, somewhat, and come to enjoy new foods. Of course you don’t need to eat everything under the sun but no one does. I’ve found that being open with my boyfriend once I was comfortable enough to share my diagnosis with him was not as hard as I thought it would be and I really really enjoy trying new things with him, and once I explained what I need in terms of support he is just so nice about it. I’ve tried so many new things with him and he helps me, and it feels so good to be on a recovery journey. None of us are doomed to be this way FOREVER and I don’t think it’s good to think that way. For me even believing this has taken a lot of work but ultimately has been sooo rewarding. I wish the best for you <3 I know it’s hard. But good & enjoying food is life giving. It’s possible, and there are people out there who understand and will support you but also want to help you recover.",
      "created_utc": 1667504330.0,
      "score": 5,
      "context": []
    },
    {
      "id": "iuvw1gu",
      "author": "None",
      "body": "Yes. I don't even like seeing that one word you used and hate it when people mention various specific kinds of food. I literally swipe left on people I would otherwise swipe right on because of these tthings.\n\nOne time I was offered to be on a TV series and get interviewed because of this issue.",
      "created_utc": 1667478236.0,
      "score": 6,
      "context": []
    },
    {
      "id": "iuy2dmr",
      "author": "Nostarsinthedark",
      "body": "Like, sure, food can be a love language- IF you're actually taking me into account! Bulldozing over someone for your own pride is an asshole move",
      "created_utc": 1667509659.0,
      "score": 3,
      "context": []
    },
    {
      "id": "iuz7zmj",
      "author": "Rynoff",
      "body": "Yea fr !!",
      "created_utc": 1667528852.0,
      "score": 3,
      "context": []
    },
    {
      "id": "iuzc2s8",
      "author": "chalybeate",
      "body": "* I don't get the whole \"foodie\" thing. I don't eat for pleasure, I eat because I have to. I do like the taste of certain things, but that's not why I eat. If I could take a pill every day and not have to eat and I would never get hungry, I would do it. Eating is a pain in the ass and inconvenient, and I have IBS which makes it even more unappealing. At least the IBS is a good excuse to not to have to eat something, because it very easily could give you explosive diarrhea and nausea. I also don't like watching my partners eat. I find the whole process of digestion to be utterly disgusting, and seeing them eat makes me think of the end product of the digestive process, and I have coprophobia so I don't like to think about that. Out of sight, out of mind. I would rather eat at home alone and go out and do something than to eat in public and make that the center of the evening. Sometimes, depending on what I am eating, I make a mess and use 30 napkins to wipe barbecue sauce off of my hands and mouth, and I don't want anybody seeing me that way.",
      "created_utc": 1667530753.0,
      "score": 3,
      "context": []
    },
    {
      "id": "iuzjtec",
      "author": "APleasantMartini",
      "body": "I have had one guy accept that I was autistic with food issues, who can cook. One. And he died of natural causes. \n\nThe others have either went overboard or just left me high and dry.",
      "created_utc": 1667534806.0,
      "score": 3,
      "context": []
    },
    {
      "id": "iuvm1oe",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1667471926.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iv0o7o1",
      "author": "SpiritualLuna",
      "body": "Picky eater not in the AFRID context is usually someone who is trying to act high class, the picky eating is about arrogance, nitpicking and finding fault with people while expecting people to serve them hand and foot. It's people wanting nice things but refusing to pay for them or refusing to be considerate when someone is on a budget. \n\nI think \"foodie\" or \"I love trying new foods\" or \"let me cook for you\" is actually really good, it means they're comfortable with food, know a lot about them and can even cook you yummy things. \n\nIt can inspire you to be adventurous and enjoy eating, since their enthusiasm will rub off on you.",
      "created_utc": 1667565070.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iv63faw",
      "author": "Firm-Information550",
      "body": "I think of having arfid as an immediate way to filter people out. Would I ever want to have a relationship with someone who lacks the open-mindedness and empathy to respect the disorder? No. I actually have a partner who emphasized that they like cooking on their profile. Ended up explaining my arfid to them a while into the relationship and they ended up being incredibly kind about it, which is when I knew that I really liked them. If food is a huge deal to someone and they’re unwilling to be with someone who doesn’t eat like them, we just won’t be compatible. It isn’t hopeless for us.",
      "created_utc": 1667665450.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iuvooyk",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1667473823.0,
      "score": 99,
      "context": [
        {
          "id": "iuvm603",
          "author": "andthennini",
          "body": "I just don't really get why food plays such a significant role in relationships. Like, no I don't want you to cook my food so we both don't end up upset. Why's that a deal breaker?",
          "created_utc": 1667472015.0
        }
      ]
    },
    {
      "id": "iuvm3hl",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1667471964.0,
      "score": -16,
      "context": [
        {
          "id": "iuvhxwa",
          "author": "Aletayr",
          "body": "I was having similar thoughts earlier today. I've had multiple (edit: long term) relationships end with ARFID as one of the prime causes. Are there enough of us out there to make our own app??",
          "created_utc": 1667468583.0
        }
      ]
    },
    {
      "id": "iv00tn7",
      "author": "Fantastic-Leopard131",
      "body": "I haven’t had much issue with dating, none of the guys have been particularly into food other than just eating a lot lol but im also in college so I think guys are more happy im a cheap date. For a while i used to think a chef was the “perfect” hubby career because there’d always be prepared food around and that would help me to eat more and then one of my friend pointed out i eat like 3 foods and id drive him mad not eating most of what was made. I guess if i ever meet a chef i like we’ll see lol :)",
      "created_utc": 1667547489.0,
      "score": 5,
      "context": [
        {
          "id": "iuw8uw3",
          "author": "kaleidoscopichazard",
          "body": "We’re not picky eaters though, we have a condition. Much in the same way an anorexic person wouldn’t be called a “picky eater” we shouldn’t either. \n\nIf a date says that, run. There’s plenty of people out there that are more compassionate and understanding and I’d rather date those. \n\nFunnily enough, my ex was a “foodie” and my ARFID was never a problem. \nEven if they have that on their bio, if you click give them a chance. I find people use food bc it’s usually easy to bond over it. Find a common hobby and use that instead",
          "created_utc": 1667484299.0
        }
      ]
    },
    {
      "id": "iux6p8a",
      "author": "Dunedune",
      "body": "People enjoy cooking for others and sharing meals.",
      "created_utc": 1667497596.0,
      "score": -5,
      "context": [
        {
          "id": "iuwp41h",
          "author": "curs3dfairyy",
          "body": "I'm sorry, people can be so dumb. \"hOw dArE yOu nOt EaT tHiS ???!\" What a stupid pet peeve.",
          "created_utc": 1667490868.0
        }
      ]
    },
    {
      "id": "iuvvldw",
      "author": "Carina_Nebula89",
      "body": "I'm so sorry. That must have been terrible",
      "created_utc": 1667477992.0,
      "score": 12,
      "context": [
        {
          "id": "iuvrq7l",
          "author": "None",
          "body": "At least they're up front about it. My abusive ex didn't become a \"lover of cooking\" until we were married and I thought it was too late to leave them.",
          "created_utc": 1667475785.0
        }
      ]
    },
    {
      "id": "ivbhyvn",
      "author": "aangiev",
      "body": "I love this thank you for listening to her and being understanding",
      "created_utc": 1667762317.0,
      "score": 3,
      "context": [
        {
          "id": "iuyeigl",
          "author": "gillebro",
          "body": "Don’t give up, my friend. I’m a foodie in a relationship with a girl with ARFID (she’s why I’m in this community), and… whatever? Of course, for some food lovers, picky eating is a deal breaker, but for many of us it isn’t. \nIt helps I’m a very, what I call, “unpretentious” foodie. I love a macca’s as much as I love high-end sushi. So fiancée and I can bond over her safe foods, because I love those foods too. \n\nTl;dr: love finds a way.",
          "created_utc": 1667516204.0
        }
      ]
    },
    {
      "id": "iuznuog",
      "author": "FailoftheBumbleB",
      "body": "Same. My now husband and I basically fell for each other on our first date when we realized we were both very picky and listed our safe foods growing up. It’s so nice having someone who never pressures me to eat stuff and doesn’t mind getting food at two separate restaurants sometimes, or eating before going to an even that might have food in case there’s nothing we can eat.",
      "created_utc": 1667537257.0,
      "score": 4,
      "context": [
        {
          "id": "iuvwzfu",
          "author": "FiguringItOut--",
          "body": "It’s really stupid. But you’ll find them. I never thought I’d find someone as picky as me, yet I found someone even pickier! I love him for many reasons, but one is that he never pressures me to eat things I don’t want. There’s a lid for every pot <3",
          "created_utc": 1667478741.0
        }
      ]
    },
    {
      "id": "iuvt0yw",
      "author": "CounselorGowron",
      "body": "I can still thoroughly support and share my partner’s excitement over new food experiences without having to eat the same thing.",
      "created_utc": 1667476557.0,
      "score": 10,
      "context": [
        {
          "id": "iuvqd9s",
          "author": "stitchbitch420",
          "body": "A lot of people that love food want to be with someone that also loves food because for them eating new things together is a bonding experience. Especially when it comes to traveling.",
          "created_utc": 1667474932.0
        }
      ]
    },
    {
      "id": "iuvx88s",
      "author": "FiguringItOut--",
      "body": "Lucky me, I hate food AND traveling!",
      "created_utc": 1667478869.0,
      "score": 7,
      "context": [
        {
          "id": "iuvqd9s",
          "author": "stitchbitch420",
          "body": "A lot of people that love food want to be with someone that also loves food because for them eating new things together is a bonding experience. Especially when it comes to traveling.",
          "created_utc": 1667474932.0
        }
      ]
    },
    {
      "id": "iuvm33y",
      "author": "Dunedune",
      "body": "It is not \"ableism\" to have food be an essential part of a relationship",
      "created_utc": 1667471956.0,
      "score": -12,
      "context": [
        {
          "id": "iuvkotn",
          "author": "CounselorGowron",
          "body": "This was very hard for me too, ableism is rampant and often they don’t even know that’s what they’re doing. 🫠 That’s where the problem is, not with you. \n\nHowever, I’m also now proof that it’s possible to have a loving partner who truly accepts me and my food limitations; we have wonderful meal experiences together, just often eating different foods at the same time.",
          "created_utc": 1667470878.0
        }
      ]
    },
    {
      "id": "iuwodnn",
      "author": "betelcake",
      "body": "Not sure if you realize that not everyone thinks this way. We aren't inherently less attractive because of being disabled. We are less understood and therefore often excluded by people who dont know better than to believe the stigma.\nHaving stigma against you doesn't make you inherently anything, it just means uneducated people buy into stereotypes rather than getting to know you 🤷🏾‍♀️\n\nDating is harder for us yes, but still it doesnt make us \"less attractive.\" And maybe its just that the use of the word \"attractive\" is weird in this context. What kind of attraction are you even referring to?",
      "created_utc": 1667490585.0,
      "score": 9,
      "context": [
        {
          "id": "iuvm1oe",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1667471926.0
        }
      ]
    },
    {
      "id": "iuvv2h6",
      "author": "Mx-Helix-pomatia",
      "body": "… dating shouldn’t be harder because of any disability. It unfortunately is, but it’s kind of weird asserting this makes us less attractive, objectively?",
      "created_utc": 1667477705.0,
      "score": 10,
      "context": [
        {
          "id": "iuvm1oe",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1667471926.0
        }
      ]
    },
    {
      "id": "iuvv75h",
      "author": "Carina_Nebula89",
      "body": "I've read a lot of AITAs (for those who don't know it, the \"Am I the Asshole?\" subreddit) in which people got mad at a partner for declining food made by them or their parents (when inviting them to family gatherings) because they think it is rude to \"not even try\". I tried to explain to a lot of people over there already.. \"just trying\" doesn't come easy to anyone. Would it be more polite If I tried and threw up all over the floor?",
      "created_utc": 1667477776.0,
      "score": 71,
      "context": [
        {
          "id": "iuvm603",
          "author": "andthennini",
          "body": "I just don't really get why food plays such a significant role in relationships. Like, no I don't want you to cook my food so we both don't end up upset. Why's that a deal breaker?",
          "created_utc": 1667472015.0
        },
        {
          "id": "iuvooyk",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1667473823.0
        }
      ]
    },
    {
      "id": "iuvyb5h",
      "author": "painandclots",
      "body": "Seeing the words \"society has no concept of food as a disability\" has really resonated with me. It's something I've always thought but never had the exact words to explain it so perfectly. Thank you for this. Food can be a disability.",
      "created_utc": 1667479421.0,
      "score": 32,
      "context": [
        {
          "id": "iuvm603",
          "author": "andthennini",
          "body": "I just don't really get why food plays such a significant role in relationships. Like, no I don't want you to cook my food so we both don't end up upset. Why's that a deal breaker?",
          "created_utc": 1667472015.0
        },
        {
          "id": "iuvooyk",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1667473823.0
        }
      ]
    },
    {
      "id": "iuwhly3",
      "author": "neko_mancy",
      "body": "..why is this getting downvoted to hell it's just answering the question lmao",
      "created_utc": 1667487888.0,
      "score": 16,
      "context": [
        {
          "id": "iuvhxwa",
          "author": "Aletayr",
          "body": "I was having similar thoughts earlier today. I've had multiple (edit: long term) relationships end with ARFID as one of the prime causes. Are there enough of us out there to make our own app??",
          "created_utc": 1667468583.0
        },
        {
          "id": "iuvm3hl",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1667471964.0
        }
      ]
    },
    {
      "id": "iuy7vfy",
      "author": "TAA21MF",
      "body": "Creative constraints are a thing. My bf doesn't have full blown arfid but he has some common ingredients that either he doesn't like (ex: garlic) or outright makes him gag (ex: egg whites), so guess what I do? Just keep a list of those ingredients so I can work around them.",
      "created_utc": 1667513326.0,
      "score": 13,
      "context": [
        {
          "id": "iuwp41h",
          "author": "curs3dfairyy",
          "body": "I'm sorry, people can be so dumb. \"hOw dArE yOu nOt EaT tHiS ???!\" What a stupid pet peeve.",
          "created_utc": 1667490868.0
        },
        {
          "id": "iux6p8a",
          "author": "Dunedune",
          "body": "People enjoy cooking for others and sharing meals.",
          "created_utc": 1667497596.0
        }
      ]
    },
    {
      "id": "iuw18z6",
      "author": "None",
      "body": "There's nothing quite like being a grown adult and having another grown adult throw an hours long tantrum because you won't eat what they \"spent hours cooking\". 😐",
      "created_utc": 1667480871.0,
      "score": 27,
      "context": [
        {
          "id": "iuvrq7l",
          "author": "None",
          "body": "At least they're up front about it. My abusive ex didn't become a \"lover of cooking\" until we were married and I thought it was too late to leave them.",
          "created_utc": 1667475785.0
        },
        {
          "id": "iuvvldw",
          "author": "Carina_Nebula89",
          "body": "I'm so sorry. That must have been terrible",
          "created_utc": 1667477992.0
        }
      ]
    },
    {
      "id": "iyh2dzt",
      "author": "gillebro",
      "body": "She’s worth it. And so are all of you.",
      "created_utc": 1669888331.0,
      "score": 3,
      "context": [
        {
          "id": "iuyeigl",
          "author": "gillebro",
          "body": "Don’t give up, my friend. I’m a foodie in a relationship with a girl with ARFID (she’s why I’m in this community), and… whatever? Of course, for some food lovers, picky eating is a deal breaker, but for many of us it isn’t. \nIt helps I’m a very, what I call, “unpretentious” foodie. I love a macca’s as much as I love high-end sushi. So fiancée and I can bond over her safe foods, because I love those foods too. \n\nTl;dr: love finds a way.",
          "created_utc": 1667516204.0
        },
        {
          "id": "ivbhyvn",
          "author": "aangiev",
          "body": "I love this thank you for listening to her and being understanding",
          "created_utc": 1667762317.0
        }
      ]
    },
    {
      "id": "iuvtudg",
      "author": "stitchbitch420",
      "body": "I can too I’m just saying that’s why it might be a turn off for some people",
      "created_utc": 1667477023.0,
      "score": 6,
      "context": [
        {
          "id": "iuvqd9s",
          "author": "stitchbitch420",
          "body": "A lot of people that love food want to be with someone that also loves food because for them eating new things together is a bonding experience. Especially when it comes to traveling.",
          "created_utc": 1667474932.0
        },
        {
          "id": "iuvt0yw",
          "author": "CounselorGowron",
          "body": "I can still thoroughly support and share my partner’s excitement over new food experiences without having to eat the same thing.",
          "created_utc": 1667476557.0
        }
      ]
    },
    {
      "id": "iuz3qj9",
      "author": "Dunedune",
      "body": "But some people want to share the food experience just like they travel with you because they want to share the travel experience",
      "created_utc": 1667526970.0,
      "score": 0,
      "context": [
        {
          "id": "iuvqd9s",
          "author": "stitchbitch420",
          "body": "A lot of people that love food want to be with someone that also loves food because for them eating new things together is a bonding experience. Especially when it comes to traveling.",
          "created_utc": 1667474932.0
        },
        {
          "id": "iuvt0yw",
          "author": "CounselorGowron",
          "body": "I can still thoroughly support and share my partner’s excitement over new food experiences without having to eat the same thing.",
          "created_utc": 1667476557.0
        }
      ]
    },
    {
      "id": "iuwdobw",
      "author": "Ryzarony23",
      "body": "I love both food and traveling, but ARFID has completely distorted my special interests. It sucks having things in common with people, but not being able to act on them as much as I’d like/at all. Most people get sick of that after awhile.",
      "created_utc": 1667486308.0,
      "score": 9,
      "context": [
        {
          "id": "iuvqd9s",
          "author": "stitchbitch420",
          "body": "A lot of people that love food want to be with someone that also loves food because for them eating new things together is a bonding experience. Especially when it comes to traveling.",
          "created_utc": 1667474932.0
        },
        {
          "id": "iuvx88s",
          "author": "FiguringItOut--",
          "body": "Lucky me, I hate food AND traveling!",
          "created_utc": 1667478869.0
        }
      ]
    },
    {
      "id": "iuw86xp",
      "author": "stitchbitch420",
      "body": "I don’t travel bc I know I won’t be able to eat anything, europe doesn’t serve cold water and that’s the only way I can drink it",
      "created_utc": 1667484012.0,
      "score": 5,
      "context": [
        {
          "id": "iuvqd9s",
          "author": "stitchbitch420",
          "body": "A lot of people that love food want to be with someone that also loves food because for them eating new things together is a bonding experience. Especially when it comes to traveling.",
          "created_utc": 1667474932.0
        },
        {
          "id": "iuvx88s",
          "author": "FiguringItOut--",
          "body": "Lucky me, I hate food AND traveling!",
          "created_utc": 1667478869.0
        }
      ]
    },
    {
      "id": "iuvs0ni",
      "author": "CounselorGowron",
      "body": "Ableism is the discrimination of and social prejudice against people with disabilities based on the belief that typical abilities are superior; sure you don’t have to date me, but if the reason is my inability to eat certain foods…",
      "created_utc": 1667475962.0,
      "score": 13,
      "context": [
        {
          "id": "iuvkotn",
          "author": "CounselorGowron",
          "body": "This was very hard for me too, ableism is rampant and often they don’t even know that’s what they’re doing. 🫠 That’s where the problem is, not with you. \n\nHowever, I’m also now proof that it’s possible to have a loving partner who truly accepts me and my food limitations; we have wonderful meal experiences together, just often eating different foods at the same time.",
          "created_utc": 1667470878.0
        },
        {
          "id": "iuvm33y",
          "author": "Dunedune",
          "body": "It is not \"ableism\" to have food be an essential part of a relationship",
          "created_utc": 1667471956.0
        }
      ]
    },
    {
      "id": "iux4il9",
      "author": "Dunedune",
      "body": "What makes you think we aren't inherently less attracted to people with health issues?\n\nYes there is a stigma, but for people who greatly enjoy building their relationships around food experience it's a legitimate downside. \n\nPeople who are looking for able or good-looking people on apps aren't ableist or \"lookist\" or whatever. You are attracted to whatever you are. That even includes genetic factors.",
      "created_utc": 1667496766.0,
      "score": 3,
      "context": [
        {
          "id": "iuvm1oe",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1667471926.0
        },
        {
          "id": "iuwodnn",
          "author": "betelcake",
          "body": "Not sure if you realize that not everyone thinks this way. We aren't inherently less attractive because of being disabled. We are less understood and therefore often excluded by people who dont know better than to believe the stigma.\nHaving stigma against you doesn't make you inherently anything, it just means uneducated people buy into stereotypes rather than getting to know you 🤷🏾‍♀️\n\nDating is harder for us yes, but still it doesnt make us \"less attractive.\" And maybe its just that the use of the word \"attractive\" is weird in this context. What kind of attraction are you even referring to?",
          "created_utc": 1667490585.0
        }
      ]
    },
    {
      "id": "iuvwagm",
      "author": "None",
      "body": "One time I declined food at a cousin's house, and my brother was being dramatic and insisting I was being rude. I tried to explain that literally no one cared and it isn't/shouldn't be that big of a deal, and that it's not rude at all to decline food you didn't even ask for.",
      "created_utc": 1667478372.0,
      "score": 43,
      "context": [
        {
          "id": "iuvm603",
          "author": "andthennini",
          "body": "I just don't really get why food plays such a significant role in relationships. Like, no I don't want you to cook my food so we both don't end up upset. Why's that a deal breaker?",
          "created_utc": 1667472015.0
        },
        {
          "id": "iuvooyk",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1667473823.0
        },
        {
          "id": "iuvv75h",
          "author": "Carina_Nebula89",
          "body": "I've read a lot of AITAs (for those who don't know it, the \"Am I the Asshole?\" subreddit) in which people got mad at a partner for declining food made by them or their parents (when inviting them to family gatherings) because they think it is rude to \"not even try\". I tried to explain to a lot of people over there already.. \"just trying\" doesn't come easy to anyone. Would it be more polite If I tried and threw up all over the floor?",
          "created_utc": 1667477776.0
        }
      ]
    },
    {
      "id": "iuyb67o",
      "author": "heighh",
      "body": "It’s rude if I try it and also rude when I gag on it and have to spit it out or spend a dramatic few minutes trying to swallow it, then spend more time after fighting the urge to throw up. I personally think it’s better to just not try it than for me to embarrass that person because I struggle to try foods on the spot.",
      "created_utc": 1667514771.0,
      "score": 14,
      "context": [
        {
          "id": "iuvm603",
          "author": "andthennini",
          "body": "I just don't really get why food plays such a significant role in relationships. Like, no I don't want you to cook my food so we both don't end up upset. Why's that a deal breaker?",
          "created_utc": 1667472015.0
        },
        {
          "id": "iuvooyk",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1667473823.0
        },
        {
          "id": "iuvv75h",
          "author": "Carina_Nebula89",
          "body": "I've read a lot of AITAs (for those who don't know it, the \"Am I the Asshole?\" subreddit) in which people got mad at a partner for declining food made by them or their parents (when inviting them to family gatherings) because they think it is rude to \"not even try\". I tried to explain to a lot of people over there already.. \"just trying\" doesn't come easy to anyone. Would it be more polite If I tried and threw up all over the floor?",
          "created_utc": 1667477776.0
        }
      ]
    },
    {
      "id": "iuydz53",
      "author": "gillebro",
      "body": "Yes, I see this all the time! There was one where the boyfriend was of Vietnamese heritage, the mum made pho, girlfriend said, several times, that ccshe wasn’t hungry, the mum SAYS RACIST SHIT ABOUT HOW ALL AMERICAN GIRLS ARE LIKE THIS, and the girlfriend was STILL called the arsehole. It’s like, mate, she’s NOT HUNGRY and you’re trying to FORCE HER TO EAT. STOP IT. STOP. IT.",
      "created_utc": 1667515973.0,
      "score": 10,
      "context": [
        {
          "id": "iuvm603",
          "author": "andthennini",
          "body": "I just don't really get why food plays such a significant role in relationships. Like, no I don't want you to cook my food so we both don't end up upset. Why's that a deal breaker?",
          "created_utc": 1667472015.0
        },
        {
          "id": "iuvooyk",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1667473823.0
        },
        {
          "id": "iuvv75h",
          "author": "Carina_Nebula89",
          "body": "I've read a lot of AITAs (for those who don't know it, the \"Am I the Asshole?\" subreddit) in which people got mad at a partner for declining food made by them or their parents (when inviting them to family gatherings) because they think it is rude to \"not even try\". I tried to explain to a lot of people over there already.. \"just trying\" doesn't come easy to anyone. Would it be more polite If I tried and threw up all over the floor?",
          "created_utc": 1667477776.0
        }
      ]
    },
    {
      "id": "iuyrslr",
      "author": "Myodokaii",
      "body": "One of my exes literally told me that he would much rather support me while sick than to... let me be with my food. Like wow, that's telling. I do not want to deal with getting sick cause of discovering whatever food was served to me isn't safe. He said it wouldn't be a daily thing that his family would do that, but I don't care, I deserve to be comfortable with what I'm eating and to eat when I need to without getting sick.",
      "created_utc": 1667521858.0,
      "score": 8,
      "context": [
        {
          "id": "iuvm603",
          "author": "andthennini",
          "body": "I just don't really get why food plays such a significant role in relationships. Like, no I don't want you to cook my food so we both don't end up upset. Why's that a deal breaker?",
          "created_utc": 1667472015.0
        },
        {
          "id": "iuvooyk",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1667473823.0
        },
        {
          "id": "iuvv75h",
          "author": "Carina_Nebula89",
          "body": "I've read a lot of AITAs (for those who don't know it, the \"Am I the Asshole?\" subreddit) in which people got mad at a partner for declining food made by them or their parents (when inviting them to family gatherings) because they think it is rude to \"not even try\". I tried to explain to a lot of people over there already.. \"just trying\" doesn't come easy to anyone. Would it be more polite If I tried and threw up all over the floor?",
          "created_utc": 1667477776.0
        }
      ]
    },
    {
      "id": "iuw0z4u",
      "author": "notlikelyevil",
      "body": "I guess we could say \"food limitations\" as a disability? In the ARFID diagnostic criteria it mentions social impairment related to food as part of the criteria IIRC.",
      "created_utc": 1667480740.0,
      "score": 15,
      "context": [
        {
          "id": "iuvm603",
          "author": "andthennini",
          "body": "I just don't really get why food plays such a significant role in relationships. Like, no I don't want you to cook my food so we both don't end up upset. Why's that a deal breaker?",
          "created_utc": 1667472015.0
        },
        {
          "id": "iuvooyk",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1667473823.0
        },
        {
          "id": "iuvyb5h",
          "author": "painandclots",
          "body": "Seeing the words \"society has no concept of food as a disability\" has really resonated with me. It's something I've always thought but never had the exact words to explain it so perfectly. Thank you for this. Food can be a disability.",
          "created_utc": 1667479421.0
        }
      ]
    },
    {
      "id": "iuwp77r",
      "author": "curs3dfairyy",
      "body": "Probably because it's incorrect lmao",
      "created_utc": 1667490903.0,
      "score": 1,
      "context": [
        {
          "id": "iuvhxwa",
          "author": "Aletayr",
          "body": "I was having similar thoughts earlier today. I've had multiple (edit: long term) relationships end with ARFID as one of the prime causes. Are there enough of us out there to make our own app??",
          "created_utc": 1667468583.0
        },
        {
          "id": "iuvm3hl",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1667471964.0
        },
        {
          "id": "iuwhly3",
          "author": "neko_mancy",
          "body": "..why is this getting downvoted to hell it's just answering the question lmao",
          "created_utc": 1667487888.0
        }
      ]
    },
    {
      "id": "iuynaiy",
      "author": "Dunedune",
      "body": "Yeah. It's a downside for some, a deal breaker for some, and not a bother at all for others. That is normal. We're not entitled to people wanting to deal with our issues.",
      "created_utc": 1667519966.0,
      "score": 4,
      "context": [
        {
          "id": "iuwp41h",
          "author": "curs3dfairyy",
          "body": "I'm sorry, people can be so dumb. \"hOw dArE yOu nOt EaT tHiS ???!\" What a stupid pet peeve.",
          "created_utc": 1667490868.0
        },
        {
          "id": "iux6p8a",
          "author": "Dunedune",
          "body": "People enjoy cooking for others and sharing meals.",
          "created_utc": 1667497596.0
        },
        {
          "id": "iuy7vfy",
          "author": "TAA21MF",
          "body": "Creative constraints are a thing. My bf doesn't have full blown arfid but he has some common ingredients that either he doesn't like (ex: garlic) or outright makes him gag (ex: egg whites), so guess what I do? Just keep a list of those ingredients so I can work around them.",
          "created_utc": 1667513326.0
        }
      ]
    },
    {
      "id": "iuw5ku2",
      "author": "Carina_Nebula89",
      "body": "I'm glad he is your ex now. Sounds like good riddance",
      "created_utc": 1667482869.0,
      "score": 14,
      "context": [
        {
          "id": "iuvrq7l",
          "author": "None",
          "body": "At least they're up front about it. My abusive ex didn't become a \"lover of cooking\" until we were married and I thought it was too late to leave them.",
          "created_utc": 1667475785.0
        },
        {
          "id": "iuvvldw",
          "author": "Carina_Nebula89",
          "body": "I'm so sorry. That must have been terrible",
          "created_utc": 1667477992.0
        },
        {
          "id": "iuw18z6",
          "author": "None",
          "body": "There's nothing quite like being a grown adult and having another grown adult throw an hours long tantrum because you won't eat what they \"spent hours cooking\". 😐",
          "created_utc": 1667480871.0
        }
      ]
    },
    {
      "id": "iuyyym5",
      "author": "CounselorGowron",
      "body": "I’m sad my husband is allergic to mango and cannot ever enjoy what seems delicious to me, but how that inability to share this specific food experience could ever become a turn off eludes me?",
      "created_utc": 1667524936.0,
      "score": 3,
      "context": [
        {
          "id": "iuvqd9s",
          "author": "stitchbitch420",
          "body": "A lot of people that love food want to be with someone that also loves food because for them eating new things together is a bonding experience. Especially when it comes to traveling.",
          "created_utc": 1667474932.0
        },
        {
          "id": "iuvt0yw",
          "author": "CounselorGowron",
          "body": "I can still thoroughly support and share my partner’s excitement over new food experiences without having to eat the same thing.",
          "created_utc": 1667476557.0
        },
        {
          "id": "iuvtudg",
          "author": "stitchbitch420",
          "body": "I can too I’m just saying that’s why it might be a turn off for some people",
          "created_utc": 1667477023.0
        }
      ]
    },
    {
      "id": "iuvs7pa",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1667476081.0,
      "score": -17,
      "context": [
        {
          "id": "iuvkotn",
          "author": "CounselorGowron",
          "body": "This was very hard for me too, ableism is rampant and often they don’t even know that’s what they’re doing. 🫠 That’s where the problem is, not with you. \n\nHowever, I’m also now proof that it’s possible to have a loving partner who truly accepts me and my food limitations; we have wonderful meal experiences together, just often eating different foods at the same time.",
          "created_utc": 1667470878.0
        },
        {
          "id": "iuvm33y",
          "author": "Dunedune",
          "body": "It is not \"ableism\" to have food be an essential part of a relationship",
          "created_utc": 1667471956.0
        },
        {
          "id": "iuvs0ni",
          "author": "CounselorGowron",
          "body": "Ableism is the discrimination of and social prejudice against people with disabilities based on the belief that typical abilities are superior; sure you don’t have to date me, but if the reason is my inability to eat certain foods…",
          "created_utc": 1667475962.0
        }
      ]
    },
    {
      "id": "iuw0c3g",
      "author": "CounselorGowron",
      "body": "According to Nonviolent Communication, the ONLY difference between a request and a demand is the response when someone says no.",
      "created_utc": 1667480428.0,
      "score": 44,
      "context": [
        {
          "id": "iuvm603",
          "author": "andthennini",
          "body": "I just don't really get why food plays such a significant role in relationships. Like, no I don't want you to cook my food so we both don't end up upset. Why's that a deal breaker?",
          "created_utc": 1667472015.0
        },
        {
          "id": "iuvooyk",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1667473823.0
        },
        {
          "id": "iuvv75h",
          "author": "Carina_Nebula89",
          "body": "I've read a lot of AITAs (for those who don't know it, the \"Am I the Asshole?\" subreddit) in which people got mad at a partner for declining food made by them or their parents (when inviting them to family gatherings) because they think it is rude to \"not even try\". I tried to explain to a lot of people over there already.. \"just trying\" doesn't come easy to anyone. Would it be more polite If I tried and threw up all over the floor?",
          "created_utc": 1667477776.0
        },
        {
          "id": "iuvwagm",
          "author": "None",
          "body": "One time I declined food at a cousin's house, and my brother was being dramatic and insisting I was being rude. I tried to explain that literally no one cared and it isn't/shouldn't be that big of a deal, and that it's not rude at all to decline food you didn't even ask for.",
          "created_utc": 1667478372.0
        }
      ]
    },
    {
      "id": "iuvz9wg",
      "author": "Carina_Nebula89",
      "body": "I agree, it shouldn't be that big of a deal. No one should expect anyone to try something if they did not ask for it.Sadly for some people it is a big deal and they find it rude.  \nWe used to have easter at my aunts house every year when I grew up, and EVERY ..FREAKING ..YEAR she offered me fish (which I absolutely hate) and got upset that I am not even trying because it would be polite.  \nI was so glad when we stopped having easter there",
      "created_utc": 1667479907.0,
      "score": 17,
      "context": [
        {
          "id": "iuvm603",
          "author": "andthennini",
          "body": "I just don't really get why food plays such a significant role in relationships. Like, no I don't want you to cook my food so we both don't end up upset. Why's that a deal breaker?",
          "created_utc": 1667472015.0
        },
        {
          "id": "iuvooyk",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1667473823.0
        },
        {
          "id": "iuvv75h",
          "author": "Carina_Nebula89",
          "body": "I've read a lot of AITAs (for those who don't know it, the \"Am I the Asshole?\" subreddit) in which people got mad at a partner for declining food made by them or their parents (when inviting them to family gatherings) because they think it is rude to \"not even try\". I tried to explain to a lot of people over there already.. \"just trying\" doesn't come easy to anyone. Would it be more polite If I tried and threw up all over the floor?",
          "created_utc": 1667477776.0
        },
        {
          "id": "iuvwagm",
          "author": "None",
          "body": "One time I declined food at a cousin's house, and my brother was being dramatic and insisting I was being rude. I tried to explain that literally no one cared and it isn't/shouldn't be that big of a deal, and that it's not rude at all to decline food you didn't even ask for.",
          "created_utc": 1667478372.0
        }
      ]
    },
    {
      "id": "iuzzqb2",
      "author": "Carina_Nebula89",
      "body": "Exactly!! No matter what we do it is wrong anyways. Usually I try to find some excuse  or a little white lie like \"i think i must have eaten something bad yesterday, my stomache is not feeling so well so I rather not eat anything right now\"",
      "created_utc": 1667546508.0,
      "score": 6,
      "context": [
        {
          "id": "iuvm603",
          "author": "andthennini",
          "body": "I just don't really get why food plays such a significant role in relationships. Like, no I don't want you to cook my food so we both don't end up upset. Why's that a deal breaker?",
          "created_utc": 1667472015.0
        },
        {
          "id": "iuvooyk",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1667473823.0
        },
        {
          "id": "iuvv75h",
          "author": "Carina_Nebula89",
          "body": "I've read a lot of AITAs (for those who don't know it, the \"Am I the Asshole?\" subreddit) in which people got mad at a partner for declining food made by them or their parents (when inviting them to family gatherings) because they think it is rude to \"not even try\". I tried to explain to a lot of people over there already.. \"just trying\" doesn't come easy to anyone. Would it be more polite If I tried and threw up all over the floor?",
          "created_utc": 1667477776.0
        },
        {
          "id": "iuyb67o",
          "author": "heighh",
          "body": "It’s rude if I try it and also rude when I gag on it and have to spit it out or spend a dramatic few minutes trying to swallow it, then spend more time after fighting the urge to throw up. I personally think it’s better to just not try it than for me to embarrass that person because I struggle to try foods on the spot.",
          "created_utc": 1667514771.0
        }
      ]
    },
    {
      "id": "iuzyhky",
      "author": "Carina_Nebula89",
      "body": "I remember that story!! And most of the people in the comments were calling the girl the AH and said stuff like \"you're acting like a child\" \"just get over yourself and try it\" \"come on, it is just soup\" It made me soooo mad!!",
      "created_utc": 1667545404.0,
      "score": 4,
      "context": [
        {
          "id": "iuvm603",
          "author": "andthennini",
          "body": "I just don't really get why food plays such a significant role in relationships. Like, no I don't want you to cook my food so we both don't end up upset. Why's that a deal breaker?",
          "created_utc": 1667472015.0
        },
        {
          "id": "iuvooyk",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1667473823.0
        },
        {
          "id": "iuvv75h",
          "author": "Carina_Nebula89",
          "body": "I've read a lot of AITAs (for those who don't know it, the \"Am I the Asshole?\" subreddit) in which people got mad at a partner for declining food made by them or their parents (when inviting them to family gatherings) because they think it is rude to \"not even try\". I tried to explain to a lot of people over there already.. \"just trying\" doesn't come easy to anyone. Would it be more polite If I tried and threw up all over the floor?",
          "created_utc": 1667477776.0
        },
        {
          "id": "iuydz53",
          "author": "gillebro",
          "body": "Yes, I see this all the time! There was one where the boyfriend was of Vietnamese heritage, the mum made pho, girlfriend said, several times, that ccshe wasn’t hungry, the mum SAYS RACIST SHIT ABOUT HOW ALL AMERICAN GIRLS ARE LIKE THIS, and the girlfriend was STILL called the arsehole. It’s like, mate, she’s NOT HUNGRY and you’re trying to FORCE HER TO EAT. STOP IT. STOP. IT.",
          "created_utc": 1667515973.0
        }
      ]
    },
    {
      "id": "ivg10gh",
      "author": "wzy519",
      "body": "And people like you are exactly why people think Americans are racist—you think actual natural food and produce cooked by other cultures is “weird” or “disgusting” while you only eat highly processed food that no one before the last century ate. The reason that girl in AITA was obviously the big asshole is because she kept calling their food “gross”, a typical thing westerners do to degrade Asian food, super racist and ethnocentric",
      "created_utc": 1667845655.0,
      "score": 1,
      "context": [
        {
          "id": "iuvm603",
          "author": "andthennini",
          "body": "I just don't really get why food plays such a significant role in relationships. Like, no I don't want you to cook my food so we both don't end up upset. Why's that a deal breaker?",
          "created_utc": 1667472015.0
        },
        {
          "id": "iuvooyk",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1667473823.0
        },
        {
          "id": "iuvv75h",
          "author": "Carina_Nebula89",
          "body": "I've read a lot of AITAs (for those who don't know it, the \"Am I the Asshole?\" subreddit) in which people got mad at a partner for declining food made by them or their parents (when inviting them to family gatherings) because they think it is rude to \"not even try\". I tried to explain to a lot of people over there already.. \"just trying\" doesn't come easy to anyone. Would it be more polite If I tried and threw up all over the floor?",
          "created_utc": 1667477776.0
        },
        {
          "id": "iuydz53",
          "author": "gillebro",
          "body": "Yes, I see this all the time! There was one where the boyfriend was of Vietnamese heritage, the mum made pho, girlfriend said, several times, that ccshe wasn’t hungry, the mum SAYS RACIST SHIT ABOUT HOW ALL AMERICAN GIRLS ARE LIKE THIS, and the girlfriend was STILL called the arsehole. It’s like, mate, she’s NOT HUNGRY and you’re trying to FORCE HER TO EAT. STOP IT. STOP. IT.",
          "created_utc": 1667515973.0
        }
      ]
    },
    {
      "id": "iuzzguc",
      "author": "Carina_Nebula89",
      "body": "That really sucks. I wish more people would understand that we are not doing this by choice. It is an actual eating disorder. I would love to be able to try new food easily and not to get so anxious about situations like this but I just can't.",
      "created_utc": 1667546276.0,
      "score": 5,
      "context": [
        {
          "id": "iuvm603",
          "author": "andthennini",
          "body": "I just don't really get why food plays such a significant role in relationships. Like, no I don't want you to cook my food so we both don't end up upset. Why's that a deal breaker?",
          "created_utc": 1667472015.0
        },
        {
          "id": "iuvooyk",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1667473823.0
        },
        {
          "id": "iuvv75h",
          "author": "Carina_Nebula89",
          "body": "I've read a lot of AITAs (for those who don't know it, the \"Am I the Asshole?\" subreddit) in which people got mad at a partner for declining food made by them or their parents (when inviting them to family gatherings) because they think it is rude to \"not even try\". I tried to explain to a lot of people over there already.. \"just trying\" doesn't come easy to anyone. Would it be more polite If I tried and threw up all over the floor?",
          "created_utc": 1667477776.0
        },
        {
          "id": "iuyrslr",
          "author": "Myodokaii",
          "body": "One of my exes literally told me that he would much rather support me while sick than to... let me be with my food. Like wow, that's telling. I do not want to deal with getting sick cause of discovering whatever food was served to me isn't safe. He said it wouldn't be a daily thing that his family would do that, but I don't care, I deserve to be comfortable with what I'm eating and to eat when I need to without getting sick.",
          "created_utc": 1667521858.0
        }
      ]
    },
    {
      "id": "iuwv33j",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1667493182.0,
      "score": 10,
      "context": [
        {
          "id": "iuvhxwa",
          "author": "Aletayr",
          "body": "I was having similar thoughts earlier today. I've had multiple (edit: long term) relationships end with ARFID as one of the prime causes. Are there enough of us out there to make our own app??",
          "created_utc": 1667468583.0
        },
        {
          "id": "iuvm3hl",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1667471964.0
        },
        {
          "id": "iuwhly3",
          "author": "neko_mancy",
          "body": "..why is this getting downvoted to hell it's just answering the question lmao",
          "created_utc": 1667487888.0
        },
        {
          "id": "iuwp77r",
          "author": "curs3dfairyy",
          "body": "Probably because it's incorrect lmao",
          "created_utc": 1667490903.0
        }
      ]
    },
    {
      "id": "iv2jz1m",
      "author": "stitchbitch420",
      "body": "It’s more like if your husband weren’t allergic but just didn’t like or refused to try mango. That’s what I think is a turn off for people.",
      "created_utc": 1667592691.0,
      "score": 0,
      "context": [
        {
          "id": "iuvqd9s",
          "author": "stitchbitch420",
          "body": "A lot of people that love food want to be with someone that also loves food because for them eating new things together is a bonding experience. Especially when it comes to traveling.",
          "created_utc": 1667474932.0
        },
        {
          "id": "iuvt0yw",
          "author": "CounselorGowron",
          "body": "I can still thoroughly support and share my partner’s excitement over new food experiences without having to eat the same thing.",
          "created_utc": 1667476557.0
        },
        {
          "id": "iuvtudg",
          "author": "stitchbitch420",
          "body": "I can too I’m just saying that’s why it might be a turn off for some people",
          "created_utc": 1667477023.0
        },
        {
          "id": "iuyyym5",
          "author": "CounselorGowron",
          "body": "I’m sad my husband is allergic to mango and cannot ever enjoy what seems delicious to me, but how that inability to share this specific food experience could ever become a turn off eludes me?",
          "created_utc": 1667524936.0
        }
      ]
    },
    {
      "id": "iuwn104",
      "author": "betelcake",
      "body": "Your example about walking is EXTREMELY ableist, ARFID aside....",
      "created_utc": 1667490051.0,
      "score": 15,
      "context": [
        {
          "id": "iuvkotn",
          "author": "CounselorGowron",
          "body": "This was very hard for me too, ableism is rampant and often they don’t even know that’s what they’re doing. 🫠 That’s where the problem is, not with you. \n\nHowever, I’m also now proof that it’s possible to have a loving partner who truly accepts me and my food limitations; we have wonderful meal experiences together, just often eating different foods at the same time.",
          "created_utc": 1667470878.0
        },
        {
          "id": "iuvm33y",
          "author": "Dunedune",
          "body": "It is not \"ableism\" to have food be an essential part of a relationship",
          "created_utc": 1667471956.0
        },
        {
          "id": "iuvs0ni",
          "author": "CounselorGowron",
          "body": "Ableism is the discrimination of and social prejudice against people with disabilities based on the belief that typical abilities are superior; sure you don’t have to date me, but if the reason is my inability to eat certain foods…",
          "created_utc": 1667475962.0
        },
        {
          "id": "iuvs7pa",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1667476081.0
        }
      ]
    },
    {
      "id": "iuwnhjy",
      "author": "betelcake",
      "body": "I dont fully disagree, it is up to anyone to have their preferences. If eating together is important to someone, dating a person w ARFID isnt the best idea.\n\nHowever to blindly make statements such as \"I will never date a picky eater\" \"If they dont eat w me I dont want them\" etc are somewhat ableist in that they systemically and categorically exclude people who are suffering from a disability. We are not ABLE to eat like most people. Being excluded because of just that which we have no control over, is exactly the same as never letting the kid in the wheelchair play sports because the school cant be bothered to make accommodations.\n\nAt the end of the day, it's still ableist. I'm not saying theyre necessarily wrong for thinking that. Just that you cant deny that this is systemic exclusion of a disabled group, as a result of society's limited understanding of how relationships with food \"should\" be.\nWhich is the LITERAL definition of ableism, that another commenter has already put in different words.",
      "created_utc": 1667490232.0,
      "score": 11,
      "context": [
        {
          "id": "iuvkotn",
          "author": "CounselorGowron",
          "body": "This was very hard for me too, ableism is rampant and often they don’t even know that’s what they’re doing. 🫠 That’s where the problem is, not with you. \n\nHowever, I’m also now proof that it’s possible to have a loving partner who truly accepts me and my food limitations; we have wonderful meal experiences together, just often eating different foods at the same time.",
          "created_utc": 1667470878.0
        },
        {
          "id": "iuvm33y",
          "author": "Dunedune",
          "body": "It is not \"ableism\" to have food be an essential part of a relationship",
          "created_utc": 1667471956.0
        },
        {
          "id": "iuvs0ni",
          "author": "CounselorGowron",
          "body": "Ableism is the discrimination of and social prejudice against people with disabilities based on the belief that typical abilities are superior; sure you don’t have to date me, but if the reason is my inability to eat certain foods…",
          "created_utc": 1667475962.0
        },
        {
          "id": "iuvs7pa",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1667476081.0
        }
      ]
    },
    {
      "id": "iuvv6pb",
      "author": "Remarkable-Load4175",
      "body": "At least accept you're ableist, makes it easier for people to know to stay away from you",
      "created_utc": 1667477770.0,
      "score": 13,
      "context": [
        {
          "id": "iuvkotn",
          "author": "CounselorGowron",
          "body": "This was very hard for me too, ableism is rampant and often they don’t even know that’s what they’re doing. 🫠 That’s where the problem is, not with you. \n\nHowever, I’m also now proof that it’s possible to have a loving partner who truly accepts me and my food limitations; we have wonderful meal experiences together, just often eating different foods at the same time.",
          "created_utc": 1667470878.0
        },
        {
          "id": "iuvm33y",
          "author": "Dunedune",
          "body": "It is not \"ableism\" to have food be an essential part of a relationship",
          "created_utc": 1667471956.0
        },
        {
          "id": "iuvs0ni",
          "author": "CounselorGowron",
          "body": "Ableism is the discrimination of and social prejudice against people with disabilities based on the belief that typical abilities are superior; sure you don’t have to date me, but if the reason is my inability to eat certain foods…",
          "created_utc": 1667475962.0
        },
        {
          "id": "iuvs7pa",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1667476081.0
        }
      ]
    },
    {
      "id": "iuvzlmr",
      "author": "None",
      "body": "Once at a family gathering someone literally just shoved fish into my mouth. For some fucking reason I swallowed it and didn't get angry about it or make a scene, but just the idea of that in hindsight is infuriating.",
      "created_utc": 1667480066.0,
      "score": 9,
      "context": [
        {
          "id": "iuvm603",
          "author": "andthennini",
          "body": "I just don't really get why food plays such a significant role in relationships. Like, no I don't want you to cook my food so we both don't end up upset. Why's that a deal breaker?",
          "created_utc": 1667472015.0
        },
        {
          "id": "iuvooyk",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1667473823.0
        },
        {
          "id": "iuvv75h",
          "author": "Carina_Nebula89",
          "body": "I've read a lot of AITAs (for those who don't know it, the \"Am I the Asshole?\" subreddit) in which people got mad at a partner for declining food made by them or their parents (when inviting them to family gatherings) because they think it is rude to \"not even try\". I tried to explain to a lot of people over there already.. \"just trying\" doesn't come easy to anyone. Would it be more polite If I tried and threw up all over the floor?",
          "created_utc": 1667477776.0
        },
        {
          "id": "iuvwagm",
          "author": "None",
          "body": "One time I declined food at a cousin's house, and my brother was being dramatic and insisting I was being rude. I tried to explain that literally no one cared and it isn't/shouldn't be that big of a deal, and that it's not rude at all to decline food you didn't even ask for.",
          "created_utc": 1667478372.0
        },
        {
          "id": "iuvz9wg",
          "author": "Carina_Nebula89",
          "body": "I agree, it shouldn't be that big of a deal. No one should expect anyone to try something if they did not ask for it.Sadly for some people it is a big deal and they find it rude.  \nWe used to have easter at my aunts house every year when I grew up, and EVERY ..FREAKING ..YEAR she offered me fish (which I absolutely hate) and got upset that I am not even trying because it would be polite.  \nI was so glad when we stopped having easter there",
          "created_utc": 1667479907.0
        }
      ]
    },
    {
      "id": "iv3i5m9",
      "author": "gillebro",
      "body": "It was absolutely revolting and I was furious. I still think about it now and get angry.",
      "created_utc": 1667607740.0,
      "score": 4,
      "context": [
        {
          "id": "iuvm603",
          "author": "andthennini",
          "body": "I just don't really get why food plays such a significant role in relationships. Like, no I don't want you to cook my food so we both don't end up upset. Why's that a deal breaker?",
          "created_utc": 1667472015.0
        },
        {
          "id": "iuvooyk",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1667473823.0
        },
        {
          "id": "iuvv75h",
          "author": "Carina_Nebula89",
          "body": "I've read a lot of AITAs (for those who don't know it, the \"Am I the Asshole?\" subreddit) in which people got mad at a partner for declining food made by them or their parents (when inviting them to family gatherings) because they think it is rude to \"not even try\". I tried to explain to a lot of people over there already.. \"just trying\" doesn't come easy to anyone. Would it be more polite If I tried and threw up all over the floor?",
          "created_utc": 1667477776.0
        },
        {
          "id": "iuydz53",
          "author": "gillebro",
          "body": "Yes, I see this all the time! There was one where the boyfriend was of Vietnamese heritage, the mum made pho, girlfriend said, several times, that ccshe wasn’t hungry, the mum SAYS RACIST SHIT ABOUT HOW ALL AMERICAN GIRLS ARE LIKE THIS, and the girlfriend was STILL called the arsehole. It’s like, mate, she’s NOT HUNGRY and you’re trying to FORCE HER TO EAT. STOP IT. STOP. IT.",
          "created_utc": 1667515973.0
        },
        {
          "id": "iuzyhky",
          "author": "Carina_Nebula89",
          "body": "I remember that story!! And most of the people in the comments were calling the girl the AH and said stuff like \"you're acting like a child\" \"just get over yourself and try it\" \"come on, it is just soup\" It made me soooo mad!!",
          "created_utc": 1667545404.0
        }
      ]
    },
    {
      "id": "ivvuxe4",
      "author": "gillebro",
      "body": "That’s presumptuous of you. I’m not American, first of all - I’d have thought my unAmerican usage of English would have made that clear. Secondly, most of the food I eat is home cooked, and it includes plenty of Asian dishes (I’ve been making excellent chicken adobo lately). I would have eaten that pho in a heartbeat. But I don’t have ARFID - I’m in this subreddit because my partner has it.\n\nI agree that the girl calling the food “gross” \nis not on. However, from what I can recall the issue was that she wasn’t hungry and the food was unfamiliar to her. While I can of course appreciate how in certain cultures it is polite to eat food whenever it’s given to you, I also think it is unfair to expect somebody unfamiliar with those customs to abide by them. If this girl has ARFID or something similar, she was probably terrified of what might happen if she tried this unfamiliar food. And even if she wasn’t, the food wasn’t something she wanted or asked for, and labelling her as an arsehole for not eating something she doesn’t want to eat (in other words, not abiding by a custom she may not be aware of, from a culture that she is not a part of), seems particularly intolerant to me.\n\nEdit: grammar errors",
      "created_utc": 1668124938.0,
      "score": 4,
      "context": [
        {
          "id": "iuvm603",
          "author": "andthennini",
          "body": "I just don't really get why food plays such a significant role in relationships. Like, no I don't want you to cook my food so we both don't end up upset. Why's that a deal breaker?",
          "created_utc": 1667472015.0
        },
        {
          "id": "iuvooyk",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1667473823.0
        },
        {
          "id": "iuvv75h",
          "author": "Carina_Nebula89",
          "body": "I've read a lot of AITAs (for those who don't know it, the \"Am I the Asshole?\" subreddit) in which people got mad at a partner for declining food made by them or their parents (when inviting them to family gatherings) because they think it is rude to \"not even try\". I tried to explain to a lot of people over there already.. \"just trying\" doesn't come easy to anyone. Would it be more polite If I tried and threw up all over the floor?",
          "created_utc": 1667477776.0
        },
        {
          "id": "iuydz53",
          "author": "gillebro",
          "body": "Yes, I see this all the time! There was one where the boyfriend was of Vietnamese heritage, the mum made pho, girlfriend said, several times, that ccshe wasn’t hungry, the mum SAYS RACIST SHIT ABOUT HOW ALL AMERICAN GIRLS ARE LIKE THIS, and the girlfriend was STILL called the arsehole. It’s like, mate, she’s NOT HUNGRY and you’re trying to FORCE HER TO EAT. STOP IT. STOP. IT.",
          "created_utc": 1667515973.0
        },
        {
          "id": "ivg10gh",
          "author": "wzy519",
          "body": "And people like you are exactly why people think Americans are racist—you think actual natural food and produce cooked by other cultures is “weird” or “disgusting” while you only eat highly processed food that no one before the last century ate. The reason that girl in AITA was obviously the big asshole is because she kept calling their food “gross”, a typical thing westerners do to degrade Asian food, super racist and ethnocentric",
          "created_utc": 1667845655.0
        }
      ]
    },
    {
      "id": "iv00qgq",
      "author": "Myodokaii",
      "body": "Exactly, I would love to be able to be adventurous with food. But as an autistic emetophobe, I can't be for my own health",
      "created_utc": 1667547408.0,
      "score": 2,
      "context": [
        {
          "id": "iuvm603",
          "author": "andthennini",
          "body": "I just don't really get why food plays such a significant role in relationships. Like, no I don't want you to cook my food so we both don't end up upset. Why's that a deal breaker?",
          "created_utc": 1667472015.0
        },
        {
          "id": "iuvooyk",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1667473823.0
        },
        {
          "id": "iuvv75h",
          "author": "Carina_Nebula89",
          "body": "I've read a lot of AITAs (for those who don't know it, the \"Am I the Asshole?\" subreddit) in which people got mad at a partner for declining food made by them or their parents (when inviting them to family gatherings) because they think it is rude to \"not even try\". I tried to explain to a lot of people over there already.. \"just trying\" doesn't come easy to anyone. Would it be more polite If I tried and threw up all over the floor?",
          "created_utc": 1667477776.0
        },
        {
          "id": "iuyrslr",
          "author": "Myodokaii",
          "body": "One of my exes literally told me that he would much rather support me while sick than to... let me be with my food. Like wow, that's telling. I do not want to deal with getting sick cause of discovering whatever food was served to me isn't safe. He said it wouldn't be a daily thing that his family would do that, but I don't care, I deserve to be comfortable with what I'm eating and to eat when I need to without getting sick.",
          "created_utc": 1667521858.0
        },
        {
          "id": "iuzzguc",
          "author": "Carina_Nebula89",
          "body": "That really sucks. I wish more people would understand that we are not doing this by choice. It is an actual eating disorder. I would love to be able to try new food easily and not to get so anxious about situations like this but I just can't.",
          "created_utc": 1667546276.0
        }
      ]
    },
    {
      "id": "iwu3fnm",
      "author": "ARFID-ModTeam",
      "body": "We do not tolerate trolls here. Your post or comment was removed for trolling.",
      "created_utc": 1668768063.0,
      "score": 1,
      "context": [
        {
          "id": "iuvhxwa",
          "author": "Aletayr",
          "body": "I was having similar thoughts earlier today. I've had multiple (edit: long term) relationships end with ARFID as one of the prime causes. Are there enough of us out there to make our own app??",
          "created_utc": 1667468583.0
        },
        {
          "id": "iuvm3hl",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1667471964.0
        },
        {
          "id": "iuwhly3",
          "author": "neko_mancy",
          "body": "..why is this getting downvoted to hell it's just answering the question lmao",
          "created_utc": 1667487888.0
        },
        {
          "id": "iuwp77r",
          "author": "curs3dfairyy",
          "body": "Probably because it's incorrect lmao",
          "created_utc": 1667490903.0
        },
        {
          "id": "iuwv33j",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1667493182.0
        }
      ]
    },
    {
      "id": "iv2mzic",
      "author": "CounselorGowron",
      "body": "A) Does it make sense to be turned off by his DISLIKING mango, as if he could do anything about that? Not in any way I can understand. \nB) Would it be a turn off for him to try the thing he doesn’t want, throw up, have a panic attack, and then be too afraid to eat anything for days? Because that’s what my brain does in this scenario, welcome to ARFID. Sounds way worse than just enjoying one’s own thing and moving the eff on rather than asserting their will on others.",
      "created_utc": 1667593895.0,
      "score": 3,
      "context": [
        {
          "id": "iuvqd9s",
          "author": "stitchbitch420",
          "body": "A lot of people that love food want to be with someone that also loves food because for them eating new things together is a bonding experience. Especially when it comes to traveling.",
          "created_utc": 1667474932.0
        },
        {
          "id": "iuvt0yw",
          "author": "CounselorGowron",
          "body": "I can still thoroughly support and share my partner’s excitement over new food experiences without having to eat the same thing.",
          "created_utc": 1667476557.0
        },
        {
          "id": "iuvtudg",
          "author": "stitchbitch420",
          "body": "I can too I’m just saying that’s why it might be a turn off for some people",
          "created_utc": 1667477023.0
        },
        {
          "id": "iuyyym5",
          "author": "CounselorGowron",
          "body": "I’m sad my husband is allergic to mango and cannot ever enjoy what seems delicious to me, but how that inability to share this specific food experience could ever become a turn off eludes me?",
          "created_utc": 1667524936.0
        },
        {
          "id": "iv2jz1m",
          "author": "stitchbitch420",
          "body": "It’s more like if your husband weren’t allergic but just didn’t like or refused to try mango. That’s what I think is a turn off for people.",
          "created_utc": 1667592691.0
        }
      ]
    },
    {
      "id": "iuwvovw",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1667493413.0,
      "score": -5,
      "context": [
        {
          "id": "iuvkotn",
          "author": "CounselorGowron",
          "body": "This was very hard for me too, ableism is rampant and often they don’t even know that’s what they’re doing. 🫠 That’s where the problem is, not with you. \n\nHowever, I’m also now proof that it’s possible to have a loving partner who truly accepts me and my food limitations; we have wonderful meal experiences together, just often eating different foods at the same time.",
          "created_utc": 1667470878.0
        },
        {
          "id": "iuvm33y",
          "author": "Dunedune",
          "body": "It is not \"ableism\" to have food be an essential part of a relationship",
          "created_utc": 1667471956.0
        },
        {
          "id": "iuvs0ni",
          "author": "CounselorGowron",
          "body": "Ableism is the discrimination of and social prejudice against people with disabilities based on the belief that typical abilities are superior; sure you don’t have to date me, but if the reason is my inability to eat certain foods…",
          "created_utc": 1667475962.0
        },
        {
          "id": "iuvs7pa",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1667476081.0
        },
        {
          "id": "iuwn104",
          "author": "betelcake",
          "body": "Your example about walking is EXTREMELY ableist, ARFID aside....",
          "created_utc": 1667490051.0
        }
      ]
    },
    {
      "id": "iuwp3gm",
      "author": "Remarkable-Load4175",
      "body": "Thank you, you've said this much better than I could",
      "created_utc": 1667490862.0,
      "score": 9,
      "context": [
        {
          "id": "iuvkotn",
          "author": "CounselorGowron",
          "body": "This was very hard for me too, ableism is rampant and often they don’t even know that’s what they’re doing. 🫠 That’s where the problem is, not with you. \n\nHowever, I’m also now proof that it’s possible to have a loving partner who truly accepts me and my food limitations; we have wonderful meal experiences together, just often eating different foods at the same time.",
          "created_utc": 1667470878.0
        },
        {
          "id": "iuvm33y",
          "author": "Dunedune",
          "body": "It is not \"ableism\" to have food be an essential part of a relationship",
          "created_utc": 1667471956.0
        },
        {
          "id": "iuvs0ni",
          "author": "CounselorGowron",
          "body": "Ableism is the discrimination of and social prejudice against people with disabilities based on the belief that typical abilities are superior; sure you don’t have to date me, but if the reason is my inability to eat certain foods…",
          "created_utc": 1667475962.0
        },
        {
          "id": "iuvs7pa",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1667476081.0
        },
        {
          "id": "iuwnhjy",
          "author": "betelcake",
          "body": "I dont fully disagree, it is up to anyone to have their preferences. If eating together is important to someone, dating a person w ARFID isnt the best idea.\n\nHowever to blindly make statements such as \"I will never date a picky eater\" \"If they dont eat w me I dont want them\" etc are somewhat ableist in that they systemically and categorically exclude people who are suffering from a disability. We are not ABLE to eat like most people. Being excluded because of just that which we have no control over, is exactly the same as never letting the kid in the wheelchair play sports because the school cant be bothered to make accommodations.\n\nAt the end of the day, it's still ableist. I'm not saying theyre necessarily wrong for thinking that. Just that you cant deny that this is systemic exclusion of a disabled group, as a result of society's limited understanding of how relationships with food \"should\" be.\nWhich is the LITERAL definition of ableism, that another commenter has already put in different words.",
          "created_utc": 1667490232.0
        }
      ]
    },
    {
      "id": "iux501l",
      "author": "Dunedune",
      "body": "Yes, it is absolutely not your fault that you cannot eat with them, but it is absolutely their right to not want a relationship with you either for that motive.\n\nAnd people who love to hike in the mountains have the right to refuse dating people in wheelchairs as well. It's not \"ableist\".\n\nYou can even refuse to date an ethnicity if you don't find them attractive enough. Heck you can refuse to date *everyone*. No one is entitled to be given a chance at a relationship.",
      "created_utc": 1667496950.0,
      "score": 3,
      "context": [
        {
          "id": "iuvkotn",
          "author": "CounselorGowron",
          "body": "This was very hard for me too, ableism is rampant and often they don’t even know that’s what they’re doing. 🫠 That’s where the problem is, not with you. \n\nHowever, I’m also now proof that it’s possible to have a loving partner who truly accepts me and my food limitations; we have wonderful meal experiences together, just often eating different foods at the same time.",
          "created_utc": 1667470878.0
        },
        {
          "id": "iuvm33y",
          "author": "Dunedune",
          "body": "It is not \"ableism\" to have food be an essential part of a relationship",
          "created_utc": 1667471956.0
        },
        {
          "id": "iuvs0ni",
          "author": "CounselorGowron",
          "body": "Ableism is the discrimination of and social prejudice against people with disabilities based on the belief that typical abilities are superior; sure you don’t have to date me, but if the reason is my inability to eat certain foods…",
          "created_utc": 1667475962.0
        },
        {
          "id": "iuvs7pa",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1667476081.0
        },
        {
          "id": "iuwnhjy",
          "author": "betelcake",
          "body": "I dont fully disagree, it is up to anyone to have their preferences. If eating together is important to someone, dating a person w ARFID isnt the best idea.\n\nHowever to blindly make statements such as \"I will never date a picky eater\" \"If they dont eat w me I dont want them\" etc are somewhat ableist in that they systemically and categorically exclude people who are suffering from a disability. We are not ABLE to eat like most people. Being excluded because of just that which we have no control over, is exactly the same as never letting the kid in the wheelchair play sports because the school cant be bothered to make accommodations.\n\nAt the end of the day, it's still ableist. I'm not saying theyre necessarily wrong for thinking that. Just that you cant deny that this is systemic exclusion of a disabled group, as a result of society's limited understanding of how relationships with food \"should\" be.\nWhich is the LITERAL definition of ableism, that another commenter has already put in different words.",
          "created_utc": 1667490232.0
        }
      ]
    },
    {
      "id": "iuvvm8r",
      "author": "Dunedune",
      "body": "Dude, I have ARFID too. You're just coping by trying to reject this as unfair discrimination. It's not. You're not attracted to people in wheelchairs as much as healthy people.",
      "created_utc": 1667478005.0,
      "score": 0,
      "context": [
        {
          "id": "iuvkotn",
          "author": "CounselorGowron",
          "body": "This was very hard for me too, ableism is rampant and often they don’t even know that’s what they’re doing. 🫠 That’s where the problem is, not with you. \n\nHowever, I’m also now proof that it’s possible to have a loving partner who truly accepts me and my food limitations; we have wonderful meal experiences together, just often eating different foods at the same time.",
          "created_utc": 1667470878.0
        },
        {
          "id": "iuvm33y",
          "author": "Dunedune",
          "body": "It is not \"ableism\" to have food be an essential part of a relationship",
          "created_utc": 1667471956.0
        },
        {
          "id": "iuvs0ni",
          "author": "CounselorGowron",
          "body": "Ableism is the discrimination of and social prejudice against people with disabilities based on the belief that typical abilities are superior; sure you don’t have to date me, but if the reason is my inability to eat certain foods…",
          "created_utc": 1667475962.0
        },
        {
          "id": "iuvs7pa",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1667476081.0
        },
        {
          "id": "iuvv6pb",
          "author": "Remarkable-Load4175",
          "body": "At least accept you're ableist, makes it easier for people to know to stay away from you",
          "created_utc": 1667477770.0
        }
      ]
    },
    {
      "id": "iuydg89",
      "author": "gillebro",
      "body": "…so, that’s assault.",
      "created_utc": 1667515749.0,
      "score": 15,
      "context": [
        {
          "id": "iuvm603",
          "author": "andthennini",
          "body": "I just don't really get why food plays such a significant role in relationships. Like, no I don't want you to cook my food so we both don't end up upset. Why's that a deal breaker?",
          "created_utc": 1667472015.0
        },
        {
          "id": "iuvooyk",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1667473823.0
        },
        {
          "id": "iuvv75h",
          "author": "Carina_Nebula89",
          "body": "I've read a lot of AITAs (for those who don't know it, the \"Am I the Asshole?\" subreddit) in which people got mad at a partner for declining food made by them or their parents (when inviting them to family gatherings) because they think it is rude to \"not even try\". I tried to explain to a lot of people over there already.. \"just trying\" doesn't come easy to anyone. Would it be more polite If I tried and threw up all over the floor?",
          "created_utc": 1667477776.0
        },
        {
          "id": "iuvwagm",
          "author": "None",
          "body": "One time I declined food at a cousin's house, and my brother was being dramatic and insisting I was being rude. I tried to explain that literally no one cared and it isn't/shouldn't be that big of a deal, and that it's not rude at all to decline food you didn't even ask for.",
          "created_utc": 1667478372.0
        },
        {
          "id": "iuvz9wg",
          "author": "Carina_Nebula89",
          "body": "I agree, it shouldn't be that big of a deal. No one should expect anyone to try something if they did not ask for it.Sadly for some people it is a big deal and they find it rude.  \nWe used to have easter at my aunts house every year when I grew up, and EVERY ..FREAKING ..YEAR she offered me fish (which I absolutely hate) and got upset that I am not even trying because it would be polite.  \nI was so glad when we stopped having easter there",
          "created_utc": 1667479907.0
        },
        {
          "id": "iuvzlmr",
          "author": "None",
          "body": "Once at a family gathering someone literally just shoved fish into my mouth. For some fucking reason I swallowed it and didn't get angry about it or make a scene, but just the idea of that in hindsight is infuriating.",
          "created_utc": 1667480066.0
        }
      ]
    },
    {
      "id": "iv35nha",
      "author": "stitchbitch420",
      "body": "I don’t think we’re understanding each other. I have ARFID too and deal with almost the same things as you, what im saying is in reference to OP’s question “why would someone be turned off by picky eating”. Not everyone accepts ARFID as a real disorder. Which is bullshit bc it absolutely is, as someone who’s had it for almost 13 years",
      "created_utc": 1667602000.0,
      "score": 2,
      "context": [
        {
          "id": "iuvqd9s",
          "author": "stitchbitch420",
          "body": "A lot of people that love food want to be with someone that also loves food because for them eating new things together is a bonding experience. Especially when it comes to traveling.",
          "created_utc": 1667474932.0
        },
        {
          "id": "iuvt0yw",
          "author": "CounselorGowron",
          "body": "I can still thoroughly support and share my partner’s excitement over new food experiences without having to eat the same thing.",
          "created_utc": 1667476557.0
        },
        {
          "id": "iuvtudg",
          "author": "stitchbitch420",
          "body": "I can too I’m just saying that’s why it might be a turn off for some people",
          "created_utc": 1667477023.0
        },
        {
          "id": "iuyyym5",
          "author": "CounselorGowron",
          "body": "I’m sad my husband is allergic to mango and cannot ever enjoy what seems delicious to me, but how that inability to share this specific food experience could ever become a turn off eludes me?",
          "created_utc": 1667524936.0
        },
        {
          "id": "iv2jz1m",
          "author": "stitchbitch420",
          "body": "It’s more like if your husband weren’t allergic but just didn’t like or refused to try mango. That’s what I think is a turn off for people.",
          "created_utc": 1667592691.0
        },
        {
          "id": "iv2mzic",
          "author": "CounselorGowron",
          "body": "A) Does it make sense to be turned off by his DISLIKING mango, as if he could do anything about that? Not in any way I can understand. \nB) Would it be a turn off for him to try the thing he doesn’t want, throw up, have a panic attack, and then be too afraid to eat anything for days? Because that’s what my brain does in this scenario, welcome to ARFID. Sounds way worse than just enjoying one’s own thing and moving the eff on rather than asserting their will on others.",
          "created_utc": 1667593895.0
        }
      ]
    },
    {
      "id": "iuwxdt7",
      "author": "betelcake",
      "body": "Its only a downside if you see it as such. My entire point is that not everyone thinks exactly how you do. I dont see handicaps as a downside, Idc if someones disabled. What matters if if we're compatible. \nAnd most folks with disabilities would probably gree with me. \nYou're being very close-minded man. And ableist, like your response is still ableist.",
      "created_utc": 1667494063.0,
      "score": 8,
      "context": [
        {
          "id": "iuvkotn",
          "author": "CounselorGowron",
          "body": "This was very hard for me too, ableism is rampant and often they don’t even know that’s what they’re doing. 🫠 That’s where the problem is, not with you. \n\nHowever, I’m also now proof that it’s possible to have a loving partner who truly accepts me and my food limitations; we have wonderful meal experiences together, just often eating different foods at the same time.",
          "created_utc": 1667470878.0
        },
        {
          "id": "iuvm33y",
          "author": "Dunedune",
          "body": "It is not \"ableism\" to have food be an essential part of a relationship",
          "created_utc": 1667471956.0
        },
        {
          "id": "iuvs0ni",
          "author": "CounselorGowron",
          "body": "Ableism is the discrimination of and social prejudice against people with disabilities based on the belief that typical abilities are superior; sure you don’t have to date me, but if the reason is my inability to eat certain foods…",
          "created_utc": 1667475962.0
        },
        {
          "id": "iuvs7pa",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1667476081.0
        },
        {
          "id": "iuwn104",
          "author": "betelcake",
          "body": "Your example about walking is EXTREMELY ableist, ARFID aside....",
          "created_utc": 1667490051.0
        },
        {
          "id": "iuwvovw",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1667493413.0
        }
      ]
    },
    {
      "id": "iwu3euj",
      "author": "ARFID-ModTeam",
      "body": "We do not tolerate trolls here. Your post or comment was removed for trolling.",
      "created_utc": 1668768044.0,
      "score": 1,
      "context": [
        {
          "id": "iuvkotn",
          "author": "CounselorGowron",
          "body": "This was very hard for me too, ableism is rampant and often they don’t even know that’s what they’re doing. 🫠 That’s where the problem is, not with you. \n\nHowever, I’m also now proof that it’s possible to have a loving partner who truly accepts me and my food limitations; we have wonderful meal experiences together, just often eating different foods at the same time.",
          "created_utc": 1667470878.0
        },
        {
          "id": "iuvm33y",
          "author": "Dunedune",
          "body": "It is not \"ableism\" to have food be an essential part of a relationship",
          "created_utc": 1667471956.0
        },
        {
          "id": "iuvs0ni",
          "author": "CounselorGowron",
          "body": "Ableism is the discrimination of and social prejudice against people with disabilities based on the belief that typical abilities are superior; sure you don’t have to date me, but if the reason is my inability to eat certain foods…",
          "created_utc": 1667475962.0
        },
        {
          "id": "iuvs7pa",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1667476081.0
        },
        {
          "id": "iuwn104",
          "author": "betelcake",
          "body": "Your example about walking is EXTREMELY ableist, ARFID aside....",
          "created_utc": 1667490051.0
        },
        {
          "id": "iuwvovw",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1667493413.0
        }
      ]
    },
    {
      "id": "iuwpmps",
      "author": "betelcake",
      "body": "I'm glad I could help. Nothing more frustrating than not finding the right words to make a point 😭",
      "created_utc": 1667491073.0,
      "score": 5,
      "context": [
        {
          "id": "iuvkotn",
          "author": "CounselorGowron",
          "body": "This was very hard for me too, ableism is rampant and often they don’t even know that’s what they’re doing. 🫠 That’s where the problem is, not with you. \n\nHowever, I’m also now proof that it’s possible to have a loving partner who truly accepts me and my food limitations; we have wonderful meal experiences together, just often eating different foods at the same time.",
          "created_utc": 1667470878.0
        },
        {
          "id": "iuvm33y",
          "author": "Dunedune",
          "body": "It is not \"ableism\" to have food be an essential part of a relationship",
          "created_utc": 1667471956.0
        },
        {
          "id": "iuvs0ni",
          "author": "CounselorGowron",
          "body": "Ableism is the discrimination of and social prejudice against people with disabilities based on the belief that typical abilities are superior; sure you don’t have to date me, but if the reason is my inability to eat certain foods…",
          "created_utc": 1667475962.0
        },
        {
          "id": "iuvs7pa",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1667476081.0
        },
        {
          "id": "iuwnhjy",
          "author": "betelcake",
          "body": "I dont fully disagree, it is up to anyone to have their preferences. If eating together is important to someone, dating a person w ARFID isnt the best idea.\n\nHowever to blindly make statements such as \"I will never date a picky eater\" \"If they dont eat w me I dont want them\" etc are somewhat ableist in that they systemically and categorically exclude people who are suffering from a disability. We are not ABLE to eat like most people. Being excluded because of just that which we have no control over, is exactly the same as never letting the kid in the wheelchair play sports because the school cant be bothered to make accommodations.\n\nAt the end of the day, it's still ableist. I'm not saying theyre necessarily wrong for thinking that. Just that you cant deny that this is systemic exclusion of a disabled group, as a result of society's limited understanding of how relationships with food \"should\" be.\nWhich is the LITERAL definition of ableism, that another commenter has already put in different words.",
          "created_utc": 1667490232.0
        },
        {
          "id": "iuwp3gm",
          "author": "Remarkable-Load4175",
          "body": "Thank you, you've said this much better than I could",
          "created_utc": 1667490862.0
        }
      ]
    },
    {
      "id": "iuwm7wa",
      "author": "Remarkable-Load4175",
      "body": "Why are you assuming that I'm ableist too? Whether someone is disabled or not is not something that factors into my attraction for them, at least not negatively, usually it's a positive because I can trust them not to pull ableist bullshit on me",
      "created_utc": 1667489735.0,
      "score": 12,
      "context": [
        {
          "id": "iuvkotn",
          "author": "CounselorGowron",
          "body": "This was very hard for me too, ableism is rampant and often they don’t even know that’s what they’re doing. 🫠 That’s where the problem is, not with you. \n\nHowever, I’m also now proof that it’s possible to have a loving partner who truly accepts me and my food limitations; we have wonderful meal experiences together, just often eating different foods at the same time.",
          "created_utc": 1667470878.0
        },
        {
          "id": "iuvm33y",
          "author": "Dunedune",
          "body": "It is not \"ableism\" to have food be an essential part of a relationship",
          "created_utc": 1667471956.0
        },
        {
          "id": "iuvs0ni",
          "author": "CounselorGowron",
          "body": "Ableism is the discrimination of and social prejudice against people with disabilities based on the belief that typical abilities are superior; sure you don’t have to date me, but if the reason is my inability to eat certain foods…",
          "created_utc": 1667475962.0
        },
        {
          "id": "iuvs7pa",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1667476081.0
        },
        {
          "id": "iuvv6pb",
          "author": "Remarkable-Load4175",
          "body": "At least accept you're ableist, makes it easier for people to know to stay away from you",
          "created_utc": 1667477770.0
        },
        {
          "id": "iuvvm8r",
          "author": "Dunedune",
          "body": "Dude, I have ARFID too. You're just coping by trying to reject this as unfair discrimination. It's not. You're not attracted to people in wheelchairs as much as healthy people.",
          "created_utc": 1667478005.0
        }
      ]
    },
    {
      "id": "iuvwq19",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1667478603.0,
      "score": -7,
      "context": [
        {
          "id": "iuvkotn",
          "author": "CounselorGowron",
          "body": "This was very hard for me too, ableism is rampant and often they don’t even know that’s what they’re doing. 🫠 That’s where the problem is, not with you. \n\nHowever, I’m also now proof that it’s possible to have a loving partner who truly accepts me and my food limitations; we have wonderful meal experiences together, just often eating different foods at the same time.",
          "created_utc": 1667470878.0
        },
        {
          "id": "iuvm33y",
          "author": "Dunedune",
          "body": "It is not \"ableism\" to have food be an essential part of a relationship",
          "created_utc": 1667471956.0
        },
        {
          "id": "iuvs0ni",
          "author": "CounselorGowron",
          "body": "Ableism is the discrimination of and social prejudice against people with disabilities based on the belief that typical abilities are superior; sure you don’t have to date me, but if the reason is my inability to eat certain foods…",
          "created_utc": 1667475962.0
        },
        {
          "id": "iuvs7pa",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1667476081.0
        },
        {
          "id": "iuvv6pb",
          "author": "Remarkable-Load4175",
          "body": "At least accept you're ableist, makes it easier for people to know to stay away from you",
          "created_utc": 1667477770.0
        },
        {
          "id": "iuvvm8r",
          "author": "Dunedune",
          "body": "Dude, I have ARFID too. You're just coping by trying to reject this as unfair discrimination. It's not. You're not attracted to people in wheelchairs as much as healthy people.",
          "created_utc": 1667478005.0
        }
      ]
    },
    {
      "id": "iv3czvq",
      "author": "CounselorGowron",
      "body": "Yeah I know you’re making the argument for others, but what I’m saying is the argument makes zero sense. You seem to agree so I don’t entirely understand your posts here. PS, thank you for being so polite.",
      "created_utc": 1667605337.0,
      "score": 2,
      "context": [
        {
          "id": "iuvqd9s",
          "author": "stitchbitch420",
          "body": "A lot of people that love food want to be with someone that also loves food because for them eating new things together is a bonding experience. Especially when it comes to traveling.",
          "created_utc": 1667474932.0
        },
        {
          "id": "iuvt0yw",
          "author": "CounselorGowron",
          "body": "I can still thoroughly support and share my partner’s excitement over new food experiences without having to eat the same thing.",
          "created_utc": 1667476557.0
        },
        {
          "id": "iuvtudg",
          "author": "stitchbitch420",
          "body": "I can too I’m just saying that’s why it might be a turn off for some people",
          "created_utc": 1667477023.0
        },
        {
          "id": "iuyyym5",
          "author": "CounselorGowron",
          "body": "I’m sad my husband is allergic to mango and cannot ever enjoy what seems delicious to me, but how that inability to share this specific food experience could ever become a turn off eludes me?",
          "created_utc": 1667524936.0
        },
        {
          "id": "iv2jz1m",
          "author": "stitchbitch420",
          "body": "It’s more like if your husband weren’t allergic but just didn’t like or refused to try mango. That’s what I think is a turn off for people.",
          "created_utc": 1667592691.0
        },
        {
          "id": "iv2mzic",
          "author": "CounselorGowron",
          "body": "A) Does it make sense to be turned off by his DISLIKING mango, as if he could do anything about that? Not in any way I can understand. \nB) Would it be a turn off for him to try the thing he doesn’t want, throw up, have a panic attack, and then be too afraid to eat anything for days? Because that’s what my brain does in this scenario, welcome to ARFID. Sounds way worse than just enjoying one’s own thing and moving the eff on rather than asserting their will on others.",
          "created_utc": 1667593895.0
        },
        {
          "id": "iv35nha",
          "author": "stitchbitch420",
          "body": "I don’t think we’re understanding each other. I have ARFID too and deal with almost the same things as you, what im saying is in reference to OP’s question “why would someone be turned off by picky eating”. Not everyone accepts ARFID as a real disorder. Which is bullshit bc it absolutely is, as someone who’s had it for almost 13 years",
          "created_utc": 1667602000.0
        }
      ]
    },
    {
      "id": "iux5hjv",
      "author": "Dunedune",
      "body": "Almost everyone will find not being able to walk as a huge downside in a relationship. No one is entitled to get a chance with everyone. Heck I'm sure there is someone somewhere that'll categorically find me unattractive because of some genetic looks. That's fine.",
      "created_utc": 1667497133.0,
      "score": -1,
      "context": [
        {
          "id": "iuvkotn",
          "author": "CounselorGowron",
          "body": "This was very hard for me too, ableism is rampant and often they don’t even know that’s what they’re doing. 🫠 That’s where the problem is, not with you. \n\nHowever, I’m also now proof that it’s possible to have a loving partner who truly accepts me and my food limitations; we have wonderful meal experiences together, just often eating different foods at the same time.",
          "created_utc": 1667470878.0
        },
        {
          "id": "iuvm33y",
          "author": "Dunedune",
          "body": "It is not \"ableism\" to have food be an essential part of a relationship",
          "created_utc": 1667471956.0
        },
        {
          "id": "iuvs0ni",
          "author": "CounselorGowron",
          "body": "Ableism is the discrimination of and social prejudice against people with disabilities based on the belief that typical abilities are superior; sure you don’t have to date me, but if the reason is my inability to eat certain foods…",
          "created_utc": 1667475962.0
        },
        {
          "id": "iuvs7pa",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1667476081.0
        },
        {
          "id": "iuwn104",
          "author": "betelcake",
          "body": "Your example about walking is EXTREMELY ableist, ARFID aside....",
          "created_utc": 1667490051.0
        },
        {
          "id": "iuwvovw",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1667493413.0
        },
        {
          "id": "iuwxdt7",
          "author": "betelcake",
          "body": "Its only a downside if you see it as such. My entire point is that not everyone thinks exactly how you do. I dont see handicaps as a downside, Idc if someones disabled. What matters if if we're compatible. \nAnd most folks with disabilities would probably gree with me. \nYou're being very close-minded man. And ableist, like your response is still ableist.",
          "created_utc": 1667494063.0
        }
      ]
    },
    {
      "id": "iuvxgtw",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1667478992.0,
      "score": 4,
      "context": [
        {
          "id": "iuvkotn",
          "author": "CounselorGowron",
          "body": "This was very hard for me too, ableism is rampant and often they don’t even know that’s what they’re doing. 🫠 That’s where the problem is, not with you. \n\nHowever, I’m also now proof that it’s possible to have a loving partner who truly accepts me and my food limitations; we have wonderful meal experiences together, just often eating different foods at the same time.",
          "created_utc": 1667470878.0
        },
        {
          "id": "iuvm33y",
          "author": "Dunedune",
          "body": "It is not \"ableism\" to have food be an essential part of a relationship",
          "created_utc": 1667471956.0
        },
        {
          "id": "iuvs0ni",
          "author": "CounselorGowron",
          "body": "Ableism is the discrimination of and social prejudice against people with disabilities based on the belief that typical abilities are superior; sure you don’t have to date me, but if the reason is my inability to eat certain foods…",
          "created_utc": 1667475962.0
        },
        {
          "id": "iuvs7pa",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1667476081.0
        },
        {
          "id": "iuvv6pb",
          "author": "Remarkable-Load4175",
          "body": "At least accept you're ableist, makes it easier for people to know to stay away from you",
          "created_utc": 1667477770.0
        },
        {
          "id": "iuvvm8r",
          "author": "Dunedune",
          "body": "Dude, I have ARFID too. You're just coping by trying to reject this as unfair discrimination. It's not. You're not attracted to people in wheelchairs as much as healthy people.",
          "created_utc": 1667478005.0
        },
        {
          "id": "iuvwq19",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1667478603.0
        }
      ]
    },
    {
      "id": "iwu3mi4",
      "author": "ARFID-ModTeam",
      "body": "Your post or comment was removed due to being rude to the ARFID community. ARFID is a diagnosable eating disorder, a diagnosis backed up by doctors and psychiatrists. Comments or responses that bully or harass sufferers of the condition are not acceptable.",
      "created_utc": 1668768222.0,
      "score": 1,
      "context": [
        {
          "id": "iuvkotn",
          "author": "CounselorGowron",
          "body": "This was very hard for me too, ableism is rampant and often they don’t even know that’s what they’re doing. 🫠 That’s where the problem is, not with you. \n\nHowever, I’m also now proof that it’s possible to have a loving partner who truly accepts me and my food limitations; we have wonderful meal experiences together, just often eating different foods at the same time.",
          "created_utc": 1667470878.0
        },
        {
          "id": "iuvm33y",
          "author": "Dunedune",
          "body": "It is not \"ableism\" to have food be an essential part of a relationship",
          "created_utc": 1667471956.0
        },
        {
          "id": "iuvs0ni",
          "author": "CounselorGowron",
          "body": "Ableism is the discrimination of and social prejudice against people with disabilities based on the belief that typical abilities are superior; sure you don’t have to date me, but if the reason is my inability to eat certain foods…",
          "created_utc": 1667475962.0
        },
        {
          "id": "iuvs7pa",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1667476081.0
        },
        {
          "id": "iuvv6pb",
          "author": "Remarkable-Load4175",
          "body": "At least accept you're ableist, makes it easier for people to know to stay away from you",
          "created_utc": 1667477770.0
        },
        {
          "id": "iuvvm8r",
          "author": "Dunedune",
          "body": "Dude, I have ARFID too. You're just coping by trying to reject this as unfair discrimination. It's not. You're not attracted to people in wheelchairs as much as healthy people.",
          "created_utc": 1667478005.0
        },
        {
          "id": "iuvwq19",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1667478603.0
        }
      ]
    },
    {
      "id": "iv3d9c1",
      "author": "stitchbitch420",
      "body": "Oh yeah I definitely don’t agree with that mindset I just know from experience that’s why someone would find picking eating a turn off. Definitely stupid though, eat your food and stop bugging me about mine",
      "created_utc": 1667605459.0,
      "score": 2,
      "context": [
        {
          "id": "iuvqd9s",
          "author": "stitchbitch420",
          "body": "A lot of people that love food want to be with someone that also loves food because for them eating new things together is a bonding experience. Especially when it comes to traveling.",
          "created_utc": 1667474932.0
        },
        {
          "id": "iuvt0yw",
          "author": "CounselorGowron",
          "body": "I can still thoroughly support and share my partner’s excitement over new food experiences without having to eat the same thing.",
          "created_utc": 1667476557.0
        },
        {
          "id": "iuvtudg",
          "author": "stitchbitch420",
          "body": "I can too I’m just saying that’s why it might be a turn off for some people",
          "created_utc": 1667477023.0
        },
        {
          "id": "iuyyym5",
          "author": "CounselorGowron",
          "body": "I’m sad my husband is allergic to mango and cannot ever enjoy what seems delicious to me, but how that inability to share this specific food experience could ever become a turn off eludes me?",
          "created_utc": 1667524936.0
        },
        {
          "id": "iv2jz1m",
          "author": "stitchbitch420",
          "body": "It’s more like if your husband weren’t allergic but just didn’t like or refused to try mango. That’s what I think is a turn off for people.",
          "created_utc": 1667592691.0
        },
        {
          "id": "iv2mzic",
          "author": "CounselorGowron",
          "body": "A) Does it make sense to be turned off by his DISLIKING mango, as if he could do anything about that? Not in any way I can understand. \nB) Would it be a turn off for him to try the thing he doesn’t want, throw up, have a panic attack, and then be too afraid to eat anything for days? Because that’s what my brain does in this scenario, welcome to ARFID. Sounds way worse than just enjoying one’s own thing and moving the eff on rather than asserting their will on others.",
          "created_utc": 1667593895.0
        },
        {
          "id": "iv35nha",
          "author": "stitchbitch420",
          "body": "I don’t think we’re understanding each other. I have ARFID too and deal with almost the same things as you, what im saying is in reference to OP’s question “why would someone be turned off by picky eating”. Not everyone accepts ARFID as a real disorder. Which is bullshit bc it absolutely is, as someone who’s had it for almost 13 years",
          "created_utc": 1667602000.0
        },
        {
          "id": "iv3czvq",
          "author": "CounselorGowron",
          "body": "Yeah I know you’re making the argument for others, but what I’m saying is the argument makes zero sense. You seem to agree so I don’t entirely understand your posts here. PS, thank you for being so polite.",
          "created_utc": 1667605337.0
        }
      ]
    },
    {
      "id": "iuwemot",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1667486696.0,
      "score": -6,
      "context": [
        {
          "id": "iuvkotn",
          "author": "CounselorGowron",
          "body": "This was very hard for me too, ableism is rampant and often they don’t even know that’s what they’re doing. 🫠 That’s where the problem is, not with you. \n\nHowever, I’m also now proof that it’s possible to have a loving partner who truly accepts me and my food limitations; we have wonderful meal experiences together, just often eating different foods at the same time.",
          "created_utc": 1667470878.0
        },
        {
          "id": "iuvm33y",
          "author": "Dunedune",
          "body": "It is not \"ableism\" to have food be an essential part of a relationship",
          "created_utc": 1667471956.0
        },
        {
          "id": "iuvs0ni",
          "author": "CounselorGowron",
          "body": "Ableism is the discrimination of and social prejudice against people with disabilities based on the belief that typical abilities are superior; sure you don’t have to date me, but if the reason is my inability to eat certain foods…",
          "created_utc": 1667475962.0
        },
        {
          "id": "iuvs7pa",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1667476081.0
        },
        {
          "id": "iuvv6pb",
          "author": "Remarkable-Load4175",
          "body": "At least accept you're ableist, makes it easier for people to know to stay away from you",
          "created_utc": 1667477770.0
        },
        {
          "id": "iuvvm8r",
          "author": "Dunedune",
          "body": "Dude, I have ARFID too. You're just coping by trying to reject this as unfair discrimination. It's not. You're not attracted to people in wheelchairs as much as healthy people.",
          "created_utc": 1667478005.0
        },
        {
          "id": "iuvwq19",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1667478603.0
        },
        {
          "id": "iuvxgtw",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1667478992.0
        }
      ]
    },
    {
      "id": "iwu3l8s",
      "author": "ARFID-ModTeam",
      "body": "Comments or responses that bully or harass sufferers of the condition are not acceptable.\n\nJust because you’re “cured” does NOT mean others can too. There are socioeconomic barriers among other barriers not everyone can navigate. Consider yourself lucky but that’s not the norm.",
      "created_utc": 1668768191.0,
      "score": 1,
      "context": [
        {
          "id": "iuvkotn",
          "author": "CounselorGowron",
          "body": "This was very hard for me too, ableism is rampant and often they don’t even know that’s what they’re doing. 🫠 That’s where the problem is, not with you. \n\nHowever, I’m also now proof that it’s possible to have a loving partner who truly accepts me and my food limitations; we have wonderful meal experiences together, just often eating different foods at the same time.",
          "created_utc": 1667470878.0
        },
        {
          "id": "iuvm33y",
          "author": "Dunedune",
          "body": "It is not \"ableism\" to have food be an essential part of a relationship",
          "created_utc": 1667471956.0
        },
        {
          "id": "iuvs0ni",
          "author": "CounselorGowron",
          "body": "Ableism is the discrimination of and social prejudice against people with disabilities based on the belief that typical abilities are superior; sure you don’t have to date me, but if the reason is my inability to eat certain foods…",
          "created_utc": 1667475962.0
        },
        {
          "id": "iuvs7pa",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1667476081.0
        },
        {
          "id": "iuvv6pb",
          "author": "Remarkable-Load4175",
          "body": "At least accept you're ableist, makes it easier for people to know to stay away from you",
          "created_utc": 1667477770.0
        },
        {
          "id": "iuvvm8r",
          "author": "Dunedune",
          "body": "Dude, I have ARFID too. You're just coping by trying to reject this as unfair discrimination. It's not. You're not attracted to people in wheelchairs as much as healthy people.",
          "created_utc": 1667478005.0
        },
        {
          "id": "iuvwq19",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1667478603.0
        },
        {
          "id": "iuvxgtw",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1667478992.0
        },
        {
          "id": "iuwemot",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1667486696.0
        }
      ]
    }
  ]
}