{
  "id": "yplc5b",
  "subreddit": "ARFID",
  "author": "purplebeef",
  "created_utc": 1667912030.0,
  "title": "Biting on something hard while eating soft foods is literally my nightmare.",
  "selftext": "The only exception to this is desserts: I'm perfectly fine with bits of solid fruit in yoghurt, or raisins in cakes etc etc. But in that case the hard part is expected so it doesn't take me by surprise.\n\n\nWhat I can't stand is eating meat and accidentally biting on cartilage, or eating lasagna and biting on tomato seeds, and so on. When it happens I literally start gagging and need to excuse myself to the bathroom because the urge to throw up is big. Feeling the crunch under my teeth puts me into panic, it's so gross and nobody gets it!!",
  "url": "https://www.reddit.com/r/ARFID/comments/yplc5b/biting_on_something_hard_while_eating_soft_foods/",
  "score": 120,
  "num_comments": 19,
  "comments": [
    {
      "id": "ivkixgw",
      "author": "Beauty_Hunter22",
      "body": "i always cut chicken up as small as possible or preferably eat it shredded for this exact reason 💀 genuinely my nightmare and when it happens i have trouble eating anything for days afterward.",
      "created_utc": 1667927818.0,
      "score": 28,
      "context": []
    },
    {
      "id": "ivlm5vn",
      "author": "None",
      "body": "Yes!! If a food is meant to be soft it'd better be soft throughout!!",
      "created_utc": 1667942746.0,
      "score": 16,
      "context": []
    },
    {
      "id": "ivm0gpl",
      "author": "larrieuxa",
      "body": "I feel nauseated just reading the title.",
      "created_utc": 1667948540.0,
      "score": 13,
      "context": []
    },
    {
      "id": "ivmufdt",
      "author": "lesleymoon",
      "body": "This is one of my big issues!! Its why I don't like onions in...anything, its always such a weird, off putting texture when you get that hard, crunchy piece of onion. Nope nope nope.",
      "created_utc": 1667961811.0,
      "score": 14,
      "context": []
    },
    {
      "id": "ivlqfdv",
      "author": "SachiKaM",
      "body": "I could never eat meat with a bone for this reason 🤢 and I lost trust in chicken over a decade ago when I got duped. What’s even worse is boneless.. but it has one in there. I said to hell with it and went vegan 😅",
      "created_utc": 1667944407.0,
      "score": 10,
      "context": []
    },
    {
      "id": "ivmfcdo",
      "author": "TracyAnne90",
      "body": "Same here!!! I cannot handle the feeling on my teeth. I'm shuddering just thinking about it...",
      "created_utc": 1667954972.0,
      "score": 7,
      "context": []
    },
    {
      "id": "ivn1fnk",
      "author": "Phlebbie",
      "body": "I have this exact texture issue too. Can't even handle fibrous veggies in meat/carb dishes because the fibers are enough of a crunch. All my pasta sauces get blended, and pasta never contains veggies. When we get a rotisserie chicken I only eat the chicken breast and my partner eats the rest of it. With the breasts, I remove every bit of cartilage/weird texture, and they're cut up. Even meat fat like in a steak will make me spit out the bite, so I always trim the hell out of all meat I consume.\n\nTotally get what you mean about desserts though, can totally do cake/pie/ice cream with raspberry/strawberry sauce (with seeds) and crunchy nuts or fresh fruit or whatever.",
      "created_utc": 1667965217.0,
      "score": 7,
      "context": []
    },
    {
      "id": "ivmozwi",
      "author": "Princeax",
      "body": "It’s so bad! I always get really nervous because I don’t know what it is that is so hard and I makes me panic a little thinking I bit on something like a tooth or such. It doesn’t help that the texture of the little hard bits in food are so gross too. Reminds me of fat on meat that no matter how hard you chew, it’s always slimy and almost indestructible.",
      "created_utc": 1667959348.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ivn6qql",
      "author": "crazykindoflife",
      "body": "Oh my god. I feel so seen right now. I HATE meat and cartilage. Any time I get anything hard I freak tf out. I also have veneers so I’m Even MORE scared of anything hard ontop of my ARFID issues.",
      "created_utc": 1667967948.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ivo2h9w",
      "author": "NoIron9582",
      "body": "An eggshell in my eggs will make me vomit , immediately. I fucking hate sand . The one and only time my kid did something I couldn't deal with, was when he tried eating sand. I held myself together long enough to hand him to his dad, and had to walk away .",
      "created_utc": 1667991376.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ivob98v",
      "author": "Hot_Highway3716",
      "body": "This is my number one trigger!! Biting down on a piece of gristle while eating meat is like hitting the eject button on my mouth LOL everything is leaving immediately.\n\nI'm the same way with the texture of onions (haaaaaate the sound they make in my head when I bite down) and I melt down when they're incorporated into food with otherwise consistent texture (rice, ground beef, etc) and I can't eat around them, totally ruins my safe foods lol",
      "created_utc": 1667997351.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ivnpvaf",
      "author": "calamitylamb",
      "body": "Ugh yep, all meats are the top unsafe foods for me, I absolutely cannot stand the texture at all",
      "created_utc": 1667980570.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ivnsoxl",
      "author": "Funkiebastard",
      "body": "Made cookies once, bit into something hard, thought maybe I hadn't mixed the sugar well enough so kept at it but it was still hard so I decided to inspect\n\nTurns out it was a tiny bit of porcelain, one of my bowls broke a tiny bit and I didn't realize. Threw away the bowl and cookies\n\nWas sad cause they turned out pretty good",
      "created_utc": 1667982901.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ivnxc4f",
      "author": "aytlolcan",
      "body": "This is why I don’t eat to the bone when the chicken isn’t boneless",
      "created_utc": 1667986990.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ivlk1ul",
      "author": "Blahblahblah89890",
      "body": "I do the exact same thing lol any meat gets cut into the smallest possible pieces",
      "created_utc": 1667941944.0,
      "score": 8,
      "context": [
        {
          "id": "ivkixgw",
          "author": "Beauty_Hunter22",
          "body": "i always cut chicken up as small as possible or preferably eat it shredded for this exact reason 💀 genuinely my nightmare and when it happens i have trouble eating anything for days afterward.",
          "created_utc": 1667927818.0
        }
      ]
    },
    {
      "id": "ivnkvar",
      "author": "purplebeef",
      "body": "Oh god yes I hate onion too! It's the reason I bought powdered onion so I can still enjoy its taste without dealing with the texture",
      "created_utc": 1667976733.0,
      "score": 7,
      "context": [
        {
          "id": "ivmufdt",
          "author": "lesleymoon",
          "body": "This is one of my big issues!! Its why I don't like onions in...anything, its always such a weird, off putting texture when you get that hard, crunchy piece of onion. Nope nope nope.",
          "created_utc": 1667961811.0
        }
      ]
    },
    {
      "id": "ivna2j5",
      "author": "elfinglamour",
      "body": "I hate onions for the same reason! Even worse when the onion is kind of slimy on the outside 🤢",
      "created_utc": 1667969787.0,
      "score": 4,
      "context": [
        {
          "id": "ivmufdt",
          "author": "lesleymoon",
          "body": "This is one of my big issues!! Its why I don't like onions in...anything, its always such a weird, off putting texture when you get that hard, crunchy piece of onion. Nope nope nope.",
          "created_utc": 1667961811.0
        }
      ]
    },
    {
      "id": "ivn4u8r",
      "author": "None",
      "body": "I became a vegetarian at five because I bit into a Burger King nugget and hit something that was the wrong texture and boom! Nearly lifelong vegetarian lol 🙃",
      "created_utc": 1667966939.0,
      "score": 6,
      "context": [
        {
          "id": "ivlqfdv",
          "author": "SachiKaM",
          "body": "I could never eat meat with a bone for this reason 🤢 and I lost trust in chicken over a decade ago when I got duped. What’s even worse is boneless.. but it has one in there. I said to hell with it and went vegan 😅",
          "created_utc": 1667944407.0
        }
      ]
    },
    {
      "id": "ivn99t4",
      "author": "SachiKaM",
      "body": "🤣 the moment I realized why it was so mentally easy to stop eating meat I was floored. There was zero transition nor looking back. Ick, yup that’s the end of THAT 😭 I tell my therapist routinely I’m good cause if I ever went to jail I’d be dead in a week cause I’m not eating that food. It’s not a game hahahaa. “That’s fine I’ll just starve instead, night!”",
      "created_utc": 1667969339.0,
      "score": 5,
      "context": [
        {
          "id": "ivlqfdv",
          "author": "SachiKaM",
          "body": "I could never eat meat with a bone for this reason 🤢 and I lost trust in chicken over a decade ago when I got duped. What’s even worse is boneless.. but it has one in there. I said to hell with it and went vegan 😅",
          "created_utc": 1667944407.0
        },
        {
          "id": "ivn4u8r",
          "author": "None",
          "body": "I became a vegetarian at five because I bit into a Burger King nugget and hit something that was the wrong texture and boom! Nearly lifelong vegetarian lol 🙃",
          "created_utc": 1667966939.0
        }
      ]
    }
  ]
}