{
  "id": "yxx471",
  "subreddit": "ARFID",
  "author": "musictheron",
  "created_utc": 1668708607.0,
  "title": "I survived eating at a job interview!!",
  "selftext": "Lurker here (28, she/they). I started therapy almost 5 years ago with the goal of being able to \"pass\" as a regular vegetarian at academic job interviews. \n\nAnd I finally did it! I tried a Thai tofu dish including a mystery sauce, a very complex mediterranean pizza with tahini, and a pasta dish with some vegetables I couldn't eat. I let myself request one substitution or omission for each thing, breathed deeply, drank a lot of water, and focused on the conversation and I GOT THROUGH IT! I didn't finish any of the meals but was able to eat enough not to starve or draw too much attention. The committee was understanding and it was a non-issue.\n\nthis is a HUGE success that I thought I'd never be able to do. My life and anxiety have improved so much in five years!! I just wanted to share with people who get it. Regardless of whether I get this job, I feel like I've already succeeded. :)",
  "url": "https://www.reddit.com/r/ARFID/comments/yxx471/i_survived_eating_at_a_job_interview/",
  "score": 97,
  "num_comments": 11,
  "comments": [
    {
      "id": "iwre0vd",
      "author": "braedizzle",
      "body": "This is huge. This all sounds way too intimidating to me. Congrats on the big win!",
      "created_utc": 1668714890.0,
      "score": 11,
      "context": []
    },
    {
      "id": "iwt02vd",
      "author": "ReverendMothman",
      "body": "That is super amazing!  This kind of story really gives me hope!  \nNow I gotta ask... what kinds of job interviews give out free food? :o",
      "created_utc": 1668740457.0,
      "score": 8,
      "context": []
    },
    {
      "id": "iwsgydz",
      "author": "twice_twotimes",
      "body": "Congratulations! I’m on the job market right now and this is a huge fear of mine. As badly as I want to get invited for interviews, I’m (almost) relieved I haven’t had any luck yet. I have a hard enough time navigating food when job candidates interview in my department and I need to have one single group lunch with them. How the hell am I supposed to get through a faculty filled weekend of meals?\n\nHuge huge win for you no matter what, but fingers crossed you get an offer!",
      "created_utc": 1668731355.0,
      "score": 5,
      "context": []
    },
    {
      "id": "iwrf0h6",
      "author": "maidensuit",
      "body": "Congratulations!! That's huge!",
      "created_utc": 1668715278.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iwrk292",
      "author": "None",
      "body": "Congratulations! Holy cow that is huge! So happy for you!",
      "created_utc": 1668717283.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iwsgt5w",
      "author": "Fingerinthedykes",
      "body": "WOW! Great job! What kinds of things in therapy did you find most helpful?",
      "created_utc": 1668731289.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iwsmeet",
      "author": "CatLover_801",
      "body": "I’m so jealous ,good for you!",
      "created_utc": 1668733938.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iwtll61",
      "author": "Crazy_Cat_Lady360",
      "body": "Wow that’s amazing. Congratulations!",
      "created_utc": 1668752914.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iwtv8nu",
      "author": "Chagdoo",
      "body": "That's insane, congratulations!",
      "created_utc": 1668760805.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iwvxbmi",
      "author": "None",
      "body": "Hell yeah!! Congrats!",
      "created_utc": 1668799552.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ix88mai",
      "author": "musictheron",
      "body": "We practiced some exposure and mindfulness techniques but honestly addressing a lot of my underlying anxieties made a bigger difference in the long run! I know that's not everyone's deal but it's mine :)",
      "created_utc": 1669041605.0,
      "score": 1,
      "context": [
        {
          "id": "iwsgt5w",
          "author": "Fingerinthedykes",
          "body": "WOW! Great job! What kinds of things in therapy did you find most helpful?",
          "created_utc": 1668731289.0
        }
      ]
    }
  ]
}