{
  "id": "z2wjef",
  "subreddit": "ARFID",
  "author": "arewedeadyett",
  "created_utc": 1669227949.0,
  "title": "Thanksgiving is the Worst Holiday",
  "selftext": "This might be an unpopular take but I absolutely despise thanksgiving. The only item on the table I can eat is bread and pie. Each year I’m left with an empty plate while my relatives feast. There’s no point in me being there as we don’t even give thanks at the table. I hate it. All it does is ostracize me and make me anxious. Does anyone else absolutely dread thanksgiving?",
  "url": "https://www.reddit.com/r/ARFID/comments/z2wjef/thanksgiving_is_the_worst_holiday/",
  "score": 221,
  "num_comments": 62,
  "comments": [
    {
      "id": "ixisihz",
      "author": "KenMixtape",
      "body": "I think everyone with ARFID hates Thanksgiving, I know I do.  Many of us call it \"Black Thursday\"",
      "created_utc": 1669231494.0,
      "score": 90,
      "context": []
    },
    {
      "id": "ixivtxm",
      "author": "WeekendWaffles",
      "body": "I came across this article other day and it feels very familiar.\n\nhttps://www.huffpost.com/entry/thanksgiving-eating-disorder-arfid_n_637a8416e4b0c5739621c4dc",
      "created_utc": 1669232806.0,
      "score": 48,
      "context": []
    },
    {
      "id": "ixix1ct",
      "author": "q2a2",
      "body": "I quit doing family thanksgivings. Thanksgiving is mine and Christmas is for the family. And for MY thanksgiving, I do rolls and mashed potatoes and boxed stuffing and it’s delicious. Eating with a whole family fucking sucks, not to mention when it’s such a different offering than what we normally eat day to day. Fucking sucks to be the person not eating and starving on a food focused holiday while everyone else is stuffed. I wish you luck and love.",
      "created_utc": 1669233278.0,
      "score": 29,
      "context": []
    },
    {
      "id": "ixj4b9a",
      "author": "shorty_12",
      "body": "ugh my aunt just said “i better see you eating turkey tomorrow!!” no",
      "created_utc": 1669236175.0,
      "score": 27,
      "context": []
    },
    {
      "id": "ixj4xuz",
      "author": "Blue-j7",
      "body": "Big hugs. My 15 year old son has ARFID and has always HATED Thanksgiving. He won't eat anything there and then faces all the questions. Why aren't you eating? You don't even want mashed potatoes? Etc etc...\nWe stopped going anywhere for Thanskgiving and just have a small feast at home with just the household members. He still doesn't eat, but at least he isn't excluded and shamed.",
      "created_utc": 1669236427.0,
      "score": 24,
      "context": []
    },
    {
      "id": "ixjiguk",
      "author": "Hoe-for-Minamino",
      "body": "I especially hate the insistence to “just try a bite!” Like no, I’ve tried a million different mashed potatoes, why do you really think yours are that different?",
      "created_utc": 1669242050.0,
      "score": 22,
      "context": []
    },
    {
      "id": "ixjre25",
      "author": "littleferrhis",
      "body": "I’m spending thanksgiving with my girlfriend this year. Her brother has autism and won’t eat anything but certain chicken tenders and certain pizza(I can eat a little bit more than that, but that’s usually what I’ll eat too). We’re going to be making homemade pizza. I got real lucky this year. I am in heaven.",
      "created_utc": 1669246039.0,
      "score": 18,
      "context": []
    },
    {
      "id": "ixj0br3",
      "author": "Throwaway-burnoutq",
      "body": "Same. I get so many questions about why I’m eating either nothing or a meal I made myself earlier that’s entirely different. Just let me eat my plain toast in peace :(",
      "created_utc": 1669234586.0,
      "score": 12,
      "context": []
    },
    {
      "id": "ixjmv1f",
      "author": "Crazy_Cat_Lady360",
      "body": "I’m sorry you all have to endure that. \n\nAre you able to take a safe food? In my country it’s very acceptable to offer to bring a plate of food. I would just take something you will eat. Nobody should be forced to sit at a table of food they can’t eat. I stopped forcing my ARFID child years ago. We just don’t do these family dinners.",
      "created_utc": 1669243984.0,
      "score": 11,
      "context": []
    },
    {
      "id": "ixkqdxd",
      "author": "majesticsn0wflake",
      "body": "i’ve cried on every thanksgiving as far back as i can remember. everyone wants to comment on how little i’m eating. everyone insists that *their* mashed potatoes will convince me that i like mashed potatoes. it’s such an awful holiday, i feel bad enough when normal stuff becomes food-centric but now we have to have a whole day? a whole get together that’s exclusively about food? and it’s not even for a good reason! “let’s celebrate the genocide of native americans with turkey!” no i’d actually rather not thanks tho",
      "created_utc": 1669263360.0,
      "score": 8,
      "context": []
    },
    {
      "id": "ixj9dro",
      "author": "None",
      "body": "No, I feel the exact opposite, but then again I only eat thanksgiving at home and it's my menu I've curated since I was a kid with my mom's help.  My kids (also ARFID) are excited to have contributions to the menu this year.",
      "created_utc": 1669238220.0,
      "score": 7,
      "context": []
    },
    {
      "id": "ixk78aj",
      "author": "alrighteyaphrodite",
      "body": "Mood. Every time someone mentions Thanksgiving I cringe. I'm so anxious. Humans need to be less judgmental. I have very little Thanksgiving memories because all I think about is being nervous about the food and inevitably being made fun of. (it always happens.)",
      "created_utc": 1669253554.0,
      "score": 8,
      "context": []
    },
    {
      "id": "ixjgj95",
      "author": "crash----",
      "body": "Family dinners are so hard",
      "created_utc": 1669241206.0,
      "score": 7,
      "context": []
    },
    {
      "id": "ixk0taf",
      "author": "giraffemoo",
      "body": "I used to, but I enjoy it now. My secret was ditching my toxic family of origin and making a new family that doesn't make fun of me if I only feel like eating bread on Thanksgiving.",
      "created_utc": 1669250442.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ixk8w98",
      "author": "hswish87",
      "body": "My six year old has ARFID.  He also dislikes Thanksgiving.  The past couple of years I have tried to make it a holiday about family games and activities instead of just food so he can have a reason to like it too.",
      "created_utc": 1669254365.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ixkw9v6",
      "author": "CrossdressTimelady",
      "body": "There was one year I visited a friend in Toronto on Thanksgiving because up there it was just a normal Thursday, not a big holiday with a lot of expectations.  That's how much I care about celebrating it LOL.  \n\n\nFor me Halloween is my time to shine because it's all about costumes, and I've literally worked on NY Fashion Week before.  LOVE Halloween.  I wish every holiday was about costumes, revelry, and the Goth aesthetic.  Wish Thanksgiving was just second Halloween instead hahaha.",
      "created_utc": 1669266828.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ixjcljj",
      "author": "CatLover_801",
      "body": "I’m glad thanksgiving was done over a month ago for me",
      "created_utc": 1669239538.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ixjlq9b",
      "author": "Even_Lychee4954",
      "body": "This was my childhood. Plate: slices of turkey and bread rolls. Sometimes turkey gravy if they make it plain and smooth. Sometimes mashed potatoes if it’s very well whipped. Everything else: big NOPE.",
      "created_utc": 1669243484.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ixjoxwq",
      "author": "ellensaige",
      "body": "something that's really empowered me since developing arfid is being super involved in the Thanksgiving prep. I'm making most of the food and it's all going to be stuff I can eat. everyone else is bringing something but I'll probably stick to what I know is made exactly to my liking.",
      "created_utc": 1669244924.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ixjrykq",
      "author": "SlackerAtWork",
      "body": "I hate Thanksgiving when we aren't spending it with me family. My family incredibly supportive and they never pressure me to eat things they know I don't like. My safe foods are always on the menu every year, without question. \n\nHowever, some years we eat with my husband's family. They know I have a 'weird diet', but only see it as I'm picky. His dad tries to get me to eat new foods, not sure if he's teasing me or genuinely trying, because sometimes he's really pushy and sometimes he's not, but he always has mac and cheese at his house for me. So, he's at least supportive in that way. \n\nBut the teasing does bother me, especially when he does it in front of other people. My husband's brother and sister have said something once or twice, but I feel the most pressure from his dad. \n\nI married into a foodie family, so that was my first mistake.",
      "created_utc": 1669246301.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ixjwyn8",
      "author": "APleasantMartini",
      "body": "I **HATE** Thanksgiving.\n\nSocially, food wise, all of that.\n\nI think the one Thanksgiving I liked we went out to a fancy restaurant that was nice enough to accomodate my safe food needs and that was it.",
      "created_utc": 1669248627.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ixjfsqk",
      "author": "MMTardis",
      "body": "Luckily in the Midwest there is always a  tray of cheese and crackers, as an appetizer. Between that and bread rolls,  you can make an ok meal.",
      "created_utc": 1669240885.0,
      "score": 6,
      "context": []
    },
    {
      "id": "ixkh892",
      "author": "meatypizza",
      "body": "this is the reason i host thanksgiving, if you want something specific at my house you bring it but i make what i will eat and like, its my money and time lol",
      "created_utc": 1669258437.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ixkiv5h",
      "author": "Chihuahua_enthusiast",
      "body": "Last year they added ranch to the mashed potatoes. Now I can only eat bread…",
      "created_utc": 1669259283.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ixkwyk6",
      "author": "LowSandwich8973",
      "body": "I DREAD thanksgiving every year because my plate consists of corn and chicken nuggets. No turkey or mashed potato’s or even bread. And every year everyone always has the need to make comments and shame me.",
      "created_utc": 1669267245.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ixm012i",
      "author": "Opposite-Birthday69",
      "body": "After being made fun of by my family my dad’s youngest brother would come eat with me away from everyone else because he was also made fun of because he struggled with addiction. The only thing I’d eat was cranberry sauce and Hawaiian rolls. My dads side is Italian so they tried to force me to have pasta but I still strongly dislike noodles. My aunt joked that my dad should get a paternity test. Also I learned when I was older my dad would only eat garlic bread and drink milt til he was 12. So while everyone else at in the dinning room me and my uncle ate in the living room because he didn’t also want to be made fun of. \n\nI can eat my foods now, but I miss my uncle. He lost his battle with addiction about almost 10 years ago.",
      "created_utc": 1669296780.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ixmi0i7",
      "author": "swoocha",
      "body": "I feel like that anytime we have a group meal. I generally bring my own snacks so I know I'll have something. Add celiac to my food restrictions, and it's insane.",
      "created_utc": 1669305513.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ixjqwqk",
      "author": "qazwsxedc000999",
      "body": "Luckily for me, I’ve been eating mashed potatoes and gravy since I was little. No one bats an eye at me filling my plate with that and only that because I’ve done it for so long\n\nThankfully it doesn’t cause me much stress, but I sympathize regardless.",
      "created_utc": 1669245822.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ixkqfs6",
      "author": "manasseater3000",
      "body": "every year i get forced into trying something new and it’s made me dread the entire holiday week",
      "created_utc": 1669263387.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ixl0ory",
      "author": "PhoenixEnginerd",
      "body": "Same. I despise it! It’s so awful and humiliating",
      "created_utc": 1669269621.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ixltkxg",
      "author": "manicmice",
      "body": "Fuckin turkey man",
      "created_utc": 1669292713.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ixlx54n",
      "author": "jessiedollxoxo",
      "body": "When I was younger I hated thanksgiving. Everyone always said they’d be so full and all that, and here I was only eating turkey, potatoes, and rolls. “Eat the stuffing it’s just bread!”, was something I was constantly told. Like no you assholes it’s everything else in the stuffing 😑 \nId be constantly hungry on thanksgiving, and couldn’t wait for the day to be over. I was a ketchup kid so my turkey got a healthy slathering of the red stuff. \n\nNow a little bit older I still eat the turkey, potatoes, and rolls, But have now come to enjoy sweet potatoes (partner makes them and changes the recipe around so there’s no yucky walnuts or weird pineapples in them, bless), and making sandwiches on my plate of the few things I enjoy. \n\nIt’s a bullshit holiday, and that whole giving thanks on that day, trust me you’re not missing out. Most families fill it out with the superficial and vapid shit. \n\nBut I can tell you it does get better. You’ll eventually find people to sit down to eat with who if they ask you a question about your plate, they won’t judge the answer you give. Most families are ~terrible~ because they’ve got all these weird pushy beliefs on food, but I find that among friends or in laws is when I’m not interrogated on my it. \n\nGood luck today <3",
      "created_utc": 1669295046.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ixm35le",
      "author": "Big-Bad-Jax",
      "body": "i hate it too, but personally, a good plain turkey is one of my favorite foods so that’s good\n\nbut since there’s soooo much food i just hate the attention i get when i only have turkey on my plate, like EVERYONE just wants me to try their stuff, like no",
      "created_utc": 1669298483.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ixmajud",
      "author": "bfaithr",
      "body": "This year my family is ordering from a restaurant. Every safe food on the “thanksgiving meal” plate was covered in gravy or pecans or some other fear food. The only thing left was bread and pumpkin pie. The restaurant had a “sides as a meal” option ON THE THANKSGIVING MENU and I had to beg my dad to order that one for me instead",
      "created_utc": 1669302177.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ixmrpla",
      "author": "None",
      "body": "yep. always been the worst holiday for me. all the questions, weird looks, feeling really isolated. luckily it’s calmed down with my family and they usually don’t say anything anymore but i still feel awkward. i’m glad other people experience this because nobody ever understands why i hate thanksgiving lol. it’s always been a big fear of mine to have to attend any kind of big dinner in case it’s not a safe food and it feels a lot better knowing other people experience this",
      "created_utc": 1669309676.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ixochi4",
      "author": "LookOk8134",
      "body": "I can't eat anything either and I'm currently hangry and ready too curbstomp someone.",
      "created_utc": 1669335971.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iyj42ig",
      "author": "NoOutlandishness5969",
      "body": "I ate a piece of a turkey leg, and a piece of a piece of cake. Everyone else had puke-like mush on their plates. Blegh.",
      "created_utc": 1669924483.0,
      "score": 1,
      "context": []
    },
    {
      "id": "izs3u43",
      "author": "Chemical-Ad2770",
      "body": "Same. Except I eat only the bread and bring pizza with me, which is even more awkward",
      "created_utc": 1670763780.0,
      "score": 1,
      "context": []
    },
    {
      "id": "j1ozrrr",
      "author": "AccounrOfMonteCristo",
      "body": "I was literally about to brag about me giving you the 200th upvote, and then some dickstain down voted it back to 199. Whoever did that you're a ballsack.",
      "created_utc": 1672033111.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ixj0d39",
      "author": "arewedeadyett",
      "body": "Black Thursday lol, I like that",
      "created_utc": 1669234602.0,
      "score": 16,
      "context": [
        {
          "id": "ixisihz",
          "author": "KenMixtape",
          "body": "I think everyone with ARFID hates Thanksgiving, I know I do.  Many of us call it \"Black Thursday\"",
          "created_utc": 1669231494.0
        }
      ]
    },
    {
      "id": "ixkqf8b",
      "author": "ReverendMothman",
      "body": "I don't hate it but my family always has at least s few bland things for me, and I do eat turkey.!",
      "created_utc": 1669263378.0,
      "score": 5,
      "context": [
        {
          "id": "ixisihz",
          "author": "KenMixtape",
          "body": "I think everyone with ARFID hates Thanksgiving, I know I do.  Many of us call it \"Black Thursday\"",
          "created_utc": 1669231494.0
        }
      ]
    },
    {
      "id": "ixjl7oj",
      "author": "mandelaXeffective",
      "body": "I actually don't! At least not food wise.",
      "created_utc": 1669243258.0,
      "score": 3,
      "context": [
        {
          "id": "ixisihz",
          "author": "KenMixtape",
          "body": "I think everyone with ARFID hates Thanksgiving, I know I do.  Many of us call it \"Black Thursday\"",
          "created_utc": 1669231494.0
        }
      ]
    },
    {
      "id": "ixj4c93",
      "author": "Throwaway-burnoutq",
      "body": "The comments on the article are pretty disgusting.",
      "created_utc": 1669236186.0,
      "score": 29,
      "context": [
        {
          "id": "ixivtxm",
          "author": "WeekendWaffles",
          "body": "I came across this article other day and it feels very familiar.\n\nhttps://www.huffpost.com/entry/thanksgiving-eating-disorder-arfid_n_637a8416e4b0c5739621c4dc",
          "created_utc": 1669232806.0
        }
      ]
    },
    {
      "id": "ixj0bye",
      "author": "arewedeadyett",
      "body": "Wow that really hit home",
      "created_utc": 1669234589.0,
      "score": 14,
      "context": [
        {
          "id": "ixivtxm",
          "author": "WeekendWaffles",
          "body": "I came across this article other day and it feels very familiar.\n\nhttps://www.huffpost.com/entry/thanksgiving-eating-disorder-arfid_n_637a8416e4b0c5739621c4dc",
          "created_utc": 1669232806.0
        }
      ]
    },
    {
      "id": "ixjn4r6",
      "author": "Even_Lychee4954",
      "body": "I wish there was a boxed stuffing without onions. Please. I’m begging. 😭",
      "created_utc": 1669244103.0,
      "score": 3,
      "context": [
        {
          "id": "ixix1ct",
          "author": "q2a2",
          "body": "I quit doing family thanksgivings. Thanksgiving is mine and Christmas is for the family. And for MY thanksgiving, I do rolls and mashed potatoes and boxed stuffing and it’s delicious. Eating with a whole family fucking sucks, not to mention when it’s such a different offering than what we normally eat day to day. Fucking sucks to be the person not eating and starving on a food focused holiday while everyone else is stuffed. I wish you luck and love.",
          "created_utc": 1669233278.0
        }
      ]
    },
    {
      "id": "lsv49ja",
      "author": "0000425671",
      "body": "What is your favorite thanksgiving vegetable?",
      "created_utc": 1729442381.0,
      "score": 1,
      "context": [
        {
          "id": "ixix1ct",
          "author": "q2a2",
          "body": "I quit doing family thanksgivings. Thanksgiving is mine and Christmas is for the family. And for MY thanksgiving, I do rolls and mashed potatoes and boxed stuffing and it’s delicious. Eating with a whole family fucking sucks, not to mention when it’s such a different offering than what we normally eat day to day. Fucking sucks to be the person not eating and starving on a food focused holiday while everyone else is stuffed. I wish you luck and love.",
          "created_utc": 1669233278.0
        }
      ]
    },
    {
      "id": "ixje7rx",
      "author": "nueve",
      "body": "I'm sorry 😞",
      "created_utc": 1669240214.0,
      "score": 11,
      "context": [
        {
          "id": "ixj4b9a",
          "author": "shorty_12",
          "body": "ugh my aunt just said “i better see you eating turkey tomorrow!!” no",
          "created_utc": 1669236175.0
        }
      ]
    },
    {
      "id": "ixmgxc6",
      "author": "collegethrowaway2938",
      "body": "That just gave me a fight or flight response I’ve heard that shit so much gahhhh",
      "created_utc": 1669305041.0,
      "score": 4,
      "context": [
        {
          "id": "ixj4b9a",
          "author": "shorty_12",
          "body": "ugh my aunt just said “i better see you eating turkey tomorrow!!” no",
          "created_utc": 1669236175.0
        }
      ]
    },
    {
      "id": "ixjl0bs",
      "author": "arewedeadyett",
      "body": "Right! Also do you really want me to try a bite if I’m just going to gag it up and offend you??",
      "created_utc": 1669243169.0,
      "score": 9,
      "context": [
        {
          "id": "ixjiguk",
          "author": "Hoe-for-Minamino",
          "body": "I especially hate the insistence to “just try a bite!” Like no, I’ve tried a million different mashed potatoes, why do you really think yours are that different?",
          "created_utc": 1669242050.0
        }
      ]
    },
    {
      "id": "ixkvoqh",
      "author": "snape17",
      "body": "YESSS this sounds amazing 🙌",
      "created_utc": 1669266464.0,
      "score": 2,
      "context": [
        {
          "id": "ixjre25",
          "author": "littleferrhis",
          "body": "I’m spending thanksgiving with my girlfriend this year. Her brother has autism and won’t eat anything but certain chicken tenders and certain pizza(I can eat a little bit more than that, but that’s usually what I’ll eat too). We’re going to be making homemade pizza. I got real lucky this year. I am in heaven.",
          "created_utc": 1669246039.0
        }
      ]
    },
    {
      "id": "lsv4llt",
      "author": "0000425671",
      "body": "What is your favorite thanksgiving vegetable?",
      "created_utc": 1729442489.0,
      "score": 1,
      "context": [
        {
          "id": "ixj0br3",
          "author": "Throwaway-burnoutq",
          "body": "Same. I get so many questions about why I’m eating either nothing or a meal I made myself earlier that’s entirely different. Just let me eat my plain toast in peace :(",
          "created_utc": 1669234586.0
        }
      ]
    },
    {
      "id": "ixlmqrc",
      "author": "Applegirl2021",
      "body": "This! This has become my coping mechanism. I have a really fun Mac n cheese recipe. I use my safe shredded 4 cheese Mexican blend cheese and my safe brand Tri color rotini and boil the pasta, then layer in a dish with pasta first, then some salt, then the cheese then repeat til the bowl is filled and then microwave to melt the cheese and voila, a fun, safe dish for me and most people I’ve shared it with think it’s a little simple, but good and I bring that to every thanksgiving I go to! It’s not fun making food for every meal this week but it is FAR better than the alternative — starving and being ridiculed or questioned incessantly for being starving.",
      "created_utc": 1669287250.0,
      "score": 3,
      "context": [
        {
          "id": "ixjmv1f",
          "author": "Crazy_Cat_Lady360",
          "body": "I’m sorry you all have to endure that. \n\nAre you able to take a safe food? In my country it’s very acceptable to offer to bring a plate of food. I would just take something you will eat. Nobody should be forced to sit at a table of food they can’t eat. I stopped forcing my ARFID child years ago. We just don’t do these family dinners.",
          "created_utc": 1669243984.0
        }
      ]
    },
    {
      "id": "ixmh2b8",
      "author": "collegethrowaway2938",
      "body": "Everything here is facts I’m not triggering myself just to celebrate dead native Americans",
      "created_utc": 1669305099.0,
      "score": 3,
      "context": [
        {
          "id": "ixkqdxd",
          "author": "majesticsn0wflake",
          "body": "i’ve cried on every thanksgiving as far back as i can remember. everyone wants to comment on how little i’m eating. everyone insists that *their* mashed potatoes will convince me that i like mashed potatoes. it’s such an awful holiday, i feel bad enough when normal stuff becomes food-centric but now we have to have a whole day? a whole get together that’s exclusively about food? and it’s not even for a good reason! “let’s celebrate the genocide of native americans with turkey!” no i’d actually rather not thanks tho",
          "created_utc": 1669263360.0
        }
      ]
    },
    {
      "id": "lsv5ius",
      "author": "0000425671",
      "body": "What is your favorite thanksgiving vegetable?",
      "created_utc": 1729442780.0,
      "score": 1,
      "context": [
        {
          "id": "ixjrykq",
          "author": "SlackerAtWork",
          "body": "I hate Thanksgiving when we aren't spending it with me family. My family incredibly supportive and they never pressure me to eat things they know I don't like. My safe foods are always on the menu every year, without question. \n\nHowever, some years we eat with my husband's family. They know I have a 'weird diet', but only see it as I'm picky. His dad tries to get me to eat new foods, not sure if he's teasing me or genuinely trying, because sometimes he's really pushy and sometimes he's not, but he always has mac and cheese at his house for me. So, he's at least supportive in that way. \n\nBut the teasing does bother me, especially when he does it in front of other people. My husband's brother and sister have said something once or twice, but I feel the most pressure from his dad. \n\nI married into a foodie family, so that was my first mistake.",
          "created_utc": 1669246301.0
        }
      ]
    },
    {
      "id": "ixjl3sp",
      "author": "arewedeadyett",
      "body": "Too bad I don’t like cheese and crackers",
      "created_utc": 1669243212.0,
      "score": 3,
      "context": [
        {
          "id": "ixjfsqk",
          "author": "MMTardis",
          "body": "Luckily in the Midwest there is always a  tray of cheese and crackers, as an appetizer. Between that and bread rolls,  you can make an ok meal.",
          "created_utc": 1669240885.0
        }
      ]
    },
    {
      "id": "j0vomhh",
      "author": "None",
      "body": "I honestly wish everyone hosting Thanksgiving had the same attitude",
      "created_utc": 1671478841.0,
      "score": 1,
      "context": [
        {
          "id": "ixkh892",
          "author": "meatypizza",
          "body": "this is the reason i host thanksgiving, if you want something specific at my house you bring it but i make what i will eat and like, its my money and time lol",
          "created_utc": 1669258437.0
        }
      ]
    },
    {
      "id": "iyuq9g9",
      "author": "posy_pot",
      "body": "that’s a war crime",
      "created_utc": 1670142613.0,
      "score": 2,
      "context": [
        {
          "id": "ixkiv5h",
          "author": "Chihuahua_enthusiast",
          "body": "Last year they added ranch to the mashed potatoes. Now I can only eat bread…",
          "created_utc": 1669259283.0
        }
      ]
    },
    {
      "id": "kaj0kq5",
      "author": "ivylane77",
      "body": "I would sue for crimes against humanity",
      "created_utc": 1700799840.0,
      "score": 1,
      "context": [
        {
          "id": "ixkiv5h",
          "author": "Chihuahua_enthusiast",
          "body": "Last year they added ranch to the mashed potatoes. Now I can only eat bread…",
          "created_utc": 1669259283.0
        }
      ]
    },
    {
      "id": "ixj61tz",
      "author": "WeekendWaffles",
      "body": "I didn’t read the comments but I can guess what they say.  If I convince myself they are coming from a place of ignorance rather than maliciousness it is easier to shrug stuff off and move on.",
      "created_utc": 1669236869.0,
      "score": 24,
      "context": [
        {
          "id": "ixivtxm",
          "author": "WeekendWaffles",
          "body": "I came across this article other day and it feels very familiar.\n\nhttps://www.huffpost.com/entry/thanksgiving-eating-disorder-arfid_n_637a8416e4b0c5739621c4dc",
          "created_utc": 1669232806.0
        },
        {
          "id": "ixj4c93",
          "author": "Throwaway-burnoutq",
          "body": "The comments on the article are pretty disgusting.",
          "created_utc": 1669236186.0
        }
      ]
    },
    {
      "id": "ixjxd0u",
      "author": "APleasantMartini",
      "body": "Didn't read, but I can guess the comments.",
      "created_utc": 1669248813.0,
      "score": 13,
      "context": [
        {
          "id": "ixivtxm",
          "author": "WeekendWaffles",
          "body": "I came across this article other day and it feels very familiar.\n\nhttps://www.huffpost.com/entry/thanksgiving-eating-disorder-arfid_n_637a8416e4b0c5739621c4dc",
          "created_utc": 1669232806.0
        },
        {
          "id": "ixj4c93",
          "author": "Throwaway-burnoutq",
          "body": "The comments on the article are pretty disgusting.",
          "created_utc": 1669236186.0
        }
      ]
    },
    {
      "id": "ixlmf34",
      "author": "Applegirl2021",
      "body": "I agree. I didn’t read the comments (try not to on things like that) but the article really spoke to me and my experience as a young adult with ARFID. I sent it to my mom and maybe that can help her better understand this since it’s also from a parent’s perspective.",
      "created_utc": 1669286976.0,
      "score": 8,
      "context": [
        {
          "id": "ixivtxm",
          "author": "WeekendWaffles",
          "body": "I came across this article other day and it feels very familiar.\n\nhttps://www.huffpost.com/entry/thanksgiving-eating-disorder-arfid_n_637a8416e4b0c5739621c4dc",
          "created_utc": 1669232806.0
        },
        {
          "id": "ixj0bye",
          "author": "arewedeadyett",
          "body": "Wow that really hit home",
          "created_utc": 1669234589.0
        }
      ]
    }
  ]
}