{
  "id": "ze9ueh",
  "subreddit": "ARFID",
  "author": "badbatch",
  "created_utc": 1670341204.0,
  "title": "Is this an eating disorder?",
  "selftext": "Whenever I bring up my eating issues with my therapist and nurse practitioner they roll their eyes and act like I'm acting like a child. My nurse practitioner that treats my depression says I need to eat certain things for my PMS issues. She tells me \"just eat it\". My homework was to eat spinach. I never did and I'm going to have to tell her I never did at my appointment today.\n\nWhy isn't this taken seriously like anorexia, bulimia and binge eating? It impacts our lives and is very hard to deal with. We don't WANT to be this way.",
  "url": "https://www.reddit.com/r/ARFID/comments/ze9ueh/is_this_an_eating_disorder/",
  "score": 97,
  "num_comments": 28,
  "comments": [
    {
      "id": "iz5esvg",
      "author": "K0rra_22",
      "body": "Tell her it’s a serious issue that you feel isn’t being treated as such. Be honest because if she’s a good therapist she will be able to recognize that her approach to you isn’t helping. And if she continues to disrespect you then start looking for another therapist.",
      "created_utc": 1670345191.0,
      "score": 79,
      "context": []
    },
    {
      "id": "iz5h4an",
      "author": "tirilama",
      "body": "I don't know if this helps, but this is my ideas:\n\nTell her that just starting eating spinach won't work. Try to ask her why she wants you to eat spinach. Then you will know what nutrients you need. Ask if there is other ingredients with the same nutrients or if you, for a while, could use a supplement instead.\n\nI would also try to ask the therapist to read up a little on ARFID.\n\nI wish you good luck! If it does not work out with this therapist, I hope you will find someone that fits your needs better.",
      "created_utc": 1670346094.0,
      "score": 39,
      "context": []
    },
    {
      "id": "iz5mtbj",
      "author": "chunkeymunkeyandrunt",
      "body": "ARFID is LITERALLY an eating disorder. It is in the DSM! Your providers sound garbage if they treat you this way.",
      "created_utc": 1670348294.0,
      "score": 35,
      "context": []
    },
    {
      "id": "iz5holk",
      "author": "weirdwithfood",
      "body": "One thing I used to describe my ARFID was the fact that I would physically gag and be sick when forcing down unpalatable foods. It causes me a lot of physical distress being physically incapable of swallowing certain foods and unlike normal people I can't just \"choke it down\" as my body will go into full rejection mode and I'll likely get sick on the spot.\n\nPressing the fact that my physical response to the food was not voluntary was what got me diagnosed, and it might be time to ask for another therapist if they're refusing to listen. Even if you get treatment through a very specific place you should be able to ask to schedule with a different person. If asked why, tell them it's because you don't think their treatment style is right for you and you didn't feel listened to. If they press further, you should explain this exact situation and the reactions to your potential issues they have. Getting better is about what works for the patient, so forcing you to stay with healthcare professionals who aren't giving you what you need, you can leave them.",
      "created_utc": 1670346317.0,
      "score": 18,
      "context": []
    },
    {
      "id": "iz5vs84",
      "author": "Carina_Nebula89",
      "body": "https://youtu.be/JK9r14D4d-k\n\nHere is a video you can ask them to watch.It explains ARFID, mentions that it is a recognized eating disorder, and also talks about the fact that trying to convince someone with ARFID to eat something won't work",
      "created_utc": 1670351656.0,
      "score": 8,
      "context": []
    },
    {
      "id": "iz6n7dv",
      "author": "DisagreeableCompote",
      "body": "It is an eating disorder. It should be taken seriously, unfortunately I think partly due to the fact that it’s newer and also possibly more difficult for others to relate to, a lot of people still don’t really understand.\n\nMy doctor finally diagnosed me. But I put it off so long talking about it because I was afraid I wouldn’t be taken seriously, and I still felt like I wasn’t completely. I pretty much literally said “I think I have something called ARFID” and explained why. And I felt like he was almost trying not to smirk at me.\n\nBut he *did* refer me to a dietician and ARFID was listed as one of the reasons., which I was pleasantly surprised by.\n\nHe also diagnosed me with “low body weight due to insufficient caloric intake” or something along those lines, so maybe he’s taking it more seriously because of my very low BMI.\n\nBut unfortunately the dietician seems to be similar to how you describe your APRN. She is nice enough, but she’s basically like “your homework is to eat this stuff” and I’ve honestly tried a few things, and she gave me a few recommendations on how to incorporate things, but not as in depth as I would have hoped. It’s definitely not that easy and it kind of feels like she doesn’t fully understand what I’m going through.\n\nSo I totally understand how you feel. I guess I would say don’t give up. You know yourself best.",
      "created_utc": 1670362173.0,
      "score": 7,
      "context": []
    },
    {
      "id": "iz6ev49",
      "author": "Introvertedbee101",
      "body": "I'm sorry your doctor sounds like their gaslighting you. \n\nARFID is an eating disorder, someone with ARFID will go to the point of starving themself to eat. \n\nA picky eater (which we are often called, mocked, etc.) Will cave and eat at some point.\n\nPlease look into changing doctors if you can.",
      "created_utc": 1670358963.0,
      "score": 5,
      "context": []
    },
    {
      "id": "iz6c74n",
      "author": "drubs",
      "body": "Send them the Wikipedia page.  I have been very pleased with the reactions I have gotten when I did this.",
      "created_utc": 1670357952.0,
      "score": 3,
      "context": []
    },
    {
      "id": "iz6nt6e",
      "author": "RedQueenWhiteQueen",
      "body": "This reminds me of the physician who treated my mother's cancer, who simply could not grasp that her hip problems prevented her from just \"hopping up\" on the examination table.  \n\n\nNot to mention all the teachers in high school who didn't realized you had homework for other classes, too.",
      "created_utc": 1670362410.0,
      "score": 3,
      "context": []
    },
    {
      "id": "iz6z6ce",
      "author": "FireHawkDelta",
      "body": "My therapist recommended that I see a nutritionist who worked in the same building as him, and the nutritionist diagnosed me with ARFID after a few meetings. You should try to seek out a specialist as well, generalists often don't know what they're talking about when it comes to mental health issues they aren't familiar with.",
      "created_utc": 1670367062.0,
      "score": 2,
      "context": []
    },
    {
      "id": "iz6r0t9",
      "author": "404unotfound",
      "body": "First problem: nurse practitioner.",
      "created_utc": 1670363682.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iz90aym",
      "author": "Dramatic-Growth1335",
      "body": "I was low on iron too. Super pale, cold and tired all the time.\nAt first I tried apricots which I could handle but It didn't seem to do much.\nI then tried liquid iron supplements which were good but too expensive.\n\nEating green vegetables was what fixed it for me.\nI think peas were the first ones I tried and I couldnt believe that they just sorta tasted \"green\".\nThat unlocked every other green vegetable for me.\nCan't believe it took me about 27 years to try a pea 😅\n\nWhy didn't I gag or wretch? I did at other things I had on my plate. Stilton chicken did me over that day but the peas were the one thing on my plate I could manage so I counted that as a success. My friend, who had cooked the meal after I had asked for help trying new things was not happy and rather upset I did not enjoy their meal 😂\nI think they cooked for me again 1 or 2 more times before giving up in exasperation but whether they believe it or not it helped me massively",
      "created_utc": 1670409766.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iz9cfri",
      "author": "fivecoloursgirl",
      "body": "I completely understand your frustration, I hate when doctors tell me I need to eat something for a medical reason because I can’t. There are lots of foods with iron it, do you like any of those?\n\nIf not, you could ask about iron supplements? I asked for supplements when they told me to change my diet and I was allowed :)",
      "created_utc": 1670418385.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iz5nbtb",
      "author": "badbatch",
      "body": "She wanted me to eat spinach because my Iron was low and I was exhausted during my period. It was affecting me at work. \n\nThis is the only issue I have with both of them. They're both excellent when it comes to everything else. I think I'd want to get another therapist just for my eating issues. I just don't know where I'd find that.",
      "created_utc": 1670348494.0,
      "score": 15,
      "context": [
        {
          "id": "iz5h4an",
          "author": "tirilama",
          "body": "I don't know if this helps, but this is my ideas:\n\nTell her that just starting eating spinach won't work. Try to ask her why she wants you to eat spinach. Then you will know what nutrients you need. Ask if there is other ingredients with the same nutrients or if you, for a while, could use a supplement instead.\n\nI would also try to ask the therapist to read up a little on ARFID.\n\nI wish you good luck! If it does not work out with this therapist, I hope you will find someone that fits your needs better.",
          "created_utc": 1670346094.0
        }
      ]
    },
    {
      "id": "iz7nkzp",
      "author": "r1ddl3d",
      "body": "Came here to say this! It was added to the DSM 5 in 2013 [https://www.ncbi.nlm.nih.gov/books/NBK519712/table/ch3.t18/](https://www.ncbi.nlm.nih.gov/books/NBK519712/table/ch3.t18/)",
      "created_utc": 1670377961.0,
      "score": 1,
      "context": [
        {
          "id": "iz5mtbj",
          "author": "chunkeymunkeyandrunt",
          "body": "ARFID is LITERALLY an eating disorder. It is in the DSM! Your providers sound garbage if they treat you this way.",
          "created_utc": 1670348294.0
        }
      ]
    },
    {
      "id": "iz6w07t",
      "author": "frubblyness",
      "body": "Building off this: if your therapist puts expectations on you, including giving you homework that they hassle you about, they are not trying to help you; they are trying to *fix* you. There is a HUGE difference. I went through ABA (Applied Behavioral Analysis)-based therapy for my ASD (Autism Spectrum Disorder) and my therapists were not trying to accommodate my needs to make my life better; they were examining my behavior and using punishments (mostly tacit disappointment) and rewards to make me comply with their standards of what a \"normal\" teenager should be like. Including having me put a textural desensitization \"toothbrush\" in my mouth to try to force me to overcome my textural food aversions, because the range of foods I ate was not \"normal.\"\n\nThis attitude that we need to \"fix\" people in these ways is toxic. It breeds self-shaming and a people-pleasing attitude in patients. Conditional praise feels like conditional love, and it fucks with your head. It's toxic to pressure people into putting things in their mouth they're not comfortable with. It's toxic to chide them for not eating certain things. It's toxic to withhold praise until they do so. We don't need to be fixed; we need to have our physical *and psychological* needs met. And psychologically, it's very, *very* unhealthy to be told, even implicitly, that you have to be fixed. Especially when it's something inherent to you that most likely *can't* be fixed.\n\nWhen I left for college and stopped getting that horrible toxic \"therapy,\" I eventually started opening up to new foods and trying them, not because anyone told me to but because my friends were eating and cooking them and I was curious. I discovered a lot of things that I liked, and a lot of things that I didn't. In fact, it was such a positive experience for me that I then went to culinary school and worked in multiple restaurants! To this day I'm particular about the foods I eat, but I grew and learned more than ever when I was not told I had to try things or made to feel ashamed for not liking things. People like us may be more hesitant to try new foods for whatever reasons we have, but that doesn't mean we aren't curious or that we don't want to grow. It just means we want to do it at our own pace, on our own terms. And that is what's best for us.",
      "created_utc": 1670365723.0,
      "score": 5,
      "context": [
        {
          "id": "iz6n7dv",
          "author": "DisagreeableCompote",
          "body": "It is an eating disorder. It should be taken seriously, unfortunately I think partly due to the fact that it’s newer and also possibly more difficult for others to relate to, a lot of people still don’t really understand.\n\nMy doctor finally diagnosed me. But I put it off so long talking about it because I was afraid I wouldn’t be taken seriously, and I still felt like I wasn’t completely. I pretty much literally said “I think I have something called ARFID” and explained why. And I felt like he was almost trying not to smirk at me.\n\nBut he *did* refer me to a dietician and ARFID was listed as one of the reasons., which I was pleasantly surprised by.\n\nHe also diagnosed me with “low body weight due to insufficient caloric intake” or something along those lines, so maybe he’s taking it more seriously because of my very low BMI.\n\nBut unfortunately the dietician seems to be similar to how you describe your APRN. She is nice enough, but she’s basically like “your homework is to eat this stuff” and I’ve honestly tried a few things, and she gave me a few recommendations on how to incorporate things, but not as in depth as I would have hoped. It’s definitely not that easy and it kind of feels like she doesn’t fully understand what I’m going through.\n\nSo I totally understand how you feel. I guess I would say don’t give up. You know yourself best.",
          "created_utc": 1670362173.0
        }
      ]
    },
    {
      "id": "iz6uqjp",
      "author": "badbatch",
      "body": "Why? She's not a therapist. She handles my medication. She does a better job at monitoring my health than my GP.",
      "created_utc": 1670365202.0,
      "score": 2,
      "context": [
        {
          "id": "iz6r0t9",
          "author": "404unotfound",
          "body": "First problem: nurse practitioner.",
          "created_utc": 1670363682.0
        }
      ]
    },
    {
      "id": "iz9isx4",
      "author": "badbatch",
      "body": "I applaud you. I hate the taste of peas.",
      "created_utc": 1670421631.0,
      "score": 2,
      "context": [
        {
          "id": "iz90aym",
          "author": "Dramatic-Growth1335",
          "body": "I was low on iron too. Super pale, cold and tired all the time.\nAt first I tried apricots which I could handle but It didn't seem to do much.\nI then tried liquid iron supplements which were good but too expensive.\n\nEating green vegetables was what fixed it for me.\nI think peas were the first ones I tried and I couldnt believe that they just sorta tasted \"green\".\nThat unlocked every other green vegetable for me.\nCan't believe it took me about 27 years to try a pea 😅\n\nWhy didn't I gag or wretch? I did at other things I had on my plate. Stilton chicken did me over that day but the peas were the one thing on my plate I could manage so I counted that as a success. My friend, who had cooked the meal after I had asked for help trying new things was not happy and rather upset I did not enjoy their meal 😂\nI think they cooked for me again 1 or 2 more times before giving up in exasperation but whether they believe it or not it helped me massively",
          "created_utc": 1670409766.0
        }
      ]
    },
    {
      "id": "iz5qqlv",
      "author": "tirilama",
      "body": "There is plenty of foods high in iron. I don't know which foods you are comfortable with, but some is any green vegetable, beans/lentils and meat.\n\nIt is also very common for women to need iron supplements, I think you can get them in any farmacy. It is possible to get too much iron. I don't think it applies to you, but that is the reason it might not be in general supplements.",
      "created_utc": 1670349736.0,
      "score": 27,
      "context": [
        {
          "id": "iz5h4an",
          "author": "tirilama",
          "body": "I don't know if this helps, but this is my ideas:\n\nTell her that just starting eating spinach won't work. Try to ask her why she wants you to eat spinach. Then you will know what nutrients you need. Ask if there is other ingredients with the same nutrients or if you, for a while, could use a supplement instead.\n\nI would also try to ask the therapist to read up a little on ARFID.\n\nI wish you good luck! If it does not work out with this therapist, I hope you will find someone that fits your needs better.",
          "created_utc": 1670346094.0
        },
        {
          "id": "iz5nbtb",
          "author": "badbatch",
          "body": "She wanted me to eat spinach because my Iron was low and I was exhausted during my period. It was affecting me at work. \n\nThis is the only issue I have with both of them. They're both excellent when it comes to everything else. I think I'd want to get another therapist just for my eating issues. I just don't know where I'd find that.",
          "created_utc": 1670348494.0
        }
      ]
    },
    {
      "id": "iz6krm1",
      "author": "frubblyness",
      "body": "Spinach isn't even *that* high in iron. Like u/tirilama said, there are many foods high in iron and you can also take supplements! Also, vitamin C helps with iron absorption, and there are lots of foods high in vitamin C (including some sour candy! (as ascorbic acid)). During my period, I like to take iron pills with a small glass of orange juice. If you do opt for iron pills though, be aware that they can make your stool turn dark (I was very concerned until I realized this).",
      "created_utc": 1670361222.0,
      "score": 15,
      "context": [
        {
          "id": "iz5h4an",
          "author": "tirilama",
          "body": "I don't know if this helps, but this is my ideas:\n\nTell her that just starting eating spinach won't work. Try to ask her why she wants you to eat spinach. Then you will know what nutrients you need. Ask if there is other ingredients with the same nutrients or if you, for a while, could use a supplement instead.\n\nI would also try to ask the therapist to read up a little on ARFID.\n\nI wish you good luck! If it does not work out with this therapist, I hope you will find someone that fits your needs better.",
          "created_utc": 1670346094.0
        },
        {
          "id": "iz5nbtb",
          "author": "badbatch",
          "body": "She wanted me to eat spinach because my Iron was low and I was exhausted during my period. It was affecting me at work. \n\nThis is the only issue I have with both of them. They're both excellent when it comes to everything else. I think I'd want to get another therapist just for my eating issues. I just don't know where I'd find that.",
          "created_utc": 1670348494.0
        }
      ]
    },
    {
      "id": "iz7s28q",
      "author": "lamprologus",
      "body": "If you are actually low in iron and it is affecting you, eating spinach is not gonna cut it, and besides it's an awful experience for you. It is too bad people do not understand ARFID. My bf has ARFID so I have seen this struggle. Your body does not even think its food... it's like asking someone to eat cardboard, from what I can see.\n\nWhy not take a heme iron supplement? They're very easy on the digestive system. There is a group called the Iron protocol that can advise very well on iron issues and a regime. Is your ferritin low?",
      "created_utc": 1670380013.0,
      "score": 3,
      "context": [
        {
          "id": "iz5h4an",
          "author": "tirilama",
          "body": "I don't know if this helps, but this is my ideas:\n\nTell her that just starting eating spinach won't work. Try to ask her why she wants you to eat spinach. Then you will know what nutrients you need. Ask if there is other ingredients with the same nutrients or if you, for a while, could use a supplement instead.\n\nI would also try to ask the therapist to read up a little on ARFID.\n\nI wish you good luck! If it does not work out with this therapist, I hope you will find someone that fits your needs better.",
          "created_utc": 1670346094.0
        },
        {
          "id": "iz5nbtb",
          "author": "badbatch",
          "body": "She wanted me to eat spinach because my Iron was low and I was exhausted during my period. It was affecting me at work. \n\nThis is the only issue I have with both of them. They're both excellent when it comes to everything else. I think I'd want to get another therapist just for my eating issues. I just don't know where I'd find that.",
          "created_utc": 1670348494.0
        }
      ]
    },
    {
      "id": "iz7hh43",
      "author": "tehdesikitteh",
      "body": "I suspect that the fact that this is not one of the big two may play in a bit. Despite being in and around the ED community for years I'd never heard of it until I cracked it at not being able properly understand what I was experiencing and went looking for lesser known ones.",
      "created_utc": 1670375140.0,
      "score": 2,
      "context": [
        {
          "id": "iz5h4an",
          "author": "tirilama",
          "body": "I don't know if this helps, but this is my ideas:\n\nTell her that just starting eating spinach won't work. Try to ask her why she wants you to eat spinach. Then you will know what nutrients you need. Ask if there is other ingredients with the same nutrients or if you, for a while, could use a supplement instead.\n\nI would also try to ask the therapist to read up a little on ARFID.\n\nI wish you good luck! If it does not work out with this therapist, I hope you will find someone that fits your needs better.",
          "created_utc": 1670346094.0
        },
        {
          "id": "iz5nbtb",
          "author": "badbatch",
          "body": "She wanted me to eat spinach because my Iron was low and I was exhausted during my period. It was affecting me at work. \n\nThis is the only issue I have with both of them. They're both excellent when it comes to everything else. I think I'd want to get another therapist just for my eating issues. I just don't know where I'd find that.",
          "created_utc": 1670348494.0
        }
      ]
    },
    {
      "id": "iz6vb85",
      "author": "404unotfound",
      "body": "I mean…weren’t you just complaining about her?",
      "created_utc": 1670365437.0,
      "score": 6,
      "context": [
        {
          "id": "iz6r0t9",
          "author": "404unotfound",
          "body": "First problem: nurse practitioner.",
          "created_utc": 1670363682.0
        },
        {
          "id": "iz6uqjp",
          "author": "badbatch",
          "body": "Why? She's not a therapist. She handles my medication. She does a better job at monitoring my health than my GP.",
          "created_utc": 1670365202.0
        }
      ]
    },
    {
      "id": "iz6v2u8",
      "author": "badbatch",
      "body": "She gave me some other things including red meat which I like. She wanted me to get more vegetables in my diet. She put me on B12 and she had already had me take vitamin D daily. Both have really helped.",
      "created_utc": 1670365342.0,
      "score": 7,
      "context": [
        {
          "id": "iz5h4an",
          "author": "tirilama",
          "body": "I don't know if this helps, but this is my ideas:\n\nTell her that just starting eating spinach won't work. Try to ask her why she wants you to eat spinach. Then you will know what nutrients you need. Ask if there is other ingredients with the same nutrients or if you, for a while, could use a supplement instead.\n\nI would also try to ask the therapist to read up a little on ARFID.\n\nI wish you good luck! If it does not work out with this therapist, I hope you will find someone that fits your needs better.",
          "created_utc": 1670346094.0
        },
        {
          "id": "iz5nbtb",
          "author": "badbatch",
          "body": "She wanted me to eat spinach because my Iron was low and I was exhausted during my period. It was affecting me at work. \n\nThis is the only issue I have with both of them. They're both excellent when it comes to everything else. I think I'd want to get another therapist just for my eating issues. I just don't know where I'd find that.",
          "created_utc": 1670348494.0
        },
        {
          "id": "iz6krm1",
          "author": "frubblyness",
          "body": "Spinach isn't even *that* high in iron. Like u/tirilama said, there are many foods high in iron and you can also take supplements! Also, vitamin C helps with iron absorption, and there are lots of foods high in vitamin C (including some sour candy! (as ascorbic acid)). During my period, I like to take iron pills with a small glass of orange juice. If you do opt for iron pills though, be aware that they can make your stool turn dark (I was very concerned until I realized this).",
          "created_utc": 1670361222.0
        }
      ]
    },
    {
      "id": "iz74s6e",
      "author": "badbatch",
      "body": "I'm just wondering why even mental health workers that I've had are so dismissive of it. My last one didn't know either.",
      "created_utc": 1670369481.0,
      "score": 2,
      "context": [
        {
          "id": "iz6r0t9",
          "author": "404unotfound",
          "body": "First problem: nurse practitioner.",
          "created_utc": 1670363682.0
        },
        {
          "id": "iz6uqjp",
          "author": "badbatch",
          "body": "Why? She's not a therapist. She handles my medication. She does a better job at monitoring my health than my GP.",
          "created_utc": 1670365202.0
        },
        {
          "id": "iz6vb85",
          "author": "404unotfound",
          "body": "I mean…weren’t you just complaining about her?",
          "created_utc": 1670365437.0
        }
      ]
    },
    {
      "id": "iz70uvt",
      "author": "frubblyness",
      "body": "Red meat is not a bad idea since it has a lot of heme iron, which is more bioavailable than non-heme iron, the kind found in plants. Chicken is also fairly high in heme iron. I always suggest impossible beef too since it has a similar amount of heme iron to beef but fewer health risks, assuming it's something you can eat and afford of course. And having more vegetables in your diet is almost never a bad thing, but also don't feel bad if you have trouble with it. There's always vitamin supplements, even if they aren't \"ideal.\"",
      "created_utc": 1670367784.0,
      "score": 5,
      "context": [
        {
          "id": "iz5h4an",
          "author": "tirilama",
          "body": "I don't know if this helps, but this is my ideas:\n\nTell her that just starting eating spinach won't work. Try to ask her why she wants you to eat spinach. Then you will know what nutrients you need. Ask if there is other ingredients with the same nutrients or if you, for a while, could use a supplement instead.\n\nI would also try to ask the therapist to read up a little on ARFID.\n\nI wish you good luck! If it does not work out with this therapist, I hope you will find someone that fits your needs better.",
          "created_utc": 1670346094.0
        },
        {
          "id": "iz5nbtb",
          "author": "badbatch",
          "body": "She wanted me to eat spinach because my Iron was low and I was exhausted during my period. It was affecting me at work. \n\nThis is the only issue I have with both of them. They're both excellent when it comes to everything else. I think I'd want to get another therapist just for my eating issues. I just don't know where I'd find that.",
          "created_utc": 1670348494.0
        },
        {
          "id": "iz6krm1",
          "author": "frubblyness",
          "body": "Spinach isn't even *that* high in iron. Like u/tirilama said, there are many foods high in iron and you can also take supplements! Also, vitamin C helps with iron absorption, and there are lots of foods high in vitamin C (including some sour candy! (as ascorbic acid)). During my period, I like to take iron pills with a small glass of orange juice. If you do opt for iron pills though, be aware that they can make your stool turn dark (I was very concerned until I realized this).",
          "created_utc": 1670361222.0
        },
        {
          "id": "iz6v2u8",
          "author": "badbatch",
          "body": "She gave me some other things including red meat which I like. She wanted me to get more vegetables in my diet. She put me on B12 and she had already had me take vitamin D daily. Both have really helped.",
          "created_utc": 1670365342.0
        }
      ]
    },
    {
      "id": "iz72b67",
      "author": "badbatch",
      "body": "I eat chicken like it's going out of style but she said that I might need more iron and B12 than average. I was anemic most of my childhood and in high school so I'm not surprised.",
      "created_utc": 1670368410.0,
      "score": 6,
      "context": [
        {
          "id": "iz5h4an",
          "author": "tirilama",
          "body": "I don't know if this helps, but this is my ideas:\n\nTell her that just starting eating spinach won't work. Try to ask her why she wants you to eat spinach. Then you will know what nutrients you need. Ask if there is other ingredients with the same nutrients or if you, for a while, could use a supplement instead.\n\nI would also try to ask the therapist to read up a little on ARFID.\n\nI wish you good luck! If it does not work out with this therapist, I hope you will find someone that fits your needs better.",
          "created_utc": 1670346094.0
        },
        {
          "id": "iz5nbtb",
          "author": "badbatch",
          "body": "She wanted me to eat spinach because my Iron was low and I was exhausted during my period. It was affecting me at work. \n\nThis is the only issue I have with both of them. They're both excellent when it comes to everything else. I think I'd want to get another therapist just for my eating issues. I just don't know where I'd find that.",
          "created_utc": 1670348494.0
        },
        {
          "id": "iz6krm1",
          "author": "frubblyness",
          "body": "Spinach isn't even *that* high in iron. Like u/tirilama said, there are many foods high in iron and you can also take supplements! Also, vitamin C helps with iron absorption, and there are lots of foods high in vitamin C (including some sour candy! (as ascorbic acid)). During my period, I like to take iron pills with a small glass of orange juice. If you do opt for iron pills though, be aware that they can make your stool turn dark (I was very concerned until I realized this).",
          "created_utc": 1670361222.0
        },
        {
          "id": "iz6v2u8",
          "author": "badbatch",
          "body": "She gave me some other things including red meat which I like. She wanted me to get more vegetables in my diet. She put me on B12 and she had already had me take vitamin D daily. Both have really helped.",
          "created_utc": 1670365342.0
        },
        {
          "id": "iz70uvt",
          "author": "frubblyness",
          "body": "Red meat is not a bad idea since it has a lot of heme iron, which is more bioavailable than non-heme iron, the kind found in plants. Chicken is also fairly high in heme iron. I always suggest impossible beef too since it has a similar amount of heme iron to beef but fewer health risks, assuming it's something you can eat and afford of course. And having more vegetables in your diet is almost never a bad thing, but also don't feel bad if you have trouble with it. There's always vitamin supplements, even if they aren't \"ideal.\"",
          "created_utc": 1670367784.0
        }
      ]
    },
    {
      "id": "iz74hav",
      "author": "frubblyness",
      "body": "It can be hard enough for an average menstruating person to get enough iron. Having a history of anemia seems like a perfectly fair reason to look into taking supplements. That goes for anyone, including* someone with an eating disorder.\n\nEdit: including",
      "created_utc": 1670369349.0,
      "score": 5,
      "context": [
        {
          "id": "iz5h4an",
          "author": "tirilama",
          "body": "I don't know if this helps, but this is my ideas:\n\nTell her that just starting eating spinach won't work. Try to ask her why she wants you to eat spinach. Then you will know what nutrients you need. Ask if there is other ingredients with the same nutrients or if you, for a while, could use a supplement instead.\n\nI would also try to ask the therapist to read up a little on ARFID.\n\nI wish you good luck! If it does not work out with this therapist, I hope you will find someone that fits your needs better.",
          "created_utc": 1670346094.0
        },
        {
          "id": "iz5nbtb",
          "author": "badbatch",
          "body": "She wanted me to eat spinach because my Iron was low and I was exhausted during my period. It was affecting me at work. \n\nThis is the only issue I have with both of them. They're both excellent when it comes to everything else. I think I'd want to get another therapist just for my eating issues. I just don't know where I'd find that.",
          "created_utc": 1670348494.0
        },
        {
          "id": "iz6krm1",
          "author": "frubblyness",
          "body": "Spinach isn't even *that* high in iron. Like u/tirilama said, there are many foods high in iron and you can also take supplements! Also, vitamin C helps with iron absorption, and there are lots of foods high in vitamin C (including some sour candy! (as ascorbic acid)). During my period, I like to take iron pills with a small glass of orange juice. If you do opt for iron pills though, be aware that they can make your stool turn dark (I was very concerned until I realized this).",
          "created_utc": 1670361222.0
        },
        {
          "id": "iz6v2u8",
          "author": "badbatch",
          "body": "She gave me some other things including red meat which I like. She wanted me to get more vegetables in my diet. She put me on B12 and she had already had me take vitamin D daily. Both have really helped.",
          "created_utc": 1670365342.0
        },
        {
          "id": "iz70uvt",
          "author": "frubblyness",
          "body": "Red meat is not a bad idea since it has a lot of heme iron, which is more bioavailable than non-heme iron, the kind found in plants. Chicken is also fairly high in heme iron. I always suggest impossible beef too since it has a similar amount of heme iron to beef but fewer health risks, assuming it's something you can eat and afford of course. And having more vegetables in your diet is almost never a bad thing, but also don't feel bad if you have trouble with it. There's always vitamin supplements, even if they aren't \"ideal.\"",
          "created_utc": 1670367784.0
        },
        {
          "id": "iz72b67",
          "author": "badbatch",
          "body": "I eat chicken like it's going out of style but she said that I might need more iron and B12 than average. I was anemic most of my childhood and in high school so I'm not surprised.",
          "created_utc": 1670368410.0
        }
      ]
    }
  ]
}