{"type": "comment", "timestamp": 1598649751.0, "datetime": "2020-08-28T21:22:31", "subreddit": "fuckeatingdisorders", "id": "g36ehk9", "text": "That’s fantastic! I’m so happy for you that you’re moving forward in your recovery! Best of luck ❤️", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1603510028.0, "datetime": "2020-10-24T03:27:08", "subreddit": "AnorexiaNervosa", "id": "g9ugx85", "text": "That looks fantastic! Burritos are one of my fave foods. \n\nSo proud of you for challenging your Ed!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1610415731.0, "datetime": "2021-01-12T01:42:11", "subreddit": "fuckeatingdisorders", "id": "giyay5n", "text": "I completely agree. I’d recommend looking up info about the body neutrality movement, which is much more in line with the logic you’re describing - a movement trying to shift away from the need to be beautiful at all, or to ascribe so much value to traits like beauty. Personally I think that’s a much more logical and helpful way of thinking than trying to convince myself that every part of the way I look is beautiful.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1617902656.0, "datetime": "2021-04-08T17:24:16", "subreddit": "fuckeatingdisorders", "id": "gttzsdj", "text": "I still don’t think you choose it - I “chose” to restrict to an extreme degree in the beginning too. Pre-Ed, I couldn’t cope, felt terrible all the time and was just like “well, I’m going to stop eating”. And I basically did. \n\nBut how much of a choice is it really? Nobody starts this because their life is so great. Even though it seemed like I “chose” to restrict in the beginning, it was because I was at the end of my rope and just didn’t see any other options. I could do that, or - I didn’t know what else I could do to cope. At the time I thought of it as a choice, and I think it’s a lot easier psychologically if you think you’re choosing it. Once it doesn’t feel like a choice, once you realize you can’t cope otherwise, then restricting (in my experience) becomes a lot more distressing whereas before you could convince yourself you were strong for restricting. Idk just my thoughts 🤷‍♀️", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1617911793.0, "datetime": "2021-04-08T19:56:33", "subreddit": "fuckeatingdisorders", "id": "gtul1do", "text": "Yes, I always much preferred looking at my Ed as a coping mechanism and acknowledging that it serves a purpose. I absolutely hated the “life without Ed” type philosophy of treating my eating disorder as this purposeless demon separate from myself. It clearly served a purpose in my life and knowing what purpose(s) it served let me find new coping mechanisms and ways of approaching my problems. \n\nI felt similar to you - my eating disorder, though it almost killed me, also in some ways protected me - it allowed me to cope at a time I didn’t know how. \n\nI like what you said about recovery - it’s so true, it’s a magical thing when you can see what your eating disorder is trying to tell you and the issues that it stems from and acknowledge them without using behaviors, instead using that to pinpoint what you need to work on to feel better", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1617913919.0, "datetime": "2021-04-08T20:31:59", "subreddit": "fuckeatingdisorders", "id": "gtupydw", "text": "Yes, I realized in recovery that a lot of my eating disorder was fixated on doing everything exactly as I “should” - I had to keep up this image of myself being a specific way and I could never let go or let my guard down for fear of not acting exactly as I thought I should.\n\nVery true, I definitely learned that avoiding things is the #1 way to make sure they never go away. My Ed was a way of avoiding emotion, but damn when I finally let myself feel anything it was a LOT. But I got through it and learned to stop avoiding and start letting myself feel things.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1617982073.0, "datetime": "2021-04-09T15:27:53", "subreddit": "fuckeatingdisorders", "id": "gtxuyi9", "text": "Same thing happened to me in recovery! I take it as a good sign that I’m not obsessed with food anymore and have other things that take my focus and energy in life :) and the good thing about baking supplies is most of them don’t expire quickly at all, so you’ll be able to use them at a later time if you decide you want to", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1621281567.0, "datetime": "2021-05-17T19:59:27", "subreddit": "fuckeatingdisorders", "id": "gyhhbqb", "text": "“You have to be in a bubble to take all the pain and suffering and death and minimize it to “they hated fatness that much”” -YES! Thank you for putting this in words. \n\nEating disorders can be rooted in a lot of things - family issues, trauma, loneliness, perfectionism, etc - and those things can vary from person to person! But saying that fat phobia is THE root of eating disorders just minimizes a mental illness down to a vanity issue. (And it completely disregards the many people with eating disorders who aren’t fat phobic).", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1626284328.0, "datetime": "2021-07-14T17:38:48", "subreddit": "AnorexiaNervosa", "id": "h56enk5", "text": "If you don’t mind me asking, where are you going to get checked? Any thoughts on finding somewhere that is aware of how women with autism present differently than men? If you’re male, please disregard the question.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1640986485.0, "datetime": "2021-12-31T21:34:45", "subreddit": "fuckeatingdisorders", "id": "hqqbqum", "text": "Yes!!! So happy for you! Wishing you all the best in 2022 and hoping this time next year you’ll be able to look back and see how far you’ve come!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1644270654.0, "datetime": "2022-02-07T21:50:54", "subreddit": "fuckeatingdisorders", "id": "hvzzyvs", "text": "I’m so proud of you! Pasta is such a delicious lunch and I hope you were able to enjoy it!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1644861737.0, "datetime": "2022-02-14T18:02:17", "subreddit": "AnorexiaNervosa", "id": "hwxnp6h", "text": "Sending you love as well <3 I wish this was something discussed more.  I've been recovered for years but the trauma of my ED still stays with me. I had some truly horrible experiences with involuntary treatment, and then when my ED was at its worst, that was traumatizing in a different way.  Anyway, just know you're not alone and I'm wishing you healing and recovery.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1651603312.0, "datetime": "2022-05-03T18:41:52", "subreddit": "AnorexiaNervosa", "id": "i76yu96", "text": "I hate the stereotype that a lot of treatment providers stated as if it was fact over and over: that people with anorexia want to be ~special~.\n\nMeanwhile I just wanted so badly to fit in with people but lots of therapists seemed to think that all anorexics have a desire to be different/special.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1651606772.0, "datetime": "2022-05-03T19:39:32", "subreddit": "AnorexiaNervosa", "id": "i776yaj", "text": "Hi, I had to remove this for rule 10 but if you’d like the edit the number out, let me know and I’ll go back and approve the comment.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1651608354.0, "datetime": "2022-05-03T20:05:54", "subreddit": "AnorexiaNervosa", "id": "i77atyy", "text": "Thanks! I approved it", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1652050434.0, "datetime": "2022-05-08T22:53:54", "subreddit": "fuckeatingdisorders", "id": "i7uq67t", "text": "YES. I love the body neutrality concept. So much more freeing and empowering and so much of a better approach to body image than body positivity. I’m all for body neutrality.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1653479093.0, "datetime": "2022-05-25T11:44:53", "subreddit": "fuckeatingdisorders", "id": "i9x9kmn", "text": "I wish more therapists approached resistance to recovery in this way! That’s a really great exercise, thank you for sharing", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1669557288.0, "datetime": "2022-11-27T13:54:48", "subreddit": "AnorexiaNervosa", "id": "ixywn8k", "text": "This subreddit has rules in order to be more supportive and prevent harm to others. Each rule is designed to prevent people from being harmed, increase support and/or make this a safer space for all.\n\nDiscussion of symptoms is fine - but that’s not why your posts/comments have been deleted in the past. Of course this subreddit doesn’t allow pro ana comments and and discussions. That’s not supportive; that’s damaging.\n\nIf you don’t feel supported here, you don’t have post/comment/join. And no, we don’t ban people for expressing an issue with rules.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1676047167.0, "datetime": "2023-02-10T16:39:27", "subreddit": "fuckeatingdisorders", "id": "j7zxjex", "text": "Yes it really means more like satiated/don’t want more.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1683289500.0, "datetime": "2023-05-05T12:25:00", "subreddit": "AnorexiaNervosa", "id": "jiyd9ly", "text": "Hi, mod here - I'm really sorry that you've seen these posts, and I know that can be really difficult when you're not expecting it, especially as this sub is intended to be a place free from triggering numbers and pro-ana content.\n\nI've been very absent for the past few months due to my personal life, but going forward will regularly check in to remove posts when they are flagged.  I've gone through yesterday's posts and believe I have removed all flagged posts that violate the rules.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1683290511.0, "datetime": "2023-05-05T12:41:51", "subreddit": "AnorexiaNervosa", "id": "jiyf71j", "text": "Thank you! We would love to - there should be a pinned post at the top of the sub (though if you're on mobile/the app I'm not sure if you always see pinned posts) asking for mods.  Currently its just myself and one other mod, so it can be hard to stay consistently on top of what's getting posted. It should be better going forward though now that I'm able to check in more.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1683337032.0, "datetime": "2023-05-06T01:37:12", "subreddit": "AnorexiaNervosa", "id": "jj1dl86", "text": "Here is the post: [https://www.reddit.com/r/AnorexiaNervosa/comments/x88lna/interested\\_in\\_moderating\\_here\\_read\\_this/](https://www.reddit.com/r/AnorexiaNervosa/comments/x88lna/interested_in_moderating_here_read_this/)\n\nAnd don't worry, you weren't harsh -its completely fair to expect that the rules be followed and rule-breaking posts be removed.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1683337156.0, "datetime": "2023-05-06T01:39:16", "subreddit": "AnorexiaNervosa", "id": "jj1dtyc", "text": "Thank you! If you're interested, we have a post here [https://www.reddit.com/r/AnorexiaNervosa/comments/x88lna/interested\\_in\\_moderating\\_here\\_read\\_this/](https://www.reddit.com/r/AnorexiaNervosa/comments/x88lna/interested_in_moderating_here_read_this/) if you're interested in moderating.  \n\nRight now, I'm relying mostly on reports, so flagging any rule-breaking posts is also super helpful!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1683337217.0, "datetime": "2023-05-06T01:40:17", "subreddit": "AnorexiaNervosa", "id": "jj1dy7u", "text": "Sorry, what tag? If you're referring to unfollowing the sub, thats up to you - if you feel its harmful for you, please unsub.  We will be trying to be more consistent and strict with moderation going forward, though.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1684625863.0, "datetime": "2023-05-20T23:37:43", "subreddit": "AnorexiaNervosa", "id": "jkyra5e", "text": "I went to a hospital like that. It really set a very negative tone about the idea of recovery when my admission was treated like a punishment (at the hospital I was at, they outright said that not being able to watch tv, etc was so that I could \"think about what I'd done\")", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1684669036.0, "datetime": "2023-05-21T11:37:16", "subreddit": "AnorexiaNervosa", "id": "jl0mmt2", "text": "Pretty ironic that we're always told we're the ones with control issues, but they're the ones trying to tell people they can't fidget (or something equally petty).  Agreed, this place was abusive af and traumatized me.  So many of the doctors I met there (and in ED treatment overall) were on a massive powertrip and desperate to prove they were in charge and to feel powerful over me, an already powerless 16 year old (at the time). It was pathetic. The rules had nothing to do with my safety and everything to do with a need to control, micro-manage, punish and feel powerful.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1684669072.0, "datetime": "2023-05-21T11:37:52", "subreddit": "AnorexiaNervosa", "id": "jl0mos9", "text": "Thank you <3", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1684965254.0, "datetime": "2023-05-24T21:54:14", "subreddit": "AnorexiaNervosa", "id": "jlhh23m", "text": "That is so horrifying - I'm so sorry.  Solitary should only ever be used if the person is a danger to people around them.  There's no need for that for a twelve year old.\n\nSo many of the things about treatment really came down to exactly what you said: so someone could feel powerful for a minute.  It's so sickening.\n\nYou really couldn't even make up that bead/feather story - the sad excuses for \"therapy\" they presented were awful. I remember one \"therapy\" exercise i had to do was to illustrate in a specific way how big I thought my waist was, and then they showed me the reality! And I got to keep the comparison! (Of course all I ever did with this was use this to body check and see if my waist was as small as when I was in the hospital).\n\nSimilar for me - when I was 17 I went to Renfrew and was in the adult building, and it was SO MUCH better. It was still shit, but it wasn't as degrading and condescending and traumatizing as the hospital program.\n\nAnd I HATED the \"that's the anorexia talking\" thing! They said the same shit at the hospital I was at.  It made me feel even more like I wasn't heard, didn't matter, and didn't have a voice, and of course you know how I coped with those feelings? Anorexia, of course.\n\nSo much of treatment for mental illness (esp for children) is straight up abuse and I hope that at some point its recognized as exactly that.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1684965647.0, "datetime": "2023-05-24T22:00:47", "subreddit": "AnorexiaNervosa", "id": "jlhi1t9", "text": "Right - this is a community for people who are struggling, whether in recovery or not.  People have every right to vent and look for support, kindness and community here.  There is a difference between pro-ana content and posting about experiences as a person who is not in recovery.  Everyone deserves to feel welcomed and respected", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1685401190.0, "datetime": "2023-05-29T22:59:50", "subreddit": "AnorexiaNervosa", "id": "jm4pozg", "text": "I don't think anyone is denying that men get treated terribly in treatment too, but what is being said is that the \\*perception\\* that AN is an illness that primarily affects women means that many of the biases against women, and the issues with women's healthcare, emerge in treatment of anorexia. And, when its primarily young girls who are getting treatment, the illness as a whole isn't taken as seriously in part because teenage girls and their problems aren't taken seriously.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1707532397.0, "datetime": "2024-02-10T02:33:17", "subreddit": "AnorexiaNervosa", "id": "kpq9wb6", "text": "Mod here, if you feel comfortable, please send the username via modmail so that we can ban this user from the sub.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1707589835.0, "datetime": "2024-02-10T18:30:35", "subreddit": "AnorexiaNervosa", "id": "kptb1by", "text": "Haha you’re reading the “what I wanted to write” version of my comment 😂", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1728323809.0, "datetime": "2024-10-07T17:56:49", "subreddit": "AnorexiaNervosa", "id": "lqt85y1", "text": "Yeah agree! It’s so condescending and disrespectful. It would be one thing if they talked about why they were doing blind weights, but this is an abysmal way of approaching it. ", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1728343375.0, "datetime": "2024-10-07T23:22:55", "subreddit": "AnorexiaNervosa", "id": "lquvq2t", "text": "Completely agree! It should be a team approach, and the patient should be a part of that team. We still are human beings and should be treated as such - treating us as an eating disorder is disrespectful, and pretending that any questions or criticism we have of our treatment is simply our eating disorder talking is a convenient cop-out for treatment providers having any actual responsibility to providing good, individualized treatment. People with eating disorders deserve to feel heard and to have a real understanding of our medical treatment as much as anyone else with any other medical disorder.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1728357287.0, "datetime": "2024-10-08T03:14:47", "subreddit": "AnorexiaNervosa", "id": "lqvwfxl", "text": "Agree! This is so individual. Blind weights are helpful for some people, but not everyone. I never did blind weights and it was agonizing for a while but was actually the right decision for me. I'm fully recovered and the number really has no impact on me anymore.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1742562854.0, "datetime": "2025-03-21T13:14:14", "subreddit": "AnorexiaNervosa", "id": "miyvpzp", "text": "That makes it sound like anorexia is just extreme weight loss/thinness which can be given by injection instead of a real mental illness. People taking this medication aren’t becoming anorexic (generally) because of it, and their experience of the weight loss is wildly different from the experience of anorexia. ", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1742563296.0, "datetime": "2025-03-21T13:21:36", "subreddit": "AnorexiaNervosa", "id": "miywzxi", "text": "Yeah but I think it’s safe to assume in an anorexia nervous sub that when we say anorexia we’re referring to the mental illness", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1742565170.0, "datetime": "2025-03-21T13:52:50", "subreddit": "AnorexiaNervosa", "id": "miz2k1c", "text": "Most people mean anorexia nervosa when they say anorexia, but anorexia is a medical term for lack of appetite while anorexia nervosa is the mental illness", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1743882855.0, "datetime": "2025-04-05T19:54:15", "subreddit": "AnorexiaNervosa", "id": "mll8l6n", "text": "Same, had a full ride but was forced to take a medical leave just before my first semester ended. That semester was so awful I couldn't imagine going back to that same college again.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1750208117.0, "datetime": "2025-06-18T00:55:17", "subreddit": "AnorexiaNervosa", "id": "myd88nw", "text": "Honestly, I think what you said is fine. You were firm but kind and I don't personally think it comes across as harsh, just assertive", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1750354433.0, "datetime": "2025-06-19T17:33:53", "subreddit": "AnorexiaNervosa", "id": "myo0iqu", "text": "Sorry OP, this person has been permanently banned. They're clearly a troll.", "parent_id": null, "link_id": null, "context": null}
