{"type": "comment", "timestamp": 1596812951.0, "datetime": "2020-08-07T15:09:11", "subreddit": "ARFID", "id": "g0oqvsy", "text": "My company used to always get pizza for us. They never ever got any pizza that I would have eaten though. Nothing like eating cold pizza lunchables while everyone else has real pizza. I had to beg for them to get at least one pizza that i would like, so they started getting one. Just one plain pie. I had to Sprint to the breakroom to get one slice because it would disappear in 5 minutes.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1597703840.0, "datetime": "2020-08-17T22:37:20", "subreddit": "ARFID", "id": "g1x6347", "text": "I definitely use weed to help me eat. There are some days when I don't really have an appetite at all unless I smoke and then I get the munchies. It's really saved me. I'm lucky enough to live in a place where it's been legal for a while, and I even work in the cannabis industry. Weed has saved my life a few times now.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1601934139.0, "datetime": "2020-10-05T21:42:19", "subreddit": "ARFID", "id": "g7u1bzz", "text": "The yellow box variety is THE SHIT! I love it so much. They used to make it in the spiral noodle (can't remember what that one's called) but I haven't seen it in my grocery store for ages. Good stuff!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1601934218.0, "datetime": "2020-10-05T21:43:38", "subreddit": "ARFID", "id": "g7u1if3", "text": "A little bit, but less so if you bake it. I love using these noodles for mac and cheese dishes, just throw a bunch of cheese on top and maybe some bread crumbs if you want some crunch, bake it up.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1601953855.0, "datetime": "2020-10-06T03:10:55", "subreddit": "ARFID", "id": "g7v0im1", "text": "Thank you!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1604032564.0, "datetime": "2020-10-30T04:36:04", "subreddit": "ARFID", "id": "gakkkr5", "text": "Yes, my late husband called me \"the bread and cheese girl\". My current partner does not shame me for it and its pretty nice.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1606157111.0, "datetime": "2020-11-23T18:45:11", "subreddit": "ARFID", "id": "gdcu04r", "text": "This year is my 17th Thanksgiving away from my family. I also hate turkey but I make the foods I enjoy on T day and I can actually enjoy the day like everyone else. It feels good! I'm so happy for you.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1620061214.0, "datetime": "2021-05-03T17:00:14", "subreddit": "ARFID", "id": "gwsx1mk", "text": "UGH daily. I like to be very active but without eating, I run out of steam very fast.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1622468800.0, "datetime": "2021-05-31T13:46:40", "subreddit": "ARFID", "id": "h02y0zd", "text": "I think it would be neat to have a pizza thread someday, like if we are on vacation in a new city and we don't know what local pizza joints are \"safe\", we can ask fellow AFRID people! Normies don't like it when you ask them what the consistency of their pizza sauce is like, lol. \n\nBut this is also really cool, I often just opt for the safety of the Hut when I'm in an unfamiliar place.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1623516377.0, "datetime": "2021-06-12T16:46:17", "subreddit": "ARFID", "id": "h1j4fo9", "text": "I hate wasting food so I don't throw it away if I've made something and then I can't eat it. My partner usually will eat it later, and he never shames me for food waste either way. \n\nBut I like to call the partially eaten plates my \"failed attempts at eating\", lol. \n\nI was having a hard time yesterday, I made 3 whole separate meals before I finally just ate a bowl of dry cereal.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1633363513.0, "datetime": "2021-10-04T16:05:13", "subreddit": "ARFID", "id": "hfd4nhk", "text": "Yes! All the time. The thing I do to help this is that I go on my cravings and make tiny portions so that if I suddenly change my mind (which happens ALL the time) then I'm not wasting a lot of food. I can always go get more if I actually feel like I want more. It helps because I will almost always get at least a few bites down, which IMHO is better than zero bites. \n\nSeeds and nuts are great for this, they don't go bad or stale so you can have a little bowl that you're snacking on all day. They are packed with protein which helps to make me feel more full than other snacks like chips or whatever. Also you can usually find whatever flavor you happen to be craving, or leave them plain if you want something bland. I currently have a little ziploc of sunflower seeds and honey roasted peanuts on my desk.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1633621256.0, "datetime": "2021-10-07T15:40:56", "subreddit": "ARFID", "id": "hfqnigv", "text": "I hated doing this. My mom dragged me to a nutritionist who scared me into thinking that I was going to die before I reached 20 because of malnutrition, she shamed me for every thing I wrote (and didn't write) in my food diary. \"Why are you having this at this time? Why would you eat this when you already ate that thing once that day? You know you can't have a healthy life eating only french fries. That's not a meal.\"\n\nAs an adult, I talked to my primary physician and talked to them about my issues. They did bloodwork on me and a bunch of tests, and I was fine. The doctor told me something I'll never forget, she said \"eating junk is healthier for your body than eating NOTHING.\" And that stuck with me. I was starving myself because all I wanted was doritos or french fries or chocolate or pizza. The nutritionist in my head was telling me that it was bad to eat those things, so I just wouldn't eat anything. I don't listen to the nutritionist inside my head anymore and I have a much healthier and happier life for it.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1634222633.0, "datetime": "2021-10-14T14:43:53", "subreddit": "ARFID", "id": "hgm7ddr", "text": "I read a picture book when I was a kid that was a story about a man who meets an alien. They discussed each other's cultures and at the end of the book they enjoyed a meal from each other's home land. The alien's food was just a pill. One pill and it would fill you up like a full plate of dinner would. \n\nMan I was super jealous!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1634397261.0, "datetime": "2021-10-16T15:14:21", "subreddit": "ARFID", "id": "hgv932h", "text": "I wish you could have been my mom. I have horrible memories of sitting around the dinner table staring at my dinner plate like it's Mt. Everest and I have to climb it. \n\nSounds like you've got this handled so please ignore this unsolicited advice if you already know it...But multivitamins are great! Please keep coming here if you have questions or concerns for your little ones. Sounds like you're doing great.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1634416107.0, "datetime": "2021-10-16T20:28:27", "subreddit": "ARFID", "id": "hgwghbd", "text": "My current life is much different, my life partner is very supportive and I'm happy and healthy and no longer speak to my mother.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1640732433.0, "datetime": "2021-12-28T23:00:33", "subreddit": "ARFID", "id": "hqc6cej", "text": "Love to hear it!! If you liked that, try plain tomato sauce (like the 40 cent stuff in the can) for dipping. It can be \\*too\\* plain for me sometimes but some marinara can be too chunky for me so it's a good balance. Marinara is VERY inconsistent though. I used to hoard packets of it when fast food places made a good batch that I liked.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1641606952.0, "datetime": "2022-01-08T01:55:52", "subreddit": "ARFID", "id": "hrq10d0", "text": "I'm aggressive about it. YES, that's it! \n\nI worked at a Subway for a year or two and I got all kinds of different subs. Maybe some of them had ARFID, maybe people are just unique. A couple regulars that stand out in my mind... a dude who got a meatball sub with an excessive amount of mayo on it, and a lady who wanted a turkey sub on white with only tomatoes on it, but she wanted the maters toasted on the sub (usually we put veggies on after toasting) and she wanted the sucker practically burnt! I never ever shamed anyone for their food choices and I made sure to do whatever it was they wanted done to their sub to make it their own special experience. I wish more Subway employees were like me.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1643423787.0, "datetime": "2022-01-29T02:36:27", "subreddit": "ARFID", "id": "huo508y", "text": "I love garlic bread with cheese on it, but as a person with ARFID I totally understand how we all have different things that are safe and things that are not. It's valid for you to not like cheese on your garlic bread and it's valid if you don't like cheese at all. \n\nI'm so sorry that your garlic bread was not safe to eat. I hope that the rest of your meal was enjoyable!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1644527207.0, "datetime": "2022-02-10T21:06:47", "subreddit": "ARFID", "id": "hwf4oxj", "text": "I'm 37 and this is was my work lunch for like, a decade. I haven't had one in  a couple years because I got burned out on them but seeing this makes me want to go and buy one! I even like them cold when I don't even really like regular cooked pizza cold.\n\nBut I used to get made fun of at work for eating these every day. I f'ing LOVE lunchables pizzas!!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1646848265.0, "datetime": "2022-03-09T17:51:05", "subreddit": "ARFID", "id": "hzzymmh", "text": "For me, the worst thing is when you order a grilled cheese and then ask for no pickle garnish and they look at you like you just grew a second head. Or they treat me like I'm stupid and say \"uh. It's a grilled cheese? Those do not come with pickles\". Oh but they do!!! Sometimes they do!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1647275628.0, "datetime": "2022-03-14T16:33:48", "subreddit": "ARFID", "id": "i0mujtd", "text": "I've learned how to tweak recipes to fit my needs. It's not always possible but definitely worth a try!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1648564430.0, "datetime": "2022-03-29T14:33:50", "subreddit": "ARFID", "id": "i2khd0x", "text": "When I was a kid I used to tell people I was a vegetarian to avoid being forced to eat what everyone else was eating, backfired pretty spectacularly because I was offered veggie dishes which none of us like lol", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1665838494.0, "datetime": "2022-10-15T12:54:54", "subreddit": "ARFID", "id": "iset3f2", "text": "This. This is how I finally made peace with my ARFID", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1668001099.0, "datetime": "2022-11-09T13:38:19", "subreddit": "ARFID", "id": "ivoib5p", "text": "Cannabis saved my life! I live in one of the US states that first legalized it (Washington) and we are lucky that prices have been driven down over the years. I'm so sorry it's not legal (yet) where you live and I hope you can find ways around it.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1669250442.0, "datetime": "2022-11-24T00:40:42", "subreddit": "ARFID", "id": "ixk0taf", "text": "I used to, but I enjoy it now. My secret was ditching my toxic family of origin and making a new family that doesn't make fun of me if I only feel like eating bread on Thanksgiving.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1669384677.0, "datetime": "2022-11-25T13:57:57", "subreddit": "ARFID", "id": "ixqbh0j", "text": "I'm an uber eats driver and I feel like a superhero sometimes, delivering food to people who might have ARFID and the only safe food is what I'm delivering.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1674493056.0, "datetime": "2023-01-23T16:57:36", "subreddit": "ARFID", "id": "j5kc1n9", "text": "Tell your doctor I said \"nanny nanny boo boo\".\n\nMy PCP knows what ARFID is and agrees that I probably have it! (Still new PCP to me, still establishing, so haven't officially diagnosed yet). I'm sorry that happened to you.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1674955298.0, "datetime": "2023-01-29T01:21:38", "subreddit": "ARFID", "id": "j6b1574", "text": "I got a peice of gristle in a McDonald's chicken mcnugget 30 years ago and I still can't eat chicken from McDonald's", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1679715258.0, "datetime": "2023-03-25T03:34:18", "subreddit": "ARFID", "id": "jdkxkxg", "text": "My safe food is pepperoni pizza. I've yo-yo'd with my weight but if you try to be active then that helps. But it's really hard to keep at it. I tried running but could only keep it up for a year. I just buy bigger clothes and love my body regardless of how big or small it is. Fed is best, and if I worry about my weight and eat nothing at all then I won't feel good enough to even get out of bed. Eating \"junk\" is still better for your body than eating nothing.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1680537664.0, "datetime": "2023-04-03T16:01:04", "subreddit": "ARFID", "id": "jest80q", "text": "Because to \"normal\" people, food is \\*everything\\*. I literally got the ban hammer from a parenting group because I had the audacity to tell a parent of picky eaters that ARFID was a thing and that it doesn't feel good to be forced to eat things that you don't want to eat. I have a seriously messed up relationship with food as an adult because of the things that were done to me under the guise of \"healthy child rearing\".", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1680537811.0, "datetime": "2023-04-03T16:03:31", "subreddit": "ARFID", "id": "jestl11", "text": "PS, to everyone who is feeling hopeless that they'll find a life partner or friends while having ARFID, there's someone out there who will understand what an eating disorder is and not make you feel bad for it. My current partner knows all of my food quirks and he doesn't get mad at me when I can't eat something because of a weird or stupid reason (when we first started dating he would re-use his plate for my food until I told him that it squicked me out, lol).", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1694879014.0, "datetime": "2023-09-16T15:43:34", "subreddit": "ARFID", "id": "k0ulxya", "text": "I wish I could just click a button and be like \"nah\" and not have to deal with hunger pains for skipping a meal. I also with I could photosynthesize", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1696969735.0, "datetime": "2023-10-10T20:28:55", "subreddit": "ARFID", "id": "k4bom0a", "text": "Thank you for being a good parent. And now I am craving honey nut cheerios!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1700512067.0, "datetime": "2023-11-20T20:27:47", "subreddit": "ARFID", "id": "ka29a8t", "text": "My family is skipping T day this year. But I am the matriarch of my home, and for the last decade I have actually enjoyed the holiday because we just make whatever we want instead of nasty traditional stuff. I make a spiral cut ham that I actually also eat, I eat my Mac and cheese, and of course I go to town on the rolls. But I haven't had anyone make fun of me for that in over a decade, and that's nice. I hope each and every person here can have what I have someday.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1702011223.0, "datetime": "2023-12-08T04:53:43", "subreddit": "ARFID", "id": "kcgpb3f", "text": "I don't eat any fruits or veggies. I take a multi vitamin every day. My doctor knows what's up and says that I'm just fine. Yes, tests have been run. I am just fine even though I don't eat fruits or veggies. Funny how suddenly everyone has a medical degree when you say you don't eat the same way they do.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1702047876.0, "datetime": "2023-12-08T15:04:36", "subreddit": "ARFID", "id": "kcia5fe", "text": "A regular Gummi daily and a probiotic. I'm surprised too, I asked my doctor if I need anything more and I don't.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1702047926.0, "datetime": "2023-12-08T15:05:26", "subreddit": "ARFID", "id": "kcia9r5", "text": "Strange, I haven't eaten a single fruit or veggie in.. well my entire life. And I don't have diarrhea at all. Like sometimes yeah but not constant, not even close.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1702050404.0, "datetime": "2023-12-08T15:46:44", "subreddit": "ARFID", "id": "kcigdsh", "text": "My doctor knows what is going on. I've had plenty of tests. I'm fine. It is actually possible for people to survive without eating the same foods as you do.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1704832367.0, "datetime": "2024-01-09T20:32:47", "subreddit": "ARFID", "id": "kh3reiv", "text": "Ask them about it. It is possible that it's there to show parents an example of what NOT to do. But ask, definitely ask, and make it known that this makes you feel uncomfortable.  If it's not there to show parents an example of what not to do, find another doctor if possible.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1704832763.0, "datetime": "2024-01-09T20:39:23", "subreddit": "ARFID", "id": "kh3sm78", "text": "Yes for me too. I'm trying to have the benefit of the doubt but OP should definitely voice their concerns and proceed according to their reactions.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1704907251.0, "datetime": "2024-01-10T17:20:51", "subreddit": "ARFID", "id": "kh8dpin", "text": "Yes! Doctors can \"mean well\" but if they don't suffer from the affliction they're trying to treat, they don't know what it feels like. If your doctor doesn't have ARFID then she doesn't know what it feels like to have ARFID. People who actually do mean well take constructive criticism well and want to make changes to be a better person. I know I work hard to be a good person, and I'd want to know if I said or did something that wasn't something a good person would do. Nobody ever learns anything if we never speak up about it!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1708441682.0, "datetime": "2024-02-20T15:08:02", "subreddit": "ARFID", "id": "kratrvw", "text": "Yes, I have snipped and cut away people who judge me and tell me what I should and shouldn't eat. \n\nI'm also going through menopause!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1723744529.0, "datetime": "2024-08-15T17:55:29", "subreddit": "ARFID", "id": "li9x6k7", "text": "I think they think we are faking, like they are sitting there feeling like they wish they could just eat pizza and French fries all the time instead of the varieties of healthy food that most people usually eat. \n\nThat has been said to me, anyway. Someone said \"I wish I had an eating disorder like yours so I could just eat whatever I want all the time\". This was during a time when I had a special meal that was more appealing than what everyone else was eating. \n\nThey just don't understand.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1723813398.0, "datetime": "2024-08-16T13:03:18", "subreddit": "ARFID", "id": "lieem6g", "text": "There's SO MANY foods that I'd love to be able to even try, but my arfid makes that very difficult. Steak actually smells really good to me, and barbecue sauce, but I can't stand the texture or taste.\n\nAnd yeah, I also wish they were right, I wish I could just eat whatever I want whenever I want. The act of chewing and swallowing is actually really hard sometimes!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1725025217.0, "datetime": "2024-08-30T13:40:17", "subreddit": "ARFID", "id": "lko5jcb", "text": "This is why I am vague sometimes. If I don't know someone very well I will just say \"I have an eating disorder\" and leave it at that.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1726076415.0, "datetime": "2024-09-11T17:40:15", "subreddit": "ARFID", "id": "lmmxtvz", "text": "Eating the exact same dinner for most nights over the last 25 years", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1726669180.0, "datetime": "2024-09-18T14:19:40", "subreddit": "ARFID", "id": "lnqjrx1", "text": "I think they think we are faking it. I honestly don't know, but that's what I think. They see us eating pizza and French fries when they are eating more healthy and diverse meals. What people like that don't know or understand is that I really wish I could eat like they do, I wish I could just eat food without inspecting it or knowing in advance what the taste and texture is. \n\nThey see us eating the food they wish they could let themselves eat all the time. I've had people even say that to me, \"I wish I could have pizza for dinner every day\" like they think I'm just being indulgent or giving into cravings.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1727020541.0, "datetime": "2024-09-22T15:55:41", "subreddit": "ARFID", "id": "lodmn4z", "text": "I've said this before but I really think that people who hate on our condition just think that we are faking. They see someone who is only eating \"indulgent\" food, food that most normal people only allow themselves to eat on occasion and not all the time. They don't understand that people like us really and honestly just want to be able to eat and nourish our bodies just like everyone else, without feeling stressed or scared about it. They literally just don't understand and they can't wrap their heads around it.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1727557264.0, "datetime": "2024-09-28T21:01:04", "subreddit": "ARFID", "id": "lpea4si", "text": "Not your friend.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1729039544.0, "datetime": "2024-10-16T00:45:44", "subreddit": "ARFID", "id": "ls4nyka", "text": "Thanks, I need it.\n\nI loved the episode with the \"wet pizza\".", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1729556600.0, "datetime": "2024-10-22T00:23:20", "subreddit": "ARFID", "id": "lt3h4qw", "text": "Yes, until none of my safe foods work anymore lol. I'm on vacation now and having a hard time.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1729564373.0, "datetime": "2024-10-22T02:32:53", "subreddit": "ARFID", "id": "lt4251w", "text": "I'm in the airport heading home right now, I'll be able to sleep in my own bed and eat my own food tonight!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1731803102.0, "datetime": "2024-11-17T00:25:02", "subreddit": "ARFID", "id": "lxink7j", "text": "Gregory is the best representation we could ever ask for, and I love that Janine is so understanding! It really makes a world of difference to have a supportive partner.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1732290176.0, "datetime": "2024-11-22T15:42:56", "subreddit": "ARFID", "id": "lyfgqe7", "text": "It took me a while but I finally found one. My partner never ever makes fun of me for what I want to eat or not eat. He helps me find online menus of restaurants before we go. He even helped me plan what to eat when I went to FL by myself with my son! \n\nThey are out there, they are just hard to find. I met my current partner just after I turned 30.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1732664173.0, "datetime": "2024-11-26T23:36:13", "subreddit": "ARFID", "id": "lz5qbe1", "text": "This is my 20th holiday season spent on my own, away from my family of origin. I haven't been teased about what is or isn't on my plate since 2003. This year I'm making a spiral cut ham with my own recipe for the glaze, gouda maple bacon mac and cheese, and three cheese bread rolls made from scratch (with help from my bread machine). I am in charge of all the cooking and it makes me so happy and my family (chosen family) loves everything and sometimes they pitch in with their own dishes (this year it's just me!). \n\nI never thought I'd ever be able  to say this, but I'm actually excited for Thanksgiving! I hope that each and every one of you gets to have a holiday that feels like that someday too.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1734095474.0, "datetime": "2024-12-13T13:11:14", "subreddit": "ARFID", "id": "m1uqjbr", "text": "I'm 40. My pcp knows that arfid exists and thinks I have it from a brief discussion we had about it. She didn't even need convincing, she's like \"yeah that sounds about right\". \n\nDecent doctors are rare but they do exist.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1737125731.0, "datetime": "2025-01-17T14:55:31", "subreddit": "ARFID", "id": "m7mwqxn", "text": "I am annoyed by this too! \n\nI have a fun story that kind of relates... I was on a date a long time ago and I was able to order the kids portion of chicken strips. It came in a cardboard car! Like a kiddie meal. I was embarrassed but we just laughed about it (the date was an old friend).", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1737469415.0, "datetime": "2025-01-21T14:23:35", "subreddit": "ARFID", "id": "m8co5hi", "text": "Yes, sometimes I only have spoons for one thing, either cooking or eating. I used to just order delivery but my partner will cook for me now which is helpful.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1742253142.0, "datetime": "2025-03-17T23:12:22", "subreddit": "ARFID", "id": "mich801", "text": "It looks really good honestly, I don't normally like shell shaped pasta but this looks really cheesy. I also feel really accomplished when I finish a large portion at a restaurant!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1749223886.0, "datetime": "2025-06-06T15:31:26", "subreddit": "ARFID", "id": "mwbyzlv", "text": "My partner was never mean or anything about my arfid but a similar thing happened when he started that med too. He was like \"I understand better now\". I felt like a superhero because I was able to share tips with him about how to manage constant nausea.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1751461516.0, "datetime": "2025-07-02T13:05:16", "subreddit": "ARFID", "id": "n0xpuk6", "text": "My doctor said \"yeah that sounds like arfid\" but never officially diagnosed me. But she's not that great of a doctor, lol.", "parent_id": null, "link_id": null, "context": null}
