{"type": "post", "timestamp": 1617832220.0, "datetime": "2021-04-07T21:50:20", "subreddit": "bulimia", "id": "mmcw0k", "text": "When really my body IS me.\n\nI realised this today in therapy.\n\nI treat my body like a separate entity to my mind, to who I am as a person. But feel like it's the thing that's been letting the team down.\n\nIt's me though.\n\nMy body isn't letting the team down.\n\nI am.\n\nBy doing what I do.\n\nAnyway we are going to work on connecting with my body again in the coming weeks. I'm trying to find love for curvier bodies and hope I can work on bringing some love to mine.\n\nI just wondered if anyone else saw their body as a separate thing too", "title": "I view my body as something separate to 'me'", "context": null}
{"type": "comment", "timestamp": 1617861828.0, "datetime": "2021-04-08T06:03:48", "subreddit": "bulimia", "id": "gts2s7a", "text": "I think it's interesting too and it's great to think different if it helps you. Just for me, it is in the disconnection that I have with my body that I'm finding those problens.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1617861867.0, "datetime": "2021-04-08T06:04:27", "subreddit": "bulimia", "id": "gts2tu3", "text": "Same tbh, but I've really got to try", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1617861946.0, "datetime": "2021-04-08T06:05:46", "subreddit": "bulimia", "id": "gts2xb0", "text": "No idea how to combat it yet but if I find anything else out then I'll share on here!\n\nYeah I think the same, I can see others with larger bodies and appreciate their look and vibe. But I am a lot harsher on myself", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1617863740.0, "datetime": "2021-04-08T06:35:40", "subreddit": "bulimia", "id": "gts51zk", "text": "Hahah I paced about for like an hour after therapy yesterday turning this over in my mind. It's nice to know I'm not online too", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1618767640.0, "datetime": "2021-04-18T17:40:40", "subreddit": "bulimia", "id": "mthh9u", "text": "Otherwise it just feels like wasted calories.\n\nEven if someone cooks it for me. Or if it's the only thing I'll get for ages! I just really have to force it down the bare minimum to be polite.\n\nAnd I'll maybe even feel a bit resentful that I've had to eat a bit of it hahah\n\nMy partner can just eat anything and will always finish his plate, but if it's not it for me I just can't.", "title": "I can't eat something if I don't love/like the taste", "context": null}
{"type": "comment", "timestamp": 1618779650.0, "datetime": "2021-04-18T21:00:50", "subreddit": "bulimia", "id": "gv0bxa8", "text": "Yeah I get so upset with myself if I cook something that is not AMAZING. I've got serious food fatigue atm, with trying to heal and whatnot. Does add unnecessary pressure to eating", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1618779740.0, "datetime": "2021-04-18T21:02:20", "subreddit": "bulimia", "id": "gv0c47r", "text": "Yeah same, or when I'm tired and I cba to cook a perfect meal I resort to unhealthy stuff and treats. Not sure how to work past it, but it probably would be healthy too", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1618779895.0, "datetime": "2021-04-18T21:04:55", "subreddit": "bulimia", "id": "gv0cgar", "text": "Omg! One time I ran out of food and tried binging on condiments... I had a spoonful of straight ketchup and nearly gagged", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1618779940.0, "datetime": "2021-04-18T21:05:40", "subreddit": "bulimia", "id": "gv0cjy7", "text": "I totally totally relate to this so much! I'm lucky people know I'm a picky eater so don't always take it personally if I don't eat", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1618781202.0, "datetime": "2021-04-18T21:26:42", "subreddit": "bulimia", "id": "gv0f7fm", "text": "That's true though! And a good way of trying to look at it at least ❤️", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1618811411.0, "datetime": "2021-04-19T05:50:11", "subreddit": "bulimia", "id": "gv1vj90", "text": "Hahah I love it that people can be so different In their tastes❤️", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1619255407.0, "datetime": "2021-04-24T09:10:07", "subreddit": "bulimia", "id": "gvnwf7d", "text": "Binge eating is a coping mechanism that you use, because you had to figure one out on your own. You were never taught how to cope in a different way, so don't beat yourself up about it. Even about the eating meat (I'm not a meat eater too), it's more than okay to slip up here, not even just because of the ED, but because you are a human being and no human is perfect.\n\nIt's really hard to pull yourself out of a depression, but it will pass. When I'm in this phase I will have a list of 'bare minimum' activities to do, including passions that relax me like art. And then if I have a day that's better I'll commit to doing a bit more like a walk outside, work, etc., But the important thing is that my expectations are realistic and not another thing I can beat myself up about. It's important that you know you are doing the best you can right now, and you will get back to your normal and best self.\n\nCovid makes it all so much harder, but when you're ready throw yourself into making friends. Join a club, find a group hobby, a yoga class or meditation class or something.\n\nI agree with the other commenter that your ex was likely not an end game man.", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1620119536.0, "datetime": "2021-05-04T09:12:16", "subreddit": "bulimia", "id": "n4jx3e", "text": "Because the food ads and deliveroo and Uber eats adverts are literally driving me crazy.\n\nI'm trying not tooo.\n\nMaybe it's the same for gambling addicts too? Like wouldn't that be a nice feature. \n\nLike the adverts already probably know we have issues, they could at least put that to some good use.\n\nLol but they won't.\n\nBecause addiction is good for profit isn't it?\n\nSometimes I used to just scroll through deliveroo and cry feeling like someone had my brain in their hands shaking it really hard", "title": "There should be a way to ban certain types of mobile ads", "context": null}
{"type": "comment", "timestamp": 1620127027.0, "datetime": "2021-05-04T11:17:07", "subreddit": "bulimia", "id": "gww6l5t", "text": "Yessss I agree, that would be amazing", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1620129149.0, "datetime": "2021-05-04T11:52:29", "subreddit": "bulimia", "id": "gww9rdr", "text": "I find weight loss/supplement adverts hard too, and I seem to have loads of these right now. \n\nSo yes I agree they are harmful, but it does feel a smidge dismissive to say that what I'm struggling with isn't actually harmful and is completely fine.\n\nRight now the fast food apps are the adverts that I am finding a challenge because I'm struggling not to b/p atm and I deleted those apps.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1620129197.0, "datetime": "2021-05-04T11:53:17", "subreddit": "bulimia", "id": "gww9u5l", "text": "Yesss I'm getting a lot atm, I wonder if that's also because I deleted fast food apps. It's just never ending hahah", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1620132305.0, "datetime": "2021-05-04T12:45:05", "subreddit": "bulimia", "id": "gwwf5rw", "text": "Yessss same", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1620136260.0, "datetime": "2021-05-04T13:51:00", "subreddit": "bulimia", "id": "gwwn4c8", "text": "Man, it's on my phone. I've only had them deleted since Thursday but it's soo hard.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1620138171.0, "datetime": "2021-05-04T14:22:51", "subreddit": "bulimia", "id": "gwwrisz", "text": "Oh my god, that's great to know. Thank you!!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1620145346.0, "datetime": "2021-05-04T16:22:26", "subreddit": "bulimia", "id": "gwx93p0", "text": "Hahaha this speaks to me. I used to watch YouTube at night and get so spooked", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1620163725.0, "datetime": "2021-05-04T21:28:45", "subreddit": "bulimia", "id": "gwy8ysi", "text": "Are these on mobile? And are they free?", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1620334886.0, "datetime": "2021-05-06T21:01:26", "subreddit": "bulimia", "id": "gx7488l", "text": "Men can be so dumb with this stuff, because he probably thought it wouldn't bother him he said it to you thinking you wouldn't be bothered. But yeah, you have an ED of course that would bother you! You're not wrong for being upset about that, but try to focus on all the good things he has said to you, and not this one bad thing that he didn't even mean.\n\nYou can obviously tell if he is genuinely sorry, and if you're unsure in how he feels about you physically it's okay to ask for reassurance. I'm sure he would want you to feel good about yourself \n\n(And if you think he did do it maliciously that's something else, and you would probably see a pattern of his behaviour doing things like this)", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1620367011.0, "datetime": "2021-05-07T05:56:51", "subreddit": "bulimia", "id": "gx8sbyp", "text": "I think women are awful with it too, I've literally got another post saying this, and thought you'd replied to that... BUT every week there's something like this where the boyfriend has said something hurtful.\n\nIn this case he being dumb with this stuff is a pass, but there are many more men who are clearly verbally abusive and manipulative about their partners eating disorders too. Keep an eye out.\n\nSaying men can be dumb with this stuff is saying they CAN be dumb with this stuff. Not they all are. But just go through this pages history and you will agree with me. Humans can be dumb with this stuff, but so many boyfriends are saying things like this, I'd believe that girlfriends can be dumb with this stuff too, there's just loads more posts from women's perspective. I think you're being a bit too sensitive tbh, it's not an insult on you, just that men CAN be dumb with this stuff.\n\nSorry if it made you feel uncomfortable, but I think you've misinterpreted what I've said a little. Hope you can find this community welcoming.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1620405594.0, "datetime": "2021-05-07T16:39:54", "subreddit": "bulimia", "id": "gxahwnp", "text": "That sucks though if your mum has been negative about it! I can relate to that one too!!\n\nThis community is wonderful. There was actually a documentary done by Freddie Flintoff a UK footballer about bulimia and eating disorders in men in the UK! I keep meaning to watch it and forgetting", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1621233723.0, "datetime": "2021-05-17T06:42:03", "subreddit": "bulimia", "id": "ne8vim", "text": "Maybe it's making it to three days without b/ping\n\nThen only two days\n\nThe four days\n\nThen five days\n\nMaybe (for me at least) it's accepting that right now I will binge so trying to manage that, until I've developed better coping mechanisms and stress relief.\n\nMaybe for me, it's not purging most of the time I binge.\n\nAnd so, batting away the urge to purge more times than not.\n\nMaybe it's not a light switch? On or off?\n\nBut a slow roll down a hill, getting slightly better over time.\n\nProgress isn't linear. It's okay to mess up. Just keep trying ❤️\n\nEdit: but if your progress was an on/off switch then that's great, I'm not trying to invalidate that. This is just my own experience.", "title": "Maybe progress is just slowly having longer and longer spaces between purging each time?", "context": null}
{"type": "comment", "timestamp": 1621250213.0, "datetime": "2021-05-17T11:16:53", "subreddit": "bulimia", "id": "gyfkudz", "text": "Yeah I wasn't meaning to invalidate your experience at all or say this is the only way,  just trying to process how things are going for me in a way that might make sense for others.\n\nI think most people view progress as the on/off way of thinking, and for many that can be alienating. But if that's what worked for you then that's great.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1621279144.0, "datetime": "2021-05-17T19:19:04", "subreddit": "bulimia", "id": "gyhbl13", "text": "I think I have to accept this may be my reality too! I've gone long periods in the past without it, but the sad fact is, we need to eat food, so there's no avoiding the stuff. \n\nI guess the realest part of recovery here is just being kind to ourselves about it.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1621279225.0, "datetime": "2021-05-17T19:20:25", "subreddit": "bulimia", "id": "gyhbrvp", "text": "This is really cool, thank you. It's so true that it's a different path for everyone, and I think I have to accept mine is probably going to be one of management and reduction, and little steps to progress.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1623232375.0, "datetime": "2021-06-09T09:52:55", "subreddit": "bulimia", "id": "h14uxcx", "text": "I'm so sorry. That's such a shit reaction. You deserve empathy and understanding", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1624090059.0, "datetime": "2021-06-19T08:07:39", "subreddit": "bulimia", "id": "h2ayr29", "text": "Its really hard. I had to remove my card deets from my phone and all the apps, and put my partner in charge. But, I still manage to do this too. Its rough", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1624461306.0, "datetime": "2021-06-23T15:15:06", "subreddit": "bulimia", "id": "o6eurf", "text": "I know that ana isn't about motivation or self control and it's also a really shitty life threatening mental illness. \n\nBut I can't help but watch those what I eat in a day ana videos and Google ana tips and Google super thin models.\n\nIt makes me feel like a failure.\n\nAnd then I want to binge. And then I want to purge. And then I want to restrict.\n\nMy partner isn't letting me restrict after I told him it triggers binging, but it's really stressful. But tbh I was never good at that part anyways, I could make it half a day maximum, and then I'd binge.\n\nI can't believe I relapsed 8 months ago by convincing myself to just throw up large meals. I can't believe I went into this so willingly. I'm so annoyed with my self.\n\nI really wouldn't wish this or ana or any eating disorder on anyone else. Its pretty fucked up that I can wish for myself to get better and worse at the same time.", "title": "I know this is shitty, but I wish I could restrict hard like someone with ana", "context": null}
{"type": "comment", "timestamp": 1624463145.0, "datetime": "2021-06-23T15:45:45", "subreddit": "bulimia", "id": "h2s1z4w", "text": "I just want to be thin, basically. For some reason feel like this will solve everything", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1624473871.0, "datetime": "2021-06-23T18:44:31", "subreddit": "bulimia", "id": "h2sqjpn", "text": "Thank you ❤️", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1624473899.0, "datetime": "2021-06-23T18:44:59", "subreddit": "bulimia", "id": "h2sqlpa", "text": "This is exactly how I feel. ❤️", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1624722075.0, "datetime": "2021-06-26T15:41:15", "subreddit": "bulimia", "id": "o8d6pq", "text": "I can be feeling okay and get ready and everything is fine and then I start to deteriorate.\n\nI wanted to dress cute today but now all I want to do is put on a massive potato sack, ideally with a smaller potato sack to cover my face.\n\nI know why, I overate yesterday without purging and had breakfast and lunch today and I'm having a big meal later. So now I'm a troll woman with a huge nose and beady lil beast eyes, and a body like a boulder.\n\nAnd I'm sat on my bed thinking wtf can I wear that will hide my whole body and still look acceptable for seeing people 😭", "title": "Feeling ugly/fat ruins my day", "context": null}
{"type": "comment", "timestamp": 1624722748.0, "datetime": "2021-06-26T15:52:28", "subreddit": "bulimia", "id": "h347i1c", "text": "I need a good go to outfit, I tend to only shop when I'm in a good mood so I forget hahah.\n\nThank you. I know that the people im seeing literally won't care at all, and typing that out has made me feel a bit calmer.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1624949863.0, "datetime": "2021-06-29T06:57:43", "subreddit": "bulimia", "id": "h3exngb", "text": "Yes! I love all bodies, just not mine. Larger women can be so much hotter and so much more confident, and I get jealous of them too", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1624968771.0, "datetime": "2021-06-29T12:12:51", "subreddit": "bulimia", "id": "oa710c", "text": "It doesn't matter if I consume two whole pizzas or just a packet of one thing.\n\nIf I feel out of control, then it is a binge.\n\nIf I can't stop myself, then it is a binge.\n\nJust feel like this needed to be said.\n\nLike, I know normal people will eat a packet of a thing and be a bit guilty, but if I inhaled it while my brain wasn't present then it is not the same as enjoying it as a treat.\n\nIt is all relative.\n\nLike when I'm healthy I can eat that much and it not be a binge. Idk. I'm just venting", "title": "'but that's not a BINGE' If I feel like I couldn't stop myself before and during then it is a binge to me, okay?", "context": null}
{"type": "comment", "timestamp": 1624977191.0, "datetime": "2021-06-29T14:33:11", "subreddit": "bulimia", "id": "h3fyma4", "text": "I'm glad! I kept feeling that I'd binged and telling my partner and he'd be like... That wasn't a binge. So I googled some shit and figured it out for myself. It definitely helps because it's so different to just eating food", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1624977226.0, "datetime": "2021-06-29T14:33:46", "subreddit": "bulimia", "id": "h3fyoxk", "text": "Its exactly the same for me! I know when I'm being cheeky and having a bit more, and when I'm out of control", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1625035047.0, "datetime": "2021-06-30T06:37:27", "subreddit": "bulimia", "id": "h3j7wwq", "text": "I'm trying really hard not to super restrict atm, intermittent fasting is banned in my house since I came clean to my partner 🥲. But I am still trying to diet and lose weight so I need to count calories. It's tough, but restriction does make my binges way worse, and that is a pretty good thing to learn tbh", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1625086292.0, "datetime": "2021-06-30T20:51:32", "subreddit": "bulimia", "id": "ob6aer", "text": "I've actually lost weight this year, but not when the bulimia has been at it's worst again I was completely stagnant for ages. But, I only mention that as I've been trying hard not to eat any big meals for bulimia and healthy weight loss reasons.\n\nAnd I had a whole big meal and I enjoyed it. Enjoyed each bite. Ate a bit too much.\n\nThen did a small amount of gardening with the other half.\n\nAnd watched breaking bad.\n\nAnd the thought did enter my mind but I batted it away! \n\nFeel good about it.", "title": "I ate a big meal (as a choice not a binge) and I didn't purge after!", "context": null}
{"type": "comment", "timestamp": 1625140305.0, "datetime": "2021-07-01T11:51:45", "subreddit": "bulimia", "id": "h3o86rx", "text": "He's clearly got no understanding of bulimia at all.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1625170144.0, "datetime": "2021-07-01T20:09:04", "subreddit": "bulimia", "id": "h3q0htr", "text": "I definitely relate to that term! It makes so much sense for me.", "parent_id": null, "link_id": null, "context": null}
