{"type": "comment", "timestamp": 1653867269.0, "datetime": "2022-05-29T23:34:29", "subreddit": "ARFID", "id": "iahf7ng", "text": "Hey.. have you ever been tested for OCD? Contamination OCD is quite common, acts like this, and ARFID certainly aligns with it.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1653878890.0, "datetime": "2022-05-30T02:48:10", "subreddit": "ARFID", "id": "iai1koo", "text": "Definitely sounds like contamination ocd! I have OCD so I'm very familiar. Can you talk to a psych?", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1712381591.0, "datetime": "2024-04-06T05:33:11", "subreddit": "ARFID", "id": "kyaa4kc", "text": "It's annoying as hell to be looking up resources and only finding things for parents trying to help their children - especially since a lot of the advice is genuinely bad. Don't hide things in my food, people.\n\nThat said, I've found some of the kids-based information to be really good. There's a paediatric dietitian here who does reviews of Australian supermarket stuff, clearly for families and kids, but the information and the alternatives she gives are REALLY useful for me to explore safe food options.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1718127674.0, "datetime": "2024-06-11T17:41:14", "subreddit": "ARFID", "id": "l85arr9", "text": "Here's a question for you. Would you be happy being pressured to go out to a restaurant if all you could eat there, instead of dinner, was bread? If everything else on the menu was effectively poisoned and you knew this?\n\nIf you want your friend to be happy going out with you, find venues they can eat at, or places that have options like buffets or food courts. It's otherwise often a stressful thing to find time to eat beforehand to then sit in a restaurant being pressured to try things or to buy things you can't enjoy.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1721654305.0, "datetime": "2024-07-22T13:18:25", "subreddit": "ARFID", "id": "ledkrpc", "text": "Hey, that's fine too! You're at a different place with your ARFID. Perhaps one day you'll work up to these sorts of things; it's certainly a different process for all of us, isn't it?", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1721654491.0, "datetime": "2024-07-22T13:21:31", "subreddit": "ARFID", "id": "ledl8kd", "text": "I wouldn't shame people for their food choices. Not all of us here have the specific facet where our food can't touch, or to this extent. If you yell this sort of thing at folk posting here, they might start being anxious about something they're not currently avoidant of, or they might no longer wish to post here because they feel excluded.\n\nBetter to celebrate the wins of finding a decent plate of food and being able to handle foods touching, hey?", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1721691627.0, "datetime": "2024-07-22T23:40:27", "subreddit": "ARFID", "id": "legp0je", "text": "This is an ED support forum, not /r/pics.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1724954131.0, "datetime": "2024-08-29T17:55:31", "subreddit": "ARFID", "id": "lkjfz46", "text": "I like one soup. Heinz tomato soup. It's cheap, it's completely smooth, and it's close to my other safe foods. I like it with naan especially, because naan doesn't leave bits in the soup.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1726758975.0, "datetime": "2024-09-19T15:16:15", "subreddit": "ARFID", "id": "lnwpep6", "text": "For your future reference, the way you can verify these sorts of links is by searching up the institutions in question and seeing if the info they're using is valid. You can also look up the survey site and see what sort of things it permits/if it's commonly used for this sort of research. If truly concerned, you can contact the institution via its usual contact emails and see if you can verify it that way.\n\nResearch is SO important for learning more about our ED and how we might be able to improve, and the payment incentives are VERY normal. I've done a bunch of digital research studies/surveys for another disorder; the payments funded my first PC. I'm also signed up to do physical research in my city, which also pays.\n\nI get being sceptical, but we can verify these things!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1728558110.0, "datetime": "2024-10-10T11:01:50", "subreddit": "ARFID", "id": "lr8fdwg", "text": "Holy shit, this might be what happened to me. I had some very mild OCD-like symptoms as a child, but one day I *very* suddenly went from being a relatively normal child to having pretty severe ARFID. Went undiagnosed, obviously, but my parents were distressed at their child suddenly no longer being able to eat 99% of things.\n\nWe've always assumed something bad happened at pre-school that I can't remember, but this might legitimately be the real explanation.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1728562021.0, "datetime": "2024-10-10T12:07:01", "subreddit": "ARFID", "id": "lr8n3ly", "text": "Yeah, I'm gonna have to look into this a little more and chat to my medical team around all of this. My parents have long felt guilty for the place they sent me potentially triggering this -- the place was awful for many reasons, so this was just one more thing that had them pull me out. If it's just my lifelong chronic illnesses kicking in, well.. that'll take something off them, I hope.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1729005590.0, "datetime": "2024-10-15T15:19:50", "subreddit": "ARFID", "id": "ls1ttiv", "text": "Hey, I work in a corporate environment and used to travel frequently for work. This frequently involved nights out with clients at restaurants and the like.\n\nRaise this with your HR. You have a medical condition that impacts the food you can eat; provide HR with a small list of safe foods and advise them that you'll be happy to work around this where possible if your restrictions are too severe. \n\nFor your coworkers - I promise you, all you need to do is say it's because of a medical condition. If they pry, say you'd rather not go into it. If they get arsey about it, go to HR - this is also why we tell HR about these things.\n\nWith my ARFID, I can get away with having chips, pizza, and chicken in most forms. This allows me a lot of leeway over nights out. That being said, I have ended up at restaurants where I haven't been able to eat what's offered, and conferences where my needs weren't communicated. Often the wait staff will be able to accommodate you with small requests so that you can still participate in the night (e.g. bread rolls, drinks, the like), and in a corporate environment, you can get away with \"oh, it's this medical thing, it's no problem - I wish I could enjoy it like you do!\" and then direct the conversation away from your food. \n\nYou can do this. The people in your office will get used to you. They have to get used to Kathy having the most god awful eggy fishy salad every day and John eating with his mouth open; they can easily tolerate you having the same possibly odd lunch every day.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1731192854.0, "datetime": "2024-11-09T22:54:14", "subreddit": "ARFID", "id": "lwbng32", "text": "Ugh, too often. I keep crackers around to make sure I can always make myself eat something in these situations, because otherwise I get migraines. Fortunately, the impending threat of migraine is enough to make my brain accept crackers, and that usually lets me do something else beyond them after that.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1732656246.0, "datetime": "2024-11-26T21:24:06", "subreddit": "ARFID", "id": "lz52hyt", "text": "Same age as you, not autistic or ADHD. I preempt the bullshit comments by submitting paperwork to HR on this ED and if anyone comments, I mention that HR are already aware and are accommodating my disorder. Stops any BS comments in their tracks because you don't want to get on HR's bad side.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1733465219.0, "datetime": "2024-12-06T06:06:59", "subreddit": "ARFID", "id": "m0o379b", "text": "If she's experiencing acid reflux and the like, then in addition to all the rest of the responses here, have you tried explaining acid reflux and these sort of reactions to her? If you can explain it and convince her to take a med that helps, you might be able to ask her to try one of her previous safe foods again (especially if it's bread) as you can explain that the medicine should make it less scary.\n\nIt's not guaranteed, but this helped me a lot when I was ill as a kid. Knowing that food was only temporarily illegal meant I could keep my safe foods easier.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1733880022.0, "datetime": "2024-12-11T01:20:22", "subreddit": "ARFID", "id": "m1ge0fy", "text": "I am absolutely in love with this app, thank you so much! It's helping me figure out things to try.\n\nWhat I don't like is that when I mark something as \"try\", I can't see it on the main page anymore! Would we potentially be able to get that showing up there too?\n\nAlso - the messaging around restrict vs dislike is confusing to me. I'm allergic to banana but cannot eat, say, burgers. Do they both go in restrict? So far I've been putting stuff I don't like but could theoretically eat in Dislike, and stuff I can't eat in Restrict, but I'd love to differentiate the \"I will experience awful negative reactions if I try this\" from the \"I just cannot eat this under any circumstance\".", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1734418894.0, "datetime": "2024-12-17T07:01:34", "subreddit": "ARFID", "id": "m2glhl5", "text": "Could also investigate SPD. I've heard it's another of the family of disorders that's commonly comorbid with ARFID. That might have more answers for you?", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1735015253.0, "datetime": "2024-12-24T04:40:53", "subreddit": "ARFID", "id": "m3jsbip", "text": "Disagree on this one, actually. Things like coffee, beer, tea - there are literally thousands of different ways of making these sorts of drinks across countless different countries. You genuinely might find one you like one day - IF and only IF YOU WANT TO TRY UNTIL YOU FIND THAT ONE, which you & OP don't. It took me a looooong time before I could do so. I now have very specific coffee drinks I like because they aren't bitter at all. You might think all coffee is bitter at the moment because you've never had the super sweet nonbitter ones, and that's totally ok! You don't need to find a coffee you like!\n\nThe egregious thing is when folk won't accept that you don't want to try it. That's fucking annoying! ARFID is so hard to try new stuff with, I'm not going to fight it just because some twat in a café wants me to do so. Let us stick to the hot chocolate, jeez.\n\n(I actually learnt to like some coffee because after much discussion, a twink in a specialist coffee place carefully went through a tonne of coffee shots until he found one I didn't immediately hate and then we sweetened it until it worked. Very voluntary process. Wouldn't recommend it unless you're having a really good day.)", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1735021527.0, "datetime": "2024-12-24T06:25:27", "subreddit": "ARFID", "id": "m3k4ds9", "text": "Absolutely! But it's important to remember that coffee is a category and not one thing. It's not universally bitter, nor the same in.. pretty much any way other than it being a drink. I can't eat vegetables, but chips, crisps, and hash browns are OK despite potato being a vegetable. I hate most coffee, but iced mochas are a great occasional treat for me. Same diff.\n\nI want to emphasise this because it's such a big thing with ARFID especially - nixing entire categories of food or drink because we just cannot do them. You don't do coffee, that's fine! But don't forget that it varies an absolutely massive amount for if you're ever feeling like working on expanding the safe drinks list - or safe foods, for that matter. Chocolate cake frequently has coffee in it, and I know for me when I see an unsafe food in something, it can be a showstopper... so hopefully knowing that coffee manifests in a shit tonne of ways turns that into \"okay, why is there coffee in the cake what does it taste like\" instead of \"the cake is now illegal\".", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1735053261.0, "datetime": "2024-12-24T15:14:21", "subreddit": "ARFID", "id": "m3lp89d", "text": "Oh yeah 100%, I do the same. Either I say the minimum or I give them a specific one and go \"yeah this is literally the only one that doesn't make me gag\".", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1735077964.0, "datetime": "2024-12-24T22:06:04", "subreddit": "ARFID", "id": "m3nmiv4", "text": "Hell yeah! Have a great xmas full of all the hot drinks you fancy haha", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1735697110.0, "datetime": "2025-01-01T02:05:10", "subreddit": "ARFID", "id": "m4sfbnm", "text": "Are you in school or at work? Take the phone number to HR or your school admin and ask if they recognise it as you've received harassing texts. Also take the number to your parents.\n\nAdditionally, google the number and put it into social media sites like Facebook or Discord, that can often tell you who the owner is.\n\nIf you can identify the owner and they're at work or school with you, report them for harassment and discrimination. If they're not and they're a family member or something, tell your parents and their parents that this twat has started to harass you.\n\nIf you can't identify the number, block it and move on. You might be tempted to send them something back - I wouldn't, even if you find out who they are. Just pretend you never saw it.\n\nBullies thrive on reactions. They enjoy knowing they got to cause pain. Give them nothing and if you're ever asked about it, pretend you didn't get anything... and then go to HR/admin/parents directly after they admit it.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1735919671.0, "datetime": "2025-01-03T15:54:31", "subreddit": "ARFID", "id": "m574vjc", "text": "Yes!!! I'll note that it's rough for those that have the fun combo of mental shenanigans where they can't make themselves eat. ARFID's a big part of that, but other stuff can contribute.\n\nIf that's the boat anyone reading this is in: talk to your GP, there are medications and non-medication techniques that professionals can guide you to that may assist. Also, try alarms, try grazing (having food to casually graze on as you do other stuff), and try liquids (because they should be easily sippable while you're doing stuff).\n\nI hope everyone reading this can eat today. ❤️ Or drink, or do anything you can to hit the minimum cals you should be hitting.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1735920604.0, "datetime": "2025-01-03T16:10:04", "subreddit": "ARFID", "id": "m577vby", "text": "Yeah, I wish someone had stepped in sooner to offer you kinder solutions over feeling awful every time you tried :') I'm so glad you're at least finding support now.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1735920815.0, "datetime": "2025-01-03T16:13:35", "subreddit": "ARFID", "id": "m578jtr", "text": "Strong avoidance and aversive. I used to not be able to eat a lot of crisps, despite their status as a safe food, because I was worried they'd cut my mouth.\n\n... Writing that has made me realise that the fucking things DID cut my mouth yesterday! I bit down wrong on a crisp and it stabbed where I'm missing a tooth, and I've been wondering today why that area feels injured. Well, at least that shows I've made a lot of progress on handling that one specific case.\n\nETA: I've suspected restrictive in the past, but a lot of those issues were actually motivation issues stemming from deficiencies and other disorders, so that's mostly sorted and not part of ARFID for me.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1738323300.0, "datetime": "2025-01-31T11:35:00", "subreddit": "ARFID", "id": "ma6gmj4", "text": "Wooo!!! I'm so proud!!\n\nYou can experiment with making your own ice lollies if you fancy, too. My mum told me recently that the ones we used to make as a kid were done with strained blended fruits & milk, so they were actually pretty healthy - and I always just thought they were frozen juice. You might find some joy in this!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1738683540.0, "datetime": "2025-02-04T15:39:00", "subreddit": "ARFID", "id": "maxqh0i", "text": "Send her a screenshot of the side effects of some of the stronger medical treatments out there. Sometimes, to survive, we have to do things that aren't necessarily the best for our bodies. ARFID has some treatments, sure, but we need to eat before we can even consider tackling those!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1739792604.0, "datetime": "2025-02-17T11:43:24", "subreddit": "ARFID", "id": "md8f5rd", "text": "Pitaya is actually [made by](https://www.reddit.com/r/ARFID/comments/16veum4/i_made_an_app_for_people_with_arfid/) someone here! /u/Konopielko did a great job with it, I've been tracking some food chaining progress in it. I've not heard of the other one you're trying!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1739855746.0, "datetime": "2025-02-18T05:15:46", "subreddit": "ARFID", "id": "mddsd2p", "text": "No, it's this: https://arfid.app/\nThis page has links to where to get it!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1739939642.0, "datetime": "2025-02-19T04:34:02", "subreddit": "ARFID", "id": "mdk8n53", "text": "I've explained it to a few doctors, but the best discussion I had was with my dermatologist. They'd had an inpatient with ARFID and the hospital had been educated on ARFID due to them, so when he found out I had it, we had a really good conversation. Apparently most folk hadn't heard of it in the medical community until the past few years, but knowledge has been rapidly spreading in the last 2 years in Australia. We're also seeing more mainstream news articles.\n\nI'm really hopeful that with more activism and more prevalent knowledge, our struggles become more well known and we start to see progress in treatment!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1740271951.0, "datetime": "2025-02-23T00:52:31", "subreddit": "ARFID", "id": "me9hdat", "text": "Because that's not how every type of ARFID works, we can't just do that. They clearly could tell something was wrong with it, and learning what exactly was both a betrayal of trust and confirmation that the food was Wrong.\n\nIt's an eating disorder, not pickiness.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1740272512.0, "datetime": "2025-02-23T01:01:52", "subreddit": "ARFID", "id": "me9j0fa", "text": "You don't have to have a gag reaction to not be able to eat something, my dude. Your brain can just consider it unacceptable to continue, and you can be unable to do so. There's more than 1 type of ARFID and they all manifest differently.\n\nWhile OP could probably try and work up to having that as a safe food, tricking someone into eating something can be really awful for actually helping ARFID in a tonne of cases, too. So the parents might have just ruined any chance of that with their BS too.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1740620484.0, "datetime": "2025-02-27T01:41:24", "subreddit": "ARFID", "id": "mezvuyy", "text": "\"I have an eating disorder that limits what I can eat. Please check with me if catering is provided so I can be sure I'll be able to eat something at the event or prior to it.\"\n\nIt's usually as simple as this.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1740996343.0, "datetime": "2025-03-03T10:05:43", "subreddit": "ARFID", "id": "mfrb6t1", "text": "Oh, they think a medical condition is offensive? Ask them if they think cancer sufferers are offensive to hairdressers, or if someone using a wheelchair is offensive to runners.\n\nThey're not a friend if they think badly of you. You aren't obligated to respond politely, and you shouldn't. Point out how offensive it is and walk away, for a more polite response.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1741399665.0, "datetime": "2025-03-08T02:07:45", "subreddit": "ARFID", "id": "mgm9d5p", "text": "Please go to the hospital immediately. Do you have a way to get there? You need IMMEDIATE help.\n\nETA: We talked on a post of yours a week ago. You have rapidly gotten worse since then. Your parents are abusive and irrelevant to you; if it were up to them, they'd be burying you and claiming it's your fault.\n\nGo to the hospital. Now.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1743989369.0, "datetime": "2025-04-07T01:29:29", "subreddit": "ARFID", "id": "mlsm03i", "text": "1.5k a month?! Bloody Nora!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1748940533.0, "datetime": "2025-06-03T08:48:53", "subreddit": "ARFID", "id": "mvqkjah", "text": "Thank you!!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1750957769.0, "datetime": "2025-06-26T17:09:29", "subreddit": "ARFID", "id": "mzwybqq", "text": "Been in corporate for a while. This should have gone to HR a LONG time ago. You need to go to HR with a formal letter of complaint as you're being discriminated against and receiving hostile behaviour for having a medical condition. You also need to look up employment law in your area and see how well the law covers you. Here in Australia, they would be in deep shit for this.\n\nFrom there, you keep raising complaints to HR. If HR does nothing or makes light of your complaints, go above their heads to their bosses. If you keep getting shit, refer back to those laws and see if you can chat to an employment lawyer or union organiser etc. Your doctor might also have some advice on people to talk to.\n\nYou should also check the laws around recording in your area. If it's one party consent, start recording as evidence. If it's two party, stop, pull out your phone, state \"This conversation is being recorded. Would you care to repeat your comment about my medical condition?\" Keep doing similar, too. Either grey rock them, or very bluntly ask them to repeat themselves or say something like \"I didn't realise my medical condition was open for discussion.\"\n\nIf you want backup here, post on ask a manager. If they try it in front of the client, politely ask that your medical condition please not be discussed. If they continue, apologise to the client for the discourtesy and LEAVE. \n\nIf nothing gets better? Quit. Talk to some legal advice first, though.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1750957936.0, "datetime": "2025-06-26T17:12:16", "subreddit": "ARFID", "id": "mzwyxvp", "text": "Ah, also, for the dinner: investigate the restaurant and see what you can eat. If you can't do anything there, call the restaurant and explain the situation. They may be able to work with you. If they can't, order something relatively cheap and slowly fiddle with it; when you see others being done and discussions wind down, pop to the bathroom and see if a waiter can take the dish away while you're up.", "parent_id": null, "link_id": null, "context": null}
