{"type": "comment", "timestamp": 1596622613.0, "datetime": "2020-08-05T10:16:53", "subreddit": "EatingDisorders", "id": "g0fgny9", "text": "beautifully stated!!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1597777822.0, "datetime": "2020-08-18T19:10:22", "subreddit": "EatingDisorders", "id": "g20pt5v", "text": "that's really creative! I also wonder if watching a movie together while eating would be a good idea. I don't know how this all would resolve in the end, if what we are suggesting is actually helpful, but i would think it's worth trying.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1598104276.0, "datetime": "2020-08-22T13:51:16", "subreddit": "EatingDisorders", "id": "g2gtzjk", "text": "I Agree - this is bigger than her Dad and his toxicity - there are rights and abuse laws. Please, PLEASE talk to her guidance counselor - even on an anonymous basis. Drop a note off in the counselor's office, or call a non-emergency police line. They all know how to help with a reportable abuse situation. If you care about your friend, you can help save her life. If she is upset at you, it's always worth it to be safe -- ED's are the most fatal mental illness in existence.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1598146437.0, "datetime": "2020-08-23T01:33:57", "subreddit": "EatingDisorders", "id": "g2jhdzx", "text": "YES! OP, I really didn't mean to imply that you would be not-caring if you did not act - this is very, very tricky, to say the least. I'm behind you 100%. Thanks u/Amysea for clarifying this for me.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1598872268.0, "datetime": "2020-08-31T11:11:08", "subreddit": "EatingDisorders", "id": "g3gd4je", "text": "Check out Poshmark online for many options of gently used clothing; a wash is all it takes to be in great shape, just make sure you wait to buy things of super high value until you are at your set point -- which will happen when you can eat without restricting, to your point of satiety (you'll get stronger at reading hunger cues as time goes on), and there is a plateau on your weight in terms of you noting that clothing isn't getting tighter. If you are weighed by an MD or your RD, that's best - please don't weigh yourself at home.\n\nRecovery is costly, but so worth it.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1604310489.0, "datetime": "2020-11-02T09:48:09", "subreddit": "EatingDisorders", "id": "gavsmp8", "text": "If you have been at an unhealthy weight (too thin), one strategy is to remember that if you suddenly were feeling \"thin enough\", ED would be incredibly pervasive (aka, winning, hardcore) -- in other words: that voice of \"ugh\" is really Ed saying \"Ugh. I want to go back to being in charge.\"\n\nDon't let him/it/them win!!!\n\nAnd: you said you're an athlete or on a team...people who have to perform like that NEED their strength and are basically bad asses that use everything they get in terms of calories and nutrition. \n\nBless you, OP - you're on the best track possible!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1608732077.0, "datetime": "2020-12-23T14:01:17", "subreddit": "EatingDisorders", "id": "ggsph6n", "text": "I recommend seeking inpatient treatment. It really, really will be the most helpful thing to get you out of this mental loop.  It's extremely difficult to recover on your own, and the things you are saying really are so far gone. I understand you are already trying hard, and that is awesome - but you need support. This is bigger than you are, just as it has been for me. Hugs.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1610018768.0, "datetime": "2021-01-07T11:26:08", "subreddit": "EatingDisorders", "id": "gieysrn", "text": "It's my understanding from my own journey that - in order to truly be free - you have to see weight loss and anything other than very light exercise as \"your poison\". Just like some people can have salt at any level in their diet, a person with extremely high BP would not be able to have salt as it's like poison to their system (let's pretend that BP medication were not an option). \nAnorexia has no drug or medication to cure it, so the danger is that you get too close to the fire and will get burned again. \nMost crucial: have you clearly told your MD that you have AN in your history?  You have to be very clear about this, and very honest. If you've done that, then this doctor is extremely out of line to even suggest that you lose weight.\nMy guess is that they don't know your history; you have to keep in mind that all doctors *typically* see is problems with obesity. By far, that's the greater concern than being underweight.  They are used to giving people well-intentioned advice to ensure that they don't go overboard on weight gain. Trust me: YOU ARE NOT THAT PERSON! In other words, based on what you said here - you simply are not at all in danger of being overweight to the detriment of your health, but you can be certain that employing weight loss strategies would be playing Russian Roulette - and most likely, the odds would be stacked against you, I'm afraid.\nPlease talk to your MD sincerely; it is worth it to be open, and if she has not given it importance, get a new doctor ASAP.  Wishing you so much strength, OP!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1611434993.0, "datetime": "2021-01-23T20:49:53", "subreddit": "EatingDisorders", "id": "gkfypca", "text": "Agree on all the other wise comments here, and wanted to mainly say: this dude would leave for any of the problems that Future You would have. It's not the anorexia...it's him. \nIt's okay - not everyone is equipped to be an adult! But there is someone wonderful for you, who will love and appreciate you as you are, will be, or could be. Things are never perfect in any relationship; your own struggle is this ED, but every human has a struggle.Ed's just happen to be more evident on the outside (not always) - so people judge. But never you mind! You are going to be so much stronger, happier and truly ready to live life if you give treatment a true chance. Try your best - take advantage of every single program and moment.  Believe me - you  have so many reasons  to recover. \nPS: It's always possible that the person isn't totally accurate in your BF's plans - it seems odd that they would know his plans, unless you guys are very  young in age-- in which case, it may be even better to be free of any relationships that could weigh you down. Also: you may feel like ED's make you feel lighter or more free, but you are dragging around a huge ball and chain. If you are willing to trust the process, you're going to be feeling light as a feather - free   and full of hope. Not perfect, but so much better.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1616070033.0, "datetime": "2021-03-18T12:20:33", "subreddit": "EatingDisorders", "id": "grchn29", "text": "I am so sorry, OP. I can see that your wife is not well, and while I am not an MD, I am an adult who has struggled with severe restrictive AN for about 16 years. About 3 years ago, almost, my fam. did an intervention - I was at a gravely low weight, and they were honestly fearful for my life. I myself am not sure how I did not collapse or die. It was like a miracle that I lived, but my only \"good\" factor was that I still ate, even though it was every 2.5-3 days, and I also grew up perfectly healthy with regard to food/etc. My marriage was the cause of the stress that I believe opened the ED path for me. The \"gun\", as they say, was loaded, but my stressful marriage which has been emotionally abusive, was the trigger. In your wife's case, there is something that she is struggling to deal with, and this ED has become a coping tool. (I say \"ED\", but that really needs an MD diagnosis). These things are possible hallmarks of EDs:\n\n* Denial, refusal to see a problem;\n* eating strange things, strange combo's, serious extreme flavor methods like vast amounts of salt or pepper, burning foods is not uncommon; for ex, I ate a lot of dark chocolate powder on everything.\n* souping food: adding water to foods to make it go further\n* overexercise, refusal to take a break day, refusal to miss routine to the point that if someone were to be rushed to the hospital for an accident, the ED'd person would still complete their workout before caring for the person that fell ill. (just an example)\n* missing out on all meal opportunities with people\n* ritualizing food\n* angry, irritable\n* no periods  (BUT a period is still possible if people have AN or any ED).\n* binge-eating, throwing up are possible (bulimic behaviors)\n* insanely angry if someone raises the concern; total denial\n* feels they are in jeopardy of being overweight, flabby, or \"still have to get their \\[name a body part\\] in better shape\".\n\nOP, you are not responsible, nor are your circumstances; this is a MENTAL illness. Likewise, your use of the word \"choosing\" is misguided, with all due respect; she cannot quit this alone, it's bigger than she is. Help is needed. You're not required to stay married to her, but if you are willing to support her in any capactiy, your gift could save her life.\n\nPlease contact any of the resources provided on this link:\n\n[https://www.nationaleatingdisorders.org/help-support/contact-helpline](https://www.nationaleatingdisorders.org/help-support/contact-helpline)", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1616491542.0, "datetime": "2021-03-23T09:25:42", "subreddit": "EatingDisorders", "id": "grwsk6i", "text": "Beautifully stated. Thank you for this comment!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1616491744.0, "datetime": "2021-03-23T09:29:04", "subreddit": "EatingDisorders", "id": "grwsrcl", "text": "I think the advice offered is so sound, but my one thought is that you may need support -- whether it's a person you see professionally, or just a mentor at school, or perhaps in church or another place that you feel has people of like mind and values.\nI think you are being so strong, but also very hard on yourself! I admire your resolve against the demon known as ED, but you are doing SO well -- to be this staunchly against any potential relapse means you are kicking the butt of ED! And that is to be celebrated -- now be confident, and yes, be cautious - but talk to people who can give you perspective. There HAS to be someone who isn't all about \"are you relapsing!?\" -- \nOn the other hand: if you think there is a kernel of truth in their concerns, be willing to think about what moderation in exercise - even dance - will be like for you, and set some boundaries. It's so hard, but you can do this. You are incredibly brave.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1616671920.0, "datetime": "2021-03-25T11:32:00", "subreddit": "EatingDisorders", "id": "gs5q1js", "text": "OP, I am really sorry you went through this. It's so deflating, and she should be proud of you - expressly so. If she had trouble reconciling the fact that you'd be potentially fixated on numbers, she could have said it really objectively. \"OP, that's awesome that you are drinking more water - what an accomplishment, considering you were so into DC for so long. YAY! Let me just mention that there CAN be a potential caveat if using metrics that provide specific data like your bottle: they can sometimes  re-ignite those tendencies to focus solely on numbers, which can build rigidity. I have no problem and am in fact proud of you for this development, and I trust you to  be balanced. Great job.\"", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1619889545.0, "datetime": "2021-05-01T17:19:05", "subreddit": "EatingDisorders", "id": "gwk8vzm", "text": "Excellent advice; OP, if you live on campus, it's just a requirement like being required to pay for parking if you own a car. It's not to control you, but simply because they would be irresponsible to not infer that your living on campus dictates the necessity of food availability. Without a reliable grocery store right near your housing, they cannot presume you'd have access to food. It would be hard for them to explain, if something happened to you, how they ignored your not purchasing a meal plan. \nAlso, it's likely required for insurance (insurance that protects the school/liability).  \nhttp://www.collegecounselorservices.com/faq/do-college-students-have-to-purchase-meal-plans/", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1624646213.0, "datetime": "2021-06-25T18:36:53", "subreddit": "EatingDisorders", "id": "h30vnsw", "text": "Eating disorders are hallmarked by denial, vehement and strong opposition to help, and most of all, the belief that everything is a-ok. They are not in themselves a form of \"health choice\". ED's are a symptom of a much larger psychological problem, which truly, none of us can diagnose, as you said. The truth is: if he is behaving differently on a trend, getting more extreme, continuing to lose, and is unable to self-reflect in realistic manner-- there's a problem.\nOne of the first methods to recognizing EDs is actually via friends and family, who know the person, their habits, and their norms.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1624646504.0, "datetime": "2021-06-25T18:41:44", "subreddit": "EatingDisorders", "id": "h30wb4s", "text": "OP, you are a wonderful and caring SO. It does sound very concerning, and it's more common than ever for men to have EDs (in case anyone thinks it's still not likely or typical). There are so many resources for help, but the real issue is breaking past the defensiveness to have him see an MD. \nIt would be wonderful if you could just have him agree to see an internist who specializes in ED treatment as well, and have them give him a general evaluation. By doing this, it helps to have someone medically trained that can provide actual data to support what they see.\nIf by some amazing possibility he is NOT diagnosed with one, then no harm, no foul. He's healthy - terrific. But, my senses - all based on your own knowledge and love for him - show me that something is very wrong.\nYou cannot make or force a person to get help when they have an ED, but you can definitely support them and value them-- and see if you can help them understand how valuable they truly are. \nIt doesn't matter if a person is 85 when they develop an ED -- life is worth living without it. It's a journey, but worth it. <3 hugs\nhttps://www.nationaleatingdisorders.org/", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1625262975.0, "datetime": "2021-07-02T21:56:15", "subreddit": "EatingDisorders", "id": "h3uut9n", "text": "Hey OP, you are SO brave and so honest. Keep this up! You actually are slaying this process, even though it seems like it's herculean. You are able to conquer this beast, and you have all the right tools. I love how honest you are about your desire to lie, but you still did not - that is awesome. (And ED's are known to be totally lie-driven, so you are not unusual! You just win a war every time you opt for honesty, and that is commendable.) Also, I love that you are practical and go for things like P's \"You Pick Two\" - that is a great choice. I can't comment on things like caloric needs, but the fact that you will MAKE yourself try -- is HUGE. Keep trucking, don't let anything hurt or stop you. And yes, ITA with everyone else - you are not going to be IVC'd, for many reasons IMO...you have a healthy view of reality, for one, and that is remarkable. \nYou deserve help; please, please take advantage of any/all resources, and don't be afraid to be picky. Find a team that works hard to get you to a healthier place, and by that, I mean gives you all the support you need to leave this thing in the dust. You're amazing.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1629099445.0, "datetime": "2021-08-16T07:37:25", "subreddit": "EatingDisorders", "id": "h94q2eh", "text": "It's not uncommon, at least IME. I went to a place in Arizona that is very well-known, and they took my only book away, and it was a book on hiring people in the \"I-generation\"..(meaning: this was a very, very non-ED-related book. It was a book my boss had asked us all to read).\nTheir comments to me were:\n- We want you to focus on recovery -- and they HAD given all patients a GIANT bag full of books that were to help us with our treatment and recovery. (actually pretty decent books, too.)", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1629193702.0, "datetime": "2021-08-17T09:48:22", "subreddit": "EatingDisorders", "id": "h99rdlb", "text": "yes!!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1629460504.0, "datetime": "2021-08-20T11:55:04", "subreddit": "EatingDisorders", "id": "h9ngepe", "text": "It's so hard, and you did something so, so brave. We've mostly all been in a similar shoe, if we are part of this sub. I remember vividly that my husband got mad when I told him I wanted to suddenly be a vegetarian. It's not that he's against that in the least, but it was part of a bigger picture of me eating less and less, and him not knowing how to handle it. It took me 14 years to get help, so please know that you can definitely benefit from getting help sooner!  \nDon't allow anyone to shame you or make you feel that you are to blame. This is an ED, it's a mental illness. You didn't ask for it, you cannot \"wish\" it into happening. She doesn't understand these things, but in time, she may. I believe that she is having an initial reaction, but soon, she will see how very hard this is and hopefully, develop some empathy.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1635003681.0, "datetime": "2021-10-23T15:41:21", "subreddit": "EatingDisorders", "id": "hhr0qlp", "text": "OP, I truly understand your feelings.\n1. I was dx'd at age 30.\n2. I could not - for the life of me - attribute how ED was related to any issues of \"control\"; I had a beautiful childhood with a wonderful family, faith and all my needs met. No idea why the ED found me...except that my grandma, sister, niece and - to some degree my brother - all have EDs or ED-issues.  My sister and niece were full-on.\n\nWhile I believe in heredity's role, the truth is, I could not figure out why I am so \"fat-phobic\". I can look at someone who others may criticize as \"overweight\", and see nothing but beauty and grace in them. But - in myself - I simply cannot stand the idea of having to gain weight or becoming \"average\". I will never understand that, after having made it to age 30 and never thinking twice about this matter. (I had no problem ever - unless you count the few times growing up that I wanted to look better in a bikini, or admired some model, or whatnot. It was not an issue, and I would never, ever \"Diet\". I found diets so sad.)\n\nBUT: as it turns out, here I am. 17 years of restrictive anorexia. I have received treatment, and like you, I thought \"what could I learn or understand that I don't ALREADY know? I can write a book on nutrition, proper serving sizes, the idea that \"restriction makes you obsess\", \"secrets keep you sick\" and all the other things we learn in recovery.\nProblem is: you've got a real problem.\n\n- You don't want to gain weight, so you restrict all week and BP on the weekends. How is this actually working for you?...it seems like it sucks, from what I'm reading.  \n----> So let's say you actually follow the plan of an RD, that you deem \"restrictive\" because they won't let you eat 10 bowls of cereal or whatever you prefer.  How is their role in teaching you to try and eat more often, more reasonably, ANYWHERE as restrictive as you \"restricting all week\"?\nI don't deny that you have this feeling, and I understand what you feel.  You basically want carte blanche to eat all of anything and everything, and somehow not gain weight, and somehow not feel limited.\n\nThere is no such thing. You will either eat all you want, and gain the weight. Or, you will learn to eat reasonably, and eventually \"settle\" at a weight that is right for you*.\n*BY \"eat reasonably\" - and I speak from experience - meal plans for recovery can be as high as six-thousand calories. Eventually, that much food will make you feel extremely uncomfortable and to maintain, your body and mind will naturally desire that you stop eating at the amount that is RIGHT for your body.\nBut, to get to that point, you do have to eat a LOT.  No treatment center is going to put you on a diet when recovering from RAN. If that's what you have. (along with BP.)", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1639235823.0, "datetime": "2021-12-11T15:17:03", "subreddit": "EatingDisorders", "id": "ho4mrxh", "text": "I think that in time, you will be desensitized to this, because it will become so commonplace. It's still new right now, but like a lot of other negative visuals that can spike your ED thoughts, it's going to be something you will conquer. There isn't always a sunny resolution - ED's are such that we have to deal with 'triggers' for life, because we can't escape food, body image messages, other unhealthy people, and stress, which creates the need to cope.  \n\nIt helps to remember that everyone is on a different path. Someone in the world may struggle with their weight in the opposite direction, and for them, these calorie facts are something that help them stay on track. Or maybe not.  But try to keep your eyes physically and mentally on your own needs/plate requirements. EVERYONE is going to be at a different place, and they will talk about it - diets, healthy/unhealthy eating habits, etc.  The best thing you can do is confront this little by little and keep track of all the wins you're having. (\"win\" = eating the best way to defy your ED, and to stay strong. Even if you feel a little sad after, you still won. Keep up the great work, OP!!)", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1640934806.0, "datetime": "2021-12-31T07:13:26", "subreddit": "EatingDisorders", "id": "hqnmf45", "text": "There is nothing weird about your feelings, OP. They are so normal when it comes to having an ED; no one really understands these things unless they've dealt firsthand with one.\nI would recommend reframing your thinking as much as possible; remember how different you both are in size/shape. Even if you both were the same size, her needs would be different from yours depending on factors that I can't begin to list because they all vary. \nIf you aren't already, can you check into seeing an RD to help you ensure you are eating enough? maybe hearing from a professional would help solidify your own need to feel ok about eating what is right for you. \nYour own recovery comes first; that is before any other relationship, since life (your own ability to live/thrive) is essential to be in relationships. If she does not understand, there are many resources that help support those in relationships with others who live with EDs. Youtube has a ton of videos, along with NEDA (www.nationaleatingdisorders.org) to help people understand the most common issues surrounding EDs.\nHang in there, don't stop fighting.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1666864063.0, "datetime": "2022-10-27T09:47:43", "subreddit": "EatingDisorders", "id": "itywr2n", "text": "OP you are an angel of a friend!\nMaybe you can advise her that the kitchen is open 24/7 - and tell her that you are happy to let her graze on her own OR, if she prefers, you can prep and serve food instead.  \nWhat I mean is: I myself, as a person recovering from RAN, would rather be able to grab stuff to eat knowing that no one is really observing me. I still struggle with \"eating in front of people is embarrassing\", so knowing that my hostess will go to bed and not feel compelled to sit there while I eat a snack makes me happy. There probably are lots of other points of view, of course, but count me in as another vote for \"ask\" or \"talk to her\".\nThere are also good things to have on hand that are safe and easy...like:\n- cut-up melon or refreshing fruit that she likes (in fridge);\n- jar of PB and honey + fresh apples on counter or in reach\n- yogurt in fridge\n- hard boiled eggs (not everyone loves these, but a lot do) ready to go, etc.\n\nAlso, when around her, try not to focus on food, topics of food, what you're planning to make for the holidays, what you take to work to eat...just let it all be dormant in her presence so she isn't struggling IMO. It's so hard b/c food is a big part of every single aspect of life (we know!) - but now is not the time to try and change her patterns of thinking. It's about making her comfy.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1676545099.0, "datetime": "2023-02-16T10:58:19", "subreddit": "EatingDisorders", "id": "j8r6qeo", "text": "Sometimes people are trying to be helpful and they notice a TEENCY difference - I mean TEENCY - and they are like \"WWWOW, OMG!!\" -- just because they think that it makes you feel better to hear that you look \"Great\"!  \nTrust me - this happens all the time. Don't stop what you are doing. You will always be in the driver's seat, as long as you don't give in to what \"ED\" Wants. (Opposite actions are always a good approach - do/think the opposite of what evil eff-er ED says to do/think.)", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1679702073.0, "datetime": "2023-03-24T23:54:33", "subreddit": "EatingDisorders", "id": "jdk6bfb", "text": "Exactly! statistically, EDs are comparable in mortality to Cancer; Anorexia is the #1 killer of ALL mental illnesses.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1679702281.0, "datetime": "2023-03-24T23:58:01", "subreddit": "EatingDisorders", "id": "jdk6rxd", "text": "The legal ramifications of OP being so ill is why they refuse to treat. It’s equivalent to sending a stage IV cancer patient to a Walgreens Clinic for treatment. They are NOT equipped to effectively address the level of severity.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1679702436.0, "datetime": "2023-03-25T00:00:36", "subreddit": "EatingDisorders", "id": "jdk74di", "text": "I agree-Only 1 place in the entire US would take me inpatient that *wasn’t* critical hospital care. I went and am so much better now. Not cured but so grateful for the progress", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1679719510.0, "datetime": "2023-03-25T04:45:10", "subreddit": "EatingDisorders", "id": "jdl4tv0", "text": "Agree!! 👏🏼", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1682252838.0, "datetime": "2023-04-23T12:27:18", "subreddit": "EatingDisorders", "id": "jhdvon6", "text": "What are you doing, correcting someone's interpretation of the word \"fired\"? This is not the Work forum. Why do you care how this person has chosen to say that she released her therapist...bizarre.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1682253931.0, "datetime": "2023-04-23T12:45:31", "subreddit": "EatingDisorders", "id": "jhdxigl", "text": "Your feelings are real, and in my experience, a lack of respect for my Therapist would make it more likely for me to reject their opinions, even if not consciously.  A therapist that I find amiable (regardless of what range of directness I may find preferable) would likely be someone I consider talented in their field. Therefore, yes, I would want to do right by them, if that makes sense. (I'm a pleaser, surprise!)\nBut the thing to remember is:\n- EDs that worsen will eventually preclude your mind from thinking properly, so in some sense, therapists are the ones who have to uphold reality.If the T got off to a solid start with the client, the client should ultimately trust their T.  \n- Saying \"just eat\" is poor because it reflects a sense of being tired of you/the person with the ED. It just hearkens to a parent trying to tell their kid \"Just behave.\"  -- what does \"just eat\" mean?  \n1. \"OP, sticking with your meal plan will definitely help you start to see things more clearly. I promise you are not remotely at risk of gaining endless weight, and you know that I promised you I would be honest with you.\"\n2. \"Let's talk strategies about how you would feel more likely to eat; can you find a person to eat your meals with? When you see them eating normally, it will remind you that eating normally is not equal to weight gain. Watch how they eat - they just do it without thinking. That is our goal for you.  Someday, you will get there and it really will be easy to just...eat.\"\n\n^^ Those are comments that I could say are more powerful to ME, but that's just my opinion. \nBTW, anytime people say \"just (anything)\", it's always when there is a herculean task involved.  \"Just go to sleep\" (to an insomniac or a fussy child).  \"Just get off my case.\" (when you are super angry and not likely to drop the issue)  \"Just study harder\".  \n\nI hope you don't feel alone in your feelings, OP. They are not \"right\" or \"wrong\", they just are.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1683537330.0, "datetime": "2023-05-08T09:15:30", "subreddit": "EatingDisorders", "id": "jjbd4dz", "text": "solidarity <3", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1689174152.0, "datetime": "2023-07-12T15:02:32", "subreddit": "EatingDisorders", "id": "jrodfi5", "text": "Nothing is worth your life; bills, pets, jobs…your feelings are happening because you are realizing how risky this is. Please consider calling NEDA: \n\nBusiness Phone Number: (212) 575-6200\nEmail: info@NationalEatingDisorders.org\n\nMailing Address: \nNational Eating Disorders Association\n333 Mamaroneck Avenue, Suite 214\nWhite Plains, NY 10605\n\nOur office hours are 9:00 AM to 5:00 PM (ET). If the office is closed at the time of your call, please leave a message and someone will return your call as soon as possible.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1689174379.0, "datetime": "2023-07-12T15:06:19", "subreddit": "EatingDisorders", "id": "jrodzp1", "text": "Refeeding syndrome is life-threatening; a plan that is professionally provided is the only way to ensure you do this healthfully. Inpatient and residential trx are one-stop shopping to get all the support and drs who are experts in EDs. General practitioners are not usually experts, which is why they simplify to phrases like “just eat”.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1690616133.0, "datetime": "2023-07-29T07:35:33", "subreddit": "EatingDisorders", "id": "jtwxmjx", "text": "This entire scenario is all too familiar and easy to picture. I can see it now. I am so sorry, OP. LOTS of people are \"tiny\" because of reasons we could not possibly list in their entirety. As much as you/we all believe people can see our ED, the truth is, they have no idea. Any one of us could have cancer, a hyper-thyroid issue or dozens of other medical maladies. Still: It's up to us to set appropriate boundaries, since we cannot control what others say.  \n\nI agree with just about all the advice in this thread; you owe NO explanations, but people like these will be taken aback when you choose to abandon any shame, because there is NONE to be had. Anything from \"Your comment strikes me as incredibly personal; may I take your order for the meal now?\"  to \"Thanks. I have an illness.\"...or even *blank stare* \n\nWhatever you do, we are with you in spirit. This goes for all of us here.  Never be ashamed, because shame is where our sicknesses fester. (Bonus: these situations have taught me to watch myself and never judge others-- and to try and derail conversations if I hear people asking or commenting on things like bodies/food, etc)", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1693759149.0, "datetime": "2023-09-03T16:39:09", "subreddit": "EatingDisorders", "id": "jyyuq58", "text": "My understanding is that restricting only worsens obsession with food. The other thing I can say is that you may want to journal your food intake and try to see what you were feeling as you ate. Trying to eat your food sitting down at the table, no other distractions, and thinking of what your food tastes like...can help. Then, logging how you feel after - are you still hungry, are you full, are you somewhere in between. Then, think of the fact that you are GOING to need to eat again - which means both bingeing and restricting are less powerful IMO. (Bingeing gets powerful because you are doing it mindlessly, not thinking about how you'll feel after - Restricting is super powerful when it comes to obsessing on food, because you are thinking that you may not eat again for a long time.  By realizing that you are promising yourself you can eat again in 4-6 hours - you hopefully take the power away from these two fears.)", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1693829756.0, "datetime": "2023-09-04T12:15:56", "subreddit": "EatingDisorders", "id": "jz335u5", "text": "I agree totally with your view on journaling. I think I meant to say what you said - doing 'check-ins' with mindful and self-compassionate thinking.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1700854145.0, "datetime": "2023-11-24T19:29:05", "subreddit": "EatingDisorders", "id": "kalnn0z", "text": "The comment to which you are replying may not have been very empathetic, but to interpret that it’s only applicable to AN is not accurate. All eating disorders involve a troubled relationship with food, and those who binge are just as bothered by the presence of massive food celebrations as those who restrict.\nTo say someone is ignorant when they make a reference to eating disordered people being uncomfortable with Thanksgiving meals is akin to saying it would be a giant leap to presume that most people reading this sub have a baseline level of internet familiarity.  It’s not silly or ignorant to presume that, and in the same vein, people with EDs - no matter the diagnosis- are facing an enemy to some degree when food is the central focus of an event.\nI think this sub is meant to be supportive, and even if a comment is incorrect, it seems unnecessarily harsh to say “you’re so ignorant “.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1714245357.0, "datetime": "2024-04-27T19:15:57", "subreddit": "EatingDisorders", "id": "l1jg8dl", "text": "You are a blessing to me, to all of us. This post is so moving, and I rarely feel like I can cry over a post. This one got me. I'm so proud of you for being aware and resolving to get better again. You can do this. You have a beautiful baby girl that needs you. <3", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1732902034.0, "datetime": "2024-11-29T17:40:34", "subreddit": "EatingDisorders", "id": "lzl5z6e", "text": "It is always okay to eat the cheeseball and rolls alone, lol! I know that it's hard, but, the best thing we can do is give it our best. It's okay to enjoy what you might like the best, and try to focus on the company (if possible, lol).", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1734431923.0, "datetime": "2024-12-17T10:38:43", "subreddit": "EatingDisorders", "id": "m2h51em", "text": "This is way out of our territory for advice; you need to get professional help, probably through IV/tubing to help you stabilize, then progress into residential treatment. Denver acute is one that takes almost all cases, and they aren't going to make you get sick/throw up.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1734809847.0, "datetime": "2024-12-21T19:37:27", "subreddit": "EatingDisorders", "id": "m36hhnf", "text": "same - weird! I hate that gum now, and won't even buy it. I still occasionally chew gum, but a pack lasts me many days. I also find it gross, so it's not exactly tempting. (I do like it for keeping mouth not-dry and for breath, but I do it sparingly.)", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1742284542.0, "datetime": "2025-03-18T07:55:42", "subreddit": "EatingDisorders", "id": "miei96i", "text": "\"Secrets keep you sick\".  That old adage is a way of remembering how ED's thrive in secret. When you don't keep them secret, then you at least have a better chance of something/someone making an impact that will push you to recover. When you start hiding and living in secret, you give the ED a LOT of power. \n\nPlease get help, as it will only get worse and we all know where \"worse\" leads....", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1743929245.0, "datetime": "2025-04-06T08:47:25", "subreddit": "EatingDisorders", "id": "mlo7r50", "text": "How long has she had this ED? I ask because the longer it is, the more difficult it is to break. However: I had severe AN for over thirteen years, all after turning thirty y/o. My family did an intervention, and I took the treatment. While I'm not at all free of behaviors, I engaged completely into treatment for the sake of \"at least I can say I've tried\". The great thing is, I gained the weight and did the work, and it was truly lifesaving. Am I fully healed? no, but that is greatly due to the many years it has been so much a part of me. I hate this, but STILL: I am so, so much better than I was. I eat regularly, have a wonderful, chaotically busy FT job, and life is just so much better. I am praying for your sister. \n\nMy family consulted a professional interventionist, and they worked on the plan together, wrote letters, and it was very, very loving. I am so grateful. Please don't  let her just 'go' without trying. It DOES work, even if it's not perfect. If you do nothing, it is surely going to be a death sentence.  (The psychotic things she says are a result of being malnourished; it will never be the same until she is refed. She can't do this on her own, it could compromise her health. She will never, ever just \"decide\" to recover, unless she is one of the handful of miraculous people in the history of mankind to do this. )\n\nI am now 50, but the intervention happened when I was 44. I was old and independent, and it still worked for me.  It can work for her.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1743947778.0, "datetime": "2025-04-06T13:56:18", "subreddit": "EatingDisorders", "id": "mlp71oe", "text": "Hugs coming your way; yes, there is hope, and you’re so not alone. It’s astounding to realize how many are silently struggling. Healing happens when we stop feeling shame and stop protecting the ED in silence. \n\nYou have a lot of life ahead; it’s never too late!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1745397455.0, "datetime": "2025-04-23T08:37:35", "subreddit": "EatingDisorders", "id": "mokrt7h", "text": "Agree 100%. I see this almost like when people are struggling with dementia, or have a severe loss of reality. We might soothe them if they say things that make no sense, and this is similar. I can't imagine saying 'oh yes, you are so very skinny', but just reminding her that she deserves to eat and is the thinnest she can possibly be.  When I received treatment, there is truth to the feeling of being told \"you MUST eat, you are desperately in need of food, there is simply no further you can go\".  The mind sees it as 'permission' to eat. If you leave any wiggle room, such as \"you did good today\" (if they eat a cracker, for example), then their brain will read that as \"you ate enough, in fact you ate too much. Scale back.\"\n\nYou have to overemphasize the need to eat, but also not seem shaming or as i they are causing you/others to be displeased. It's so tricky.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1745748722.0, "datetime": "2025-04-27T10:12:02", "subreddit": "EatingDisorders", "id": "mpagpl6", "text": "So many good thoughts and replies on both sides, but here is my own POV. I had untreated AN for the entirety of 13 years before my family intervened formally and I took the help. When I got to the residential setting, there were so many crazy dramatic things happening; people were so far beyond my understanding of 'normal life', and I felt sure that my sheltered mother would hate that I was there...being exposed to 'rough' life. (I was 44 BTW). I would tell my H. that \"if people knew what I'm seeing, what I'm hearing, and how they treat us, they would want me out ASAP.' - Truthfully, that was the ED finding the proverbial 'hair in the soup'. \n\nNo, there is no treatment program that will ever be perfect. Quite a few tech staff at my program were awful to us. I wasn't allowed to rest even when we had 2 hours of sleep only; I wasn't allowed to be happy if staff were upset, as they would just glare and be rude. They would be snippy, rub my face in the fact that I needed to take the supplement (which was in addition to huge meal plan), be sarcastic, pick favorites, and more. \n\n  \nIt still was the best option available, however. No other place would take me, and this place - for all its flaws - still made a major impact for the better.  It's the lesser of the greatest evil - no help at all, and eventual death.\n\nWhy are the attending staff at Res treatment centers so awful? they are burnt out, sick of ED lying/manipulating, and they themselves may not fully understand how EDs are. In addition, the requisite measures to break down the power of an ED are often necessarily draconian. The tiniest bit of wiggle room will turn into a highway of enabling. Those who are starving cannot make logical decisions that threaten their propensity to starve. Once a person is refed and restored to a livable weight, only then can they start to be trusted to make decisions for themselves.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1750408402.0, "datetime": "2025-06-20T08:33:22", "subreddit": "EatingDisorders", "id": "mys1l2c", "text": "Excellent advice.", "parent_id": null, "link_id": null, "context": null}
