{"type": "post", "timestamp": 1625118198.0, "datetime": "2021-07-01T05:43:18", "subreddit": "ARFID", "id": "obf95j", "text": "", "title": "Anyone else relate?", "context": null}
{"type": "comment", "timestamp": 1625203790.0, "datetime": "2021-07-02T05:29:50", "subreddit": "ARFID", "id": "h3rtbb5", "text": "I love chicken from Red Robin and Dairy Queen, but absolutely nowhere else.", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1641755773.0, "datetime": "2022-01-09T19:16:13", "subreddit": "ARFID", "id": "rzz1vm", "text": "As with a lot of us, I have a plethora of comorbidities. Autism, ADHD, generalized anxiety disorder, possibly depression...\n\nBut never, EVER, for any of those have I received the same level of vitriolic hatred I get about my ARFID.\n\nI am extremely open about all my diagnoses. They're in my bio on every website I'm on, including my Tiktok account which also has a video explaining that ovaltine chocolate milk is my most important safe-food and is basically carrying the team when it comes to getting a liveable amount of nutrients into my body. I eventually ended up privating that video. Why? Because *people were weaponizing it*. When I'd get into a disagreement with someone, they'd look through my profile, find that video, then go back to wherever I said something that pissed them off and reply along the lines of \"I hope you become allergic to chocolate milk.\"\n\n...I don't think I need to explain to other ARFID people everything that's wrong with that.\n\nMay I mention, this wasn't a one-off asshole; this happened multiple times to the point of privating the video because it just wasn't worth it anymore.\n\nBut the absolute worst tend to be the militant vegans. You know the type- meat is murder, abolish the meat industry, everyone should be vegan, all of that. Sometimes I try to educate them on why veganism isn't feasible for people like me, and today I got quite the doozy in response:\n\n>We need to continue factory farming animals because you will have panic attacks without access to cheap meat? r/unpopularopinion \\- you deserve panic attacks.\n\nI've had several other militant vegans come at me for my stances, but this is the first time I've been explicitly told I deserve the suffering. I've been overlooked as collateral damage to save the animals, I've been told \"just go get treatment it's not that hard\", but I've never had one of these people so blatantly wish harm on me. But something that is consistent with these types of people is the aforementioned viewing me as collateral damage. Not caring if I die, if it gets their goal met. I tell them I'd literally die of starvation if I cut the meat products from my diet, and I get told \"too bad\". Implying that my life is meaningless, not worth saving, because I have a crippling disorder.\n\nThere was also a post on r/unpopularopinion a while back where someone said adult picky eaters deserve to be publicly shamed. If someone said what they said in that post about people with autism or something, they would have been *crucified*. The post would have been removed and everyone would've been calling it what it is: ableism.\n\nFor all the disorders I have, ARFID is the only one I've explicitly had harm wished upon me for. People want me *dead* for my ARFID. People want me publicly shamed, people want me in pain, people want me to suffer for existing with this condition. In a way I've never experienced with any other disorder I have.\n\nSo, why does no one ever talk about that? Does mental health not matter when it's a disorder no one's heard of? Does mental health not matter when it's us?", "title": "Ableism against ARFID", "context": null}
{"type": "comment", "timestamp": 1641760753.0, "datetime": "2022-01-09T20:39:13", "subreddit": "ARFID", "id": "hrynsyg", "text": "Oh my god the \"how could you not like X?!?!\" is so annoying. I always heard it about pizza growing up, since apparently ALL kids should like pizza. I forgive that though, since it was just annoying and also the people asking were usually kids, who don't know better and have no filter. What bothers me is when grown adults do it.\n\nAnd I think something a lot of people don't realize with your chocolate shard situation is the obsession with \"contamination\" that some people with ARFID have. It doesn't matter if you remove the chocolate, brain will still say \"ew there's 3 molecules of chocolate left in there the whole icecream is contaminated\" and not let them eat it. Foods touching other foods used to be a HUGE no-no for me, I wouldn't eat something if I saw a non-safe food touch it. I'm a lot better with that now, but not everyone is so lucky. I wish people understood.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1641762871.0, "datetime": "2022-01-09T21:14:31", "subreddit": "ARFID", "id": "hryttt1", "text": "I'm gonna lean towards \"misunderstanding of the definition of veganism\"- I could explain how severe ARFID is in detail, but then I just get responses like the \"you deserve the panic attacks\" guy. These people are more than ignorant, they're batty.\n\nAlso props to you on managing to make a vegan lifestyle work with ARFID, I really admire that. More power to you!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1641763833.0, "datetime": "2022-01-09T21:30:33", "subreddit": "ARFID", "id": "hrywg3o", "text": "I've noticed some people are making this comment section mostly about veganism. Though bastardized vegan ideas do contribute heavily, the point of this post was not solely calling out vegans but just how intense ableism against ARFID is as a whole.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1641764631.0, "datetime": "2022-01-09T21:43:51", "subreddit": "ARFID", "id": "hryyqcr", "text": "ARFID being a neurological condition makes sense, considering it often overlaps with autism. It also explains why people with ARFID tend to be much harder to treat than people with other EDs, being more likely to need feeding tubes and stuff. It's hard to rewire the brain.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1641766003.0, "datetime": "2022-01-09T22:06:43", "subreddit": "ARFID", "id": "hrz2kvs", "text": "Completely agreed.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1641771250.0, "datetime": "2022-01-09T23:34:10", "subreddit": "ARFID", "id": "hrzgvfs", "text": "My college did an \"inclusive\" program for people from marginalized groups, including the disabled and neurodivergent. They weren't as \"inclusive\" with those subjects as they thought they were. Most of those stories are for another day, but one of them was that there were mandatory weekly lunch events. WHY?! WHY DID IT HAVE TO BE LUNCHES?! WHY DID IT HAVE TO BE MANDATORY?!\n\nI explained my disorder to them and asked to be excused from those lunches, and they said they'd negotiate it with me in a private meeting. That private meeting never came. I quit the program.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1641818858.0, "datetime": "2022-01-10T12:47:38", "subreddit": "ARFID", "id": "hs21b04", "text": "See, you get it. As soon as it’s about food people become 10x more horrible. \n\nThank you for sticking up for your husband and being supportive.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1641855907.0, "datetime": "2022-01-10T23:05:07", "subreddit": "ARFID", "id": "hs4ong8", "text": "You sound like an amazing ally. We need more people like you. Thank you so much. :) <3", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1642007080.0, "datetime": "2022-01-12T17:04:40", "subreddit": "ARFID", "id": "hsdb99m", "text": "My problem wasn’t so much about being forced to eat- there was no rule against just sitting there and not eating- but having to be around other people’s food is super triggering for me. The smell gets me. I never eat with other people, even when I’m hungry.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1642046213.0, "datetime": "2022-01-13T03:56:53", "subreddit": "ARFID", "id": "hsfzom2", "text": "Oh my god I get the passive aggressive \"i hope you get the help you need to stop murdering\" one all the damn time. It's infuriating. It's patronizing and backhanded as all hell.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1642050822.0, "datetime": "2022-01-13T05:13:42", "subreddit": "ARFID", "id": "hsg8r2e", "text": "> and they just diminish this horrible struggle i’ve dealt with my entire life because they physically can not comprehend that not everyone eats what they do for flavor.\n\nYep.\n\nI’ve gotten people telling me “think about the REAL victim” after I tell them all about my struggles with food. But oh, they said “I don’t mean to be insensitive” so I guess it’s fine and not dismissive at all /s\n\nAlso tried educating a guy on my struggles with food, and the whole time while he was playing armchair specialist with me he continued to say to other people that eating meat is about “gluttony” and nothing else. As though I wasn’t explaining to him just minutes before why it’s survival, not gluttony.\n\nI also had someone tell me he “finds it hard to believe” that I can’t eat any of the 80,000 vegan options there are, as though 1. I hadn’t stated previously that I can only eat 8 foods TOTAL and 2. There aren’t WAY weirder disorders out there.\n\nAnd a few days ago someone got banned from this very sub for telling me to “stop being dramatic” when I said I would literally die if I went vegan.\n\nThese are all examples from the past week. And in most of these conversations I got downvoted to oblivion just for advocating for my own health.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1642051862.0, "datetime": "2022-01-13T05:31:02", "subreddit": "ARFID", "id": "hsganey", "text": "I’ve been told this before. I usually just grumble in agreement because I don’t feel like explaining and looking stupid, but I *know* they’re wrong.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1642051999.0, "datetime": "2022-01-13T05:33:19", "subreddit": "ARFID", "id": "hsgaw6e", "text": "Strange how they can watch anorexia victims starve themselves to conform to society’s standards, but the moment someone is starving themself for a reason other than conforming to society’s shitty beauty standards and giving in to societal gaslighting and conditioning, suddenly people just don’t starve themselves.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1643354234.0, "datetime": "2022-01-28T07:17:14", "subreddit": "ARFID", "id": "hujz027", "text": "I usually only eat 1 meal a day. If I get hungry enough to need a second meal, I get irrationally angry with my body. \"Come on, we already did this today, we have to go through it AGAIN??\"", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1644100947.0, "datetime": "2022-02-05T22:42:27", "subreddit": "ARFID", "id": "hvr0lbv", "text": "I have the same problem.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1644109974.0, "datetime": "2022-02-06T01:12:54", "subreddit": "ARFID", "id": "hvrke8x", "text": "Screw the Jetsons pill. I want to be genetically modified to photosynthesize like a plant. Quick and easy.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1644110015.0, "datetime": "2022-02-06T01:13:35", "subreddit": "ARFID", "id": "hvrkh9v", "text": "Welcome to the club! It's really sad how unknown this condition is, that so many of us spend so long not knowing what our deal is.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1644616372.0, "datetime": "2022-02-11T21:52:52", "subreddit": "ARFID", "id": "hwk9bim", "text": "The way people (esp doctors) get super careful about talking about weight with me once they find out I have an ED.\n\nLike, it's good intentioned, thanks, but I don't care about weight I just have a crippling fear of food", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1644635384.0, "datetime": "2022-02-12T03:09:44", "subreddit": "ARFID", "id": "hwlhgcz", "text": "If you get help, make sure you go to someone who specializes in eating disorders. General doctors don't know what they're talking about when it comes to ARFID, but I've had good experience with every professional who actually specialized in eating disorders.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1644635509.0, "datetime": "2022-02-12T03:11:49", "subreddit": "ARFID", "id": "hwlhprx", "text": "Have you been going to eating disorder specialists? I noticed I started making a lot more progress on getting my diagnosis when I reached out to therapists, psychiatrists, etc who specialized specifically in eating disorders, whereas I was completely brushed off by my general doctor.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1644635572.0, "datetime": "2022-02-12T03:12:52", "subreddit": "ARFID", "id": "hwlhukh", "text": "That's valid, but personally I don't like using the term \"disordered eating\" for myself because it feels trivializing. As though my problems aren't severe enough to be called a disorder. That's just me though.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1644635608.0, "datetime": "2022-02-12T03:13:28", "subreddit": "ARFID", "id": "hwlhxc4", "text": "That really sucks. :( I wish you all the best.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1654198622.0, "datetime": "2022-06-02T19:37:02", "subreddit": "ARFID", "id": "iay6dex", "text": "In their eyes, it does do them harm… by inconveniencing them. They’ll mention that it makes it hard to take their loved one out to eat, the extra effort of accommodating them, etc.\n\nThey’re so lacking in empathy that they believe that their mild inconvenience is more important an issue to address than the severe psychological suffering of the one actually afflicted, and so entitled that any inconvenience to them is a crime worth endlessly chastising.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1657046138.0, "datetime": "2022-07-05T18:35:38", "subreddit": "ARFID", "id": "iez3hyn", "text": "No lie, I am literally known as \"the bread goblin\" in my town", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1657105850.0, "datetime": "2022-07-06T11:10:50", "subreddit": "ARFID", "id": "vsngu9", "text": "", "title": "Me IRL", "context": null}
{"type": "post", "timestamp": 1657454822.0, "datetime": "2022-07-10T12:07:02", "subreddit": "ARFID", "id": "vvq3af", "text": "I'm honestly really pissed.\n\nThe idea that only children are picky eaters and that ARFID symptoms are somehow \"childish\" is not only blatantly false, but actively *harmful*. I can't even count the number of times I've seen people with ARFID be told to \"grow up\" and being mocked for suffering a legitimate and serious *eating disorder,* all because people have it in their heads that it's a children's thing. These kinds of ideas are why ARFID flew under the radar in the medical community for years until it was finally recognized as a disorder in 2013. And why, even today, ARFID is so underprioritized compared to other eating disorders. People have possibly *died* due to these effects.\n\nWhile it's not the kind of thing anyone should be banned over, Reddit should be paying attention to the kind of users and communities who spout these harmful, unscientific statements.\n\nI was banned mere minutes after putting in the report. Permanent suspension on that account. No prior warnings, no reaching out for clarification. I doubt they really read it through or put any thought into it.\n\nI submitted an appeal, but the character limits on those appeals are pathetically small so I couldn't even entirely express what I stated in my first paragraph.\n\nAnd it'd be one thing if they just didn't take the reports seriously, but they straight up banned me on first offense. Way to discourage *anyone* from reporting *any* hateful content on the site, threatening to ban them if you don't agree it's hateful.\n\nReddit, do better. Listen to disabled voices.", "title": "I reported a ridiculing comment saying only children are picky eaters for misinformation, and got permanently suspended for \"abusing the report system\".", "context": null}
{"type": "comment", "timestamp": 1657458523.0, "datetime": "2022-07-10T13:08:43", "subreddit": "ARFID", "id": "iflbdu6", "text": "Damn man.\nLemme guess, he was trying to say only teenage girls being bisexual was somehow “proof” that bisexuality is “fake” because hur dur teenage girls want attention?\nGuessing because this sounds awfully similar to the tired argument of “only 1st world country people have ARFID so it MUST be fake”.\n\nReally, I’d expect this behavior from mods, since they’re all random users who are completely unpaid and only screened by each other, but I’d seriously expect better from the actual admins of the site. Reddit needs to do better.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1657459982.0, "datetime": "2022-07-10T13:33:02", "subreddit": "ARFID", "id": "ifle5be", "text": ">Condiments? If it’s Mayo or ranch, sure.\n\nAnd it can get even more limited than that. For me, I *exclusively* have barbecue sauce. And it has to be a specific kind of barbecue sauce. There are 2 kinds of barbecue sauce I'll have: the BBQ sauce from Dairy Queen, and the BBQ sauce from Red Robin. And both HAVE to be with their respective chicken strips; Dairy Queen sauce for Dairy Queen chicken, Red Robin sauce for Red Robin chicken. And those chicken strips HAVE to have their barbecue sauce, if I have to eat plain I'll just throw it out sobbing regardless of how hungry I am.\n\n&#x200B;\n\n>I’m making an effort to eat more fruit but it’s just so hard. The texture/lack of flavor in most is just so unappealing.\n\nThis is me with watermelon. It has such a weird grainy texture to me, and the taste is so mild it doesn't even begin to cover it up (usually I distract myself from textures with strong-flavored foods).\n\nIf you have this problem but want to try fruit, I'd recommend pineapple. It isn't called \"nature's candy\" for nothing. It's extremely sweet, so it's one of the only fruits I eat since the taste covers up the texture for me. But always look for the really vibrant yellow pieces; if it's only a pastel yellow/off white it's not as ripe yet and will have a tougher texture and taste more bland.\n\n&#x200B;\n\n>And it’s truly humiliating to explain this to people constantly.\n\nExactly. Especially running the risk of being called \"childish\" for it.\n\nBut to me it's not even just about the humiliation aspect of it. This kind of ridiculing, downplaying, and straight up denial of this disorder *actively hurts people*. It's probably why ARFID flew under the radar of the medical community for such a long time, only being made an official diagnosis in 2013.  And as a result of both its late recognition and this kind of downplaying, ARFID is still severely underprioritized compared to other eating disorders. It’s very possible people have died due to rhetoric like this. Hell, there's a case of a 19 year old who *permanently lost his eyesight* due to a \"picky\" diet from ARFID. This topic isn't something you can just fuck around about; there are serious things at stake.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1657478743.0, "datetime": "2022-07-10T18:45:43", "subreddit": "ARFID", "id": "ifmkup8", "text": "And u/StormTheParade’s example is even worse.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1657479526.0, "datetime": "2022-07-10T18:58:46", "subreddit": "ARFID", "id": "ifmmnpy", "text": "What’s fds?", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1657480259.0, "datetime": "2022-07-10T19:10:59", "subreddit": "ARFID", "id": "ifmoc3q", "text": "Oh, so one of those groups that calls men incels just for having autistic traits?", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1657489690.0, "datetime": "2022-07-10T21:48:10", "subreddit": "ARFID", "id": "ifna58r", "text": "The problem isn't modding a subreddit for teenagers in general, but when every single sub you moderate is aimed at teenagers... it sort of makes you wonder if there's grooming going on.\n\nIt isn't when you just happen to run a sub for teens. It's when you specifically go after the teen subs. It's going out of your way to be in positions of power over teenagers.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1657489986.0, "datetime": "2022-07-10T21:53:06", "subreddit": "ARFID", "id": "ifnatu8", "text": "Legit saw a moderator proclaim \"I AM THE SUPREME AND FINAL DECISION MAKER\" as though he's some maniacal dark lord.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1658088945.0, "datetime": "2022-07-17T20:15:45", "subreddit": "ARFID", "id": "igk35oa", "text": "I recently became allergic to a safe food. Shit sucks, man.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1658104066.0, "datetime": "2022-07-18T00:27:46", "subreddit": "ARFID", "id": "igl0jxk", "text": "What is AS?", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1658623795.0, "datetime": "2022-07-24T00:49:55", "subreddit": "ARFID", "id": "ihe2yea", "text": "This same thing crops up on r/unpopularopinion every few months. It’s extremely discouraging.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1658630212.0, "datetime": "2022-07-24T02:36:52", "subreddit": "ARFID", "id": "iheg425", "text": "At least there’s a lot of people trying to advocate for us and educate OP too. Even if OP didn’t listen.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1658630320.0, "datetime": "2022-07-24T02:38:40", "subreddit": "ARFID", "id": "ihegbpi", "text": "I don’t blame you, lot of the threads in these kind of posts tend to be absolutely awful. Last time a post like this was hot on r/unpopularopinion, there were people in the comments openly bragging about lying to “picky eaters” about what’s in their food to get them to eat it. But this time the vast majority of the comments were really reassuring. We are winning this battle, slowly but surely.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1658630995.0, "datetime": "2022-07-24T02:49:55", "subreddit": "ARFID", "id": "ihehnte", "text": "Those are shitty friends.\n\nAll my friends expressed genuine concern for my eating habits throughout my life *far* before any of us found out ARFID existed or that I had it.\n\nI remember being at my friend’s 15th birthday party as a kid, and him giving me an emotional intervention because he was worried about me after I refused to eat any of the pizza or cake. No “grow up”, no “get over yourself and eat it”, no “you’ll like it if you try it”, no embarrassment that I was being weird at his birthday party, genuine worry. From a cishet edgy 15 year old gamer guy who was known by the whole school for being an edgy asshole. So, yeah, no excuse for any of the other neckbeards and edgy teens out there. \n\nReal friends don’t need a diagnosis on a sheet or a hospitalization to make them stop acting shitty. Real friends choose empathy before scorn in the first place.\n\nI hope you have better friends now.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1658671280.0, "datetime": "2022-07-24T14:01:20", "subreddit": "ARFID", "id": "ihg67vg", "text": "To be fair, they had their reasons. Guy has absolutely no verbal filter hahaha.\n\nBut I love him too. Known him since pre-school and still best friends to this day. Being autistic messes together.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1658744283.0, "datetime": "2022-07-25T10:18:03", "subreddit": "ARFID", "id": "ihk6hj1", "text": "Update- I contacted the mods of the subreddit asking them to take action about the sheer number of picky eater hate posts on their sub. Got muted along with such lovely sentiments as:\n\n-those hate posts actually HELP us by bringing awareness to our disorder\n\n-people with disabilities like EDs aren’t minorities so these things don’t qualify as hate posts \n\n…yeah, your evaluation is correct, the r/unpopularopinion mods really don’t give a shit about us.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1658762140.0, "datetime": "2022-07-25T15:15:40", "subreddit": "ARFID", "id": "ihl50os", "text": "Update- I've been talking about this on the discord server, and one of the mods here just told me that one of the mods from r/unpopularopinion just reached out for a civil discussion. I'll keep updated on how that goes.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1658797229.0, "datetime": "2022-07-26T01:00:29", "subreddit": "ARFID", "id": "ihnlfia", "text": "Update: It went awful, and now one of our mods is inconsolable.\n\nFuck that subreddit.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1658797668.0, "datetime": "2022-07-26T01:07:48", "subreddit": "ARFID", "id": "ihnmfky", "text": "They used their position as mod to lure one of our mods into a private discord conversation where they played mind games until she had a breakdown.\n\nI was getting live updates throughout. She tried to disengage multiple times. When she realized she wasn’t in an emotional state to handle the situation, she asked if she could have another mod talk to them in her stead and they refused. Right after the conversation with them ended she broke down with me. \n\nI’m so angry.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1663038014.0, "datetime": "2022-09-13T03:00:14", "subreddit": "ARFID", "id": "io7kq85", "text": "Same.\n\nI know I won't eat anything, and even worse, I'll have to smell everybody else's food.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1666057410.0, "datetime": "2022-10-18T01:43:30", "subreddit": "ARFID", "id": "isr1c0d", "text": "This restores some hope in me thank you.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1666222894.0, "datetime": "2022-10-19T23:41:34", "subreddit": "ARFID", "id": "it05zoc", "text": "There was recently an Ensure recall; that may have interfered with their supply.", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1672766083.0, "datetime": "2023-01-03T17:14:43", "subreddit": "ARFID", "id": "102dit1", "text": "", "title": "How many of us have done this for free?", "context": null}
{"type": "comment", "timestamp": 1698861793.0, "datetime": "2023-11-01T18:03:13", "subreddit": "ARFID", "id": "k7e8yzu", "text": "I actually love thanksgiving. I’m lucky enough that I have several safe-foods that are traditionally served on thanksgiving (turkey, mashed potatoes, thanksgiving rolls) so it’s basically the closest thing I’ll ever experience to an all-you-can-eat buffet.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1736196114.0, "datetime": "2025-01-06T20:41:54", "subreddit": "ARFID", "id": "m5r9ccw", "text": "When I was in residential treatment, nearly a third of the total patient population had ARFID. Which was a real problem because we only had one ARFID specialist. \n\nThe only thing about ARFID that isn’t common is acknowledgement. Thank you for helping with that.", "parent_id": null, "link_id": null, "context": null}
