{"type": "comment", "timestamp": 1649646309.0, "datetime": "2022-04-11T03:05:09", "subreddit": "ARFID", "id": "i48xmff", "text": "I also match all the avoidant bullet points and pretty much none of the others except a few specific foods for reasons I won't go into here, but let's just say my mom tried to get me over being avoidant in not very nice ways.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1700473134.0, "datetime": "2023-11-20T09:38:54", "subreddit": "ARFID", "id": "k9zz397", "text": "My husband says he doesn't have arfid, but he's even more restrictive than me. It took me quite some time to get it through his head that when he starts in on how gross he thinks something is that I'm eating, I can't eat anymore. I struggle to even eat that thing again for a long time. Taking away any of the foods I can eat is really hard on me. It took me making myself be a jerk and going on and on about how disgusting something he likes is to get him to understand a little about how I feel. It didn't make him stop eating or liking the food, but it made him really defensive and unhappy. He doesn't want me to feel that way, so he stopped saying it. He just asked me not to eat one thing around him because even the smell makes him not want to eat all day. That's fair. I don't want him to feel that way, either.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1700473382.0, "datetime": "2023-11-20T09:43:02", "subreddit": "ARFID", "id": "k9zzd9n", "text": "I had one try sooo hard with me. She thought there was something wrong with my food because I dismantled it and ate one ingredient at a time. I kept reassuring her I just eat that way, but she wanted to replace it or get me something else. She ended up taking it off my bill, and I felt really bad. I did eat the whole meal. I just don't like stuff together except for certain foods. She was so sweet! That made me feel even worse, honestly.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1708331152.0, "datetime": "2024-02-19T08:25:52", "subreddit": "ARFID", "id": "kr41x7j", "text": "Mine had no issues with me being fat and having ARFID. To him, of course both could be true because all my safe foods were high carb. \n\nThe whole thing went like this, \"so, I was talking to someone online who eats different foods, but is so much like me. She said she has something called ARFID, so I learned more about it. It really sounds like me.\" Him, \"that makes sense. You want therapy?\" Yes! \n\nCan't say the therapy has been easy, but when I look back to that conversation over a year ago, where I was then, and where I am now, I am doing a lot better! I still struggle, I won't lie, but I am eating better and have even lost a bit of weight.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1710299559.0, "datetime": "2024-03-13T03:12:39", "subreddit": "ARFID", "id": "kumigsq", "text": "They're just not even food. It's like handing me a plate with wood chips and telling me to eat them. Even if I see you eating them, my brain just says there's something wrong with you, not that it must be food.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1710299677.0, "datetime": "2024-03-13T03:14:37", "subreddit": "ARFID", "id": "kumiqjo", "text": "I actually like it that way, but everyone looks at me like I'm crazy. Who serves it that way?!\n\nI should get credit for not taking my sandwich apart and eating it one ingredient at a time when it didn't look like those sandwiches usually do. Did I? No, I did not get credit. It was hard!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1710299765.0, "datetime": "2024-03-13T03:16:05", "subreddit": "ARFID", "id": "kumixp1", "text": "Good job! I can't do grilled cheese, but I'm proud of you. It's hard to change things like that.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1710300004.0, "datetime": "2024-03-13T03:20:04", "subreddit": "ARFID", "id": "kumjgzu", "text": "The fact that a package can make a food okay. Like, if you put any tater tots in the paper cup/bowl thing from Taco Time, they're okay. If they're served any other way, I need to take a cautious bite first. They don't have to taste like the taco time ones or even look like them. Even I don't understand it, honestly. Putting them in that cup works! They're okay that way because they came from the \"magic\" taco time packaging. \n\nI had a friend who was a manager at one, and he gave me two huge stacks of brand new ones, so I could try other foods in them. Sadly, it only works with tater tots.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1710324926.0, "datetime": "2024-03-13T10:15:26", "subreddit": "ARFID", "id": "kunmjiy", "text": "I can eat them without doing it if I've had them before at that place and they look exactly the same as usual. That's a huge improvement for me, actually. But if it's a new place or they look different, I just can't guarantee I'll be okay with the textures or flavours. If I try one thing and it's bad, I can just not eat the rest of that thing, but if I do that with the whole sandwich, then the whole sandwich is bad. I can't take that thing off. It doesn't work. Sometimes, I can then deconstruct it and eat things separately, but not reliably. \n\nAs a kid, I deconstructed everything except deviled eggs and soups. Everything. Even pizza. It drove my mother nuts, so I'd get in trouble. That really didn't help me get over it at all. \n\nI somehow just stopped having ARFID when I hit puberty. It was awesome! And then it came back when I got pregnant and never went away again. Ugh. But it had a good lasting thing. I had way more safe foods after than before, and there were a lot less things I had to deconstruct, but sandwiches are just an issue. \n\nThrough therapy, I've managed to add a lot of veggies the last couple of years. I'm pretty happy about that. Still isn't helping with sandwiches. It's like I just don't trust them. Who knows what's hiding in there? I love subway, because I can watch them put everything on.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1710638475.0, "datetime": "2024-03-17T01:21:15", "subreddit": "ARFID", "id": "kv7xzdh", "text": "It's only certain foods, too. Like, I don't care how yakisoba is packaged, but I agree about chicken nuggets from pretty much anywhere. Some things just.. I don't understand it, honestly.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1719168114.0, "datetime": "2024-06-23T18:41:54", "subreddit": "ARFID", "id": "l9xt76v", "text": "Go dormant all winter, hang out in the sun and breeze all Summer. Yessss. Can I be a black cottonwood? They're pretty majestic.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1723412657.0, "datetime": "2024-08-11T21:44:17", "subreddit": "ARFID", "id": "lhnhpax", "text": "Therapy for ARFID and slowly AF getting better has made me lose weight. I was 91kg at the top, and I'm 168cm tall. I'm still overweight, but I'm slowly getting there.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1724966984.0, "datetime": "2024-08-29T21:29:44", "subreddit": "ARFID", "id": "lkklh6k", "text": "I seem to be the opposite. There are so many times soup is the only thing I can eat. but i totally understand you on this one.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1725593975.0, "datetime": "2024-09-06T03:39:35", "subreddit": "ARFID", "id": "llqq89g", "text": "Yeah. I grew up with food insecurity, and it made me more understanding of people with eating disorders before I even knew I had one. \"Funny\" how some of us choose to be better people while some choose to be jerks.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1726846009.0, "datetime": "2024-09-20T15:26:49", "subreddit": "ARFID", "id": "lo2by9b", "text": "Even if I was choosing to be \"picky\", so what? Why do people get so bent out of shape about what someone else eats or doesn't eat? I get worrying about loved ones with ARFID. It's called a disability for a reason, but people will get totally in my face about just one food I can't/won't eat just because they like it.\n\nI mean, it is fair if you're a huge foodie to not start a conversation on a dating app with someone who says they have ARFID or says they're a picky eater. I get that it can be frustrating to date someone with limited food options, and I imagine that's worse if food is your hobby, but just swipe left and move on.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1726851528.0, "datetime": "2024-09-20T16:58:48", "subreddit": "ARFID", "id": "lo2t2pu", "text": "Right?! It's inconvenient for my friends that I have ARFID, but not nearly as bad as it is for me. \n\n\"Hey, let's go check out this new restaurant!\" I'll go, but man, the anxiety. They're my friends, so they'd accept it if I vetoed, but I feel terrible always being that friend. \n\nI've not gotten jobs because the second interview was at a restaurant. You get \"picky\" about food, it doesn't matter how well you do on everything else most of the time. If you request it not be over a meal, same. \n\nI've had people break up with me because I was \"refusing\" to eat food they cooked. I mean, I see that as a bullet dodged, but it still sucks. \n\nARFID is just so much more of a problem than \"I can't eat that.\"", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1726929978.0, "datetime": "2024-09-21T14:46:18", "subreddit": "ARFID", "id": "lo7qma3", "text": "I would care if someone was ace on a dating app, though, because I very much am not. Like, they wouldn't be a good match for me. But other than that? I don't even get why it matters.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1731956263.0, "datetime": "2024-11-18T18:57:43", "subreddit": "ARFID", "id": "lxssezc", "text": "Right? There's a huge difference between \"my mental image of my body is not right\" and \"my brain is sure this food isn't safe for whatever reason or isn't food.\"\n\nI do have some issues with body weight, but they're based on the fact that I am heavy and it's hard on my joints and hard to do the things I really want to do. I'm working on that, but my brain is well aware of what's healthy for my frame and height, and that's my goal. That's not anorexia. \n\nSome foods, I have past trauma with. It's a small enough list, I'm honestly not even trying with those. \n\nSome foods have textures my brain says are just not food. Trying to eat them is like trying to eat wood chips. My brain has the same reaction to them. I am in therapy and working on that, but it's hard. It's so hard. It's also not anorexia. \n\nAnd like most people without an eating disorder, I just don't like some foods because I don't think they taste good. That's absolutely okay and normal. I can eat a balanced diet without ever eating bitter foods, rosemary, or sharp cheese. This is also definitely not anorexia. It's not even ARFID. Almost everyone has at least something they don't like.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1732670335.0, "datetime": "2024-11-27T01:18:55", "subreddit": "ARFID", "id": "lz66w41", "text": "You know what's lovely about being 50, hosting, and only inviting nice people? I do not have to deal with this. \n\nYounger me definitely relates to this meme, though.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1732670428.0, "datetime": "2024-11-27T01:20:28", "subreddit": "ARFID", "id": "lz674xs", "text": "I will never understand stuffing. I'm not a fan of gravy most of the time, but I get it. Stuffing is .. just no.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1732670513.0, "datetime": "2024-11-27T01:21:53", "subreddit": "ARFID", "id": "lz67d4r", "text": "My first Thanksgiving away from home, I did not drive the half an hour to be with my family. A friend and I made Italian food, only what we liked best, sat on my couch, and chatted and laughed so hard we could barely breathe. It was amazing.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1732771575.0, "datetime": "2024-11-28T05:26:15", "subreddit": "ARFID", "id": "lzd4ylk", "text": "My husband and I have his mom over. She's happy with whatever I make and always praises it. I swear, I could make pb&j, and she'd still be happy. I love her so much. \n\nI do make small portions of some things I won't eat that I know she loves, and she doesn't even comment on me not eating them except the one time she told me she didn't want me to go to the bother. It's not at all a bother to make things just for her, honestly.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1732772409.0, "datetime": "2024-11-28T05:40:09", "subreddit": "ARFID", "id": "lzd6nbr", "text": "The family I have in the area, besides my son, are too toxic. I don't have anything to do with them. To be fair to them, they all gave up a very long time ago when it came to food with me. They might eye my plate, but they wouldn't say anything. The toxicity was around, well, absolutely everything else. It got to where I only forced myself to see them on holidays, and that made me dread holidays. Since I stopped talking to them, I love holidays! They're so chill at my house. Quiet, peaceful, and fun. And you're right. That's how it should be. \n\nMy son works in a steak house, so he almost always works on Thanksgiving. He's got Christmas off, though, and it's similar. I make what I feel like. He eats pretty much anything and everything except cake, though. I fought my ARFID so hard when he was little to set a good example for him, and I'm so glad it worked. If he'd turned out really restrictive about food after all those things I learned to pretend to like when I wanted to be sick, I'd be so upset. I have to say, though, it actually did help me expand what I could eat. I was honestly pretty mad that the doctors were right about that. Lol. It did not expand what I like, though. It just made me able to tolerate more without freaking out.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1732773152.0, "datetime": "2024-11-28T05:52:32", "subreddit": "ARFID", "id": "lzd849c", "text": "I got mostly lucky as a little kid. My grandma always quietly was on my side. She'd offer to make up my plate and then not include anything she knew I wouldn't eat. Sometimes, Mom got involved and added other things, but most of the time we'd wait until she wasn't paying attention, and Grandma would motion for one of my cousins would eat that stuff for me.  It's too bad we moved away when I was almost 10, but at least my very early holidays weren't too bad - at least, not relevant to food. \n\nGrandma had this belief that as long as I ate, and not just dessert, it was fine. She knew if I was forced to eat things, I'd shut down and be unable to eat anything. To her, it was a holiday, so we should be enjoying things and being together, not worrying about what someone did or didn't eat. She just made sure there were things that everyone could/would eat and didn't judge.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1732773461.0, "datetime": "2024-11-28T05:57:41", "subreddit": "ARFID", "id": "lzd8pq2", "text": "Wow! Rice was part of our Thanksgiving when I was growing up. It was meant to be some sort of dessert with sugar, butter, and milk. I was not into that, but I liked the rice by itself. Even my mom who could get so crazy about what I ate had no issues with that. \n\nWhy the hell would .. did she miss the point of the holiday? Clearly, yes. I will never understand people like that.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1732773649.0, "datetime": "2024-11-28T06:00:49", "subreddit": "ARFID", "id": "lzd92g7", "text": "I'm envious of your ability to eat green bean casserole. That's not something I've even managed to try since I was a kid. I mean, I still have no plans to. Lol. I can eat green beans plain now. That's plenty. \n\nBuuuut, I host, and it's just my husband and his mom. There's no stress about food at all. I make a bit of some things they like that I don't, but no one is gonna say a word about me not eating them. They just feel grateful I actually made things I don't like.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1732845897.0, "datetime": "2024-11-29T02:04:57", "subreddit": "ARFID", "id": "lzhz0ok", "text": "I compare to wood chips. They smell lovely, but I'm not interested in eating them because they aren't food. For some, I think it is more like your fly example. I'm not grossed out at all if someone else eats those things. In fact, I honestly do love the smell of many things, like coffee, I can't stand consuming. That confuses people, and I find the wood chips analogy works. \n\nTW, cultural food many Westerners may be disturbed by:    \n>! But I've also used grubs before. Many cultures eat grubs, but mine doesn't. If I set a plate of grubs in front of most people where I live and insisted they try just a bite and kept pressuring, I'd have a fight on my hands. They are perfectly edible and nutritious, though, so it's a better analogy than wood chips. However, it grosses people out when I use that example, so I generally won't unless they're being a jerk. !<", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1732849066.0, "datetime": "2024-11-29T02:57:46", "subreddit": "ARFID", "id": "lzi6c6i", "text": "This is super long, and I don't really know how to sum it up. I guess \"don't force particular foods, but encourage trying without any pressure.\" \n\nHelpful for me when I was young would have been my mom not trying to force me to eat things. On top of that, not being sent to the kids' table by myself at 13 (I'm the youngest on all sides) because I wouldn't eat \"like a normal person\" when what I did eat wasn't going to make anyone else not want to eat would have helped. The majority of my family *did not care* what I ate or didn't eat, but my mom seemed to find me embarrassing, and that added stress and shame that made my ARFID worse. Just letting me eat peas, corn, rolls, and mashed potatoes with only butter on them and acting like that was perfectly normal would have been great. \n\nMy son, who is 28 now, will eat anything but cake and asparagus. As soon as he started on solid foods, I introduced a lot of different foods. If he clearly disliked something, I didn't try that food again for months. I just fed him something I knew he did like. As he got old enough to be able to talk to me, I asked him to always try a bite. If he didn't like it, he was allowed to (politely) spit it out. He always knew he had that option, so he was willing to try almost anything. Some, he wouldn't even take a bite of because of the smell. That was fine as long as he told me that's why. We learned to cook things together in different ways to see if he liked them some other way, so he had a lot of control over the food he ate. I think that sense of control is why he is so willing to try new foods and has a huge variety of things he'll eat now. Honestly, he never flat out refused to at least smell something and never refused a single bite if it didn't smell bad to him, but I think I'd have just accepted his no and moved on. There were a lot of things he didn't take a second bite of, but a year or more later, he'd be willing to try again, and he'd often like them. There are so many possible foods, I really didn't care as long as he was getting enough nutrition, but I didn't want him.to be hampered by a restrictive diet like I was. \n\nHe doesn't have ARFID, to be fair, but I know this approach would have helped me a lot. I have texture issues more than anything else, and getting to have control over whether I finished chewing and swallowing it (rather than being punished when I couldn't) would have led to more foods I could eat. I know this because I finally got to do that as an adult, and it did help. My biggest problem now is that I cannot bring myself to try the foods she forced on me. I have too many bad memories attached to those foods. Some of them smell sooooo good, but when I try to eat them, I feel sick and anxious. \n\nMy grandma was totally different from my mom about food. She basically only had a rule that I had to eat something from each category - so one veggie, one meat, one fruit, one dairy. She didn't care what I chose. The only caveat was that if it wasn't what she was making for everyone else and had to be cooked, I had to help cook it - or cook it myself once I was old enough. And meat was expensive, so generally I was going to get a couple of slices of bologna (which was cheap) if I couldn't eat the meat she was already cooking. I think that was totally fair. She shouldn't have had to make something just for me on top of the meal she was making for everyone else once I could cook. She did get in a fight with my mom about this, once. \"All the kids get to choose which cereal they want or what they want in their oatmeal. Why is it different that I let her choose raw peas when everyone else is having cooked carrots?\" Mom's answer was that I needed to eat what everyone else was having. Grandma thought it was dumb to make that rule, since it meant I wouldn't eat at all when I was in the 5th percentile for weight. To her, me eating at all was much more important than what I ate. Grandma, \"so, you'd rather control her than see her healthy? What is wrong with you?\" My hero. :) All my grandparents and great grandparents were super chill about my ARFID. And you know what? I ate a lot more things at their houses - because there was no anxiety attached to food there.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1734744247.0, "datetime": "2024-12-21T01:24:07", "subreddit": "ARFID", "id": "m32kpy8", "text": "My husband gets just roast beef with nothing else. Usually, they double check or make a comment about how easy his sandwich is but don't tend to push. Every once in a while, though, we get someone who is super judgy. \n\nI used to work at Subway when I was young, and I don't get it. I did not care what people ordered for the most part, but a sub with just one meat and nothing else would have made me so happy! I might have made a comment about it being easy thinking I was being friendly, though. I hope I never hurt anyone's feelings, because I honestly appreciated the sandwiches that weren't piled with so much stuff they were hard to close and wrap. I also appreciated that they weren't combinations that grossed me out a bit. \n\nLuckily, my ARFID doesn't really make me sick from dealing with food I cannot eat myself, but some combinations, man, why?!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1737587416.0, "datetime": "2025-01-22T23:10:16", "subreddit": "ARFID", "id": "m8mlig4", "text": "How would being against hatred not apply everywhere?", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1737596401.0, "datetime": "2025-01-23T01:40:01", "subreddit": "ARFID", "id": "m8ndx5r", "text": "Your original comment implied being anti X was fine, but all the other things weren't okay to say the moderation team is against. Nothing in there was relevant to any particular individual. It's a list of hate related things not tolerated here. I'd say that's pretty relevant to the sub. \n\nI'm going to assume it just came off differently than you meant it.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1739779410.0, "datetime": "2025-02-17T08:03:30", "subreddit": "ARFID", "id": "md7tcp0", "text": "I solved this in a way that seems totally dumb, but it works. \n\nWe have a small locally owned market nearby that only feels produce, meat, and dairy. They have hand written chalkboard signs, the most aesthetically pleasing displays of fruit and veggies, and in season, locally grown stuff that's not spent weeks in shipping. *And* they're the same price as a chain grocery store or less! I love the vibe so much there, that I'm excited about the stuff I buy from them. I only buy a day or two of veggies at a time, so I eat them before the excitement fades. Then, I get to go back and be all excited again! \n\nI also bought a fridge that's super helpful. It has a middle drawer that pulls out separately from the doors that's for snacks. I clean and put veggies and fruits in there in pretty displays that make me want to actually eat them. Any time i feel snacky, I open that drawer first, and I almost always choose something from in there. I mean, radishes cut to look like roses? Yes! Carrots made into flowers with a bento punch? I can do that. \n\nIt turns out the more pretty or cute I find food, the more willing I am to eat it. This doesn't apply to foods I completely cannot stand, but it works for things I like and things I can tolerate.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1739779603.0, "datetime": "2025-02-17T08:06:43", "subreddit": "ARFID", "id": "md7to68", "text": "I got a dehydrator, and stuff that's going to go bad gets sliced and put in it then taken on camping trips. This isn't so helpful in Winter because even dehydrated, not everything lasts forever. I really want a freeze dryer, but they're expensive. \n\nMost of my dehydrated veggies end up in soups. I love your Alfredo idea!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1741061797.0, "datetime": "2025-03-04T04:16:37", "subreddit": "ARFID", "id": "mfwoj2j", "text": "I grew up very poor and have ARFID. I bet there are things you'd happily give me I wouldn't have been able to eat no matter how hungry I was. \n\nThis sounds so much like my mom telling me all the time, \"There are children starving in Africa\" when she was trying to force me to eat things. Okay, so send the food to them? I'm not the one keeping them from having food!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1743402630.0, "datetime": "2025-03-31T06:30:30", "subreddit": "ARFID", "id": "mkn9ip0", "text": "Please keep the sub rules in mind. Photos of food require being marked as \"spoiler\" to prevent triggering people. \n\nI have marked this post for you.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1743744039.0, "datetime": "2025-04-04T05:20:39", "subreddit": "ARFID", "id": "mlbt805", "text": "I like tons of Asian foods despite growing up in a small town in America where \"Asian food\" was chow mein from a can that wasn't even close to authentic. \n\nIt seems like the less it's like what I grew up with, the easier time I'll have with it.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1746401113.0, "datetime": "2025-05-04T23:25:13", "subreddit": "ARFID", "id": "mqmb9xr", "text": "Costco boxes of Cheez Its and Premium saltines are different than smaller boxes from other stores. Luckily, my husband agrees, so we just don't buy them from Costco anymore.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1746401160.0, "datetime": "2025-05-04T23:26:00", "subreddit": "ARFID", "id": "mqmbews", "text": "Omg, yes. Glass is superior. It tastes different in metal bottles, too.", "parent_id": null, "link_id": null, "context": null}
