{"type": "comment", "timestamp": 1649855089.0, "datetime": "2022-04-13T13:04:49", "subreddit": "fuckeatingdisorders", "id": "i4k6lby", "text": "Oatmeal and toast but I bet you've heard those before! I also really love soy yogurt holy damn I could eat tubs and tubs. It's so good with granola and nuts. Also cereal.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1650369869.0, "datetime": "2022-04-19T12:04:29", "subreddit": "fuckeatingdisorders", "id": "i5bytzh", "text": "fr i've gotten so much shit for calling them out but my friend posted on this sub twice to call them out and there were so many responses, it felt amazing bc some of those people had triggered me before", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1650370196.0, "datetime": "2022-04-19T12:09:56", "subreddit": "fuckeatingdisorders", "id": "i5bzf6l", "text": "the less recovered people are, the more they are lurking on food and fitness related pages and the more likely they are to be on *fake* recovery pages instead of real ones. lastly, criticism gets deleted and blocked. that's why it's so rare to find someone who knows what's up", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1650370533.0, "datetime": "2022-04-19T12:15:33", "subreddit": "fuckeatingdisorders", "id": "i5c01r0", "text": "\"tHeY aRe ReCoVeRiNg FrOm An Ed YoU dOn'T kNoW hOw HaRd It Is!!1!1!!!\"", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1650820956.0, "datetime": "2022-04-24T17:22:36", "subreddit": "fuckeatingdisorders", "id": "i60umrk", "text": "YES also they are not flexible at all. Many of them are flexing how their friends wanted to go out for pizza but ~deep down~ their bodies craved steamed vegetables so they said no. Then they left half a floret of steamed broccoli because their ~intuition~ said they were perfectly satisfied. \n\nI also saw a woman brag about her husband leaving FIVE pasta noodles because he's such an ~intuitive eater~. They always make such a big deal about not finishing their food when there's just scraps left. I'm sure they wouldn't open another can of chili to eat one single spoonful if they were still hungry for one, so why bother leaving a spoonful of it? As if perfection exists. They love to say that your body is not a computer, so why do some of them treat their bodies like one? I'm all for listening to your body but sitting around all day waiting for the most subtle hunger and fullness cues is not intuitive. It's a disordered control trip.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1650821271.0, "datetime": "2022-04-24T17:27:51", "subreddit": "fuckeatingdisorders", "id": "i60vfbh", "text": "When I spooned PB from the jar until I was truly satisfied for the first time (it was a lot) I felt amazing. When I ordered Indian takeaway (with sauce and starters, no dry curry) and ate until I was bursting at the seams, I had never felt so great in my life. When I ordered a huge salad at a ~healthy~ restaurant with the most mind-blowingly creative ingredients, I felt on top of the world. Maybe that makes me a binge eater. Idc lol if it just gets rid of my anorexia I'll take it cuz it's getting kinda boring.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1650821523.0, "datetime": "2022-04-24T17:32:03", "subreddit": "fuckeatingdisorders", "id": "i60w1x4", "text": "Although loss of hunger cues can be a symptom, anorexia nervosa doesn't mean you don't experience hunger or cravings... Or maybe I'm just greedy and faking it🥲🥲🥲🥲🥲", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1650978375.0, "datetime": "2022-04-26T13:06:15", "subreddit": "fuckeatingdisorders", "id": "i69eqob", "text": "Because the vast, vast majority of EDanon people are not in recovery, even those who think they are. I can't use that sub anymore, it's too triggering.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1651088858.0, "datetime": "2022-04-27T19:47:38", "subreddit": "fuckeatingdisorders", "id": "i6fxcdx", "text": "HEEEEYYYY I'M SO INCREDIBLY PROUD OF YOU!! It feels amazing doesn't it 💖 You DESERVE this, you worked so hard for it!!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1651871569.0, "datetime": "2022-05-06T21:12:49", "subreddit": "fuckeatingdisorders", "id": "i7lofp8", "text": "1. I love you\n2. Less joyful: I used to fart myself like a baby. Lie on my back, legs up and changing sides, squeezing myself at the waist like a wet towel. Works wonders, 100% recommend.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1652356147.0, "datetime": "2022-05-12T11:49:07", "subreddit": "fuckeatingdisorders", "id": "i8b1mxf", "text": "My opinion on people shouldn't be based on what they eat, but I love you for this.", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1653424097.0, "datetime": "2022-05-24T20:28:17", "subreddit": "fuckeatingdisorders", "id": "ux07qv", "text": "From my experience, as someone who has nearly recovered but continues to slip every few weeks and then notices things like these. I still struggled with some if not most of these while eating enough but I now understand where that came from because when restricting it's so much worse.\n\n\\- Not knowing what to eat. For real! Normally I either get slight cravings or just kinda eat whatever I have at hand that sounds kinda good. When I'm starving (even when I accidentally delayed a meal for too long while genuinely trying to recover), nothing sounds good even though I desperately want something. Choices get so hard!\n\n\\- Liking every food. Although we may convince ourselves we don't like our fear foods, often everything looks appetizing. I was picky as fuck before my ED and whilst I luckily won't be like that ever again, I'm finding out there are foods that taste like shit to me, *especially* the crap I was filling up on during restriction but I also used to hate Biscoff spread as a kid, loved it in the tiny amounts I allowed during anorexia, hate it again now. \n\n\\- Wanting your food to taste perfect\n\n\\- Wanting your food to look perfect\n\n\\- Food hoarding and getting anxious when you're low on anything\n\n\\- Feeling absolutely horrible about any food waste\n\n\\- Feeling the strong urge to take and share pictures because of this ethereal thing we call food (even when it looks like shit)\n\n\\- Being intensely uncomfortable when other people see you eat\n\n\\- Having a huge interest in what other people are eating\n\n\\- Thinking other people's portions would never be enough for you, even though you are eating way less on purpose. This ties in with the way many disordered people get super upset when they see other people have starbucks coffee for breakfast or skip it altogether when, although this is not healthy at all, those people are probably not doing it for disordered reasons and probably don't feel like shit. They were just not chronically hungry. \n\n\\- Genuinely craving lots of fiber???? when really chronically hungry???? explains the oatmeal obsession of all the fake recovered influencers and a lot of people who are genuinely recovering. I had it for the longest time in recovery and still ADORE oatmeal but I will eat a different breakfast and just go on with my day. I used to feel anxiety at not eating oatmeal in the mornings during quasi even when the other breakfast I planned didn't scare me by itself. it also explains the way some of us in the depths of our ED's weren't lying when we claimed to genuinely love salads. I only started craving little to no vegetables when I was solidly into recovery. Guess it has something to do with never ever being satiated, so at least we try to be super full as a sad substitute.\n\n\\- Strangely enough: feeling the need to eat less the next meal or day\n\nof course the obvious, but I'll note some of them down for a reminder: \n\n\\- Loss of interest, concentration, emotion and creativity *for those who genuinely think they are no one without their ED. even if you have depression or other issues, I promise your ED is the main reason nothing matters to you rn. you can spontaneously develop interests in a nourished body* \n\n\\- Thinking about food\n\n\\- Watching a lot of food videos\n\n\\- Being upset when someone takes a little bit of your food \n\n\\- Not wanting to be around others; isolating yourself", "title": "Mental ED symptoms that are at least partly linked to being (chronically) hungry", "context": null}
{"type": "comment", "timestamp": 1653465754.0, "datetime": "2022-05-25T08:02:34", "subreddit": "fuckeatingdisorders", "id": "i9wt23x", "text": "Some people are genuinely not hungry, or for some, a coffee with calories may prolong that boost that coffee normally gives you. If you needed breakfast every morning, you will probably be hungry in the morning for the rest of your life because you are a breakfast person. I also think everyone with past disordered eating should continue having breakfast because it may lead to a slippery slope otherwise. However, you will wake up not starving!! I know you're going through EH and it absolutely passes. A video I recommend is by Hat Did Beat This \"Recovered Hat reacts to extreme hunger\" where she reacts to her own video about her EH. She is fully recovered. :)", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1653465970.0, "datetime": "2022-05-25T08:06:10", "subreddit": "fuckeatingdisorders", "id": "i9wtaok", "text": "Oh definitely! Very common. I did that too, although the quantities of spices were much smaller than now?? I remember always adding a sprinkle of everything but tasting all of them in the food. Now that amount would be bland and I understand why recipes call for teaspoons or even tablespoons of spices. I think we get sooo sensitive to taste when we're starving.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1653466027.0, "datetime": "2022-05-25T08:07:07", "subreddit": "fuckeatingdisorders", "id": "i9wtcu7", "text": "OH SAME I TOTALLY FORGOT ALL OF THESE omg this comment reads like my life. I'll add some of this", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1653466415.0, "datetime": "2022-05-25T08:13:35", "subreddit": "fuckeatingdisorders", "id": "i9wts1u", "text": "This is so interesting!! When did you actually find out about extreme hunger? This sub taught me about it and I am super grateful to have learned about it before I went through it. I was always on here thinking I was one of the lucky ones who never got it.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1653466551.0, "datetime": "2022-05-25T08:15:51", "subreddit": "fuckeatingdisorders", "id": "i9wtxd2", "text": "I hope you find your way back to life without an ED ❤️❤️ You shouldn't feel guilty about this, it has nothing to do with who you are as a person, it's your illness.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1653765162.0, "datetime": "2022-05-28T19:12:42", "subreddit": "fuckeatingdisorders", "id": "iace4y4", "text": "I'm so fucking proud of you. This is literally my biggest struggle rn and it's mind boggling to me that people who are also struggling are so fucking strong. Sounds dramatic but lord do I wish you could feel how impressed I am.", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1654112071.0, "datetime": "2022-06-01T19:34:31", "subreddit": "fuckeatingdisorders", "id": "v2pa47", "text": "I'm really far in recovery and was never really a fear food person but what still terrifies me is the Lebanese falafel sandwich at the place where my friends always go. They double wrap it, put a shit ton of hummus and multiple ingredients in it are deep fried because the vegetables aren't just shredded lettuce and carrots, but fried aubergine, string beans and potatoes... Usually, some oil drips out the end. I've mentally calculated the range of calories it could be and it makes me wanna cry. My fucked up friends also often eat one when they haven't eaten all day, but today I'd already had a huge breakfast, lunch and a big snack. I remember when I first ate one at the same place, when I was restricting but before it got *very* bad. I couldn't finish it and felt genuinely overly full and satiated after 80% even though I was chronically hungry and hadn't eaten much that day. Basically, everything about this is terrifying and triggering. I slipped up badly last week and the ED thoughts were super loud today. I could've told my friend I'd eat at home but I fucking did it!!!", "title": "I ate my biggest fear food :)", "context": null}
{"type": "comment", "timestamp": 1654112271.0, "datetime": "2022-06-01T19:37:51", "subreddit": "fuckeatingdisorders", "id": "iatoc2r", "text": "Wow I had been doing so well and now dr Christian is in my head telling me I've been eating for 1.5-2 women 🙄 Gtfo I forgot you existed for the longest time, idiot. I refuse to move backwards... My ovaries are circle dancing hand in hand with those juicy falafels rn 💖", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1654114647.0, "datetime": "2022-06-01T20:17:27", "subreddit": "fuckeatingdisorders", "id": "iatu488", "text": "THEY'RE SO GOOD I would buy you one for sure", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1654116055.0, "datetime": "2022-06-01T20:40:55", "subreddit": "fuckeatingdisorders", "id": "iatxiwe", "text": "Thank you so much 💜 So are you. Keep going!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1654118083.0, "datetime": "2022-06-01T21:14:43", "subreddit": "fuckeatingdisorders", "id": "iau2bbm", "text": "Tbh here you go on the off chance that you or anyone seeing this is from my country or just happens to find themselves in the center of the capital of Europe: Ali Baba, Rue Paul Delvaux 11 in Brussels 😩", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1654118094.0, "datetime": "2022-06-01T21:14:54", "subreddit": "fuckeatingdisorders", "id": "iau2cb5", "text": "Thank you so much!!!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1654121810.0, "datetime": "2022-06-01T22:16:50", "subreddit": "fuckeatingdisorders", "id": "iauare2", "text": "HAHAHAHAHAHAHA THIS IS AWESOME THANK YOU", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1654128854.0, "datetime": "2022-06-02T00:14:14", "subreddit": "fuckeatingdisorders", "id": "iaupn9d", "text": "thank you 💜 a ridiculous amount of people here do, sadly... you definitely belong here alright?", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1654203532.0, "datetime": "2022-06-02T20:58:52", "subreddit": "fuckeatingdisorders", "id": "iayhm4g", "text": "I neeeeeded this. Thank you. She sounds wonderful!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1654204459.0, "datetime": "2022-06-02T21:14:19", "subreddit": "fuckeatingdisorders", "id": "iayjo0l", "text": "thank you💜", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1654204607.0, "datetime": "2022-06-02T21:16:47", "subreddit": "fuckeatingdisorders", "id": "iayjzta", "text": "yes!!! i used to restrict fats so fucking much at my worst and even after a YEAR of quasi in which i genuinely thought i was recovering or even eating 'too much', i was deficient in 2 fat soluble vitamins even though i ate lots of veggies containing them. i also used to fear oil, but fat is great actually!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1655066677.0, "datetime": "2022-06-12T20:44:37", "subreddit": "fuckeatingdisorders", "id": "ic4mcrw", "text": "This is SO spot on I'm screaming", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1655581634.0, "datetime": "2022-06-18T19:47:14", "subreddit": "fuckeatingdisorders", "id": "icv6o7n", "text": "I actually love black bean brownies lmao. Not as great as the real thing but I couldn't eat a whole pan of normal brownies while I would gladly gobble down 10 black bean brownies in a sitting.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1655850020.0, "datetime": "2022-06-21T22:20:20", "subreddit": "fuckeatingdisorders", "id": "id8fxhz", "text": "Fr.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1655850170.0, "datetime": "2022-06-21T22:22:50", "subreddit": "fuckeatingdisorders", "id": "id8g9d1", "text": "BRUH she JUST made a post about misfits bars", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1656023852.0, "datetime": "2022-06-23T22:37:32", "subreddit": "fuckeatingdisorders", "id": "idhmbav", "text": "This has downvotes because you're wrong.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1656023871.0, "datetime": "2022-06-23T22:37:51", "subreddit": "fuckeatingdisorders", "id": "idhmcpo", "text": "No it's not.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1656024295.0, "datetime": "2022-06-23T22:44:55", "subreddit": "fuckeatingdisorders", "id": "idhnaaw", "text": "I read what you said and if I hadn't, it's still there because it's written text. What you're saying is wrong. Protein and fiber have a *very minor* influence on how many calories it takes for a decently nourished person to be full. OP isn't lacking vitamins, minerals or protein, she is catching up on god knows how many months or years of undereating and needs lots of (quicky available) energy to repair her body. We aren't plants, we don't photosynthesize and suck up mineral water to live. No realistic amount of vegetables or supplements will satiate you if you're not eating enough.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1656025137.0, "datetime": "2022-06-23T22:58:57", "subreddit": "fuckeatingdisorders", "id": "idhp3x7", "text": "Nah you're alright! There's lots and lots of misinformation out there, hell, even science doesn't agree with eachother sometimes.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1656025475.0, "datetime": "2022-06-23T23:04:35", "subreddit": "fuckeatingdisorders", "id": "idhpuf0", "text": "Not *just*, but mainly! While micronutrients are very important, macronutrients (which make up calories) are the absolutely necessary thing. A picky child surviving off chicken nuggets and fries usually has some mild deficiencies, but doesn't have to go through extreme hunger from malnutrition. That's the thing that happens to people who were starved, even if they still ate heaps of vitamin rich, energy poor food. People with literal orthorexia end up in the hospital.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1656026458.0, "datetime": "2022-06-23T23:20:58", "subreddit": "fuckeatingdisorders", "id": "idhrxbo", "text": "Also I'm extremely sorry but you clearly are in no position to talk about satiation since you're very mentally hungry and restricting.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1656197304.0, "datetime": "2022-06-25T22:48:24", "subreddit": "fuckeatingdisorders", "id": "idqojao", "text": "Fuck yeah! That's the spirit. And hey, that's a strong personality you have there. You got your bravery back and intelligence and that lovely style of writing posts.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1656353058.0, "datetime": "2022-06-27T18:04:18", "subreddit": "fuckeatingdisorders", "id": "idyhg19", "text": "Ro is super food focused", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1656353228.0, "datetime": "2022-06-27T18:07:08", "subreddit": "fuckeatingdisorders", "id": "idyhv7g", "text": "I love Hat. They're some of the only people who don't accidentally trigger me at all by having been more stereotypically ill (family knows, UW, irrational food rules etc.)", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1656678992.0, "datetime": "2022-07-01T12:36:32", "subreddit": "fuckeatingdisorders", "id": "ieg0pha", "text": "BONE ATROPHY? MORE LIKE BONE APPLE TEA MY BABE CONGRATSSSS", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1656830532.0, "datetime": "2022-07-03T06:42:12", "subreddit": "fuckeatingdisorders", "id": "ieo52pa", "text": "THANK YOUUUU you have no idea how many times I've thought this??? I love you for this 🥰 I'm gonna get outta bed and make myself a HUGE bowl of morning oats 🤤", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1659819910.0, "datetime": "2022-08-06T21:05:10", "subreddit": "fuckeatingdisorders", "id": "ij8cs7g", "text": "slay tbh", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1661699505.0, "datetime": "2022-08-28T15:11:45", "subreddit": "fuckeatingdisorders", "id": "im4wl4j", "text": "ikr. i just spent 2 months eating massive amounts of carbs ands fats and honestly probably not enough protein bc i wasn't offered it, but i felt better than i have in a long time bc of the sheer fact that i was getting *enough*. idc how many 'portions' of rice i usually ate at mealtimes, i'm unironically guessing about 5. if you need massive amounts of protein and micromanage your intake to try and feel full on as little as possible, you just aren't eating enough and nothing will mask the effects of that.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1662576831.0, "datetime": "2022-09-07T18:53:51", "subreddit": "fuckeatingdisorders", "id": "inhj3r1", "text": "I just ate like 200g of pb... I feel you.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1662584434.0, "datetime": "2022-09-07T21:00:34", "subreddit": "fuckeatingdisorders", "id": "ini3vtg", "text": "Me too!! It was the perfect EH food for me. I'm currently looking for a tattoo artist to get a peanut tattooed because for me it's a symbol of my ED recovery.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1663844973.0, "datetime": "2022-09-22T11:09:33", "subreddit": "fuckeatingdisorders", "id": "ipgc56a", "text": "Thank you. Some things you just can't be reminded of too often.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1669158858.0, "datetime": "2022-11-22T23:14:18", "subreddit": "fuckeatingdisorders", "id": "ixf1ptw", "text": "smh ppl on ed subs are getting wayy too relatable 😩 i need to get that checked out 🤪🤪🤪 jk enjoy the divine spoonful. my health increased immensely when i started doing this <33", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1670914941.0, "datetime": "2022-12-13T07:02:21", "subreddit": "fuckeatingdisorders", "id": "j00vi8a", "text": "when i eat like this, i tell myself i'm bingeing, but when you do it, i see that it's extreme hunger. thank you for this post, it opens my eyes again", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1670915119.0, "datetime": "2022-12-13T07:05:19", "subreddit": "fuckeatingdisorders", "id": "j00vqpy", "text": "might be hormones!! i got my period back and my previously flawless skin has returned to its 13 yr old version", "parent_id": null, "link_id": null, "context": null}
{"type": "post", "timestamp": 1670921076.0, "datetime": "2022-12-13T08:44:36", "subreddit": "fuckeatingdisorders", "id": "zkqxk8", "text": "I know I'm a toxic jealous POS but how am I supposed to believe that I need 3 meals and 3 snacks when I eat like >!600 kcal!< for breakfast everyday and Ro whom everyone looks up to promotes those tiny ass >!200 kcal!< porridge bags as a breakfast??? A MEAL? Or half a cup of oats with nothing but some milk and maple syrup??? Also enough people eating two toasts with a thin layer of cream cheese. Well even with a morning snack, I'm still eating more for breakfast then... I'm spiraling and convinced I eat more than everyone in this world because even before my ED, I would have 2-4 times those portions for each meal every single day whereas others might eat more during EH but consider those tiny portions normal... I'm breaking down bro I am a glutton I can't do this anymore", "title": "Everyone eats so little", "context": null}
{"type": "comment", "timestamp": 1670948821.0, "datetime": "2022-12-13T16:27:01", "subreddit": "fuckeatingdisorders", "id": "j02eqoq", "text": "I know I just shouldn't care but thank you so much for saying this. I thought I was insane", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1670949120.0, "datetime": "2022-12-13T16:32:00", "subreddit": "fuckeatingdisorders", "id": "j02fhtk", "text": "Thank you so so so much. I needed to hear this. Badly.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1670951960.0, "datetime": "2022-12-13T17:19:20", "subreddit": "fuckeatingdisorders", "id": "j02my1n", "text": "Thank you this is reassuring ❤️❤️", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1670975676.0, "datetime": "2022-12-13T23:54:36", "subreddit": "fuckeatingdisorders", "id": "j04dcca", "text": "aw dude i see exactly what you mean. i've also been like that all my life. i wish we could see it as interesting instead of triggering and unfair. people thrive on vastly different amounts of food and that is exactly what ed's don't wanna hear.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1671011813.0, "datetime": "2022-12-14T09:56:53", "subreddit": "fuckeatingdisorders", "id": "j064ixe", "text": "sadly whenever i need to hear this, i just tell myself i didn't have a real eating disorder", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1671266555.0, "datetime": "2022-12-17T08:42:35", "subreddit": "fuckeatingdisorders", "id": "j0kenln", "text": "I'm gonna read this one to myself everyday as an affirmation. You rock!!! I love how much insight you have into your own psyche.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1671698388.0, "datetime": "2022-12-22T08:39:48", "subreddit": "fuckeatingdisorders", "id": "j17vaup", "text": "Thank you for taking the time to write this out!!! I'm proud of you :)", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1671698596.0, "datetime": "2022-12-22T08:43:16", "subreddit": "fuckeatingdisorders", "id": "j17vjwl", "text": "Hope you're eating breakfast lunch and snacks now tho", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1672433574.0, "datetime": "2022-12-30T20:52:54", "subreddit": "fuckeatingdisorders", "id": "j2aj5h2", "text": "people really think they need to justify every fat cell on their bodies. your body will decide what the purpose of those cells is and guide you in the process of building them by regulating your energy intake and expenditure. you don't have to assign them organs to protect. fat is so much more than a pillow to create distance between the world and your uterus.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1673361284.0, "datetime": "2023-01-10T14:34:44", "subreddit": "fuckeatingdisorders", "id": "j3r3vm7", "text": "just saw this now and this comment is my favorite affirmation forever. thank you so much.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1678331647.0, "datetime": "2023-03-09T03:14:07", "subreddit": "fuckeatingdisorders", "id": "jbhrw8r", "text": "Yo wtf I'm crying. Despite being obsessed with ED stories for 8+ years, none have touched my soul like this. Congratulations ❤️", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1679519874.0, "datetime": "2023-03-22T21:17:54", "subreddit": "fuckeatingdisorders", "id": "jd9sqeq", "text": "I'm pretty sure it's because the most common starvation app, MyFitnessPal, sets it as the low limit. It says that anything lower is dangerous, which most people disregard, but what they don't disregard is the myth that you can literally gain weight while eating lower than that because of 'starvation mode'. (Metabolic adaptation does exist and it's dangerous but it does not result in packing on the pounds because you starved yourself eating 1100 calories instead of 1400) So basically, for many people with eating disorders it started off as the most effective way to lose weight in their minds.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1700477553.0, "datetime": "2023-11-20T10:52:33", "subreddit": "fuckeatingdisorders", "id": "ka046mv", "text": "fr... sometimes i feel the guilt of eating a shit ton and then i feel the skin on my face being hella hot and smooth.\n\none time my sister told me i had a 'pretty day'. i did feel kinda cute in mirrors that day bc my face had color and was relaxed instead of anxious and dull. yet i also felt ugly and bloated as hell from eating lots those days. it's one of the best appearance compliments i ever got because it proved to me that i really do look better when i'm fed.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1700478043.0, "datetime": "2023-11-20T11:00:43", "subreddit": "fuckeatingdisorders", "id": "ka04rz9", "text": "YESSS. i spent my first year in 'recovery' worse than ever. i was eating 'like a normal person' and 'intuitive eating' (aka eating tiny bites until i could convince myself my stomach wasn't growling anymore). it was fucking miserable. we need a lot of food to recover, and almost everyone needs more than what we see as 'normal'. even if the smaller portions are truly what average intuitive eaters have, they also have the days where they eat 4 plates of dinner and a full bag of chips - but grazing doesn't get filmed and posted to the platforms many of us are obsessed with.\n\ni'm not a half a cup of oats, 2 slices of bread kinda person. i don't think i'll ever be. healthy for me isn't instagrammable. it's double servings and other people's leftovers. i want a life where i'm not thinking about this. i've seen the light at the end of the tunnel once so it must be possible.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1703423920.0, "datetime": "2023-12-24T13:18:40", "subreddit": "EatingDisorders", "id": "keqjhjm", "text": "that's not allowed but i can tell you people can lose it at any weight. i lost mine in the middle of the normal range and got it back at a significantly lower weight, but still one where many skinny people without ed's sit naturally and have periods. some people get to a rly low weight and never lose it, some get it back quickly, some ages after weight restoration. this person's bmi tells you nothing", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1705043336.0, "datetime": "2024-01-12T07:08:56", "subreddit": "fuckeatingdisorders", "id": "khhix5n", "text": "I've gone through EH and I can second ALL of these.\n\n>- Speaking of boys, I noticed that when I started taking care of myself, my entire energy changed. More boys are talking to me and flirting with me. During anorexia, I separated myself from everyone, and nobody ever noticed me. Now that I am becoming much healthier, I am making more friends, and talking to more boys.\n\nI wanna zoom in on this because I've thought about it a lot. This has been super challenging to me. I was at my worst during lockdown so sometimes I think that's why no one was into me... but then I remember that I spend another 1-2 miserable years in quasi after the strict lockdown. After I went all-in, suddenly men became interested in me, to the point where it overwhelmed me. With my long history of quasi and at a non-critical weight, I actually didn't have much edema and went through hypermetabolism first thing, so I got all the benefits quickly; I saw the results of repair within weeks and felt them within days. \n\nIt was actually troubling for a while, because my body image was problematic and I still have this twisted idea that I could only be attractive if I'm as skinny as possible. The sexual/romantic attention caught me off guard because I was barely expanding the tiny world my ED had me living in. I could hardly hold a conversation because I had no idea what I liked and wasn't up to date with anything I had previously loved.\n\nWithin the framework of \"the body attracts and the soul keeps them there\", recovery is the solution to BOTH. That's not to mention the fact that personality also attracts. Your healthier self is more attractive, and when you're mentally no longer a zombie, you can actually build connection.\n\nI'm nowhere near recovered (because I relapsed. All-in got me nearly fully recovered within months after years of struggling) but so much better than I was. Last week, I reminded the guy I'm seeing that I hadn't tasted his dessert yet. I've thought about him like 10 times more than about food in the past week. It gets better.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1705044419.0, "datetime": "2024-01-12T07:26:59", "subreddit": "fuckeatingdisorders", "id": "khhkjwt", "text": ">I am talking about 4-6 times a DAY.\n\nThis isn't even gross to me, it's so satisfying!!!\n\n>No matter HOW MUCH protein, fats, or perfect 'macros' are in a meal to make a normal person feel satiated, my stomach feels empty. For example, before I had anorexia, I would always enjoy a lovely bowl of oatmeal with protein powder, yogurt, fruits, and peanut butter. That would hold me over for HOURS. However, as I went through ana and decided to recover by honoring ALL of my extreme hunger, that bowl of oatmeal does me no justice. Even if I double or triple the servings, I still feel like a black hole.\n\nActually thank you so much for saying this. Right before opening Reddit I went through a sudden bout of EH and was panicking. I ate pretty much that perfect oatmeal bowl you described and then another apple and I still felt like I hadn't eaten in ages. Then more snacks. Desperately tried to find the perfect macros, because y'know, according to diet culture, I just need to eat an entire chicken to be full and support my mooscles. Waited. Felt like the food had been teleported into the void. Guilt set in. Now I've been reminded of the benefits of honoring that hunger! Thank you.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1705077321.0, "datetime": "2024-01-12T16:35:21", "subreddit": "fuckeatingdisorders", "id": "khjc6jg", "text": "Not at all! If you binge eat, you experience satiety but eat past it dramatically and frequently.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1705136494.0, "datetime": "2024-01-13T09:01:34", "subreddit": "fuckeatingdisorders", "id": "khn9uhw", "text": "a lot of people with restrictive ed's don't. it's because you need a LOT of food.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1720675008.0, "datetime": "2024-07-11T05:16:48", "subreddit": "fuckeatingdisorders", "id": "lcmrc6a", "text": "there's plenty of lactose free chocolate!", "parent_id": null, "link_id": null, "context": null}
