{"type": "comment", "timestamp": 1638687142.0, "datetime": "2021-12-05T06:52:22", "subreddit": "ARFID", "id": "hnapp8x", "text": "I eat different brands but this specific ice cream brand was the best. It was at Walmart and everywhere then they stopped selling it. So I checked the ice cream site, closest store selling o\nit was 2 hour drive away.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1639418952.0, "datetime": "2021-12-13T18:09:12", "subreddit": "ARFID", "id": "hoenllw", "text": "Yeah I always go with my mom or stepsister and it helps but I cry or almost cry in the frozen aisle, so many types of food with multiple items", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1639430712.0, "datetime": "2021-12-13T21:25:12", "subreddit": "ARFID", "id": "hofglpg", "text": "No it actually helps me for them to be there but so many types is overwhelming. Like checking if a food has all safe foods. I find some surprising ones like white wine and butter shrimp Mac and cheese. I don't like butter but it's one of my favorite safe frozen meal. The problem is checking every single thing and I can never remember which ones are okay.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1639431678.0, "datetime": "2021-12-13T21:41:18", "subreddit": "ARFID", "id": "hofiyd1", "text": "I always forgot which meals are good from which brands, also cause mutiple brands have the same food and sometimes I get the wrong one. I don't have a good memory of stuff like that really.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1639794900.0, "datetime": "2021-12-18T02:35:00", "subreddit": "ARFID", "id": "hp03lt9", "text": "Same I was at Ikea and the salads looked crisp and fresh but I wouldn't eat them", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1639797458.0, "datetime": "2021-12-18T03:17:38", "subreddit": "ARFID", "id": "hp08inu", "text": "I forget the name, it was this Italian one, I remember it as brown with red logo.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1640287884.0, "datetime": "2021-12-23T19:31:24", "subreddit": "ARFID", "id": "hppvdp0", "text": "Country crock, cinnamon bread, baby carrots, shredded cheese, pie crust, ice cream, buffalo sauce, water, and ice cubes look good to me", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1640288197.0, "datetime": "2021-12-23T19:36:37", "subreddit": "ARFID", "id": "hppw44v", "text": "Yeah my mom doesn't even have those, I had to MAKE flour. My only option was making homemade oat flour or different time using maple syrup instead of sugar stuff like that…", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1640288245.0, "datetime": "2021-12-23T19:37:25", "subreddit": "ARFID", "id": "hppw86s", "text": "Yeah just those are safe foods to me altgouy  it sure about the exact brand or flavor", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1640559550.0, "datetime": "2021-12-26T22:59:10", "subreddit": "ARFID", "id": "hq2tngv", "text": "The number of times I searched \"_____ replacement\" like baking soda, eggs, peanut butter, tomato, cheese, bread, or anything else because we don't have it at the house or because I can't eat that specific food.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1640581695.0, "datetime": "2021-12-27T05:08:15", "subreddit": "ARFID", "id": "hq42x5w", "text": "Not me but I actually know somebody who ate so many carrots they turned orange…", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1641506595.0, "datetime": "2022-01-06T22:03:15", "subreddit": "ARFID", "id": "hrjubyg", "text": "Sometimes sides include Mac and Cheese like at Cracker Barrel and you can get a side and just a side for 2/3$", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1641589312.0, "datetime": "2022-01-07T21:01:52", "subreddit": "ARFID", "id": "hrot8s2", "text": "Years ago I was at Jamba juice and ordered a smoothie without bananas to extra strawberries cause i have mostly texture issues but hate the smell of bananas. I know it's policy you can change it but they told me to order something else. I ended up going to a Dunkin donuts instead for some frozen drink like I wanted in the first place. I end up usually not ordering items that need to be changed.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1642731443.0, "datetime": "2022-01-21T02:17:23", "subreddit": "ARFID", "id": "htjl2gb", "text": "Yeah people say that picky eaters are bad for the environment. When there are people who drink Fiji or Icelandic bottled water, it's overpriced water that is transported far leaving a huge carbon footprint. I've had them before and they don't taste different from regular bottled water. Assuming those car a way bigger footprint that other foods. I know somebody who is a higher up at restaurant and said that most of the carbon footprint is transportation, even more than meat alone. Also the most environment impact is caused by large corporations and not individuals.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1643410646.0, "datetime": "2022-01-28T22:57:26", "subreddit": "ARFID", "id": "hunbbaa", "text": "I hate strong garlic, I don't buy anything garlic flavored but in foods like bbq sauce a little garlic is okay. Garlic bread is my nightmare lol", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1643425499.0, "datetime": "2022-01-29T03:04:59", "subreddit": "ARFID", "id": "huo8q8c", "text": "I know somebody with ARFID irl who will eat any flavor of Oreos, no matter how weird like carrot cake or coffee. Crazy part is he wouldn't eat any of those alone. Yet I would eat some of it but would not eat those crazy flavors.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1643475432.0, "datetime": "2022-01-29T16:57:12", "subreddit": "ARFID", "id": "huql4we", "text": "Ketchup is my most hated food. The smell alone is bad enough. I love ketchup chips, my favorite type of chip is all dressed which is part ketchup. All dressed is a mix of tomato ketchup, barbecue sauce and salt & vinegar. It's like epic bbq flavor.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1643606357.0, "datetime": "2022-01-31T05:19:17", "subreddit": "ARFID", "id": "huyhucd", "text": "Plot twist: your mom doesn't care what you eat and refuses to buy safe vegatables because they're expensive and nobody likes them… edit: brussel sprouts", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1643641786.0, "datetime": "2022-01-31T15:09:46", "subreddit": "ARFID", "id": "hv01ia8", "text": "I am actually great at cooking, I cook for my family almost nightly. Sometimes I can't eat the food so sometimes I make a \"side dish\" that is all I'm having.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1643647545.0, "datetime": "2022-01-31T16:45:45", "subreddit": "ARFID", "id": "hv0g825", "text": "I like Indian curry and spicy foods for sensory input. According to my family I \"heavily overseason and overspice food.\" I take a safe food like rice and add a ton of Trader Joe's or another brand seasoning blend.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1647149779.0, "datetime": "2022-03-13T05:36:19", "subreddit": "ARFID", "id": "i0glkmj", "text": "I ordered a chicken bacon ranch quesadilla, no ranch sauce. Bunch of jalapeños on it, what???", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1650766512.0, "datetime": "2022-04-24T02:15:12", "subreddit": "ARFID", "id": "i5yafbm", "text": "“But you like (food that tastes or looks similar)\"", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1650775631.0, "datetime": "2022-04-24T04:47:11", "subreddit": "ARFID", "id": "i5yr073", "text": "Great thing to say is \"so you like boiled eggs with Nutella\" this was an actual pregnancy craving. Not me but my younger siblings my mom  ate frozen pizza with instant mashed potatoes. Actually tried it and it's good.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1654990305.0, "datetime": "2022-06-11T23:31:45", "subreddit": "ARFID", "id": "ic11ngw", "text": "Or when you can't even get to the texture because of the smell", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1655929093.0, "datetime": "2022-06-22T20:18:13", "subreddit": "ARFID", "id": "idcgxow", "text": "I hate most ceral except rice based, I can eat gluten but I hate most wheat based items.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1655932862.0, "datetime": "2022-06-22T21:21:02", "subreddit": "ARFID", "id": "idcpsks", "text": "Rice puffs and rice squares I love, I can eat fruity/cocoa pebbles. Pretty much for wheat I can only eat bread from the bakery section of a grocery store and a specific brand of pasta. Most breaded food is bad and ultra thin pizza only.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1658802142.0, "datetime": "2022-07-26T02:22:22", "subreddit": "fuckeatingdisorders", "id": "ihnwhc9", "text": "Same, I used to buy special items online that were the lowest calorie and wouldn't cook because I couldn't track calories as easily. I ate a lean cuisine or other frozen meal 5 days a week immediately after school. I used to eat them for dinner too frequently. At one point but only a month I would eat only frozen meals and nothing else. Now I occasionally enjoy them and more than just the lean cuisine type.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1658989913.0, "datetime": "2022-07-28T06:31:53", "subreddit": "ARFID", "id": "ihyjpxu", "text": "Mine was ice cream cones, hated ice cream as a kid and still do kinda, so just cones", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1659987520.0, "datetime": "2022-08-08T19:38:40", "subreddit": "ARFID", "id": "ijhe0xb", "text": "Never tried it but cheese bread sounds okay but then again I thought head cheese was until I learned what that meant.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1666119856.0, "datetime": "2022-10-18T19:04:16", "subreddit": "ARFID", "id": "isu7siu", "text": "Yeah a lot of stuff you need a doctor for in other countries is just over the counter in America. Not saying it's right there's people who eat foods that they know cause heartburn and just eat a lot of Tums to make up for it. I understand here it's very expensive to make a doctor's appointment only to have a follow up. I've been to an eye doctor and okve I dislocated my shoulder but haven't been to a regular doctor for a check up or anything in 5 years now. I've never gotten any sort of blood or other test in my life (excluding as a baby). My mom doesn't believe in vaccines and I'm only partially vaccined.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1666196800.0, "datetime": "2022-10-19T16:26:40", "subreddit": "ARFID", "id": "isycenq", "text": "Yeah even depends by store, I am on an otc med called Alli weight loss meds since I ate mostly junk. I got carded and my mom had to show her I'd because I'm 17. Although I'm 18 next week.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1668490456.0, "datetime": "2022-11-15T05:34:16", "subreddit": "ARFID", "id": "iwfe2t1", "text": "I no longer like Skyr but now cottage cheese is fine, in particular the Kroger skyr cheesecakes still taste okay for some reason. But good news actually I can now eat cottage cheese. Right now my safe dairy products are plain cheeses(including blue, feta, and mozzarella,) ricotta, cheese curds, cottage cheese, panneer, sour cream, cream cheese, and ice cream. I'm pretty proud of what I can eat with dairy. I still can't have any form of fully liquid dairy like milk or cream.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1668491079.0, "datetime": "2022-11-15T05:44:39", "subreddit": "ARFID", "id": "iwff08j", "text": "Same, restaurants aren't that bad I can order pizza, used to be Alfredo sauce only but now I can eat tomatoes. I always order a thin crust bjy can get some toppings if they're safe foods like pineapple (no ham) or buffalo chicken. I usually get plains meat/fish with sides of rice or any form of potatoes. I have to avoid all items with certain sauces that's the main problem. I can eat most vegatables if cooked until mushy. Recently I ate a Greek pizza with thin crust, olives, feta, mutiple vegatables because those are all safe eve I'd the food is weird. I accidentally ate dip with dressing not realizing dressing meant mayo and still feel sick days later.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1668491335.0, "datetime": "2022-11-15T05:48:55", "subreddit": "ARFID", "id": "iwffdq8", "text": "I have the same thing. I can't eat plain pasta it has to be covered in sauce. I don't love sugary foods except diet soda. I tried pumpkin pie and hated it, sweet potato pie is good. I'm still obese because of binge eating because my mom restricted my food leading to me sneaking food for years and I'm trying to stop.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1668491453.0, "datetime": "2022-11-15T05:50:53", "subreddit": "ARFID", "id": "iwffjy3", "text": "This is weird because mayo is my \"least safe\" food the white thick liquid in the jar looks so bad. But plain toasted thin bread or tortillas with meat is good.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1668496708.0, "datetime": "2022-11-15T07:18:28", "subreddit": "ARFID", "id": "iwfmo2i", "text": "My mom really tried to get me to try it as a kid but I refused to. I can eat mustard but I can't physically see it in the bottle. I've heard other people say the same thing. Something about the sauce in the bottle is weird. Yeah probably I would hate olives if I didn't regularly eat them as a kid. 95% of my issue is texture not taste with food. Olives have an okay texture like a pepper in texture. The flavor I do slightly dislike but I can eat it since the texture is good. I'm used to eating them though since my family did.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1669699683.0, "datetime": "2022-11-29T05:28:03", "subreddit": "ARFID", "id": "iy716xt", "text": "I have texture issues, I have a few scents I hate too, this is literally useless to me. It doesn't matter that the fkavid is the same like milk tastes exactly like cottage cheese I don't want it. I care that it's a weirdly thick liquid.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1670894906.0, "datetime": "2022-12-13T01:28:26", "subreddit": "ARFID", "id": "izztrw2", "text": "I've wanted to eat bananas my whole life. I've tried every way but the smell makes me gag. I get cravings for bananas but can never actually eat them. I wish I could just eat a banana.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1670955026.0, "datetime": "2022-12-13T18:10:26", "subreddit": "ARFID", "id": "j02v5qr", "text": "Hmm… maybe try a \"weird\" salad like shredded carrots or rice or something as the base with dressing. Just try anything with salad dressing at first and then slowly go to a \"normal\" salad. Any leafy greens besides lettuce like arugula, spinach, collard greens, cabbage, watercress, swiss chard, endive, or bok choy could be considered \"normal.\" Idk about mayo based salads like potato or egg salad since I hate mayo. I do like to have mayo salads but using sour cream instead.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1672777347.0, "datetime": "2023-01-03T20:22:27", "subreddit": "ARFID", "id": "j2tahaa", "text": "Yeah the scent is bad for me, I can only eat PB flavored stuff if it doesn't smell strong", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1673386105.0, "datetime": "2023-01-10T21:28:25", "subreddit": "fuckeatingdisorders", "id": "j3sz305", "text": "Yeah noon is basically MyFitnessPal again but rebranded. I never used it personally just from what I've seen.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1673386202.0, "datetime": "2023-01-10T21:30:02", "subreddit": "fuckeatingdisorders", "id": "j3szcrm", "text": "I'm not sure on every platform but you can block ads about trigging topics on Instagram. Ended up getting Hulu premium to avoid the constant ads about alcohol and one about medicine to help with bedroom stuff using vegetables to represent the thing.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1673499993.0, "datetime": "2023-01-12T05:06:33", "subreddit": "fuckeatingdisorders", "id": "j3zx100", "text": "Yeah I don't know exactly because like I said I've never used it. My mom was very fortunately too cheap to actually put me in any program or anything like that. Unfortunately too cheap to put me in any treatment. Now, I personally don't struggle with amount as much as certain foods. A program that pushes certain foods are worse than otheds would be horrible for me personally. Certain foods I love I haven't had in years now.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1675722576.0, "datetime": "2023-02-06T22:29:36", "subreddit": "ARFID", "id": "j7hwjp0", "text": "NSFW m look away if mayo is a safe food\n>!I've hated mayo and was googling why, sure said it's because it looks like semen whifh I never connected that's why it looked bad to me!<", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1675927074.0, "datetime": "2023-02-09T07:17:54", "subreddit": "ARFID", "id": "j7tfe2i", "text": "Yes I saw that George Washington ate corn based pancakes which I like cornbread so I'm guessing I would like since I love cornbread", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1679777463.0, "datetime": "2023-03-25T20:51:03", "subreddit": "ARFID", "id": "jdnyvxi", "text": "If there even one pizza toppings you like out of this list it's good because it could bulk the pizza up without a lot of calories, \nFlavorful cheese or a mix of mutiple cheeses\nMozzarella (shredded)\nMozzarella (buffalo)\nParmesan\nProvolone\nRicotta\nBleu cheese\nGoat cheese\nFeta cheese\nBuratta\nGorgonzola\nGruyère cheese\nFontina\nPepper jack\nCheddar\nBrie\nColby Jack\nPecorino Romano\n\nmeat list (vegan versions of most are available)\nPepperoni\nSausage\nHamburger/Ground beef\nHam\nCanadian bacon\nShredded or chopped chicken\nSalami\nProsciutto\nAnchovies\nPulled pork\nMeatballs\nSliced Italian Sausage\nShrimp\nEgg\nChorizo\nSopressata\nKielbasa\nHot dogs\nVegatables (you can add them raw after pizza is done cooking)\nGreen peppers\nMushrooms\nSweet onions\nRed onions\nGreen onions\nCaramelized onions\nFrench fried onions\nBlack olives\nRed/yellow/orange bell pepper\nBanana peppers\nJalapeño peppers\nArtichokes\nEggplant\nZucchini\nSpinach\nBroccoli\nCauliflower\nTomato (beefsteak sliced)\nCherry tomatoes\nShredded brussel sprouts\nArugula\nBean sprouts\nDill pickle\nPotato (thinly sliced)\nCorn\nAsparagus\nYellow squash\nSweet potato\nLeeks\nKale\nRoasted red peppers\nSun dried tomatoes\nFruit (you can use any, these are most common)\nPineapple\nPear\nFig\nAvocado\nApple\nPeaches\nHerbs (flavorful)\nBasil\nOregano\nThyme\nParsley\nCilantro\nRosemary\nCrushed red pepper\nNuts (not sure)\nSliced almonds\nPine nuts\nCrushed Walnuts\nPeanut crumbles\nUnconventional toppings\nChicken nuggets\nTaco meat\nEggs\nPeanut butter", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1680484595.0, "datetime": "2023-04-03T01:16:35", "subreddit": "ARFID", "id": "jeqdbp4", "text": "Same, I thought I was the only one who specifically couldn't eat thick liquid. Most sauces are bad too because liquid. Then slushies and ice pops are okay for me. Very thick almost solid things like jello, grits, and oatmeal are okay too. Very very thick yogurt (skyr) and milkshakes are good too.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1680626894.0, "datetime": "2023-04-04T16:48:14", "subreddit": "ARFID", "id": "jexs3mt", "text": "Even if it's different foods it's still good to be able to have different shapes of pasta. So far I can eat most shapes of pasta except orzo or smaller because it felt weird in between my teeth. Some options to explore from pasta is filled pasta like ravioli, cheese, meat, and vegetables or a combo is most common for store bought but anything can be homemade. Gnocchi you can try sweet potato gnocchi which has the same texture but sweet. Egg pasta (De Cecco in USA) is also another type of pasta of you like egg flavor. Ramen and other noodles taste different though.", "parent_id": null, "link_id": null, "context": null}
