{"type": "comment", "timestamp": 1634696860.0, "datetime": "2021-10-20T02:27:40", "subreddit": "EatingDisorders", "id": "hhbbu5o", "text": "I am really confused here. What exactly DO you want? You don't want inpatient, and you don't want outpatient. You don't want professionals who are educated to help you, you don't want anything that resembles a meal plan, you don't want anyone to enforce normal eating habits.What actually does *effective help* mean to you?\n\nI'm also curious, what is your ED about? What purpose does it serve? Why are you scared of change? If what you're saying is true - there seems to be nothing stopping you from \"just eating\" other than your own free will .. why can you not just do that? Why can't you binge and not purge, knowing that eventually your body will not longer need to binge? You obviously cannot be afraid of gaining weight if you are worried that treatment restricts your eating, most people are terrified of being given too much. \n\nI feel like you just want this magic wand waved, but thats not going to happen. You can recover on your own - you know what you need to do and you have the desire to do it - so go ahead? Most people who need treatment centres do so to learn the exact things you don't want a bar of (portion control, meal times etc) and to work through whats driving the ED (control/emotions etc which do not appear to apply to you).\n\nIf you do not want to go residential or outpatient, my practical advice would be to read Brain over Binge. Once you've committed yourself to stop purging and stop restricting, you will stop binging too. But it has to be in that order. It sounds too easy, but the way you're describing your ED, it sounds 'too easy,' I'm not sure if it's denial, but I really want you to think about WHY change is so hard. Because from what you've said, it's very much ALL about control.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1634780517.0, "datetime": "2021-10-21T01:41:57", "subreddit": "EatingDisorders", "id": "hhfu788", "text": "Hey, thanks for replying. I do agree with a lot of what you say, and totally believe that some people have a biological genetic predisposition to eating disorders, I think mine is too.\n\nWhile the 'cause' doesn't necessarily need to be psychological, the reason we *hold on* to our EDs, and are so resistant to treatment, is very much a psychological thing. This is what I mean by 'a purpose.' If our ED gave us no perceived benefit, or served no purpose, we'd give it up in an instant. But there is SOMETHING that keeps us hooked onto the thoughts. And for you it sounds like it's partly phobia of weight gain. Which is common in EDs, but it is psychological, and it's irrational - gaining weight is not a bad thing. You will not binge yourself to death, you will not become morbidly obese. (All phobias are psychological. And my grandma did a fear-of-flying course, they absolutely do share the chances of being in a crash - the minimal risk actually helps people realise planes are safe)\n\nNo one is 'judging you' or making you restrict. If you had three bowls of cereal at home, you'd probably restrict later on to compensate? That's contributing to this binge/restrict cycle. In treatment, they'll teach you to eat one bowl, that's not restriction - that's normal, and train you sit with the urges to eat more. In a few hours, you may be given a snack, and then lunch. That's what normal eating is. Until your brain knows that it will get food soon, it will constantly be urging you to binge.  You cannot trust your own brain right now to tell you what it needs, because it's starving. You need other people to make those decisions, and not wanting to do so, is a form of needing 'control.' You need to re-wire your brain, and the only way to do that is sustained, regular eating patterns. And if you can't do that in the community, you will need residential care to fix it.\n\n**Unfortunately with recovery, the only way through is to allow yourself to feel the guilt and discomfort when you binge, without purging, and without restricting. You will binge, it will happen. But you have to learn to sit with it and not compensate, that is the only way to stop doing so. You need to gain to a healthy weight, and you will feel fat. Recovery is uncomfortable. You will feel all the things that were suppressed by your ED.  And sometimes I believe that it's only during recovery, that we realise what exactly what our ED served us, what it's purpose was and the reason we relied so heavily on it.**", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1634796942.0, "datetime": "2021-10-21T06:15:42", "subreddit": "EatingDisorders", "id": "hhgmssn", "text": "Okay, so say we let you eat without restriction? What will happen? You'll binge? Then what, you'll panic, and purge or restrict? A person who is so deep in their ED cannot make decisions around food, your decision is too clouded by what your ED has to say about it. You need to let someone make the decisions for you, and accept that perhaps you don't know best when you're in this frame of mind. You being combative isn't helping. A treatment centre won't make you restrict. \nBinge eating is self harm behaviour, so I'm not going to say it's good. Look, the only way you're going to stop binging is by NOT restricting or purging afterwards. You have to be able to sit with a binge.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1634853875.0, "datetime": "2021-10-21T22:04:35", "subreddit": "EatingDisorders", "id": "hhjnvhr", "text": ">*They will, if I want more than they give and they don't allow me to get it. Which is exactly what my ED does. I mean what does restriction even mean then?*\n\nRestriction is eating less than what your body requires. A treatment centre will not do that, and I highly doubt you will be hungry when you're there. They give you enough. \"If i want more than what they give and they don't allow me to get it\" - that just sounds childish imo.\n\n&#x200B;\n\n>*That binging is bad, that I don't really need that food, and therefore I should keep restricting because it's all just in my head and one bowl of cereal is enough.*\n\nYou're forgetting there is plenty of middle ground. Just because binging is bad doesn't mean you should keep restricting. Restricting is even more bad for you. Both are self-harming. (And three bowls of cereal is not a binge - I am talking about binge eating as in thousands of calories in one sitting) Your binges are purely reactive eating, that is a response to starvation. They will not stop until you start eating enough and regularly. \n\n&#x200B;\n\n>*So if a starving boy in Syria binges, he's self harming?*\n\nAre you actually comparing eating disorders to extreme poverty?   \n\n\nI'm going to leave the conversation here. Until you accept that you need to stop restricting in order to stop binging (or reactively eating.. whatever you call it), you will not get better. I had extreme hunger for about 8 months, and most certainly binge ate most days. I eventually gained to a healthy weight, and now I don't binge. It's been seven years since I weight restored.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1644902009.0, "datetime": "2022-02-15T05:13:29", "subreddit": "AnorexiaNervosa", "id": "hx012t4", "text": "Oh the smells and the songs, I completely feel this. I actually just talked to my psychologist about this the other day. Mum brought some of these vegetarian sausages home last week, we hadn't had them in the house for years but they were something that I was encouraged to have by my dietitian years ago (like meat alternatives for protein etc). \n\nWhen she cooked them, the smell just send me in a whirl. Everything just came back, it felt like I was standing in the same place I was 10 years ago worrying about these sausages. Sigh. \n\nAny song that was 'big' where I am in 2009-2013 is enough to make me cry. \n\nSuperchick songs like 'Courage' and 'Stand in the Rain' (massive in the ED community - particularly on youtube 'my anorexia story' vids - back in 2009).. the intro music makes my stomach flip.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1648108742.0, "datetime": "2022-03-24T07:59:02", "subreddit": "AnorexiaNervosa", "id": "i1wlxad", "text": "Completely understand. I've weight restored, and although I am constantly told my brain has 'forgotten' some of the most painful times of being underweight, I still truly believe I was better off being underweight. It's really sad.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1649443503.0, "datetime": "2022-04-08T18:45:03", "subreddit": "EatingDisorders", "id": "i3xpaqp", "text": "I refuse. I'm weight restored, I know my own weight and it's healthy and stable. There is no need for it.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1652166385.0, "datetime": "2022-05-10T07:06:25", "subreddit": "EatingDisorders", "id": "i80ulp0", "text": "I developed anorexia shortly after my periods started aged 15. I pretty much went through a second puberty aged 21-23 after I weight restored. My breasts grew to a pretty normal size I think - well small by society standards (like a B cup). My issue is that I don't want them, I want them gone. I am so distressed by my female body it's destroying me. \n\nAnorexia definitely disrupts growth, not just physical but emotional and sexual too. Go easy on yourself, you can catch up - your body has just experienced a bit of trauma that it needs to recover from!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1654457906.0, "datetime": "2022-06-05T19:38:26", "subreddit": "AnorexiaNervosa", "id": "ibaabzs", "text": "Aw thats so sad.. can I ask what triggered it??", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1670796273.0, "datetime": "2022-12-11T22:04:33", "subreddit": "AnorexiaNervosa", "id": "izu9fl0", "text": "Oh my heart goes out for you. I am so sorry I have no solutions. The system is so much bigger than us, it feels impossible to fight. I am so angry on your behalf, and so sad for her. Please keep us updated.\n\nI recommend the Around the Dinner Table Forum - a free service for parents of children with eating disorders. There are some really experienced parents on there x \n\n[https://www.feast-ed.org/forum/](https://www.feast-ed.org/forum/)\n\nYou can browse through some of the recent discussions without joining here [https://www.feast-ed.org/forum/?p=around-the-dinner-table-online-forum-for-parents-and-carers-136439](https://www.feast-ed.org/forum/?p=around-the-dinner-table-online-forum-for-parents-and-carers-136439)", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1683709511.0, "datetime": "2023-05-10T09:05:11", "subreddit": "EatingDisorders", "id": "jjky4a3", "text": "I am the complete opposite. Anorexia numbs everything. I feel light and on top of the world when I'm underweight. I feel good. I go out places. I feel confident. \n\nWhen I weight restore I'm hit with the most godawful emotions. Anxiety is through the roof. Feel so out of control. I'm miserable.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1683886015.0, "datetime": "2023-05-12T10:06:55", "subreddit": "EatingDisorders", "id": "jjus828", "text": "My anxiety and depression got significantly worse during the years I was weight restored. I regret ever trying to recover", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1696214873.0, "datetime": "2023-10-02T02:47:53", "subreddit": "AnorexiaNervosa", "id": "k33a3hh", "text": "Maaate I'd love to have seen your wee spidey... is it called Buttercup!? Also... I now know that there is a tarantula subreddit.. \\*shudder\\*", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1696235868.0, "datetime": "2023-10-02T08:37:48", "subreddit": "AnorexiaNervosa", "id": "k346sd2", "text": "But you did say \"I'm not hungry\" 😅😅 \n\nJokes aside I'm so sorry 😔", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1698143410.0, "datetime": "2023-10-24T10:30:10", "subreddit": "AnorexiaNervosa", "id": "k68btpl", "text": "This is amazing! Phenomenal effort there, well done you!!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1704608785.0, "datetime": "2024-01-07T06:26:25", "subreddit": "AnorexiaNervosa", "id": "kgp62d3", "text": "This is so amazing aww well done!!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1706078257.0, "datetime": "2024-01-24T06:37:37", "subreddit": "AnorexiaNervosa", "id": "kjbfcpo", "text": "Shit, that's awfully sad. I have no idea what to do. It's a hard one, because I'd imagine the last thing she wants is to have someone intervene. \n\nBy the sounds of it you live in an apartment / hotel? Do the owners of the hotel have anything to do with you? Could you talk to them?\n\nI had a similar issue with a friend of mine, I didn't know where he lived, but I knew it was in a motel in another city. I managed to narrow down a couple, and just phoned them asking them to do a welfare check on \"the young man who lives there\" .. they found him dead.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1718866735.0, "datetime": "2024-06-20T06:58:55", "subreddit": "EatingDisorders", "id": "l9ffonp", "text": "Don't don't don't. Don't say anything. Honestly, even the whole \"your hair looks healthier\" is no go imo. Just don't say anything looks healthier/brighter THAN BEFORE.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1718950194.0, "datetime": "2024-06-21T06:09:54", "subreddit": "EatingDisorders", "id": "l9kur6z", "text": "Yes this is so important. I had someone tell me my skin complexity looks way better than before. To me I just heard that as \"well I'm eating enough and look healthy now\" and that was just as harmful as \"you're bigger than before\" !!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1720245291.0, "datetime": "2024-07-06T05:54:51", "subreddit": "EatingDisorders", "id": "lbuvbhl", "text": "At one point you're going to be on your own. Full recovery happens when you're making the decisions yourself, without anyone watching. Some people absolutely need a facility to get going but in the end it really has to come from you.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1722340533.0, "datetime": "2024-07-30T11:55:33", "subreddit": "EatingDisorders", "id": "lfmw7gr", "text": "I know this is horrible to say but it surprises me when people say things like this.. 'omg I have osteopenia that's it I'm gonna recover now\" .. and then just do. \n\nGood on you and stuff but I can't be convinced to get better to save my life, imagine being convinced to recover just to avoid osteopenia..", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1723093899.0, "datetime": "2024-08-08T05:11:39", "subreddit": "EatingDisorders", "id": "lh293te", "text": "My opinion wouldn't really be based on whether the person 'self-diagnosed' or not, but what they say their symptoms are. Unpopular opinion incoming - **please remember that someone 'not being valid to me' doesn't mean they don't have an issue. Me 'not believing they have an ED' doesn't mean they DON'T. My opinion really doesn't matter. You don't have to think I am valid either!** \n\nA friend of mine used to talk about the time she had an (undiagnosed) ED when we were in high school. I don't call what she 'went through' an ED for various reasons I won't get into.\n\nI think a lot of people on tiktok/instagram etc claim to have EDs that don't - they have disordered eating or get a bit obsessed with diet/exercise. I don't think many of them have valid EDs. \n\nNowdays, many of the above people could get diagnosed if they went to their doctor and listed off the symptoms they've convinced themselves they have. For example, if you scroll tiktok, you can pretty much learn what you'd need to say to get diagnosed. \n\nI used to follow a number of girls who are diagnosed who also have personality disorders, I truly believed they exaggerated their ED symptoms as a way to seek attention (seeking attention isn't necessarily bad, it's a part of their illness/trauma response).\n\nI would absolutely accept someone's ED was valid if they weren't diagnosed. But these are psychiatric illnesses, they are dangerous, and life changing. It's not just something that comes and goes.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1725767804.0, "datetime": "2024-09-08T03:56:44", "subreddit": "EatingDisorders", "id": "lm2942y", "text": "Omg 2pm was my time for ages. What is it about that time haha!!?", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1726476360.0, "datetime": "2024-09-16T08:46:00", "subreddit": "AnorexiaNervosa", "id": "lndr35y", "text": "Oh god this. Literally had this conversation with a normal eater the other day. She said she was so hungry so went and got two bits of toast.. then came back and just carried on with her day.. what?\nSo I asked her haha.. (she knows I have anorexia and I often ask things like this)\n\n\"Are you full after your two bits of toast\" \n\n*\"well, no, I'm not full, I'm just no longer hungry\"*\n\n\"And you're just okay with that, to just be not hungry? Don't you worry that you will be hungry again too soon\" \n\n*\"uhh.. I don't know, I don't really think about it, if I get hungry I'll eat something else I suppose\"*\n\n\"And you're like okay with being hungry?\"\n\n*\"Yea can eat later!\"*\n\n**Fml. Why is it that every time I eat, I NEED to feel full. Like what the fuck is the point of eating if it doesn't make me feel any more full than i was before.** It's literally why I starve all day and eat all my cals in the evening. So I can actually get full once a day. She just runs on \"just satisfied enough\" all day!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1726476485.0, "datetime": "2024-09-16T08:48:05", "subreddit": "AnorexiaNervosa", "id": "lndr8zq", "text": "Oh god this!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1729787783.0, "datetime": "2024-10-24T16:36:23", "subreddit": "AnorexiaNervosa", "id": "ltjc6hl", "text": "Totally agree. In order to recover you have to let go of that ED identity.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1730420429.0, "datetime": "2024-11-01T00:20:29", "subreddit": "AnorexiaNervosa", "id": "lus7nss", "text": "Yep haha  or more that i have a collection of safe options /combinations and I'll stick to that!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1731402771.0, "datetime": "2024-11-12T09:12:51", "subreddit": "AnorexiaNervosa", "id": "lwq2172", "text": "Oh my gosh that's amazing!!!! Well done you, you ought to be so proud of yourself!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1731887220.0, "datetime": "2024-11-17T23:47:00", "subreddit": "EatingDisorders", "id": "lxo9dbk", "text": "It's hard when you've weight restored and every time you try remind yourself \"I needed to do this in order to participate in life again\" you see someone super thin who appears to be participating in life just fine. So why did I need to gain all this weight? Or \"why was I made to gain weight if she's allowed to live like that\"\nI found myself getting way more triggered by people at a healthy weight than when I'm underweight.\n It's so bloody hard. I'm sorry. Ariana looks terrible. Please take care x", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1732347546.0, "datetime": "2024-11-23T07:39:06", "subreddit": "EatingDisorders", "id": "lyjq13w", "text": "I feel like everyone in my life is on some weight loss journey. It's horrible and very awkward when I walk in on people talking about their diets then they just go \"hey we're just talking about work\" \n\nI get they're trying to not discuss it in front of me but yea it still is hard.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1732583042.0, "datetime": "2024-11-26T01:04:02", "subreddit": "EatingDisorders", "id": "lz01qv4", "text": "You knew Nikki Grahame?!?! 😍😍", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1733784170.0, "datetime": "2024-12-09T22:42:50", "subreddit": "AnorexiaNervosa", "id": "m19p1fv", "text": "Holy shit, I am so so sorry to hear this. Such a devastating loss, heartbreaking. Sending love to you and your family.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1734058057.0, "datetime": "2024-12-13T02:47:37", "subreddit": "AnorexiaNervosa", "id": "m1ssbbw", "text": "It's such a huge deal to eat infront of colleagues, I work 12 hour shifts therefore have to eat 3x in front of people and I promise if you keep it up it will get easier!!!! This is awesome, well done!!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1734451583.0, "datetime": "2024-12-17T16:06:23", "subreddit": "AnorexiaNervosa", "id": "m2ier3e", "text": "I can relate to all of this 200%\n\nEspecially the last sentence. \n\nThank you for being honest, you're definitely not the only one x", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1735369833.0, "datetime": "2024-12-28T07:10:33", "subreddit": "AnorexiaNervosa", "id": "m45tmnj", "text": "I haven't been near that state but I know someone who died from this, and he documented it in a lot of detail. Some of the symptoms near the end included  \n\\- Extreme weakness. Started with things like struggling to lift legs to get up stairs, then being unable to bend down to pick something up (unable to stand back up) then struggling to stand from a sitting position, then having to physically pick up and move one leg at a time to get onto the bed, paralysis of one side of the body and eventually being unable to lie flat because he was certain he'd not beable to push himself back up. \n\n\\- Incontinence, bladder and bowels. \n\n\\- Heart rate irregularities - really slow to really fast\n\n\\- Difficulty swallowing, every swallow felt like choking. Eventually he'd just spit rather than swallow.\n\nIt is truly an awful, painful, scary way to die.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1735446429.0, "datetime": "2024-12-29T04:27:09", "subreddit": "AnorexiaNervosa", "id": "m4b23bo", "text": "What a bitch of an employer. I don't know where you're based, but this is likely illegal. You are entitled to your sick leave. Please take this further - you owe it to yourself.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1738154709.0, "datetime": "2025-01-29T12:45:09", "subreddit": "EatingDisorders", "id": "m9ta8h9", "text": "It's a delusional happy in a way but yeah, you can be I think. Who am I to tell someone they can't truly be happy?", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1739689716.0, "datetime": "2025-02-16T07:08:36", "subreddit": "EatingDisorders", "id": "md1dnrz", "text": "YES oh gosh. I can feel when I've gained weight under my arms, between my fingers, obvs between my thighs.. horrible :(", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1740081731.0, "datetime": "2025-02-20T20:02:11", "subreddit": "AnorexiaNervosa", "id": "mdv0wa1", "text": "Yes but OP, the terms ana and mia are also the cutesy terms that romanticize EDs. Use the medically correct terms AN and BN.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1742620675.0, "datetime": "2025-03-22T05:17:55", "subreddit": "AnorexiaNervosa", "id": "mj3p96f", "text": ">they are saying all their food noise and food obsession has lifted and just gone away. Isn’t that nice? It’s anorexia in an injection\n\nAnorexia is the complete opposite of that though. Anorexia creates a LOT of food noise and a huge obsession with food. \n\n>People are paying to inject themselves with drugs to help them basically become more anorexic... \n\nOzempic doesn't make people have anorexia. It helps obese people lose weight and become a healthy weight. Not severely underweight.\n\n>..but society now glamorizes it and everyone wants to low key be anorexic now. \n\nPeople want to 'low key' be slim , not anorexic.\n\n>but wouldn’t it be cool if they could make a drug for food noise to go away regardless of weight\n\nYes it would. Supposedly some anti-psychotics do this. But what also does this is recovery. I mean, it doesn't have to be as bad as it is currently.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1742620893.0, "datetime": "2025-03-22T05:21:33", "subreddit": "AnorexiaNervosa", "id": "mj3pn0e", "text": "Interestingly enough I know someone who was on duromine, and like ozempic she actually did claim the food noise was gone. She's a friend of mine and I do believe her. \n\nI think some medication can do that.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1742701487.0, "datetime": "2025-03-23T03:44:47", "subreddit": "AnorexiaNervosa", "id": "mj9adtb", "text": "Yes but the bandaid is sometimes enough for things to heal a bit, or at least for new habits to form. I do believe people who say their food noise disappears with a medication. Just like hallucinations disappears with antipsychotics. Yup, when they stop the medication the food noise may come back, but if the initial weight loss or reduction in binge eating has at least kick started better habits it might help. What's worse, going uphill then downhill again or just staying on the downhill? Isn't it worth a shot?", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1742785945.0, "datetime": "2025-03-24T03:12:25", "subreddit": "AnorexiaNervosa", "id": "mjf71k0", "text": "This whole post is about Ozempic .. 🤦‍♀️", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1743791359.0, "datetime": "2025-04-04T18:29:19", "subreddit": "AnorexiaNervosa", "id": "mlf0jgt", "text": "Yes me too!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1744593812.0, "datetime": "2025-04-14T01:23:32", "subreddit": "AnorexiaNervosa", "id": "mmzpk6r", "text": "I get you. My brain goes places I feel really bad about. I don't think 'fat' looks nice or pretty. I think it looks hot and uncomfortable and very undesirable. I see overweight people and think \"I am so glad I do not look like that,\" I see some large people wearing certain revealing clothes and think \"if I was that size I wouldn't want to wear that\"  \nBUT I don't hate the person, I really pity them. I am empathetic and I usually assume they have an ED of sorts too. I don't actually see a fat person and think they're lazy or lack willpower, and I definitely don't think they're less good at their job or less smart etc, I really just think about how the fat looks and yep, it does for a moment make me feel better about how I am.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1745375915.0, "datetime": "2025-04-23T02:38:35", "subreddit": "EatingDisorders", "id": "mojltpf", "text": "God I am so sorry you're going through this. Her poor family. That's terrible. \n\nIf I was in your shoes - yeah I'd tell her actually. I feel like, if she really is at the point of no return, give her the reassurances she so desperately needs and take away some of the mental agony for a short while. Yeah she'll ask again and again, but if she really is dying - the only thing really doing more harm is her own distress.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1747347372.0, "datetime": "2025-05-15T22:16:12", "subreddit": "AnorexiaNervosa", "id": "msj0999", "text": "Jesus what? I know that sounds incredibly traumatic but if you're able to, can you explain a bit further? How the heck does that happen??", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1747347515.0, "datetime": "2025-05-15T22:18:35", "subreddit": "AnorexiaNervosa", "id": "msj0ojm", "text": "This isn't physical but the social consequences. Not such an issue when you're a teenager or early 20s. But when you're in your 30s and you still feel like a teenager, never left home, never been in a relationship, unable to attend the weddings of the small group of friends you have left because it runs through two meal times, no children and utter fear of anyone ever getting close enough to make that possible, being unable to eat at cafes, restaurants, WORK functions (if you're able to hold down a job - but do you know how stupid that looks?)", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1749030420.0, "datetime": "2025-06-04T09:47:00", "subreddit": "AnorexiaNervosa", "id": "mvx9p25", "text": "Woah that's so fucked up lol!!! \n\nI often wonder if the original Willy Wonka's oompa loompa song would be approved for children's movies these days. \n\n\"What do you get when you guzzle down sweets?\nEating as much as an elephant eats\nWhat are you at? Getting terribly fat\nWhat do you think will come of that?\nI don't like the look of it\"", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1749558241.0, "datetime": "2025-06-10T12:24:01", "subreddit": "AnorexiaNervosa", "id": "mx06f9y", "text": "Yup!!!!! No-one judges my getting up at 1030am and going to bed at 8pm. So much more comfortable to be hungry and lethargic when the days are short and its acceptable to curl up on the couch all day.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1750286880.0, "datetime": "2025-06-18T22:48:00", "subreddit": "EatingDisorders", "id": "myj91b0", "text": "My mum didn't let them put me in a treatment facility when I was 15 because I begged her not to. \n\nIm 30 now, I'm still really unwell. The best thing that could have happened would have been I was put in hospital and weight restored within the first year or 2 of becoming unwell. \n\nI am so sorry. She is so young. But this is her best shot at getting her life back xx", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1751195438.0, "datetime": "2025-06-29T11:10:38", "subreddit": "AnorexiaNervosa", "id": "n0e1x34", "text": "A lot of people have families who say and do this kind of stuff though!!!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1752783585.0, "datetime": "2025-07-17T20:19:45", "subreddit": "EatingDisorders", "id": "n3p1f9a", "text": "I think there's too many negatives hang on. Is this what you're trying to say?\n\"I think the only people capable of being an effective ED specialist are those with lived experiences of EDs?\"\n\nI disagree wholeheartedly. Providers use evidence based models of treatment, which is pretty standard across the board. Regular, adequate nutrition is key. Clinical psychology to address underlying stuff sure. But the knowledge these professionals have can be taught. They can't learn what it truly feels like, but I believe that is not a necessary part of treatment. There is not one thing that a person can say that can make you want to recover. It has to come from you. And it's as simple and as difficult as eating regularly, restoring nutrition (and weight, FULLY) and consciously, consistently choosing to go against the ED. And you don't need a person with lived experience to tell you that.\n\nPeer support has its place. In fact can be very useful for some illnesses, but ED's? Mmm, not always. I think people with lived experiences with EDs should be very careful about going into work in the field. A lot of people with eds are driven into nutrition/psychology/mental health nursing degrees/careers and it does not come from the right place. We're obsessed with food, it's expected that we'd go into a job that could focus on food, weight and eating disorders - we want our lives to revolve around it. It is about you, rather than the people you treat. \n\nI couldn't think of anything worse than having someone with lived experience of an ED treating me (unless it was a very long time ago) because I wouldn't trust their motive to be there.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1752908187.0, "datetime": "2025-07-19T06:56:27", "subreddit": "AnorexiaNervosa", "id": "n3yez3e", "text": "Unfortunately it only gets harder, I am 30. Had this since I was 15. I have never moved out of home, no relationships ever, I haven't been able to be a part of my friends' weddings, haven't been able to be more help to my friends with their newborn babies, haven't been able to do so many things because of my illness. It's so sad, and yeah, I am embarrassed too!", "parent_id": null, "link_id": null, "context": null}
