{"type": "comment", "timestamp": 1602689701.0, "datetime": "2020-10-14T15:35:01", "subreddit": "EatingDisorders", "id": "g8sz4aw", "text": "I want to say that it could be more than just an eating disorder. \n\nLast year I started starving myself due to stress. I was having normal days, and days where I had to force myself to choke down 200 calories. \n\nJust that light starvation triggered gallbladder failure for me. My symptoms were that I had no appetite and food nauseated me. I had mild nausea and was off put by food all the time. If I didn’t eat right when I was hungry that feeling would creep back in within an hour tops. \n\nThey really should see a regular doctor to check out what’s going on. Even if it’s not something physical causing the food avoidance, like in my case, they might be able to evaluate the potential eating disorder.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1602738353.0, "datetime": "2020-10-15T05:05:53", "subreddit": "EatingDisorders", "id": "g8vebb0", "text": "It’s hard to seek recovery. Especially if this is giving them a sense of control. \n\nThere are often free support groups you can find (less scary than a clinic) that is sort of like AA for eating disorders, but you don’t have to be in recovery to use them. Organizations like ANAD will do this various places. There’s a yoga therapy place by me that offers this. \n\nThe only problem is that would take them admitting the have and ED which it sounds like they might not be there yet.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1603811158.0, "datetime": "2020-10-27T15:05:58", "subreddit": "EatingDisorders", "id": "gaa1ay6", "text": "Yep. I ate relatively healthy pre-pandemic and felt good. Then the stress and isolation triggered binging and lethargy. I gained quite a bit and now all my clothes are tight. \n\nThat then triggered obsessive weighing and restricting/binge cycles. I’m a mess right now, but I’m taking steps to get back to a healthy place. I know I’m going to struggle now to not spiral into orthorexic behaviors. The struggle is real.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1606667864.0, "datetime": "2020-11-29T16:37:44", "subreddit": "EatingDisorders", "id": "ge1vstp", "text": "It’s not just the internet. I’ve struggled with various eating disorders for 15 years. Last year I starved myself so badly that my gallbladder failed and I had to have it removed. \nI was significantly overweight/obese when that episode occurred, and all I heard was how great I looked with the weight loss. Not only was I suffering from my eating disorder, but when my gallbladder started failing I was incapable of eating. I cried every day just wanting to eat. \n\nAnd I heard from probably 50 or more coworkers how amazing it was. **one person** said “... I hope everything is ok and this isn’t a health issue”. It felt so good to have at least someone recognize how irregular and unhealthy it appeared. ..and to confess that everything was not ok. \n\nI have PCOS and a thyroid disorder that cause difficulty losing weight and unexplained weight gain. Sometimes I’m ok and I can eat normal, but then gaining weight triggers me, so I relapse into restricting. Every time I get sick and start listening to my eating disorder, I am rewarded and praised. \n\nI’ve just started treatment for the first time, and I’m so scared that I will end up in a position where people stop complementing my body again. It sounds so shallow, but when you hate your body, it feels so good for others to complement it.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1606692890.0, "datetime": "2020-11-29T23:34:50", "subreddit": "EatingDisorders", "id": "ge3eua8", "text": "I’m working on it. I have a therapist and nutritionist that work together. I’m not supposed to count calories or measure/weigh food or myself. \nI have an app on my phone where I’m supposed to log 3 meals plus 3snacks per day. \n\nNot being able to have control over those things is really hard. I’ve been functioning this way for 20ish years, but I just can’t do it anymore.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1606840905.0, "datetime": "2020-12-01T16:41:45", "subreddit": "EatingDisorders", "id": "ge9u2om", "text": "Hey- I’m having similar symptoms/behaviors recently. I had actually been doing reasonably ok. I just started treatment/recovery a few weeks ago. Then Thanksgiving just fucked me up hard. Like a total nosedive. It’s really hard right now. \n\nI just wanted to say though. I’ve started working with a nutritionist as part of my recovery. I’ve been in the same boat a bit with my weight. I’m actually fairly overweight (thyroid and hormonal issues), but I just can’t lose even though I’m restricting/purging, etc. \nMy nutritionist told me that I have slowed my metabolism from the years of restricting, and that the solution is to eat enough and balance my metabolism. I told her my caloric goal, and she told me that it wasn’t enough for a 12 year old. I told her “well, if I eat normally it’s actually xxx calories higher than that”. She said that still wasn’t enough, and that my body thinks it’s going to starve, so I’m not losing weight. \n\nI highly recommend working with a nutritionist. It’s scary, but it could be helpful. I use an app with mine called recovery record, and we don’t measure food or count calories, but I can log a description of what I eat, and feelings/behaviors around the meal. Including skipping meals, binging, thoughts, etc. \n\nBest of luck! I hope you start to feel better soon. It’s a difficult journey, but I think recovery is worth it.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1606929124.0, "datetime": "2020-12-02T17:12:04", "subreddit": "EatingDisorders", "id": "gee0nrl", "text": "I put off recovery for 20 years because I felt like I wasn’t “sick enough” or it wasn’t a “real eating disorder”. You’re heading down a slippery slope and it’s a path that leads nowhere good. \n\nParticularly the sentence about trying to figure out how to purge stood out to me. The desire to purge is reason enough to talk to someone, but coupled with your other symptoms, this is the start of something dangerous.  These are problematic and disordered behaviors whether you meet diagnostic criteria for a “real” eating disorder or not. \n\nPlease reach out for help OP.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1606929384.0, "datetime": "2020-12-02T17:16:24", "subreddit": "EatingDisorders", "id": "gee1bbs", "text": "Real talk about the purging. I have had disordered habits for a long time (mostly heavy restricting)- about 20 years. \n\nJust a few weeks ago I started purging. Now it’s this urge that I can’t seem to fight. I’ve even started feeling nauseous when I eat like my body wants to reject food. Engaging in purging is the scariest symptom that has ever manifested for me, and I feel totally helpless and out of control. \n\nI am in treatment, and I hope I can get a hold of this soon, but purging has worn me down and made me hate myself more than anything I’ve ever experienced.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1607518239.0, "datetime": "2020-12-09T12:50:39", "subreddit": "EatingDisorders", "id": "gf5v5fo", "text": "TL;DR : Go to the doctor. \n\nSee a medical doctor and/or psychiatrist. A school counselor is not qualified to diagnose an eating disorder. Stress is only one of many medical conditions that could cause loss of appetite. You could certainly contact the eating disorder folks who could likely screen you, but I would get checked out for loss of appetite by a doctor first to rule out other conditions. \n\nTypically, traditional eating disorders are a mental health issue and would involve intentionally restricting, binging, purging or other disordered behaviors, rather than simply not feeling hungry. Now, if you’re toying with enjoying that feeling of emptiness or not wanting it to end, I would say you’d be catching a problem pretty early. \n\nI lost my appetite due to stress about a year ago. I was thrilled though, because I’ve always been overweight and had already severely restricted calories off and on for about 15 years to try and lose weight. After about 2.5 months on 200-600 calories per day, I had lost ~40lbs and my gallbladder was failing. I felt the worst I’ve literally felt in my life. I wanted to feel hungry but couldn’t and everything made me nauseous as soon as I tried to eat. So I didn’t. I put off medical care for the nausea for weeks, because despite how terrible it was I was so happy about not being able to eat. I liked that it forced me to starve with the level of commitment I’ve always wished for. \n\nAre you hesitant to seek medical care for stress or loss of appetite? Do you inwardly enjoy the weight loss or appetite changes? \nI would say to sit with those questions, but absolutely still see a doctor first and foremost.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1607774594.0, "datetime": "2020-12-12T12:03:14", "subreddit": "EatingDisorders", "id": "gfiinxz", "text": "Honestly it sounds like a really similar situation to where I was at mentally. This may not be you, but right around when I was dealing with the same stress related food issues, I was diagnosed bipolar. All my life I thought I had “depression and anxiety” when really I was having issues regulating my moods. Antidepressants and anxiety meds didn’t work for me and I thought they were bs. Then I went to a psychiatrist instead of a doctor and she immediately put me on mood stabilizers (lamictal). I still have episodes, but it’s much milder and the swings are less dramatic. \n\nSome telltale symptoms are mood swings, impulsivity that may cause harmful decisions (financial, sexual, relationships, etc- I shop when I don’t have money for example) and staying up for long stints without feeling tired. I’m in a manic episode rn and I’ve slept about 5 hours total in the last 4-5 days. \n\nAnyway I’m rambling. Check to see if your university has psychiatric services available, sometimes teaching hospitals will offer free or very cheap options. And good job. If this feels like a big step, then seeking help is definitely the right decision and therapy is a good idea for literally everyone. Good luck on your journey and feel free to pm if you have any other questions about my own experience.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1608460298.0, "datetime": "2020-12-20T10:31:38", "subreddit": "EatingDisorders", "id": "gggliec", "text": "What a shitty response to someone who is already feeling invalidated about their eating disorder. \n\nEveryone should have their medical concerns taken seriously regardless of how many steps away from death they might be.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1608505844.0, "datetime": "2020-12-20T23:10:44", "subreddit": "EatingDisorders", "id": "ggj2bsk", "text": "All kinds of treatment centers exist. I pay about $280/ month for treatment which includes my therapist, dietician, and overseeing physician. \n\nYou also don’t know how affected someone truly is. My BMI is in the overweight category and I lost my gallbladder because of starving myself last year. I read another story on Reddit where a woman about the same weight as me restricted on and off for less than a year and now has left ventricle failure. You never know how serious someone’s condition is, and if they are seeking treatment, no one here should discourage that. As you said, it’s already difficult for people to receive the care they need.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1608506183.0, "datetime": "2020-12-20T23:16:23", "subreddit": "EatingDisorders", "id": "ggj2yrf", "text": "This gives me hope. I just started treatment. I’m not underweight and I’m so scared of gaining in the process of stopping the binge/purge/restrict cycle.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1608698876.0, "datetime": "2020-12-23T04:47:56", "subreddit": "EatingDisorders", "id": "ggrohji", "text": "I’m having a very similar issue. I eat a much wider variety than you, but spent a long time eating only WFPB and have developed an aversion to protein in general. \n\nSome foods I’ve experimented with since entering recovery are eggs, dairy cheese (still can’t do milk for some reason though), and I had my first meat in 8 years yesterday (beef jerky). \n\nBasically, my nutritionist wants me to open myself up to it, but not force it. So if something like cheese on veggie burger sounds or looks good, I should try it. \n\nYour case might be a little more severe than mine, but tiny little steps and pushing myself to try things that scare me and challenge those thoughts is what really seems to be helping. \nBest of luck and feel free to hit me up if you need to chat with someone.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1608866602.0, "datetime": "2020-12-25T03:23:22", "subreddit": "EatingDisorders", "id": "ggyii7s", "text": "r/bingeeatingdisorder might have more kindred spirits. \n\nI will say this however- if you feel like the foods you eat when binging are bad or you feel bad about the binges, other than being uncomfortably full, you might be experiencing some type of shame around it. Do you feel pressure to watch what you eat or compensate for binges? If not that’s perfectly ok and does not invalidate what you’re dealing with. There’s not a competition for whose behavior is the most disordered.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1609121793.0, "datetime": "2020-12-28T02:16:33", "subreddit": "EatingDisorders", "id": "gh8xt56", "text": "This happened to me and I lost my gallbladder from the starvation. By the time I went to a gastroenterologist it had hardened part of my intestines. Please go to the doctor.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1609201787.0, "datetime": "2020-12-29T00:29:47", "subreddit": "EatingDisorders", "id": "ghcc0u9", "text": "I didn’t know either. I’ve always struggled with starving myself on and off even though I am overweight so I never took starving/calorie cutting seriously. \n\nThere is another story similar except the woman experienced left ventricle (heart) failure as a result. \n\nI hope you get some care! Wishing you well!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1610015789.0, "datetime": "2021-01-07T10:36:29", "subreddit": "EatingDisorders", "id": "gievp8h", "text": "Disclaimer: Blame is not my goal simply awareness of potential triggers. \n\nI was sneaking food, because my mother had already started trying to control my weight. Every snack I’d attempt to eat would be scrutinized or shut down, so I stopped wanting people to know that I ate at all. The thought of you installing cameras or locks literally made me cry. The thought of how wrong it would make her feel for following probably very urgent-feeling urges she’s having is very upsetting. \n\nYour post is self critical, which is fine, but I would say one step you can take is to not criticize your daughter’s weight or make her feel guilty or wrong for being hungry or in a larger body. Also she’s a teenager! Many young women gain weight at the outset of puberty.\n\nOne of the most detrimental things for my eating disorder was my mother doing these things:\n\nA. Making me feel wrong for having extra body fat\nB. Equating happinesses with weight/size\nC. Stopping me from having things I wanted. \nD. Constantly analyzing both what I was eating and the way my body looked. \n\nSome phrases as a 13 year old that were triggering for me “you’re really getting kind of heavy.” “That’s not something girls your size should wear” “The kitchen is closed! No more snacks!” “Why are you eating? You can’t possibly be hungry” “she can afford to eat that. You can’t”\n\nYou’re a wonderful parent for trying to understand and get ahead of this. I STRONGLY recommend the book Anti-Diet by Chrissy Harrison (for your understanding, it’s a bit dry for a 13 year old). My therapist recommended it to me. It covers a lot of things regarding weight stigma/psychological, efficacy of diets, the dangers of weight cycling vs staying heavier, etc. \n\nSomething to remember is this. It is not morally wrong to have a larger body. It is not morally superior to have a smaller body. Trying to treat an eating disorder with “a healthy diet” or further limiting access to foods can literally just shift the type/manifestation of the disorder. \nMy experience at 13 sounds very similar to your daughter’s. Shortly after the binging, I began restricting/anorexic behaviors. Since then, I’ve spent 20 years cycling between binging, anorexic, orthorexic, and bulimic behaviors. Having a young girl thinking there is something wrong with her body is a recipe for continued disordered eating.\n\nEvery young girl is bombarded with the message that she has to be thin to be worthy. Some people are genuinely just genetically larger bodied. Be one of the voices in her life to let her know that her body is fine at whatever size it is and that she should never be ashamed or guilty about her body.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1610062395.0, "datetime": "2021-01-07T23:33:15", "subreddit": "EatingDisorders", "id": "gihd8yq", "text": "I’m not underweight and I gained a tiny amount (I’ve fluctuated that much in a day!) at the outset of my recovery. My endocrinologist asked me about it. So I told him the nutritionist had me stop counting calories because I’m in treatment for an ED. He got very pushy telling me how caloric deficits work while I sobbed begging him to tell me how many calories to eat since x amount wasn’t allowing me weight loss. He got uncomfortable, couldn’t give me a number, made a random number up out of thin air to represent my BMR and then offered me appetite suppressant injections. It was very predatory. \n\nI’m switching providers obviously. He prescribed the injections and I’m proud to say I never filled the prescription.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1610167259.0, "datetime": "2021-01-09T04:40:59", "subreddit": "EatingDisorders", "id": "gimikhi", "text": "To me this is kinda like saying “my alcoholic gf wants to have a drink again? Is she recovered enough that it’s safe?”\n\nWeight control is addicting. Especially if she hasn’t been a gym person, this might feel like a new door opening up to her eating disorder. A new opportunity to change her body. \n\nI would suggest you try to shift the gym and diet practices away from consoling/shaping the body. Help her work out for strong musculoskeletal system and heart. Eat food so that you feel satiated and energized. \n\nIntentional weight loss for an anorexic in recovery is not the best of ideas. It sounds like while she’s eating normally at this point that she’s still not over the body acceptance piece yet, which is truly the heart of the disorder. \n\nWishing you and her health and happiness!", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1610206120.0, "datetime": "2021-01-09T15:28:40", "subreddit": "EatingDisorders", "id": "ginu5l0", "text": "Agreed. That was super triggering to read. :(", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1615803010.0, "datetime": "2021-03-15T10:10:10", "subreddit": "EatingDisorders", "id": "gqzxxbt", "text": "Are you open to learning to cook? You could pick a food you really like and learn to make it really well. Maybe pick one dish per week to try cooking. There are lots of excellent YouTube videos even for basics like how to boil water. \n\nAlso, fighting cravings doesn’t work. You will eventually cave. I’ve found that trying to hit the same craving with stuff at home helps me. I’m a sucker for fast food tacos. As soon as the craving hits, I’ll make some microwave burritos with some added cheese and hot sauce to make it satisfying. It hits that same craving for a high sodium spicy fast food style meal, but the burritos are $.40 each. If you just eat the thing you crave when the craving hits, you may find you eat less eventually because you’re satisfied more often. It’s the best way to stop the binge cycle even though it can be a little scary. Check out the book Intuitive Eating or The Anti-Diet. I cycle between restrictive and binge behaviors (as most of us do) and it’s like a pendulum. The more you pull over to trying to restrict your eating, the further it will swing in the binge direction.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1616351687.0, "datetime": "2021-03-21T18:34:47", "subreddit": "EatingDisorders", "id": "grq6a2o", "text": "From someone in recovery, this is great advice! Being open about vulnerabilities during those situations is incredibly helpful. \n\nHope you find your way to recovery in the future. <3", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1616352151.0, "datetime": "2021-03-21T18:42:31", "subreddit": "EatingDisorders", "id": "grq787q", "text": "Hi OP! I totally understand those thoughts, and our diet culture society reinforces them. \n\nI think that people are less concerned than you might believe about your weight. It is a big deal to you, because it is you. They will probably notice you look different if it’s a significant change, but I don’t think making fun of you would be the response you’d receive. In fact you may find that she feels more comfortable around you, because unfortunately, many women feel threatened by someone who is thinner than them. \n\nYou may also not realize that you probably also look happier and full of life. \n\nAt my sickest I wasn’t really thin, but it was thin for me. When I entered recovery, I gained some weight. I am what some people would consider “overweight” at this point, and my boyfriend has told me how much healthier and vibrant I look. My skin, hair, nails. My smile, my lower stress, etc. \n\nYou are so much more than your weight, and many people will be able to see those things. If she can’t see past it or holds it against you in some way it is because they are fatphobic and can’t properly cope with those feelings. That is not on you and the body you live in. That is on her and her own insecurities.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1619306737.0, "datetime": "2021-04-24T23:25:37", "subreddit": "EatingDisorders", "id": "gvrg1h6", "text": "Have you heard of intuitive eating? The root of binging is actually restricting. Think of it like a pendulum. If we restrict during the day, the pendulum will swing the other way and trigger a binge because you’re not feeding yourself enough. People think they’re “uncontrollable” but really our body is just trying to protect us.\n\nPerhaps check out the book intuitive eating be Elise Resch and Evelyn Tribole. Or check out Anti-Diet by Christy Harrison. The IE book focuses more on the process while Anti-diet focuses a little more on the science behind weight loss/gain, dieting, and intuitive eating. \n\nAll that being said. “Healthy” intentional weight loss has never been shown to be possible or effective long term in any scientific study. Each time we lose weight our body adjusts to prevent it in the future, so people are just weight cycling (yo-yoing) 98% of the time. Around 2% of people can keep weight off by being religious about maintaining restricting behaviors. \nThat is not to say weight loss doesn’t happen naturally. If you neutralize your relationship to food, you can find your body’s stable weight (though it may be higher than what you’d like).  \n\nI’d recommend repairing your relationship to food and your body rather than trying to lose weight and “stop binging”. I know several folks with BED that have found recovery only by giving up dieting and eating whatever their body asked for.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1619307318.0, "datetime": "2021-04-24T23:35:18", "subreddit": "EatingDisorders", "id": "gvrh3p9", "text": "I recommend a dietician trained in eating disorders and intuitive eating. I have a lot of baggage when it comes to food and that type of dietician almost works like a counselor to talk you through food-specific issues. \n\nLike I wasn’t eating frequently enough during the day which was making me eat a lot more during meals and binge at night.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1619318281.0, "datetime": "2021-04-25T02:38:01", "subreddit": "EatingDisorders", "id": "gvs0svz", "text": "It’s really hard. I have never eaten correctly either. I have had issues with dieting, starvation, binge eating and purging for about 22 years. \n\nIntuitive eating was terrifying and incredibly difficult in the beginning. I’ve been at it about 5 months and am finally starting to feel relaxed around food. \n\nWhen you don’t feel like there’s scarcity around food (mentally or physically) that last supper mentality you mentioned starts to go away and you don’t feel like you have to “get it while you can”. \n\nI definitely recommend seeking a professional though. It sounds like you have a lot to deal with around food.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1619373810.0, "datetime": "2021-04-25T18:03:30", "subreddit": "EatingDisorders", "id": "gvuaffz", "text": "I know it’s hard. I lost my Gallbladder due to starvation and then lost even more. It was the worst I had felt in my life. Like every day I was literally dying and wanted to eat and couldn’t. \n\nMy mom would not stop gushing about it. I stayed with her overnight for 2 days after my gallbladder removal and she kept saying “oh my god. Look at you! You barely even have a tummy. “ or something of that nature about every 3 hours while there. If I’m honest, her acting that way along with how I felt while sick, and my feelings about my body still being negative even after losing a ton is what made me seek recovery. \n\nI have gained a good portion of the weight back, but I’m also much happier and freer now. More mental clarity and room for other thoughts, more time for myself, and less hating myself. It’s extremely difficult but so worth it. \n\nI strongly recommend you seek help from a professional skilled with eating disorders and trauma.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1622995747.0, "datetime": "2021-06-06T16:09:07", "subreddit": "EatingDisorders", "id": "h0t2dbm", "text": "This is true. Eating disorders are extremely competitive by nature.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1626978555.0, "datetime": "2021-07-22T18:29:15", "subreddit": "EatingDisorders", "id": "h65n3wx", "text": "I want to add to what OP said and just say that if you decide to recover, slip-ups can happen still. I sometimes engage in a behavior that is not aligned with my recovery and instead of saying “guess I’ll go back to being sick” I say “I did x behavior, this is how it felt. I still want recovery for these reasons” and try to move on. \n\nBasically, recovery doesn’t have to be all or nothing. You can step forward and back and keep moving toward healing gradually. Folks with EDs can get stuck in an all or nothing mindset, but recovery isn’t all or nothing. Somedays are harder than others and sometimes I screw up, but either way I try my best each day to make choices that support my goals.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1626978574.0, "datetime": "2021-07-22T18:29:34", "subreddit": "EatingDisorders", "id": "h65n5hv", "text": "Congrats OP! That is amazing.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1628036458.0, "datetime": "2021-08-04T00:20:58", "subreddit": "EatingDisorders", "id": "h7matua", "text": "Oof can we not have numbers? I gained much more and this was a tad triggering for me, and I’m pretty stable in recovery.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1630671764.0, "datetime": "2021-09-03T12:22:44", "subreddit": "EatingDisorders", "id": "hbfsa6b", "text": "I think it’s hard to explain the specific feelings or fears that come with it, and they’re very individualized.\n\nSomething I’ve had success with is telling people that it’s basically like ocd with food. I think people tend to understand that example because it helps them realize that it’s not a rational decision. It’s compulsive and ritualized rather than a strategic choice.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1651715635.0, "datetime": "2022-05-05T01:53:55", "subreddit": "EatingDisorders", "id": "i7dgij7", "text": "No joke. Breakfast was the key to really getting recovered for me", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1670211995.0, "datetime": "2022-12-05T03:46:35", "subreddit": "EatingDisorders", "id": "iyymyuj", "text": "I understand how hard it can be to feel like you’re going to be judged by a friend. \n\nI’ve had a friend with ED history compliment me when I was at my lowest and as people with EDs we know that others with EDs are prone to notice due to the constant comparing that happens. Well I recovered and I gained quite a bit of weight. I mentioned to her that I was having a hard time with the weight and she said “I just see you. My best friend.” \n\nIf your friend knows you have ED history and has an ED herself, then she knows encouraging you to not listen to hunger signals and to try and lose weight is harmful. If she’s knowingly inflicting harm, I might ask myself whether it’s healthy to spend time with that person. \n\nYou definitely should see a doctor so you can be well. If you are athletic, I assume you’d like to continue doing sports. \nWhen we don’t eat enough, our body will breakdown muscle. The heart is a muscle, and one you might like to keep in good health so you can keep doing the things you enjoy.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1677812057.0, "datetime": "2023-03-03T02:54:17", "subreddit": "EatingDisorders", "id": "japin3h", "text": "EDs are not weight disorders. They are primarily behavioral disorders that (sometimes) manifest physical side effects. \n\nLeft untreated they can worsen over time. Having negative body thoughts and a strained relationship with food is enough to warrant seeking some help. The fact that you’re asking here means you know something isn’t right with how you’re feeling. It’s ok to get help before it gets serious rather than waiting. Especially when you’re in a sport that can strain your relationship with food further. \n\nJust something to think about.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1679245231.0, "datetime": "2023-03-19T17:00:31", "subreddit": "EatingDisorders", "id": "jcubuix", "text": "Congrats on your progress! One day everything will be allowed. This is the road to more and more freedom ❤️", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1680732327.0, "datetime": "2023-04-05T22:05:27", "subreddit": "EatingDisorders", "id": "jf3z8js", "text": "Wishing you lots of love and peace as you go through this. I really appreciate you posting this too. I don’t think things like organ failure gets talked about enough in ED spaces, and it is kind of you to share this part of your experience with this community. \n\nPeople have a tendency to think “but I’m not sick enough for this to happen” but you are. You are sick enough, and even if you’re not underweight, things like this can happen as a result of an ED. \nPlease take your disorder seriously, folks.", "parent_id": null, "link_id": null, "context": null}
{"type": "comment", "timestamp": 1692189198.0, "datetime": "2023-08-16T12:33:18", "subreddit": "EatingDisorders", "id": "jwf7kze", "text": "Congrats on school and your progress with recovery. How wonderful that you got to enjoy and share these treats with your dad!\n\nOne of the things I most enjoy about recovery is being able to enjoy the social aspect of eating again. 💜", "parent_id": null, "link_id": null, "context": null}
